{"organizations": [], "uuid": "8d97caeb74d7dd97c864134fcb1533e053a008cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/raghuram-rajan-rbi-ep-GS-S1.jpg", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/rbi-guv-raghuram-rajan-slams-imf-for-applauding-easy-money-policies/153617", "country": "IE", "title": "RBI Guv Raghuram Rajan blasts IMF for being soft on easy money policies of West", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "RBI Guv Raghuram Rajan blasts IMF for being soft on easy money policies of West | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T01:25:00.000+03:00", "replies_count": 0, "uuid": "8d97caeb74d7dd97c864134fcb1533e053a008cc"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/rbi-guv-raghuram-rajan-slams-imf-for-applauding-easy-money-policies/153617", "ord_in_thread": 0, "title": "RBI Guv Raghuram Rajan blasts IMF for being soft on easy money policies of West", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles 'Mobile banking may overtake internet banking in 2-3 years' Banking reforms initiated, says PM Narendra Modi: Top 5 points to note RBI to provide more bank licences, says S S Mundra Reserve Bank of India ( RBI ) Governor Raghuram Rajan today took his umbrage against the accommodative monetary policies of the developed nations to the doors of the IMF and blamed it for remaining a sideline player and even praising such polices which are wreaking havoc in emerging markets.\nMultilateral lenders like IMF must look out for and contain the spillover effects of the near-decade long easy flow of hot money, he said.\nHis comments are significant as the Governor, who was a chief economist at the Fund earlier, is slated to address the IMF meeting next month in Turkey.\n“The International Monetary Fund is supposed to look at these (easy money polices) in a global sense, but the IMF has been sitting on the sidelines, and even applauding these kinds of policies ever since they were initiated and hasn’t really questioned the value of these kinds of policies,” Rajan said.\nThere were rumours that Rajan is looking for the top job at the Fund post the RBI stint. But he denied the rumours.\nAddressing an event on G-20 consultation meeting, organised by the foreign policy think tank Gateway House, Rajan was quick to add that he was “not pointing finger at any central bank. We haven’t got mandates for the world. And I want to argue that we are in a world that nothing prevents these kinds of policies. There is nobody looking at them.”\nExplaining his position further the Governor, who has for long been critical of the ultra-loose money policies of the Western nations and had gone public with his criticism thrice in recent past, said though the IMF does spillover studies, “these spillover studies invariably say this is good for that country and therefore good for the whole world. So I think we need to examine these issues.”\nRajan admitted that across the world central banking mandates are domestic, as “no central bank has a mandate for the world. Its mandate is purely domestic…what are you going to do to elevate employment and growth.\n“It has to worry about the world only at second level… if I do something which creates problems for another country and as a result demand from that country falls off from my country’s, I should take that into account. I don’t care if I destroy the other country completely, so long as it doesn’t import from me I am okay. That kind of domestic mandate is actually in every country.”\nAs a way out he called for political mandate and consensus to ensure better coordinated monetary policies.\n“We need a political consensus to go beyond domestic mandate in this integrated world where the monetary policy affects each other. It may be a sensible way to move forward,” the monetary economist-turned-central-banker said.\nRecalling crises in Mexico, the Southeast Asia currency crisis, and the Argentine and the Brazilian crises, he said these were the spillover results of the low interest policies of the major economies in the 1990s as they tried to revive their banks post the emerging market crisis of the 1980s.\nCalling for a better multi-lateral lending system to insulate the emerging and developing markets from the vulnerabilities of capital flight, Rajan said there is an urgent need to strengthen the existing multi-lateral system.\n“Given that we have capital flows and certainly it’s very hard to separate good from bad (money), we probably need a global safety net to ensure that those who accept capital and who use it have liquidity protection in case the capital runs out.\n“Typically, the IMF is supposed to do such kind of activities. But unfortunately, because of the past history, certainly in Asia and to some extent in Latin America, there is an enormous stigma in going to the IMF. That is why countries in these regions are developing regional arrangements rather than going to multilateral institutions,” Rajan said.\nTalking about deflation, Rajan said there is a very strong fear, especially in the US given its historical experience in the 1930s, that if deflation takes hold then we will have a Japan-like experience and will have to write-off 15-20 years of growth.\n 19, 2015 5:25 pm", "external_links": [], "published": "2015-10-20T01:25:00.000+03:00", "crawled": "2015-10-20T00:07:43.093+03:00", "highlightTitle": ""}