{"organizations": [], "uuid": "9b492b9b5921d04b5bc66a791c07b180292712d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arabianbusiness.com", "main_image": "http://www.arabianbusiness.com/incoming/article534667.ece/BINARY/uae_money.jpg", "site_section": "http://www.arabianbusiness.com//industries/banking-finance/?service=rss", "section_title": "Arabian Business - Banking & Finance", "url": "http://www.arabianbusiness.com/uae-forecast-see-62-rise-in-millionaires-by-2020-609375.html", "country": "US", "title": "UAE forecast to see 62% rise in millionaires by 2020", "performance_score": 0, "site": "arabianbusiness.com", "participants_count": 0, "title_full": "UAE forecast to see 62% rise in millionaires by 2020", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T08:32:00.000+03:00", "replies_count": 0, "uuid": "9b492b9b5921d04b5bc66a791c07b180292712d6"}, "author": "", "url": "http://www.arabianbusiness.com/uae-forecast-see-62-rise-in-millionaires-by-2020-609375.html", "ord_in_thread": 0, "title": "UAE forecast to see 62% rise in millionaires by 2020", "locations": ["UAE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UAE forecast to see 62% rise in millionaires by 2020 Article By Staff writer Friday, 23 October 2015 9:32 AM \nThe UAE is forecast to see a 62 percent increase in the number of its millionaires over the next five years, according to the 2015 edition of Credit Suisse's Wealth Report. \nCredit Suisse said the number of millionaires in the UAE, currently ranked 16th globally, is set to increase from 59,000 in 2015 to 96,000 in 2020. \nSaudi Arabia, ranked 17th in the Credit Suisse report, will also see a big jump in the number of millionaires - up from 50,000 in 2015 to 86,000 in 2020, a 72 percent growth. \nThe report added that the Middle East and North Africa countries currently have an estimated 330,000 millionaires, up by more than 240 percent since 2000. \nThe number of millionaires is projected to rise by another 52 percent to 500,000 by 2020, the report said. \nQatar topped the Gulf region in relation to highest average wealth per capita, with wealth of $157,000 per adult in mid-2015, up 0.8 percent from the same period last year. \nThe UAE was ranked second among the GCC countries with average wealth per adult of $144,400, down by 0.3 percent compared to last year. Kuwait’s wealth per adult also fell 7.6 percent from last year to reach $113,400. \nAverage wealth per adult for the MENA region as a whole fell by 6.9 percent to $15,800 in mid-2015, from $16,900 in mid-2014. \nIn terms of total wealth, Saudi Arabia ranked first among GCC economies, with an estimated total wealth of $0.7 trillion, followed by the UAE with an estimated wealth of $0.6 trillion. \nThe report said global inequality has grown since the financial crisis and the richest 1 percent now own half of all household wealth in the world. \nSo much of the world remains relatively poor that it has taken a net worth of just $3,210 this year to be among the wealthiest half of all world citizens, it said.", "external_links": [], "published": "2015-10-23T08:32:00.000+03:00", "crawled": "2015-10-23T10:10:24.325+03:00", "highlightTitle": ""}