{"organizations": [], "uuid": "d7e344eda85b4a154da04ba2da18f53fc0389dd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=VLO", "section_title": "Yahoo! Finance: VLO News", "url": "http://finance.yahoo.com/news/midcoast-energy-partners-top-midstream-100302768.html", "country": "US", "title": "Midcoast Energy Partners: Top Midstream MLP Gainer on October 19 - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Midcoast Energy Partners: Top Midstream MLP Gainer on October 19 - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "d7e344eda85b4a154da04ba2da18f53fc0389dd0"}, "author": "Kurt Gallon", "url": "http://finance.yahoo.com/news/midcoast-energy-partners-top-midstream-100302768.html", "ord_in_thread": 0, "title": "Midcoast Energy Partners: Top Midstream MLP Gainer on October 19 - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Midstream and Upstream MLP Gainers and Losers on October 19 \nTop gainers Midcoast Energy Partners (MEP) was the top gainer among midstream MLPs at the end of trading on Monday, October 19. It rose 5.9%.\n\nMidcoast Energy Partners With yesterday’s gain, Midcoast Energy Partners’ YTD (year-to-date) returns improved to -13.6%. It was formed by Enbridge Energy Partners (EEP) to own and grow its natural gas and NGL (natural gas liquid) midstream business in the US. Both of the partnerships are part of Enbridge (ENB). Currently, Midcoast Energy Partners operates the following two businesses:\nnatural gas gathering, processing, and transportation logistics and marketing For an in-depth analysis of Midcoast Energy Partners’ recent operating and market performance, read Midcoast Energy Partners’ YTD Returns Exceed Industry Average .\nPBF Logistics PBF Logistics (PBFX) is next on our list of the top midstream MLP gainers. It rose 3.4% on October 19. It has returned -0.47% YTD. PBF Logistics was formed by PBF Energy (PBF) to own, operate, develop, and acquire crude oil and refined products terminal, storage, pipeline, and other logistics assets.\nOther gainers The next three MLPs on the list of the top five midstream MLP gainers on October 19 are Boardwalk Pipeline Partners (BWP), Valero Energy Partners (VLP), and Spectra Energy Partners (SEP). They rose 0.70%, 0.67%, and 0.51%, respectively. They have returned -27.3%, 14.2%, and -23.6% YTD.\nValero Energy Partners’ solid YTD market performance is due to its strong distribution growth and coverage ratio. Its 2Q15 distribution grew by 31.5% YoY (year-over-year) compared to 1Q14. Its coverage ratio for 2Q15 was 2.17x. Read Energy MLPs: How Did 6 Logistics Subsidiaries Perform in 2Q15? for a comparative analysis of six US logistics subsidiaries, including VLP.\nThe Alerian MLP ETF (AMLP) and the Yorkville High Income MLP ETF (YMLP) lost 1.1% and 1.4% yesterday, respectively. Spectra Energy Partners accounts for 2.2% of AMLP. For context, the upstream energy company heavy SPDR S&P Oil & Gas Exploration & Production ETF (XOP) lost 3.7% on the same day.\nContinue to Next Part \nBrowse this series on Market Realist: \nPart 2 - JP Energy Partners: Top Midstream MLP Loser on October 19 Part 3 - Legacy Reserves: Top Upstream MLP Loser on October 19 Oil, Gas, & Consumable Fuels Enbridge Energy Partners", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T15:52:06.907+03:00", "highlightTitle": ""}