{"organizations": [], "uuid": "e3a1c8dba323efbbc0878f86da9a50d64f2234d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30224840/assuredpartners-acquires-wilson-h-flock-insurance-inc", "country": "US", "title": "AssuredPartners Acquires Wilson H. Flock Insurance, Inc.", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "AssuredPartners Acquires Wilson H. Flock Insurance, Inc. - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:01:00.000+03:00", "replies_count": 0, "uuid": "e3a1c8dba323efbbc0878f86da9a50d64f2234d2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30224840/assuredpartners-acquires-wilson-h-flock-insurance-inc", "ord_in_thread": 0, "title": "AssuredPartners Acquires Wilson H. Flock Insurance, Inc.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Northeastern Pennsylvania-based commercial insurance agency\nLake Mary, FL (PRWEB) October 09, 2015\nAssuredPartners of New Jersey has acquired Wilson H. Flock Insurance, Inc. based out of Wyoming, PA. The agency specializes in coverage for individuals, businesses, and life insurance products. Wilson H. Flock Insurance, Inc. reports approximately $1.4 million in revenues.\n“Our agency started over 70 years ago in a small office on Wyoming Avenue,” said Bill Flock. “Now we are excited to partner with an agency with offices and resources nationwide that will enhance our commitment of providing the best to our clients.”\n“This team has worked hard to provide clients with sound insurance protection and prompt, professional service, which are values that will stay in place.” said Tom Riley, President and COO of AssuredPartners, Inc. “We welcome the Wilson H. Flock Insurance, Inc. staff and clients to AssuredPartners.”\nAs part of the acquisition, 14 Flock employees will join AssuredPartners. For more information about Wilson H. Flock Insurance, Inc., please visit: http://www.flockinsurance.com .\nABOUT ASSUREDPARTNERS, INC\nHeadquartered in Lake Mary, Florida and led by Jim Henderson and Tom Riley, AssuredPartners, Inc. acquires and invests in insurance brokerage businesses (property and casualty, employee benefits, surety and MGU’s) across the United States and in London. From its founding in March of 2011, AssuredPartners has grown to $500 million in annualized revenue and continues to be one of the fastest growing insurance brokerage firms in the United States* with over 120 offices in 30 states and a London office. Since 2011, AssuredPartners has acquired more than 110 insurance agencies. For more information, please contact Dean Curtis, CFO, at 407.708.0031 or dcurtis(at)assuredptr(dot)com, or visit http://www.assuredptr.com .\n*As ranked by Business Insurance in the July 20, 2015 edition, featuring the “100 largest brokers of U.S. business.”\n###\n //www.prweb.com/releases/2015/10/prweb13011495.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13011495.htm"], "published": "2015-10-09T18:01:00.000+03:00", "crawled": "2015-10-10T07:17:02.953+03:00", "highlightTitle": ""}