{"organizations": [], "uuid": "cf12247676429700448940e70bbbe30ffff23e60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iba01HxwF8ZY/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-14/fed-division-china-deflation-risk-and-u-k-unemployment-falls-what-people-in-markets-are-talking-about", "country": "US", "title": "Fed division, China deflation risk and U.K. unemployment falls, what people in markets are talking about", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Fed division, China deflation risk and U.K. unemployment falls, what people in markets are talking about - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:00:00.000+03:00", "replies_count": 0, "uuid": "cf12247676429700448940e70bbbe30ffff23e60"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-14/fed-division-china-deflation-risk-and-u-k-unemployment-falls-what-people-in-markets-are-talking-about", "ord_in_thread": 0, "title": "Fed division, China deflation risk and U.K. unemployment falls, what people in markets are talking about", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Division at the Federal Reserve, Chinese deflation risks and the U.K. jobless rate at its lowest since 2008. Here are some of the things people in markets are talking about today.\nFed division Federal Reserve Governor Daniel Tarullo has added to division at the central bank , saying that he doesn&apos;t currently favor raising rates in 2015, echoing comments from fellow-Governor Lael Brainard on Monday . Though the comments from the two governors put them at odds with Fed Chair Janet Yellen, the market agrees with them as market-based indicators put the chances of a rate rise this year at less than 35 percent.\nChinese deflation risks Consumer inflation increased 1.6 percent in September, down from 2 percent in August and below a 1.8 percent median estimate in a Bloomberg survey. China&apos;s producer-price index fell 5.9 percent, extending its streak of negative readings to 43 months. The Shanghai Composite Index ended the session 0.9 percent lower , and the yuan extended yesterday&apos;s drop against the dollar.\nU.K. unemployment Unemployment in the U.K. has unexpectedly dropped to 5.4 percent , the lowest level since mid-2008. Wage growth excluding bonuses slowed to 2.8 percent from 2.9 percent. With inflation falling into negative territory , real wage growth in the U.K. is the highest it has been since before the financial crisis.\nDemocratic candidates debate Wall Street In yesterday&apos;s Democratic candidate debate leading contenders Bernie Sanders and Hillary Clinton clashed over who had the tougher plan to rein in Wall Street, with Sanders promising more taxes for the rich and Clinton proposing jail terms for executives, if needed.\nComing up... Retail sales data for the U.S. will be released at 8:30 a.m. ET, with strong September auto sales data leading to expectations of 0.2 percent headline growth. Excluding auto and gas, retail sales are expected to rise 0.3 percent. Following from JPMorgan results after the bell yesterday, Bank of America reports at 7:00 a.m. ET and Wells Fargo reports at 8:00 a.m. ET\nWhat we&apos;ve been reading This is what&apos;s caught our eye over the last 24 hours.\nUBS sees sovereign assets shrinking by $1.2 trillion by year end. It&apos;s quantitative easing, Europe, but not as we know it . $50 dollar oil is not what scares Bank of Russia Governor Nabiullina. These three trends are changing the energy market forever. Goldman declares death of global Philips curve exaggerated. M&A surge may shake credit market dynamics off balance. The 19-hour flight is coming back. Want to receive this post, and more, into your inbox every morning? Sign up here", "external_links": ["http://link.mail.bloombergbusiness.com/join/4wm/markets-signup&hash=b9b2681361bede0e1069ca238efb1ec2\\"], "published": "2015-10-14T19:00:00.000+03:00", "crawled": "2015-10-14T14:03:27.085+03:00", "highlightTitle": ""}