{"organizations": [], "uuid": "fa76b9014c242de95b1b525fec63ab846fd69dbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30160451/cubic-awarded-contract-to-develop-live-virtual-constructive-system-for-air-combat-training", "country": "US", "title": "Cubic Awarded Contract to Develop Live, Virtual, Constructive System for Air Combat Training", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Cubic Awarded Contract to Develop Live, Virtual, Constructive System for Air Combat Training - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T16:01:00.000+03:00", "replies_count": 0, "uuid": "fa76b9014c242de95b1b525fec63ab846fd69dbd"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30160451/cubic-awarded-contract-to-develop-live-virtual-constructive-system-for-air-combat-training", "ord_in_thread": 0, "title": "Cubic Awarded Contract to Develop Live, Virtual, Constructive System for Air Combat Training", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cubic Global Defense to deliver secure and realistic combat training to U.S. Air Force\nSan Diego, Calif. (PRWEB) October 01, 2015\nCubic Global Defense (CGD), a business unit of Cubic Corporation ( NYSE: CUB ), today announced the award of a multi-year contract by the Air Force Research Lab (AFRL) 711th Human Performance Wing to develop and demonstrate a Live, Virtual, Constructive (LVC) system for air combat training. The award is part of the larger program called the Secure LVC Advanced Training Environment (SLATE) Advanced Technology Demonstration (ATD).\nAFRL formed the SLATE ATD team as a government/industry consortium since each partner leverages unique expertise or key system understanding to support the overall ATD objectives. Cubic is designated the Systems Integrator working with partners to deliver LVC airborne and ground subsystems. While the overall purpose of blending synthetic environments with live training in an LVC system is to enhance realism and improve the cost-effectiveness of training, the specific intent of the SLATE ATD is to prove technological feasibility and assess operability and producibility of LVC subsystems. Cubic and the SLATE partners plan to develop and demonstrate an LVC system at Technology Readiness Level 7.\n“We are very proud to be a part of this esteemed consortium in developing what will be one of the most important training technologies of our time,” said Bill Toti, president of Cubic Global Defense. “Cubic invented Air Combat Maneuvering Instrumentation (ACMI) back in the early 70’s and we see LVC as the natural evolution of ACMI. LVC will provide an increased threat density, wider expanse of virtual airspace and an interoperable multi-level secure environment where pilots can ‘train as they fight’ with their advanced sensor and weapons systems in the highest fidelity environments.”\nThe overall approach in the SLATE ATD will be to employ fourth-generation aircraft with modified ACMI airborne subsystems repurposed for multi-level encrypted LVC, in both tethered and untethered training scenarios. The team will also evaluate extensibility of the technical solutions to the F-35 Joint Strike Fighter. After successful demonstrations, the ATD will deliver specifications, use cases and technologies that can be used to support an LVC acquisition program.\nWork on the SLATE ATD will be performed in San Diego, Wright-Patterson Air Force Base, Dayton, Ohio and other various locations. The final flight training exercise demonstration is expected to be conducted at Nellis Air Force Base near Las Vegas, Nevada.\n# # #\nAbout Cubic Corporation\nCubic Corporation designs, integrates and operates systems, products and services focused in the transportation, defense training and secure communications markets. As the parent company of two major business units, Cubic’s mission is to increase situational awareness and understanding for customers worldwide. Cubic Transportation Systems is a leading integrator of payment and information technology and services to create intelligent travel solutions for transportation authorities and operators. Cubic Global Defense is a leading provider of realistic combat training systems, secure communications and networking and highly specialized support services for military and security forces of the U.S. and allied nations. For more information about Cubic, please visit the company's website at http://www.cubic.com or on Twitter @CubicCorp.\nMedia contact:\nLaura Chon\nCorporate Communications\nCubic Corporation\nPH: 858-505-2181\nlaura.chon(at)cubic(dot)com\n //www.prweb.com/releases/2015/10/prweb12996403.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb12996403.htm", "http://www.cubic.com/Global-Defense", "https://www.nyse.com/quote/XNYS:CUB"], "published": "2015-10-01T16:01:00.000+03:00", "crawled": "2015-10-02T07:42:38.372+03:00", "highlightTitle": ""}