{"organizations": [], "uuid": "28bb0cdec8c70d9a00a0676d7af1b9c85285da68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/bR1_le3KD2DFlQFi3x0Ecw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_AP_HEADLINES_BUSINESS/243ff42d1b5d952c830f6a70670031ec_original.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/us-auto-sales-show-big-203140242.html", "country": "GB", "title": "US auto sales show big gains, except at Volkswagen - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "US auto sales show big gains, except at Volkswagen - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 1, "uuid": "11d0729ee3c5160e426c7dcc5753418fcab7835b"}, "author": "Dee-Ann Durbin and Tom Murphy, AP Business Writers", "url": "http://finance.yahoo.com/news/us-auto-sales-show-big-203140242.html#post-0", "ord_in_thread": 0, "title": "US auto sales show big gains, except at Volkswagen - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nFILE - In this March 14, 2014, file photo, an assembly line worker builds a 2015 Chrysler 200 automobile at the Sterling Heights Assembly Plant in Sterling Heights, Mich. Fiat Chrysler's U.S. sales jumped 14 percent in September 2015, helped in part by another strong month from the carmaker's Jeep brand. (AP Photo/Paul Sancya, File) \n\n\nDETROIT (AP) -- September was a blockbuster sales month for the U.S. auto industry — except at Volkswagen, where an emissions scandal forced the company to halt sales of most of its diesel-powered vehicles.\nStrong consumer demand, easy credit and generous incentives combined to fill dealer showrooms. The industry sold 1.44 million cars and light trucks last month, up 15.8 percent from a year ago.\nFord's U.S. sales grew 23 percent in September, Nissan surged 18 percent and Fiat Chrysler's U.S. sales jumped nearly 14 percent. Sales at General Motors rose 12 percent, while Toyota posted a 16 percent gain. Honda's sales were up 13 percent.\nAnalysts had expected big increases because Labor Day was included in September this year versus August a year ago. Labor Day weekend is typically one of the biggest sales periods of the year, as dealers offer discounts to clear cars off their lots before the new model-year vehicles arrive.\nThe Volkswagen brand struggled after Sept. 18, when the U.S. government revealed that nearly 500,000 VW and Audi diesels sold in the U.S. had software that let them cheat on emissions tests. Volkswagen halted sales of 2015 and 2016 diesel models of the Passat, Jetta, Golf and Beetle.\nRight now, the scandal appears to only be hurting only the German automaker. VW's sales were up less than 1 percent over last September. Diesels accounted for just 11.7 percent of the company's total sales, compared with the usual 20 percent.\nThe U.S. market has remained a bright spot for automakers as the Chinese economy slows. China is still the No. 1 market globally, but sales there were up just 2.6 percent in the first eight months of the year. U.S. sales grew nearly 4 percent in that time period.\n\"The economy still has room to grow and so do auto sales, particularly now that the (millennials) are entering the workforce and starting households,\" said GM's chief economist, Mustafa Mohatarem, in a statement from the company.\nThere is some concern that the momentum could cease if an impasse in contract talks between the Detroit automakers and the United Auto Workers isn't resolved soon.\nKarl Brauer, a senior analyst with KBB, said sales could drop significantly if automakers and the UAW can't come to an agreement on new contracts for GM, Ford and Fiat Chrysler. It wouldn't take long for a strike at their U.S. plants to crimp vehicle availability. On Thursday, the union said Fiat Chrysler's factory workers rejected a proposed contract; 65 percent of workers voted against it.\nHere are more details of automakers' September sales, which were released Thursday:\n— There was a bright spot for Volkswagen. Its luxury Audi brand — which has one model, the A3, involved in the scandal — saw sales climb 16 percent and said September was a record month for the brand in the U.S. Sales of Audi's big SUVs like the Q5 and Q7 were strong, and A3 sales rose 16 percent.\n— General Motors Co. sold 251,310 cars and trucks. Total Chevrolet sales rose 11 percent, and the company said GMC had its best September since 2004.\n— Ford sold 221,599 vehicles, with its F-Series pickup truck — the top-selling vehicle in the country — climbing 16 percent to more than 69,000 trucks. Ford's Lincoln luxury brand notched a 20 percent sales increase thanks to new SUVs.\n— Toyota sold 194,370 vehicles. Prius hybrid sales rose 12 percent despite relatively low gas prices, while RAV4 SUV sales jumped 18 percent.\n— Fiat Chrysler sold more than 193,000 vehicles for its best September since 2000. Jeep sales rose 40 percent, offsetting slower growth elsewhere. Sales for the company's Ram and Dodge brands climbed 4 percent and 3 percent, respectively.\n— Honda sold 133,750 vehicles. The CR-V small SUV set a monthly record, with sales up 26 percent to nearly 30,000.\n— Nissan sales rose to 121,782, helped by a 30 percent increase for its Infiniti luxury brand.\n___\nMurphy reported from Indianapolis.\nConsumer Discretionary Volkswagen Fiat Chrysler General Motors", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T00:07:36.802+03:00", "highlightTitle": ""}