{"organizations": [], "uuid": "4d10b0faa6096caedc1708a8b48515c90fae9337", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KQ731_iran10_G_20151007073027.jpg", "site_section": "http://www.wsj.com/public/page/news-personal-finance.html", "section_title": "Personal Finance &amp; Money - Planning, Budgeting, Investment, Services, News - Wsj.com", "url": "http://www.wsj.com/articles/irans-supreme-leader-bars-further-talks-with-u-s-1444220022", "country": "", "title": "Iran’s Supreme Leader Bars Further Talks With U.S.", "performance_score": 2, "site": "wsj.com", "participants_count": 28, "title_full": "Iran’s Supreme Leader Bars Further Talks With U.S. - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T04:54:00.000+03:00", "replies_count": 27, "uuid": "0b78e198631008c397c1a2cbce5d9d5e3e3163ee"}, "author": "Aresu Eqbali", "url": "http://www.wsj.com/articles/irans-supreme-leader-bars-further-talks-with-u-s-1444220022#post-0", "ord_in_thread": 0, "title": "Iran’s Supreme Leader Bars Further Talks With U.S.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "227 COMMENTS Iran’s Supreme Leader Ayatollah Ali Khamenei on Wednesday barred direct negotiations with the U.S., saying America would use them to undermine the Islamic Republic.\nENLARGE In a picture made available by his official website, Iran’s Supreme Leader Ayatollah Ali Khamenei (c) is shown during a graduation ceremony of naval cadets in the city of Noshahr in northern Iran on Sept. 30, 2015. Photo: European Pressphoto Agency Since Iran and six major world powers led by the U.S. reached a landmark deal in July to limit Tehran’s nuclear program in exchange for lifting of international economic sanctions, there has been widespread speculation that the accord would serve as a springboard to tackle crises in Syria and Iraq, among other regional issues.\nOn Wednesday, Mr. Khamenei scoffed at the notion of talks with Washington of any kind, saying nothing positive would emerge from them for Iran.\n“Negotiation with the U.S. is banned because of the countless harms it inflicts,” the supreme leader’s official website Quote: d him as saying. “Besides, [negotiation] has no advantage, either. We are against negotiations with the U.S. because talks with the U.S. mean infiltration. They want to open the way for imposition.”\nMr. Khamenei didn’t indicate whether the ban on talks with the U.S. would affect implementation of the nuclear deal.\nIran is a key ally of Syrian President Bashar al-Assad, providing his regime with vital military and financial support as it fights an array of rebel groups seeking to oust him, including Islamic State. Shiite militias fighting the Sunni Muslim extremist group in Iraq also received aid from Iran.\nSince negotiations on a nuclear accord began in earnest in late 2013, Mr. Khamenei frequently criticized the U.S., in an apparent attempt to reassure his ultraconservative political base that no deal with West would alter the Islamic Republic’s foundations.\nJust days after the agreement was struck in Vienna on July 14, Mr. Khamenei, who has final say over matters of state, said Iran would continue to regard the U.S. as a foe.\nIn the wake of deal, Mr. Khamenei said it wouldn’t open the door for the U.S. to impose on Iran politically, economically and culturally.\nIranian-U.S. ties have been frozen since the Islamic Revolution in 1979 that forced the shah of Iran, a close American ally, to flee into exile.\nRelations worsened further in the tumultuous days following the shah’s departure and the establishment of republic, when Iranian activists took hostage 52 American diplomats and citizens and held them for 444 days until their release.\nIn his comments Wednesday, Mr. Khamenei said the U.S. found ways during the nuclear talks to “infiltrate” Iran and had acted against Iranian interests. He offered no details.\nWrite to Asa Fitch at asa.fitch@wsj.com", "external_links": ["http://si.wsj.net/public/resources/images/BN-KQ731_iran10_M_20151007073027.jpg", "http://si.wsj.net/public/resources/images/BN-KQ731_iran10_J_20151007073027.jpg", "http://si.wsj.net/public/resources/images/BN-KQ731_iran10_P_20151007073027.jpg"], "published": "2015-10-08T04:54:00.000+03:00", "crawled": "2015-10-08T04:35:20.835+03:00", "highlightTitle": ""}