{"organizations": [], "uuid": "2e6671696c1399fdb51cc4507dd30ab03c1f8664", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/02/12995798/IHH2015Honorees.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/10/prweb12995798.htm", "country": "US", "title": "The Elfenworks Foundation Presented $25,000 Award to Three Social Entrepreneurs Social Good", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "The Elfenworks Foundation Presented $25,000 Award to Three Social Entrepreneurs for Social Good", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "2e6671696c1399fdb51cc4507dd30ab03c1f8664"}, "author": "Binay Curtis", "url": "http://www.prweb.com/releases/2015/10/prweb12995798.htm", "ord_in_thread": 0, "title": "The Elfenworks Foundation Presented $25,000 Award to Three Social Entrepreneurs Social Good", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last evening, the Elfenworks Foundation announced the recipients of the 9th Annual In Harmony with Hope Awards: a group of social entrepreneurs who are promoting conflict resolution and collaborative change among youth, providing mentor-driven financial literacy training to low-income youth, and re-integrating homeless individuals into society. The celebration and theme emphasized writing new stories of hope, as honorees were presented with individual cash prizes of $25,000 at the Kohl Mansion in Burlingame, CA. Over the past nine years, Elfenworks has awarded $675,000 to 27 social entrepreneurs who are working to create sustainable change in America through the In Harmony with Hope Award. For the fifth year, Wells Fargo contributed $10,000 in support of the program. The event featured special guest Master of Ceremonies, acclaimed actor Elijah Kelley. He is known for his work in The Butler, Red Tails, and Hairspray, and will be starring in NBC's production of The Wiz Live!\nThe 2015 In Harmony with Hope Award honorees are as follows:\nRose Broome, co-founder and CEO of HandUp , a technology solution that allows people to donate directly to homeless neighbors in need. Ted Gonder, co-founder and CEO of Moneythink , a movement of young people working to restore the economic health of the United States through financial education. Eric Dawson, co-founder and President of Peace First , an organization focused on creating the next generation of peacemakers.\nFor more information on the 2015 In Harmony with Hope Award winners, visit the Elfenworks Foundation web site or email publicist(at)elfenworks(dot)org.\nAbout Elfenworks “In Harmony with Hope”: Elfenworks works for hope in America by fostering creative and technology solutions that advance change. Elfenworks identifies chasms, creates change, and amplifies success, whether cultivating thousands of student social justice filmmakers in partnership with Campus MovieFest, promoting peace initiatives, assisting nonprofits safely navigate IT security, or helping people cope with stress through the Breathing Butterfly project. Visit http://www.elfenworks.org/ripple for big and small ways to make a difference.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tb25leXRoaW5rLm9yZw==", "http://www.elfenworks.org/ripple", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5lbGZlbndvcmtzLm9yZw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wZWFjZWZpcnN0Lm9yZw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9oYW5kdXAub3Jn", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5lbGZlbndvcmtzLm9yZy9yaXBwbGU="], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T11:19:47.869+03:00", "highlightTitle": ""}