{"organizations": [], "uuid": "304d5c9971ee90f90b45ef61fa34efec2c50be69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/o/v/q/z/image.related.afrArticleLead.620x365.gjn70q.png/1444276769745.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/boss/psychopaths-narcissists-just-part-of-working-life-in-the-21st-century-20150915-gjn70q", "country": "AU", "title": "Psychopaths, narcissists just part of working life in the 21st century", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Psychopaths, narcissists just part of working life in the 21st century | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T21:00:00.000+03:00", "replies_count": 0, "uuid": "304d5c9971ee90f90b45ef61fa34efec2c50be69"}, "author": "Amy Wilson-Chapman", "url": "http://www.afr.com/brand/boss/psychopaths-narcissists-just-part-of-working-life-in-the-21st-century-20150915-gjn70q", "ord_in_thread": 0, "title": "Psychopaths, narcissists just part of working life in the 21st century", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Andrew Furnham's book Backstabbers and Bullies may help you deal with any psychopaths and narcissists in your workplace. Nic Walker by Amy Wilson-Chapman We've all worked with one, or for one, and it's not fun.\nThe over-zealous leader who thinks s/he knows better than everyone, doesn't need your advice and probably only delegates tasks they can maintain control of.\nMaybe your boss comes across as smooth and polished, but can often be caught out lying to … well, anyone really. And then there is the quiet up-and-comer, who subtly froths over workplace gossip and is ever-so-quietly climbing the greasy corporate ladder. But did they eventually fall from grace? (I know, you probably didn't stick around long enough to find out.) Well the good news is, they probably did.\nPSYCHO OR NOT? TAKE OUR QUIZ TO FIND OUT Graphic Backstabbers and Bullies may overpromise and, for the most part, underdeliver (I've dubbed it print's version of click bait – proof it's not a new phenomenon for online media). But, if you can get past the academic-scholarly tone, Adrian Furnham explains (in painstaking detail) how the qualities we admire are unfortunately the ones that can bring people down.\n\"Incompetence is not a curious and rare phenomenon in the world of management – it is more often the rule rather than the exception,\" he writes.\nIn one table – which spans three pages! – Furnham shows that early strengths, such as being ambitious and tough on laggards, can soon turn into being overambitious, needing no one else and lacking composure.\nHe stresses the importance of \"regular, clear, honest communication\" among managers. He suggests any personality disorders are underlined by a lack of self-awareness and an inability to make meaningful, healthy relationships outside work.\n So, that really nice boss you have, who appears to have no friends or life outside work? Perhaps it's time to be wary.\nFurnham argues that the changing pace of today's workforce – where we constantly shift jobs without anyone blinking an eye – is helping to produce more workplace psychopaths than before.\nHe highlights 10 characteristics of a psychopath so you can get the picture of what to look for.\nHe also tackles narcissistic leaders – the charismatic, self-interested types – who are a \"major contributing factor to the dysfunctional workplace\". But he couches it in an interesting discussion on the impact of low and high self-esteem, and the way workplaces react to both. Do we breed narcissism?\nHelpful tips Potentially the most useful of Furnham's tips is the four ways to work with narcissists, because unfortunately … we all have.\nAnd although his in-depth account may have you wondering if you're paranoid, narcissistic, potentially a psychopath, he has some helpful lessons at the end.\nLike this one: \"At various times in a work career, people have to learn to let go of old, odd, dysfunctional assumptions and beliefs and behaviours. Furthermore, they need to acquire new skills and ideas.\"\nOften [these] mean exposing oneself to learning situations that can be threatening and which may involve failing,\" he writes. Simple, right?\nHe also suggests ensuring people climb the greasy success pole in a methodical way as an important part of ensuring the good attributes don't turn into the bad ones.\nCoaching, mentoring and developing new skills can help people to build resilience and self-awareness, and in turn keep them on the rails.\nIn all seriousness though, if you want to make sure you never hire a management dud or get hired by a psychopath it's a pretty good read. Just skip over the five-page tables and maybe pick the chapters most relevant to you.\nLike Boss on Facebook . Follow Boss on Twitter . Join the LinkedIn conversation.", "external_links": ["https://www.facebook.com/AFRBoss", "https://twitter.com/AFRBoss", "http://www.bloomsbury.com/au/backstabbers-and-bullies-9781472915528/", "https://www.linkedin.com/groups/BOSS-Magazine-4971364", "https://sasha-project.s3.amazonaws.com/afr-prod/2015/09sep/psychopath_test/index.html", "https://sasha-project.s3.amazonaws.com/afr-prod/archive/iframeresizer/iframeResizer.min.js"], "published": "2015-10-07T21:00:00.000+03:00", "crawled": "2015-10-09T00:38:05.589+03:00", "highlightTitle": ""}