{"organizations": ["Tunisie Telecom", "Draft Finance Law At Seat of Tap News Agency"], "uuid": "a34b3bf558e2be5c36910310da2fe11144b64d2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510250080.html", "country": "US", "title": "Tunisia: Measures of Finance Bill 2016 \"Bold\" but \"Insufficient\", Say Experts", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Tunisia: Measures of Finance Bill 2016 \"Bold\" but \"Insufficient\", Say Experts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T11:45:00.000+02:00", "replies_count": 0, "uuid": "a34b3bf558e2be5c36910310da2fe11144b64d2f"}, "author": "", "url": "http://allafrica.com/stories/201510250080.html", "ord_in_thread": 0, "title": "Tunisia: Measures of Finance Bill 2016 \"Bold\" but \"Insufficient\", Say Experts", "locations": ["UTICA", "Tunis", "Germany", "Tunisia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joudi", "Hattab", "Moez Joudi", "Mourad Hattab"], "text": "Tunisia: Round-Table Meeting On 2016 Draft Finance Law At Seat of Tap News Agency Tunis — Experts present at the roundtable meeting held by TAP news agency on the \"Finance Bill 2016,\" agreed that the draft law contains \"bold and reforming\" measures but \"insufficient\" to meet the challenges of the Tunisian economy. Economist Moez Joudi said the tax burden in Tunisia, estimated at nearly 21%, is considered as the highest in the world which reduces consumption and blocks investment. \"The state is forced to increase spending,\" he said, noting that the payroll alone receives 13 billion dinars of the state budget and accounts for 13.6% of GDP. He spoke of the high number of public service employees, saying it has reached 750 thousand (for a population of nearly 11 million), compared with 800 thousand in Germany which has a population of 80 million), Joudi recommended streamlining public spending through developing a specific programme, calling on the government to open a national dialogue with social partners (UGTT, UTICA, civil society and experts) to reconsider the issue of the public service that has to balance spending and productivity. On bankrupt public companies, he suggested their partial or total privatisation, as it was the case with \"Tunisie Telecom\" and \"Magasin Général\". Regarding the reduction in oil prices by 20 and 50 millimes, Joudi said \"this will directly or indirectly benefit consumers.\" The expert, however, expressed concern about the increase in the budget deficit to record levels between 7% and 8% while the international average is 3%. Financial risk expert, Mourad Hattab noted that the hypotheses on which is based the draft state budget for 2016 are \"realistic and achievable.\" He said the 2.5% growth goal could be achieved through the different reforms initiated at all levels. Hattab said the state budget was developed on the basis of \"accurate\" and \"reasonable\" estimates of the oil barrel price (55 dollars) and exchange rate of the dollar (1.970 dinar). He, however, noted that the country's foreign currency reserves may decline and impact on the exchange rates which will be volatile and could lead to a rise in prices of raw materials. Regarding the debt service that will be around 8,000 MTD in 2017 against 5,130 MTD in 2016, the expert described it as \"exaggerated,\" especially since the overall debt rate is estimated now at 54.8% of GDP. He called for the need to re-adopt the concept of \"citizen budget\" to simplify information for citizens and uphold transparency, recalling that this concept was implemented only one year. Tunisia \nTwo men have died in custody recently in Tunis under suspicious circumstances in separate incidents. Relatives of both … see more » Copyright © 2015 Tunis Afrique Presse. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,600 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-25T11:45:00.000+02:00", "crawled": "2015-10-25T18:36:41.705+02:00", "highlightTitle": ""}