{"organizations": [], "uuid": "9c9be689fec6df67aa07c38d858a001cc1279b57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l1.yimg.com/bt/api/res/1.2/mfB4s8qDN2O0Um2kfPzTCA--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-12T161010Z_1_LYNXNPEB9B0S9_RTROPTP_3_VOLKSWAGEN-EMISSIONS_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/vw-says-sold-first-uk-161010530.html?l=1", "country": "GB", "title": "VW began selling cars in UK with cheat software in 2008: boss", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "VW began selling cars in UK with cheat software in 2008: boss - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "9c9be689fec6df67aa07c38d858a001cc1279b57"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/vw-says-sold-first-uk-161010530.html?l=1", "ord_in_thread": 0, "title": "VW began selling cars in UK with cheat software in 2008: boss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nA Volkswagen logo stands next to a CCTV security camera in Wolfsburg, Germany October 7, 2015. REUTERS/Axel Schmidt By Costas Pitas\nLONDON (Reuters) - Volkswagen (VOWG_p.DE) first sold cars in Britain equipped with software that could cheat emissions tests in 2008, its UK boss said on Monday, but he shed little light on the root cause of the scandal.\nEurope's largest automaker has admitted rigging diesel emissions tests in the United States, and Germany's transport minister says it also manipulated them in Europe.\nThe company's UK managing director said that, while it first began selling cars in the country equipped with so-called defeat devices around seven years ago, he only became aware of such software last month. \n\"I knew nothing about this subject until 19 September this year, when I first heard it on the news from the United States,\" Paul Willis told a committee of British lawmakers.\nThe scandal is the biggest crisis in Volkswagen's 78-year history. It has wiped more than a third off the German company's share price, forced out its long-time CEO and prompted investigations around the world.\nVolkswagen's U.S. chief executive told American lawmakers last week that the rigging of tests was not a company decision but the result of actions by a small number of engineers.\nUK boss Willis said he thought it was implausible that senior officials at Volkswagen knew about the test-rigging. \nHe apologized to customers and said the brand needed to rebuild trust, but when asked technical details about the software and engines, he said: \"I'm not an engineer.\" \n\"My role in the United Kingdom is in sales, marketing, distribution and finance,\" he said. \"The department that looks after the engines, the technical development of Volkswagen, I have no direct relationship with that,\" he added.\nWillis said the carmaker would discuss contributing toward the cost of retesting vehicles in Britain. \nBritain's transport minister Patrick McLoughlin later told the lawmakers he did not believe other companies making cars in Britain were rigging emissions tests, but that he had yet to receive responses from some carmakers to letters he had sent on the issue.\n\n(Refiles to restore missing word in first paragraph.) \n\n(Reporting By Costas Pitas; Editing by Pravin Char)\nSingapore International News Volkswagen", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T05:48:00.180+03:00", "highlightTitle": ""}