{"organizations": [], "uuid": "b8cd754d1c404b210221bcdb684dfb69988d3bc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30203486/associated-announces-organizational-changes-aimed-at-creating-the-ultimate-customer-experience", "country": "US", "title": "Associated Announces Organizational Changes Aimed at Creating the Ultimate Customer Experience", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Associated Announces Organizational Changes Aimed at Creating the Ultimate Customer Experience - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T11:01:00.000+03:00", "replies_count": 0, "uuid": "b8cd754d1c404b210221bcdb684dfb69988d3bc6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30203486/associated-announces-organizational-changes-aimed-at-creating-the-ultimate-customer-experience", "ord_in_thread": 0, "title": "Associated Announces Organizational Changes Aimed at Creating the Ultimate Customer Experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Associated Announces Organizational Changes Aimed at Creating the Ultimate Customer Experience\nAddison, IL (PRWEB) October 07, 2015\nAssociated and its subsidiary, Peach State Integrated Technologies Inc., both leaders in providing integrated supply chain solutions, announced today the creation of a new position that will focus on their primary goal of providing the ultimate customer experience.\nThis newly created position, Manager of Customer Advocacy, is responsible for ensuring that the needs of their customers are met and exceeded in every transaction by developing, implementing, evaluating and managing programs and processes designed to promote the Company’s standards for a superior customer experience.\nLisa Everly has been named to this new position. Lisa joined Associated in November 2005 as the Accounts Receivable/Credit Manager and accepted the additional responsibilities of Accounts Payable Manager in March 2012. During her tenure with the company she has demonstrated an unwavering passion for providing a high level of customer service in every transaction.\nWhen asked about this position Mike Romano, Associated President/CEO said, “Continuing to forge long term relationships remains the lifeblood of our company and the focus of our Team. Although we believe that our team members go to work every day to ensure the needs of our customers are met, we also acknowledge that our pursuit to provide the ultimate customer experience is never over. In order to continue to evolve as an organization we need to have resources dedicated to continually improving the customer experience”.\nThe foundation of this position is to collect feedback from stakeholders and provide Associated Team Members with the tools, experience and training to ensure their customers receive an unmatched customer experience. They are excited about the value and insight this position will bring to the organization.\nAbout Associated:\nCelebrating over 50 years of providing customers with innovative solutions that optimize space, labor and order fulfillment operations within their supply chain, Associated understands that handling materials in the supply chain should be more than material handling. By utilizing their unparalleled experience and industry best practices they are able to evaluate current methods and processes for storage, order fulfillment, labor and equipment utilization and recommend practical strategies to enhance their effectiveness and reduce overall cost. Featuring leading-edge engineering, fleet management and labor optimization services to compliment industry-leading sales, service, rentals and parts, Associated has been the recipient of multiple awards in recognition of being a premier organization in the industry.\nAbout Peach State:\nFounded in 1975, Peach State Integrated Technologies Inc. ( http://www.peachstate.com ) is a professional services firm that provides strategic supply chain consulting and automated material handling solutions for their global clients. Their dedicated team of consulting and engineering professionals design and deliver distribution and manufacturing solutions that increase productivity, reduce cost, mitigate risks and improve customer service.\n####\nFor additional information about Associated, visit the company website at http://www.associated-solutions.com or call (800) 755-7201.\nPublisher note - Send reader responses to:\nAssociated\nAttn: Debbie Tworek\n133 North Swift Road\nAddison, IL 60101\nPhone: 630-588-3572\nFax: 630-588-8815\ndtworek(at)associated-solutions(dot)com\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/10/prweb13002787.htm\nInformation contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13002787.htm"], "published": "2015-10-07T11:01:00.000+03:00", "crawled": "2015-10-08T10:29:39.932+03:00", "highlightTitle": ""}