{"organizations": [], "uuid": "6b9601bd2ffcf6c7c71c93aad886ce84e1eb561b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.therepublic.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/fit-in/1200x630/filters:fill(white)/cdn1.therepublic.com/tr_assets/images/TheRepublic-Icon-2048x2048.jpg", "site_section": "http://www.therepublic.com/feed/subject/523699d088e910048f41f8851349f9bd", "section_title": "Government finance News from TheRepublic.com", "url": "http://www.therepublic.com/view/story/247ed31bd9754b1b81569509a624503c/CT--Connecticut-Budget", "country": "US", "title": "Connecticut governor calls for bipartisan talks on budget", "performance_score": 0, "site": "therepublic.com", "participants_count": 0, "title_full": "Connecticut governor calls for bipartisan talks on budget", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T21:34:00.000+03:00", "replies_count": 0, "uuid": "6b9601bd2ffcf6c7c71c93aad886ce84e1eb561b"}, "author": "", "url": "http://www.therepublic.com/view/story/247ed31bd9754b1b81569509a624503c/CT--Connecticut-Budget", "ord_in_thread": 0, "title": "Connecticut governor calls for bipartisan talks on budget", "locations": ["Connecticut"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Connecticut governor calls for bipartisan talks on budget amid need for deeper cuts \nTHE ASSOCIATED PRESS Published: 10/19/15 2:34 pm EDT - Updated: 10/19/15 2:34 pm EDT \nHARTFORD, Connecticut — With new projections showing a $120 million budget shortfall, Gov. Dannel P. Malloy on Monday called for talks involving top Democrats and Republicans that could lead to a special legislative session later this year to revise the budget. \nThe gap in the budget was identified by the Office of Policy and Management after the governor already had made roughly $100 million in cuts to the $20 billion annual budget. \n\"More hard decisions are going to have to be made, and I'm here to say we should make them together,\" said Malloy, a Democrat. \nMalloy blamed stock market losses for the drop in state revenues. \nNext week, the governor said, he will lay out his priorities for spending and cuts. He said he is asking leaders of both parties in the General Assembly to come ahead with their own proposals. He said bipartisan talks, if successful, could lead to a special session. \nRepublican leaders said in response that they stand ready to join discussions, but they argued the budget itself was deeply flawed from the start. Senate Minority Leader Len Fasano and House Republican Leader Themis Klarides urged a thorough reassessment of the budget in a special session. \n\"We need structural changes, tax reform, a constitutional transportation lock box, among other real changes to affect a more positive economic picture for Connecticut's future,\" Fasano and Klarides said. \nThey also said Republicans had been asking month after month for the past year to be included in budget talks and that their warnings of worsening financial problems were ignored. \nHouse Speaker Brendan Sharkey, a Democrat, said Republicans have suggested only raising property taxes and cutting spending on infrastructure. \n\"If they are serious, like they claim, about wanting to be part of a solution, we welcome their participation, but one - they need to commit to and stay throughout negotiations, two - they need to come with real, specific ideas, and three - bring their votes,\" Sharkey said. \nThe $102 million in cuts announced already by the governor affect hospitals and human service programs. Advocates warn the reductions will harm vulnerable people who need services such as mental health treatment and homeless shelters. \n   ", "external_links": [], "published": "2015-10-19T21:34:00.000+03:00", "crawled": "2015-10-19T22:22:52.427+03:00", "highlightTitle": ""}