{"organizations": ["Fidelity"], "uuid": "e8b3d21bf4295351529f43e936daa0c367f12d50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/i41pgt6ffa_2734652522692_3247138290252.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/650084/1/fidelity-holds-1st-draw-of-save-for-gold-promo.html", "country": "US", "title": "Fidelity holds 1st draw of 'Save for Gold' promo", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Fidelity holds 1st draw of 'Save for Gold' promo", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T04:06:00.000+03:00", "replies_count": 0, "uuid": "e8b3d21bf4295351529f43e936daa0c367f12d50"}, "author": "", "url": "http://www.modernghana.com/news/650084/1/fidelity-holds-1st-draw-of-save-for-gold-promo.html", "ord_in_thread": 0, "title": "Fidelity holds 1st draw of 'Save for Gold' promo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  19 October 2015 02:06 CET Fidelity holds 1st draw of 'Save for Gold' promo By Myjoyonline.com \nFidelity Bank in collaboration with the National Lotteries Authority has announced 17 lucky customers as winners of the first monthly draw of the Bank’s ‘Save for Gold’ promotion. \nThe draw, which happens to be the first of six in the entire promotion, took place at the Golden Tulip Hotel in Kumasi. \nIn a breathtaking draw, Evelyn Biney of Lapaz branch of the bank was announced the first winner with three Gold coins as her prize. \nDavid Ahiable of Ashaiman branch came second with two gold coins, fifteen other winners including Reindorf Yemoh Odoi of Airport Branch, Wisdom Ofori-Attah of Hohoe, and Ivy Yeboaa Adjei of Nkawkaw post branch won a gold coin each. \nAddressing the audience, Mr. Jim Baiden, Deputy Managing Director of Fidelity Bank touched on the relevance of savings and how it is a core objective of the Bank to help customers save for future plans. \n“At Fidelity Bank, we believe in the culture of savings to achieve one’s goal and also as a fall back plan for a rainy day. We continually encourage our customers in particular and the general public to cultivate the habit of saving consistently towards achieving their plans and securing the future of their loved ones,” he said. \nExplaining why Fidelity is rewarding customers with Gold prizes instead of other products, Mr. Baiden noted that “Fidelity Bank believes in giving the consumer the purchasing power to decide what they want to do with their prizes. \n“With this Promotion, we are giving lucky customers the opportunity to win the precious mineral-Gold because with a Gold coin or Gold bar, one can keep for investment purposes or convert into cash for other purposes such as expand their businesses, build their dream houses, buy their dream cars, fund their children’s education, embark on a dream vacation among others”. \nMr. Jim Baiden congratulated all 17 winners of the first draw and encouraged Ghanaians to participate in the promo to stand a chance of winning. \nHon. Kojo Bonsu, Metropolitan Chief Executive of Kumasi, acknowledged Fidelity Bank’s efforts in encouraging savings among the Ghanaian populace. He shared his excitement and readiness to participate in the promo. “Many have seen this Save for Gold Promo but have not seen a 1 kilogram Gold bar before. I will open an account with Fidelity Bank and hope that I win or somebody from Kumasi wins the ultimate prize, 1 kg 24 carat Gold bar”. He lauded Fidelity Bank for having 11 branches in Kumasi alone and urged them to open more branches in Kumasi to boost employment. \nHe thanked Fidelity Bank for choosing Kumasi for the maiden draw and wished participants the very best in the promo. \nMr. Baiden used the Dinner Draw platform to express the Bank’s appreciation to customers of Fidelity Bank in Kumasi. “This evening’s event has been organized with you in mind to honour and celebrate you our cherished customers in Kumasi for banking with us and to say a big thank you for the special way you have impacted our business. It has been a pleasure to have served you these past years and we look forward to more rewarding years together”. \nThe Fidelity Bank Save for Gold promo was launched in August 2015. It is running till February, 2015. There are 4 more monthly draws and a grand draw to be held with over GHC500, 000 worth of Gold prizes up for grabs. Business & Finance Follow Us The degree of your obedience to God’s words is the direct measure of your love for Him. By: Esther T.", "external_links": [], "published": "2015-10-19T04:06:00.000+03:00", "crawled": "2015-10-19T03:49:38.484+03:00", "highlightTitle": ""}