{"organizations": [], "uuid": "14ff9fe344e39b1000e8ed6cf90182fbbcdbcd08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/j/a/d/h/image.related.afrArticleLead.620x365.gk8pol.png/1444787588617.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/world/chinas-inflation-weaker-than-expected-20151014-gk8pol", "country": "AU", "title": "China's inflation weaker than expected", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "China's inflation weaker than expected | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T09:53:00.000+03:00", "replies_count": 0, "uuid": "14ff9fe344e39b1000e8ed6cf90182fbbcdbcd08"}, "author": "Angus Grigg", "url": "http://www.afr.com/news/world/chinas-inflation-weaker-than-expected-20151014-gk8pol", "ord_in_thread": 0, "title": "China's inflation weaker than expected", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The weaker than expected inflation reading came after Tuesday's mixed reading on trade. Bloomberg by Angus Grigg\nConsumer prices in China rose less than expected in September, in another piece of bad economic news for the world's second biggest economy.\nThe National Bureau of Statistics said on Wednesday the Consumer Price Index rose at an annual rate of 1.6 per cent, the slowest pace since July.\nThe reading was below expectations of a 1.8 per cent rise and was significantly slower than the 2 per cent rise during August.\nThe news was equally bad for China's vast manufacturing sector, which remains locked in a deflationary cycle.\nThe Producer Price Index, a measure of wholesale prices, dropped at an annual rate of 5.9 per cent in September, in line with expectations.\nIt was the 43nd consecutive monthly decline for the PPI, indicating weakness in the export sector but also chronic over-capacity in the country's manufacturing sector.\nThe NBS attributed part of the PPI's decline to the falling price of oil and other commodities.\n The weaker than expected inflation reading came after Tuesday's mixed reading on trade .\nChina's Customs Bureau said exports were down 1.1 per cent in September compared to the same time last year. This was better than expectations of a 7 per cent decline.\nImports were weaker than expected however, declining 17.7 per cent in September from a year earlier.\nIt was the third month in succession where Chinese exports were negative and the 11th month in row for imports.\nA rare bright spot in the trade data was an apparent stabilisation of China's imports of iron ore, even as the economy slows.\nThe Customs Bureau said iron ore imports surged 16.2 per cent to 86.1 million tonnes in September from a month earlier, notching up their best monthly performance in nearly two years.\nFor the first nine months of the year import volumes were flat.\nThis is weak by historical standards, but far better than earlier forecasts that China's iron ore import volumes could fall as much as 10 per cent this year.\nAustralia supplies nearly two thirds of China's imported iron ore.\nChina's imports of coal are not holding up as well, with volumes falling 30 per cent over the first nine months of the year.", "external_links": ["http://www.stats.gov.cn/english/"], "published": "2015-10-14T09:53:00.000+03:00", "crawled": "2015-10-14T12:06:50.188+03:00", "highlightTitle": ""}