{"organizations": [], "uuid": "e783506e07d2a368f01fd654361716e0f3ec876c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l.yimg.com/bt/api/res/1.2/A1S1NfrheCdZ_za423yieg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-09T131145Z_1_LYNXNPEB980PM_RTROPTP_3_USA_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/lockhart-still-sees-2015-rate-131145292.html?l=1", "country": "GB", "title": "Fed's Lockhart still sees 2015 rate hike despite recent red flags", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Fed's Lockhart still sees 2015 rate hike despite recent red flags - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 10, "uuid": "1c856a7d1cf3de70060d4cf8e13fc73f1b429642"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/lockhart-still-sees-2015-rate-131145292.html?l=1#post-0", "ord_in_thread": 0, "title": "Fed's Lockhart still sees 2015 rate hike despite recent red flags", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nDennis Lockhart, President, Federal Reserve Bank of Atlanta, takes part in a panel discussion at the Milken Institute Global Conference in Beverly Hills, California May 1, 2012. REUTERS/Danny Moloshok By Jonathan Spicer\nNEW YORK (Reuters) - A U.S. interest rate hike is still probably coming in October or December despite some conflicting economic signals, a top Federal Reserve official said on Friday, reinforcing the central bank's message over the last few weeks.\nAtlanta Fed President Dennis Lockhart, a well-respected centrist and a voter on the Fed's monetary policy committee this year, said an international slowdown and last month's weak U.S. jobs report show there is \"a touch more downside risk\" to the U.S. economy.\nTherefore, he said, the Fed will need to monitor the strength of the consumer in coming weeks and months to decide whether to go ahead with the first rate hike in nearly a decade when policymakers meet Oct. 27-28 and again on Dec. 15-16.\n\"The economy remains on a satisfactory track and ... I see a (rate) liftoff decision later this year at the October or December FOMC meetings as likely appropriate,\" Lockhart said of the policy-making Federal Open Market Committee. \n\"However the data are giving off varied signals, and there is more ambiguity in the current moment than a few weeks ago,\" he added at a Society of American Business Editors and Writers conference. This \"calls for especially diligent monitoring of incoming data with particular attention to consumer activity.\" \nIn a relatively close call, the central bank held off on a rate hike last month in the face of a slowdown in China and elsewhere, financial market turbulence and falling commodity prices. All of those could keep U.S. inflation below target.\nSince then, disappointing September jobs growth has caused investors to sharply discount an October rate hike, and to give a December move about a 40 percent probability, based on futures markets.\nLockhart, who once expected a rate hike around mid-2015, noted that the Fed would have more information on inflation, the labor market and consumer activity by December. But he kept a move in October on the table.\n\"I hope to avoid the trap of letting one or two months' specific data overly influence my outlook for the economy overall,\" he said. \"The ambiguity of the moment reinforces the need to closely watch the vital signs of the economy over the coming weeks to determine if the outlook has changed.\" \nBudget, Tax & Economy Federal Reserve", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T23:57:11.786+03:00", "highlightTitle": ""}