{"organizations": [], "uuid": "f8814073e4cbb377261499636ed696f928be4601", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/02/yourpractice-fed-advisers-idUSL1N1212KW20151002", "country": "US", "title": "YOUR PRACTICE-Fed spurs borrowing, savings strategies", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "YOUR PRACTICE-Fed spurs borrowing, savings strategies | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T16:00:00.000+03:00", "replies_count": 0, "uuid": "f8814073e4cbb377261499636ed696f928be4601"}, "author": "Hilary Johnson", "url": "http://www.reuters.com/article/2015/10/02/yourpractice-fed-advisers-idUSL1N1212KW20151002", "ord_in_thread": 0, "title": "YOUR PRACTICE-Fed spurs borrowing, savings strategies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 2 Now that the U.S. Federal Reserve has held back again on interest rates, advisers are taking advantage of attractive financing options before that window begins to close.\nMortgaging property when rates are low is well-known advice. But unprecedented transparency by the central bank about its goals and rate expectations means that advisers are in a unique position to plan borrowing strategies, said Chris Bilton, a Chicago-based adviser for Bank of America Corp's Merrill Lynch unit.\n\"We can plan a lot more precisely,\" Bilton said, \"We can map out what we think we can earn on investments, versus what we think long-term debt will cost. It's the first time in history that we've been able to do that,\" Bilton said.\nCentral bank policymakers have been saying they expect to tighten in December, after holding the federal funds rate at the current 0 to .25 percent range. They also showed that most expect the funds rate to top 3 percent by 2018.\nMeanwhile, 30-year fixed mortgage rates are hovering just under 4 percent, according to data from Bankrate.com.\nNot surprisingly, clients want to know if now is the time to move, refinance or buy a vacation home, Bilton said.\n\"Without a doubt, the answer is yes,\" Bilton said.\nIn fact, now is \"as good a time as we're going to see,\" said, Joe Heider, founder of Cirrus Wealth Management in Cleveland, agreed.\nWhat's more, not all clients must stick to traditional mortgages, Heider said. The highest net worth clients can also use shorter-term lines of credit against their securities, at rates of around 1.5 percent. On assets that yield at least 3 percent after tax, it's a good deal, Heider said.\nOne of Heider's clients used such a line of credit as a way to refinance existing debt on a commercial building. When the Fed ultimately tightens rates, Heider and his client will reevaluate. \"If interest rates cross over a line where he can do better with other investments, he'll just write a check,\" Heider said.\nStill, it is important for advisers to remind clients that they are not professional real estate investors. And there is always the risk that higher interest rates, whenever they appear, will cause home prices to slip, said Mike Piershale, president of Piershale Financial Group in Crystal Lake, Illinois.\n\"We're cautioning against buying properties right now unless you're planning on staying in them,\" he said.\nStill, advisers say most clients are wary enough following the bubble and crisis, and for well thought out plans, it is time to act.\nA client of Bilton's, at Merrill Lynch, had enough cash to outright buy a second home he had long been eyeing in Sarasota, Florida. Instead, Bilton helped him get a 10-year mortgage at 2.75 percent. After a tax deduction for mortgage interest, the client pays just 1.5 percent on the debt, and reaps a 3 percent yield on other investments.\nThe move was \"a no-brainer,\" Bilton said. \"That's what we call positive interest rate arbitrage.\" (Reporting by Hilary Johnson; Editing by Suzanne Barlyn and Cynthia Osterman)", "external_links": [], "published": "2015-10-02T16:00:00.000+03:00", "crawled": "2015-10-02T15:07:35.286+03:00", "highlightTitle": ""}