{"organizations": [], "uuid": "c2191f263686f22d55fc0552def00130371386de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/k/e/u/3/q/image.related.articleLeadwide.620x349.gketvm.png/1445413078987.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/3510/health-care/health-care-equipment-and-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/banking-and-finance/reserve-bank-defends-business-right-to-surcharge-20151021-gketvm.html", "country": "AU", "title": "Reserve Bank defends business right to surcharge", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Reserve Bank defends business right to surcharge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "c2191f263686f22d55fc0552def00130371386de"}, "author": "", "url": "http://www.smh.com.au/business/banking-and-finance/reserve-bank-defends-business-right-to-surcharge-20151021-gketvm.html", "ord_in_thread": 0, "title": "Reserve Bank defends business right to surcharge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RBA heads of payments policy Tony Richards said the Reserve Bank has already discussed with the ACCC how it will tackle excessive surcharging.\nThe Reserve Bank is keen to clamp down on excessive card surcharges and has already discussed how it will do it with the competition watchdog, but its head of payments policy, Tony Richards, argues many small businesses are in fact undercharging customers.\nIt is estimated merchants collect $2.5 billion to $3.5 billion in surcharges each year on credit card transactions – almost $300 billion in total annually.\nEast & Partners business surveys have found merchants charge on average 1.7 per cent a transaction. It also found the number of businesses surcharging is going up, rising from 34-36 per cent on Visa and MasterCard transactions in June 2014, to more than 45 per cent in June 2015.\nThe RBA, however, has found only 4 per cent of in-person transactions attract a surcharge, while 13 per cent of online payments do.\nAdvertisement Businesses pay merchant service fees of 0.83 per cent for each Visa and MasterCard transaction, accounting for 80 per cent of all card transactions, and 1.7 per cent for American Express, and about 2.1 per cent for Diners Club and 2.4 per cent for PayPal, which account for the rest.\nOn RBA figures, which cover only Visa, MasterCard, Amex and Diners Club, the average should be about 1.5 per cent.\nThat means businesses' costs are on average about $3.1 billion in total – roughly in line with what all businesses collect.\nBut some industries charge well above 1.5 per cent, especially when there is little competition, including airlines and taxis.\n\"There is a balance to be struck here between ensuring that merchants have the right to surcharge for expensive payment methods, including some cards, and ensuring that they do not surcharge excessively,\" Mr Richards said.\n\"Excessive surcharging is not a widespread problem but I think we can all point to a few cases where there are genuine concerns. The board is keen to take action here.\"\nQantas charges $2.50 to $30 flat fees depending on whether people pay with debit or credit cards, or are taking a domestic or international flight. It also offers free options including using online payment provider POLI Payments. The airline would not disclose how much it collects in surcharges annually.\nBut industry insiders say the merchant service fee airlines pay their banks for Visa and MasterCard payments is about 1 per cent a transaction.\nOne simple option the RBA has discussed is forcing the airlines to charge a percentage fee in line with what they pay in merchant service fees. The flat fees that airlines charge mean on low fares the payment fee can amount to more than 10 per cent.\nFor example, Qantas subsidiary Jetstar charges $8.50 a booking each way. At present, the total cost for a return trip from Sydney to Melbourne on its lowest fare is about $175. Payment surcharges are $17 on that trip, or 9.7 per cent. For its most expensive fare of $669 for the same journey, the levy falls to 2.5 per cent.\nMr Richards said the RBA's payment systems board will now work out a \"narrower definition of the costs of acceptance and allowable surcharges\" and work with the ACCC and Treasury to draft ACCC's new powers, and the ban on excessive surcharges.\n\"Many merchants choose not to surcharge but of those that do, typically it is the ones that get a lot more of the high-rewards cards,\" he told an Australian Payments Clearing Association conference in Sydney on Wednesday.\nOne of the chief problems the RBA wants to tackle is the huge number of card fees merchants are faced with. There are 17 separate interchange fees set by MasterCard and Visa that banks can levy on credit cards.\nThese can range from zero for charities, to 0.2 per cent for big retailers up to more than 2 per cent, and are paid mainly by small businesses because they don't get volume discounts.\n\"When presented with a card, merchants may have no way of knowing if it is a card with a 30-basis-point interchange rate or a 200-basis-point rate,\" Mr Richards said. \"So the issues that we have raised are the growing lack of transparency of payment costs for many merchants and the growing wedge in average payment costs between preferred and non-preferred merchants.\"\nCabcharge chief Andrew Skelton defended the 5 per cent surcharge (which has just been reduced from 11 per cent in Victoria, NSW and WA) it levies for electronic payments, and which is set by state governments.\n\"​Our service fees reflect not just the cost of processing payments but also the cost of providing the convenience of electronic payments for passengers and drivers,\" he said.", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T18:41:27.213+03:00", "highlightTitle": ""}