{"organizations": ["Jimmy Choo PLC & Sports Direct International Plc", "Diageo plc"], "uuid": "1021e7eac8e77bbc139f81e9046adfbc4d33fd37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/3-bargain-basement-stocks-diageo-144502963.html", "country": "GB", "title": "3 Bargain Basement Stocks: Diageo plc, Jimmy Choo PLC & Sports Direct International Plc", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "3 Bargain Basement Stocks: Diageo plc, Jimmy Choo PLC & Sports Direct International Plc", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:45:00.000+03:00", "replies_count": 0, "uuid": "1021e7eac8e77bbc139f81e9046adfbc4d33fd37"}, "author": "", "url": "https://uk.finance.yahoo.com/news/3-bargain-basement-stocks-diageo-144502963.html", "ord_in_thread": 0, "title": "3 Bargain Basement Stocks: Diageo plc, Jimmy Choo PLC & Sports Direct International Plc", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "664.00 +6.0000 \nThe best time to buy shares in any company is when investor sentiment is relatively weak. This enables the first part of the 'buy low, sell high' strategy to be fulfilled and, so long as there are no major fundamental problems with the business, it stacks the odds in the investor's favour when it comes to long term capital gains. \nWith the fear surrounding China hurting investor sentiment in emerging market-focused stocks such as Diageo (LSE: DGE) and fashion brand Jimmy Choo (LSE: CHOO), both stocks offer excellent value for money. In fact, their share prices have fallen by 4% and 16% respectively in the last three months as the market fears a pullback in spending on luxury goods in China and across the developing world. \nIn Diageo's case, it now trades on a price to earnings (P/E) ratio of 20.6. For a global consumer goods company with a range of top notch brands which command high levels of customer loyalty and in some cases are the dominant brand within their category, this appears to be a relatively cheap price to pay. That point is enforced by the fact that other consumer goods companies (often with less diversity or brand strength than Diageo) trade on significantly higher ratings, which indicates that Diageo's P/E ratio could move significantly higher. \nSimilarly, Jimmy Choo has a price to earnings growth (PEG) ratio of only 0.8. With its potential to diversify the brand through moving into other fashion accessories such as clothing and fragrances, it could become a true lifestyle brand with huge cross-selling opportunities. For example, it has a relatively high degree of customer loyalty from purchasers of its shoes and this can be leveraged to promote new products in other spaces, while maintaining a relatively high price point due to its strong reputation within footwear. \nAnd, with China still growing at around 7% per annum and transitioning towards a more consumer-focused economy, the potential for double-digit growth per annum in the coming years for both Diageo and Jimmy Choo is vast. \nMeanwhile, Sports Direct (LSE: SPD) may be focused on a lower price point than Jimmy Choo or Diageo, but its profit growth potential is high. For example, it is expected to increase its bottom line by 12% this year and by a further 15% next year. After its share price has fallen by 14% in the last three months, it now trades on a PEG ratio of 0.9, which indicates that it could offer exceptional capital gains over the medium to long term. \nCertainly, Sports Direct has prospered while the economy has been enduring a difficult period and shoppers have sought out the best value deals. However, Sports Direct appears to be well-placed to adapt to higher disposable incomes in real-terms and may seek to reposition itself as a lifestyle brand in the coming years, which may have a positive impact on the company's margins and profitability. \nOf course, finding great value stocks is never an easy task. That's why The Motley Fool has written a free and without obligation guide called 7 Simple Steps For Seeking Serious Wealth. \nIt's a step-by-step guide that could make a real difference to your portfolio returns in 2015 by helping you to find the best stocks at the lowest prices. \nClick here to get your copy - it's completely free and comes without any obligation. \nPeter Stephens owns shares of Jimmy Choo. The Motley Fool UK has recommended Sports Direct International. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-10-21T17:45:00.000+03:00", "crawled": "2015-10-21T18:03:23.620+03:00", "highlightTitle": ""}