{"organizations": [], "uuid": "9c6fba8316bdf9294925a4b91a52c53aa15af061", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-insurance/?format=rss", "section_title": "Insurance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/week-ahead-inflation-figures-uk-165700996.html", "country": "US", "title": "Week ahead: Inflation figures in UK, China and US flood market", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Week ahead: Inflation figures in UK, China and US flood market", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:57:00.000+03:00", "replies_count": 0, "uuid": "9c6fba8316bdf9294925a4b91a52c53aa15af061"}, "author": "", "url": "https://uk.finance.yahoo.com/news/week-ahead-inflation-figures-uk-165700996.html", "ord_in_thread": 0, "title": "Week ahead: Inflation figures in UK, China and US flood market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "332.50 +1.500 \nLONDON (ShareCast) - (ShareCast News) - Inflation data in the UK, China and the US will be in the spotlight this coming week. The consumer price index in the UK, released on Tuesday, is expected to pick up in September to 0.1% year-on-year following a drop to 0% in August. \nThe Bank of England, which is targeting 2% inflation, said the outlook for CPI (Other OTC: CPICQ - news ) in coming months looked weaker than it previously thought, according to the meeting minutes of its 8 September policy meeting. The central bank, which is taking inflation into close consideration in determining the timing of an interest rate hike, said CPI was unlikely to reach 1% until the spring of 2016. \nThe BoE is also closely monitoring the health of the UK labour market in its policy decisions. The UK's jobs report on Wednesday will therefore be under the microscope with analysts predicting the headline ILO unemployment rate fell to 5.4% in the three months to September from a prior 5.5%. Average weekly earnings are forecast to grow 3.1% during the period, compared to 2.9% in the previous quarter when it reached a six-year high. \nChinese inflation on Wednesday is expected to show an a 2.1% year-on-year increase in September on the back of higher food price inflation as pork prices continue to rise. CPI rose 2% in August. \"The extra holiday in the month will also push up service price inflation (such as tourism), adding to the upward pressure on headline CPI inflation,\" according to HSBC analysts. \nThe world's second largest economy also sees the release of trade data on Tuesday. Exports are expected to have contracted 3.7% year-on-year in September, on weak external demand and an extra holiday in the month. \nImports are projected to fall 13%, year-on-year as sluggish commodity prices continued to weigh on growth. As a result, the trade surplus may have fallen from $60.2bn to $46.8bn, according to analysts' predictions. \nThe data comes amid concerns about the flagging Chinese economy, which slowed to 7.4% last year, ending decades of double digit growth. The government has forecast growth to slow further to about 7% this year. \nOn Thursday, the US headline CPI is estimated to fall 0.1% year-on-year in September and 0.2% month-on-month, amid falling oil prices. Core inflation, which excludes volatile items such as fuel and food, is estimated to have risen 0.16% month-on-month September, compared to the previous month's 0.07% increase. Year-on-year it is projected to have held at a1.8% gain. \nThe Federal Reserve's minutes of its 16-17 September meeting on 8 September revealed that the central bank decided to keep interest rates unchanged on concerns that inflation could remain stuck at exceptionally low levels. The Fed is targeting 2% inflation. \nMonday 12 October INTERIMS Tissue Regenix Group INTERIM DIVIDEND PAYMENT DATE Savills INTERNATIONAL ECONOMIC ANNOUNCEMENTS Treasury Budget Statement (US) (19:00) FINALS Tristel (Other OTC: TSNLF - news ) , YouGov ANNUAL REPORT Asian Citrus Holding, Hansard Global (Other OTC: HNRDF - news ) AGMS Asian Citrus Holding, CAP-XX Limited TRADING ANNOUNCEMENTS Jupiter Fund Management FINAL DIVIDEND PAYMENT DATE UniVision Engineering Ltd. \nTuesday 13 October INTERIMS LiDCO Group (Other OTC: LDRUF - news ) INTERIM DIVIDEND PAYMENT DATE Intertek Group (Other OTC: IKTSF - news ) INTERNATIONAL ECONOMIC ANNOUNCEMENTS Trade balance (CHINA) Consumer Price Index (GER) (07:00) ZEW Survey (EU) (10:00) ZEW Survey (GER) (10:00) GMS (Taiwan OTC: 6481.TWO - news ) O'Key Group GDR (Reg S) (WI) FINALS DotDigital Group (LSE: DOTD.L - news ) , Nanoco Group (LSE: NANO.L - news ) , Proactis Holdings (LSE: PHD.L - news ) IMSS Michael Page International (Other OTC: MPGPF - news ) EGMS GCP Infrastructure Investments Ltd, UDG Healthcare Public Limited Company AGMS CSF Group (LSE: CSFG.L - news ) , FinnAust Mining (LSE: FAM.L - news ) , Leeds Group (LSE: LDSG.L - news ) , Myanmar Investments International Ltd, Premaitha Health (LSE: NIPT.L - news ) TRADING ANNOUNCEMENTS Michael Page International UK ECONOMIC ANNOUNCEMENTS BRC Sales Monitor (00:01) Consumer Price Index (09:30) Producer Price Index (09:30) Retail Price Index (09:30) Wednesday 14 October INTERIMS Brown (N.) Group, Vertu Motors (LSE: VTU.L - news ) , Walker Greenbank (LSE: WGB.L - news ) INTERIM DIVIDEND PAYMENT DATE Acencia Debt Strategies Ltd., Dairy Farm International Holdings Ltd (Bermuda), Dairy Farm International Holdings Ltd. (Jersey), Dairy Farm International Holdings Ltd. (Singapore), Hellermanntyton Group (LSE: HTY.L - news ) , Hongkong Land Holding Ltd. (Bermuda), Hongkong Land Holding Ltd. (Jersey), Hongkong Land Holding Ltd. (Sing.Reg), IDOX (LSE: IDOX.L - news ) , Jardine Matheson Holdings Ltd (Singapore Reg), Jardine Matheson Holdings Ltd. (Bermuda), Jardine Matheson Holdings Ltd. (Jersey), Jardine Strategic Holdingd Ltd. (Bermuda), Jardine Strategic Holdings Ltd. (Singapore), Mandarin Oriental International (Bermuda), Mandarin Oriental International (Jersey), Mandarin Oriental International (Singapore), Neptune-Calculus Income & Growth VCT QUARTERLY EX-DIVIDEND DATE Abbott Laboratories (Xetra: 850103 - news ) INTERNATIONAL ECONOMIC ANNOUNCEMENTS Beige Book Fed Survey (US) (19:00) Business Inventories (US) (00:00) Crude Oil Inventories (US) (15:30) Industrial Production (EU) (10:00) MBA Mortgage Applications (US) (12:00) Producer Price Index (US) (13:30) Retail Sales (US) (13:30) Retail Sales Inventories (US) (15:00) FINALS Animalcare Group (LSE: ANCR.L - news ) , Connect Group (Other OTC: SMWPY - news ) , Imperial Innovations Group IMSS Hargreaves Lansdown (LSE: HL.L - news ) EGMS Ultima Networks (LSE: UTN.L - news ) AGMS Diverse Income Trust (The) TRADING ANNOUNCEMENTS Domino's Pizza Group UK ECONOMIC ANNOUNCEMENTS Claimant Count Rate (09:30) Unemployment Rate (09:30) Thursday 15 October INTERIMS Booker Group (LSE: BOK.L - news ) INTERIM DIVIDEND PAYMENT DATE Belvoir Lettings (LSE: BLV.L - news ) , Chesnara (LSE: CSN.L - news ) , Macfarlane Group (LSE: MACF.L - news ) , RPS Group (LSE: RPS.L - news ) , RSA Insurance Group, UTV Media (LSE: UTV.L - news ) INTERIM EX-DIVIDEND DATE British American Inv Trust, British Polythene Industries (LSE: BPI.L - news ) , Cambian Group (Other OTC: CMBGF - news ) , Card Factory (LSE: CARD.L - news ) , Charles Taylor (LSE: CTR.L - news ) , Dillistone Group (LSE: DSG.L - news ) , Impellam Group (Other OTC: IGPPF - news ) , Jiasen International Holdings Ltd, Kerry Group (Other OTC: KRYAF - news ) 'A' Shares (Berlin: DI6.BE - news ) , Manx Telecom (LSE: MANX.L - news ) , Mears Group (LSE: MER.L - news ) , OneSavings Bank (Stuttgart: 2OS.SG - news ) , Pennant International Group, Restore, Smart Metering Systems (LSE: SMS.L - news ) , Spectris (Other OTC: SEPJF - news ) , Sprue Aegis (LSE: SPRP.L - news ) , Staffline Group (LSE: STAF.L - news ) , Ted Baker (Other OTC: TBAKF - news ) , TT Electronics (LSE: TTG.L - news ) QUARTERLY EX-DIVIDEND DATE Middlefield Canadian Income PCC INTERNATIONAL ECONOMIC ANNOUNCEMENTS Consumer Price Index (US) (13:30) Continuing Claims (US) (13:30) Initial Jobless Claims (US) (13:30) Philadelphia Fed Index (US) (15:00) Q3 Schlumberger Ltd., Unilever (LSE: 0NXN.L - news ) GMS Filtronic (Other OTC: FLTCF - news ) , Metals Exploration (LSE: MTL.L - news ) , Tinci Holdings Ltd. (DI (KSE: 003160.KS - news ) ) FINALS Pure Wafer (LSE: PUR.L - news ) , WH Smith (LSE: SMWH.L - news ) ANNUAL REPORT Smiths Group (Other OTC: SMGKF - news ) IMSS Ferrexpo (Other OTC: FEEXF - news ) , Man Group (LSE: EMG.L - news ) , Renishaw SPECIAL EX-DIVIDEND PAYMENT DATE Card Factory EGMS Nord Gold NV GDR (Reg S), Zhejiang Expressway Co 'H' Shares AGMS IG Group Holdings, IPPlus (LSE: IPP.L - news ) , Mattioli Woods (LSE: MTW.L - news ) , Oil & Gas Development Company Ltd GDR (Reg S), Rank Group, Renishaw FINAL DIVIDEND PAYMENT DATE HML Holdings (LSE: HMLH.L - news ) FINAL EX-DIVIDEND DATE Bioventix (Other OTC: BVNXF - news ) , Clinigen Group (Stuttgart: 78C.SG - news ) , Close Brothers Group, Daejan Holdings (LSE: DJAN.L - news ) , Dunelm Group (LSE: DNLM.L - news ) , Haynes Publishing Group, Henderson EuroTrust (LSE: HNE.L - news ) , IPPlus, Mid Wynd International Inv Trust, Pacific Horizon Inv Trust, Petra Diamonds Ltd (LSE: PDL.L - news ) .(DI), Produce Investments, Revolution Bars Group, Schroder Japan Growth Fund, Strategic Equity Capital (LSE: SEC.L - news ) Friday 16 October INTERIM DIVIDEND PAYMENT DATE Barr (A.G.), Christie Group (LSE: CTG.L - news ) , Computacenter (LSE: CCC.L - news ) , esure Group, G4S (Copenhagen: G4S.CO - news ) , Glanbia (Other OTC: GLAPF - news ) , Highcroft Investment, Highland Gold Mining Ltd (Other OTC: HGHGF - news ) ., Octopus AIM VCT (LSE: OOA.L - news ) 2, Petrofac Ltd., Robert Walters (LSE: RWA.L - news ) , SafeCharge International Group Limited (DI), Total Produce (LSE: TOT.L - news ) , Treatt (LSE: TET.L - news ) , Tribal Group (LSE: TRB.L - news ) INTERNATIONAL ECONOMIC ANNOUNCEMENTS Balance of Trade (EU) (10:00) Capacity Utilisation (US) (14:15) Consumer Price Index (EU) (10:00) Harmonised Index of Consumer Prices (EU) (10:00) Industrial Production (US) (14:15) New Car Registrations (EU) (10:00) U. of Michigan Confidence (Prelim) (US) (15:00) Wholesale Price Index (GER) (07:00) GMS React Energy (LSE: REAC.L - news ) , Trinity Exploration & Production (Stuttgart: 3BEA.SG - news ) FINALS Volution Group (WI) SPECIAL DIVIDEND PAYMENT DATE esure Group AGMS Mortice Ltd. (DI) TRADING ANNOUNCEMENTS Record FINAL DIVIDEND PAYMENT DATE Best of the Best (LSE: BEST.L - news ) , Dart Group (Other OTC: DRTGF - news ) , Trifast (Other OTC: TFSTF - news ) , United Carpets Group", "external_links": [], "published": "2015-10-09T19:57:00.000+03:00", "crawled": "2015-10-09T22:00:35.412+03:00", "highlightTitle": ""}