{"organizations": [], "uuid": "efe63394583e93e625a7e05960234bf8fb218c2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/all-pics/traders/SpeedDesk-19-large.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://www.thestreet.com/story/13318986/1/will-walmart-wmt-stock-be-helped-by-new-cfo-chief-merchant.html?puc=yahoo&cm_ven=YAHOO", "country": "GB", "title": "Will Walmart (WMT) Stock Be Helped by New CFO, Chief Merchant? - TheStreet", "performance_score": 0, "site": "thestreet.com", "participants_count": 1, "title_full": "Will Walmart (WMT) Stock Be Helped by New CFO, Chief Merchant? - TheStreet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "efe63394583e93e625a7e05960234bf8fb218c2c"}, "author": "yahoo", "url": "http://www.thestreet.com/story/13318986/1/will-walmart-wmt-stock-be-helped-by-new-cfo-chief-merchant.html?puc=yahoo&cm_ven=YAHOO", "ord_in_thread": 0, "title": "Will Walmart (WMT) Stock Be Helped by New CFO, Chief Merchant? - TheStreet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reddit Email Print Reprint NEW YORK ( TheStreet ) -- Walmart   ( WMT - Get Report ) announced on Friday a new CFO and chief merchant, as part of the company's push to revive sales. \nCharles Holley, who has been Walmart CFO since 2010, will retire at the end of 2015, and Brett Biggs, current CFO of Walmart International, will take over the role.\nHolley will receive total payments of $1.9 million during the two years after his retirement, as well as restricted stock worth roughly $2.1 million that wasn't scheduled to vest until 2017 and 2018, the  Wall Street Journal  reports.\n\nWalmart also announced that Steve Bratspies will become chief merchandising officer for U.S. stores beginning on October 19. Bratspies, an executive VP who has been in charge of the food and grocery business for the company's U.S. stores, will be filling a position that has been vacant since November of 2014, according to the  Journal.  \nWalmart has been struggling in recent months amid higher competition from  Amazon.com  (AMZN) and an increased number of grocery retailers and dollar stores,  Reuters  reports. In August, the company announced that annual profits would miss forecasts, and in September it announced a round of 450 job cuts at its Bentonville, AR headquarters. \nShares of the company are declining by 0.43% to $ 66.59  in midday trading on Friday.  \nTheStreet Ratings team rates WAL-MART STORES INC as a Hold with a ratings score of C+. TheStreet Ratings Team has this to say about their recommendation:\nWe rate WAL-MART STORES INC (WMT) a HOLD. The primary factors that have impacted our rating are mixed - some indicating strength, some showing weaknesses, with little evidence to justify the expectation of either a positive or negative performance for this stock relative to most other stocks. The company's strengths can be seen in multiple areas, such as its revenue growth, reasonable valuation levels and largely solid financial position with reasonable debt levels by most measures. However, as a counter to these strengths, we also find weaknesses including deteriorating net income, a generally disappointing performance in the stock itself and weak operating cash flow.\nHighlights from the analysis by TheStreet Ratings Team goes as follows:\nWMT's revenue growth has slightly outpaced the industry average of 3.8%. Since the same quarter one year prior, revenues slightly increased by 0.1%. This growth in revenue does not appear to have trickled down to the company's bottom line, displayed by a decline in earnings per share. The debt-to-equity ratio is somewhat low, currently at 0.62, and is less than that of the industry average, implying that there has been a relatively successful effort in the management of debt levels. Even though the company has a strong debt-to-equity ratio, the quick ratio of 0.17 is very weak and demonstrates a lack of ability to pay short-term obligations. Reflecting the weaknesses we have cited, including the decline in the company's earnings per share, WMT has underperformed the S&P 500 Index, declining 15.57% from its price level of one year ago. The fact that the stock is now selling for less than others in its industry in relation to its current earnings is not reason enough to justify a buy rating at this time. The company, on the basis of change in net income from the same quarter one year ago, has underperformed when compared to that of the S&P 500 and the Food & Staples Retailing industry average. The net income has decreased by 15.1% when compared to the same quarter one year ago, dropping from $4,093.00 million to $3,475.00 million. You can view the full analysis from the report here: WMT Check Out Our Best Services for Investors Action Alerts PLUS Portfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade.\nProduct Features: $2.5+ million portfolio Large-cap and dividend focus Intraday trade alerts from Cramer Quant Ratings Access the tool that DOMINATES the Russell 2000 and the S&P 500.\nProduct Features: Buy, hold, or sell recommendations for over 4,300 stocks Unlimited research reports on your favorite stocks A custom stock screener Stocks Under $10 David Peltier uncovers low dollar stocks with serious upside potential that are flying under Wall Street's radar.\nProduct Features: Model portfolio Stocks trading below $10 Intraday trade alerts 14-Days Free Only $9.95 14-Days Free Dividend Stock Advisor David Peltier identifies the best of breed dividend stocks that will pay a reliable AND significant income stream.\nProduct Features: Diversified model portfolio of dividend stocks Updates with exact steps to take - BUY, HOLD, SELL Trifecta Stocks Every recommendation goes through 3 layers of intense scrutinyquantitative, fundamental and technical analysisto maximize profit potential and minimize risk.\nProduct Features: Model Portfolio Intra Day Trade alerts Access to Quant Ratings Real Money More than 30 investing pros with skin in the game give you actionable insight and investment ideas.\nProduct Features: Access to Jim Cramer's daily blog Intraday commentary and news Real-time trading forums Only $49.95 14-Days Free 14-Days Free View other subscription services that we offer", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T04:17:08.522+03:00", "highlightTitle": ""}