{"organizations": [], "uuid": "89d818c60e93bedc78a6067ebd938aa29424b79c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/global-fund-managers-turn-gloomy-151453823.html", "country": "GB", "title": "Global fund managers turn gloomy on Europe's economic outlook", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Global fund managers turn gloomy on Europe's economic outlook", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:14:00.000+03:00", "replies_count": 0, "uuid": "89d818c60e93bedc78a6067ebd938aa29424b79c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/global-fund-managers-turn-gloomy-151453823.html", "ord_in_thread": 0, "title": "Global fund managers turn gloomy on Europe's economic outlook", "locations": ["Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Oct 13, 2015, 16:31 BST - UK Markets closed Global fund managers turn gloomy on Europe's economic outlook By Tara Cunningham | Telegraph – 16 minutes ago 1.581 -0.049 \nOnly 25pc of global fund managers now expect the European economy to strengthen over the next 12 months - down from 62pc in September \nOn the same day that European bourses faltered, a closely watched survey of global fund managers revealed the outlook for economic growth on the continent has weakened. \nJust 25pc of 209 investors polled by Bank of America Merrill Lynch earlier this month said they expected the European economy to strengthen over the next 12 months - down from 62pc in September. \nIn a note entitled “No pain, no gain”, BoA blamed global growth fatigue, disappointing inflation data, and poor German macro data for triggering the “correction” in growth sentiment. \nHowever, despite its amended growth expectations, the bank said the appetite for European stocks across global fund managers remained strong. \nEven (Taiwan OTC: 6436.TWO - news ) though fears of a slowdown in China and an emerging market debt crisis still pose the greatest risks to the financial world, similar to last month, sentiment towards China is improving. In September, 55pc of investors considered a Chinese slowdown as the biggest \"tail risk\", compared with 40pc this month. \nThe bank also highlighted that investors' appetite for risk has bounced back from bearish levels, when Chinese-led malaise triggered a sell-off in equities, as 54pc of fund managers said they had bought European stocks. \nThis month also saw the second largest jump ever in exposure to UK stocks, with the allocation to UK equities improving month-on-month (up from net 25pc underweight to 6pc). Meanwhile, investors rotated out of industrials and staples this month, and increased their allocation to energy stocks. \nIn London, the FTSE 100 continued to lose ground on Tuesday, falling 60.63 points, or 0.95pc, to 6,310.94 as mining stocks were hurt following the release of mixed Chinese economic data . China's September trade data showed exports better and imports worse than expected. \nDavid Madden, of IG (LSE: IGG.L - news ) , said: “Natural resource stocks were the worst hit by the Chinese trade figures, and as imports have declined for eleven consecutive months it paints a very clear picture that the second largest economy in the world isn’t as hungry for commodities as it once was.” * FTSE ends winning streak as Standard Chartered (BSE: 580001.BO - news ) suffers ratings downgrade Mr Madden also said European car makers and high-end fashion stocks were feeling the pain from the Chinese data. \nInternational miner Glencore (Xetra: A1JAGV - news ) slipped 4pc to 116.3p, while Anglo American fell 3pc to 670.5p, and luxury fashion brand Burberry was left nursing losses of 2.7pc. \nHowever, Royal Mail (LSE: RMG.L - news ) was the biggest casualty down 5.1pc to 448p after the government sold its remaining stake in the 500-year old postal operator. \nElsewhere, the German DAX tumbled 1.6pc, the CAC in Paris was off by 1.6pc and the Spanish IBEX fell 1.6pc.", "external_links": [], "published": "2015-10-13T18:14:00.000+03:00", "crawled": "2015-10-13T18:32:36.388+03:00", "highlightTitle": ""}