{"organizations": [], "uuid": "fd8576a14a9be9e65d4e26ddea4bfcb545cf7bd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/10/Bank-of-Baroda-Ret.jpg", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/ed-unearths-another-bank-of-baroda-like-case-involving-8-banks/151918", "country": "IE", "title": "ED unearths another Bank of Baroda-like case involving 8 banks", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "ED unearths another Bank of Baroda-like case involving 8 banks | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T05:20:00.000+03:00", "replies_count": 0, "uuid": "fd8576a14a9be9e65d4e26ddea4bfcb545cf7bd4"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/ed-unearths-another-bank-of-baroda-like-case-involving-8-banks/151918", "ord_in_thread": 0, "title": "ED unearths another Bank of Baroda-like case involving 8 banks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles 'Mobile banking may overtake internet banking in 2-3 years' Banking reforms initiated, says PM Narendra Modi: Top 5 points to note RBI to provide more bank licences, says S S Mundra The Enforcement Directorate has unearthed yet another trade-based money laundering case worth over Rs 550 crore perpetrated by allegedly using banking channels of nine major national and international banks, with illegal remittances being sent to Hong Kong and China.\nThe agency has also arrested a Ghaziabad-based foreign exchange operator for sending these illegal remittances to these foreign locations.\nThe case was busted after the agency got leads from an accused in the Bank of Baroda money laundering case, where suspicious remittances of an estimated Rs 6,000 crore came to light recently and which is being probed by multiple agencies including CBI, SFIO, Income Tax department and the ED.\nA fresh FIR has been lodged in connection with this case registered under the Prevention of Money Laundering Act (PMLA). The ED has arrested Manish Jain, operating a forex firm in Ghaziabad, Uttar Pradesh, last night for allegedly depositing and remitting Rs 505 crore between 2006 and 2010 from the Rajpur branch of Oriental Bank of Commerce (OBC) in an illegal manner against imports that “never took place.”\nThese remittances made through 66 accounts in the said OBC branch, the ED said, were subsequently sent to an HSBC bank branch in Hong Kong and then to China in return for settling dues of various importers in India with Chinese suppliers.\nOn the agency’s trade-based money laundering radar, where accused traders evade customs duties and taxes to generate slush funds, are seven other banks in the national capital region like ING Vysya, ICICI, Kotak Mahindra, Indusind, Dhanlaxmi bank, YES bank and DCB bank which the agency believes have been “misused” by Jain and others to perpetrate this fraud.\nSources said Jain runs two firms dealing in foreign exchange in Hong Kong and he used at least 11 “bogus firms” to send out a total of Rs 557 crore during the said period.\nThe ED suspects that Jain used these “unaccounted” funds to create tainted assets for himself and his associates by using fake or dummy identities and documents thereby misusing the Indian banking channels and RBI guidelines.\n“The latest case bears resemblance to the Bank of Baroda case and the agency got leads about Jain and his operations on the basis of the questioning of Sanjay Aggarwal who is already under arrest in the BoB case,” ED sources said.\n 15, 2015 9:20 pm", "external_links": [], "published": "2015-10-16T05:20:00.000+03:00", "crawled": "2015-10-20T00:32:55.208+03:00", "highlightTitle": ""}