{"organizations": ["Delta"], "uuid": "0a66c7befcdefb3ed3fabd642db6fa6010e3a416", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/delta-demonstrate-its-leadership-display-solutions-with-industrys-slimmest-dlp-video-wall-at-infocomm-mea-2015/45722", "country": "US", "title": "Delta to Demonstrate its Leadership in Display Solutions with the Industry's Slimmest DLP® Video Wall at InfoComm MEA 2015", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Delta to Demonstrate its Leadership in Display Solutions with the Industry's Slimmest DLP® Video Wall at InfoComm MEA 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:36:00.000+03:00", "replies_count": 0, "uuid": "0a66c7befcdefb3ed3fabd642db6fa6010e3a416"}, "author": "", "url": "http://businesswireindia.com/news/news-details/delta-demonstrate-its-leadership-display-solutions-with-industrys-slimmest-dlp-video-wall-at-infocomm-mea-2015/45722", "ord_in_thread": 0, "title": "Delta to Demonstrate its Leadership in Display Solutions with the Industry's Slimmest DLP® Video Wall at InfoComm MEA 2015", "locations": ["United Arab Emirates", "Dubai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Friday, October 16, 2015 1:06PM IST (7:36AM GMT) TAI:2308(TAI:2308) Delta to Demonstrate its Leadership in Display Solutions with the Industry's Slimmest DLP® Video Wall at InfoComm MEA 2015 Dubai, United Arab Emirates \nDelta Electronics, Inc., a global leader in power and thermal management solutions and pioneer in display solutions, announced today it will unveil, at InfoComm Middle East & Africa (MEA) show, its slimmest Digital Light Processing (DLP®) video wall featuring a depth of 450mm. Visitors will experience a live demonstration of its IP - based control system, DVCS®, which turns our innovative video walls into comprehensive display and monitoring solutions for applications demanding 24/7 operations. With the showcase of the industry’s slimmest DLP® video wall, Delta will demonstrate its technology dominance in displays during the 4-day event. Delta’s DLP® Video wall will be the limelight of the show, featuring a depth of 450mm with super-efficient projection engines; redundant power supplies, auto alignment, and auto color calibration used in mission-critical, control room and broadcasting applications. Ultra Narrow Bezel LCD Video wall will be seen featuring an ultra slim bezel to bezel of 3.5mm (typical) with high brightness well suited for control room and non-control room applications. These video walls allow a seamless connection between each display to create a powerful, high-impact visual experience for viewers. IP-based, highly expandable DVCS® (Distributive Vision Control System) Generation 2 will also be showcased at the Delta booth, offering visitors a chance to touch and feel its advanced functionality. The InfoComm platform will also showcase Delta's Ultra high resolution 1.8mm LED displays. Fine Pitch 1.8mm indoor LED displays is an ideal solution for large format indoor full-color, full-motion dynamic, life-like content display overcoming the challenges of short viewing for use in various applications including 24 x 7 control rooms. Delta will exhibit its state-of-the-art display & monitoring solutions during InfoComm MEA 2015 at booth TA-F10, Dubai World Trade Centre , Dubai, U.A.E from October 19-22, 2015 . InfoComm is a leading and the most prestigious audio visual Expo designed for professionals in the audiovisual, information communications and systems integration industries. About Delta Delta, founded in 1971, is a global leader in power and thermal management solutions. Our mission is “To provide innovative, clean and energy-efficient solutions for a better tomorrow,” and our businesses encompass Power Electronics, Energy Management, and Smart Green Life. Delta has sales offices, manufacturing facilities and R&D centers worldwide. In 2014, was ranked at the highest A-level of the Climate Performance Leadership Index of the Carbon Disclosure Project (CDP). Since 2011, Delta has been a member of the Dow Jones Sustainability Indices’ (DJSI) World Index. About Delta Displays Delta Displays, a division of Delta, is a pioneer in developing professional displays for control room as surveillance, security, traffic, command & control, utilities, process control, telecom and broadcast applications. Delta offers a wide array of display technologies including: rear projection DLP® video walls with Laser and Gen-Next LED technology, Ultra-thin-bezel LCD video walls, and high-resolution indoor/outdoor LED displays with a powerful & highly flexible Wall management Software suite. More information about Delta Displays can be found at www.deltadisplays.com For News Release background on Delta click here Aruna Chaudhary, Product & Marketing Manager, Delta India Electronics Pvt. Ltd., +91 (124) 4874900, vw.sales@deltadisplays.com", "external_links": [], "published": "2015-10-16T10:36:00.000+03:00", "crawled": "2015-10-19T12:11:11.437+03:00", "highlightTitle": ""}