{"organizations": ["Alibaba"], "uuid": "ba6a63fb9ff94600e5ab275f9fdc04550d50be58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/alibaba-makes-offer-chinas-youtube-110409877.html", "country": "GB", "title": "Alibaba makes offer for China's YouTube, Youku Tudou", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Alibaba makes offer for China's YouTube, Youku Tudou", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:04:00.000+03:00", "replies_count": 0, "uuid": "ba6a63fb9ff94600e5ab275f9fdc04550d50be58"}, "author": "", "url": "https://uk.finance.yahoo.com/news/alibaba-makes-offer-chinas-youtube-110409877.html", "ord_in_thread": 0, "title": "Alibaba makes offer for China's YouTube, Youku Tudou", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Oct 16, 2015, 12:31 BST - UK Markets close in 3 hrs 59 mins Alibaba makes offer for China's YouTube, Youku Tudou AFP – 27 minutes ago View Photo \n\nChinese e-commerce giant Alibaba on Friday made a multi-billon dollar offer to buy the outstanding shares of online video company Youku Tudou (NYSE: YOKU - news ) -- the country's equivalent of YouTube -- the firms said, in its latest push into entertainment. \nAlibaba, often described as China's eBay or Amazon, is king of e-commerce in the Asian country, but is seeking to develop beyond its traditional transaction platforms. \nThe company's founder Jack Ma said Alibaba aimed to develop Youku Tudou as China's leading digital entertainment platform, according to an Alibaba statement. \nAlibaba, which already owns 18.3 percent of the New York-listed target company, is offering $26.60 in cash per American depositary share (ADS), a separate Youku Tudou statement said, without giving a total value for the deal. \nEach ADS represents 18 ordinary shares in Youku Tudou. \nAlibaba had offered $3.6 billion for the remaining stake in Youku Tudou, Bloomberg News reported, quoting a person familiar with the matter. The deal valued the entire Internet television company at more than $4.0 billion, it said. \nThe offer represents a 30.2 percent premium over the stock's closing price on Thursday, said Youku Tudou, which described the \"going private\" proposal as preliminary. \nMost of Youku Tudou's online video offerings are professionally produced content licensed from copyright holders, according to the company. \n\"Youku Tudou?s high-quality video content will become a core component of the digital products of Alibaba's e-commerce (business),\" Alibaba Chief Executive Officer Daniel Zhang said. \nAlibaba's Taobao platform holds more than 90 percent of the consumer-to-consumer market in China, while its Tmall platform is believed to command more than half the Chinese market for business-to-consumer transactions. \nBut Alibaba has also invested in its first Hollywood film, \"Mission: Impossible - Rogue Nation\", acting as promotional partner in China with Paramount Pictures for the movie. \nLast month, Alibaba also set up a new company to focus on professional sports, including media, events and ticketing.", "external_links": [], "published": "2015-10-16T14:04:00.000+03:00", "crawled": "2015-10-16T14:31:57.804+03:00", "highlightTitle": ""}