{"organizations": [], "uuid": "9468cd6d886081d7e63fa2c552f1f5cf5f52ba4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/1/s/t/v/image.related.afrArticleLead.620x365.gk1on5.png/1444958313367.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/leadership/entrepreneur/failcon-is-a-conference-for-like-minded-entrepreneurs-who-have-failed-20151005-gk1on5", "country": "AU", "title": "FailCon is a conference for like minded entrepreneurs who have... failed", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "FailCon is a conference for like minded entrepreneurs who have... failed | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T21:15:00.000+03:00", "replies_count": 0, "uuid": "9468cd6d886081d7e63fa2c552f1f5cf5f52ba4a"}, "author": "Debora Spar", "url": "http://www.afr.com/leadership/entrepreneur/failcon-is-a-conference-for-like-minded-entrepreneurs-who-have-failed-20151005-gk1on5", "ord_in_thread": 0, "title": "FailCon is a conference for like minded entrepreneurs who have... failed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FailCon in San Francisco, 2012. Failure is emerging as a badge of honour among some Silicon Valley start-ups. by Debora Spar ﻿\nFailCon is a winning endeavour. Billed as a one-day conference for entrepreneurs, investors, developers, and designers, it unabashedly celebrates failure, urging its attendees to \"start exchanging stories of what didn't work\" and promising to provide \"guidance or safe spaces for failure.\" Launched in 2009 in San Francisco, FailCon had grown by this northern summer to include events in 21 cities around the world – including Dubai, Tokyo, and Tehran – each inviting attendees to pay a small entrance fee to reaffirm that \"it's OK to fail.\"\nFailCon is hardly alone. Similar mantras echo across the business space, clustering in particular around high-technology ventures and would-be entrepreneurs. The Harvard Business Review published a \"failure issue\" in 2011. Fail Forward , a consultancy, offers a range of tools for advancing the \"practice of intelligent failure,\" including instructions for creating \"failure reports\"– studies that help organisations learn from their disappointments – and a guide to sharing accounts of missteps. (\"Include emotions, character motivations, hopes, dreams, and fears,\" it instructs.) In 2014, a Fast Company columnist suggested provocatively that \"the most successful people are the ones who take big risks, which often means spectacular flameouts\".\nWhat really works In the frenzied hills of Silicon Valley, going bust is common. Research attests that close to half of start-ups supported by venture capital chew through most or all of their backers' money and most never achieve their projected returns on investment. But failure, the now trendy argument holds, is the key to long-term triumph; if you fail fast and frequently, you gain a sense of what really works.\nTo a certain extent, this equation rings true. Some of the tech industry's most promising stars dimmed quickly or were rendered irrelevant by subsequent waves of innovation – yet founders and funders swiftly rebounded. Netscape's co-founder, Marc Andreessen, now runs Andreessen Horowitz, one of Silicon Valley's most prosperous venture-capital firms. Napster's Sean Parker became the founding president of Facebook and an early investor in Spotify. America Online's Steve Case founded Revolution, an investment company. It is their stories, along with those of dozens of less famous but still very affluent founders of businesses, that inspire the failure-as-success narrative.\nThe problem is that such stories remain both relatively rare and distinctly American. There is nothing inherently wrong with sites and services that have cropped up around the celebration of failure. There is a real danger, though, in assuming that business practices that work in one part of the world will translate seamlessly to others, and in separating a specific aspect of one business culture from the legal and social environments that support it. Failure may not be a sin. Yet it's hardly a virtue either, and learning from it is a far cry from applauding its merits.\nNew opportunity on doorstep Silicon Valley is an idiosyncratic place, boasting a combination of specific factors that cannot be easily replicated or reproduced. It has one of the world's greatest universities in its backyard and eager pools of local capital. Because it has been a hotbed of innovation since Dave Packard and Bill Hewlett invented the audio oscillator in a Palo Alto garage, it also has developed deep and overlapping networks of entrepreneurial support services – law firms and marketing specialists and rental spaces that cater to start-ups. When an entrepreneur fails in Silicon Valley, he (or occasionally she) is doing so in a highly conducive environment where an abundance of new opportunities awaits.\nMore importantly, Silicon Valley entrepreneurs benefit from supportive rules and norms. Central among these is bankruptcy law; a key tenet of US financial legislation since 1938, it provides the muscle that allows entrepreneurs to start over and over again. Any commercial entity can file for bankruptcy under Chapter 11 or Chapter 7, which effectively allows a court to resolve a firm's assets and liabilities.\nThe owners of a bankrupt firm can lose their investment, but they are not held personally responsible for the firm's debt. Individuals can also file for bankruptcy, assuming some long-term constraints but no permanent handicaps: After a fixed term (usually three to five years), debtors, who are on schedule with their payments, are discharged without any legal obligations or social stigma.\nAfford to fund failure US law is similarly kind to investors. Most of Silicon Valley's leading venture-capital firms are organised as limited partnerships. Typically, they invest capital raised from a syndicate, meaning that the cash they lend is not their own. As a result, they have considerable leeway in spreading those funds and making multiple big bets.\nThey can afford to fund failure because the risks of doing so are relatively low and more than compensated for by a few big wins. Additionally, Silicon Valley benefits from a strong national system of intellectual property rights and an immigration regime that is open to outsiders and that is particularly welcoming to those with high-technology skills.\nOther countries, by contrast, are far less amenable to failure. In places such as Greece and Italy, where personal bankruptcy laws are more restrictive, start-up cultures are understandably less vibrant because the costs of not succeeding are so much greater.\nIn Germany, where banks have long been the major funding providers for industry, venture-capital coffers are proportionately more anaemic, giving would-be entrepreneurs fewer channels of money. And in China, the lack of legal protection for intellectual property rights raises the bar on risk for many firms while lowering their probable profits.\nThere are pockets around the world – Israel and Finland, for example – where the laws and norms of commerce support different styles of high-risk, highly innovative business. But where these rules are absent, the damages inflicted by failure are considerably larger.\nIt's important to ensure that the ideas of FailCon and similar ventures do not spread unchecked because, in the end, failure – true, abject failure, the kind from which one cannot recover – is no cause for celebration at all. Armed with a faith in crashing and burning, small-time investors who make big bets on a country's nascent stock exchange may risk losing their families' savings and plunging into poverty. Nothing about this is carefree.\nIndeed, despite what Silicon Valley says, without the infrastructure required to bounce back, failure is not a learning opportunity. It's a crisis.\nForeign Policy\nDebora Spar is a columnist for Foreign Policy, the president of Barnard College, and the author, most recently, of Wonder Women: Sex, Power, and the Quest for Perfection.", "external_links": ["https://hbr.org/archive-toc/BR1104", "https://failforward.org/", "http://www.fastcompany.com/3029883/bottom-line/11-famous-entrepreneurs-share-how-they-overcame-their-biggest-failure", "http://thefailcon.com/"], "published": "2015-10-15T21:15:00.000+03:00", "crawled": "2015-10-16T06:03:55.213+03:00", "highlightTitle": ""}