{"organizations": [], "uuid": "4c38922c3303fc5a9326c00ff95383246c35859c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510030065.html", "country": "US", "title": "Zimbabwe: Chiyangwa Angrily Denies Destroying Bulawayo Industries", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Chiyangwa Angrily Denies Destroying Bulawayo Industries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T12:47:00.000+03:00", "replies_count": 0, "uuid": "4c38922c3303fc5a9326c00ff95383246c35859c"}, "author": "", "url": "http://allafrica.com/stories/201510030065.html", "ord_in_thread": 0, "title": "Zimbabwe: Chiyangwa Angrily Denies Destroying Bulawayo Industries", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Business Class - Investment and the Rule of Law \nZANU PF politician and flamboyant tycoon Philip Chiyangwa has angrily rejected charges that he is responsible for destroying companies in Bulawayo - once the country's industrial heartland. \nThrough his Native Investment Africa group, Chiyangwa became a huge player in Bulawayo beginning 1998 when he bought companies such as G & D Shoes, Belmont Leather as well as the listed Zeco Holdings. \nMost of the companies have since closed with Zeco, which was founded in 1964, in mortal decline. \nThe former engineering behemoth once supplied rail wagons to the NRZ locally as well as regionally to countries such as Ethiopia Kenya, Mozambique, and Zambia. \nAS of Friday, Zeco's market capitalisation stood at US$46,000; its share price 0.01 US cents on the local bourse. \nCue Bulawayo opposition politician and top city lawyer, David Coltart, who was the liquidator when Chiyangwa bought most of the companies in 1998. \n\"I don't know how Chiyangwa made his money save for what he did to a variety of Bulawayo-based companies that he took over and drove into the ground,\" wrote Coltart in a recent article. \n\"I also have a concern when Zimbabwe's wealth and precious foreign currency is spent on very expensive imports such as Bentleys, Rolls Royces and the like. \n\"Surely our foreign currency would be better spent on vehicles made either in Zimbabwe or at least South Africa, which is on the African continent.\" \nHe added: \"I've no problem when wealth is made as a result of innovation, hard work and ingenuity. \n\"However, most of Zimbabwe's millionaires have made their money off the back of the working class, through plunder, asset stripping and corruption.\" \nNot best pleased, Chiyangwa hit back. \n\"I've never bought a single operating company in Bulawayo in the sense of a going concern,\" he said. \n\"What I simply participated in was public auctions of the disposal of assets of dead companies through the Master of the High Court, through the active direction of liquidators. \n\"What David Coltart is selectively failing to inform the public is that these companies had been severely stripped and run-down by their former owners, mostly the Jewish friends of Coltart who controlled the industry in Bulawayo.\" \nThe businessman added: \"For the record, I simply picked up assets way after some core and critical pieces had been cherry picked and sold away. \n\"Coltart doesn't want the world to know of his role in getting without going to tender a contract with the National Railway of Zimbabwe (NRZ), which is for 80 years, and they're still getting payments. His role in destroying NRZ needs to be publicly interrogated.\" \nChiyangwa also accused Coltart of profiting from the troubled companies saying \"they made good money by presiding over the liquidation of the outlined properties\". \nIn response, Coltart insisted that Chiyangwa could have done a better job of recapitalising and reviving the companies. \n\"He (Chiyangwa) took over the company, which is now dead,\" said the opposition politician. \n\"As I recall, him and others took over companies which are now shells, go to G & D now and see. What he says is his point of view but he needs to speak to two or three people and see if they'll agree with him. \n\"(Chiyangwa) had access to finance, which is what those firms needed at the time - access to capital and removal of red tape. No doubt the companies were in trouble but he could have helped. \n\"He never made an effort to make the companies viable despite the links he had with political power.\" Zimbabwe \nPRESIDENT Robert Mugabe yesterday made thinly-veiled threats against his ambitious potential successors, warning Zanu PF … see more » Copyright © 2015 New Zimbabwe. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-03T12:47:00.000+03:00", "crawled": "2015-10-03T16:37:27.756+03:00", "highlightTitle": ""}