{"organizations": [], "uuid": "f99b92daf220b3118c8e352a15f5e662d76e9e22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wisebread.com", "main_image": "http://www.wisebread.com/files/fruganomics/blog-images/woman_tropical_vacation_000045753702.jpg", "site_section": "http://www.wisebread.com/taxonomy/term/6/all/feed", "section_title": "Personal Finance", "url": "http://www.wisebread.com/9-ways-to-use-travel-rewards-cards-to-get-free-trips", "country": "US", "title": "9 Ways to Use Travel Rewards Cards to Get Free Trips", "performance_score": 0, "site": "wisebread.com", "participants_count": 1, "title_full": "9 Ways to Use Travel Rewards Cards to Get Free Trips", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T12:00:00.000+03:00", "replies_count": 0, "uuid": "f99b92daf220b3118c8e352a15f5e662d76e9e22"}, "author": "Amanda Bellucco", "url": "http://www.wisebread.com/9-ways-to-use-travel-rewards-cards-to-get-free-trips", "ord_in_thread": 0, "title": "9 Ways to Use Travel Rewards Cards to Get Free Trips", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » Personal Finance » Credit Cards » 9 Ways to Use Travel Rewards Cards to Get Free Trips 9 Ways to Use Travel Rewards Cards to Get Free Trips This post contains references to products from our advertisers. We may receive compensation when you click on links to those products. Please visit our Advertiser Disclosure to view our partners, and for additional details. Wise Bread Picks 0% Balance Transfer Credit Cards \nA bite from the travel bug can be a pricey itch to scratch. While we here at Wise Bread are no strangers to teaching you ways to travel the world for less , one of the simplest ways to jetset on a dime is to take advantage of credit cards that offer travel rewards . Millions of people are able to fly and stay for free (or pretty close to it) thanks to the wonder of rewards miles. How Credit Card Points Work \nTravel credit cards come in many forms. Some are generic bank cards, while others are branded to partner with specific hotel chains or airlines and their affiliates. Despite what logo is printed on the plastic, the concept is the same; every time you (responsibly) swipe, you rack up rewards points to use toward a much-needed getaway. There is a seemingly endless variety of cards to choose from, each with their own benefits and features. With a little research, you're sure to find the perfect fit for you and your travel needs. \nWant in on this action? We're rounding up the smartest ways to get the most out of travel credit cards, with advice from some of the Internet's most experienced lifestyle travelers. Get earning! 1. Pick the Right Card \nThere are a few basic options to weigh for just about every travel credit card on the market. Almost always, one of the first points of interest will be the bonuses. A hefty sign-up bonus may be a marketing tool to reel you in, but they're often worth it — many will even cover the costs of a domestic flight in and of themselves. Matt Kepnes, blogger behind Nomadic Matt and best-selling author of How to Travel the World on $50 a Day , is a big advocate of the sign-up bonus. \"I simply won't sign up for a card that doesn't at least give me 30,000 points when I sign up,\" he writes. \"Otherwise, it takes too long to get to a redemption.\" \nSee also: Best Current Credit Card Sign Up Bonuses for Miles \nKepnes also encourages people to look at minimum spending amounts, annual fees, and points per dollar. If you have to spend a small fortune to earn your bonus, or only ever earn one point for every dollar you spend, it may take longer than you'd like for your miles to gain traction. He points out that having to pay an annual fee isn't necessarily a bad thing — and many of those cards make up for it in added features. \nSee also: Best Credit Cards with Annual Fees 2. Use the Card! \nEarning points is not a set-it-and-forget-it type of deal. As long as you're vigilant about paying your credit card bill on time — and you should be — forego the cash and pay with plastic. Some travel credit cards even have their own shopping portal, letting you rack up additional rewards while making purchases through hundreds of partnering online retailers. And if you're a frequent flyer, using a co-branded airline credit card will give a boost to your miles count and offer additional perks, too. \nSee also: Best Credit Cards that Transfer Points to Airline Miles 3. Know That Points Are Not Created Equal \nNot to confuse you, but rewards points are not on level playing fields across the board. There is no standard worth or conversion rate they all must fit, and 50,000 points on one card may be nowhere near the same as 50,000 points on another. Howie Rappaport at Frugal Travel Guy breaks down the difference between general credit card points and branded airline or hotel rewards cards: \n\"...To the untrained eye, 100,000 hotel points with Marriott may appear to have a similar value as 100,000 [Starwood Preferred Guest] points — in fact, they do not,\" he writes. \"The potential values of the hotel points aren't even close.\" \nIt's also a good idea to check out the free Wallaby app. Wallaby will help you maximize your rewards and figure out when's the best time to use each of your cards. 4. Those Pesky Blackout Dates \nMany hotels and airlines prohibit rewards travelers from using their points during certain times of the year. Generally, these \"blackout dates\" fall around holidays and other times of hot-commodity peak travel. If you're a frequent peak-season jetsetter, or someone who just wants to be home for the holidays, you should take this into consideration. Otherwise, what's the point? Read the fine print and see if you can find yourself a rewards card with no blackout dates. \nOr, use a travel rewards card that simply gives you a statement credit for your travel purchases. These cards offer the most flexibility in terms of redeeming rewards for travel. You aren't limited to a specific carrier and can avoid the limitations airlines can put on award redemption. While these rewards don't carry as much potential value, consider the value of points that are wasted and left unused. Check out credit cards like the Discover it Miles and Capital One Venture . 5. Foreign Transaction Fees \nIf you're planning on using your card overseas, you may want to read up on its foreign transaction policy. Sure, you may be reeling in the savings thanks to your points, but that can easily be canceled out by expensive fees on purchases made outside of the States. Kristin Addis, investment banker turned globetrotting expert behind Be My Travel Muse , points out, \"If you're going to make the most of your purchases abroad, make sure it's with a card that doesn't charge foreign transaction fees, as they will take away from any benefit gained from miles.\" \nSee also: Best Credit Cards with No Foreign Transaction Fees 6. Keep Track of Your Points \nThese days it honestly couldn't be simpler to keep track of your points. AwardWallet is a favorite among travel hackers who want an organized approach to tallying their rewards — it even has free apps for iOS and Android devices. Simply list your credit cards, and let AwardWallet alert you when your balance changes or points are nearing expiration. 7. Put Your Small Business to Work \nMatt Gibson, adventure travel writer and photographer behind Xpat Matt , knows a thing or two about credit card miles. He points out a lesser-known tip on his blog: \"Some small business credit cards have their own programs that will enable you to collect miles while buying business-related products,\" he says. \"This is a fantastic way to rack up charges and miles and is definitely something small business owners should look into.\" \nSee also: Best Small Business Credit Cards 8. Set Your Goals \nThis piece of advice from Daraius and Emily, expert travel hackers behind Million Mile Secrets , is perhaps the most fun point on this list. Before you go crazy trying to rack up those rewards miles, take some time to actually think about your travel goals for at least the next year. Think about where you want to go and how you want to get there. Do you plan to fly coach, or does first class sound more appealing? Are you looking for a luxury hotel, or simply a place to crash? Are you bringing family or friends? Are you going abroad, or simply touring the U.S.? These are all factors that will determine how many points you need, what kind of points you need, and let you get an idea ahead of time how to start spending accordingly. That way you aren't stuck with an odd number of leftover points, or paying for too many expenses out of pocket. \nSee also: The Best Credit Cards for Hotel Deals and Rewards 9. Consider the Alternative \nAnother great piece of advice from Million Mile Secrets brings attention to the fact that some forms of travel don't lend themselves to rewards points. Maybe you prefer long road trips. Maybe you're planning a cruise. If this is the case, look into a cash back card . Cash back cards will convert the points you earn into credits to spend as cash. Daraius and Emily also point out this is a good way to cover incidental expenses and other small costs while traveling, but note that these cards generally don't offer the best value. \nWhat hacks do you use for making the most of rewards miles? Editorial Note: Any opinions, analyses, reviews or recommendations expressed in this article are those of the author’s alone, and have not been reviewed, approved or otherwise endorsed by any bank, card issuer, airline or hotel chain. Best Credit Cards", "external_links": [], "published": "2015-10-12T12:00:00.000+03:00", "crawled": "2015-10-12T13:06:26.654+03:00", "highlightTitle": ""}