{"organizations": [], "uuid": "b3124f09479825f8e8bd8ae6aaa2e6a5c71daf20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/e/t/5/2/image.related.afrArticleLead.620x365.gkenmt.png/1445419952975.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/financial-services/views-splintering-on-deal-pace-heading-into-2016-20151021-gkenmt", "country": "AU", "title": "Views splintering on deal pace heading into 2016", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Views splintering on deal pace heading into 2016 | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:00:00.000+03:00", "replies_count": 0, "uuid": "b3124f09479825f8e8bd8ae6aaa2e6a5c71daf20"}, "author": "Joyce Moullakis", "url": "http://www.afr.com/business/banking-and-finance/financial-services/views-splintering-on-deal-pace-heading-into-2016-20151021-gkenmt", "ord_in_thread": 0, "title": "Views splintering on deal pace heading into 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Citigroup vice-chairman Peter Orszag says financing and other conditions are conducive for mergers and acquisitions to continue to power along. Dominic Lorrimer Share on twitter by Joyce Moullakis Diverging views are forming on whether the cracking pace of global dealmaking this year, which is just shy of records set in 2007, will be sustained in 2016.\nMega-deals, or transactions of more than US$10 billion ($13.8 billion), have dominated the global landscape for mergers and acquisitions this year as companies seek to buy earnings growth to prop up their future prospects.\nDell is attempting a $US67 billion tilt for data storage company EMC , and the world's two biggest beer producers are set to join forces after SABMiller accepted Anheuser-Busch InBev's $US104 billion offer .\nCitigroup's corporate and investment banking vice-chairman Peter Orszag believes financing and other conditions are conducive for mergers and acquisitions to continue to power along.\n\"It [M&A] doesn't appear to be weakening or slowing at all,\" he said on the sidelines of the Citigroup annual investment conference. Mr Orszag is also the Obama administration's former director of Office of Management and Budget.\n\"Rates are low and there is a benefit to scale, especially in data intensive industries. You don't need to look any further than the Dell-EMC transaction.\"\nBut a deal flow predictor by virtual data room and technology company Intralinks suggests global activity is slowing.\nWhile the report suggests that 2015 will match 2007 records, it cautions that confidence among dealmakers dropped markedly in September. Just 43 per cent of the 575 surveyed were optimistic about the deal environment in the third quarter, down from 51 per cent three months earlier. The result is the lowest reading in almost two years.\n Concerns about slowdown Respondents in the Asia-Pacific region were concerned about a slowdown in China impinging on future M&A activity.\nThe Intralinks report pointed to M&A transactions for the calendar year coming in 6 per cent to 9 per cent higher than 2014.\nIt tracks the number of deals across the global market – not just the company's customers – that are in preparation or due diligence phase.\nGlobal early stage M&A grew by 5.6 per cent in the third quarter, according to the report, slowing from 9 per cent in the previous three months.\nIntralinks' vice-president of strategy Matt Porzio said \"conflicting signals\" on the health of the US economy, and uncertainty over the pace and timing of US interest rate rises was weighing on deals. Overheated M&A valuations were also a factor.\nThe report does, however, point to a solid first quarter in 2016 for global dealmaking which it estimates will be 7 per cent higher than the same period in 2014.\nThe Intralinks report found that early stage M&A in Australia slowed in the third quarter, in line with the Asia-Pacific region, suggesting a flat start to 2016 locally. But Australia is a way off from a notable slowing, following a potential takeovers of companies including credit checking group Veda, and insurance comparison company iSelect and the imminent sale of GE Capital's local commercial assets.\nDealogic has announced Australian mergers and acquisitions amounting to $US90.3 billion so far this year, up from $US63.3 billion at the same time in 2014.", "external_links": ["https://twitter.com/joycemoullakis"], "published": "2015-10-21T21:00:00.000+03:00", "crawled": "2015-10-21T17:01:22.336+03:00", "highlightTitle": ""}