{"organizations": [], "uuid": "839ac963f4205ca8aae8b6ecec85bce38bedbdb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/oil-prices-move-higher-weaker-044843459.html", "country": "US", "title": "Oil retraces early gains; stockpile worry, dollar weigh", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Oil retraces early gains; stockpile worry, dollar weigh", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T21:18:00.000+03:00", "replies_count": 0, "uuid": "839ac963f4205ca8aae8b6ecec85bce38bedbdb1"}, "author": "", "url": "https://uk.finance.yahoo.com/news/oil-prices-move-higher-weaker-044843459.html", "ord_in_thread": 0, "title": "Oil retraces early gains; stockpile worry, dollar weigh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Oct 22, 2015, 18:41 BST - UK Markets closed Oil rises on support from gasoline, Wall Street strength Reuters – 1 hour 27 minutes ago \nAn employee holds a gas pump to refill a car at a petrol station in central Seoul April 6, 2011. REUTERS/Lee … \nBy Barani Krishnan \nNEW YORK (Reuters) - Crude oil prices inched up on Thursday, supported by a rally in gasoline and technical charts suggesting a price rebound, although higher inventories limited gains for crude. \nA two-week high in the dollar also reduced some of the upward potential for crude, even as a surge in share prices on Wall Street bolstered sentiment, oil dealers said. [USD/] [.N] \nBrent was up 30 cents at $48.15 a barrel by 11:50 a.m. EDT (1550 GMT). The global crude benchmark finished down 86 cents, or 1.8 percent, on Wednesday, hitting an October low of $47.50. \nU.S. crude's West Texas Intermediate (WTI) oil also rose by 30 cents to $45.50. It settled down $1.09, or 2.4 percent, in the previous session, falling to a three-week low of $44.86. \n\"The strength in products is definitely helping crude,\" Pete Donovan, broker at New York's Liquidity Energy, said, referring to the near 3 percent rise in gasoline prices. \n\"We also seem to be getting some short covering as support holds at $45 for WTI.\" \nGasoline rallied as traders re-evaluated Wednesday's U.S. government data showing a 1.5 million-barrel decline in inventories of the motor fuel last week, compared with a 858,000-barrel drop forecast in a Reuters poll. [EIA/S] \nTechnical buyers were also coming back into the market, said Fawad Razaqzada, analyst at City Index. \n\"We are at an ideal area for bulls to step in after the retracement from the lows\", Razaqzada said, citing the pullback in Brent since its Sept. 15 low of under $46. \nSome traders remained pessimistic of the outlook for oil prices though, after last week's build of 8 million barrels in crude, which was more than double that forecast by analysts in the Reuters poll. \nThe fourth weekly build in crude inventories came despite a pick up in oil processing works during the autumn maintenance season for U.S. refineries. \nRising U.S. crude stockpiles aside, OPEC's inability to get oil producers to agree to meaningful measures to boost prices will also weigh on the market, the traders said. \nA meeting of oil exports from OPEC and non-member countries ended on Wednesday without any concrete price support measures despite discussing the risk low oil prices would have on investment in new supplies. \n\"There are no signs of any sort of production cuts, which would have to start from within OPEC,\" said John Mac, trader in crude oil spreads at Tyche Capital Advisors in Laurel Hollow, New York. \n(Additional reporting by Simon Falush in London and Keith Wallis in Singapore; Editing by Marguerita Choy)", "external_links": [], "published": "2015-10-22T21:18:00.000+03:00", "crawled": "2015-10-22T21:33:05.932+03:00", "highlightTitle": ""}