{"organizations": [], "uuid": "ddcf3561999bafecbd503400b299b8f3446699b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=8459_4417.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSFeed.aspx?ftype=FinanceBanking", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/the-cfpb-takes-aim-at-arbitration-86627/", "country": "US", "title": "The CFPB Takes Aim at Arbitration Clauses in Contracts for Consumer Financial Products", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "The CFPB Takes Aim at Arbitration Clauses in Contracts for Consumer Financial Products", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T06:02:00.000+03:00", "replies_count": 0, "uuid": "ddcf3561999bafecbd503400b299b8f3446699b4"}, "author": "Schnader Harrison Segal &amp; Lewis LLP", "url": "http://www.jdsupra.com/legalnews/the-cfpb-takes-aim-at-arbitration-86627/", "ord_in_thread": 0, "title": "The CFPB Takes Aim at Arbitration Clauses in Contracts for Consumer Financial Products", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The CFPB Takes Aim at Arbitration Clauses in Contracts for Consumer Financial Products more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=7d22a004-7e99-429c-91e0-0fd0fdcc2664\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nThe Consumer Financial Protection Bureau (CFPB) last week issued two proposals aimed at weakening and discouraging arbitration clauses in contracts for consumer financial products. First, the CFPB proposes prohibiting the application of arbitration clauses to class actions proceeding in court. Specifically, the Bureau is considering a requirement that arbitration clauses in covered consumer financial contracts provide that the arbitration agreement is inapplicable to putative class actions filed in court unless and until class certification is denied or the class claims are dismissed. This proposal could significantly increase putative class claims in the consumer finance sector (indeed, increasing access to class litigation appears to be the Bureau’s goal). Second, the Bureau seeks to require entities that use arbitration agreements in their contracts to submit to the Bureau notice of claims filed in arbitration proceedings and arbitration awards, potentially for publication. \nPlease see full Alert below for more information. \nFirefox recommends the PDF Plugin for Mac OS X for viewing PDF documents in your browser. \nWe can also show you Legal Updates using the Google Viewer; however, you will need to be logged into Google Docs to view them. \nPlease choose one of the above to proceed! \nLOADING PDF: If there are any problems, click here to download the file. Send Report Contact Related Posts \nDISCLAIMER: Because of the generality of this update, the information provided herein may not be applicable in all situations and should not be acted upon without specific legal advice based on particular situations. \n© Schnader Harrison Segal & Lewis LLP | Attorney Advertising … Or, sign up using your email address » - hide (Updated: October 8, 2015) : \nits website Security \nJD Supra takes reasonable precautions to insure that user information is kept private. We restrict access to user information to those individuals who reasonably need access to perform their job functions, such as our third party email service, customer service personnel and technical staff. However, please note that no method of transmitting or storing data is completely secure and we cannot guarantee the security of user information. Unauthorized entry or use, hardware or software failure, and other factors may compromise the security of user information at any time. \ninfo@jdsupra.com Sharing and Disclosure of Information JD Supra Collects \n& \npolicies. We shall have no responsibility or liability for your visitation to, and the data collection and use practices of, such other sites. This Policy applies solely to the information collected in connection with your use of this Website and does not apply to any practices conducted offline or in connection with any other websites. Changes in Our Privacy Policy \nWe reserve the right to change this Policy at any time. Please refer to the date at the top of this page to determine when this Policy was last revised. Any changes to our privacy policy will become effective upon posting of the revised policy on the Website. By continuing to use the Service or Website following such changes, you will be deemed to have agreed to such changes. If you do not agree with the terms of this Policy, as it may be amended from time to time, in whole or part, please do not continue using the Service or the Website. Contacting JD Supra \nIf you have any questions about this privacy statement, the practices of this site, your dealings with this Web site, or if you would like to change any of the information you have provided to us, please contact us at: - hide ×", "external_links": [], "published": "2015-10-17T06:02:00.000+03:00", "crawled": "2015-10-17T08:12:16.081+03:00", "highlightTitle": ""}