{"organizations": [], "uuid": "940a2cf141161007e16a473c752edcbec25dfa28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30291579/eze-castle-integration-expands-its-cloud-based-voice-solution-eze-voice-to-the-united-kingdom", "country": "US", "title": "Eze Castle Integration Expands Its Cloud-based Voice Solution, Eze Voice, to the United Kingdom", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Eze Castle Integration Expands Its Cloud-based Voice Solution, Eze Voice, to the United Kingdom - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:11:00.000+03:00", "replies_count": 0, "uuid": "940a2cf141161007e16a473c752edcbec25dfa28"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30291579/eze-castle-integration-expands-its-cloud-based-voice-solution-eze-voice-to-the-united-kingdom", "ord_in_thread": 0, "title": "Eze Castle Integration Expands Its Cloud-based Voice Solution, Eze Voice, to the United Kingdom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eze Castle Integration launches cloud-based voice solution, Eze Voice, in the UK\nCity of London (PRWEB UK) 19 October 2015\nEze Castle Integration, a leading provider of strategic IT solutions and private cloud services to hedge funds and the investment industry, today announced it has expanded its cloud-based voice solution, Eze Voice, to the United Kingdom. Eze Castle Integration’s optimised communications system enables mobility and increases efficiencies for the hedge fund and alternative investment verticals.\nEze Voice leverages Eze Castle Integration’s pioneering, global cloud platform, Eze Private Cloud, and provides a multitude of benefits across flexibility, collaboration, availability and reduced expenditures. Eze Voice takes business interactions to the next level and enhances the communicative experience for a firm’s employees and their customers. Key benefits of Eze Voice include:\nGold Standard Quality of Service: Eze Castle Integration manages the premier network powering Eze Voice and ensures it delivers high-quality sound, reliability and responsiveness for a competitive edge; Critical Functionality for Financial Services: Eze Voice includes functionality financial firms require such as true ‘bridged appearances’ that allow flexible, real-time collaboration amid colleagues; Seamless Communication Across Multiple Offices: Eze Voice seamlessly connects a firm’s offices and employees, enabling users to collaborate across organisational boundaries and distances, and eliminating the need for costly and complex networks, hardware and software; and Easily Connecting Office Extensions to Mobile Devices: Eze Voice empowers firms to extend the range of their corporate communications to mobile devices, helping companies to operate with greater agility.\n“Eze Voice augments productivity and simplifies the complexity of global communications, transforming business networks and supporting sustained growth,” said Bob Guilbert, managing director, Eze Castle Integration. “Expanding our advanced cloud-based voice solution to the United Kingdom provides our clients with transparent, sophisticated communications and an investment in the future.”\nThe Eze Private Cloud platform is built to deliver the high performance, applications and world-class service demanded by the global hedge fund and investment industry. Services delivered via this premier cloud platform include Eze Managed Suite and Eze Managed Infrastructure . Eze Managed Suite is a fully managed IT solution that combines a highly secure infrastructure with key business applications and professional IT management. Eze Managed Infrastructure is ideal for hosting the applications utilized by the financial industry.\nAbout Eze Castle Integration\nEze Castle Integration is the leading provider of IT solutions and private cloud services to more than 650 alternative investment firms worldwide, including more than 100 firms with $1 billion or more in assets under management. The company’s products and services include Private Cloud Services, Technology Consulting, Outsourced IT Support, Project & Technology Management, Professional Services, Telecommunications, Voice over IP, Business Continuity Planning and Disaster Recovery, Archiving, Storage, Colocation and Internet Service. Eze Castle Integration is headquartered in Boston and has offices in Chicago, Dallas, Hong Kong, London, Los Angeles, Minneapolis, New York, San Francisco, Singapore and Stamford.\n //www.prweb.com/releases/2015/10/prweb13028048.htm\n ", "external_links": ["http://www.eci.com/cloud-services/application-hosting.html", "http://www.prweb.com/releases/2015/10/prweb13028048.htm", "http://www.eci.com/cloud-services/eze-managed-suite.html"], "published": "2015-10-19T12:11:00.000+03:00", "crawled": "2015-10-19T11:38:51.092+03:00", "highlightTitle": ""}