{"organizations": [], "uuid": "781f50421e8ee8c9ccd5a1b3329737cbffc5038e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/why-tpp-most-important-acronym-122903182.html", "country": "US", "title": "Why TPP is the most important acronym you've never heard of", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why TPP is the most important acronym you've never heard of", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T15:29:00.000+03:00", "replies_count": 0, "uuid": "781f50421e8ee8c9ccd5a1b3329737cbffc5038e"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-tpp-most-important-acronym-122903182.html", "ord_in_thread": 0, "title": "Why TPP is the most important acronym you've never heard of", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Oct 6, 2015, 13:37 BST - UK Markets close in 2 hrs 53 mins Why TPP is the most important acronym you've never heard of By Mehreen Khan | Telegraph – 7 minutes ago 0.00 0.00 \nThe US and Japan have agreed to sign up to the trade-busting Trans-Pacific Partnership - here's everything you need to know \n= What is it? = \nJapan and the US have agreed to strike the world's biggest trade deal in over two decades. \nThe Trans-Pacific Partnership will create a free trade zone with common labour and environmental standards, and measures to protect data and intellectual property of large companies. \nIt (Other OTC: ITGL - news ) was agreed after nearly a decade of international talks between Washington and its international partners and is the most significant free trade deal since the US signed North America Free Trade Agreement in 1994. \nBut it will still need ratification in all the parliaments of its major participants. \n= Who is involved? = \nTwelve countries from across the Pacific Rim. They are Japan, the US, Australia, Brunei, Canada, Chile, Malaysia, Mexico, New Zealand, Peru, Singapore and Vietnam. \nTogether they make up around 40pc of the world's economic output. \nOther contenders who could sign up to the agreement are South Korea, Taiwan, the Philippines, and Colombia. \n= What does it mean for the US? = \nThe Pact has been one cornerstones of President Barack Obama's strategic \"pivot\" towards Asia and his bid to reassert to US economic hegemony over China. \nHere's what Mr Obama had to say about the benefits it would bring to the US: \n\"This partnership levels the playing field for our farmers, ranchers, and manufacturers by eliminating more than 18,000 taxes that various countries put on our products. \n\"It includes the strongest commitments on labour and the environment of any trade agreement in history, and those commitments are enforceable.\" \n= What does it mean for Japan? = \nThe deal has is also a welcome boost for Japanese premier Shinzo Abe's \"Abenomics\" plan to revive Japan's stagnant economy. \n= Who has it upset? = \nPlenty of people. Among them are previously protected sectors in both the US and Japan that fear they will be subject to liberalised rules that will now disadvantage them. \nTrade unions meanwhile have argued the negotiations were carried out in secret to favour the interests of global corporations. \nThe deal also opens up the possibility of companies suing national governments that put up trade barriers or do not adhere to common rules on the environment or public health. \nThe deal has also been touted as a rival trade organisation to undercut China's growing influence as a trade giant. But the door remains open to China to eventually take part in TPP. Beijing issued a cautious welcome to the deal, saying it was \"open to any mechanism\". \n= What are the benefits? = \nEstimates from research firm Eurasia Group show that over the long-term, TPP will have significant benefits to its partner countries. The deal could add $285bn to the combined GDP of its 12 nations by 2025 and increase exports by $440bn. \nIn percentage terms, Vietnam gets the biggest boost in GDP while in absolute terms Japan has the most to gain, the group found. \nChristine Lagarde of the International Monetary Fund said TPP could now \"pave the way to a new generation of deep trade integration efforts\" after global trade slumped in the wake of the credit crisis seven years ago.", "external_links": [], "published": "2015-10-06T15:29:00.000+03:00", "crawled": "2015-10-06T15:37:10.028+03:00", "highlightTitle": ""}