{"organizations": [], "uuid": "f4d91f0c37cac823ec7b021bd06501cbf4ab0482", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DF635_Boston_ZG_20150215104903.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/good-news-for-boston-this-winter-will-be-mild-2015-10-08", "country": "US", "title": "Good news for Boston: This winter will be mild", "performance_score": 0, "site": "marketwatch.com", "participants_count": 7, "title_full": "Good news for Boston: This winter will be mild - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 6, "uuid": "420c0de089d34623e390f650d92d760070eb0d82"}, "author": "Ciara Linnane", "url": "http://www.marketwatch.com/story/good-news-for-boston-this-winter-will-be-mild-2015-10-08#post-0", "ord_in_thread": 0, "title": "Good news for Boston: This winter will be mild", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reuters Florida looked appealing during last year’s brutal Boston winter Some good news for Bostonians weary after last year’s devastating snowfall.\nThe weather in the Northeast and mid-Atlantic regions is expected to be mild this winter, as one of the strongest El Niño patterns in the past 50 to 60 years develops, according to AccuWeather.\nThe shivering cold temperatures that hammered the Northeast for much of last winter will not be repeated this year, particularly at the start of the season.\n“There is an opportunity that [the weather] could change on us as we get into February and early March,” AccuWeather long-range forecaster Paul Pastelok said in a statement. “We just don’t know exactly yet whether or not we’re going to see the pattern turn cold and snowy.”\nStill, the Northeast can expect fewer days of subzero temperatures. Last winter saw the second-coldest winter on record for the region, and for eight individual states—New York, Pennsylvania and all six New England states.\nEl Niño refers to a weather phenomenon that is triggered by warm water in the Pacific and causes higher temperatures and above-average precipitation. The current pattern has sent sea temperatures in parts of the Pacific to their highest levels since the late 1990s, according to Australia’s Bureau of Meteorology . The El Niño of 1997-8 caused heavy flooding in North America, as well as severe drought in parts of Southeast Asia.\nAccuWeather’s Winter 2015-2016 forecast This year’s El Niño is expected to bring heavy rainfall and other severe weather to the U.S. Southeast and Gulf Coast, according to AccuWeather. Florida is at higher risk for tornadoes, and Southern Georgia and South Carolina may experience severe weather events. South Carolina is currently struggling with the fallout from last weekend’s storm, which was exacerbated by the effects of Hurricane Joaquin, which combined with other storm systems to create historic flooding.\nWatch: Hundreds rescued from Hurricane Joaquin floods in South Carolina\n“As far as the biggest impacts go, I would look at Shreveport and New Orleans, Louisiana, and Mobile, Alabama. I think those areas are going to get hit with a lot of rain,” Pastelok said.\nDrought-parched California, meanwhile, will experience rain and snow, but that news is not as good as it sounds.\nEl Niño will set up a pattern that will drop a lot of rain over the same area, creating unpredictable mud patterns that may cause mudslides and flooding that will hurt homeowners. The season may bring triple the amount of snow as last year, but it won’t be enough to refill reservoirs emptied by the long drought.\n“I think we need a couple of these kinds of years and I’m not sure we’re going to get that,” Pastelok said.\nSee also: Silicon Valley’s biggest missed opportunity: the drought\nElsewhere, the Northern Plains can expect cold weather early in the season, including snowstorms as early as November or December. In the Southern Plains, El Niño will ensure an active storm track—which makes above-normal precipitation likely.\nIn the Northwest and Northern Rockies, rain and snow will be less than normal, and temperatures will be above average. “Ski areas in the northern Rockies may be missing out on significant fresh snowpack. They’re going to have to make most of their snow at night,” Pastelok said.\nThe southwestern U.S. can expect wet and snowy conditions, particularly in Phoenix, Arizona, and Albuquerque, New Mexico.\nRead also: The states with the deadliest weather\n ", "external_links": ["http://www.weather.com/storms/winter/news/winter-weather-watch-2014-2015-20140930", "http://www.accuweather.com/en/weather-news/us-winter-forecast-2015-2016-mild-northeast-california-rain/52732989", "http://www.bom.gov.au/climate/enso/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T20:59:30.131+03:00", "highlightTitle": ""}