{"organizations": [], "uuid": "5e049292c67d0dcfad2ae8c20e93d71550ce7bee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-26/malaysia-turning-point-weighed-as-worst-asia-bonds-show-strength", "country": "US", "title": "Malaysia Turning Point Weighed as Worst Asia Bonds Show Strength", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Malaysia Turning Point Weighed as Worst Asia Bonds Show Strength - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T23:00:00.000+02:00", "replies_count": 0, "uuid": "5e049292c67d0dcfad2ae8c20e93d71550ce7bee"}, "author": "Christopher Langner", "url": "http://www.bloomberg.com/news/articles/2015-10-26/malaysia-turning-point-weighed-as-worst-asia-bonds-show-strength", "ord_in_thread": 0, "title": "Malaysia Turning Point Weighed as Worst Asia Bonds Show Strength", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malaysia’s bonds are showing signs of stability, heating up the debate on when to pile back into Asia’s worst-performing debt.\nMalaysia’ corporate dollar-denominated notes have returned 1.5 percent this month, paring their losses for the year to 1.7 percent, the biggest on a JPMorgan Chase & Co. index. The cost of insuring the nation’s sovereign debt has fallen the most in four years in October, while the ringgit has rallied 3.2 percent after a decline of 20 percent in the first nine months.\nPineBridge Investments and Vanguard Group say that some Malaysian debt may be oversold amid signs a scandal involving Prime Minister Najib Razak hasn’t derailed the nation’s finances. The economy was still expanding by 4.9 percent at the end of June, soured loans have inched up but remain near April’s 27-year low of 1.17 percent and the nation recorded a $10.2 billion trade surplus for August.\n\"Malaysian growth has been more resilient and there’s a lot of bad news already factored into current valuations,\" said Omar Slim, a Singapore-based vice president of fixed income at PineBridge Investments, which manages $78 billion globally. “It may be reaching a point where investing in their bonds could be interesting.”\nBangkok Better? Dollar notes due in 2022 of Malayan Banking Bhd., the nation’s largest lender, are trading at a spread above U.S. Treasuries that’s almost 100 basis points wider than similar-length securities of its Thai equivalent Bangkok Bank Pcl, which has a credit score one level lower.\nEmerging-market funds managed by Vanguard bought some of Malaysia’s sovereign bonds due 2025, according to a Sept. 30 filing. That added to other holdings including the nation’s debt due in 2016, 2021 and 2045.\n“Given what we think we know about Malaysia, it is a bit oversold,” said Jonathan Lemco, senior sovereign analyst and principal at Vanguard, which runs the world’s biggest bond fund. “From a macro standpoint the economy is still growing, albeit at a slower pace, debt management is good, even if not as good as it used to be and Malaysia is reasonably stable. And they have one of the best central banks in the region.”\n1MDB Mess A potential rating cut is still deterring investors, according to Lemco. Fitch Ratings earlier this year pointed at the possibility as Malaysia’s trade balance worsened and amid concerns related to 1Malaysia Development Bhd., a sovereign wealth fund at the center of a political scandal that has prompted street demonstrations calling for Najib’s resignation.\nThe downgrade threat has since lessened after Fitch changed the outlook for the nation’s credit score to ‘stable’ from ‘negative’ on June 30. Among the reasons were improved fiscal finances and the fact that even the current-account surplus is above the median of nations with a similar A- rating to Malaysia’s, it said.\nUBS Global Asset Management isn’t convinced yet.\n“In comparison, Indonesia is showing some positive signs with various reform and stimulus packages,” said Ashley Perrott, the head of pan-Asian fixed income at UBS Global Asset. “The political situation looks better there, and so while they have many challenges remaining, at least they appear to be taking action, and might represent a better option.”\nDefault Risk While Malaysia’s five-year credit default swaps are trading among the highest in Asia at 193 basis points, they have retreated from a six-year high of 247 touched on Sept. 29. The swap contracts, which protect bond investors against non-payment, have declined 39 basis points since Sept. 30, poised for the biggest reverse in four years. Contracts on Indonesia, rated junk at Standard & Poor’s, are priced at 205 basis points.\nS&P kept Malaysia’s sovereign rating at A- in its latest assessment in August, citing the country’s strong external position and considerable monetary flexibility, even as the 1MDB concerns linger, Singapore-based analyst Yee Farn Phua said. The government continues to keep on track to narrow its budget deficit next year.\n“We weigh these strengths against Malaysia’s moderate fiscal deficits and government debt burden, and our belief that corruption allegations involving 1MDB will not impede current policy flexibility and responsiveness,” said Phua, who reiterate the assessment by e-mail on Monday.", "external_links": [], "published": "2015-10-26T23:00:00.000+02:00", "crawled": "2015-10-27T00:01:10.964+02:00", "highlightTitle": ""}