{"organizations": [], "uuid": "5b2f1d86acfb1661845d50c62460ba3d71901145", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/c/1/8/d/image.related.afrArticleLead.620x365.gka0li.png/1445218605559.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/shares/why-tomorrows-investment-gurus-say-sydney-airport-is-still-a-buy-after-bull-run-20151015-gka0li", "country": "AU", "title": "Why tomorrow's investment gurus say Sydney Airport is still a buy after bull run", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why tomorrow's investment gurus say Sydney Airport is still a buy after bull run | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T07:33:00.000+03:00", "replies_count": 0, "uuid": "5b2f1d86acfb1661845d50c62460ba3d71901145"}, "author": "Jonathan Shapiro", "url": "http://www.afr.com/personal-finance/shares/why-tomorrows-investment-gurus-say-sydney-airport-is-still-a-buy-after-bull-run-20151015-gka0li", "ord_in_thread": 0, "title": "Why tomorrow's investment gurus say Sydney Airport is still a buy after bull run", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CFA Institute Research Challenge winners, for the third time in four years, Sydney University. Jonathan Shapiro Share on twitter by Jonathan Shapiro Sydney Airport is \"extreme even by monopoly standards\" the students of University of Queensland say. As they point out, the combination of low customer satisfaction and high operating margins isn't a bad one for sharemarket investors that have enjoyed a one-year total return of 55 per cent, compared with a flat period for the broader sharemarket.\nBut SYD's monopolistic qualities, the confluence of macroeconomic events and the uncertainty surrounding the prospect of a second airport has made it a fascinatingly divisive investment – and the perfect subject for the annual CFA Institute research challenge, where teams of university students work together to publish research and present their findings to a panel of judges drawn from the investment profession.\nCompeting in what turned out to be a State of Origin for budding stock analysts, held at Colonial First State's office in Darling Park Tower, were the University of Queensland, the University of Sydney, Macquarie University and first time finalist Bond University.\nOnce again the calibre of the research left many in the room, including this correspondent, wondering how on earth they'd ever get a job if they were born 15 years ago, and whether they deserve one today.\nSydney Airport's stellar share market rise has many investors doubting its valuation, but uni students taking part in the CFA research challenge see further upside. Ryan Stuart The judges – Emilio Gonzalez, CEO of BT Investment Management; Richard Brandweiner, CIO of First State Super; Duschko Bajic, deputy head of equity at Colonial – didn't go easy on the students. They were peppered with questions on their assumptions on passenger growth, the risks around Badgerys Creek and, not surprisingly for a stock that trades on 20 times earnings, valuation.\nWhat became apparent is Sydney Airport is an asset and an investment that typifies Australia's future as it transitions from a mining-driven economy. The weaker Australian dollar should attract more international visitors, although it will deter international travellers. The weaker dollar has also increased the competitiveness of the education sector, which should bring more visitors. The mining sector is hurting from China's economic transition but the middle class there continues to grow.\nMeanwhile, persistently low interest rates are helping this highly geared monopoly asset achieve lower cost of funds while boosting its valuation and attracting investors in search of \"bond proxies\".\nBut the dilemma for analysts is how much of this is factored into a share price that has already taken to the sky. And that formed the basis of the challenge.\nCFA Institute Research Challenge winners for 2015, the University of Sydney team presents its research on Sydney Airport. Jonathan Shapiro Winning insights The winner, for the third time in four years, was the University of Sydney, which recommended Sydney Airport as a buy. The team of Zubin Bilimoria, Angus Gibbs, Lisa Wang, Anthony Yao and Levi Romanov will be off to Chicago to represent Australia in the international finals.\nTheir thesis is that we're too bearish on the Chinese economy, which will continue to deliver passengers as its middle class grows. There's been a tripling of households with incomes of more than $55,000 in three years, which they believe will feed passenger growth.\nOn Badgerys Creek, they believe the market is neglecting the potential of the airport in western Sydney, and the option granted to Sydney Airport. And they point out that in other instances where a second airport has been added, the impact has been negligible.\nBut the central tenet of their investment case is the \"great yield obsession\". They point out that while the current dividend yield is 4.6 per cent, the potential is there for the dividend to grow by 9 per cent a year.\nIn their view, the 'beta' of sensitivity to the broader sharemarket of 0.57 compared with financials of 0.99, property trusts at 0.79 and utilities at 0.69 justifies its valuation, with a 10 per cent upside on $6.00 to $6.61. (Beta is a ratio that measures an investment's price move with the sharemarket with a measure of 1.00 indicating a move exactly inline with the main stock market index).\nThe University of Queensland finished runners-up with a hold rating on the stock, saying that despite its high bargaining power, the stock would be challenged to maintain dividend growth.\nOne got the sense that the judges, while very impressed with the students' work, weren't actually convinced enough to buy the stock.\nMany in the financial markets hold the view that Sydney Airport trades an exorbitant multiple. The professionals are a little more cautious, with half of the 16 analysts surveyed by Bloomberg placing a buy rating, seven a hold and one with a sell.\nBut as seasoned stock pickers have learned, making calls can be a humbling experience. It's worth checking back in 12 months' time to determine whether the masters or apprentices get this call right. For this judge it's too hard to call.", "external_links": ["https://twitter.com/johnnyshap"], "published": "2015-10-19T07:33:00.000+03:00", "crawled": "2015-10-19T13:05:50.367+03:00", "highlightTitle": ""}