{"organizations": [], "uuid": "03d43e6e7d271d0c03abfac48f8c014a4a7bb91c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/8/u/i/9/image.related.afrArticleLead.620x365.gk1fgk.png/1444021127991.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/national/how-robb-stared-down-the-us-on-big-pharma-20151005-gk1fgk", "country": "AU", "title": "How Robb stared down the US on big pharma", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How Robb stared down the US on big pharma | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T11:25:00.000+03:00", "replies_count": 0, "uuid": "03d43e6e7d271d0c03abfac48f8c014a4a7bb91c"}, "author": "John Kehoe", "url": "http://www.afr.com/news/politics/national/how-robb-stared-down-the-us-on-big-pharma-20151005-gk1fgk", "ord_in_thread": 0, "title": "How Robb stared down the US on big pharma", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Andrew Robb, right, with Mike Froman: The finer details of the biologics deal are yet to be made public and still need to be agreed to by developing countries. Share on twitter Share on Google Plus by John Kehoe At 3am Sunday in a negotiating room on the 14th floor of the Westin Hotel in downtown Atlanta, Andrew Robb and Mike Froman finally shook hands on a deal ending a standoff that had become the major hurdle to the biggest regional trade deal in more than 20 years.\nTrade Minister Robb refused to cede to pressure from President Barack Obama's trade point man to increase intellectual property protection for cutting edge medicines known as biologics.\nAhead of the Trans-Pacific Partnership talks in Atlanta, the US had demanded 12 years of data protection for biologics, in line with US law. Robb drew a \"red line\" at five years, but many in the US drug sector expected he would give ground.\nSchooled in tough negotiations working for the Packer family, farm lobby and as Liberal Party federal director, Robb dug in. He knew each extra year of data exclusivity would shut out cheaper biosimilar drugs and cost the federal budget more than $100 million a year, leaving the Turnbull government open to a political scare campaign that it had given in to big pharma and pushed up the price of prescription drugs.\nFroman, with the full force of the powerful US pharmaceutical sector behind him, tried to persuade Robb to at least meet him halfway at eight years, in line with other developed TPP countries, Canada and Japan.\nThe former Clinton administration adviser and Citibank executive was under serious pressure to deliver. During the TPP talks, Froman was inundated with phone calls from annoyed Congress members and US pharmaceutical heavyweights, urging him to force the Australians to raise their offer, sources said.\nTrade negotiators from the US and Australia spent countless hours into the early mornings over recent days trying to nut out a compromise. Various options were floated on the time limit that prevents biosimilar developers accessing clinical trial data for original biologics. Data exclusivity, in effect, prolongs a drug maker's monopoly.\nIn the end, Robb held firm for Australia in his tenth face-to-face meeting with Froman in the space of 48 hours.\n \"This was a red line issue for us and I said all along we're not going to change the five years and we're not going to change our system,\" Robb reflected on Sunday.\nThe US reluctantly recognised the other mechanisms Australia already has in place that slow the entry of biosimilars, including a separate robust patent system and strict regulatory drug approval process.\n\"The thing in the end was the recognition that there is more than one way to skin a cat,\" Robb said.\nWhat, if anything, Australia may have given up elsewhere in the TPP horse trading, remains to be seen.\nThe finer details of the biologics deal are yet to be made public and still need to be agreed to by developing countries like Chile and Peru.\nGiven Latin American economies don't have the same strict patent and legal systems as Australia, the US pharmaceutical sector will pore over the text to exploit any loophole to compel the countries to a higher time standard than five years.\nRepublicans in Congress will also scrutinise the compromise and likely blame Obama for coming up short.\nAs for Robb and Froman, the discussions were, at times, testy. Yet US and Australian trade sources say they have a healthy mutual respect for each other. The 2½ day arm wrestle morphed into a firm handshake. And a sense of relief the broader TPP may be within reach.", "external_links": ["https://ustr.gov/", "https://twitter.com/Johnkehoe23", "https://plus.google.com/https://plus.google.com/u/2/b/117110503471959828934/105888713093633772087/posts"], "published": "2015-10-05T11:25:00.000+03:00", "crawled": "2015-10-05T08:06:21.940+03:00", "highlightTitle": ""}