{"organizations": [], "uuid": "78db1ad70e25c7f4aeea7e6c4e37ca92cbc0ba88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/7/w/c/s/image.related.afrArticleLead.620x365.gk7r90.png/1444724961079.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/transport/shipping/chinas-landbridge-wins-port-of-darwin-for-506m-20151013-gk7r90", "country": "AU", "title": "China's Landbridge wins Port of Darwin for $506m", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "China's Landbridge wins Port of Darwin for $506m | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T14:33:00.000+03:00", "replies_count": 0, "uuid": "78db1ad70e25c7f4aeea7e6c4e37ca92cbc0ba88"}, "author": "afr.com", "url": "http://www.afr.com/business/transport/shipping/chinas-landbridge-wins-port-of-darwin-for-506m-20151013-gk7r90", "ord_in_thread": 0, "title": "China's Landbridge wins Port of Darwin for $506m", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chinese group Landbridge will invest $200 million to develop the Port of Darwin over the next 25 years Glenn Campbell by Jenny Wiggins Sarah Thompson Anthony Macdonald Chinese energy and infrastructure group Landbridge will consider opportunities to build hotels in the Northern Territory after paying $506 million for a 99-year lease for the Port of Darwin.\nAs flagged by The Australian Financial Review's Street Talk column , the privately-held Chinese company - which has a real estate arm that develops hotels - beat local and international consortiums to operate the port after it was privatised by the Northern Territory government.\nLandbridge will invest $200 million in the port over the next 25 years to boost trade and tourism links with Asia, including improving cruise ship facilities. The port is an emerging destination for cruise ships, with 65 cruise ship visits in 2014-15, the highest number in six years.\n\" Landbridge intends to grow two-way trade between Australia and Asia, leveraging Landbridge's existing port and logistics businesses and firmly putting Darwin on the map for Chinese business,\" said Landbridge Infrastructure Australia's director, Mike Hughes.\nThe Chinese group is also understood to be keen on building new hotels in the city. The Northern Territory government is considering a luxury hotel developmen t in Darwin.\nNorthern Territory chief minister Adam Giles said the Territory would benefit from Landbridge's \"position, networks and experience\" in Asia.\nNearly half the 3.4 million tonnes of total cargo that passed through the Port of Darwin in 2014-15 was traded with China, mostly bulk mineral exports.\nTrade to China is expected to receive a further boost when the China-Australia Free Trade Agreement comes into effect.\n Federal Trade and Investment Minister Andrew Robb said Landbridge's investment in the port would be \"a huge spur\" to the development of Australia's north and encourage additional investment in agriculture, resources and energy and infrastructure.\nLandbridge is initially planning to develop warehousing for refrigerated products at the port to expand boxed meat exports. The Australian Agricultural Company started operating a new abattoir near Darwin in October to supply beef to the US and Asia.\nSingapore is the Port of Darwin's second-biggest trading partner.\nCargo movements through the port dropped 40 percent in 2014-15 compared with a year earlier, mostly due to a fall in iron ore exports, but live cattle exports rose 51 percent to a record 613,473 head of cattle.\nLandbridge owns a port at North Haizhou Bay in Shandong province, south of Beijing and is currently expanding the port's capacity to more than 200 million tonnes annually. It also owns a Brisbane-based coal seam gas producer, WestSide Corporation .\nThe Northern Territory government will retain an initial 20 per cent stake in the port and Landbridge will look for an Australian investment group or company to acquire the stake within the next two years.\nBut Northern Territory taxpayers will benefit from expected increases in trade flows through the port in the future due to an agreement with Landbridge that allows it to take a percentage of the port's revenues above a certain level.\nWhen the port's returns hit 30 per cent above \"business as usual\" projections, the government will get 15 percent of the margin above those projections.\nLandbridge paid a multiple of 25 times the port's 2016 estimated earnings before interest, taxation, depreciation and amortisation to secure the sale.\nSimilar earnings multiples were paid by infrastructure investment group Hastings Funds Management and Chinese conglomerate for NSW's Port of Newcastle last year, and by Industry Funds Management, Australian Super and the Abu Dhabi Investment Authority when they acquired the Port of Botany in 2013.\nLandbridge said any price rises for users of the port will be limited to increases in the consumer price index, and there will be no forced redundancies of the current workforce under the current enterprise agreement, which expires in June 2018.\nThe sale does not require approval by the Foreign Investment Review Board, and has been vetted by the Department of Defence.", "external_links": ["http://www.westsidecorporation.com/", "http://newsroom.nt.gov.au/mediaRelease/14534", "http://en.landbridge.com.cn/", "http://www.darwinport.nt.gov.au/sites/default/files/images/DPC_2015_A-R_trade_report_web.pdf"], "published": "2015-10-13T14:33:00.000+03:00", "crawled": "2015-10-13T12:07:40.823+03:00", "highlightTitle": ""}