{"organizations": [], "uuid": "4c2250ade47e29d782812eac91711dc493e522d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l.yimg.com/bt/api/res/1.2/wCREQZWdytmuF5uaq6jtAg--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_SILICONALLEY_H_LIVE/Heres_why_one_ad_agency-660a92ee8f3ebe87777146032d2176e8.cf.png", "site_section": "http://finance.yahoo.com/rss/AdvertisingAgencies", "section_title": "Yahoo! Finance: Advertising Agencies Industry News", "url": "http://finance.yahoo.com/news/heres-why-one-ad-agency-113849893.html", "country": "US", "title": "Here's why one ad agency seeks to hire 'internet kids' from Reddit and Instagram rather than people from the ad industry", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Here's why one ad agency seeks to hire 'internet kids' from Reddit and Instagram rather than people from the ad industry - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "4c2250ade47e29d782812eac91711dc493e522d2"}, "author": "Lara O'Reilly", "url": "http://finance.yahoo.com/news/heres-why-one-ad-agency-113849893.html", "ord_in_thread": 0, "title": "Here's why one ad agency seeks to hire 'internet kids' from Reddit and Instagram rather than people from the ad industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View gallery\n. (Baseball Card Vandals) \nDeutsch discovered these two creatives via their Instagram account. \n\nRecruiting for new young creatives to join the ad agency is a tough job at the moment. At one time, the competition for creatives was just between other agencies and brands' marketing departments, Winston Binch, chief digital officer at ad agency Deutsch, told Business Insider: \"Now we compete with BuzzFeed, Vice, Google, Facebook, or what we call 'two f--kers in their garage' — everyone is in the marketing business now.\"\nBut rather than fight against the democratization of tech and the ease at which people can publish their creative efforts, Deutsch has embraced the internet, by using it to be more creative about the way it recruits talent.\nInstead of looking to other ad agencies, or people that have just finished college marketing courses, the agency is actively seeking out \"internet kids.\"\nPete Favat, Deutsch chief creative officer, said: \"The idea of hiring people in advertising is over. We will just regurgitate what has already been done. If advertising continues to copy itself and take influence from itself, that's why people will get put off of advertising.\"\nRecently, Deutsch has handpicked three of its young creatives via Instagram, and one via Reddit.\nDeutsch discovered brothers Bryan and Beau Abbot through their \"Baseball Card Vandals\" website and Instagram account, which sees the pair sabotage baseball cards with funny illustrations. Neither had worked in advertising before, but now they are an art director and copywriter, respectively, working on the Sprint account.\n\nREDRUM! #Cubs #postseason #Cardinals #NLDS#L #chicago #stlouis #theshining #jacknicholson #stephenking #scarymovie #stanleykubrick #MLB #baseball #baseballcardvandals #shopBCV \nA photo posted by @baseballcardvandals on Oct 10, 2015 at 3:30pm PDT on Oct 10, 2015 at 3:30pm PDT\nDan Atwater joined as a junior art director, but was found by Deutsch staff via his \"kickass\" Instagram profile, in which he cleverly repurposed his creative portfolio.\nView gallery\n. (Instagram) \nMeanwhile, Kurt Gassman was offered a place on the agency's \"DPrep\" summer residency in Los Angeles because he made an unusual application via Reddit. He posted a series of images transforming his paper job application into an origami crane, that he took wherever he went.\nView gallery\n. (Kurt Gassman) \nDeutsch duly responded by sending his acceptance letter back via Reddit too.\nView gallery\n. (Deutsch) \nDeutsch is telling the entire agency to \"stuff yourselves with culture as much as possible\" — paying attention to Instagram, Vine, art, comedy, shows on Netflix — and keep an eye out for potential new hires. \"Talent is everyone's job,\" according to Favat.\nIt's that kind of thinking that saw the agency hire TJ Miller, the comedian, writer, and actor from the HBO show Silicon Valley. He's been brought in as a freelance writer when he's not on set.\nBinch said: \"What makes this place different is that we're passionate about innovation. We are investors and we invest ahead of revenue and that's very rare for an ad agency — most of which are just busy managing their margins. And that's the quickest way to die. Invention and innovation has to be the biggest part of our business model. We'll make mistakes, but that's what makes it exciting for us.\"\nBoth Binch and Favat admit that hiring \"internet kids\" hasn't always worked — and it's too soon to say whether they'll go on to get senior roles — but they encourage other businesses to adopt a tech-like \"fail fast\" attitude. They believe the larger business community — banks, retailers, healthcare companies — should be hiring \"internet kids\" too to bring new thinking into their sometimes stodgy organizations. Those kinds of people are more likely to bring ideas that a fan — not a corporation — would make, they added.\nNOW WATCH: Honda is paying more than $1 million to air this incredible 2-minute ad during football games \n\nMore From Business Insider \nThe 30 most creative people in advertising 2015 \nWe found out what's going on with Truffle Pig — the ad agency Snapchat, WPP, and The Daily Mail launched at Cannes \nThe advertising industry admits it has a major transparency problem and it's about to find out just how big an issue it is", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T17:48:44.462+03:00", "highlightTitle": ""}