{"organizations": [], "uuid": "8d615666335a8d7a695ea29a6641eb893a184788", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/z/k/3/t/image.related.afrArticleLead.620x365.gjzcuu.png/1443738026000.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/transport/aviation/malaysia-airlines-to-ramp-up-services-to-help-win-back-passengers-20151001-gjzcuu", "country": "AU", "title": "Malaysia Airlines to ramp up services to help win back passengers", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Malaysia Airlines to ramp up services to help win back passengers | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:17:00.000+03:00", "replies_count": 0, "uuid": "8d615666335a8d7a695ea29a6641eb893a184788"}, "author": "Jamie Freed", "url": "http://www.afr.com/business/transport/aviation/malaysia-airlines-to-ramp-up-services-to-help-win-back-passengers-20151001-gjzcuu", "ord_in_thread": 0, "title": "Malaysia Airlines to ramp up services to help win back passengers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malaysia Airlines chief executive Christoph Mueller said the airline would not be changing its brand name, in part because it was too expensive to repaint all of its aircraft. Steven Siewert Share on twitter by Jamie Freed Malaysia Airlines will begin introducing improved services for passengers in flight and on the ground over the next 18 months as it attempts to rebuild confidence following the twin disasters of MH370 and MH17 that beset the carrier last year.\nChief executive Christoph Mueller, who previously led a turnaround at Irish carrier Aer Lingus, said the improvements, to be announced progressively from December, would include new seats, catering, in-flight entertainment and lounge concepts, as well as operational improvements such as better punctuality and improved connection times through Kuala Lumpur on popular routes.\n\"Every few months there will be something new, and that will be framed really as the new brand,\" he said at the airline's Kuala Lumpur headquarters on Thursday. \"We will start in the first quarter of next year to introduce these improvements.\"\nMr Mueller said the airline would not be changing its brand name, in part because it was too expensive to repaint all of its aircraft. \"I would not call it a hard rebranding,\" he said. \"It is really more a brand refresh.\"\nMr Mueller said the airline would not be changing its brand name, in part because it was too expensive to repaint all of its aircraft. AFP The changes will include new staff uniforms and improved products that will allow it to better compete with carriers around the region. For example, its A330 aircraft flying to Australia do not have fully flat beds in business class at present and the in-flight entertainment system is dated compared with competitors such as Emirates, Singapore Airlines and Qantas Airways.\nMalaysia Airlines has pulled back on capacity to Australia in the wake of the MH370 and MH17 crashes last year. In August, it cut the number of weekly flights from Australia to 43 from 73 by dropping Brisbane flights altogether and reducing frequencies from Melbourne, Sydney, Perth and Adelaide. Rival AirAsia X has also cut capacity to Australia as both carriers had added flights ahead of demand even before the two Malaysia Airlines crashes last year.\nMr Mueller said Malaysia Airlines had previously tried to compete on the Kangaroo route by attracting traffic between Australia and Europe via its hub in Kuala Lumpur, but it was less likely to do so in the future now that Middle Eastern carriers were so dominant. This week, Qatar Airways said it would introduce new flights from Sydney to its Doha hub from March and the bulk of those passengers will be flying onward to European destinations.\n\"I believe that [Kangaroo route] market is gone for people like us or Singapore Airlines or Garuda [Indonesia] or Thai [Airways],\" Mr Mueller said. \"It is firmly in the hands of Middle East carriers. But also we recognise China, Cambodia, Vietnam, Laos, India, are growing and that is where we will focus. We going from a northwest/southeast focus more to a north/south.\"\nMueller says Malaysia Airlines will consider adding more capacity to Australia. He said Malaysia Airlines would consider adding more capacity from Australia, including a reintroduction of its Brisbane services. But he said that would not occur for at least another year until the carrier could lower its cost base at a time when it faces competition in the market from AirAsia X and soon, Malindo Air, which plans to fly from Perth to Kuala Lumpur.\n\"What we currently have in Australia should be the seabed with potential for increases should the market grow,\" Mr Mueller said. \"But as you know, the Australian dollar has depreciated 20 per cent approximately. The GDP is softening.\"\nThe reporter travelled to Kuala Lumpur as a guest of Malaysia Airlines and Tourism Malaysia", "external_links": ["http://www.smh.com.au/business/aviation/mh370-wreckage-may-help-piece-together-flights-final-moments-says-expert-geoff-dell-20150730-ginmi0.html", "https://twitter.com/Jamie_Freed"], "published": "2015-10-02T06:17:00.000+03:00", "crawled": "2015-10-02T04:13:35.037+03:00", "highlightTitle": ""}