{"organizations": ["OsarCapital", "SUN PHARMA & TCS", "Kodak", "Infy & TCS", "Osar Capital", "Google", "NAMO", "Nokia", "Page Industries", "Human Equity Research Robots", "Google & Apple of India"], "uuid": "e52b222c6fa5288cec41af1977ef86c9f6015de3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/73", "section_title": "Artipot: Finance > Stock Market Articles", "url": "http://www.artipot.com/articles/1940276/osar-capital-revolutionizing-investment-advice-in-india.htm", "country": "US", "title": "Osar Capital revolutionizing Investment Advice in India (Osar capital)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Osar Capital revolutionizing Investment Advice in India (Osar capital)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T10:03:00.000+03:00", "replies_count": 0, "uuid": "e52b222c6fa5288cec41af1977ef86c9f6015de3"}, "author": "", "url": "http://www.artipot.com/articles/1940276/osar-capital-revolutionizing-investment-advice-in-india.htm", "ord_in_thread": 0, "title": "Osar Capital revolutionizing Investment Advice in India (Osar capital)", "locations": ["moon", "US", "Asia-Pacific", "INDIA", "China", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robert Hagstrom", "Mark", "Howard Mark", "Team Osar", "Osar", "HERR", "Warren Buffet"], "text": "By Osar capital Oct 3, 2015 Osar Capital is the one of the fastest growing Investment advisory firms in the Asia-Pacific region. We have in place a very robust business model backed by extremely talented Investment Experts and we work very hard at what we do whilst urging our clients to dream big. In fact, we are on the verge of revolutionizing Investment Advise in our country by telling youngsters to start buying stocks even before they turn 10. Warren Buffet the greatest investor on Planet Earth started his investing journey when he was just 11 years. Just come to think of this: Warren Buffet is worth US $ 60+billion. Now, even if you manage to make half of 1 per cent of that by starting your investment journey during the prime of your life, you'll end up with US$ 300 million [ or Rs.1950 crores ] You see, we have this big dream of driving the next big wave of the Equity cult by targeting all youngsters in urban and rural India through our sophisticated Apps which is likely to roll out any time soon. We want our youngsters to start their wealth creation journey as soon as possible even as India plans to defeat China on the socio-economic front. And sure, this is going to take several years when we just look at a few indicators like: we have 65 pc literacy and the Chinese are 94 pc literate! China has mind-boggling forex reserves of USD 2.65 trillion and we have just USD 350+ billion. Unemployment is 4.2 pc in China and its 9.4 pc in our countryINVEST WHEN YOU ARE YOUNG & DIVEST WHEN YOU ARE OLDThat's the theme folks - after all what's the point of buying a Page Industries when you turn 50 years old from now - maybe you'll get Page then for 50000 + bucks! So, makes sense to buy Page now if you get it say in range of around 10000 bucks. Had you bought Page in March 2007 you could have well got it at around RS.250/share and that's become a 50 bagger today in about 8 years flat - no stock split as yet. You can't get such returns even from compounding your money at 10 per cent. And what's the point of going for a PMS service when you are celebrating your 75th birthday - but that's OK if your gut feeling tells you that you'll live for beyond a century! But as we said the earlier you start the better for you - you'll never regret your decision. TRUSTWORTHY INVESTMENT ADVISE AT ITS BEST In the world of Finance and Investment you will meet a lot of guys who talk a lot but will hardly walk the talk. And you'll also come across lots of Experts who will promise you the moon but will eventually give you peanuts. But at Osar Capital our team is always ever ready to let go of past thoughts and ideas when new evidence or experience emerges. What this all means is figuring out how to be intellectually honest about how things work and never becoming over confident. We give you sound Investment, Trading and Financial Planning advise based on thorough research and sound unbiased judgement. STOCK MARKETS ARE CHALLENGING, BEATING THE MARKETS IS HARD BUT NOT FOR OSARQuite some time back legendary investor Howard Mark articulated his thoughts on how hard it is to beat the markets thus: 'why should superior profits be available to the novice, the untutored or the lazy? Why should people be able to make above average returns without hard work and above average skill, and without knowing something most don't know? And yet many individuals invest based on the belief that they can.' Now, we at OsarCapital fully endorse Mark's views and by doing so we take great pains to urge the aam aadmi to become a privileged Member of OsarCapital so that Team Osar can help these poor souls to become very rich souls, financially and consequently spiritually! After all, what more do you want in life after you become a billionaire! And yes, we do recommend our clients to thoroughly read The Warren Buffet Way by Robert Hagstrom - this the very book that Gaurav Amin, Head of Risk, Albourne Partners read at age of twelve. You see, we go beyond the call of duty to discipline our clients by urging them to start early and stay invested for the long term. You bet we are the true revolution-charged Investment Advisors in this part of the Asia-Pacific region.IF YOU ARE AFRAID OF THE STOCK MARKETS, WE SUGGEST YOU KICK YOUR FEAR TO THE CURB - LIKE THIS Remember the saying: do what you fear and the death of fear is certain. In today's complex world there is hardly any avenue other than stock markets where you stand a good chance to live a royal financial life after factoring boring taxes and inflation. Indeed you can even become a billionaire like Warren Buffet but it takes a lot of hard work and lots of patience too. But not to worry. With OsarCapital on your side, you need not fear the treacherous and bewildering stock markets. We'll help you rip off your fear and tell you exactly what to buy, when to buy and how much to buy. Ditto while doling out advise to sell. 10 YEARS FROM NOW YOU MAY GET A 24/7 DIGITAL ADVISOR BUT OSAR CAPITAL GIVES YOU A HUMAN ADVSIOR THAT WOULD BEAT A COMPUTERSISED ADVISOR HANDS DOWN, TODAY!As information explodes like a volcano spewing out hot lava, many folks are finding it extremely difficult to sift through the data in order to make sense from it and take a rational decision that will do their portfolio a lot of good. And as you guessed, there may at be just 1 in a million who may be smart enough to act smartly despite the tons of data that meets their eyes. Fortunately, we at OsarCapital have many Associates who are virtual human computers and we are in the process of devising sophisticated systems that will help you connect with our Human Equity Research Robots [ HERR ] at the click of a button on our Apps, when you are on the go. Talk to them whenever you like, bet on their stock picks, mint money and then go buy some diamonds for HER [ your beloved wife, not HERR ]OOOH SO YOU WANT EXPERT ADVISE ON GREEN STOCKS, CARBON-NEUTRAL AND SUGAR FREE STOCKSOh sure, at OsarCapital we have Associates who have years of expertise and experience in hunting for the best long term value bets in the green technology arena. And while our Experts will always urge you to keep away from building a fat portfolio, they will at the same time help you keep away from stocks that seem too sweet to be picked up.LIFE IS SHORT SO WHY NOT MINT MONEY 24X7 - TRADE JAPAN, INDIA, EURO, US & FOREXAt OsarCapital, we specialize in trading all markets across all continents which means you can start trading in your pyjamas even as you brush your teeth and get the latest updates and bets from our Analysts on the Japanese Stock Markets - the land of the rising sun will beckon you to trade everyday and before you doze off to sleep you can trade Forex, and US stocks and in the intervening period you can play around with the Dalal Street bulls and bears as well as buy some stocks from the Eurozone as well. That will make you a great Global Investor and then you can bet that your neighbor is going to envy you though his wife may admire you!25 YEARS FROM TODAY YOU'LL GET TO SEE EXPONENTIAL FINANCE WILL DISRUTY THE FINANCE INDUSTRYAs sure as sure can be, the world of Finance is changing even as the Internet and Technological break-through are sweeping across continents. Monopolies will be crushed and charred like Kodak or just die a slow death like Nokia. Can you name just one sector which will go into a strong bear hibernation 10-20 years from now - long term investor be careful what you buy today. If you don't know ask us. Our smart Technology Experts are not Astrologers or else they could have predicted NAMO's thundering victory and would have made a thunderous killing buying Nifty Calls by the truckloads months before NAMO became PM. But these tech-savvy Technological Experts at Osar Capital have a laser sharp mind with strong R&D capabilities and they have the gifted vision to see the futuristic financial and industrial landscape before their very eyes. Which also means they can precisely tell you which stocks to buy today for the long term and which stocks to chuck out of the window.FORGET INFOSYS, SUN PHARMA & TCS - CAN YOU SPOT THE GOOGLE & APPLE OF INDIA? If some one is urging you to buy the next Infy & TCS then just give him a pass because he may just be conning you and he doesn't know what he is talking about. You see, the future is going to change dramatically in next 10-20 years and you got to be extremely smart to position your bets in various sectors with deep sound logic and thought process else you'll lose a lot of money irrespective of the fact whether you are a short term or long term player. Better start talking to folks who can help you find the Google and Apple of India! Again, our talented folks at Osar Capital who can see and unzip the current and future technological revolution that is sizzling and swiping across the globe can help you spot and capitalize on the Google & Apple of India. Technology works, technology changes and technology can help you become a millionaire and this technological revolution has already started happening at Osar Capital. Are you in?http://www.osarcapital.com/trading-advisory/", "external_links": [], "published": "2015-10-03T10:03:00.000+03:00", "crawled": "2015-10-04T01:24:07.546+03:00", "highlightTitle": ""}