{"organizations": ["Social Media Customer Service", "Emirates Social Media Customer Service"], "uuid": "d6d07adb5aadfc560346713efe8f707816b7bf55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/ek_social_media_1.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/650584/1/emirates-social-media-customer-service-now-provide.html", "country": "US", "title": "Emirates Social Media Customer Service Now Provides 24-Hour Support In English And Arabic", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Emirates Social Media Customer Service Now Provides 24-Hour Support In English And Arabic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:20:00.000+03:00", "replies_count": 0, "uuid": "d6d07adb5aadfc560346713efe8f707816b7bf55"}, "author": "", "url": "http://www.modernghana.com/news/650584/1/emirates-social-media-customer-service-now-provide.html", "ord_in_thread": 0, "title": "Emirates Social Media Customer Service Now Provides 24-Hour Support In English And Arabic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  21 October 2015 19:20 CET Emirates’ Social Media Customer Service Now Provides 24-Hour Support In English And Arabic Source: ModernGhana.Com \nACCRA, GHANA - October 20, 2015 - Emirates has extended its social media customer service to provide 24-hour support, seven days a week. The airline will also expand its language offering to both Arabic and English on Twitter and Facebook. These services are now live. \nThe social media support channels have been active since August 2012 and allow customers to interact with Emirates for queries and information. Beginning with 50 transactions per day via Facebook private message three years ago, the service has gained traction and is now one of the most popular avenues for customers to reach Emirates. These channels are most effectively used in real time when passengers are travelling and need additional assistance or to leave feedback on a pleasant experience. \nToday, the airline’s consultants handle more than 1,000 queries a day via the two social media channels. These queries range from support with bookings to compliments and feedback on products and services. With the introduction of 24-hour support, response times have greatly improved. \n“Our social media customer service complements other existing channels so customers can reach us in the way they find most convenient. Whether they first come to us via a contact centre and then continue the conversation on social media or email, it has to be a seamless experience. Since we introduced our social media customer support channels, we have been constantly working to update and improve our offering. With travellers based worldwide and in different time zones, providing 24-hour social media support in English and Arabic allows us to be more responsive, and serve more of our customers,” explained Karen Bell-Wright, Emirates’ Senior Vice President of Retail and Contact Centres. \nWhile common queries can be found at the Help Centre on emirates.com, Emirates customers can also get in touch via other channels - through emails, retail outlets and phone. The airline receives 15 million calls a year from customers in 50 countries. The interactions are mostly in English and Arabic but staff are on hand to respond in 14 other languages - via phone or email- to cater to Emirates’ global customer base. \nEmirates’ social media customer service can be accessed from facebook.com/emirates, or on Twitter: @emiratessupport.", "external_links": [], "published": "2015-10-21T21:20:00.000+03:00", "crawled": "2015-10-22T02:28:24.464+03:00", "highlightTitle": ""}