{"organizations": [], "uuid": "763f7701f60a24414f13e8c9c51b7372cf293d91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/iGy467QLN2zGcFtr3mZaMg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/107322fcb09c40e54d81b44db5cbfc21c90c0b9c_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/bp-pay-record-20-8-153311944.html", "country": "US", "title": "BP to pay record $20.8 bln over Gulf of Mexico oil spill: US", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "BP to pay record $20.8 bln over Gulf of Mexico oil spill: US", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T23:07:00.000+03:00", "replies_count": 0, "uuid": "763f7701f60a24414f13e8c9c51b7372cf293d91"}, "author": "", "url": "https://uk.finance.yahoo.com/news/bp-pay-record-20-8-153311944.html", "ord_in_thread": 0, "title": "BP to pay record $20.8 bln over Gulf of Mexico oil spill: US", "locations": ["US", "Gulf of Mexico"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nBritish energy giant BP will pay a record $20.8 billion to settle government claims for damages stemming from the deadly 2010 Gulf of Mexico oil spill, US Attorney General Loretta Lynch said Monday. \n\"This historic resolution is a strong and fitting response to the worst environmental disaster in American history,\" Lynch said at a press conference. \"BP is receiving the punishment it deserves, while also providing critical compensation for the injuries it caused to the environment and the economy of the Gulf region.\" \nThe spill was sparked by an explosion on the Deepwater Horizon rig which killed 11 men and saw millions of barrels of oil flow into Gulf waters, in one of the worst environmental disasters to strike the United States. \nIt (Other OTC: ITGL - news ) took 87 days to cap BP's runaway well -- some 5,000 feet (1,500 meters) below sea level off the coast of Louisiana. \nBeaches were blackened in five states and the region's tourism and fishing industries were crippled in a tragedy that riveted the nation. \nThe global settlement resolves the governments' civil claims under the Clean Water Act and natural resources damage claims under the Oil Pollution Act, as well as economic damage claims of the five Gulf states -- Texas, Louisiana, Mississippi, Alabama and Florida -- along with hundreds of local governments. \n\"With this settlement, federal, state and local governments and the Gulf coast communities will have the resources to make significant progress toward restoring ecosystems, economies, and businesses of the region,\" said Secretary of Commerce Penny Pritzker. \n\"We are committed to ensuring the Gulf Coast comes back stronger and more vibrant than before the disaster. If made final, the settlement will provide the US and Gulf states with the resources and certainty needed for effective restoration planning and improvements.\" \nIt is the largest settlement with a single entity in the history of the US justice department. \nThe consent decree filed in federal court includes the following payments from BP: \n- $5.5 billion penalty under the Clean Water Act: the largest civil penalty in the history of environmental law, the bulk of these funds will be directed to restoration efforts. \n- $8.1 billion in natural resources damages, which includes the $1 billion BP already committed to pay for early restoration. BP will also pay up to $700 million if additional damages to natural resources are discovered. \n- $600 million for other claims which include the cost of the natural resource damage assessment and other expenses. \nThe British energy giant also entered into separate agreements to pay $4.9 billion to the five Gulf states and up to a total of $1 billion to several hundred local governmental bodies to settle claims for economic damages they have suffered as a result of the spill. \nBP's total cumulative pre-tax costs for the disaster were $54.6 billion as reported in its second quarter results in July. \nIt had initially estimated the cost of the global settlement to be $18.7 billion when the deal was announced in July. The government set the total at $20.8 billion as a result of a refinement of the cost analysis also including some funds BP had already committed to pay, Lynch told reporters. \nThe cost to BP of the initial response was more than $14 billion. \nBP pleaded guilty in 2013 to 11 counts of felony manslaughter in a $4.5-billion deal to settle criminal charges. \nBP had previously established a $20 billion trust fund to cover compensation claims. It has paid out more than $13 billion, the bulk of which went to individuals and businesses. \nIt has been able to recover some of the costs from its well partners (Other OTC: UBGXF - news ) .", "external_links": [], "published": "2015-10-05T23:07:00.000+03:00", "crawled": "2015-10-05T23:18:04.647+03:00", "highlightTitle": ""}