{"organizations": ["Chamber of Mines", "UN Global Compact", "AMV"], "uuid": "c8be8f321d1fc7338cbb48ea6a593c90ce394b2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510081764.html", "country": "US", "title": "Africa: Looking Beyond the Vision - An Africa Mining Vision (AMV) Compact with Private Sector Leaders in Africa", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Looking Beyond the Vision - An Africa Mining Vision (AMV) Compact with Private Sector Leaders in Africa", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:55:00.000+03:00", "replies_count": 0, "uuid": "c8be8f321d1fc7338cbb48ea6a593c90ce394b2d"}, "author": "", "url": "http://allafrica.com/stories/201510081764.html", "ord_in_thread": 0, "title": "Africa: Looking Beyond the Vision - An Africa Mining Vision (AMV) Compact with Private Sector Leaders in Africa", "locations": ["Maputo", "Africa", "States"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "document Speaking points for the Commissioner Africa is among the fastest growing regions in the world. New discoveries of oil, gas and minerals in several African countries have raised expectations of populations for rapid economic growth and poverty reduction on the continent. However, economic growth has not trickled down to the people, especially to the youth and women, in terms of social and human development as 69% of people in extreme poverty are in resource driven countries. Indeed, many resource-rich African countries have failed to capitalize on these favorable economic conditions and have not made use of associated side-stream and down-stream activities and opportunities, including non-fiscal benefits such as higher employment and broad-based skills development. This problem has preoccupied policy makers and other stakeholders for many years. The development impacts of mining have traditionally been reported with reference to production, investment, employment, taxation and royalties, and direct effects on the economy. In more recent years, greater emphasis has also been placed on local development impacts, such as the procurement of local goods and services and the provision of skills and infrastructure. Mining companies are increasingly being measured against good economic, environmental and corporate social performance, the triple bottom line approach. Indeed, the quest for ‘sustainability’ has led demands for fairness from African countries’ stakeholders. Recognizing that the extractives sector is characterized by complex relationships and competing demands, rights, and claims from governments, local communities, civil society on one hand and private companies on the other, it has become essential to build a consensus on what constitutes ‘shared value’ and ‘shared benefits’ and how to secure a social license to operate in the 21st century. African governments have become more assertive in developing long term visions for mineral resources; to increase local content; move up the value chain; and increase inter-sectoral linkages between minerals and non-mineral sectors. This emerging narrative of a ‘rising’ Africa is underscored by the adoption of several initiatives such as the African Union’s Agenda 2063; the Common African Position (CAP) on the post 2015 Development Agenda; and the Africa Mining Vision (AMV). The AMV emphasizes the transformative role that the mining sector plays in the delivery of development in Africa. To ensure successful implementation of the AMV, an explicit agreement between AU member States and private sector leaders in the extractive industries is necessary. This agreement which we are proposing, is to be in the form of an AMV Compact between AU member States and private sector leaders in Africa, fashioned along the same lines of the UN Global Compact. The AMV Compact would draw a set of standards that would serve as a benchmark for companies and governments to assess performance, resulting in robust policies that cover a range of principles. The AMV day in 2014 organized during Mining Indaba served as an opportunity to build on the outcomes of the 3rd Ministerial Conference of African Ministers of Mining held from 13-17 December 2013 on the theme “Leveraging the Africa Mining Vision for Africa’s Renaissance: Towards Broader Ownership.” Building on the ministerial meeting in Maputo, the AMV Day focused on how to broaden ownership beyond state actors with the private sector and other stakeholders. It provided a venue for senior officials from both governments and the private sector to brainstorm on the importance of collective partnerships, ownership, and the roles various stakeholders can play in helping realize the objectives of the Vision. One of key takeaways from the AMV Day 2014 was to organize a meeting of Chamber of Mines and other mining business groups across Africa to discuss the contents of the AMV compact with business leaders in Africa. Consolidating the gains from the previous AMV Day, at Mining Indaba 2015, in addition to the AMV Day 2015, the AUC through the African Mineral Development Center organized a dinner dialogue with private sector leaders in Africa. A total of 60 participants including Ministers and senior government officials; senior members of Mining companies; African chambers of mines; women in mining associations; civil society organizations; academia; international financial institutions; implementing partners (AfDB, UNDP); and development partners discussed shared benefits in implementing the AMV. The Dialogue, which included meaningful and frank discussions, highlighted the need for collaborative partnerships, continuous dialogue; and new models of doing business going forward. The process of formulating an ‘AMV Compact with private sector leaders in Africa’ was launched. This type of dialogue was particularly important in light of the downward trend in mineral commodity prices at the time, increased production costs and diminishing profit margins, against a background of increasing demand for an economically and socially responsive industry. This trend called for a sober discussion on how to continue the dialogue on sustainable development principles within the context of depressed pricing. In addition, from September 2015, a new global agenda of sustainable goals as articulated in the post-2015 agenda will also pay attention to the extractive industry. This new agenda will require defining the terms of a new global compact on how to proceed within our planetary boundaries. For the dialogue with private sector leaders to be continuous and meaningful, it is crucial to establish an Africa wide network of Chambers of Mines and Mining Associations. The establishment of such a network would enable an efficient consultation and dialogue process on mineral related issues in Africa between AU constituencies and private sector leaders in Africa. It is in this regard that we are today launching the AMV Compact and I wish you fruitful deliberations and that we will come up with a product that will shape the partnership with the private sector that will contribute to the realization of Africa’s vision as defined by the aspirations of the African people and that inform the Agenda 2063 and the Common African Position on post 2015 development Agenda. I thank you", "external_links": [], "published": "2015-10-08T16:55:00.000+03:00", "crawled": "2015-10-09T01:52:10.406+03:00", "highlightTitle": ""}