{"organizations": [], "uuid": "299d70e4a661431b0c1fc219eb9fe1d7a57ecaba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/15/markets-bonds-euro-idUSL8N12F13Y20151015", "country": "US", "title": "Bund yields near 2-wk lows as markets expect loose Fed, ECB policy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Bund yields near 2-wk lows as markets expect loose Fed, ECB policy | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T11:19:00.000+03:00", "replies_count": 0, "uuid": "299d70e4a661431b0c1fc219eb9fe1d7a57ecaba"}, "author": "Marius Zaharia", "url": "http://www.reuters.com/article/2015/10/15/markets-bonds-euro-idUSL8N12F13Y20151015", "ord_in_thread": 0, "title": "Bund yields near 2-wk lows as markets expect loose Fed, ECB policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON Oct 15 German Bund yields held near their lowest levels in two weeks on Thursday, having fallen sharply in the previous day as weak U.S. retail sales and producer prices data propped up bets that the Federal Reserve would delay a rate hike until next year.\nRetail sales edged up 0.1 percent last month, below expectations for a 0.2 percent rise in a Reuters poll, while producer prices in September posted their biggest decline in eight months, suggesting disinflation was re-emerging.\nThe first U.S. rate increase since 2016 is now expected in March 2016, having been repeatedly postponed in recent months as worries intensify over the impact of China's economic slowdown and low commodity prices.\nGerman 10-year yields, which often track their top-rated peers in the United States but are also pressured lower by expectations of further monetary easing by the European Central Bank, were little changed at 0.55 percent.\nMonetary policy across the Atlantic has a direct impact on Europe. Pushing back expectations of a hike in the United States strengthens the euro against the dollar, dampening the inflation outlook in Europe and stoking expectations that the ECB may provide even more bond-buying stimulus in the future.\nEuro zone money markets are also discounting about a 50 percent chance of a deposit rate cut in the coming year, despite the fact that ECB President Mario Draghi said a year ago official interest rates cannot move any lower.\n\"With Fed hike expectations diminishing, euro/dollar strength in turn revived hopes for a dovish ECB message and money markets started discounting rate cuts further down the road,\" Commerzbank rate strategist Benjamin Schroeder said.\nBund yields fell by more than 5 basis points on Wednesday, but bond-buying has slowed since due to the looming U.S. inflation and initial jobless claims data.\nMost euro zone bond yields were flat to a touch higher.\nSpain plans to issue 3-4 billion euros in 2018, 2025 and 2030 bonds later on Thursday, with ECB easing expectations expected to ensure the auction receives strong demand.\nSpain's Economy Minister Luis de Guindos said on Thursday the government will lower its net debt issuance target for this year below the planned 51 billion euros, having already reduced it from 55 billion earlier this year.\nRabobank strategists said the plans reflect Spain's strengthening economy, which may warrant a rating upgrade from Moody's on Friday. Its current rating with the agency is Baa2.\n\"Moody's rating outlook for Spain is positive and we see some notable possibility it will act on this and upgrade Spain tomorrow,\" they said in a note.\nFrance also sells debt on Thursday. (Reporting by Marius Zaharia; Editing by Tom Heneghan )", "external_links": [], "published": "2015-10-15T11:19:00.000+03:00", "crawled": "2015-10-15T10:31:28.365+03:00", "highlightTitle": ""}