{"organizations": [], "uuid": "1968a25fafb67f809a38f83c6fd57fea9999a0bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/dalda-edible-oils-adds-celebratory-touch-kolkatas-durga-puja-festivities/45836", "country": "US", "title": "Dalda Edible Oils Adds a Celebratory Touch to Kolkata's Durga Puja Festivities", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Dalda Edible Oils Adds a Celebratory Touch to Kolkata's Durga Puja Festivities", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T13:16:00.000+02:00", "replies_count": 0, "uuid": "1968a25fafb67f809a38f83c6fd57fea9999a0bd"}, "author": "", "url": "http://businesswireindia.com/news/news-details/dalda-edible-oils-adds-celebratory-touch-kolkatas-durga-puja-festivities/45836", "ord_in_thread": 0, "title": "Dalda Edible Oils Adds a Celebratory Touch to Kolkata's Durga Puja Festivities", "locations": ["Kolkata", "India", "West Bengal"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Monday, October 26, 2015 4:46PM IST (11:16AM GMT) Dalda Edible Oils Adds a Celebratory Touch to Kolkata's Durga Puja Festivities Kolkata, West Bengal, India \nDalda Edible Oils has always spearheaded creative marketing and consumer-connect initiatives across the country. This year too, Dalda conceptualized and executed some extraordinary installations at Kolkata’s iconic Singhi Park pandal for Durga Puja. Their experiential activities struck a chord with the devotees and saw a remarkable response during the city’s biggest festive week. Dalda Edible Oils made their presence at the pandal unforgettable for the devotees who visited. As they entered, they were greeted by a larger-than-life 20 foot arch gate made with Dalda Kacchi Ghani Mustard Oil bottles. In addition, there was yet another mammoth installation made with the Dalda Kacchi Ghani Mustard Oil bottles that was especially popular. This was a huge replication of Goddess Durga’s powerful chakra, with a diameter as large as 10 feet. Those who visited were also in for surprise treats in the form of delicious food samples prepared in Dalda cooking oil. Patrons could also purchase Dalda’s wide range of products from their stall. Speaking on the special occasion of Dusshera at the conclusion of the celebrations, Ankur Malhotra , Marketing Head for Bunge India , said, “Our collaboration with the Durga Puja celebrations in Kolkata has been a resounding success judging from the kind of response we saw from the people. Our effort was to share their joy and celebration during their biggest, most colourful festival. I am delighted that through this campaign, we have reached out to thousands of households in Kolkata and also have strengthened that emotional connect between the consumers and our brand.” Dalda Edible Oils, over the years, has been largely focusing on the development of inventive platforms to engage with the masses. The brand has always been known for their strategic campaigns that connect with consumers across the country. The most distinctive feature of their campaigns is the emotional connect they cultivate with their target audience. The Durga Puja campaign too was in sync with their specific marketing style, reaching out to their audience in a language they understand while sharing in their happiness and celebrations. In doing so, Dalda maintained the festival’s rich traditional heritage while strategically ensuring brand visibility. About Dalda Dalda is one of India’s iconic brands. It is a heritage of trust handed down over generations. Dalda's name has been part of millions of households across India for the past 75 years as a result of its premium quality and adherence to high quality standards, while being nutritive and uncompromising on taste and aroma. Dalda uses Bunge’s international technology and expertise to successfully make available Dalda's range of refined and taste oils in the Indian market.", "external_links": [], "published": "2015-10-26T13:16:00.000+02:00", "crawled": "2015-10-26T14:26:17.974+02:00", "highlightTitle": ""}