{"organizations": [], "uuid": "c1d89451b83e438ee2f40e849d5669e68ddc5c9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/CS-AA137_SPRINT_G_20151016125105.jpg", "site_section": "http://www.wsj.com/news/world/asia", "section_title": "Asia Business, Finance &amp; Political News - The Wall Street Journal", "url": "http://www.wsj.com/articles/the-plan-to-fix-sprint-1445824911", "country": "US", "title": "The Plan to Fix Sprint", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "The Plan to Fix Sprint - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T05:01:00.000+02:00", "replies_count": 0, "uuid": "c1d89451b83e438ee2f40e849d5669e68ddc5c9f"}, "author": "Ryan Knutson", "url": "http://www.wsj.com/articles/the-plan-to-fix-sprint-1445824911", "ord_in_thread": 0, "title": "The Plan to Fix Sprint", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Marcelo Claure proved himself adept at building a business from scratch, having founded a wireless distribution company, called Brightstar, in 1997 and building it into a multibillion-dollar enterprise.\nNow, he has to prove himself as Mr. Fix It. In August 2014, Mr. Claure left Brightstar to become chief executive of Sprint Corp. S 5.61 % Sprint has been in turnaround mode since a disastrous 2005 merger with Nextel. It has lost subscribers and money for years. Last year, Sprint abandoned plans for a quick turnaround via a merger with smaller rival T-Mobile US Inc., and Mr. Claure was left to come up with a plan to fix the struggling company as a stand-alone business.\nAdding to the challenge is the fact that Mr. Claure hadn’t run a wireless carrier before. Not only was he forced to get up to speed on the company itself, but also come up with ideas for stemming subscriber losses and returning to profitability. The Wall Street Journal spoke with Mr. Claure to discuss the challenge, which he says is the most difficult of his life.\nEdited excerpts of their conversation follow.\nChallenge accepted WSJ: Why were you interested in taking the Sprint job?\nMR. CLAURE: Growing a company [Brightstar] has special flavor. But it’s still playing the middle leagues from a relevance perspective. When I had the chance to run Sprint, to me it was like moving to the major leagues.\nWSJ: What will it mean to you to succeed with a Sprint turnaround?\nMR. CLAURE: My No. 1 goal is for Sprint to become a profitable company, and to finalize what I call an eternal turnaround. This is one of the most difficult turnarounds, probably, in the world: [I took over] a company that burned $5 billion in cash, lost $800 million and had $32 billion of debt.\nI’ve taken on the challenge because I find it hard to understand why a company with over $35 billion in revenue cannot turn a profit. A company that has more customers than the population of Canada, and a company that has one of the highest average revenue-per-user [figures] in the world.\nThere are structural disadvantages that we’re going to fix one by one, and we’re going to turn around Sprint.\nWSJ: What are the differences between managing a smaller company like Brightstar, versus taking the reins of a huge company like Sprint?\nMR. CLAURE: At Brightstar, it was my company. I basically had to tell people, you’re going to do these things this way, and because I said so. And people followed me. Here, you have to lead by example. You have to spend a lot more time explaining to people the “why” behind your decisions.\nHowever, there are tremendous similarities. Everybody likes to win. I don’t care if you work for a small plumbing company or the most successful company in the world. There’s a special flavor to winning.\nENLARGE When I came in, I had a town hall, and I told employees we are losing several hundred thousand handset customers a quarter. I said, in less than a year, we’re going to be gaining customers. If you could survey 100 people there, most of them would say that I was absolutely out of my mind because Sprint had been losing customers for four years. And now, we’re going to have gone to many months of handset positive additions.\nThe next goals for the organization are much, much bigger. It is basically to do things that Sprint has never done. Sprint has never had the best network in the U.S. Sprint hasn’t turned positive free cash flow in many years. Sprint hasn’t made real profit in many years. So now we have set those goals.\nLearning curve WSJ: How did you get up to speed on the intricacies of being a wireless service provider while also managing a company in the midst of a turnaround?\nMR. CLAURE: Every adviser told me to study the company, learn the business for the first 90 days and don’t make any decisions.\nI couldn’t resist seeing broken things and immediately taking action.\nI spent days with my engineers, challenging their decisions, and that forced them to explain their decisions. I did the same thing with the marketing group, with the sales group, with the care group. So I felt after three days that I had enough information to be able to make decisions.\nI look back at our first major decision. I realized that we had way too many subprime customers. My first decision was common sense, to say we’re going to stop selling phones to people who can’t pay their bills.\nThe amount of pushback that I got, people were saying you’re basically going to cut sales by 50%. I said, well we’re going to offer attractive price plans. I woke up that morning very, very nervous. Could my first decision be so bad as to kill sales by 50%? Thank God the decision was right, so we actually increased sales. More important, we increased sales by more than 200% of prime customers.\nParking lot liberties WSJ: What have you done to try to change the company’s habits?\nMR. CLAURE: You look at coming into the parking lot with each executive’s name, and the rest of the company having to freeze their butts by walking half a kilometer to get to their office, I found that disturbing. So I took out the names of everyone in the parking lot. Parking today is first come, first served.\nSecondly, you cannot foster a collaborative environment when people’s offices are completely locked, where you cannot even see the assistant because the offices are so big. Where you need to make fast decisions, people have to work in an open space where I can just walk to somebody’s cube, so we don’t need to schedule meetings for absolutely everything.\nIf you have nothing to hide, if you’re actually working for eight hours, or 10 or 12 hours, however long people decide to work, it’s OK to have windows around conference rooms, it’s OK to have cubicles. Because you’re actually working. If you’re not working, doing social media and spending half the day for personal stuff, then an environment like this will actually bother you.\nAs far as making the rest of the company feel they’re part of the decision, they get a weekly newsletter from me that I write myself in which we tell them what’s going on that week. We recognize employees that had exceptional performance, we discuss challenges and we discuss opportunities. And people write me back. They write me back with incredible ideas, and we actually grab those ideas and we put many of those into practice.\nWe’ve also encouraged people, if they find us doing stupid things, to write to us. You’d be amazed at the amount of emails we get on a weekly basis.\nMr. Knutson is a reporter for The Wall Street Journal in New York. He can be reached at ryan.knutson@wsj.com .", "external_links": ["http://si.wsj.net/public/resources/images/CS-AA145_SPRINT_16U_20151021184210.jpg", "http://si.wsj.net/public/resources/images/CS-AA145_SPRINT_9U_20151021184210.jpg"], "published": "2015-10-26T05:01:00.000+02:00", "crawled": "2015-10-26T04:46:25.080+02:00", "highlightTitle": ""}