{"organizations": [], "uuid": "7a583aaa140557e65a431d3744612f1966554e25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/20/california-calpers-coal-idUSL1N12K01120151020", "country": "US", "title": "Consultant warns CalPERS divesting from coal could hurt returns", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Consultant warns CalPERS divesting from coal could hurt returns | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T05:13:00.000+03:00", "replies_count": 0, "uuid": "7a583aaa140557e65a431d3744612f1966554e25"}, "author": "Rory Carroll", "url": "http://www.reuters.com/article/2015/10/20/california-calpers-coal-idUSL1N12K01120151020", "ord_in_thread": 0, "title": "Consultant warns CalPERS divesting from coal could hurt returns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO Oct 19 As California's pension funds discuss divesting from investments in coal companies, a consultant warned on Monday that past efforts to divert CalPERS' money away from investments deemed unethical have cost the largest U.S. public pension fund between $4 billion and $8 billion.\nIn the past, CalPERS has pulled cash out of tobacco and firearm-related companies as well as from investments in South Africa, Iran, Sudan and some emerging markets on political grounds.\nIt is now considering divesting from 24 coal mining companies totaling about $83 million in holdings after Governor Jerry Brown earlier this month signed a bill directing state pension funds to do so. ( bit.ly/1Nl2mld )\nCalPERS has reported investments in thermal coal mining companies including Peabody Energy and Arch Coal .\nFive of the six divestments campaigns undertaken by CalPers so far have hurt its returns, Andrew Junkin president of Wilshire Consulting, told a meeting of the CalPERS Investment Committee in Sacramento.\nJunkin said that while divestment does not necessarily have to weigh down returns, it does require financial transaction costs that can add up.\nHe also expressed doubts about the effectiveness of divestment, seen by environmentalists as an important front in the battle against climate change.\n\"By divesting you are really giving up your voice, your ability to influence change,\" Junkin said. \"And you've just sold it to somebody else. Those shares are going to get voted by somebody else now instead of by you, and you don't get to advance your goals.\"\nThe new California law calls for the $300 billion CalPERS to sell its holdings in companies that derive at least 50 percent of their revenue from coal mining by July 2017. The law also applies to CalSTRS, the state's $191 billion teachers' pension fund.\nThe law does not guarantee that the two systems divest, however, saying that the funds should only divest from the companies if \"the action is consistent with the board's fiduciary responsibilities.\"\nWhat CalPERS ultimately decides to do will be closely watched by other states including New York and Massachusetts, which are in the early stages of considering similar bills.\nDivestment proponents also hope the California law will send a message that the United States is serious about combating climate change, ahead of international climate change talks in Paris later this year.\nA document by CalPERS staff said coal companies have \"significantly underperformed\" a benchmark over the last year but have slightly outperformed over the last 10 years. (Reporting by Rory Carroll; Editing by David Gregorio )", "external_links": ["http://bit.ly/1Nl2mld"], "published": "2015-10-20T05:13:00.000+03:00", "crawled": "2015-10-20T04:22:12.676+03:00", "highlightTitle": ""}