{"organizations": [], "uuid": "aee1535dcda7077148ec9b062093fe91f50ac0d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/01/12993029/SteveSavant_V2.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/10/prweb12993029.htm", "country": "US", "title": "CreativeOne Appoints Industry Authority Steve Savant as National Marketing Spokesman", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "CreativeOne Appoints Industry Authority Steve Savant as National Marketing Spokesman", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "aee1535dcda7077148ec9b062093fe91f50ac0d6"}, "author": "Sarah Williams", "url": "http://www.prweb.com/releases/2015/10/prweb12993029.htm", "ord_in_thread": 0, "title": "CreativeOne Appoints Industry Authority Steve Savant as National Marketing Spokesman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CreativeOne, a leading independent marketing organization (IMO) serving thousands of independent annuity and life insurance agents and advisors nationwide, announced Steve Savant as its national marketing spokesman today. In his new role, Savant will support the company’s growth strategy through agent recruitment and training, and by leveraging his high profile in the insurance and financial services industry.\nAdditionally, he will collaborate with advisors to produce and present content through rapidly growing online video marketing. “My job is to assist advisors connect with their audiences through content that is education and dialogue-driven,” Savant said. “I’m a content creator through video and the written word. Our unique content will be distributed through websites, social media, CreativeOne’s website and our agents’ websites.”\nA 30-year veteran, Savant has crafted a solid history as an industry authority. Beginning as a record-setting producer, he has more recently specialized in producing informative content to match the changing learning styles of agents and consumers. “Engaging content is all about the first three sentences in a blog, or the first 10 to 15 seconds in a video,” Savant said. “I produce great content that gets right to the crux of the matter, and unpack the story from there.”\nNational in reach, Savant’s work has appeared on hundreds of media outlets, including all of the major TV networks, retail seminars, wholesale workshops and insurance carrier conventions. Additionally, he has contributed as an author to industry-centric sources InsMark, LifeSpecs and Back Room Technician.\nKnown for his ability to connect with an audience, Savant says, “I have the gift of making the complex become comprehensible.”\nA prolific content creator, Savant is excited about his new role, one that continues his creative legacy and allows him to directly touch audiences to help grow the company. “At CreativeOne, I’ll be focusing on the consumer audience. This will help us make current agents more successful, and also attract new producers who see the potential of video. I will also collaborate with the marketing team to work as one unit and deliver the same stylistic messaging,” Savant said.\nRaised in and around Chicago, Savant and his wife, parents to six grown children, live in Scottsdale, Arizona. He can often be heard via radio and teaching engagements in the area.\nABOUT CREATIVEONE\nCreativeOne, a leading national marketing organization for annuities, life insurance and securities, has been assisting insurance and financial professionals build successful practices since 1984. Providing affiliated agents and advisors with hundreds of product options from a variety of carriers, the company delivers superior agent education, advanced marketing training, substantial back‐office support, and considerable industry expertise by 150+ talented and knowledgeable employees. CreativeOne sets an industry standard for its commitment to excellence, ethics and integrity in business, and producer client satisfaction. Headquartered in Leawood, Kansas, CreativeOne serves its affiliated insurance agents and financial professionals, as well as their clients, as One Team with One Voice and One Vision.\n‐###‐", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T21:34:26.983+03:00", "highlightTitle": ""}