{"organizations": ["UK Oil"], "uuid": "bb10f2459456536d998f11c4b92a9e6116ede5e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://www.modernghana.com/logo/final_log.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/650286/1/uk-oil-and-gas-trade-delegation-visits-ghana.html", "country": "US", "title": "UK Oil and Gas trade delegation visits Ghana", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "UK Oil and Gas trade delegation visits Ghana", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T01:00:00.000+03:00", "replies_count": 0, "uuid": "bb10f2459456536d998f11c4b92a9e6116ede5e0"}, "author": "", "url": "http://www.modernghana.com/news/650286/1/uk-oil-and-gas-trade-delegation-visits-ghana.html", "ord_in_thread": 0, "title": "UK Oil and Gas trade delegation visits Ghana", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  19 October 2015 23:00 CET UK Oil and Gas trade delegation visits Ghana By GNA \nAccra, Oct 19, GNA - A delegation from the oil and gas industry in the United Kingdom is in Ghana to explore the investment opportunities for British businesses in the country. \nThe delegation is led by the Energy Industries Council (EIC), the leading trade association for UK companies that supply goods and services to the energy industries worldwide. \nA statement by Elliot Sinclair, the Editor and Communications Manager, EIC, and copied to the Ghana News Agency on Monday, said the trade association, which is making its second visit to Ghana, is being accompanied by eight companies representing a cross-section of the UK oil and gas industry. \nIt said the UK Trade and Investment (UKTI) Department at the British High Commission in Accra would host the trade delegation, which aims to identify opportunities in the market, as well as establish new business relationships and strengthen existing ones. \nThe statement said the delegates would have an opportunity to meet with local oil and gas operators and contractors to better understand the country's industry and the opportunities present. \nIt said in December 2010, the $ 3.3 billion deep-water Jubilee project came online and pushed Ghana to a vivid position among Africa's oil producers. \nIt observed that Ghana's crude oil production reached 99,000 b/d in 2013, and was estimated to rise significantly over the next decade. \nTerry Willis, Director of Africa & Middle East at the EIC and the EIC Mission Leader said: 'The Ghanaian Government's ambitious plans to ramp up commercial utilisation of associated natural gas in order to reduce dependency on unreliable gas imports, while meeting power generation demand, can offer more promising opportunities for the UK supply chain.' \nThe EIC is the leading trade association providing dedicated services to help members understand, identify and pursue business opportunities globally. \nEstablished in 1943, the EIC is a not-for-profit organisation with a large membership of UK-registered companies, who deliver goods and services to the energy industries worldwide. \nThe EIC's membership operates across the oil & gas, petrochemical, pipeline, power, nuclear and renewable industries, collectively employing over a million people and generating over £100 billion in revenues out of their UK-based operations. Headquartered in London, the EIC has a global network of offices, from regional UK offices in Teesside and Aberdeen, to international offices in Rio de Janeiro, Houston, Dubai and Kuala Lumpur. \nGNA", "external_links": [], "published": "2015-10-20T01:00:00.000+03:00", "crawled": "2015-10-20T02:50:44.924+03:00", "highlightTitle": ""}