{"organizations": [], "uuid": "ae7972ce42e5c5d375972092a7ee6e8194a3e65f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/22/rci-results-idUSL3N12M3WI20151022", "country": "US", "title": "UPDATE 1-Rogers Communications profit jumps, Blue Jays boost media", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Rogers Communications profit jumps, Blue Jays boost media | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:56:00.000+03:00", "replies_count": 0, "uuid": "ae7972ce42e5c5d375972092a7ee6e8194a3e65f"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/22/rci-results-idUSL3N12M3WI20151022", "ord_in_thread": 0, "title": "UPDATE 1-Rogers Communications profit jumps, Blue Jays boost media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds subscriber and customer data, background)\nBy Alastair Sharp\nOct 22 (Reuters) - Canada's Rogers Communications Inc reported a jump in third-quarter profit on Thursday that exceeded analyst expectations, helped by higher revenue from its media and wireless businesses, although wireless profit was hit by the cost of subsidizing more smartphones.\nRogers owns the Toronto Blue Jays baseball team and the stadium in which they play, which has been packed this month for playoff games broadcast on Rogers' TV channels.\nRogers, which has the largest share of Canada's wireless market, added 77,000 net postpaid wireless subscribers, who typically spend much more than those who prepay for service. It also gained 77,000 prepay customers.\nRogers had suffered two straight quarters of net wireless defections earlier in the year as CEO Guy Laurence moved away from offering discounts to maintain market share.\nThe cost of wireless equipment rose 27 percent, weighing on profit in the unit due to the higher costs incurred to subsidize more smartphones.\nThe Toronto-based company, which also owns a cable television business and a range of media assets, said net income rose to C$464 million ($353.8 million), or 90 Canadian cents per basic share, in the July-September quarter, from C$332 million, or 64 Canadian cents per basic share, a year earlier.\nOperating revenue rose 4 percent to C$3.38 billion.\nOn an adjusted basis the company earned 92 Canadian cents a share.\nAnalysts had on average expected Rogers to earn 82 Canadian cents a share on revenue of C$3.32 billion, according to Thomson Reuters I/B/E/S.\nIn its fixed-line business, Rogers shed 31,000 cable-TV subscribers and 14,000 landline telephone lines, but gained 24,000 Internet customers.\nThe company said operating revenue in the media unit rose 8 percent on the back of more advertising and subscribers at its Sportsnet channel and a rise in Blue Jays merchandise sales.\n($1 = 1.3114 Canadian dollars) (Additional reporting by Tanvi Mehta in Bengaluru; Editing by Don Sebastian and W Simon)", "external_links": [], "published": "2015-10-22T15:56:00.000+03:00", "crawled": "2015-10-22T15:12:00.363+03:00", "highlightTitle": ""}