{"organizations": [], "uuid": "53c80b54585742519855f238c0c7c31d7d4e6a27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/fincherstephen_hoyersteny_lucasfrank_100915gn.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/256584-inside-the-secret-push-to-save-the-export-import-bank", "country": "US", "title": "Inside the secret push to save the Export-Import Bank", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Inside the secret push to save the Export-Import Bank", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T13:00:00.000+03:00", "replies_count": 0, "uuid": "53c80b54585742519855f238c0c7c31d7d4e6a27"}, "author": "dweaver@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/256584-inside-the-secret-push-to-save-the-export-import-bank", "ord_in_thread": 0, "title": "Inside the secret push to save the Export-Import Bank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Inside the secret push to save the Export-Import Bank Greg Nash By Kevin Cirilli - 10/12/15 06:00 AM EDT \nThe stealth operation to save the Export-Import Bank started with a simple conversation on the House floor. \nMinority Whip Steny Hoyer (Md.), the second-ranking House Democrat, approached Rep. Stephen Fincher (R-Tenn.) with a proposition: Let’s work together. ADVERTISEMENT The conversation in late July set the wheels in motion, with staffers for Hoyer and Fincher quietly collaborating on a discharge petition that — if signed by 218 members of the House — would force an Ex-Im vote on the House floor.\nThe push, which was joined by Rep. Frank Lucas (R-Okla.), culminated Friday in the filing of the first successful discharge petition since 2002, stunning conservatives who thought they had vanquished the bank once and for all. \n\"What we did was show that Congress can still get things done for the American people and move our country forward. It was a significant — and historic — achievement for the House and for the American people,\" Hoyer said. \nThe partisan battle over the bank, which provides financing for American exports, shifted into a higher gear on June 30, when Congress allowed the bank’s charter to lapse. Since then, the bank has been unable to provide new financing and loans — delighting conservative critics who say the bank is a form of cronyism that should be abolished. Pleas to revive the bank have been coming from Democrats, some Republicans, business groups and Fortune 500 behemoths such as Boeing and General Electric. But Rep. Jeb Hensarling (R-Texas), the chairman of the House Financial Services Committee, refused to move on a bill, arguing the bank’s financing predominately benefits politically connected corporations. \"This is a small step toward renewing a competitive free-market economy,\" Hensarling declared in June as the clock wound down on the bank's charter. With Hensarling holding firm, Hoyer and Fincher began reviewing their options. Hoyer on a Sept. 15 call assured Fred Hochberg, the president of the Ex-Im Bank, that he would find a way to get the bank back in business. Hoyer told Hochberg that he would \"raise hell\" to get it reauthorized, according to a source familiar with the conversation. One week after that conversation, Hoyer called Fincher to float the idea of a discharge petition. He told Fincher he could deliver full-scale Democratic support, so long as the Hoyer could get at least 33 Republicans onboard. \nFincher told Hoyer that his request was doable, but he reiterated that his preference was to reauthorize the bank through a government funding measure known as a continuing resolution. But while there was strong support in the House for Ex-Im, success was far from guaranteed; members of the majority are typically fearful of signing a discharge petition, which is seen as an act of rebellion against leadership. The surprise resignation announcement of Speaker John Boehner (R-Ohio) two weeks ago changed the calculus. Ex-Im critics hoped the turmoil of the race for Speaker would work in their favor. Hoyer, however, saw the leadership vacuum as an opportunity. He began a full-fledged whip operation to ensure he'd be able to deliver all the Democratic signatures needed for a discharge petition. He approached members to personally seek their support, a step usually reserved for the most important legislative fights. \"This is a once in a generation thing,\" Rep. Denny Heck (D-Wash.) told reporters. \"If you really fully understood the brilliance behind the whip's machinations about all the steps involved and the timing — you would be blinded by that light.\" Last week, Hoyer, Fincher and Lucas decided it was time to move and announced the discharge petition was being filed. Conservatives reacted with fury, warning Republicans they were ceding the power of the floor to Democrats. \"At a time when our Republican Conference is divided, this will divide it even further,\" Hensarling said in a statement. \"Signing a discharge petition puts the minority in charge and effectively makes Nancy Pelosi [D-Calif.] the Speaker of the House.\" \nRegarding Hensarling's comments, Fincher said, \"It breaks my heart.\" \"Chairman Hensarling is a good man who cares about America, and I respect him to the highest degree,\" Fincher said. \"We disagree on this one issue.\" \nDespite the conservative opposition from Hensarling, as well as powerful groups such as Heritage Action and Club For Growth, the petition garnered 218 signatures. Fincher beat his own target, delivering 42 Republicans to Hoyer’s 176 Democrats. The move sets up a vote in the House on renewing Ex-Im sometime near Oct. 26. Supporters are convinced they will succeed and that the legislation will sail through the Senate and get to President Obama’s desk.Bravery is how Heck described the unusual political maneuver. \"They were threatened with their political lives the minute this rumor got out. It took courage for them to do this,\" he said.", "external_links": [], "published": "2015-10-12T13:00:00.000+03:00", "crawled": "2015-10-12T20:21:50.064+03:00", "highlightTitle": ""}