{"organizations": [], "uuid": "43d68265530a4771394185259e00c74ea25ef7fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/g_mNxodE9Mtd4GFjGxw45A--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/rtr31wuz-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/city-heavyweights-launch-property-exchange-185947482.html", "country": "GB", "title": "City Heavyweights To Launch Property Exchange", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "City Heavyweights To Launch Property Exchange", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T23:21:00.000+03:00", "replies_count": 0, "uuid": "43d68265530a4771394185259e00c74ea25ef7fe"}, "author": "", "url": "https://uk.finance.yahoo.com/news/city-heavyweights-launch-property-exchange-185947482.html", "ord_in_thread": 0, "title": "City Heavyweights To Launch Property Exchange", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Oct 20, 2015, 23:30 BST - UK Markets closed City Heavyweights To Launch Property Exchange By (c) Sky News 2015 | Sky News – 2 hours 8 minutes ago View Photo \n\nA group of heavyweight City executives is preparing to launch the world's first securities exchange dedicated to trading stakes in companies which own single commercial property assets. \nSky News has learnt that a venture called London Real Estate Exchange Limited has been working on detailed plans for months to allow the owners of individual properties to float their holdings in the same way as exchanges devotedto equity and debt securities. \nTrading as International Property Securities Exchange, or IPSX, the revolutionary initiative could be formally launched within months, pending approval from the Financial Conduct Authority (FCA), sources indicated on Tuesday. \nIPSX's board includes prominent City figures including Sly Bailey, the former chief executive of Trinity Mirror (LSE: TNI.L - news ) , publisher of The Daily Mirror; Ian Axe, the former boss of LCH Clearnet; and Sir Brian Ivory, who chairs the hedge fund Marathon Asset Management. \nThe new venture will be chaired by Anthony Gahan, a senior investment banker at Wyvern Partners, an advisory firm. \nSources said on Tuesday that issuers listed on the IPSX exchange would be single commercial real estate asset-owners with a market value of more than £25m. \nThe global institutional real estate market is estimated to be worth in excess of $30 trillion, little less than half the size of the aggregate value of the companies listed on global equity markets. \nOnce launched, the IPSX would potentially open up a new investment alternative to retail investors, who typically have limited access to commercial property assets. \n\"It (Other OTC: ITGL - news ) will allow owner-occupiers to release value locked-up in their properties while enabling them to retain equity control,\" said a person familiar with the IPSX's plans. \n\"It will fulfil a substantial unsatisfied demand from corporate owners.\" \nThe new exchange will oblige issuers to comply with financial disclosure requirements akin to a conventional equity exchange in order to ensure robust governance standards, the source said. \nAnalysts said that the venture had the potential to disrupt traditional models of commercial real estate investment and could help to reposition the asset class as a mainstream, rather than alternative, option for investors seeking to deploy capital. \nProperty market sources said it would also enable banks and other financial sector companies who are confronting the impact of new industry regulation to liquidate parts of their real estate holdings. \nThe prospective launch of the IPSX comes as the owners of other types of exchange are overhauling their business models to respond to changing technology and the evolving demands of both issuers and investors. \nNobody connected to the IPSX could be reached for comment on Tuesday.", "external_links": [], "published": "2015-10-20T23:21:00.000+03:00", "crawled": "2015-10-21T01:30:20.234+03:00", "highlightTitle": ""}