{"organizations": [], "uuid": "e8bf0a87aee9524540a4e634da1646b5abdff91d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/10/07/syria-october-6-2015/ALTERNATES/crop_100x100/Syria+October+6+2015", "site_section": "http://www.bdlive.co.za/personalfinance", "section_title": "Personal Finance | BDlive ", "url": "http://www.bdlive.co.za/world/mideast/2015/10/17/syria-army-begins-offensive-near-aleppo-with-russian-support", "country": "ZA", "title": "Syria army begins offensive near Aleppo with Russian support | Middle East", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "Syria army begins offensive near Aleppo with Russian support | Middle East | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T19:43:00.000+03:00", "replies_count": 0, "uuid": "e8bf0a87aee9524540a4e634da1646b5abdff91d"}, "author": "Agency Staff", "url": "http://www.bdlive.co.za/world/mideast/2015/10/17/syria-army-begins-offensive-near-aleppo-with-russian-support", "ord_in_thread": 0, "title": "Syria army begins offensive near Aleppo with Russian support | Middle East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A Russian Defence Ministry picture release on Wednesday shows a warship launching missiles. The ministry says Caspian Flotilla warships carried out massive strikes against suspected Islamic State facilities in Syria. The misslies passed through the airspace of Iran and Iraq and 'hit targets'. Picture: EPA/RUSSIAN DEFENCE MINISTRY Related articles Hunt for clues as Turkey mourns Air strikes in Syria make Russia an Islamist target NEWS ANALYSIS: Exodus of youth leaves Syria bereft Iranian troops join Syria war as Russia hits rebels BEIRUT — Syrian government forces backed by Russian airpower and allied militias opened a new front against rebel fighters south of second city Aleppo on Friday.\nThe fresh offensive came as Turkey said it had downed a drone of unknown origin that violated its air space close to the Syrian border, and a monitor said the toll in the conflict had risen to more than 250,000 people.\nThe Aleppo offensive is the fourth that President Bashar al-Assad’s regime has launched since Moscow began an air campaign on September 30.\nAleppo city has been divided between regime control in the west and rebel control in the east since mid-2012.\nThe situation is largely reversed in the countryside surrounding the city, which was once the country’s economic hub, and the front lines have been static for some time.\nA security source said the operation in southern Aleppo province was backed by Russian strikes and fighters from Iran and Lebanon’s Hezbollah militia.\nThe joint command for the Aleppo operation issued a statement saying the army had begun operations on the western and southern outskirts of Aleppo \"to liberate you from the armed terrorist groups.\" It warned any resident or village cooperating with rebels would be a military target, but that those who cooperated with the army would be safe.\nThe Britain-based Syrian Observatory for Human Rights said the regime had taken control of two villages during the offensive so far, and that Russian warplanes were pounding two others.\nObservatory head Rami Abdel Rahman said Russia had carried out \"dozens\" of strikes on the area, which is controlled by a patchwork of rebel groups, including moderates, Islamists and Al-Qaeda affiliate Al-Nusra Front.\nThe Aleppo fighting comes a day after regime forces began an operation north of the city of Homs, which lies in the centre of the country and is largely under government control.\nSyrian state media said the operation was intended to restore \"safety and security\" to the area and would not target civilians.\nBut the Observatory said that all but 17 of the 60 people killed in the fighting on Thursday were civilians.\nSince Syrian forces began ground operations in tandem with Russian air strikes on October 7, their focus has appeared to be a stretch of highway between Aleppo and Homs.\nThe fighting north of Homs on Thursday centred around the town of Talbisseh on the highway, and regime operations in neighbouring Hama province have also focused on the key road.\nSyrian forces have also sought to reinforce the coastal province of Latakia, a regime stronghold, fighting rebels in the north of the province.\nMoscow says its strikes have targeted the Islamic State group and other \"terrorists.\" It said on Friday that it had hit more than 380 IS targets in Syria since the start of its bombing campaign.\nBut rebels and their backers accuse Russia of targeting moderate and Islamist opposition forces rather than IS.\nRussia’s entry into the conflict has raised concerns about military accidents in Syria’s crowded air space, where a US-led coalition against IS is also present.\nOn Friday, Turkey said it had shot down an unidentified drone that had violated its airspace near the Syrian border.\nRussia said all its planes in Syria were safe and its drones \"working as normal.\" But the US military said \"all indications\" were that the Turks had downed a Russian drone, adding that the Syrian army did not appear to use the same type of aircraft.\nTurkey has previously shot down Syrian government helicopters and a plane, and has accused Russia of violating its airspace in recent weeks.\nThe Syrian conflict began with anti-government protests in March 2011 but has since spiralled into a multi-front civil war involving the regime and its allies, the rival jihadists of IS and Al-Qaeda, and Kurdish militia as well as a string of rebel groups.\nThe Observatory said on Friday that the death toll was now more than a quarter of a million, over 74,000 of them civilians.\nAnd the UN’s humanitarian chief Stephen O’Brien told AFP that the increasing air strikes on the country were putting aid supply routes at risk.\nThat \"has meant that we have been unable to have as many convoys moving to get the supplies to the people in need,\" he told AFP in an interview.\nAFP", "external_links": [], "published": "2015-10-17T19:43:00.000+03:00", "crawled": "2015-10-18T19:25:34.421+03:00", "highlightTitle": ""}