{"organizations": [], "uuid": "843b06ef5eb2e6502e3a359792532ec0102121c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l1.yimg.com/bt/api/res/1.2/1CLedz_i360ug3J_d0aoSw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-14T085415Z_1_LYNXNPEB9D0EE_RTROPTP_3_MARKETS-STOCKS-FTSE_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/asian-shares-slip-taking-cues-003750073.html?l=1", "country": "GB", "title": "Global shares, dollar slip as China inflation cools", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Global shares, dollar slip as China inflation cools - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 8, "uuid": "843b06ef5eb2e6502e3a359792532ec0102121c3"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/asian-shares-slip-taking-cues-003750073.html?l=1", "ord_in_thread": 0, "title": "Global shares, dollar slip as China inflation cools", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nPeople walk through the lobby of the London Stock Exchange in London, Britain August 25, 2015. REUTERS/Suzanne Plunkett By Marc Jones\nLONDON (Reuters) - World shares fell for a second day running and the dollar dropped to its lowest in almost a month on Wednesday following new signs of a slowdown in China's economy.\nLimp inflation figures from China, volatility in other major emerging markets and more falls in commodities dampened buying.\nMSCI's 45-country All World stock index (.WORLD) was down 0.4 percent at 400.24 points after a near 2 percent drop by Japan's Nikkei had lead Asia lower and as the pan European FTSEurofirst 300 (.FTEUS) opened roughly 1 percent in the red. [.EU][.T]\nThe dollar (.DXY) fell to its lowest in almost a month against other main currencies on bets the uncertainty will prevent a rise in U.S. interest rates, oil slipped again while safe-haven gold (XAU=) notched a fourth day of gains. [/FRX][O/R][GOL/] \nIn Europe, eyes were on Portugal after talks to form a new government had broken down in Lisbon on Tuesday. \nCaretaker prime minister Pedro Passos Coelho, whose center-right grouping won the Oct. 4 election but lost its parliamentary majority, failed to obtain backing from Socialist Party leader Antonio Costa.\nPortugal's bond yields rose, defying a broader debt market rally and though Lisbon stocks were up slightly on day they have shed over 5 percent so far this week and some bank stocks are down as much as 16 percent (BCP.LS).\n\nCOUP MONGERING\nBrent oil (LCOc1) retreated towards $49 a barrel as the International Energy Agency has indicated the oil glut will persist through next year. Industrial metals prices were all lower.\nFragile politics are adding to emerging market risks. Brazil’s real (BRL=) dropped about 2 percent overnight as President Dilma Rousseff accused her opponents of 'deliberate coup-mongering' as tensions rose over a federal audit of how deficit numbers were published.\nThe focus was still mostly on China though and what kind of reaction there will be from authorities there to clearly slowing growth. The country's authorities are due to announce a new five-year economic plan later this month.\nChina's consumer price index (CPI) rose 1.6 percent in September from a year earlier, the National Bureau of Statistics(NBS) said, falling short of expectations of 1.8 percent and down from August's 2.0 percent.\nEarlier in the day, the Monetary Authority of Singapore (MAS) had said that it will ease its monetary policy for the second time this year by slowing the pace of the Singapore dollar's appreciation. The move was aimed at reviving an economy that narrowly avoided a recession in the third quarter. \nMSCI's broadest index of Asia-Pacific shares outside Japan ended down 0.6 percent, while Japan's Nikkei stock index (.N225) slumped 1.9 percent.\n\nChinese shares were also lower, but only just. The blue-chip CSI300 index down 0.9 percent and the Shanghai Composite Index (.SSEC) losing 0.8 percent. \nAustralian shares (.AXJO) also nudged lower, reflecting China's importance as Australia's main trading partner. It also came after Wall Street had dropped off a seven-week high (SPX).\nThe U.S. central bank will hold just two more policy meetings in 2015, on Oct. 27-28 and Dec. 15-16, with expectations fading that the Fed will deliver a hike this year. [FED/DIARY] \nThe yield on benchmark 10-year Treasuries slipped to 2.042 percent in early European trading while Wall Street futures were pointing to a steady restart. (ESc1) \nThe dollar index (.DXY), which tracks the greenback against a basket of six peers, was down about 0.2 percent as the euro clawed itself back above $1.1411 (EUR=). \n\n(Reporting by Marc Jones)\nStocks & Offerings China Japan", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T13:45:56.184+03:00", "highlightTitle": ""}