{"organizations": ["Renamo"], "uuid": "d3c1ee9d988dcecbfd4e5f373cfe4a447a6d7727", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510180170.html", "country": "US", "title": "Mozambique: Germany to Grant 37 Million Euros for Districts", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Mozambique: Germany to Grant 37 Million Euros for Districts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T21:47:00.000+03:00", "replies_count": 0, "uuid": "d3c1ee9d988dcecbfd4e5f373cfe4a447a6d7727"}, "author": "", "url": "http://allafrica.com/stories/201510180170.html", "ord_in_thread": 0, "title": "Mozambique: Germany to Grant 37 Million Euros for Districts", "locations": ["Angola", "US", "Mozambican", "Maputo", "Mozambique", "Inhambane", "Manica", "Germany", "Sofala"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Carlos Agostinho", "Grant", "Philipp Schauer", "Rosario", "Schauer"], "text": "Angola: Agroangola - Coffee Production Needs Strong Mechanisation Maputo — Despite pulling out of the group of donors who provide assistance directly to the Mozambican state budget, Germany plans to grant Mozambique 37 million euros (about 42 million US dollars) for the fight against poverty and the development of districts. German ambassador Philipp Schauer announced this programme on Friday in Maputo after an audience with Prime Minister Carlos Agostinho do Rosario. “We have a decentralization project and we intend to channel 37 million euros to the development of the districts, since we have found that often the districts have no capacity”, Schauer told reporters. The German aid is focused on three provinces, he added - Manica and Sofala in the centre of the country, and Inhambane in the south. The money is already available, but the districts must draw up local development projects. Asked about Germany's withdrawal from the Programme Aid Partners (PAPs), the group which provides direct budget support, Schauer said “our withdrawal is due to a decision by our parliament. Currently, we do not have many countries that are benefitting from this form of support”. “However, we are committed to assisting Mozambique”, he stressed. The money that had previously gone to general budget support was reallocated to various sectors of activity, especially education. “Mozambique has not lost anything”, he claimed. “There has just been a change of instruments”. He added that the German government has made 60 million euros (about 68 million dollars) available per year to the various sectors, of which 15 million is destined to education. “In the coming years we shall create new progammes and a new investment fund”, he said. “However, we are concerned with the political tensions (i.e. between the government and the former rebel movement Renamo) and we hope there will be a return to the negotiating table”. During his meeting with Rosario “we talked about the reaffirmation of our partnership, and we discussed questions concerning the visits we plan to make in the future to deepen our relations”, Schauer said. Mozambique \nAlmost half a ton of dagga in transit from Mozambique has been confiscated, and two men arrested, in the Shemula area of … see more » Copyright © 2015 Agencia de Informacao de Mocambique. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,700 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-18T21:47:00.000+03:00", "crawled": "2015-10-18T23:56:12.323+03:00", "highlightTitle": ""}