{"organizations": [], "uuid": "252ef8347e60373c7c39aec4d508f8d8e9aa9449", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiplinger.com", "main_image": "http://www.kiplinger.com/kipimages/pages/14067.jpg", "site_section": "http://www.kiplinger.com//about/rss/kiplinger.rss", "section_title": "Kiplinger's Personal Finance", "url": "http://www.kiplinger.com/article/insurance/T027-C001-S003-who-has-to-pay-the-hike-in-medicare-premiums.html?rss_source=rss", "country": "US", "title": "Who Has to Pay the Hike in Medicare Premiums (and How to Avoid It)", "performance_score": 0, "site": "kiplinger.com", "participants_count": 0, "title_full": "Who Has to Pay the Hike in Medicare Premiums (and How to Avoid It)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:00:00.000+03:00", "replies_count": 0, "uuid": "252ef8347e60373c7c39aec4d508f8d8e9aa9449"}, "author": "", "url": "http://www.kiplinger.com/article/insurance/T027-C001-S003-who-has-to-pay-the-hike-in-medicare-premiums.html?rss_source=rss", "ord_in_thread": 0, "title": "Who Has to Pay the Hike in Medicare Premiums (and How to Avoid It)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "print order a reprint Who Has to Pay the Hike in Medicare Premiums (and How to Avoid It) If you’re one of the 30% of Medicare beneficiaries on the hook for an increase, you may be able to reduce your premiums. Follow @Kiplinger \nI read the Big Price Hikes for Medicare Premiums in 2016 article that said some people may have to pay a 52% increase for Medicare Part B premiums in 2016. Who has to pay this extra amount, and is there any way I can avoid the higher premiums? See Our Slide Show: 11 Common Medicare Mistakes \nOnly about 30% of Medicare beneficiaries would be on the hook for higher premiums of $159.30 per month for Part B. This includes people who don’t have their Medicare premiums deducted from their Social Security benefits (because they aren’t collecting Social Security benefits yet) and people who enroll in Medicare in 2016. \nHowever, if your Medicare premiums are withheld from your Social Security benefits and Social Security does not have a cost-of-living adjustment (COLA) for 2016 because of low inflation, you will continue to pay $104.90 per month for Part B. That’s because the “hold harmless” provision prohibits Social Security benefits from being reduced because of an increase in Medicare premiums. Medicare cost increases are generally covered by the Social Security COLA. Advertisement \nIndividuals with annual incomes over $85,000, or $170,000 for joint filers, who are not protected by the hold-harmless provision, will pay the higher base amount plus a high-income surcharge. Total monthly premiums for them could range from $223.00 to $509.80 per month, depending on the size of their income. (People who qualify for both Medicare and Medicaid would not be protected by the hold-harmless provision, either, but their state Medicaid program would pay the extra premium.) \nMedicare premiums are designed to cover 25% of total Part B costs each year. The premium would be $120.70 in 2016 if everyone were able to pay the increase, according to the Medicare trustees’ report. But if premiums are frozen for 70% of Medicare beneficiaries, the remaining beneficiaries would have to pay $159.30 per month. The final numbers have not been announced yet, and about 70 Medicare, health care and retiree advocacy groups are lobbying Congress to try to get the increase reduced . The U.S. Department of Health and Human Services should announce the official premiums within the next few weeks. \nIf you end up having to pay the higher amount, the following strategies may help you reduce your premiums. \n--If your income has dropped since 2014 because of certain life-changing events, such as divorce, death of a spouse or retirement, you may be able to ask the Social Security Administration to use your more-recent income to determine your Medicare premiums and have the high-income surcharge reduced. Otherwise, your most recent tax return on file (for 2014) will be used to set your 2016 premiums. If that brings your income below $85,000 for single filers or $170,000 for joint filers, you may be able to continue to pay $104.90 per month, assuming your Medicare premiums are deducted from your Social Security benefits. See Medicare Premiums: Rules for Higher-Income Beneficiaries for more information about contesting the high-income surcharge. \n--If you get health insurance from a current employer with 20 or more employees, you can drop Part B or delay signing up for it while you’re still working. You must sign up for Medicare within eight months of leaving your job to avoid a lifetime late-enrollment penalty. If your employer has fewer than 20 employees, this may not be an option; most small employers count Medicare as primary coverage and employer insurance as secondary, which could leave you with big coverage gaps if you don’t sign up for Medicare. See When to Sign Up for Medicare for more information about the rules. \n--If you sign up for Social Security before October 31 and have your Medicare premiums withheld from your checks, you will pay the lower premium, says Timothy Steffen, director of financial planning for R.W. Baird & Co., a wealth-management firm. Your Medicare premiums would be withheld from your November payment, which is received in December, and you’d be eligible for the hold-harmless provision, he says. \nDon’t sign up for Social Security before you’re eligible for full retirement benefits (currently age 66) just to save money on Medicare premiums for one year. The early sign-up will reduce your annual benefits for the rest of your life. But if you are at least full retirement age, you could apply for benefits in 2015 and make sure your Medicare premiums are withheld from your Social Security payments, then suspend Social Security benefits after you qualify for the hold-harmless provision, Steffen says. After you suspend the benefits, you start to earn an 8% delayed retirement credit for every year you wait before claiming Social Security benefits between full retirement age and age 70. You would lose a portion of the delayed retirement credit for the months you were receiving your Social Security payment. See The Power of Filing and Suspending for more on this strategy.", "external_links": [], "published": "2015-10-09T07:00:00.000+03:00", "crawled": "2015-10-10T01:35:31.197+03:00", "highlightTitle": ""}