{"organizations": [], "uuid": "e03c2ff8fc685557e1c3b7065c399ef8eed906a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businessandfinance.com", "main_image": "http://businessandfinance.com/wp-content/uploads/2015/10/Open-plan-office-layouts.jpg", "site_section": "http://businessandfinance.com/feed/", "section_title": "Business & Finance", "url": "http://businessandfinance.com/space-odyssey/", "country": "GB", "title": "Space odyssey", "performance_score": 0, "site": "businessandfinance.com", "participants_count": 1, "title_full": "Space odyssey", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T18:10:00.000+03:00", "replies_count": 0, "uuid": "e03c2ff8fc685557e1c3b7065c399ef8eed906a2"}, "author": "Business and Finance", "url": "http://businessandfinance.com/space-odyssey/", "ord_in_thread": 0, "title": "Space odyssey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Space odyssey Employment , Lifestyle | Wed 7   Michael Fitzsimons explains why your workspace should be used as a strategic asset in attracting and retaining staff. I have a recurring conversation with clients, all of whom are trying to eke out a competitive advantage in their business. How can we attract better talent? How can we retain the talent we have? How can we get ahead? I always ask them to describe their office to me or allow me to take a look around for myself. Most companies tend not to consider their physical workspace as part of their business strategy – ‘it’s just the office’, or ‘it’ll do’, is the common thinking. But very often it could be doing much, much more for the company and for the people who work there. The idea of a ‘workspace’ rather than a functioning office space is relatively new. The larger technology firms like Facebook, Google, Dropbox, Amazon, Apple – and their predecessors – have led the way, taking advantage of new technology to change the way we look at office design. Trends like ‘hot-desking’ and ‘worktivity’ have entered our lexicon, as have atriums, collaborative work areas and offices that wouldn’t look out of place in Architectural Digest. The economy has played its part too, of course. The cranes are back in Ireland and we are on schedule to become the fastest-growing economy in Europe this year. Each new office building or office redesign represents an opportunity for a company to really use the space to its advantage: making it part of their strategic plans and, ultimately, turning it into a business asset that contributes towards end-of-year profits. This, in my experience, is best achieved by putting employees’ well-being at the heart of the design process. Michael Fitzsimons, Office Depot GRAND DESIGNS Most companies don’t have the deep pockets of a Google or a Facebook. But the way these companies think about office design can be instructive for anyone looking to make the most of their workspace. Open-plan design encourages people to interact in a free, non-hierarchical environment. This leads to greater knowledge-sharing at all levels, increases efficiency and productivity, and builds a stronger team spirit. Each new office building or office redesign represents an opportunity for a company to really use the space to its advantage Technological advances have made it possible for more people to work remotely, but the ‘worktivity’ phenomenon can also help to keep employees in the workplace – and keep them happy too. Relaxation areas and social, exercise and play zones all contribute towards a healthier and more balanced working environment. The decisions you make about how your office is laid out can impact on your business, from the welcome you get in reception to the bottom line in your annual report. Flooring, lighting and colour schemes can all increase productivity and keep your most talented people right where they are – something to consider as the job market begins to improve. WORKING IN HARMONY When it comes to designing or revamping your office space, be sure to keep the following in mind: • Consider company culture and the look and feel of your brand – reflect this in the office’s design, furniture and even accessories. This can all have a positive effect on your employees, visitors and clients. • Consider the seating arrangement and capacity of your business, each staff member’s job role requirements, and the need for privacy, meeting and presentation spaces. Smart seating can increase productivity and create a more flexible working environment. • Consider integrating technology into your office architecture. This can reduce inefficient use of space and modernise the look of your office.", "external_links": [], "published": "2015-10-07T18:10:00.000+03:00", "crawled": "2015-10-08T04:20:40.610+03:00", "highlightTitle": ""}