{"organizations": [], "uuid": "7bcd09d65a19ccf8624657b71391d50d7694cdd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/6/x/6/u/image.related.articleLeadwide.620x349.gk5taz.png/1444396897753.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/55/utilities", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/workplace-relations/amazon-asks-corporate-employees-for-feedback-on-work-20151009-gk5taz.html", "country": "AU", "title": "Amazon asks corporate employees for feedback on work", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Amazon asks corporate employees for feedback on work", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "7bcd09d65a19ccf8624657b71391d50d7694cdd0"}, "author": "Spencer Soper", "url": "http://www.smh.com.au/business/workplace-relations/amazon-asks-corporate-employees-for-feedback-on-work-20151009-gk5taz.html", "ord_in_thread": 0, "title": "Amazon asks corporate employees for feedback on work", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"I don't recognise this Amazon and I very much hope you don't, either,\" Jeff Bezos wrote to employees in August. Photo: AP\nAmazon.com Inc wants to know how its white-collar workers are feeling.\nOver the past few months, the online retailer has been ramping up efforts to get regular feedback from corporate staffers about their work environments.\nThe effort is being expanded two months after a scathing newspaper report portrayed the online retailer as a pressure cooker where worker hardships are ignored and back-stabbing is encouraged.\nDubbed Amazon Connections, the internal system poses questions daily to employees to collect responses on topics such as job satisfaction, leadership and training opportunities, people with knowledge of the initiative said.\nAdvertisement The company started the program at its fulfillment centres staffed mostly with blue-collar workers last year and has been rolling it out to other departments since then, first hitting the corporate ranks this summer.\nThe confidential feedback is assessed by a team in Seattle and Prague that compiles the answers in daily reports shared with the company, said one of the people, who asked not be identified discussing internal company communications.\nSome employees will be encouraged to speak in further detail with members of the Connections team. Individual employee responses aren't anonymous, but are shared only with members of the Connections team and the reports will contain only aggregated data.\nCorporate environment Amazon has drawn criticism for its treatment of warehouse workers, many of them on temporary assignments, who are under pressure to move quickly to get customer orders out the door.\nA New York Times report in August shed light on dissatisfaction within its white-collar workforce as well, highlighting the challenge of balancing a fast-growing global business that is changing the way people shop with maintaining a healthy work environment.\nThe New York Times story, based on interviews with more than 100 Amazon employees, described it as a place where \"workers are encouraged to tear apart one another's ideas in meetings, toil long and late,\" and are \"held to standards that the company boasts are 'unreasonably high\"'.\nThe article prompted an email from Amazon founder and CEO Jeff Bezos to his employees, encouraging them to read the story as well as a rebuttal posted by an Amazon employee to the professional-networking website LinkedIn.\n\"I don't recognise this Amazon and I very much hope you don't, either,\" Mr Bezos wrote to employees in August. \"More broadly, I don't think any company adopting the approach portrayed could survive, much less thrive, in today's highly competitive tech hiring market.\"\nBloomberg", "external_links": ["http://www.nytimes.com/2015/08/16/technology/inside-amazon-wrestling-big-ideas-in-a-bruising-workplace.html?_r=0"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T07:03:11.434+03:00", "highlightTitle": ""}