{"organizations": [], "uuid": "07175ee532ff5bbf547e8df4f10bb2599b13654b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30161220/q4-announces-new-quantitative-market-intelligence-suite", "country": "US", "title": "Q4 Announces New Quantitative Market Intelligence Suite", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Q4 Announces New Quantitative Market Intelligence Suite - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T17:01:00.000+03:00", "replies_count": 0, "uuid": "07175ee532ff5bbf547e8df4f10bb2599b13654b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30161220/q4-announces-new-quantitative-market-intelligence-suite", "ord_in_thread": 0, "title": "Q4 Announces New Quantitative Market Intelligence Suite", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New quantitative datasets provide actionable intelligence on stock movements and investor activism activity.\nToronto, Ontario (PRWEB) October 01, 2015\nQ4 Web Systems (Q4), a leading SaaS platform that provides communication and intelligence solutions to IROs and the C-suite of public companies, announced today the release of its Market Intelligence product suite. The new suite includes Q4 Surveillance, a stock trading and ownership surveillance platform, Trading Analytics, a unique set of quantitative analytics focused on market sentiment, volatility and activism, and Relative Performance, which highlights stock and volume contributors affecting specific companies, industries and the market as a whole.\nThe new intelligence suite derives its data from proprietary algorithms developed by former Wall Street quantitative PhD technologists and the senior team of market analysts at Oxford Intelligence Partners, which was recently acquired by Q4. The intelligence is then communicated through Q4’s powerful SaaS platform to provide users with a clear visualization of trading activity, institutional ownership, options market trading, investor sentiment and market volatility.\nKey features of the Intelligence suite include:\nQ4 Surveillance powered by Oxford’s proprietary quantitative analytics, uncovers the real-time trading activity and habits of institutional stockholders.\nTrading Analytics track forward-looking stock sentiment and market volatility to arm IROs with insight into current investor behavior to address potential risks before they occur.\nActivist alerts sensitive to “activist style” trading provide an early warning signal of potential activist accumulations, preparing issuers ahead of a possible hostile situation, well before any other service would have.\nExpected Trading Range forecasts empower IROs with an objective, quantifiable analysis of forward-looking market expectations, allowing them to be proactive, rather than reactive when communicating with the C-Suite and other stakeholders.\nRelative Performance delivers key insight into the contributing factors of stock price and volume performance to truly understand what’s moving not only your stock, but your peers’ as well.\nBy leveraging unique insight into the options market along with deep stock price and market analysis, Q4 is able to provide these predictive datasets to arm the IRO with actionable intelligence on both past and future stock price movements. Q4’s Surveillance solution leverages data and research from the dedicated, seasoned team of analysts at Oxford Intelligence Partners, now part of Q4.\n“The Q4 Intelligence Suite provides companies with a level of insight into their current ownership trends, investor sentiment and potential stock movements that has never been available before,” says Darrell Heaps, Founder and CEO of Q4. \"Traditional market intelligence offerings are not equipped to monitor the increasingly complex capital markets. Q4 Intelligence provides the forward looking insight that IROs and the C-suite need to make effective decisions in today's market.”\nThe Q4 Intelligence Suite is available today through the Q4 SaaS platform. Visit http://www.q4webystems.com for more information or contact sales(at)q4websystems(dot)com .\nQ4 Touch is free and available for both iOS and Android devices. It can be downloaded at:\nApple App Store: https://itunes.apple.com/us/app/q4-touch/id944844669?mt=8\nGoogle Play: https://play.google.com/store/apps/details?id=com.q4websystems.Q4App&hl=en\nFor more information on Q4’s new Market Intelligence products, contact sales(at)q4websystems.com\nAbout Q4 Web Systems\nQ4 Web Systems (Q4) is a SaaS platform that provides communication and intelligence solutions to investor relations officers and the C-suite of public companies. Hundreds of global companies and brands use Q4’s website, mobile, webcasting and intelligence platform to manage, report and understand their engagement with the capital markets. http://www.q4websystems.com\nMedia Inquiries\nJay Roberts or Anita Buchanan\nRoberts Buchanan Associates\n212.924.2582 | 978.821.9877\njay(at)robertsbuchanan(dot)com | anita(at)robertsbuchanan(dot)com\n //www.prweb.com/releases/2015/10/prweb12995834.htm\n ", "external_links": ["http://q4websystems.com/products/intelligence/trading-analytics/default.aspx", "http://www.prweb.com/releases/2015/10/prweb12995834.htm", "http://q4websystems.com/products/intelligence/relative-performance/default.aspx", "http://q4websystems.com/products/intelligence/surveillance/default.aspx", "https://play.google.com/store/apps/details?id=com.q4websystems.Q4App&hl=en", "https://itunes.apple.com/us/app/q4-touch/id944844669?mt=8"], "published": "2015-10-01T17:01:00.000+03:00", "crawled": "2015-10-02T07:44:07.424+03:00", "highlightTitle": ""}