{"organizations": [], "uuid": "14654fc55f2a9d32ace11a3dea62a52aaf394cb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/forex/wp-content/uploads/sites/8/2015/08/dubai1-880x400.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/forex/brokers/exclusive-fortress-prime-aims-to-overcome-obstacles-through-an-acquisition/", "country": "US", "title": "Exclusive: Fortress Prime Aims to Overcome Obstacles Through an Acquisition", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Exclusive: Fortress Prime Aims to Overcome Obstacles Through an Acquisition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:24:00.000+03:00", "replies_count": 0, "uuid": "14654fc55f2a9d32ace11a3dea62a52aaf394cb2"}, "author": "", "url": "http://www.financemagnates.com/forex/brokers/exclusive-fortress-prime-aims-to-overcome-obstacles-through-an-acquisition/", "ord_in_thread": 0, "title": "Exclusive: Fortress Prime Aims to Overcome Obstacles Through an Acquisition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Exclusive: Fortress Prime Aims to Overcome Obstacles Through an Acquisition Exclusive: Fortress Prime Aims to Overcome Obstacles Through an Acquisition Trading volumes at the company have stabilized after the withdrawals issues which have become apparent in August Advertising Print This Post \nIts been a couple of months since Finance Magnates first reported about the withdrawals issues which some clients of Fortress Prime have been facing. Weeks later some clients have received portions of their funds and other have been repaid in full, yet not all customers have been convinced that their funds are safe. \nDespite the issues, the company has managed to stabilize its volumes flow in September according to data obtained by Finance Magnates reporters. Moreover, the ownership of the company could be taking steps to boost the firm’s profile with a big M & A deal in the coming weeks, according to sources with knowledge of the matter. \nFortress Prime has informed its clients that it is facing some anti-money laundering issues with its banks and they will be resolved in the coming weeks. The confidence of the broker’s clients hinges on the efforts of the company’s owners and management to regain credibility. \nWith a prospective high profile M & A deal in the pipeline, the company could be well on its way to establish itself as a major player in the industry. However in order for it to maintain its presence it needs to eliminate all concerns from clients which have surfaced in recent months. Trading volumes \nLooking at the trading volumes of the firm, after a big slump in July, the figures have stabilized somewhat in August and remained stable in September when compared to the broad industry trend. \nMetals trading in September marked the most successful month for the company since its launch over a year ago as the firm’s customers traded over 40,000 contracts. Looking at FX, last month’s volumes declined 8 per cent to $44.8 billion, which is still way above the recent low marked in July, as the company was struggling with withdrawals complaints. \nCFD’s trading picked up materially in recent months as volatility on the equities markets has made that asset class more attractive for a number of traders. Trading Volumes at Fortress Prime by month, Source: Finance Magnates Research Withdrawal delays \nSources with knowledge of the matter have shared with Finance Magnates reporters that the board of the company has reiterated that all clients will be paid in full after claiming that the AML issue for the firm was requiring a new legal framework. \nThe company is currently taking steps to spin out the Fortress Prime business division into its own unit which will allow the management team of the brokerage to obtain control over the finance and compliance functions of the business. The brokerage is currently operating under the umbrella of Fortress Capital Investments. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-10-09T16:24:00.000+03:00", "crawled": "2015-10-09T13:50:13.317+03:00", "highlightTitle": ""}