{"organizations": ["World Bank", "International Bank for Reconstruction and Development", "Ministry of Finance", "Blue Economy", "World Bank Country", "IBRD", "The World Bank Board"], "uuid": "f0a22fc5c1a1b5b4bed8ace139b5cbd106b74f6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510261569.html", "country": "US", "title": "Seychelles: World Bank Supports Reform Efforts in Seychelles Towards Spreading the Benefits of Growth", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Seychelles: World Bank Supports Reform Efforts in Seychelles Towards Spreading the Benefits of Growth", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T12:29:00.000+02:00", "replies_count": 0, "uuid": "f0a22fc5c1a1b5b4bed8ace139b5cbd106b74f6b"}, "author": "", "url": "http://allafrica.com/stories/201510261569.html", "ord_in_thread": 0, "title": "Seychelles: World Bank Supports Reform Efforts in Seychelles Towards Spreading the Benefits of Growth", "locations": ["Indian Ocean", "Washington", "Growth Africa", "Seychelles", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rafael Muñoz Moreno", "Mark Lundell"], "text": "Africa: Why Italy's Income-Based Scheme for University Fees Makes Sense press release Washington — The World Bank Board of Executive Directors today approved an International Bank for Reconstruction and Development (IBRD) loan of US$5 million for Seychelles to support on-going reforms to boost shared prosperity. This operation, Sustaining Reforms for Inclusive Growth, will help improve public expenditure and public investment, boost health prevention and promotion, improve the quality of teaching in schools and colleges, and facilitate access to credit, among others. The selection of these activities was guided by policy dialogue with the government and development partners underpinned by analytical work. \"Inclusive economic growth is the basis for and boosting shared prosperity, and I am very pleased that the World Bank can support Seychelles' efforts to achieve this goal,\" said Mark Lundell, World Bank Country Director for Seychelles.\" So far, Seychelles has achieved impressive results on improving the quality of public services such as education and primary health care and these gains need be sustained.\" The funds will be channeled through the Ministry of Finance, Trade and the Blue Economy to improve the efficiency of public expenditure and the country's business environment through greater access to credit and improved public investment. The pragmatic approach focuses on reforms that can be completed in the short term and can deliver immediate results, while building the foundations for broader reform over the longer term. Seychelles, a small island-state economy with a gross national income per capita of US$13,990, graduated to high income status in 2014. Seychelles has an estimated population of 91,530, comprises 115 tropical islands spread over 45,166 hectares in the Indian Ocean. It has an exclusive economic zone (EEZ) of almost 1.4 million square kilometers, and tourism and fishing/fish processing are the major pillars of the economy, contributing 25 percent and 8 percent of gross domestic product (GDP), respectively. \"Seychelles has had a good performance in reducing poverty. Social indicators are impressive and the country has achieved most of the Millennium Development Goals, especially for education, health, poverty eradication, and the environment,\" said Rafael Muñoz Moreno, World Bank Task Team Leader of the project. The main challenges of the country, however, relate to ensuring that the bottom 40 of the population reaps the benefits of a country with a high income status, though increased employment opportunities and improved public services. Seychelles \nAs consumers when buying products made of plastic or in plastic containers, unless one is environmentally conscious, we … see more » Copyright © 2015 World Bank. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,600 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-26T12:29:00.000+02:00", "crawled": "2015-10-26T17:47:24.253+02:00", "highlightTitle": ""}