{"organizations": [], "uuid": "9e01b7a9e4049880ba91d5f958441736826458f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/10/home-loan-t.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/personal-finance/joint-home-loan-all-you-need-to-know/145380", "country": "IE", "title": "Joint home loan: All you need to know", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Joint home loan: All you need to know | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T16:46:00.000+03:00", "replies_count": 0, "uuid": "9e01b7a9e4049880ba91d5f958441736826458f3"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/personal-finance/joint-home-loan-all-you-need-to-know/145380", "ord_in_thread": 0, "title": "Joint home loan: All you need to know", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Why investing in Pune is a good option Simple ways to eliminate credit card debt Home buyers can now get more loan for property up to Rs 30 lakh: RBI Owning one’s own home is no less than a dream for all.\nWamika Verma, a Delhi-based management professional had a similar dream to own a house in Delhi-NCR after she was well settled. After scouting for a house, she and her husband identified a house in Noida for Rs 1.5 crore for which Wamika decided to apply for a home loan from a public sector bank.\nHaving looked at the home loan figure and scrutinising Wamika’s salary, the bank rejected the application saying she doesn’t meet the eligibility criteria as the income is low and the loan amount is too high.\nOne of her banker friends then suggested to opt for a joint home loan, which raises the home loan eligibility as the repayment capacity goes up along with a co-applicant.\nIn case of Wamika, who is going for a property worth Rs 1.5 crore and where the bank is ready to fund 80 per cent of it which is Rs 1.2 crore, her spouse’s income was considered to determine the loan amount. Together, they both met the eligibility criteria for a 1.2 crore loan that paved the way towards their dream home.\nThis case study highlights that joint home loan is beneficial as it increases the possibility of availing a higher loan.\nAccording to Anil Sachidanand, MD & CEO, Aspire Home Finance Corporation Limited (AHFCL), there are two major benefits of a joint home loan: a) Eligibility Enhancement b) Income Tax deductions. A single applicant’s income might not be enough for servicing higher loan amount and hence the loan amount offered might not be enough to finance a property purchase which has higher loan requirement. A higher loan amount can be availed by clubbing the income of applicants in case of joint loans and avoids compromise on preferred property purchase decision. For eg: In case where both husband and wife are working, their income can be clubbed (by making either of the partner a co-applicant to the application) which enhances the eligibility thereby increasing the quantum of loan that can be offered to them. Apart from the eligibility enhancement, there are tax benefits on joint home loans. However one should note that the co-borrower must be co-owner of the property in order to avail the tax benefits\nJoint home loans are offered to married couples or blood relatives (Parents/ Children/Sibling). Generally working members of the family (Husband / wife, father / son, mother/son etc.) apply for joint home loans as their income is taken in to consideration for eligibility calculation. Repayment of the joint home loan is the responsibility of all borrowers.\nIn case of a dispute\nThe co-borrowers should enter into an legal liability agreement (on a stamp paper) which clearly delineates the liability for each of the borrowers. The borrowers can ask the lending institution in the sanction letter itself that clearly states the liability for individual co-borrowers. In case of a dispute/accidental death/divorce/insolvency etc. which leads to default on home loan, the lending institution can proceed with recovery process against all borrowers. It is also advisable for co borrowers to separately take term life insurance to reduce the financial burden on other co-borrowers in case of his/her demise.\nTax benefits\nThe tax benefit under section 80 c (up to 1.5 lakhs) and section 24 (up to 2 lakhs) in case of housing loan (For self occupied property). This benefit is available for all co-borrowers who are co-owners in case of joint home loans. For eg: in case of a married couple having 50:50 ownership in the property, both can claim these benefits separately. Hence, where in case of a single borrower the tax benefit would be 1.5 lakhs under section 80c and 2 lakhs under section 24, under joint loans combined limit would be Rs.3 lakhs and Rs.4 lakhs in respective sections of Income Tax act (Total deduction of 7 lakhs). One might consider that in case one of the co-borrowers earns higher income and has higher income slab, he might be given higher ownership percentage in the property so that accordingly one can claim for higher tax benefits. The certificate issued by the lending institution, showing the split between principal and interest for the EMI paid, is required for claiming tax benefits. However, it has to be noted that Co-borrowers who are not co-owners would not be able to claim any tax benefits.\nDocuments needed for a home loan\nDocuments needed for processing joint home loan application (Indicative list. This may vary from institution to institution) for each of the borrowers:\nIncome document : income proof, bank statement, Income tax returns\nId Proof : Pan Card, Passport, voters id, aadhar card, driving license\nAddress proof : ration card, aadhar card, electricity bill, telephone bill, gas connection document, passport\nProof of co-ownership of the property\nRepayment process in joint home loan\n“All co-borrowers have the collective responsibility of timely servicing the home loan. Default by any one of the co-borrower makes the other liable to repay the overdue amount. The repayment of the instalment can be made through a single/joint account through cheque/ECS/ACH. For a Lending institution it doesn’t matter which borrower is contributing how much in repayment as long as the instalments are paid on time. Hence, co-borrowers can internally decide who will pay how much instalment and up to what period and accordingly issue cheques,” Sachidanand said.\n 04, 2015 8:46 am © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-10-04T16:46:00.000+03:00", "crawled": "2015-10-10T15:38:25.670+03:00", "highlightTitle": ""}