{"organizations": [], "uuid": "81ef99747dac001afbe2e2db0f7482cfbef0e813", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.livemint.com", "main_image": "http://www.livemint.com/rf/Image-621x414/LiveMint/Period1/2015/10/24/Photos/glenmark.jpg", "site_section": "http://www.livemint.com/money", "section_title": "Livemint - Money, news on finance, stock markets, personal finance, loans and more", "url": "http://www.livemint.com/Companies/5vo7dBK3iqgMP1kX3grmRN/Glenmark-to-sell-GlaxoSmithKlines-asthma-drug-in-Europe.html", "country": "IN", "title": "Glenmark to sell GlaxoSmithKline’s asthma drug in Europe", "performance_score": 0, "site": "livemint.com", "participants_count": 1, "title_full": "Glenmark to sell GlaxoSmithKline’s asthma drug in Europe - Livemint", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T04:25:00.000+03:00", "replies_count": 0, "uuid": "81ef99747dac001afbe2e2db0f7482cfbef0e813"}, "author": "Reghu Balakrishnan", "url": "http://www.livemint.com/Companies/5vo7dBK3iqgMP1kX3grmRN/Glenmark-to-sell-GlaxoSmithKlines-asthma-drug-in-Europe.html", "ord_in_thread": 0, "title": "Glenmark to sell GlaxoSmithKline’s asthma drug in Europe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mumbai: Glenmark Pharmaceuticals Europe Ltd, a subsidiary of Glenmark Pharmaceuticals Ltd, has entered into a strategic development and licensing agreement with Poland-based Celon Pharma SA for selling a generic version of GlaxoSmithKline’s inhaler drug in Europe.\nSeretide Accuhaler (fluticasone/salmeterol dry powder inhaler) is a combination product for the treatment of chronic obstructive pulmonary disease. Seretide, marketed by GlaxoSmithKline, is among the top 3 pharmaceuticals brands in Europe with sales of $2.24 billion as per IMS.\nGlenmark has obtained semi-exclusive marketing and distribution rights for the product across 15 European countries, including UK, Germany, Belgium, the Netherlands, Italy, Sweden, Norway and Romania.\nCelon will receive an upfront payment, followed by certain milestone payments during various stages of the product’s development from Glenmark, as well as royalties on sales. The distribution agreement was concluded for a period of 10 years, with an option of a two-year extension, the company said in a statement on Friday.\n“The deal reinforces Glenmark’s growing capabilities in the respiratory segment and is a significant step forward towards building a strong respiratory franchise in Europe. We are pleased to collaborate with Celon given their established track record with this inhaler product in Europe;” said Glenn Saldanha, chairman and managing director, Glenmark Pharmaceuticals.\nOn Friday, shares of Glenmark gained 1% to close at Rs. 1,029.85 on BSE, while the benchmark Sensex went up 0.67% to close at 27,470.81 points.", "external_links": [], "published": "2015-10-24T04:25:00.000+03:00", "crawled": "2015-10-23T18:32:25.095+03:00", "highlightTitle": ""}