{"organizations": [], "uuid": "35eeb4a47d86b6619494108d687a3ee199886b9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/09/13013823/10-9-15.jpg", "site_section": "http://www.prweb.com/rss2/homefinance.xml", "section_title": "Home and Family: Banking / Personal Finance", "url": "http://www.prweb.com/releases/2015/10/prweb13013823.htm", "country": "US", "title": "Tips For Private Showings & Open Houses", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Tips For Private Showings & Open Houses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "35eeb4a47d86b6619494108d687a3ee199886b9c"}, "author": "Giorgio Urbano Ferrero", "url": "http://www.prweb.com/releases/2015/10/prweb13013823.htm", "ord_in_thread": 0, "title": "Tips For Private Showings & Open Houses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If in the market for a new home purchase, The Federal Savings Bank knows that one is probably trying to figure out the best way to proceed. Call a real estate agent and start scheduling private showings? Or start looking for open houses in desirable neighborhoods? There are advantages to each approach, but really it depends on what kind of home shopper one is. Attend an Open House\nOpen houses are a commitment-free way to get a feel for the housing market. Wake up Saturday morning, grab a latte and the newspaper (or a real estate app), and spend the day cruising around to different homes. According to Trulia, it's a fun way to meet people, learn about different neighborhoods and see how the market looks under a budget. Also many open houses have free drinks and snacks: win-win.\nIf all that sounds like fun, one should know it's fun for other shoppers and curious neighbors as well. Open houses attract crowds, which means it can be difficult to get a close look at the details or condition of the home. In fact, many real estate agents go out of their way to attract attendees just to give the illusion of a more competitive market.\nOne will get to hear lots of questions and gather plenty of introductory information at an open house. But don't expect to leave with a good look at the home. After all, most of what ones saw was for show.\nSchedule Private Showings\nIf past the point of casual interest in the house, then scheduling a private showing is a must. It allows one to take time and ask informed questions. While one might feel awkward poking around the attic, closets or basement at an open house, in a private showing one is free to be nosy about the small (but costly) details of the home - from the age of the hot water heater to the condition of the insulation.\nThat said, if not serious about the home, don't waste one's time or the seller's. The current homeowner will likely vacate while the agent tours around. If the owners have small children, pets or busy schedules, it's rude to inconvenience them if one does not have a serious interest in their property. In fact, know that a smart agent won't schedule a private showing unless they feel sure the buyer is serious. Don't be alarmed if asked to attend an open house first.\nWhether customer, reality, or trusted referral source, The Federal Savings Bank understands how important every purchase or refinance transaction is to help our clients optimize the purchase or refinance of their home.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cudGhlZmVkZXJhbHNhdmluZ3NiYW5rLmNvbQ==", "http://t1947869.omkt.co/track.aspx?id=402|1DB8DD|E52C|0|2BD|0|43C|1|70D8CD72&destination=https%3a%2f%2fwww.thefederalsavingsbank.com&dchk=36CA1405"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T12:50:48.690+03:00", "highlightTitle": ""}