{"organizations": [], "uuid": "0a8a07dff39f7d8b27be6399b970c88c37460007", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/ir9BbkmbhqMU/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-23/imf-said-to-give-china-strong-signs-of-reserve-currency-blessing", "country": "US", "title": "IMF Said to Give China Strong Signs of Reserve-Currency Blessing", "performance_score": 6, "site": "bloomberg.com", "participants_count": 1, "title_full": "IMF Said to Give China Strong Signs of Reserve-Currency Blessing - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T22:49:00.000+03:00", "replies_count": 0, "uuid": "0a8a07dff39f7d8b27be6399b970c88c37460007"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-23/imf-said-to-give-china-strong-signs-of-reserve-currency-blessing", "ord_in_thread": 0, "title": "IMF Said to Give China Strong Signs of Reserve-Currency Blessing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "International Monetary Fund representatives have told China that the yuan is likely to join the fund’s basket of reserve currencies soon, according to Chinese officials with knowledge of the matter, a move that may make more countries comfortable using the unit or including it in their foreign-exchange holdings.\nThe IMF has given Chinese officials strong signals in meetings that the yuan is likely to win inclusion in the current review of the Special Drawing Rights, the fund’s unit of account, said three people who asked not to be identified because the talks were private. Chinese officials are so confident of winning approval that they have begun preparing statements to celebrate the decision, according to two people.\nThe Washington-based lender is reviewing the composition of the basket, with staff members due to present their recommendation to the fund’s executive board for a vote as soon as next month as part of a process scheduled for every five years. The board rejected including the currency following the last review , in 2010, concluding that the yuan didn’t meet the test of being “freely usable.”\nWinning the IMF’s endorsement would validate efforts by President Xi Jinping to push through policies aimed at making the world’s second-biggest economy more market oriented, boosting China’s prestige as it prepares to host Group of 20 gatherings next year. At least $1 trillion of global reserves will convert to Chinese assets if the yuan joins the IMF’s reserve basket, according to Standard Chartered Plc and AXA Investment Managers.\n“Prospects for approval seem to be favorable,” said Otaviano Canuto, executive director at the IMF for 11 countries including Brazil. The story “is going in the direction of the renminbi becoming a necessary component of the SDR,” he said, referring to the currency’s official name.\nThe People Bank of China’s move in August toward a more market-determined exchange rate was a “positive signal,” as was the sale this week in London of yuan-dominated bonds, Canuto said in an interview in Washington. The executive board still needs to consider the final report on the review by IMF staff, he said.\nBoard Discussions Preliminary discussions by the executive board on the issue are pointing toward approval, said two other people familiar with the matter who asked not to be named. The board has requested that IMF staff members look into some of the operational challenges of including the yuan in the basket, such as the ability of the fund’s 188 member nations to quickly convert SDRs into yuan, according to one of the people.\nThe Chinese officials familiar with the matter spoke before the nation took another step toward liberalizing its financial system on Friday, as the PBOC removed the cap on deposit rates. That move was paired with cuts in interest rates and banks’ reserve requirements.\n“We realize that although we’ve done a lot, it’s really first up to the staff, and second up to the board, to make a final judgment,” Jin Zhongxia, China’s representative to the IMF executive board, said in an interview Friday. “We have to fully respect their decision.” While he’s hopeful the board will approve the yuan’s inclusion, Chinese officials are being cautious in promoting their case, Jin said.\nIMF spokeswoman Simonetta Nardin said in a statement that work on the review “continues as scheduled,” with fund staff members currently finishing up their report to be considered in November at a formal meeting of the board, which will make the ultimate decision.\nThe fund created the SDR in 1969 to boost global liquidity as the Bretton Woods system of fixed exchange rates unraveled. The basket currently includes the dollar, euro, yen and pound.\nWhile the SDR is not technically a currency, it gives IMF member countries who hold it the right to obtain any of the currencies in the basket to meet balance-of-payments needs. The equivalent of about $280 billion in SDRs were created and allocated to members as of September, compared with about $11.3 trillion in global reserve assets.\nSDR status is significant as “a seal of approval” from the IMF that the yuan is indeed an internationalized currency, AXA analysts said in May. The yuan can get a potential weighting of about 13 percent, according to an estimate by Bank of America Merrill Lynch in March. HSBC Holdings Plc said in an April note that the yuan’s share could be 14 percent, reflecting China’s importance in global exports.\nLikely Outcome “The most probable outcome is the board will vote to include the renminbi in the SDR basket,” said Meg Lundsager, who served as the U.S. representative on the IMF’s executive board from 2007 to 2014. “I really haven’t heard any big opposition. If there were countries which had real problems with it, they would have been raising their concerns.”\nThe U.S. took a step toward backing China’s SDR bid last month, when it softened its insistence that the Chinese implement financial reforms to win support. The U.S. now says it will support inclusion of the yuan if it demonstrates it meets the IMF’s technical criteria.\n“This is going to make it very hard for the Chinese to undo a lot of these reforms,” said Lundsager, now a public-policy fellow at the Woodrow Wilson International Center for Scholars in Washington. “Once you move into this group of major currencies, it becomes pretty much impossible to backslide.”\nTo be sure, IMF staff said in a report in August that the yuan trails its global counterparts in major benchmarks, such as its use in official reserves, debt holdings and currency trading. Following the recommendation of staff, the board delayed by nine months, until the end of September 2016, the implementation of any change to the basket.\nAt the IMF’s annual meeting earlier this month in Lima, a top Chinese central banker said the government plans a number of measures to strengthen the currency’s case, such as issuing three-month treasury bills on a weekly basis to establish “representative” yuan interest and exchange rates.\n“I think a political decision has already been made,” said Domenico Lombardi, director of the global economy program at the Centre for International Governance Innovation in Waterloo, Ontario. “The Chinese have invested considerable political capital. They’ve mobilized their intellectual and political resources to this purpose, and it’s a case that’s difficult to argue against.”", "external_links": ["http://www.imf.org/external/np/exr/facts/sdr.htm\\"], "published": "2015-10-23T22:49:00.000+03:00", "crawled": "2015-10-23T17:55:35.949+03:00", "highlightTitle": ""}