{"organizations": [], "uuid": "271f879132df6510f1e713f9d2dfe0ab3a6c7455", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/05/eurozone-greece-budget-idUSL5N1221TQ20151005", "country": "US", "title": "Greece to unveil painful 2016 draft budget", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Greece to unveil painful 2016 draft budget | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T05:00:00.000+03:00", "replies_count": 0, "uuid": "271f879132df6510f1e713f9d2dfe0ab3a6c7455"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/05/eurozone-greece-budget-idUSL5N1221TQ20151005", "ord_in_thread": 0, "title": "Greece to unveil painful 2016 draft budget", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Draft budget to keep 2015, 2016 recession targets\n* Tsipras wants quick bailout review, bank recapitalisation\n* Officials say Greece avoiding fight in quest for debt relief\nBy Renee Maltezou and Lefteris Papadimas\nATHENS, Oct 5 (Reuters) - Greece will unveil a painful 2016 draft budget on Monday meant to satisfy international creditors, projecting the economy will stay in recession next year before returning to growth in 2017, in line with the estimates by the country's lenders.\nAfter seven months of heated negotiations with its EU/IMF creditors, Athens agreed in July to implement spending cuts and economic reforms in exchange for an 86 billion euro bailout that kept it in the euro zone under strict supervision.\nAlthough government officials have expressed optimism that the recession this year will be milder than projected in the bailout programme, due to an increase in tourism revenues and stronger than expected first-half data, any change in the economic forecasts will only come later.\nThe debt-ridden economy is officially expected to shrink by 2.3 percent this year and 0.5 percent in 2016. Public debt is seen rising to 196 percent of gross domestic product in 2015 and peak at 201 percent in 2016, including the new loans.\n\"The main targets of the draft budget will not differ from the estimates in the bailout,\" a finance ministry official told Reuters.\n\"Our estimate is for a shallower recession this year and that might be reflected in the final budget that will be submitted to parliament in November, after the first review of the new programme,\" the official said.\nThe bailout projects a 0.25 percent primary budget deficit before debt service this year and a surplus of 0.5 percent next year. Greece is meant to achieve a primary surplus of 3.5 percent of GDP a year from 2018 under the August deal.\nAthens wants to conclude the first bailout review and recapitalise its banks as soon as possible to launch talks with euro zone governments on debt relief, hoping to lure back investors and eventually regain market access, leftist Prime Minister Alexis Tsipras told lawmakers on Saturday.\nSTOP FIGHTING\nDiplomats and Greek officials say Tsipras and his Syriza party have decided to stop fighting the creditors for now and comply with the bailout in the quest for early debt relief and a return to economic independence.\nFinance Minister Euclid Tsakalotos will meet his euro zone counterparts in Luxembourg on Monday evening to discuss a set of reforms that Athens needs to enact by mid-November to qualify for the next tranche of bailout funds.\nAt the same time, Tsipras will present his four-year government programme to lawmakers in Athens before a confidence vote late on Wednesday. The government controls 155 MPs in the 300-seat parliament and is expected to easily pass the vote.\nTsipras was re-elected last month on a mandate to implement the bailout and find ways to ease the social pain that it will entail for the poorest Greeks.\nGovernment officials said he will tell parliament that Greece will stick to the bailout, fight corruption and reform the state. But Tsipras will also outline what the government calls \"grey areas\" where it believes it can negotiate better terms or find alternative measures with the same fiscal impact.\nAlong with debt rescheduling, these areas include labour law, pension reforms, the liberalisation of the energy market and a controversial 23 percent tax on private education.\n\"We want to dive deep, complete the bailout review and the bank recapitalisation, and then move on to the debt talks,\" a government official told Reuters. (Reporting by Lefteris Papadimas and Renee Maltezou; Editing by Paul Taylor and Susan Fenton)", "external_links": [], "published": "2015-10-05T05:00:00.000+03:00", "crawled": "2015-10-05T04:17:08.965+03:00", "highlightTitle": ""}