{"organizations": [], "uuid": "f4a14eb6f40585a7bcad4d97ae9df50b8fdf8aeb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/EM1V2oKnb6BHcLRkt99iDA--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-15T231147Z_2_LYNXNPEB9E196_RTROPTP_3_USA-FED_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/fed-policymakers-downplay-divisions-u-022532684.html?l=1", "country": "GB", "title": "Fed policymakers downplay divisions on U.S. rate hike", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Fed policymakers downplay divisions on U.S. rate hike - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 3, "uuid": "f4a14eb6f40585a7bcad4d97ae9df50b8fdf8aeb"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/fed-policymakers-downplay-divisions-u-022532684.html?l=1", "ord_in_thread": 0, "title": "Fed policymakers downplay divisions on U.S. rate hike", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nThe Federal Reserve headquarters in Washington September 16 2015. REUTERS/Kevin Lamarque By Jason Lange, Howard Schneider and Jonathan Spicer\nWASHINGTON/NEW YORK (Reuters) - Federal Reserve policymakers are not as divided as it may appear and are generally operating under the same framework for determining when to raise interest rates, one Fed official said on Thursday, while another said the differences of opinion reflect the countervailing economic data.\nMany Fed watchers are exasperated by the mixed messages from the U.S. central bank in recent weeks. Fed Chair Janet Yellen and other officials have said they expect a rate hike will be needed by the end of this year, but two Fed governors this week urged caution.\nNew York Fed President William Dudley, who repeated his view that a rate hike was likely by year's end, acknowledged the central bank has not communicated well, but he downplayed the differences that existed among officials.\n\"At the end of the day people are exaggerating\" the divisions, Dudley said in response to a question after a panel presentation in Washington on Thursday. \"We are all pretty much on the same page.\"\nThe Fed surprised half of Wall Street in September by holding rates steady. The central bank was worried by turmoil in global financial markets and the possibility a China-led global economic slowdown could knock the United States off course. \nNow investors and economists are confused over what it will take to get the Fed to pull the trigger. \n\"No one knows what you are doing,\" said John Taylor, a prominent economist on monetary theory who was on the panel with Dudley. \"You can be out there talking all the time and thinking you're being transparent and just confusing things.\" \nIn an at-times heated debate at the Washington conference, Dudley said the Fed has made clear it needs to be more confident that inflation will rise toward its 2 percent target before raising rates. \nHe said it was reasonable for policymakers to come to different conclusions over where the economy is going.\n\"What's unclear is the economy,\" Dudley said.\nLoretta Mester, president of the Cleveland Fed, said she is not surprised that conflicting views are emerging. \n\"We try to be as clear as possible about the rationale behind our decisions,\" she told a New York University audience on Thursday, calling Fed communications \"a journey.\" \"Given the cross currents in the economy, different people can have different views ... which is really reflective of what the committee's decision-making is,\" she said.\nMester, Dudley and the majority of the Fed's 17 policymakers expect to begin raising rates from near zero before year end. \nWhile evidence is mounting that economic growth is cooling in America, Dudley said much of the slowdown appeared to be due to temporary factors. He said a strong dollar was also playing a role but that the economy still seemed to be growing at a healthy clip. \nMoreover, falling unemployment will eventually lead to rising prices, Dudley said, adding that he does not need to see price increases to be confident that they will trend higher. \n\"I see a linkage between pressure on labor market resources and my confidence in inflation,\" he said.\n\n(Reporting by Howard Schneider, Jason Lange and Jonathan Spicer; Editing by Diane Craft)\nBudget, Tax & Economy William Dudley Federal Reserve", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T10:28:50.874+03:00", "highlightTitle": ""}