{"organizations": [], "uuid": "4d50c8eaa8730d374ac70acd5e0d93c3a40fec6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/shoppersshoppingmall_021614getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/256947-consumer-confidence-remains-flat-in-october", "country": "US", "title": "Consumer confidence remains flat in October", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Consumer confidence remains flat in October", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:00:00.000+03:00", "replies_count": 0, "uuid": "4d50c8eaa8730d374ac70acd5e0d93c3a40fec6a"}, "author": "vneedham@thehill.com (Vicki Needham )", "url": "http://thehill.com/policy/finance/256947-consumer-confidence-remains-flat-in-october", "ord_in_thread": 0, "title": "Consumer confidence remains flat in October", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Consumer confidence remains flat in October Getty Images By Vicki Needham - 10/14/15 04:00 PM EDT \nConsumer confidence was flat in October amid growing concerns about slower growth in the labor market and across the broader economy. \nSentiment was 54, up only slightly from 53.9 in September, but behind last year’s index of 54.3, creating some uncertainty heading into the holidays, according to the Thomson Reuters Ipsos Primary Consumer Sentiment Index released Wednesday. ADVERTISEMENT \"Consumers are fed up with the lack of positive economic news,” said Jharonne Martis, director of consumer research at Thomson Reuters.\n“They are unsure where the economy really stands and as a result retail sales have also remained stagnant.\" \nRetail sales barely made any progress in September, rising 0.1 percent as consumers increased spending at restaurants and on clothing and cars, the Commerce Department reported on Wednesday. \nThe National Retail Federation is forecasting a strong holiday season with an expected 3.7 percent increase in sales over last year. \nThe current conditions index showed a small increase to 45 from 44.6 with the improvement largely around more positive feelings about personal finances. \nMeanwhile, expectations were unchanged from last month amid more worries about job security. \nThe jobs index fell to 64.9 from 65.2, but that drop was primarily driven by concerns about future job loss \"rather than any actual experiences with job insecurity,\" the report said. \nA separate report from the Federal Reserve's 12 districts reflected a modestly boosted economy from mid-August through early October as consumer spending grew moderately. \nA stronger dollar held back manufacturing growth, mostly because of the effects of falling oil prices on the energy sector, according to the Beige Book report, which will be analyzed by Fed policymakers at their next meeting later this month. \n\"Some strength was reported in the motor vehicles, aerospace and transportation equipment industries, while metals industries were generally weaker — in part, due to the strong dollar,\" the report said. \nHousing and commercial real estate markets improved and labor markets \"tightened in most districts\" while wage growth remained subdued. \nThe Fed decided last month to delay an increase in a key interest rates amid global financial turmoil. \nAfter two months of slowing jobs growth, concerns have been raised that the economy is losing some of its earlier momentum. Growth hit 3.9 percent in the April-June quarter but may not even clear 2 percent in the July-September period. Tags:", "external_links": [], "published": "2015-10-14T23:00:00.000+03:00", "crawled": "2015-10-15T05:13:18.014+03:00", "highlightTitle": ""}