{"organizations": [], "uuid": "ece419a540bec05ad8d6de617bc365145b0a3499", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DW585_Back_t_ZG_20151016152604.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://www.marketwatch.com/story/retailers-take-consumers-back-to-the-future-2015-10-16?siteid=yhoof2", "country": "GB", "title": "Retailers take shoppers ‘Back to the Future’ as movie series hits milestone - MarketWatch", "performance_score": 0, "site": "marketwatch.com", "participants_count": 1, "title_full": "Retailers take shoppers ‘Back to the Future’ as movie series hits milestone - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "ece419a540bec05ad8d6de617bc365145b0a3499"}, "author": "yahoo", "url": "http://www.marketwatch.com/story/retailers-take-consumers-back-to-the-future-2015-10-16?siteid=yhoof2", "ord_in_thread": 0, "title": "Retailers take shoppers ‘Back to the Future’ as movie series hits milestone - MarketWatch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With the Chicago Cubs in the National League Champion Series and people riding hoverboards , it looks like “Back to the Future Part II” was on to something in the 2015 it envisioned.\nThis Wednesday—Oct. 21, 2015—is the future date Marty McFly traveled to in the DeLorean time machine in the popular 1989 film. To take advantage the futuristic milestone, retailers are looking forward, and back to the movie, to attract fans.\nWal-Mart WMT, -0.74% is rolling out product concepts that may or may not reach shelves. The lineup features a bacon 3-D printer, a jetpack for your cat, a device that will “beam” you into a television program and a cyborg sidekick. The company looked at movie’s future predictions that came true and “key things that people really love,” when creating the concepts, says Wal-Mart spokesperson Jaeme Laczkowski.\nWal-Mart Wal-Mart’s blueprint for the potential cat jetpack. Starting Friday and running through the end of next week, customers can join the waiting lists free of charge for these products to be first in line if they hit shelves — within the next 30 years. As delivery times go, that is a long wait. “Should Wal-Mart Stores, Inc. determine, in its sole discretion, that one or more products are unlikely to become available for sale it may terminate the individual preorder list or this entire preorder program at any time,” the company states on its website. (Laczkowski declined to comment on how many people have signed up thus far.) \nIf you’re willing to pay, you can spend the day like McFly did. PepsiCo PEP, +1.44% released its plans earlier this month to sell “Pepsi Perfect,” the soda McFly orders at a futuristic cafe. Pepsi will be selling 6,500 of the commemorative bottles for $20.15 each on Wednesday. \nMicrosoft’s MSFT, +1.06% Xbox also released a 30th anniversary edition of its “Back to the Future” game.\nEven the MLB has joined in on the buzz. In the movie’s 2015 World Series, the Cubs beat an unnamed Miami baseball team. At the start of this year’s season, the Miami Marlins planned a three-part #RewriteTheFuture campaign, involving fans on social media and selling promotional souvenirs, according to Sports Illustrated. The team donated the proceeds to the Michael J. Fox Foundation for Parkinson’s Research.\nUnfortunately for the Marlins, they were able to “rewrite the future,” by not making the postseason.\nMore from MarketWatch New ‘Star Wars’ toys lure shoppers to playful ‘Force Friday’ event Wal-Mart may need a decade to get its ‘mojo’ back Why Wal-Mart stock’s record plunge is bad news for the broader market", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T20:34:19.290+03:00", "highlightTitle": ""}