{"organizations": [], "uuid": "e6c07edb573d97f7af3e35d908b2ef182600e0dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/s/1/e/e/image.related.articleLeadwide.620x349.gk5mi2.png/1444376471488.jpg", "site_section": "http://www.canberratimes.com.au/business/carbon-economy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/banking-and-finance/genworth-chief-executive-ellie-comerford-to-retire-20151009-gk5mi2.html", "country": "AU", "title": "Genworth chief executive Ellie Comerford to retire", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Genworth chief executive Ellie Comerford to retire", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T15:41:00.000+03:00", "replies_count": 0, "uuid": "e6c07edb573d97f7af3e35d908b2ef182600e0dc"}, "author": "", "url": "http://www.canberratimes.com.au/business/banking-and-finance/genworth-chief-executive-ellie-comerford-to-retire-20151009-gk5mi2.html", "ord_in_thread": 0, "title": "Genworth chief executive Ellie Comerford to retire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Genworth Mortgage Insurance Australia CEO Ellie Comerford has exited the lenders mortgage insurer. Photo: Jessica Hromas\nEllie Comerford, the chief executive of Genworth Mortgage Insurance Australia, is leaving the lenders mortgage insurance giant more than a year after the company listed on the Australian Securities Exchange.\nGenworth's chief financial officer, Georgette Nicholas, will be acting chief executive while a global search takes place for Ms Comerford's successor.\nIn a statement to the Australian Securities Exchange late on Friday, Genworth said Ms Comerford is retiring from the insurer and will remain in an \"advisory role\" until 31 May to \"assist with transitional matters\".\nLuke Oxenham, the company's director of corporate finance and investor relations, has taken on the role of acting chief financial officer. The board has begun a global search for a replacement CEO.\nAdvertisement \"This is a great company which serves its customers and those Australians who have been able to realise their dream of home ownership, and I have been proud to lead it.\" Ms Comerford said in a statement.\n\"The board would like to thank Ellie for her leadership and contributions over the last five years which culminated in the successful completion of the IPO and delivery of solid financial results to date as an ASX 200 company,\" Genworth chairman Richard Grellman said.\nMs Comerford has led the $1.6 billion LMI provider for the past five years. She was previously chief operating officer for the international division of insurance group First American Financial Corporation, and had worked in Citigroup.\nShe was in charge of Genworth when the group's parent company in the US put its plans to partially float the Australia arm in 2012, and oversaw the company's IPO in May last year.\nThe company has been suffering a series of headwinds in the past 12 months, including the loss of a major contract with one of its biggest clients, Westpac Banking Corp.\nGenworth reported a net profit of $113 million for the six months ended June 30, a 25 per cent plunge from 2014. The group's reported net profit was affected largely by an unrealised mark to market loss on its bond portfolio.\nGenworth's share price has plunged 22.86 per cent in the past 12 months to $2.48, compared with the 0.3 per cent losses of the benchmark S&P/ASX200 index.", "external_links": [], "published": "2015-10-09T15:41:00.000+03:00", "crawled": "2015-10-10T09:54:34.334+03:00", "highlightTitle": ""}