{"organizations": [], "uuid": "5ee7768d0d4d3913331d8c046ec9f3964cf8d768", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/lawyer-victims-kin-vows-sue-223541651.html", "country": "US", "title": "Lawyer for victims' kin vows to sue railroad over derailment", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Lawyer for victims' kin vows to sue railroad over derailment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:35:00.000+03:00", "replies_count": 0, "uuid": "5ee7768d0d4d3913331d8c046ec9f3964cf8d768"}, "author": "", "url": "https://uk.finance.yahoo.com/news/lawyer-victims-kin-vows-sue-223541651.html", "ord_in_thread": 0, "title": "Lawyer for victims' kin vows to sue railroad over derailment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Oct 13, 2015, 23:46 BST - UK Markets closed Lawyer for victims' kin vows to sue railroad over derailment Lawyer for victims' kin vows to sue Canadian railroad that skipped settlement after derailment Associated Press – 10 minutes ago Print \nPORTLAND, Maine (AP) -- A lawyer for relatives of most of the 47 people killed in an oil train derailment in Canada described a Canadian railroad's refusal to contribute to a settlement fund as \"reprehensible\" and vowed to pursue a lawsuit. \nCanadian Pacific contends it bears no responsibility for the fiery disaster in Lac Megantic, Quebec, in 2013 and puts the blame squarely on the railroad whose runaway train derailed. \nBut attorney Peter Flowers, who's based in Chicago, said on Tuesday that Canadian Pacific knew the crude oil from North Dakota's Bakken region was unstable before handing it off to another railroad, which he described as \"incompetent.\" \n\"They acted horribly without regard for the welfare of human beings, and we're going to hold them responsible for what they did in front of a jury of 12 people in the state of Illinois,\" he said. \nCanadian Pacific declined to comment on Tuesday. \nMuch of downtown Lac Megantic was destroyed when a runaway train operated by Maine-based Montreal, Maine & Atlantic with 72 oil tankers derailed on July 6, 2013, setting off powerful explosions and causing raging fires. The Maine railroad filed for bankruptcy, and the settlement fund is part of those bankruptcy proceedings in the U.S. and Canada. \nWrongful-death lawsuits were put on hold pending approval of the settlement, which is valued at $338 million in U.S. currency, or $446 million in Canadian currency. Judges in Maine and Quebec have given their approval to the fund, which includes about $110 million in Canadian currency to settle wrongful-death claims brought by victims' families. \nCanadian Pacific declined to contribute to the settlement fund, opening itself up to lawsuits in multiple jurisdictions, unlike settlement contributors that were offered legal protections. \nCanadian Pacific, which transported the oil shipment from North Dakota to Quebec, had fought the settlement until it obtained a judgment reduction provision that allowed it to drop its opposition. \nFinal legal formalities should be wrapped up this week, and payments are expected to be made to victims by year's end, said Robert Keach, a U.S. bankruptcy attorney in Portland. \nBut lawsuits against Canadian Pacific could drag on for a year or more. \nFlowers, who's seeking monetary damages, said he could have his lawsuit before a jury in the Circuit Court of Cook County within 18 months. \n___", "external_links": [], "published": "2015-10-14T01:35:00.000+03:00", "crawled": "2015-10-14T01:46:34.356+03:00", "highlightTitle": ""}