{"organizations": [], "uuid": "77b34ff613fe2a29eee562ea92231ac922cd98ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-mortgages/?format=rss", "section_title": "Mortgages News | Headlines - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/uks-osborne-boe-power-regulate-134411291.html", "country": "GB", "title": "UK's Osborne to give BoE power to regulate buy-to-let mortgages", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "UK's Osborne to give BoE power to regulate buy-to-let mortgages", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T16:44:00.000+03:00", "replies_count": 0, "uuid": "77b34ff613fe2a29eee562ea92231ac922cd98ec"}, "author": "", "url": "https://uk.finance.yahoo.com/news/uks-osborne-boe-power-regulate-134411291.html", "ord_in_thread": 0, "title": "UK's Osborne to give BoE power to regulate buy-to-let mortgages", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Osborne"], "text": "(Adds context) \nBy David Milliken \nLONDON, Oct (HKSE: 3366-OL.HK - news ) 22 (Reuters) - British finance minister George Osborne said on Thursday he wanted to give the Bank of England powers to regulate a type of mortgage used by landlords to buy a growing share of homes. \nThe proportion of Britons who own their own home has fallen to a 26-year low as house prices have outstripped wage growth in recent years and banks have tightened lending rules. \nSome prospective home-buyers say landlords have an unfair advantage as they can access tax-deductible mortgages that do not require capital repayments. These policies now account for almost a fifth of new mortgage lending. \nOsborne set out plans to limit landlords' tax exemptions in a budget statement in July, and on Thursday he said he wanted to give the BoE powers over buy-to-let mortgages that he initially rejected last year. \n\"The governor of the Bank and the FPC (Financial Policy Committee) have asked for additional powers over buy-to-let mortgages ... and we have granted those powers,\" he told a parliamentary committee. \nAsked by a lawmaker if this was a new announcement, Osborne said: \"I'd better wait until we actually make the announcement, but (this will be) as soon as possible.\" \nA finance ministry source said the details of the new powers remained subject to a consultation that was due to start before the end of the year. \nIn 2014, the BoE asked for the power to cap the size of landlords' mortgages as a multiple of their expected rental income, similar to the loan-to-income cap it had imposed on residential mortgages. At the time, Osborne said more consultation was needed before any change was made. \nIn September the BoE said it was closely monitoring the buy-to-let sector. It (Other OTC: ITGL - news ) is due to make its next major statement on financial regulation on Dec. 1, when it could give lenders non-binding guidance to limit buy-to-let mortgages. \nHowever any BoE intervention will not necessarily make it much easier for Britons to buy a home. The central bank's existing mortgage rules are focused on avoiding risks to wider financial stability if there is a bubble in property prices, rather than boosting home ownership rates. \nBritain's Conservative government has taken steps to require builders to ensure a proportion of new homes are 'affordable', but has yet to fully tackle the web of local planning rules that make it harder to build new homes than in many other countries. (Additional reporting by Ana Nicolaci da Costa; Editing by Tom Heneghan)", "external_links": [], "published": "2015-10-22T16:44:00.000+03:00", "crawled": "2015-10-22T23:42:49.277+03:00", "highlightTitle": ""}