{"organizations": [], "uuid": "57b4efe3fe81843793dafde71b6945dda911b444", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/9yXKvwJwl9.f8A0.mH_X0Q--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_AP_HEADLINES_BUSINESS/d4c7e8c71fb5e630850f6a706700b428_original.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/toyota-top-global-vehicle-sales-045315965.html", "country": "GB", "title": "Toyota at top in global vehicle sales for first 9 months - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Toyota at top in global vehicle sales for first 9 months - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 1, "uuid": "57b4efe3fe81843793dafde71b6945dda911b444"}, "author": "Yuri Kageyama, AP Business Writer", "url": "http://finance.yahoo.com/news/toyota-top-global-vehicle-sales-045315965.html", "ord_in_thread": 0, "title": "Toyota at top in global vehicle sales for first 9 months - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nFILE - In this July 2, 2015, file photo, a customer checks the interior of a vehicle for sale at the New Century Volkswagen dealership in Glendale, Calif. Toyota remained the top automaker in global vehicle sales after the first nine months of this year, selling nearly 7.5 million vehicles, outpacing rivals General Motors and Volkswagen. Toyota Motor Corp.'s global sales for the first three quarters totaled 7.498 million vehicles, down 1.5 percent from the same period the previous year, according to numbers released Monday, Oct. 26, 2015. (AP Photo/Damian Dovarganes, File) \n\n\nTOKYO (AP) -- Toyota remained the top automaker in global vehicle sales after the first nine months of this year, selling nearly 7.5 million vehicles, outpacing rivals General Motors and Volkswagen.\nToyota Motor Corp.'s global sales for the first three quarters totaled 7.498 million vehicles, down 1.5 percent from the same period the previous year, according to numbers released Monday.\nVolkswagen AG of Germany sold 7.43 million vehicles, almost unchanged from the previous year, while GM sold 7.2 million vehicles, down 1 percent. Both automakers released their results earlier this month.\nVolkswagen overtook Toyota for January-June, the first time it had come out on top in such tallies. Its sales may suffer because of a scandal, which hit last month, in which its cars were found equipped with software that allowed them to cheat U.S. emissions tests. Until then, Volkswagen had appeared unstoppable with growth going strong in various global markets.\nDetroit-based GM was the top-selling automaker for more than seven decades until being surpassed by Toyota in 2008. GM retook the sales crown for one year in 2011, when a tsunami and quake disaster struck northeastern Japan, disrupting production.\nToyota made a big comeback in 2012, and has been the top automaker for the past three years.\nLast year, Toyota, which makes the Prius hybrid, Camry sedan and Lexus luxury models, sold 10.23 million vehicles.\nVolkswagen sold 10.14 million vehicles in 2014. VW makes the Beetle and Golf cars, and also has the Porsche, Bugatti and Audi brands.\nGM, which makes the Cadillac and Opel cars, was third at 9.92 million vehicles in global sales last year.\n___\nFollow Yuri Kageyama: twitter.com/yurikageyama\nConsumer Discretionary Toyota Volkswagen General Motors Volkswagen AG", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T09:43:05.472+02:00", "highlightTitle": ""}