{"organizations": [], "uuid": "84349017ce29fefc7aca493ac6e7fd4537d49d0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/a/p/m/i/image.related.afrArticleLead.620x365.gk8b38.png/1444967775125.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/hedge-funds-that-shorted-the-big-banks-20151013-gk8b38", "country": "AU", "title": "Hedge funds that shorted the big banks", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Hedge funds that shorted the big banks | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T11:30:00.000+03:00", "replies_count": 0, "uuid": "84349017ce29fefc7aca493ac6e7fd4537d49d0a"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/banking-and-finance/hedge-funds-that-shorted-the-big-banks-20151013-gk8b38", "ord_in_thread": 0, "title": "Hedge funds that shorted the big banks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A high dividend payout ratio is like heroin, Stephen Aboud says. Once you have the hit, it's hard to get off. Tamara Voninski Share on twitter by Christopher Joye \"We were meeting with planners in April and they asked us what our biggest 'short' was, and we said 'Aussie banks',\" recounts the notoriously gruff Stephen Aboud (aka \"Sheikh\"), who, alongside his partner Marcus Hughes, has the \"hottest hands\" in Aussie equities right now.\nTheir $200 million LHC Capital fund is up 21 per cent after fees over the year to September 30, compared to minus 0.75 per cent for the S&P/ASX 200, and delivered a 2.46 per cent return in August, while shares fell more than 7.5 per cent in the wake of China's woes.\n\"We were howled down,\" continues Sheikh, who previously ran the Lowy family's stocks. \"The planners countered: 'What about the banks' yields? Surely that makes them a beautiful bet in a low-cash-rate world?'\n\"We warned them about capital losses and that the highest returns on equity and dividend payout ratios in the world were simply not sustainable. They asked which specific bank we were short – 'all the big boys', was our response.\"\nOver the past three years punters have been told repeatedly by banks, analysts and commentators (present company excluded) that the big banks were among the best-capitalised institutions on Earth and would not have to raise more moolah. When that premise proved horribly wrong in 2015 – as we had said it would since 2013 – many experts claimed the big banks would have to source only as little as $15 billion of extra capital over the next few years. Sell-side \"buy\" calls remained intact. We argued a $45 billion shortfall was closer to the mark.\nExtra equity Before Westpac's $3.5 billion equity issue this week, the big banks had, through gritted teeth, accumulated $27 billion of extra equity over the 2015 financial year through \"surprise\" ASX issues, underwritten dividend reinvestment plans, asset sales and organic capital generation via retained earnings. If you add in \"additional tier one\" (AT1) capital issues (think CBA's $3 billion \"Perls VII\"), total equity capital originated rises to about $32 billion, or almost $36 billion after Westpac's effort this week.\nThe policy goal has been to make what were 24 times leveraged banks much safer and internally insure shareholders, bond investors, depositors and taxpayers against the risk they go bust (a theoretical, if not practical, possibility, given government guarantees and near-infinite bail-out liquidity from the central bank).\n Matt Wilson, head of financial research at the $10 billion Australian equities shop JCP Investment Partners, says the bad news for those \"long\" the oligarchs is that \"we are still only halfway through the majors' capital raising process at best\". Like LHC, JCP is said to have made money on the short side too.\nOn Monday I published analysis showing the big banks' \"leverage ratios\", which divide their tier one equity by total asset exposures, had improved only from 4.5 per cent in June 2014 to 4.8 per cent today . This compares badly with the 6 per cent threshold for the top quartile of 94 large banks globally. Accounting for future asset growth, I calculated the big banks will need another $35 billion of tier one capital if the regulator pushes them towards a leverage ratio of, say, 5.5 per cent by 2019, which is still well below the 75th percentile peer.\nPart of a trend \"This is part of a competitive international trend towards unquestionably strong capital,\" Wilson opines. \"Australia has a highly concentrated, underfunded and capital-importing financial system, and APRA wants the banks to be 'shock absorbers', and not 'accelerants', in the next downturn.\"\nSo hats off to Westpac's Brian Hartzer for taking our advice in August to boost capital and jack-up interest rates on owner-occupied loans, after the banks had justifiably done the same on their investment products. This again demonstrates that the big banks are oligopolistic price setters that possess uniquely powerful business models.\nOne of the last remaining puzzles is why the banks' dividend payout ratios are so high in such a capital-hungry environment. To shed light on this, I investigated how payout ratios have changed over time and rank relative to peers overseas. Contrary to the prevailing capital-raising imperative, CBA, Westpac and NAB have lifted their payout ratios by about 20 per cent since 2007. And the big banks' average 75 per cent payout ratio today looks astonishingly high compared to the 28 per cent average of 11 global competitors (see charts).\nWhat accounts for this disconnect? Rob Luciano, the boss of the $700 million equities investor VGI Partners, says it's partly a reflection of Australia's unique franking system, which avoids double taxation of earnings and allows companies to distribute profits with credits attached that compensate shareholders for the tax the firm has already paid. Australian businesses do not, therefore, have an incentive to retain earnings like their US counterparts to maximise tax-effective compounding.\nNot unique \"Rising dividend payout ratios are not unique to Australian banks,\" Luciano says. \"Most 'blue chip' companies have embraced higher payout ratios, which yield-hungry investors have rewarded with substantial share price appreciation.\"\nYet Luciano cautions this practice \"reduces financial flexibility\" and \"in a shock leaves businesses with fewer choices and less negotiating power if they have to source capital\". In the case of the big banks, which \"already carry high leverage and have enjoyed a dream operating and regulatory environment for decades\", payout ratios are \"very aggressive compared to leading Canadian banks at 40 per cent to 45 per cent\".\nLuciano asserts that a business's sustainable earnings per share (EPS) growth is a \"function of its return on equity and retained earnings\". \"The higher the ROE and the higher retained earnings [or the lower the dividend payout ratio], the greater the sustainable EPS growth,\" he says.\n\"The ASX 200 has a dividend payout ratio of roughly 90 per cent and a ROE of about 10 per cent, while the S&P500 is at around 50 per cent and 13 per cent, respectively. This suggests the sustainable EPS growth of US equities is far superior to Aussie shares, which is why we continue to invest most of our money overseas.\"\nNot sustainable JCP's Wilson does not think payout ratios are sustainable and accuses the big banks of \"over-earning\". \"Bad debts of 0.15 per cent are running at a 63 per cent discount to the through-the-cycle trend of 0.40 per cent,\" he says. \"Should we see a normal credit cycle unfold, then payouts will be cut significantly due to the pro-cyclicality of risk-weighted assets calculations and bad debts jumping above trend.\"\nMany investors highlight the precedent of Wells Fargo, regarded as the best bank in North America, with a return on assets of 1.45 per cent (far higher than the big Australian banks), return on equity of 14 per cent (comparable), and lower leverage. Yet its dividend payout ratio is only 33 per cent and, after adding in buybacks, its total payout ratio is just 54 per cent.\n\"A high dividend payout ratio is like heroin,\" LHC's Aboud says. \"Once you have the hit, it's hard to get off. The banks know retail shareholders cannot get enough of fully franked divvies, so they will do whatever it takes to hold on to them.\"\nAboud reckons artificially high yields also explain why the big banks' \"2.5 times price-to-book valuations are miles above the 1-1.5 times benchmark of global peers\", which he describes as \"a joke\".\nChristopher Joye is a director and shareholder in Smarter Money Investments, which manages fixed-income investment portfolios.", "external_links": ["https://twitter.com/cjoye"], "published": "2015-10-16T11:30:00.000+03:00", "crawled": "2015-10-16T06:57:07.943+03:00", "highlightTitle": ""}