{"organizations": [], "uuid": "be57590244b4acf01cc95830f339772ff8d5296a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/YD2mYqWISKoOriQwu4MCvg--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://globalfinance.zenfs.com/en_us/News/Reuters/17927e138c3ff5f520eb2957f19dc1b2.cf.png", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://finance.yahoo.com/news/dont-let-wal-mart-fool-040001971.html", "country": "GB", "title": "Don't Let Wal-Mart Fool You, U.S. Investors Still Love Consumers - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Don't Let Wal-Mart Fool You, U.S. Investors Still Love Consumers - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 5, "uuid": "be57590244b4acf01cc95830f339772ff8d5296a"}, "author": "Lu Wang", "url": "http://finance.yahoo.com/news/dont-let-wal-mart-fool-040001971.html", "ord_in_thread": 0, "title": "Don't Let Wal-Mart Fool You, U.S. Investors Still Love Consumers - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\n\nThe sight of Wal-Mart Stores Inc. -- often cited as a proxy for everyday Americans -- falling earlier this month by the most since 1988 sent shock waves through stock markets. That doesn’t mean investors are souring on U.S. consumers.\nAfter getting swept up in August’s selloff and falling 10 percent in five days, stocks dependent on the buying power of shoppers have reasserted themselves in the rebound, handing them the biggest gains in the Standard & Poor’s 500 Index for the first time since 2013. Shares with the four best returns in the Dow Jones Industrial Average this year -- Nike Inc., Home Depot Inc., McDonald’s Corp. and Walt Disney Inc. -- belong to the category.\nMore from Bloomberg.com: CEO Who Survived Dotcom Bust Says He Wants to Kill 1-800 Numbers \nWhatever concerns are hanging over the market, from China’s slowing expansion to the Federal Reserve and falling earnings, investors refuse to part with the view that rising employment and lower gasoline prices will keep Americans spending. That’s a good sign for the economy, since gains in the group have usually proved prescient in foreshadowing past expansions.\n“If this were an export-led expansion, I’d be worried because that didn’t touch the rest of the economy as much,” said Joe Quinlan, New York-based chief market strategist at U.S. Trust, which oversees $376 billion. “Consumption gives you a wider base by which the economy and stocks can work off. I don’t see the bull market ending until the U.S. consumer rolls over.”\nMore from Bloomberg.com: Oil at $50 Is ‘Gift to World’ as Abu Dhabi Sees Higher Prices \nFriday Rally Consumer strength was on display in U.S. equities last week as more than $17 billion was added to the market value of Amazon.com Inc. on Friday after the online retailer beat revenue and profit estimates. The day before, better-than-expected earnings sent McDonald shares to the biggest rally in almost seven years.\nAmericans’ expectations for the economy deteriorated to a 13-month low in October, coinciding with a recent slowdown in hiring, data from the Consumer Comfort index showed last week. Economists predict the Commerce Department will say Friday that U.S. personal spending rose in September at a slower pace than a month earlier.\nMore from Bloomberg.com: Barclays to BlackRock Say the China Rebound Rally Won't Last \nAlmost $2 billion has been sent to exchange-traded funds focusing on consumer stocks this month as shares in the group extended a rally from the depths of August’s selloff to 12 percent. The industry was cited as the most favored investment in the latest Bank of America Corp. survey of global money managers.\nWal-Mart Plunge All this is relegating to memory the $21 billion wipe-out in Wal-Mart shares on Oct. 14 after the company said that annual profit will fall rather than rise. Earnings at the world’s largest retailer are being squeezed as the company pumps money into its workforce and e-commerce operations.\nShares of the Bentonville, Arkansas-based company fell 10 percent to $60.03 that day and at the close of last week were down 36 percent from their 2015 high.\n“Wal-Mart’s weakness is more company specific than a sign of trouble across retailers,” said Bill Mann, who helps oversee $1.5 billion as a fund manager at Motley Fool Asset Management LLC in Alexandria, Virginia. “The market is extrapolating much more confidence going forward” in the whole industry, he said.\nMann said his fund owns a higher percentage of consumer stocks than are reflected in benchmark indexes and favors brand names such as restaurant chain Chipotle Mexican Grill Inc. and athletic-apparel make Under Armour Inc.\nLeadership Rotation The ascent in retailers, home builders and media companies is happening at the same time past bull market leaders such as utility and drug stocks crumble. After jumping 10 percent in 2015 for the best industry performance, the S&P 500 Consumer Discretionary Sector Index is less than 1 percent away from its record reached in August. Companies selling consumer necessities, hitting an all-time high last week, are ranked No. 3 after technology, adding 4.3 percent. The S&P 500 is little changed on the year.\nRallies in these companies have preceded faster economic growth in the past. Since 1990, the discretionary group has outperformed the market to the extent it is now on seven occasions -- and five of those times gross domestic product accelerated a year later, with the rate of expansion averaging 2.8 percent. That compares with an average growth rate of 2.5 percent.\nFive Stocks Big winners such as Amazon.com and Starbucks Corp. are masking weakness in the rest of the industry, according to Peter Tuz, who helps manage $400 million as president of Chase Investment Counsel Corp. in Charlottesville, Virginia. The two stocks, along with Nike, Home Depot and Disney, have accounted for almost all of the 59-point gain in the S&P 500 Consumer Discretionary index this year.\nAmong the gauge’s 88 members, half have posted losses and about a quarter of them, such as Michael Kors Holdings Ltd. and Viacom Inc., are down more than 20 percent.\n“It speaks of the sluggishness of consumer income to some degree,” said Tuz. “It speaks to a change in the shopping and entertainment habit,” he said. “Amazon basically is an online version of Wal-Mart. It has tremendous growth and that growth comes at the expense of traditional retailers like Wal-Mart.”\nWhile consumer stocks were overtaken by utilities and health-care providers at the top of the S&P 500 in 2014, their primacy during the current bull market is largely without precedent. This year is the third since 2009 that companies like Disney and Nike have led the S&P 500. In the two decades before, consumer companies were the top stocks just once, in 2001.\nFavored Investment Investors are embracing the group almost to the exclusion of other industries. The $1.97 billion added to ETFs investing in consumer shares this month represents half the total deposited to all sector funds, data compiled by Bloomberg show. In Bank of America’s October survey of money managers, suppliers of non-essential consumer goods remained the most-loved area for a third straight month.\n“Consumers especially look attractive right now given you’ve got massive problems building in other sectors,” said Katrina Lamb, head of investment strategy and research at MV Capital Management Inc. in Bethesda, Maryland, where she helps oversee about $500 million. “Sector leadership has changed and consumers come into the forefront.”\nMore from Bloomberg.com\nIndia Is Spending Billions to Populate a Remote Area Claimed by China Hedge Funds Are Getting Their Gold Bets Wrong Bernanke Says Yellen's Tough Decision Turns on Global Headwinds Read Don't Let Wal-Mart Fool You, U.S. Investors Still Love Consumers on bloomberg.com\nConsumer Discretionary Wal-Mart Stores Inc.", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T17:11:32.855+02:00", "highlightTitle": ""}