{"organizations": [], "uuid": "5d37d7cd34d006afb477f30baa8005ed3d367738", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-10/don-t-make-central-banks-sole-agents-of-the-recovery-g30-says", "country": "US", "title": "Don't Make Central Banks Sole Agents of the Recovery, G30 Says", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Don't Make Central Banks Sole Agents of the Recovery, G30 Says - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:15:00.000+03:00", "replies_count": 0, "uuid": "5d37d7cd34d006afb477f30baa8005ed3d367738"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-10/don-t-make-central-banks-sole-agents-of-the-recovery-g30-says", "ord_in_thread": 0, "title": "Don't Make Central Banks Sole Agents of the Recovery, G30 Says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Global central banks must do more to spot oncoming turmoil caused by years of their own ultra-loose monetary policy, while avoiding being cast by governments as the sole agents of economic recovery, the Group of Thirty financial-policy group said.\n“While unconventional policies such as quantitative easing, off-balance-sheet commitments, and forward guidance have played an important role in the management of recent crises, deeper studies are still needed to ascertain their longer-term overall benefits and unintended consequences,” the Washington-based G30 said in a report prepared for the International Monetary Fund’s annual meeting in Lima this week. “Central banks alone cannot be relied upon to deliver all the policies necessary to achieve macroeconomic goals.”\nLed by former European Central Bank President Jean-Claude Trichet, the group acts as a think-tank made up of current and previous policy practitioners on global financial issues. The report echoes and broadens concerns voiced by Trichet during his 2003-2011 term in office that while monetary policy can fight immediate financial turmoil, it can’t address the underlying causes of and risks associated with weak economic performance.\n“Longer-term price stability is the most important contribution central banks can make to ensuring strong and sustainable growth,” according to the report. “Governments have a responsibility to address structural, regulatory, and other weaknesses in the real economy that might otherwise contribute to the gestation of future crises.”\nThe G30’s members include Bank of England Governor Mark Carney, Bank of Japan Governor Haruhiko Kuroda. U.S. Federal Reserve Chair Janet Yellen and ECB President Mario Draghi have previously been members.", "external_links": [], "published": "2015-10-11T03:15:00.000+03:00", "crawled": "2015-10-11T04:39:24.448+03:00", "highlightTitle": ""}