{"organizations": [], "uuid": "66d7eef10b0db921b207080679bf37d3373f44f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/1/n/2/e/image.related.afrArticleLead.620x365.gk1bzp.png/1444035934760.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/real-estate/not-sure-about-a-50-million-sydney-mansion-chinese-set-to-try-before-they-buy-20151005-gk1bzp", "country": "AU", "title": "Not sure about a $50 million Sydney mansion? Chinese set to try before they buy", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Not sure about a $50 million Sydney mansion? Chinese set to try before they buy | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T14:17:00.000+03:00", "replies_count": 0, "uuid": "66d7eef10b0db921b207080679bf37d3373f44f0"}, "author": "Su-Lin Tan", "url": "http://www.afr.com/real-estate/not-sure-about-a-50-million-sydney-mansion-chinese-set-to-try-before-they-buy-20151005-gk1bzp", "ord_in_thread": 0, "title": "Not sure about a $50 million Sydney mansion? Chinese set to try before they buy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Black Diamondz Property Concierge's Monika Tu with one of the properties which will be available to clients to try before they buy. Michele Mossop Share on twitter Share on Google Plus by Su-Lin Tan Forget shoes and cars, Chinese millionaires with cash to spare are thinking about \"trying on\" Sydney mansions before buying them.\nChinese property and lifestyle concierge Monika Tu will place 20 Chinese nationals from five Shanghai high-net worth families in palatial homes around Sydney at the start of the Chinese New Year celebrations in early February 2016, for between one month and six months.\nThe purpose: to try out a \"mocked up\" Australian lifestyle in a home of their choice before they commit to a move to Australia.\nWith each person in the group having at least $10 million to spare, the group will bring more than $200 million nto Australia to spend on property and other investments.\n\"These high-net worth Chinese individuals are looking for a real life experience of what life would be like in Australia. They want to be introduced to schools for their children... even put their children into some kind of holiday school program as an initial try-out,\" Ms Tu said.\n\"They also want to find investment advisers and find out how to set up a business here.\"\nThese are not your average \"Chinese rich people\" but the highly educated, Ms Tu said.\nOvercoming insecurity \"They have the cash and the only reluctance which prevents them from making the purchase and the ultimate move is the insecurity of 100 per cent relocating their life to a brand new country,\" she said\nWhile there has been some negative blowback from aggressive Chinese acquisition of property in Australi a, particularly housing, Ms Tu explained many Chinese property buyers were not just looking for investment opportunities but to establish a safer life for their future generations.\n\"Our new neighbours are not simply relocating just for our beaches,\" Ms Tu said. \"The astute new generation of Chinese families view our core values and even our education system as prime examples of our aspirational lifestyle.\"\n\"Many Chinese parents are becoming more open-minded and believe their own system [is] possibly corrupt and at times dehumanising, hence many of them look to the West for answers.\"\nBut instead of rushing into Australia, and given the tightening of capital outflow by the Chinese government in the past six weeks, Chinese buyers are wary about their next financial move.\nIn a recent trip to China, Ms Tu said she received offers from wealthy individuals in Shanghai, Tianjing, Shenzhen, Beijing, Guangzhou and Wuhan who wanted the \"try before you buy\" option.\nMs Tu's company, Black Diamondz Property Concierge, plans to house the 20 people in expensive Sydney suburbs such as Bellevue Hill in the east and Palm Beach on the northern beaches. Some have expressed interest in the more affordable northern Sydney suburb of Frenchs Forest.\nMost of the 20 will be on tourist visas but some have Australian residency.\nMembers of the group had asked for mansions within walking distance of each other on an initial short-term lease. If they found the houses unsuitable for purchase, they hoped to buy other properties.\n\"It is not just a vacation. It is a real, life experience. This will help people understand what they are getting themselves into,\" Ms Tu said.", "external_links": ["https://plus.google.com/103218209259241103549", "https://twitter.com/SuLin_Tan"], "published": "2015-10-05T14:17:00.000+03:00", "crawled": "2015-10-05T17:04:02.416+03:00", "highlightTitle": ""}