{"organizations": [], "uuid": "1681715c33f1ec1c3f70961826c474a751acb6d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/g/i/6/y/image.related.afrArticleLead.620x365.gk8fv9.png/1444812332765.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/chanticleer/westpacs-raising-will-hit-economy-but-ward-off-hedge-fund-attack-20151013-gk8fv9", "country": "AU", "title": "Westpac's raising will hit economy but ward off hedge fund attack", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Westpac's raising will hit economy but ward off hedge fund attack | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T07:42:00.000+03:00", "replies_count": 0, "uuid": "1681715c33f1ec1c3f70961826c474a751acb6d3"}, "author": "Tony Boyd", "url": "http://www.afr.com/brand/chanticleer/westpacs-raising-will-hit-economy-but-ward-off-hedge-fund-attack-20151013-gk8fv9", "ord_in_thread": 0, "title": "Westpac's raising will hit economy but ward off hedge fund attack", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Westpac's move was inspired in part by the weight of short trades being mounted up by hedge funds. One peculiar aspect of the requirement for higher capital is that it may result in slugging consumers and lead to a deterioration in the credit quality of bank balance sheets. This could develop into an industry-wide problem because it is almost certain the other major banks will follow Westpac's lead in raising variable home loan rates.\nThe increase in variable rate mortgages comes at an interesting turning point in the Australian residential property market. Banks have been tightening their lending criteria for apartments for several months because of concerns over valuations.\nFirst hike in five years Westpac's 20-basis-point increase in its standard variable rate is the first significant rate hike by a major bank in about five years.\nRowe Chanticleer 15/10/15 David Rowe If the other major banks follow Westpac's lead and decide to recover the cost of higher capital charges from residential mortgages there will be flow on effects to consumption and possibly home prices.\nWestpac has 25 per cent market share of residential mortgages in Australia. At this stage its decision only affects the estimated $185 billion of variable rate mortgages under the Westpac brand.\nWestpac's decision to raise $3.5 billion in new capital through a rights issue and lift the standard variable rate on its Westpac branded mortgages is in direct response to the requirement that Australian banks be \"unquestionably strong\".\nThe amount of capital that has to be held by a major bank against a residential mortgage will increase by 50 per cent from July 1, next year.\nWhen the Westpac raising is completed Australia's major banks would have raised $17 billion this year in response to requirements imposed by the Australian Prudential Regulation Authority.\nAPRA has responded to recommendations in the Financial System Inquiry final report, which found that Australia's banks were not as strongly capitalised as their peers overseas. APRA responded to the analysis by increasing risk weights on residential mortgages.\nHedge fund risk One of the considerations that prompted Westpac's decision to raise capital before its full year results release on November 2 was the potential for hedge funds to attack the bank. The short positions in Westpac shares were growing as the date approached and there was a sense within the bank that it had a target on its back.\nRather than expose the bank to speculative trading in its shares as short sellers punted on a discounted capital raising, the bank went early and released short form profit results.\nWestpac has done internal calculations which show that it will earn less than its targeted return on equity of 15 per cent on its mortgages after the rate hike is put through.\nThat is a pointer to the negative impact of higher capital.\nWestpac raised $2.5 billion earlier this year from a dividend reinvestment plan and sale of shares in funds manager BTIM.\nWhen you add in the capital raising of $3.5 billion it means that Australia's big four banks have raised about $19.5 billion in additional core equity capital this year.\nPNG's poisonous politics Investors in Australian listed stocks with operations in Papua New Guinea were this week reminded of PNG's poisonous politics following a series of articles about Oil Search in Fairfax Media by John Garnaut.\nThe articles provided insights into the way business is done in PNG under Prime Minister Peter O'Neill. Important decisions are taken quickly and rammed through government entities without giving directors an opportunity to consider them in a cool and calm way.\nHis desire to ensure Oil Search was the national champion for the country's interest in the PNG LNG project meant critical decisions were bulldozed through.\nInvestment bank UBS was a focus of the articles. Chanticleer believes UBS came out of a series of Oil Search transactions in 2014 with its reputation intact as a formidable competitor able to come up with creative solutions in short time frames.\nIn response to a government request for proposal to refinance its stake in Oil Search, UBS came up with a three pronged solution that involved lending the country the money to buy a stake in Oil Search, putting in place derivatives to hedge its security position and simultaneously distributing shares to Oil Search's existing shareholders.\nThis transaction generated more than $50 million in fees for UBS in 2014. That fee helps explain why UBS in 2014 had its most profitable year since 2009.\nIt will continue to earn fees from the transaction as the derivatives positions are rolled over next year.\nO'Neill responded to the articles by issuing a press release on Wednesday that said the author was conflicted because his father, Ross Garnaut , was a \"disgruntled associate\" of two former prime ministers, Mekere Morauta and Michael Somare.\nIn fact, Ross Garnaut made a strong contribution to the development of PNG from 1970s onwards before being banned from PNG in November 2012 for comments he made about the PNG Sustainable Development Program which had been bequeathed on trust to the people.\nO'Neill would have been better advised to cop the Oil Search articles on the chin rather than stir up old hatreds given the intense international interest in the country's LNG resources at the moment.\nA range of potential multi-billion dollar transactions are in the works thanks to a Woodside takeover proposal for Oil Search and the asset sales process at Santos.\nWoodside's $11.6 billion bid for Oil Search remains on foot. It is believed the bidder remains confident it can get a deal done but there is a market consensus it will have to offer much more than its initial low ball offer. The Woodside bid is being used by Santos to work out a look-through valuation for its 13.5 per cent stake in the PNG LNG project. The stake is said to be worth about $6.5billion.\nThe sale of that stake would solve virtually all of Santos's balance sheet problems but some shareholders in the company are against selling what is regarded as its best asset.\nThere has been plenty of international interest in the Santos stake in the PNG LNG project particularly from Asian buyers.\nAnother stakeholder in the PNG LNG project with a vested interest in seeing a premium valuation placed on equity in the project is the PNG landowners in the Hela province of PNG.\nThe landowners have an option to buy 4.2per cent of PNG LNG project from January until December next year. But in order to exercise that option they must come up with $US1 billion (about $1.4 billion).\nThe problem the landowners will have in trying to raise that amount of money is that stakes in unlisted resource projects are usually discounted for the lack of liquidity. Discounts of between 30 and 40 per cent can be applied to stakes in projects by independent accounting firms called in to provide valuations.\nTONY BOYD\nTwitter: @TonyBoydAFR\ntony.boyd@afr.com.au", "external_links": [], "published": "2015-10-14T07:42:00.000+03:00", "crawled": "2015-10-14T12:08:06.927+03:00", "highlightTitle": ""}