{"organizations": [], "uuid": "442a4607856a7cc7d8a129fd0944119255320288", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-55f9c81a/turbine/fl-credit-union-merger-20150916", "site_section": "http://www.sun-sentinel.com/business/personal-finance", "section_title": "South Florida Personal Finance News - Sun Sentinel", "url": "http://www.sun-sentinel.com/business/personal-finance/fl-credit-union-merger-20150916-story.html", "country": "US", "title": "We Florida Financial absorbing Peoples Credit Union", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "We Florida Financial absorbing Peoples Credit Union - Sun Sentinel", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T20:18:00.000+03:00", "replies_count": 0, "uuid": "442a4607856a7cc7d8a129fd0944119255320288"}, "author": "Donna Gehrke-White", "url": "http://www.sun-sentinel.com/business/personal-finance/fl-credit-union-merger-20150916-story.html", "ord_in_thread": 0, "title": "We Florida Financial absorbing Peoples Credit Union", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The well-regarded We Florida Financial is taking over the troubled Peoples Credit Union. The two credit unions will merge\nThe expanding We Florida Financial is taking over the troubled Peoples Credit Union.\nThe two credit unions will merge and be run as We Florida Financial with assets of more than $500 million and a membership nearing 60,000. We Florida Financial is based in Margate.\nThe merger will make We Florida Financial one of the 10 largest in South Florida and 28th largest in the state, said Mike Bridges, spokesman for the League of Southeastern Credit Unions & Affiliates.\nThe merger was approved by the members of Peoples Credit Union on July 22 and becomes effective Oct. 1.\nThe merger will allow We Florida Financial to further expand in South Florida. It will take over the existing six Peoples Credit Union branches in Pembroke Pines, North Miami, Miami, Hialeah and at Mount Sinai Medical Center in Miami Beach.\nBefore, We Florida Financial had no branches in Miami-Dade County, said Sandra Spence, We Florida Financial's vice president of advertising and public relations. Now, \"we'll have a presence in both counties,\" Spence said.\nThe merger gives We Florida Financial, formerly known as City County Credit Union of Fort Lauderdale, a total of 13 branches in Miami-Dade and Broward counties. In May, We Florida Financial expanded its credit union services into Monroe County.\n\"This merger is another important milestone in the history of We Florida Financial,\" said Lloyd Gill, president and CEO of We Florida Financial. \"Last year, we rebranded to become We Florida Financial, a name that reflected our growth strategy and this merger reinforces our long-term vision for continued success.\"\nWe Florida Financial previously was known as City County Credit Union. It receives five stars — the top designation — by the Coral Gables-based research company Bauer Financial.\nHowever, Bauer gives Peoples, based in Pembroke Pines, only one star — the lowest rating, which translates to \"troubled.\"\n\"Peoples has been struggling with profitability, which, of course, also impacts its capital position,\" said Karen Dorway, president and director of research for Bauer Financial.\nThe credit union lost $1 million in 2014 and has lost $272,000 through June 30 of this year, she said. People's capital ratio has dropped from 10.09 percent in June 2014 to 6.37 percent a year later, Dorway said.\nThe credit union recently asked to merge with the much larger larger and financially stronger We Florida Financial, said Spence of We Florida Financial. People's brings $78 million in assets and 10,000 members to the merger.\nOnce the merger is completed, We Florida Financial expects to offer \"better compeititive rates\" to the combine membersip of both credit unions, she added.\ndgehrke@tribpub.com ", "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "http://www.trbimg.com/img-55f9c81a/turbine/fl-credit-union-merger-20150916"], "published": "2015-09-16T20:18:00.000+03:00", "crawled": "2015-10-08T18:07:41.817+03:00", "highlightTitle": ""}