{"organizations": ["Harmony Gold", "Cosatu", "Anglogold", "Randgold", "South Gauteng High Court", "Abrahams Kiewitz Inc", "Treatment Action Campaign and Sonke Gender Justice", "Anglo American", "Richard Spoor Inc", "Fatuma Undressed Herself"], "uuid": "8507c2fda7e3c8917d156d20747557135cd722e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510141788.html", "country": "US", "title": "South Africa: Sick Miners in Court for Landmark Silicosis Case", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Sick Miners in Court for Landmark Silicosis Case", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:14:00.000+03:00", "replies_count": 0, "uuid": "8507c2fda7e3c8917d156d20747557135cd722e7"}, "author": "", "url": "http://allafrica.com/stories/201510141788.html", "ord_in_thread": 0, "title": "South Africa: Sick Miners in Court for Landmark Silicosis Case", "locations": ["Eastern Cape", "Africa", "Uganda", "South African", "South Africa", "Peddie"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Brickhill", "Budlender", "Geoff Budlender", "Zwelinzima Vavi", "Vavi", "Bangumzi Balakazi", "Lwandile Fikeni", "Wim Trengrove", "Phineas Mojapelo", "Balakazi"], "text": "Uganda: FDC's Fatuma Undressed Herself - Police By Lwandile Fikeni and Groundup Staff Bangumzi Balakazi, from Peddie in the Eastern Cape, was among the former gold miners sitting in the South Gauteng High Court this week as the landmark silicosis court case got underway. For the last two days, lawyers from the Legal Resources Centre, Richard Spoor Inc and Abrahams Kiewitz Inc have been unspooling a long, intricate argument about the merits of their case against the gold mining companies. Balakazi, who worked on several mines and was diagnosed with silicosis in 1999, was in court to see with his own eyes how the case turns out. The mine workers are asking the South Gauteng High Court for permission to bring a class action against more than 30 gold mining companies, on behalf of all miners who have silicosis and tuberculosis (TB) as a result of their exposure to silica dust since 1965, and of the families of all miners who have died of silicosis and TB. The litigation affects tens of thousands of miners and their families and damages could run into billions of rands. All the big mining companies are affected, including Anglo American, Anglogold, Gold Fields, Harmony Gold, Randgold, DRDGold, and African Rainbow Minerals. Anglo American has described the case as \"without precedent in South African law and indeed in any other jurisdiction in the world\". The hearing is presided over by the Deputy Judge President of the South Gauteng High Court, Judge Phineas Mojapelo. Counsel for the miners Advocate Geoff Budlender told the court on 13 October that the prevalence of silicosis and TB among gold miners in South Africa was among the highest in the world. Though South Africa's mining legislation had not always kept pace with standards elsewhere in the world, international best practices had been known, \"or reasonably ought to have been known\", by South Africa's mining industry, he said. \"Not a single mine has submitted, in this case, that they complied with the necessary standards and legislation,\" Budlender said. He quoted affidavits submitted by miners stating that no respiratory equipment had been supplied to protect them against the silica dust underground, and describing how the use of dynamite to blast the rock increased dust levels. Opening the case for the claimants the day before, Advocate Wim Trengrove argued that the mines had known that there was a causal relationship between dust and silicosis and that the claimants had enough in common for the litigation to be certified by the court as a class action. The entire gold mining industry had treated all miners equally unfairly, he said. \"The respondents who say they are different will be given a chance to plead.\" In their arguments leading up to the case, the mining companies have argued that there is not enough common ground for a class action. They say that conditions on each mine were different and that there is no \"class\" of affected workers or of negligent mining companies. Some also argue that they did not themselves operate the mines. Anglo American, for instance, has argued in the lead-up to the case that it is not \"and has never been\" a mine owner and so is different from the other mining companies, though it \"held different interests in many mining companies at different times\". Addressing this argument in court yesterday, Advocate Jason Brickhill, also representing the miners, said Anglo American had conceded that the problems relating to silicosis were \"regrettable\" but argued that they were \"not of Anglo American's making\". But, he said, absolute control of a subsidiary by a parent company was not necessary for it to assume responsibility. If the court agrees to a class action, the lawsuit will proceed as the largest ever class action lawsuit in Africa. If not, affected mineworkers will have to sue for damages as individuals. Former Cosatu general secretary Zwelinzima Vavi attended the hearing on 13 October with supporters in red Cosatu shirts. Standing outside court during the lunch break with members of SECTION27, the Treatment Action Campaign and Sonke Gender Justice, who have been admitted as friends of the court, Vavi pledged his support to the mineworkers and the organisations involved. The case is being argued only on papers brought before the court. There are no witnesses called to testify, no cross-examinations and no physical evidence put forward. \"My only wish,\" says Balakazi, \"is that we succeed.\" South Africa \nNational police commissioner Riah Phiyega has been suspended pending inquiry into her fitness to hold office, the … see more » Copyright © 2015 GroundUp. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,700 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-14T18:14:00.000+03:00", "crawled": "2015-10-14T19:29:18.955+03:00", "highlightTitle": ""}