{"organizations": [], "uuid": "230d6f4b594d09ca7c4a0cd530b66fe264f2c2f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-05/fortress-says-bear-market-for-emerging-economies-to-rival-1997", "country": "US", "title": "Fortress Says Bear Market for Emerging Economies to Rival 1997", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Fortress Says Bear Market for Emerging Economies to Rival 1997 - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T00:00:00.000+03:00", "replies_count": 0, "uuid": "230d6f4b594d09ca7c4a0cd530b66fe264f2c2f0"}, "author": "Suzy Waite", "url": "http://www.bloomberg.com/news/articles/2015-10-05/fortress-says-bear-market-for-emerging-economies-to-rival-1997", "ord_in_thread": 0, "title": "Fortress Says Bear Market for Emerging Economies to Rival 1997", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fortress Investment Group LLC told investors that the emerging markets are at a beginning of a bear market that could rival the Asian financial crisis of 1997.\nThe sell-off in emerging markets, which began in June, has led to a credit contraction that will last until at least March 2017, according to a letter to investors in Fortress Convex Asia Fund Ltd., signed by Singapore-based Chief Investment Officer David Dredge, and fund co-managers Nicholas Heaney and Andy Wong. Fortress said it used past economic cycles as a guide in evaluating the current market.\n“Our view is that we are in the beginning stages of the next contractionary cycle, and this cycle, similar to 1997-1998, is commencing on the emerging market side of the global imbalance,” Fortress wrote in the investor letter dated Sept. 30. “We believe we are three weeks into what is likely an 18-plus month contractionary period, using past cycles as a guide.”\nFortress isn’t alone among hedge fund managers seeing more pain ahead for the emerging markets. Ray Bakhramov of Forum Asset Management, whose hedge fund has surged 107 percent this year, sees tumult in emerging markets continuing for years and pointed to historical analogies between the current environment and the Asian financial crisis that started in 1997. Ray Dalio’s Bridgewater Associates has said the impact of emerging-market losses is likely to be more widespread than in the crises of the 1980s and 1990s because investors have more money invested in developing markets.\nBucking Slump Dredge joined Fortress in 2011 to head a group that trades instruments designed to thrive in volatile markets and protect investors from unusual market moves known as tail risks. He declined to comment on his letter or strategy. Fortress, based in New York, manages about $72 billion in assets and was the first private equity and hedge fund manager to sell shares to the public.\nFortress’s Asia-focused fund gained 3.2 percent in August, bringing its year-to-date returns to 1.4 percent, according to the investor letter. The fund produced gains as other strategies, such as its macro fund run by Michael Novogratz, tumbled 4.3 percent last month through Sept. 25. The decline in September brings the macro fund’s year-to-date losses to 17.2 percent.\nSigns of slowing growth in China and the prospect of rising interest rates spurred market losses and volatility across regions in the third quarter. The Shanghai Composite Index fell 29 percent in the third quarter, the most worldwide, and the yuan weakened 2.4 percent after authorities devalued the currency in August.\nCentral banks, having spent trillions of dollars in programs known as quantitative easing, or QE, are now in their last rounds of bond buying, which historically is sign of a bear market, according to the Fortress letter.\nThe outflows and ongoing credit tightening among developing countries \"is not just another pullback — the contraction of credit in emerging markets is happening,\" the firm wrote in the letter.\n‘Wild’ Ride The next 18 months to 24 months will be “wild,” particularly with the upcoming U.S. election, Fortress said, and diversification across asset classes is key.\n“Now is the time to be hedged.”\nCapital outflows from emerging markets are on track to exceed inflows this year for the first time in 27 years, according to the Institute of International Finance. Investors will pull an estimated $540 billion from developing countries this year, the IIF said, after developing-nation stocks lost $4.3 trillion in market value in the third quarter.\n“The risk of more outflows from EM countries, rising market rates and falling foreign exchange reserves became more real in August,” Fortress wrote in the letter. “As a result, we think the volatility regime of the past seven years has changed.”", "external_links": [], "published": "2015-10-06T00:00:00.000+03:00", "crawled": "2015-10-05T20:15:08.234+03:00", "highlightTitle": ""}