{"organizations": [], "uuid": "75e63b5203d662d31fa490dc16945de9448181a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l.yimg.com/bt/api/res/1.2/kcB24L_sEJaX9rPYsjLvIg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://media.zenfs.com/en-US/video/video.pd2upload.com/video.yahoofinance.com@89e2ea15-172f-3510-83e9-bc73bfde0409_FULL.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=FOXA", "section_title": "Yahoo! Finance: FOXA News", "url": "http://finance.yahoo.com/news/american-apparel-bankruptcy--twitter-ceo--volkswagen-threat---martian--box-office-green-125704505.html", "country": "US", "title": "American Apparel bankruptcy; Twitter CEO; Volkswagen threat; 'Martian' box office green - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "American Apparel bankruptcy; Twitter CEO; Volkswagen threat; 'Martian' box office green - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 1, "uuid": "dd4fb53b039f58a97c587807b13c7a93bc15462c"}, "author": "Bill McColl", "url": "http://finance.yahoo.com/news/american-apparel-bankruptcy--twitter-ceo--volkswagen-threat---martian--box-office-green-125704505.html#post-0", "ord_in_thread": 0, "title": "American Apparel bankruptcy; Twitter CEO; Volkswagen threat; 'Martian' box office green - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "American Apparel bankruptcy; Twitter CEO; Volkswagen threat; 'Martian' box office green\nNow watching   Next video starts in : 7 Play \nAmerican Apparel bankruptcy; Twitter CEO; Volkswagen threat; 'Martian' box office green\n Replay video Up next Former Schwab CEO on the secret to his comeback, and the challenge of China \n   Up next   Former Schwab CEO on the secret to his comeback, and the challenge of China \nYahoo Finance: Investing\n1\n 2:45 \nNow watching Up next American Apparel bankruptcy; Twitter CEO; Volkswagen threat; 'Martian' box office green \nAmerican Apparel, Twitter, Fossil Group, Potash Corporation of Saskatchewan, Volkswagen, 21st-Century Fox are stocks to watch.\n2\n 5:04 \nNow watching Up next Former Schwab CEO on the secret to his comeback, and the challenge of China \nImagine being on top of the business world, transforming a small brokerage in San Francisco into an online trading behemoth, to then being shown the door when the dot com bubble popped. Well that happened to David Pottruck, former CEO of Charles Schwab during the glory years, but he rebounded in a big way.\n3\n 32:26 \nNow watching Up next Two Nations, One Fortune: China & the U.S. at a Crossroads \nAndy Serwer, Editor-in-Chief of Yahoo Finance talks with Ian Bremmer, Founder & President, Eurasia Group, Gov. Jon Huntsman, Jr. and Kevin Rudd, Former Prime Minister of Australia about the dynamic nature of the relationship between the U.S. and China.\n4\n 4:23 \nNow watching Up next Surprise! Paying CEOs for stock performance doesn't help companies: Cornell \nOffering bonuses to a CEO to improve shareholder returns doesn’t improve the company’s performance, according to a new study by Cornell University and consultants Pearl Meyer & Partners.\n5\n 1:19 \nNow watching Up next BofA/Merrill Lynch must defend itself; Gilead downgraded; Micron beats earnings \nTime for your daily dose of trending tickers, the stocks you&#39;re following based on your Yahoo Finance ticker searches.\n6\n 1:08 \nNow watching Up next Stock investors forced to pause at yield signs \nThe climb in high-yield corporate bond risk spreads has been a more direct challenge to stocks in recent weeks and months.\n7\n 3:29 \nNow watching Up next Jobs where students command 6-figure salaries months ahead of graduation \nThe ultra-competitive race for tech talent is still at a fever pitch. And it&#39;s not just at the top level.\n8\n 5:07 \nNow watching Up next How energy democracy can avoid a climate crisis: Naomi Klein \nWhile fossil fuels will dominate the global energy space for the time being, proponents of wind, water and solar power cite growing evidence that an equitable and viable transition can eventually take place. According to Naomi Klein, author of This Changes Everything, Capitalism vs the Climate, the concept of “energy democracy” is integral.\n9\n 3:35 \nNow watching Up next Unemployment rate to decline but Fed liftoff to hold until March: RBS \nIt&#39;s all about the economy as investors look for any clues to the health of the U-S economy as the volatility on Wall Street continues.\n10\n 1:21 \nNow watching Up next Twitter reverses; McCormick misses profit; Dunkin' Brands sinks on weak outlook \nTime for your daily dose of trending tickers, the stocks you&#39;re following based on your Yahoo Finance ticker searches.\nLoad More Here are some of the stocks the Yahoo Finance team will be watching for you today.\nAmerican Apparel ( APP ) It's official--  the struggling retailer is filing for bankruptcy.  American Apparel says the move will help reduce its crushing debt burden...and allow it to keep its stores open. The company has been fighting to stay afloat amid struggling sales and a protracted legal battle with founder and former CEO Dov Charney.\nTwitter ( TWTR ) Also official today--  co-founder and interim CEO Jack Dorsey is no longer interim...he's been given the job permanently.  Dorsey took over earlier this year after former CEO Dick Costello stepped down.\nFossil Group ( FOSL ) The maker of jewelry and accessories is being downgraded by Piper Jaffray, which is lowering its price target to $46 from $53.  Piper saying it has concerns about the market for traditional watches as demand for smart watches increases.\nGet the Latest Market Data and News with the Yahoo Finance App \nPotash Corporation of Saskatchewan ( POT ) The huge fertilizer producer is ending its almost $9 billion bid for German rival K+S. Potash says weakening market conditions and refusal by K+S management to engage in talks led to the decision.  K+S calls the offer too low.\nVolkswagen ( VLKAY ) The carmaker's designated chairman calls the firm's cheating scandal a threat to the very existence of the company.  Volkswagen is facing a Wednesday deadline to explain how it will fix 2.8 million cars in the German market following revelations the company rigged emissions tests in the US. \n21st-Century Fox ( FOXA ) The media company's film, \"The Martian,\" had quite a blast off at the box office in its opening weekend. Initial numbers show the space thriller starring Matt Damon brought in $55 million, easily putting it in first place and challenging another space hit, \"Gravity,\" for the all-time record for an October opening. \nMore from Yahoo Finance \nStocks look to stay hot; Bernanke speaks out; 'The Martian' boosts Fox\nWhy visionary Ralph Lauren sought out a new leader\nShell’s Alaska pullout a sign of the times\nWhy an antitrust case against Google’s Android is not a slam dunk\nBill Gross down, but not out, after Pimco tops him \nFinance Investment & Company Information American Apparel Jack Dorsey", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T18:39:45.224+03:00", "highlightTitle": ""}