{"organizations": [], "uuid": "568df759e229ed5986dc8d212784ee47070caa7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/13/markets-bonds-usa-idUSL1N12D0ZX20151013", "country": "US", "title": "TREASURIES-Prices rise on growth fears, bets on later Fed rate hike", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "TREASURIES-Prices rise on growth fears, bets on later Fed rate hike | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T18:50:00.000+03:00", "replies_count": 0, "uuid": "568df759e229ed5986dc8d212784ee47070caa7f"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/13/markets-bonds-usa-idUSL1N12D0ZX20151013", "ord_in_thread": 0, "title": "TREASURIES-Prices rise on growth fears, bets on later Fed rate hike", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* China Sept. imports data reignites growth concerns\n* Expected low U.S. inflation supports Treasuries prices\n* Later Fed rate hike expectations underpin Treasuries prices\nBy Sam Forgione\nNEW YORK, Oct 13 (Reuters) - Safe-haven U.S. Treasuries prices rose on Tuesday on concerns over global growth after data showed China's imports plunged in September, while continued expectations for a later Federal Reserve rate liftoff also supported prices.\nImports in China, the world's second-biggest economy, plunged 20 percent last month, leaving economists divided over whether the country's ailing trade sector is showing signs of turning around and reigniting concerns over global growth.\n\"It's all a global growth fear trade,\" said Priya Misra, head of global rates strategy at TD Securities in New York. She said the China data was the main catalyst behind the demand for safe-haven U.S. government debt.\nMisra said that concerns of soft U.S. inflation as a result of a weak global growth outlook also supported Treasuries prices. Longer-dated Treasuries prices in particular tend to rise on expectations of low inflation since inflation erodes the value of interest payouts.\nYields held above session lows hit on Oct. 8, when the minutes to the Fed's September meeting were released and showed the U.S. central bank's policymaking committee was unsettled by signs of turmoil abroad but didn't think this had \"materially altered\" the outlook for the economy.\nRates futures on Tuesday suggested traders anticipate the first Fed rate increase since 2006 would occur at the Federal Open Market Committee meeting in March 2016 at the earliest.\nFed Governor Lael Brainard's comments on Monday defending a go-slow approach to rate policy reinforced expectations for a later rate hike, analysts said. The U.S. bond market was closed on Monday for the Columbus Day holiday.\nAnalysts said that weakness in oil prices on Tuesday also signaled lower inflation. Expectations that inflation would remain below the Fed's 2 percent target contributed to expectations of a later rate hike and helped boost short-term Treasuries prices, which are most affected by rate hikes.\n\"The short end is definitely the biggest beneficiary of lower oil prices,\" said Robbert van Batenburg, director of flow strategy at Societe Generale.\nU.S. 30-year Treasury bonds were last up 18/32 in price to yield 2.90 percent, from a yield of 2.93 percent late on Friday. Benchmark 10-year notes were last up 9/32 to yield 2.07 percent, from a yield of 2.10 percent late on Friday.\nThree-year notes were last up 2/32 to yield 0.93 percent, from a yield of 0.96 percent late on Friday. (Editing by Meredith Mazzilli)", "external_links": [], "published": "2015-10-13T18:50:00.000+03:00", "crawled": "2015-10-13T18:16:24.185+03:00", "highlightTitle": ""}