{"organizations": [], "uuid": "de9e6b9b2de4a99a2109c71c05ff50c7fdb4b228", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-reuters/?format=rss", "section_title": "Finance News | Reuters - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/china-says-believes-tpp-not-161014240.html", "country": "GB", "title": "China says believes TPP not meant to deter or exclude China", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "China says believes TPP not meant to deter or exclude China", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:10:00.000+03:00", "replies_count": 0, "uuid": "de9e6b9b2de4a99a2109c71c05ff50c7fdb4b228"}, "author": "", "url": "https://uk.finance.yahoo.com/news/china-says-believes-tpp-not-161014240.html", "ord_in_thread": 0, "title": "China says believes TPP not meant to deter or exclude China", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Oct 8, 2015, 17:19 BST - UK Markets closed China says believes TPP not meant to deter or exclude China Reuters – 8 minutes ago Print \nBEIJING (Reuters) - China said on Thursday that it does not feel targeted by the U.S.-backed regional trade accord, the Trans-Pacific Partnership, but will evaluate the likely impact comprehensively. \nChina is not among the 12 Pacific Rim countries who have agreed Monday's trade pact, the most ambitious in a generation. The deal faces scepticism from U.S. lawmakers, who can vote it down. \nThe accord includes Australia and Japan among economies worth a combined $28 trillion. \nWhile acknowledging such a pact would inevitably divert some trade and investment away from China, Beijing would assess comprehensively its potential once the official agreements are reached, Gao Hucheng, China's trade minister, said in a interview with state media posted on the ministry's website www.mofcom.gov.cn late on Thursday. \n\"The United States and the TPP members have repeatedly said that TPP does not target China, and it's not intended to deter or exclude China,\" Gao was quoted as saying. \nThe global trade pattern would eventually depend on the shifting structures of global industries and the competitive edge of each nation's products, the minister said. \nGao said China will push forward regional trade blocks such as RCEP, or Regional Comprehensive Economic Partnership. \nRCEP, which comprises the 10-nation ASEAN club plus six others - China, India, Japan, South Korea, Australia and New Zealand - is a Beijing-backed trade framework that has gained prominence as an alternative to U.S. plans. \nIf approved, the Trans-Pacific Partnership (TPP) pact would cut trade barriers and set common standards from Vietnam to Canada. It would also furnish a legacy-shaping victory for U.S. President Barack Obama and a political win for Japanese Prime Minister Shinzo Abe, who has touted TPP as a way to boost growth in an economy checked by a shrinking population. \nThe agreement has also been pitched as a way to counter China's rising economic and political clout in the region. \n(Reporting by Chen Aizhu; Editing by Ruth Pitchford)", "external_links": [], "published": "2015-10-08T19:10:00.000+03:00", "crawled": "2015-10-08T19:21:17.844+03:00", "highlightTitle": ""}