{"organizations": [], "uuid": "0d492fde379245c91191f58d07b97502a7024649", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/z/4/f/f/image.related.articleLeadwide.620x349.gjz4d5.png/1443798701794.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/property/looking-a-lot-like-christmas-20151001-gjz4d5.html", "country": "AU", "title": "Looking a lot like Christmas", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Looking a lot like Christmas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "0d492fde379245c91191f58d07b97502a7024649"}, "author": "", "url": "http://www.smh.com.au/business/property/looking-a-lot-like-christmas-20151001-gjz4d5.html", "ord_in_thread": 0, "title": "Looking a lot like Christmas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pitt Street shopping mall will soon be inundated with Christmas shoppers. Photo: Daniel Munoz\nThis weekend is considered a bonanza for retailers as avid fans from the Australian Football League (AFL) and the National Rugby League (NRL) snap up no end of football paraphernalia to support their teams in the finals.\nAnd if the team is lucky enough to have a win, then the sales of premiership guernseys, scarfs, hats/beanies and the bigger ticket apparel items, among the inflatable fingers, all hit a high.\nBut once the cheering has ended, what next for the retailers?\nWhy, of course, Christmas.\nAdvertisement We all joke about seeing Easter eggs for sale in February and mince pies in October, but for a retailer, the changing seasons take on a whole new meaning.\nAnd, in the current state of the sector, with fickle consumer sentiment, it's no laughing matter.\nThe housing boom is providing some joy as it is generating cash through home sales, which allows people to upgrade furnishings, renovate or use the excess cash on other items.\nBut for apparel retailers, it can be a lottery.\nGiven the smallness of the local population, compared with most other G7 countries, a lot of Australian apparel retailers are always left with excess stock at the end of each season.\nHence the extended periods of discounting that have plagued retailers for years – and frustrated shoppers: Nothing worse than seeing the jumper, already on sale one week, in the $2 bin the next.\nThat's the one trend that international brands are introducing to Australia – the six-week churn.\nBut with the heat wave Summer-like conditions currently hitting most of the country, retailers are once again, smiling.\nFashion retailers buy their Spring/Summer stock a year in advance and are now getting items out of storage and into the shops to cater for the rising demand in the lead-up to the Christmas festivities.\nIn the coming weeks there is also the Spring racing carnival, although well-seasoned attendees usually have outfits and millinery sorted well before the first Group 1 race meeting.\nHowever, with the sun shining, late starters are heading to the stores for last minute fascinators, shoes and handbags.\nThe cash registers are ringing.\nAmid this change of season activity, shop owners and landlords are also busy getting out the tinsel and Christmas trees in readiness for the festive season.\nAnd that is only 11 shopping weeks away.\nAlready, the \"mid season\" sale stock is getting corralled to the back of the shops to make way for the Spring/Summer and Christmas party ranges.\nBut soon the windows and shelves will be covered with all things necessary for the festive season. Retailers and their landlords rely on the lead-up to Christmas to generate a significant proportion of sales for the year. That cuts across food, alcohol, and apparel, to decorations and trees, tableware/glassware, napery and of course, gifts.\nWhile most of the shops are currently holding mid season sales, they will now look to offering the recommended retail price. That is where the higher margins can be generated.\nThe lower Australian dollar is also a double-edged sword for retailers. Imports are more expensive, particularly for electronics, but it is also proving a deterrent for overseas travel, leaving more people at home scouring the shops.\nSo get ready, as it is starting to feel a lot like Christmas.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T08:25:34.543+03:00", "highlightTitle": ""}