{"organizations": [], "uuid": "44465dd10ce083923e90e2e501aac37bca3386f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/pouiiiiiiiiiii.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/police-recovered-rs1668-lakh-from-contractor-for-delay-in-hq-construction/43716.html", "country": "IN", "title": "Police recovered Rs16.68 lakh from contractor for delay in HQ construction", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Police recovered Rs16.68 lakh from contractor for delay in HQ construction - Moneylife", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:00:00.000+03:00", "replies_count": 0, "uuid": "44465dd10ce083923e90e2e501aac37bca3386f7"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/police-recovered-rs1668-lakh-from-contractor-for-delay-in-hq-construction/43716.html", "ord_in_thread": 0, "title": "Police recovered Rs16.68 lakh from contractor for delay in HQ construction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow @mldigital Construction of Mumbai Police headquarter building has been delayed by 32 months for which the contractor was fined Rs16.68 lakh, reveals a reply received under RTI \n \nThe Maharashtra State Police Housing and Welfare Corp (MSPHWC) has fined a contractor for delay in construction work for its head quarter building and recovered Rs16.68 lakh, reveals a reply received under the Right to Information (RTI) Act.    According to information received under RTI by activist Anil Galgali, the project has been delayed by 32 months and contractor Choudhary and Choudhary has been fined Rs16.68 lakh for the delay.   Galgali had filed a query with the Maharashtra State Police Housing and Welfare Corp seeking information about the new building for head quarter.    In response, Public Information Officer (PIO) and Audit officer SM Devkar informed Galgali that, the work order for the proposed project was issued to the contractor Choudhary and Choudhary on 25 August 2011 for a cost of Rs32 crore and the period for completion of the project was envisaged for 18 months.    The project was supposed to be completed by 24 February 2013 was given an extension upto 31 May 2014. The cost escalation in the project was Rs22.55 crore of which Rs13.88 crore was for building works and other activities, Rs5.75 crore was for interiors and furnishings, Rs23 lakh for kitchen and canteen, and Rs2.69 crore for air conditioning of the building.   Hafeez Contractor was appointed as the Architect for the project and was paid a fee of Rs36.48 lakh, the information reveals.    Galgali was further informed that building would be for ground plus six floors and the new building would accommodate 32 officers and 950 staff.", "external_links": [], "published": "2015-10-16T15:00:00.000+03:00", "crawled": "2015-10-16T09:39:35.518+03:00", "highlightTitle": ""}