{"organizations": [], "uuid": "e1561cad4a21422723e418b00398d439710218d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/samanthasharf/2015/10/08/the-last-10-things-i-bought-how-a-25-year-old-personal-finance-reporter-spends-her-money/", "country": "US", "title": "The Last 10 Things I Bought: How A 25 Year Old Personal Finance Reporter Spends Her Money", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "The Last 10 Things I Bought: How A 25 Year Old Personal Finance Reporter Spends Her Money", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:00:00.000+03:00", "replies_count": 0, "uuid": "e1561cad4a21422723e418b00398d439710218d9"}, "author": "Samantha Sharf", "url": "http://www.forbes.com/sites/samanthasharf/2015/10/08/the-last-10-things-i-bought-how-a-25-year-old-personal-finance-reporter-spends-her-money/", "ord_in_thread": 0, "title": "The Last 10 Things I Bought: How A 25 Year Old Personal Finance Reporter Spends Her Money", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In this series we will ask people to open up their wallets and credit card statements for a peek at the last 10 things they bought. To kick it off, here is a glimpse into how I spent my money one recent weekend. Thursday 1. Tinfoil: $5.49 Boyfriend cooks dinner. Texts: “Could you pick up tin foil?” I oblige on my way home from work, forgetting I already have tinfoil. Lesson: When you change the tinfoil spot from the drawer to under the sink tell your significant other/roommates. Friday 2. Chicken fingers and a side salad: $10.17 Most days I eat like an adult, an abundantly healthy and frugal one even. Friday was not one of those days. Next week it’s back to packing lunch – cheaper, healthier and tastier . Saturday 3. Groceries: $15.33 Ingredients for a pot of quinoa-vegetable-chickpea soup . I had one bowl for dinner Saturday and there’s enough left to cover three weekday lunches. That’s about $3.83 a meal, plus some quinoa to spare. 4. Flight to Chicago: $402.20 My friend recently moved to the Windy City for business school, so a group of us are visiting for a weekend. The tickets ended up being more expensive than I had hoped. Luckily, I have been using Digit to tuck away a modest travel budget that will cover most of the cost. Still, I’ll need to cut back on my spending for a few weeks so I don’t overshoot my budget too badly. Wish me luck. 5. Wine and late night snacks: $21 A mellow girls’ night for four. Sunday 6. Entry to Tiki Disco: $15 According to tikidisco.com , “TIKI DISCO is a NYC-based event focused on ‘music for people who like music for people.’” I am not actually cool enough to go to events like this. Proof? I did not know to buy a ticket in advance, which meant the price jumped 50% from the $10 listed online. Usually I avoid entry fees like the plague (it’s just rude to make people pay to walk in). This was a fun change of pace but I am not changing my anti-cover stance. 7. Beer at Tiki Disco: $8 Seven for the beer, one for tip. Yes, beer is expensive in New York. 8. Dinner at Bun-Ker: $43.52 True confession: the only reason I ended up at a dance party on a Sunday afternoon was that it was en route to Bun-Ker . Bun-Ker is a Vietnamese restaurant about an hour’s journey from my apartment that recently got a rave review from The Infatuation , one of my favorite food blogs. Worth the trip and the tab. 9. Lyft from Bun-Ker to Jefferson Station L stop: $9.43 If my weekends had a motto it would be: Will Travel For Food. The only problem is that this particular food destination was in a poorly-lit, industrial section of Queens, and a 15 minute walk from the nearest subway. Lyft’s fare estimator said the trip home would cost $22.32 even using the ride hailing app’s carpool function, so we took a Lyft to the subway. Monday 10. Venmo to boyfriend: $71.77 My boyfriend and I split the cost of shared meals, drinks and other activities. Typically one of us pays everything (other than sit down meals for which we both slap down credit cards) and settle up at the end of each weekend. This time we went two weekends (ouch). Among other things my bill included: groceries for that lovely dinner above, three bottles of wine and tacos. This model works for us. We are not fanatical about counting every coffee but purchases over $10 make it into the pot. It helps us feel that we are both contributing and saves the hassle of settling up after every purchase. Reflection -- Favorite purchase? Those plane tickets. I miss my friend and Chicago is one of my favorite cities. Any regrets? Those plane tickets. $400 is a lot of money. I’ll have to forgo a few food adventures to feel like I’m back at even. Want to let FORBES into your wallet? Email ssharf@forbes.com for details on how to participate. Related From FORBES: [gallery2012]", "external_links": ["https://digit.co/", "http://www.wholefoodsmarket.com/recipe/quinoa-vegetable-soup", "https://www.theinfatuation.com/new-york/reviews/bun-ker-vietnamese", "http://bunkervietnamese.com/", "http://www.tikidisco.com/"], "published": "2015-10-08T23:00:00.000+03:00", "crawled": "2015-10-09T04:17:19.245+03:00", "highlightTitle": ""}