{"organizations": [], "uuid": "98ccde4f4cf2a0ddcac10061ac7102c00dfe8971", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/GSTdttZi_m467okYBrv8_w--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/fce98d57c554c43c437990e35a264518f447f04d_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/russias-gazprom-resumes-gas-supplies-125643628.html", "country": "US", "title": "Russia's Gazprom resumes gas supplies to Ukraine", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Russia's Gazprom resumes gas supplies to Ukraine", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T15:56:00.000+03:00", "replies_count": 0, "uuid": "98ccde4f4cf2a0ddcac10061ac7102c00dfe8971"}, "author": "", "url": "https://uk.finance.yahoo.com/news/russias-gazprom-resumes-gas-supplies-125643628.html", "ord_in_thread": 0, "title": "Russia's Gazprom resumes gas supplies to Ukraine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Oct 12, 2015, 14:12 BST - UK Markets close in 2 hrs 18 mins Russia's Gazprom resumes gas supplies to Ukraine AFP – 16 minutes ago View Photo \n\nGazprom on Monday resumed gas supplies to Ukraine after receiving prepayment of $234 million from Kiev, assuaging European fears about a new energy crisis ahead of the winter heating season. \nThe resumption of gas supplies comes as fighting in the east has largely died down, fuelling hopes that the conflict that has claimed more than 8,000 lives can be resolved. \n\"Gazprom began supplying gas to Ukraine at 10:00 am (0700 GMT) today,\" Gazprom chief Alexei Miller said in a statement. \nMoscow received $234 million of the $500 million expected from Kiev, Miller said, adding that Ukraine had requested the delivery of 114 million cubic meters per day, the maximum volume of gas that could be delivered by Gazprom. \nUkraine's state gas pipeline operator Ukrtransgas declined to immediately comment on Monday but the firm said last week that Kiev was ready to purchase two billion cubic meters of natural gas from Russia in October. \nMoscow late last month agreed to resume gas supplies to Ukraine after reportedly offering Kiev a rebate, ending months of talks overshadowed by the crisis in eastern Ukraine and fears for Europe's energy security. \nRussian energy minister had said that the price offered was competitive with those for the gas supplied to countries neighbouring Ukraine. \nIn June, Ukraine announced it was suspending all purchases of natural gas from Russia over a price dispute after EU-mediated talks broke down. \nRussia supplies around a third of Europe's gas, with roughly half of it flowing via Ukraine. \n- 'God forbid severe cold' - \n\"This is a resumption of cooperation,\" Yury Korolchuk, an analyst with the Institute of Energy Strategies in Kiev, told AFP. \nHe said that 16 billion cubic metres of gas Ukraine currently had in its underground storage facilities were not enough to safely get through the winter. \n\"God forbid that severe cold hits us in January-February and Europe takes more (gas). This is a huge risk,\" he added. \n\"We need at least 19 billion cubic metres to pump into our storage facilities to ensure gas transit.\" \nThe resumption of deliveries could help Kiev accumulate 17 billion cubic meters of natural gas by October 21, the \"absolute minimum for the security of gas transit to Europe,\" said analysts from VTB Capital bank. \nBut these reserves could not be enough if the winter is harsh, they warned. \nEnd-of-year haggling over energy prices had been a familiar problem between Russia and Ukraine but ties collapsed altogether after a popular uprising in Kiev ousted Kremlin (LSE: 0Q8D.L - news ) -backed leader Viktor Yanukovych last year. \nKiev has been seeking to diversify its supply base away from Russia after Moscow cut gas supplies to Ukraine in 2006 and 2009, interrupting transit to Europe. \nMoscow hiked the price it charges Ukraine following the ouster of Yanukovych, which unleashed a pro-Russian insurgency in the east of the ex-Soviet country. \nWith Russia slipping into recession on the back of lower oil prices and Western sanctions over Ukraine, the economy ministry said Gazprom could produce 414 billion cubic metres of gas this year, an all-time low due to weak demand, among other reasons. \nLast week Ukrainian President Petro Poroshenko said a \"real truce\" had begun in eastern Ukraine but a long-lasting peace with pro-Kremlin insurgents would still take some time.", "external_links": [], "published": "2015-10-12T15:56:00.000+03:00", "crawled": "2015-10-12T16:15:14.532+03:00", "highlightTitle": ""}