{"organizations": [], "uuid": "9a24c4bbe7625792ce78fb66132e730f80c38e47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/2/i/3/i/0/image.related.afrArticleLead.620x365.gjyl8h.png/1443742232443.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/gambling/crown-under-pressure-as-macau-casino-revenue-falls-again-in-september-20150930-gjyl8h", "country": "AU", "title": "Crown under pressure as Macau casino revenue falls again in September", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Crown under pressure as Macau casino revenue falls again in September | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:02:00.000+03:00", "replies_count": 0, "uuid": "9a24c4bbe7625792ce78fb66132e730f80c38e47"}, "author": "Perry Williams", "url": "http://www.afr.com/business/gambling/crown-under-pressure-as-macau-casino-revenue-falls-again-in-september-20150930-gjyl8h", "ord_in_thread": 0, "title": "Crown under pressure as Macau casino revenue falls again in September", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "James Packer’s Macau joint venture Melco Crown is under pressure as a corruption crackdown leads to falling revenues across the industry. Rob Homer Share on twitter by Perry Williams Billionaire James Packer will hope to snap a 16-month losing streak for casino revenues in Macau, the world's biggest gambling hub, as he rolls the dice on the new $US3.2 billion Studio City casino development later this month.\nMacau's gambling revenue fell 33 per cent to 17.1 billion patacas ($US2.1 billion) in September compared with the same period in 2014, according to government data released on Friday, as Beijing's corruption crackdown continued to drive high-roller gamblers away from the gambling centre.\nMacau's revenue fall was in line with an estimate issued on Wednesday by Bernstein Research. But the investment bank warned Macau promoters face fresh headwinds to attract high-roller gamblers to their casinos with the government regulator considering a clamp down on the junket operators which facilitate loans for VIP gamblers.\nOne of Macau's largest junket operators, Neptune Group, warned last week it may need to scale back its operations due to the city's revenue slump, while another junket firm, Dore, is being investigated for fraud.\n\"Greater scrutiny of junkets may weigh further on Macau's VIP business,\" Bernstein said in a research note. \"We believe this will likely intensify the consolidation that is already taking place in the junket sector and junket promoters may face incremental difficulty in raising capital.\"\nWhile gambling revenues from the Chinese territory remain seven times larger than its closest global competitor, Las Vegas, operators including Mr Packer's Melco Crown joint venture are concerned at the rapid slowdown in gambling activity since early 2014.\nMr Packer's Crown Resorts, which owns a 34 per cent stake in the Macau-focused casino operator Melco Crown, hopes the Hollywood style Studio CIty resort will reverse the declining fortunes of the industry when it opens on October 27.\nIt hopes to attract a bigger slice of the gambling market while also attracting a more family-friendly crowd with a mix of Warner Brothers-themed rides, a Batman flight simulator and Asia's highest ferris wheel set between two art deco hotel towers.\n Mr Packer has tapped his Hollywood connections to lend some star power to the October opening, with Rush Hour director Brett Ratner lining up producer Martin Scorcese with actors Robert De Niro, Leonardo DiCaprio and Brad Pitt to star in a short film dubbed The Audition, themed around a Studio City storyline.\nMelco's third casino in Macau will add to its existing Altira and City of Dreams resorts, but the company headed by Lawrence Ho is enduring a tough trading period with its shares trading near a three-year low.\nMelco's net revenues in the second quarter of 2015 fell 24 per cent to $US916 million ($1.25 billion), missing a consensus forecast of $970 million, due to declines in both high-end and mass-market earnings at its casinos.", "external_links": ["https://twitter.com/perrybwilliams", "http://www.smh.com.au/business/james-packers-macau-casinos-under-pressure-as-earnings-slump-20150806-githmi.html"], "published": "2015-10-02T06:02:00.000+03:00", "crawled": "2015-10-02T04:10:01.129+03:00", "highlightTitle": ""}