{"organizations": [], "uuid": "0b6218de13d14fe9169dcc0fe3a4f9c9a14da03c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/banks-face-tougher-annual-stress-103704970.html", "country": "US", "title": "Banks to face tougher annual stress tests to protect against future collapses", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Banks to face tougher annual stress tests to protect against future collapses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T13:37:00.000+03:00", "replies_count": 0, "uuid": "0b6218de13d14fe9169dcc0fe3a4f9c9a14da03c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/banks-face-tougher-annual-stress-103704970.html", "ord_in_thread": 0, "title": "Banks to face tougher annual stress tests to protect against future collapses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Oct 21, 2015, 12:40 BST - UK Markets close in 3 hrs 50 mins Banks to face tougher annual stress tests to protect against future collapses By Tim Wallace | Telegraph – 1 hour 3 minutes ago 2.1863 0.0000 \nThe Bank of England wants banks to prove they can handle a wider range of economic crashes and market shocks, with even bigger capital buffers \nBritain's biggest banks face a series of gruelling annual tests to prove to increasingly demanding regulators that the financial sector is able to keep on lending even in the face of economic disasters. \nThe Bank of England is tightening its street testing regime, with annual tests which vary depending on which sectors of the economy are booming and which are struggling. \nOn top of that, every other year the banks will face specific tests to see how an unpredictable crash in one sector or a sharp change in economic policy could affect them. \nIn addition, the banks will have to show they have a bigger capital buffer than ever. In previous stress tests, banks had to show they had capital buffers equivalent to 4.5pc of their risk-weighted assets. \nIn future, the big banks will have a higher hurdle to pass, reflecting the risk they pose to the wider financial system. The average hurdle will be 6.3pc next year, indicating the target is almost half as high again as it was in previous tests. \nThat buffer will keep on increasing as tighter rules are phased in over the next three years. \nThe annual tests will be based on the economic cycle. \nFor example, if the economy is booming and house prices are growing very rapidly, officials will make the test tougher to see how banks will cope with a hypothetical recession. A result, banks might have to set aside more capital to prepare themselves for potential future losses. \nBy contrast, if the economy is already in recession, then the tests will be less tough and banks could end up being told to set less capital aside, freeing them up to lend more and so boost the economy. \nEach bank will then have to show the Bank of England that it has built up an extra capital buffer equal in size to the impact of that stress. \nThe biennial structural tests will start in 2017 and measure banks against risks that are less related to the economic cycle. \nThat could include factors such as the crash in the commodities market, the risk of the buy-to-let market overheating, or a country scrapping its peg to another currency as Switzerland did earlier this year. \nHowever, this will only apply to banks which have major operations in those markets, rather than all banks facing a test which may not be relevant to them. \nThe tests will only apply to those six banks and one mutual with total retail deposits greater than £50bn: HSBC, Standard Chartered (HKSE: 2888.HK - news ) , Barclays (LSE: BARC.L - news ) , Royal Bank of Scotland, Santander UK (LSE: 44RS.L - news ) , Lloyds Banking Group (Other OTC: LLOBF - news ) and Nationwide Building Society. \n\"The UK needs banks that can weather shocks without cutting off lending to the real economy,\" said Bank of England governor Mark Carney. \nThe 2015 sets test result, based on the older rules, will be published on 1 December. It (Other OTC: ITGL - news ) is testing the banks' ability to survive an economic crunch based on a severe global slowdown particularly focuses on the Chinese economy. \nLast year's test was focused on a hypothetical crash in house prices. It found the Co-operative Bank ws short of capital, and that Lloyds and RBS (LSE: RBS.L - news ) had only recently taken steps to bolster their buffers sufficiently.", "external_links": [], "published": "2015-10-21T13:37:00.000+03:00", "crawled": "2015-10-21T14:41:06.784+03:00", "highlightTitle": ""}