{"organizations": ["Axa SunLife"], "uuid": "2fc75a1ea376302a91589799d3d8374d90a06d3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/im-left-482-axa-sunlife-090333154.html", "country": "US", "title": "'I'm left with £482. Was my Axa SunLife plan a mistake?'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "'I'm left with £482. Was my Axa SunLife plan a mistake?'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T11:03:00.000+02:00", "replies_count": 0, "uuid": "2fc75a1ea376302a91589799d3d8374d90a06d3c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/im-left-482-axa-sunlife-090333154.html", "ord_in_thread": 0, "title": "'I'm left with £482. Was my Axa SunLife plan a mistake?'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Oct 25, 2015, 12:50 GMT - UK Markets closed 'I'm left with £482. Was my Axa SunLife plan a mistake?' By Jessica Gorst-Williams | Telegraph – 3 hours ago 6.20 0.00 \n'I saved £2,294 in this Guaranteed Over 50 plan and now, at age 94, have £482' \nIn 2001, a year after my husband died, I saw an advert fronted by a trusted celebrity for a plan which I then bought without advice. Since then I have been paying £14 a month, which so far comes to £2,294. The surrender value is now only £482. I am 94 years old and I feel I made a mistake. SD, Cheshire \nThe policy had been with Axa SunLife and is now in the Aviva (Other OTC: AIVAF - news ) fold, branded as a Friends Life (Other OTC: RSLLF - news ) product. \nOften a perceived advantage of this type of policy is the absence of an underwriting requirement. This means those in poor health do not need to make a declaration. However, when a customer dies shortly after a policy’s inception the payout is often minimal. \nIn this instance, had you died within two years of taking out the policy only 150pc of the premiums paid up to that point would have been paid out. \nThis means they are not policies to be taken out on your deathbed, as some may perceive them to be. \nYour Guaranteed Over 50 Plan is designed for the “whole of life” with the customer paying a fixed monthly premium throughout. The sum assured is agreed at the outset and depends on the customer’s age, sex and the premium selected. \n• 'Why did insurer increase car premium when 91-year-old was removed from policy?' \n• Warning on celebrity endorsed over 50s savings plans \nWell into the policy you converted it to a funeral plan, with the £1,125 cover plus a £250 funeral contribution being paid to a stipulated funeral provider. The plan can revert to a life policy but then the £250 funeral contribution is lost. The surrender value takes into account the premiums paid for insuring your life since the policy began. The insurer’s administration charges are also factored in. \nWith so much complexity for a relatively small payout I can see why you are having doubts. \nThe Financial Ombudsman Service tells me it gets around half a dozen complaints about such policies sold by various providers coming in each month. Very few cases, it says, are upheld. \nFriends Life is not, I am afraid, budging on this, although this doesn’t mean that others with similar policies shouldn’t approach their provider to see if a deal might be struck, such as a waiving of premiums. \n• If you want to contact Jessica, click here", "external_links": [], "published": "2015-10-25T11:03:00.000+02:00", "crawled": "2015-10-25T14:50:46.910+02:00", "highlightTitle": ""}