{"organizations": [], "uuid": "4e9c8ef02139b64e3f98d0a0862928a4418c3a80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/02/eurozone-greece-banks-idUSL5N1223UQ20151002", "country": "US", "title": "Greece likely to meet deadline for bank money release: euro zone officials", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Greece likely to meet deadline for bank money release: euro zone officials | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T23:11:00.000+03:00", "replies_count": 0, "uuid": "4e9c8ef02139b64e3f98d0a0862928a4418c3a80"}, "author": "Jan Strupczewski", "url": "http://www.reuters.com/article/2015/10/02/eurozone-greece-banks-idUSL5N1223UQ20151002", "ord_in_thread": 0, "title": "Greece likely to meet deadline for bank money release: euro zone officials", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS Oct 2 Greece is likely to qualify for recapitalisation funds for its banks by a Nov. 15 deadline because the payment depends mainly on financial sector reforms that it can implement by then, euro zone officials said on Friday.\nThe euro zone bailout fund has up to 25 billion euros ($28 billion) earmarked for the recapitalisation of the Greek banking sector under Athens' third bailout.\nOf that total, 10 billion is already in an account in Luxembourg, ready to be wired to Greece.\nIf European Central Bank stress tests of Greek banks show that they need more capital, and money offered by private investors for Greek banks is not enough, cash from the remaining 15 billion could be used, provided Athens implements the financial sector part of the bailout reforms by Nov. 15.\nEuro zone deputy finance ministers discussed the reforms and the timetable of disbursements at a teleconference on Friday.\nThey decided to divide the reforms that Greece needs to make in order to receive the remaining 3 billion euros in financing for this year, and the 15 billion for banks, into two sets.\nThe first set would contain 48 action points and laws which would have to be completed or passed by parliament by mid-October, officials said. Their completion would be the basis for the disbursement of 2 billion out of the 3 billion euros.\nThe remaining one billion and the 15 billion for banks would depend on the second set of reform milestones.\n\"The tendency is to have the financial sector reforms separated from the first full review,\" one euro zone official with knowledge of the discussions said.\n\"So the 15 billion could be released on the completion of the financial sector reforms alone,\" the official said.\nTwo other officials confirmed that was the plan.\nThe Greek parliament is to start passing the necessary laws on Oct. 9th.\nEuro zone officials acknowledged that most of the reforms in the 3-year Greek bailout programme were to be done at the beginning of the period, but said it was only fair given than roughly half of the total of 86 billion euros will also have been disbursed by the end of the year.\nThe deputy finance ministers' decision will need to be endorsed by euro zone finance ministers at their meeting in Luxembourg on Monday. ($1 = 0.8913 euros) (Editing by Ruth Pitchford)", "external_links": [], "published": "2015-10-02T23:11:00.000+03:00", "crawled": "2015-10-02T22:20:49.533+03:00", "highlightTitle": ""}