{"organizations": [], "uuid": "78eb1fbf401c6e123628daecfa413e302b0931f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/10/usa-livestock-antibiotics-idUSL1N1282D820151010", "country": "US", "title": "California adopts tough rules for antibiotic use in farm animals", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "California adopts tough rules for antibiotic use in farm animals | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T02:25:00.000+03:00", "replies_count": 0, "uuid": "78eb1fbf401c6e123628daecfa413e302b0931f1"}, "author": "Lisa Baertlein", "url": "http://www.reuters.com/article/2015/10/10/usa-livestock-antibiotics-idUSL1N1282D820151010", "ord_in_thread": 0, "title": "California adopts tough rules for antibiotic use in farm animals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES Oct 10 California Governor Jerry Brown on Saturday signed a bill that sets the strictest government standards in the United States for the use of antibiotics in livestock production.\nThe move from California, known for its leadership on public health and environmental issues, comes amid growing concern that the overuse of such drugs is contributing to rising numbers of life-threatening human infections from antibiotic-resistant bacteria known as \"superbugs.\"\nThe U.S. Centers for Disease Control and Prevention (CDC) estimates that 2 million people in this country are infected with drug resistant bacteria each year and that 23,000 die as a direct result.\n\"This puts California at the forefront of U.S. efforts to address the overuse of antibiotics in meat production,\" said Avinash Kar, a senior attorney with the Natural Resources Defense Council (NRDC).\nRoughly 70 percent of antibiotics important for human medicine are sold in the United States for use in meat and dairy production, public health experts say.\nVeterinary use of antibiotics is legal. However, as the number of human infections from antibiotic-resistant bacteria increases, consumer advocates, public health experts and investors have become more critical of the practice of routinely feeding antibiotics to chickens, cattle and pigs.\nCalifornia ranks third among U.S. states in terms of the value of its meat, milk, eggs and other livestock products.\nSome types of antibiotics can be purchased in the United States without a prescription for animal care. Uses include disease treatment, prevention of illness in healthy animals and growth promotion.\nThe bill, which goes into effect on Jan. 1, 2018, will restrict the regular use of antibiotics for disease prevention and bans antibiotic use to fatten up animals.\nIt also aims to stop over-the-counter sale of antibiotics for livestock use. Under the new rules, antibiotics would have to be ordered by a licensed veterinarian.\nAdditionally, California's Department of Food and Agriculture (CDFA) will be required to monitor antibiotic sales and use. CDFA will gain authority to collect information on antibiotic use in livestock production and to develop best practices.\nThe move comes as large restaurants and retailers are beginning to follow pioneers such as Whole Foods Market and Chipotle Mexican Grill in adopting strict antibiotic policies.\nNotably, McDonald's USA in March said it would stop buying chicken raised with antibiotics vital to fighting human infections within two years.\nNRDC and a coalition of public health, business, farm, environmental and consumer groups supported the measure, which lacked strong public opposition.\n(Editing by W Simon)", "external_links": [], "published": "2015-10-11T02:25:00.000+03:00", "crawled": "2015-10-11T01:57:53.302+03:00", "highlightTitle": ""}