{"organizations": [], "uuid": "3791a264de79caa1eebac28c493a8de86de2a7ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510020689.html", "country": "US", "title": "East Africa: Lenovo Enters East Africa's Smartphone Business", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "East Africa: Lenovo Enters East Africa's Smartphone Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T12:03:00.000+03:00", "replies_count": 0, "uuid": "3791a264de79caa1eebac28c493a8de86de2a7ff"}, "author": "", "url": "http://allafrica.com/stories/201510020689.html", "ord_in_thread": 0, "title": "East Africa: Lenovo Enters East Africa's Smartphone Business", "locations": ["East Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Winfred Kuria"], "text": "By Winfred Kuria \nLenovo has officially launched its smartphone business in the East African region. \nThe multinational is banking on the success of its smartphone business in Europe and Asia to propel the East African operation. \nDuring the launch held at its headquarters in Nairobi, Lenovo cited the growing internet usage as a growth opportunity for the company. \nAccording to the latest Communication Authority of Kenya fourth quarter sector report for the year 2014/15, there are an estimated 29.6 million internet users. \nMobile data subscriptions contribute to 99 per cent of the total subscriptions. \nDISTRIBUTION \nTo boost its smartphone market in the region, Lenovo is partnering with telecommunications and major distributors in the various EA countries. \nThe technology manufacturer has already signed a partnership with Safaricom and is currently pursuing Airtel. \n\"We moved into the market with the understanding that the consumer is spoilt for choice on their quest to acquire a smartphone. Our preposition to the consumer is the emphasis we have placed on style, productivity, privacy, power and entertainment in the manufacture of our devices,\" says Danish Oyugi, Lenovo's regional manager. \nPROSPECTS \nKenya is a fertile ground for growth because it provides 50 per cent of the smartphone business in the region. \nThe company has already sold 10,000 units of its recent 'Vibe Series' range of phones. \nLenovo rolls out at a time Chinese manufacturers Tecno and Infinix are getting a grip of the market. \nHowever, the market share is still uneven with the market leader Samsung recording a market share of 46 per cent as of the first quarter of 2015. \nLenovo is targeting entry- level smartphone users in Kenya with an aim of clinching 20 per cent market share by the end of 2016. East Africa \nPatients have raised concern over the sale of blood for transfusion at the Rift Valley Provincial General Hospital. see more » Copyright © 2015 The Nation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-02T12:03:00.000+03:00", "crawled": "2015-10-02T12:32:32.347+03:00", "highlightTitle": ""}