{"organizations": [], "uuid": "200cf20566bbdbac59d9665b48d800c8db8f94a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/26/usa-stocks-idUSL3N12Q4RC20151026", "country": "US", "title": "US STOCKS-Wall St slightly down as Apple, energy stocks weigh", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "US STOCKS-Wall St slightly down as Apple, energy stocks weigh | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:42:00.000+02:00", "replies_count": 0, "uuid": "200cf20566bbdbac59d9665b48d800c8db8f94a6"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/26/usa-stocks-idUSL3N12Q4RC20151026", "ord_in_thread": 0, "title": "US STOCKS-Wall St slightly down as Apple, energy stocks weigh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Fed meeting, more earnings reports awaited\n* Apple biggest drag on indexes\n* Pep Boys up after agreeing to be bought by Bridgestone\n* Ctrip.com up after deal with Qunar\n* Dow down 0.09 pct, S&P down 0.19 pct, Nasdaq up 0.16 pct (Adds details, updates prices)\nBy Abhiram Nandakumar\nOct 26 (Reuters) - Wall Street was slightly down on Monday as energy stocks fell on concerns of a crude oil supply glut and Apple's shares retreated a day ahead of its quarterly results.\nInvestors are also awaiting the Federal Reserve's two-day policy meeting, which begins on Tuesday. While the Fed is not expected to raise rates at the meeting, its statement on Wednesday will provide clues on the timing of a rate hike.\nApple's shares were down 3 percent at $115.55, making it the biggest drag on the three major indexes. The iPhone maker reports quarterly results after the market closes on Tuesday.\nCrude prices fell about 1 percent as global oversupply pushed fuel storage sites close to capacity. Exxon fell 1.4 percent, while Chevron was down 2 percent. Both report results on Friday.\nThe S&P energy sector's 1.6 percent fall led the decliners among the major S&P sectors, while health care stocks led the advancers.\n\"The theme today is kind of wait-and-hold,\" said Katrina Lamb, head of investment strategy and research at MV Financial.\n\"You've got a couple of key numbers and a pretty crowded calendar coming up this week. If you're a taking positions, you're probably just going to want to keep yourself hedged,\" Lamn said.\nAt 11:07 a.m. ET (1507 GMT), the Dow Jones industrial average was down 16.13 points, or 0.09 percent, at 17,630.57, the S&P 500 was down 3.99 points, or 0.19 percent, at 2,071.16 and the Nasdaq composite index was up 8.03 points, or 0.16 percent, at 5,039.89.\nData on Monday showed new U.S. home sales fell 11.5 percent in September, suggesting a softening of the housing market.\nFed Chair Janet Yellen has said the central bank could raise rates this year but only if it sees clear signs of sustained economic growth.\nTraders are pricing in only a 6 percent chance of rates being increased at this week's meeting and a 39 percent chance of a December hike, according to CME Group's FedWatch program.\nStrong quarterly results from tech companies have helped improve expectations on overall U.S. third-quarter earnings.\nS&P 500 earnings are estimated to have declined a more modest 2.8 percent in the quarter, compared with 4.9 percent forecast at the start of the reporting season, according to Thomson Reuters data.\nCtrip.com was up 23 percent at $91.35 after the online travel firm said it would merge with Qunar Cayman Islands. Qunar jumped nearly 14.4 percent to $45.13.\nPep Boys jumped 23.3 percent to $14.98 after it agreed to be acquired by Bridgestone for $15 per share.\nPiedmont Natural Gas soared nearly 40 percent to $58.93 after it agreed to be bought by Duke Energy. Duke Energy fell 2.5 percent.\nDecliners outnumbered advancers on the NYSE by 1,882 to 994. On the Nasdaq, 1,309 issues rose and 1,303 fell.\nThe S&P 500 index showed 29 new 52-week highs and eight new lows, while the Nasdaq recorded 70 new highs and 36 new lows. (Reporting by Abhiram Nandakumar in Bengaluru; Editing by Saumyadeb Chakrabarty)", "external_links": [], "published": "2015-10-26T18:42:00.000+02:00", "crawled": "2015-10-26T17:54:34.251+02:00", "highlightTitle": ""}