{"organizations": [], "uuid": "2a15abb573284fc6adfc309114e548d6baa1f219", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2013/12/23/13034569/MagicPay.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/10/prweb13034569.htm", "country": "US", "title": "MagicPay Merchant Services to Launch a Multiple Currency Credit Card Processing Account", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "MagicPay Merchant Services to Launch a Multiple Currency Credit Card Processing Account", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "2a15abb573284fc6adfc309114e548d6baa1f219"}, "author": "Rami", "url": "http://www.prweb.com/releases/2015/10/prweb13034569.htm", "ord_in_thread": 0, "title": "MagicPay Merchant Services to Launch a Multiple Currency Credit Card Processing Account", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MagicPay Merchant Services is pleased to announce the launch of its multiple currency credit card processing service. Many merchants struggle to locate a payment processing service that allows them to accept nearly any currency with their credit card transactions. These businesses frequently turn down customers from a wide variety of countries because of issues with currency conversion and foreign transaction fees. For a business to provide service to a wider variety of countries, it needs a payment processing service that can allow it to accept a much larger variety of currencies. That provides customers from other countries with the opportunity to pay for their purchases in their local currency, so they save the foreign transaction fees they would otherwise be billed for. Companies with a merchant account and credit card processing through MagicPay will be eligible for this service, which will give them 24/7 live support, next-day funding, and fraud management tools such as address verification technology. There are more than 120 currencies available.\nCompanies can accept credit card payments online, over the phone, or in person, in their customer's local currency. Merchants will be paid in US dollars, and can use recurring billing for foreign customers who choose to use their credit cards to subscribe to a product or service they want to receive at specific intervals. Virtual terminal access, an easy-to-use API, and management options for multiple users are significant benefits that many companies need, and make a multi-currency payment account desirable for companies that work with foreign customers.\nPrices for MagicPay's new service begin at less than $20 per month plus discount rates and transaction fees, allowing even businesses that do a small volume of transactions to afford to process credit cards for foreign customers. Affordable currency conversion fee, so companies can keep most of their money and their customers can enjoy buying what they want without foreign transaction fees that can really add up. Electronic invoicing and a customer credit card vault are also available for small, additional fees.\nAbout MagicPay Merchant Services, LLC.\nMagicPay was formed at the beginning of 2012 to be a full-service merchant account provider with a special focus on mobile payments. Although mobile payment merchant services did exist, MagicPay was created to expand the mobile payments market and take things to a whole new level by offering off-line processing, inventory options and lower processing costs. The company's overall goal is to not only provide the best possible credit card processing to its clients, but to continue to explore new and better methods for providing merchant services on smart phones and tablets.\nMagicPay is dedicated to providing its clients with the best possible service, and has expanded its service options into such areas as e-commerce and MOTO accounts as well as retail merchant accounts. As the company grows rapidly, it continues to attract merchants by offering unique services and features such as their free marketing software that allows merchants to create coupons and rewards programs for clients.\nWith the introduction of such innovations as Eco-statements, the EPN and credit card processing solutions for collection agencies, Magic pay hopes to continue and grow as an industry leader with the highest level of service and environmental integrity.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tYWdpY3BheS5uZXQ="], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T11:13:55.294+03:00", "highlightTitle": ""}