{"organizations": [], "uuid": "5b4e039893a506dd8374b54c53f39eb098faa2c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/9/x/q/f/image.related.afrArticleLead.620x365.gka5lx.png/1444899997418.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/malcolm-turnbull-speaks-out-ive-got-a-lot-of-money-but-ive-paid-a-lot-of-tax-20151015-gka5lx", "country": "AU", "title": "Malcolm Turnbull speaks out: I've got a lot of money but I've paid a lot of tax", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Malcolm Turnbull speaks out: I've got a lot of money but I've paid a lot of tax | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:12:00.000+03:00", "replies_count": 0, "uuid": "5b4e039893a506dd8374b54c53f39eb098faa2c9"}, "author": "Malcolm Turnbull", "url": "http://www.afr.com/news/politics/malcolm-turnbull-speaks-out-ive-got-a-lot-of-money-but-ive-paid-a-lot-of-tax-20151015-gka5lx", "ord_in_thread": 0, "title": "Malcolm Turnbull speaks out: I've got a lot of money but I've paid a lot of tax", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Malcolm Turnbull during question time at Parliament. Andrew Meares by Malcolm Turnbull When I became the Communications Minister I took great care – working with the secretary of Prime Minister and Cabinet – to ensure that all of my investments were in a form that would not offer any conflicts of interest.\nThat is why my and Lucy's investments are almost entirely composed of investments in managed funds outside Australia , to avoid conflicts within Australia and of course the virtue of a managed fund is that the investor has no say in where the manager puts the money.\nI notice the shadow assistant treasurer this morning offering me investment advice, which I thank him for but perhaps he should stick to his day job. He suggested I should invest in a large Australian industry super fund.\nThe reason, just so that honourable members are aware, I did not invest in managed funds – large managed funds like that in Australia – because obviously they're indexed funds. They have a very large exposure to Telstra and I was the Communications Minister and I had a lot to do with Telstra. The whole focus was to avoid conflicts.\nIn terms of managed funds resident in the Cayman Islands, let me be quite clear, most managed funds, hedge funds, and I think the one the honourable member mentioned is a good example, have an onshore US-based entity and an offshore one, located it might be in Singapore or the Cayman Islands or Ireland or Luxembourg, and the reason for that is so that non-US investors, when they invest, will receive their income without paying US withholding tax.\nThe consequence of an Australian investor investing in a managed fund of that kind located in the Cayman Islands is that all of the income that is paid to that Australian investor is taxed in Australia and paid to the Treasury.\nIf the Australian investor invested in a managed fund that was located in the United States there would be 15 per cent US withholding tax, so at least 15 per cent of the tax paid would go to the United States government, so the choice of the offshore vehicle actually means that more tax is paid in Australia than otherwise.\nThe same amount of tax is paid but more of it is paid in Australia. That is the consequence of the arrangements. There is no tax avoided in Australia – in fact, more tax is paid in Australia as a consequence.\n Deep sympathy Thank you, Mr Speaker. I have answered the question in the previous answer but I do have to record my deep sympathy for the honourable member (Labor MP Andrew Leigh). I felt sorry listening to him on the radio this morning, being forced to utter such crude smears, as he'd been sent out to do, and now he's having to do it again.\nHe is a former professor of economics and I know him well enough to know how uncomfortable he feels having to do the dirty work that the Leader of the Opposition is not prepared to do himself.\nTo avoid conflict in Australia The honourable member is spending a lot more time on my investments than I've had time to spend. I suppose all advice and assistance would be gratefully received if he has got nothing better to do with his time. But I will answer the honourable member's question in a substantive way. I described in an earlier answer the approach that I took to managing my and Lucy's investments, in order to avoid conflicts, and we took the approach of managed funds and offshore managed funds to avoid conflict in Australia and I think the members understand that.\nThe hedge funds that Lucy and I have been invested in, and one of which he describes, were selected for us by an investment manager in the United States, Josephine Lyndon, a very prominent Australian in New York City, and she has managed that portfolio, if you like, of managed funds. So I've left that very much in her hands.\nI don't have the time to be going through all these funds and, like many other people with a lot of other things to do, I put my investments in the hands of a very capable professional.\nNow, I should just draw members' attention to this fact, that many members of this chamber – it may well be almost all members of this chamber, including the Leader of the Opposition – are invested in Australian superannuation funds which have invested in companies or hedge funds or managed funds which are based or registered in the Cayman Islands.\nI saw in the press that a Chinese company, 10 Cent, is over 1 per cent of the international portfolio of First State Super and I think many members opposite are invested in that and I don't think they're suggesting the trustees of First State Super are doing anything inappropriate. So the real issue is this: Is tax being paid in Australia by Australians? In my case and in Lucy's case, in the case of our family interests, the answer is absolutely yes, in full.\nWe have always done that. We've been scrupulous about these affairs and we always will be.\nThe politics of envy It is a very sad day that the Labor Party, which could be talking today about the economy, could be asking about growth, could be proposing some new ideas on innovation or enterprise, spends most of today's question time and most of yesterday's question time on just another shabby smear campaign. Just another wander down the avenue of the politics of envy. Just another smear.\nI'll save the honourable member some trouble. The fact is that Lucy and I have been very fortunate in our lives. We have more wealth than most Australians, that is true. That is absolutely true. We've worked hard, we've paid our taxes, we've given back.\nI don't believe that my wealth, or frankly most people's wealth, is entirely a function of hard work. Of course hard work is important but, you know, there are taxi drivers that work harder than I ever have and they don't have much money. There are cleaners that work harder than I ever have, or you ever have, and they don't have much money.\nAnd the honourable Leader of the Opposition could think about some of those cleaners and how he looked after them. But Iet me say this to the honourable member, this country is built upon hard work, people having a go and enterprise.\nMore successful Some of us will be more successful than others, some of us are fortunate in the turn of business, some of us are fortunate in the intellect we inherit from our parents.\nThere is lot of luck in life and that's why all of us should say, when we see somebody less fortunate then ourselves, \"There but for the grace of God goes me\". I have always taken that view and honourable members opposite who know me know that is true.\nNow, let me say the simple point I made about First State Super was simply this: that big funds, big companies, small funds invest in these offshore vehicles and when they do, the income comes back to Australia and all of the tax – not most of it, all of it – goes to the Australian Taxation Office.\nSo really, if the honourable member wants to go round wearing a sandwich board saying, \"Malcolm Turnbull's got a lot of money\", feel free. I think people know that I've got a lot of money.\nThis is an edited version of Malcolm Turnbull's comments in federal Parliament yesterday.", "external_links": [], "published": "2015-10-15T15:12:00.000+03:00", "crawled": "2015-10-15T16:05:31.479+03:00", "highlightTitle": ""}