{"organizations": ["Hilton Worldwide", "Hilton Worldwide’s Spa Club", "The Spa Club", "DoubleTree", "Hilton Hotels & Resorts", "Spa Club", "Hilton", "Conrad Hotels & Resorts", "All Spa Club", "Waldorf Astoria Hotels & Resorts", "First Ever Global Spa Treatment Membership Consumers"], "uuid": "30832dbb5f87db4b77968090af9c280d2cbbf6bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/welcome-spa-club-hilton-introduces-hotel-industrys-first-ever-global-s/45717", "country": "US", "title": "Welcome to The Spa Club: Hilton Introduces the Hotel Industry's First Ever Global Spa Treatment Membership", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Welcome to The Spa Club: Hilton Introduces the Hotel Industry's First Ever Global Spa Treatment Membership", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:27:00.000+03:00", "replies_count": 0, "uuid": "30832dbb5f87db4b77968090af9c280d2cbbf6bb"}, "author": "", "url": "http://businesswireindia.com/news/news-details/welcome-spa-club-hilton-introduces-hotel-industrys-first-ever-global-s/45717", "ord_in_thread": 0, "title": "Welcome to The Spa Club: Hilton Introduces the Hotel Industry's First Ever Global Spa Treatment Membership", "locations": ["United States", "Hilton Short Hills", "Va."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Crabbe", "Edelman Berland", "Mclean"], "text": "Thursday, October 15, 2015 5:57PM IST (12:27PM GMT) (BW)(VA-HILTON-WORLDWIDE) Welcome to The Spa Club: Hilton Introduces the Hotel Industry's First Ever Global Spa Treatment Membership Consumers crave everyday wellness – fresh, new membership delivers with generously discounted spa treatments and hotel amenities Mclean, Va., United States Transforming hotel spa treatments from an extravagance to a monthly must, Hilton Worldwide (NYSE: HLT) has launched a global spa treatment membership, The Spa Club. The Spa Club offers local residents a discounted spa treatment each month, access to amenities at the Hilton nearest them, and a host of other perks. From plush robes, to a therapeutic environment, and a renowned level of service, The Spa Club delivers the benefits of monthly membership with the luxury of a hotel atmosphere. This exclusive membership is anticipated in approximately 30 spas around the world before the end of the year – just in time for the holidays. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20151015005438/en/ Transforming hotel spa treatments from an extravagance to a monthly must, Hilton Worldwide has launched a global spa treatment membership, The Spa Club. (Photo: Business Wire) A recent survey found that 58 percent of respondents feel they are unable to achieve an ideal state of well-being due to financial concerns 1 . Hilton Worldwide is one of the largest providers of spa services on a global scale, with more than 400 hotels offering spa services worldwide. The Spa Club is Hilton’s solution to this financial gap by providing a high-quality hotel spa experience and day access to the very best fitness and spa facilities with convenient, regular appointments at an affordable price. Hilton Worldwide’s Spa Club will be offered at select Hilton Hotels & Resorts, Waldorf Astoria Hotels & Resorts, Conrad Hotels & Resorts, Curio – A Collection by Hilton, DoubleTree by Hilton and Embassy Suites by Hilton properties around the world. All Spa Club members can select the Spa Club location most convenient to them to enjoy one 50-60 minute massage or facial during Spa Club hours each month at a minimum of a 30 percent discount for a 12-month membership. Also included in the monthly program is access to the hotel’s spa facilities and fitness center on the day of their treatment, complimentary hotel parking, and discounts on retail items and other property perks. Members visiting other Spa Club locations will receive at least a 5 percent discount or more off any spa treatment, any time. The Spa Club offers two different membership levels – a six-month or a 12-month commitment. “We look forward to welcoming new members to Spa Club locations around the world,” said Ryan Crabbe, senior director of global wellness, Hilton Worldwide. “We’re proud to be the first in the industry to offer a flexible, affordable program in response to profound recent cultural interest towards healthier, more balanced living.” The high demand for wellness was made clear at Hilton Short Hills , which introduced a similar membership offering over the past three years. The overwhelming success of this pilot, along with clear research supporting the desire for affordable wellness, revealed an opportunity for Hilton Worldwide to respond to this growing demand and be a wellness pioneer in the hotel space. To stay up to date with Hilton’s latest wellness offerings visit www.hiltonworldwideglobalmediacenter.com . About Hilton Worldwide Hilton Worldwide (NYSE: HLT) is a leading global hospitality company, spanning the lodging sector from luxury and full-service hotels and resorts to extended-stay suites and focused-service hotels. For 96 years, Hilton Worldwide has been dedicated to continuing its tradition of providing exceptional guest experiences. The company's portfolio of twelve world-class global brands is comprised of more than 4,440 managed, franchised, owned and leased hotels and timeshare properties, with more than 730,000 rooms in 97 countries and territories, including Hilton Hotels & Resorts, Waldorf Astoria Hotels & Resorts, Conrad Hotels & Resorts, Canopy by Hilton, Curio – A Collection by Hilton, DoubleTree by Hilton, Embassy Suites by Hilton, Hilton Garden Inn, Hampton by Hilton, Homewood Suites by Hilton, Home2 Suites by Hilton and Hilton Grand Vacations. The company also manages an award-winning customer loyalty program, Hilton HHonors®. Hilton HHonors members who book directly through preferred Hilton channels have access to benefits including free standard Wi-Fi, as well as digital amenities that are available exclusively through the industry-leading Hilton HHonors app, where HHonors members can check-in, choose their room, and access their room using a Digital Key. Visit news.hiltonworldwide.com for more information and connect with Hilton Worldwide at www.facebook.com/hiltonworldwide , www.twitter.com/hiltonworldwide , www.youtube.com/hiltonworldwide , www.flickr.com/hiltonworldwide , and www.linkedin.com/company/hilton-worldwide . 1 The Edelman American Well-Being Study was based on interviews conducted among 1,053 respondents representative of the United States general population ages 18-years-old and older. The survey was conducted from November 11 th - 26 th , 2014 by Edelman Berland with a margin of error of +/- 3.02%. View source version on businesswire.com: http://www.businesswire.com/news/home/20151015005438/en/ MULTIMEDIA AVAILABLE :", "external_links": [], "published": "2015-10-15T15:27:00.000+03:00", "crawled": "2015-10-15T16:20:04.670+03:00", "highlightTitle": ""}