{"organizations": ["AU Commission", "Says Royal Algeria Significantly Invests in Renewable Energies"], "uuid": "e6b2e82fc43429ff1167ca5dc39cea0bb04001d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510051212.html", "country": "US", "title": "Algeria: Algeria Significantly Invests in Renewable Energies, Says Royal", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Algeria: Algeria Significantly Invests in Renewable Energies, Says Royal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:07:00.000+03:00", "replies_count": 0, "uuid": "e6b2e82fc43429ff1167ca5dc39cea0bb04001d2"}, "author": "", "url": "http://allafrica.com/stories/201510051212.html", "ord_in_thread": 0, "title": "Algeria: Algeria Significantly Invests in Renewable Energies, Says Royal", "locations": ["Morocco", "Western Sahara", "Algeria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Algeria Significantly Invests in Renewable Energies, Says Royal Tagged: Morocco: AU Commission Chairperson Reiterates Firm Position for Decolonization of Western Sahara \nAlgiers — Algeria is a country that significantly invests in the field of energy transition, notably the renewable energies, said Saturday in Algiers, French Minister for Ecology, Sustainable Development and Energy, Segolene Royal. \nSpeaking to the press following her audience with President of the Republic Abdelaziz Bouteflika, Royal said that Algeria, which is a \"key\" country in the world as producer of fossil energy, is investing a lot in the renewable energy, waste treatment and water sanitation, as part of the energy transition. \nNoting the existence of several projects in Algeria as part of the energy transition, she emphasized the importance of all the investments made in this area during the Paris Conference on Climate Change (COP-21) scheduled in Paris in December. \nIn this regard, the French minister said having handed over to President Bouteflika \"a letter from his French counterpart Francois Hollande, who thanked him for his commitment to COP-21.\" \n\"France relies on Algeria for the success of the Paris Conference on Climate,\" she said, recalling that Algeria, on 20 September, sent a contribution on the subject. \nIn addition, Royal said having discussed with the Head of State about the climate and security issues to be discussed at COP-21, like biodiversity. \nPresident Bouteflika \"is very concerned, involved and connoisseur of all the sciences,\" Royal concluded. Algeria \nFrench Minister for Ecology, Sustainable Development and Energy Segolene Royal expressed Saturday in Algiers France's … see more » Copyright © 2015 Algerie Presse Service. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-05T13:07:00.000+03:00", "crawled": "2015-10-05T15:47:56.448+03:00", "highlightTitle": ""}