{"organizations": [], "uuid": "f1e55a5025c10954d6870d84cc8944c435fa603e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8955331_G.jpg", "site_section": "http://www.cbs8.com/category/120652/money", "section_title": "Money: Personal Finance, Business, Small Business news features - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30196873/a-rally-in-energy-stocks-doesnt-lift-broader-market", "country": "US", "title": "A rally in energy stocks doesn't lift broader market", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "A rally in energy stocks doesn't lift broader market - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "f1e55a5025c10954d6870d84cc8944c435fa603e"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30196873/a-rally-in-energy-stocks-doesnt-lift-broader-market", "ord_in_thread": 0, "title": "A rally in energy stocks doesn't lift broader market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By KEN SWEET\nAP Business Writer NEW YORK (AP) - U.S. stocks paused Tuesday, closing moderately lower after five straight days of gains. DuPont and energy companies rose sharply, but the overall market was weighed down by health-care stocks, especially biotechnology companies.\nInvestors remain mostly in standby mode, with the closely watched minutes from the Federal Reserve's September meeting coming out on Thursday and third-quarter company earnings just around the corner.\nThe Dow Jones industrial average added 13.76 points, or 0.1 percent, to 16,790.19. The Standard & Poor's 500 index lost 7.13 points, or 0.4 percent, to 1,979.92 and the Nasdaq composite lost 32.90 points, or 0.7 percent, to 4,748.36.\nThe biggest gainer in the S&P 500 and Dow was chemical giant DuPont, which rose $3.93, or nearly 8 percent, to $55.21. DuPont's CEO Ellen Kullman announced she would retire effective next week. DuPont's profits have lagged in recent years, and the company has been a target of activist investors like Nelsen Peltz.\nBiotechnology stocks were hit hard. The Nasdaq Biotechnology Index fell nearly 4 percent after the recently announced 12-nation Trans-Pacific Partnership trade deal provided only eight years of certain kinds of drug patent protection, less than the 12 years that the industry was lobbying for.\nBiotech stocks have been hammered in recent months because of investor concerns that the industry might face more scrutiny from Washington over its drug pricing practices. The index is down 24 percent from its peak in late July.\nBarring some geopolitical crisis or massive company news, the next major move for the market will likely come Thursday, when investors will get the minutes from the Fed's latest policy meeting in September.\nInvestors are increasingly confident the Federal Reserve will hold off for longer than previously expected on raising interest rates following last week's jobs report, which showed that the U.S. economy was creating fewer jobs.\nSecurities that allow investors to bet on which way the Fed will move interest rates now show the market expects the next rate hike will come in March 2016. The minutes, which break down the issues the Fed addressed at their last meeting, should provide clues on whether policymakers still feel confident about raising interest rates.\n\"We need to see if they had signs that last week's bad jobs report was coming, and decided to hold off on raising rates then, or if they are still set on moving this year,\" said J.J. Kinahan, chief market strategist at TD Ameritrade.\nIn energy markets, oil rose after the Energy Department said U.S. crude oil production declined by 120,000 barrels per day in September compared with August. The agency also expects oil production to decline from an average of 9.2 million barrels per day this year to 8.9 million barrels per day in 2016.\nU.S. benchmark crude jumped $2.27 to close at $48.53 a barrel on the New York Mercantile Exchange. That helped send oil and gas companies sharply higher. ConocoPhillips, Chevron and ExxonMobil rose between 2 and 4 percent each.\nBrent Crude, a benchmark for international oils used by many U.S. refineries, rose $2.67 to $51.92 a barrel in London.\nIn other futures trading on the NYMEX:\n- Wholesale gasoline rose 5.1 cents to close at $1.436 a gallon.\n- Heating oil rose 6.3 cents to close at $1.612 a gallon.\n- Natural gas rose 2 cents to close at $2.47 per 1,000 cubic feet.\nU.S. government bond prices rose slightly. The yield on the 10-year Treasury note edged down to 2.04 percent. The dollar rose to 120.25 yen and the euro rose to $1.1269.\nIn metals trading, the price of gold rose $8.80 to $1,146.40 an ounce, silver rose 28 cents to $15.98 an ounce and copper was little changed at $2.36 a pound.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-07T00:23:20.703+03:00", "highlightTitle": ""}