{"organizations": [], "uuid": "d39b9faf309ecc238bcd6053962da6c6741424d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/d/8/t/0/image.related.afrArticleLead.620x365.gk5ata.png/1445563878963.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/national/malcolm-turnbull-has-arrived-as-prime-minister-at-a-crucial-point-in-australian-history-20151009-gk5ata", "country": "AU", "title": "Malcolm Turnbull has arrived as Prime Minister at a crucial point in Australian history", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Malcolm Turnbull has arrived as Prime Minister at a crucial point in Australian history | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T21:15:00.000+03:00", "replies_count": 0, "uuid": "d39b9faf309ecc238bcd6053962da6c6741424d2"}, "author": "Elena Douglas", "url": "http://www.afr.com/news/politics/national/malcolm-turnbull-has-arrived-as-prime-minister-at-a-crucial-point-in-australian-history-20151009-gk5ata", "ord_in_thread": 0, "title": "Malcolm Turnbull has arrived as Prime Minister at a crucial point in Australian history", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Malcolm Turnbull has acknowledged the difficulties facing the country. If he can meet them head-on he will be among a small group of \"enlargers of life\" - to Quote: historian Manning Clark. Andrew Meares by Elena Douglas Change the prime minister, to paraphrase Paul Keating, and you change the country. The scale of transformation depends on the dance between the will of the individual and their grip on power, and how well their character, world view and policy prescriptions suit the music of the times.\nWhen Malcolm Turnbull said, \"There has never been a more exciting time to be alive than today and there has never been a more exciting time to be an Australian\", he knew the creative destruction that Joseph Schumpeter promised is arriving with force. For the smart, energetic and adaptable, this is the best time to be alive. But if you are low skilled – with inferior literacy and numeracy skills – these will be harsh times indeed.\nOld certainties are under challenge No precedent exists in Australian political history for the Turnbull experiment. To invoke the historian Manning Clark, Australians now live in a country where \"neither the historians, the prophets, the poets or the priests have drawn the maps\". Turnbull knows the old certainties are under challenge. The 21st century will make the disruption of the past 50 years look like tranquility. Can Turnbull weave together the policy and the politics that will satisfy his party room, his coalition partners, the crossbenchers and the voters?\nThe initial framework with which to assess Turnbull is provided by Manning Clark. In his A History of Australia , Clark depicts two types of prime ministers and leaders: the \"enlargers of life\" who want \"all human beings to have life and to have it more abundantly\" versus those whose moralism led Clark to label them \"punishers and straighteners\". The role ascribed to Menzies and his Liberal successors in Clark's tragedy was almost always as punishers and straighteners. Clark reserves his disdain for the Liberals who tore down the \"great men\" of Labor.\nClark's disposition towards the collective and his philosophical alignment with revolutionary communism means this distinction is beloved on the left and disputed on the right. Cry as they might, the right cries in vain. However just or unjust this formulation may be, these categories live in Australia's political and cultural life. They remain a wellspring of the creative classes in this country, a source of moral and cultural righteousness.\nDifferent breed of Liberal This matters. Turnbull arrives as a new Liberal who seeks to change not just the atmospherics of politics but the tenor of Australian life. As a barrister, tutored in the art of rhetoric, he knows the ultimate victory is to take on your opponent's terms of the argument and still win. Australia has never had a prime minister who sought to be an enlarger from the right.\n Turnbull's arrival as Prime Minister has already affected the tenor and tone of the national conversation, which has switched to innovation and agility. The Coalition now leads Labor 53 to 47 per cent in the two-party preferred vote in the Fairfax/Ipsos poll – the largest lead since the September 2013 election. Even starker is Turnbull's personal rating – he leads Bill Shorten 67 per cent to 21 per cent as preferred prime minister. Results like these indicate something significant is under way but it is still the honeymoon.\nNonetheless, from this vantage point, confidence in a Turnbull electoral victory is warranted. How will Turnbull fit into the pantheon of Australia's postwar prime ministers? Those who defined their times are Robert Menzies (1949-66), Gough Whitlam (1972-1975), Robert Hawke (1983-1991), Paul Keating (1991-1996, and including his earlier period as treasurer) and John Howard (1996-2007). Looking at them through the prism of their economic policy, the particular demands of their times and their political strategy is revealing.\nRecycled former leader Between Menzies (1894-1978), founder of the Liberal Party and Australia's longest-serving prime minister (1949-1966), and Turnbull, there are obvious comparisons and deep distinctions. Like Menzies, Turnbull is a recycled former leader. He is a man whom many Australians long regarded as destined for The Lodge. Like Menzies, Turnbull has had his missteps. His impatience over the Godwin Grech affair and his lack of affinity for his Coalition colleagues' views on climate change were failings that cost him the party leadership. Like Menzies, he was administered the sacrament of defeat.\nMenzies' downfall preceded his later record-breaking reign. In his memoirs, he said \"on balance … my humiliation in 1941 turned out to be a good thing for the country\". Turnbull's determined efforts to rebuild support from the Liberal backbench – and their manifest self-interest – were the twin forces that restored him to power. One can imagine Turnbull, like Menzies, penning an admission that the experience made him a better prime minister.\nMenzies' postwar election victory over Ben Chifley was thanks to his repudiation of Labor's faith in state power to solve every problem. Menzies, who did little to dismantle the \"Australian settlement\" of protectionist regulation, still stood for private enterprise and investment in capacity – industry, manufacturing, mineral development, a new social safety net and the establishment of universities. Menzies' political strategy was to engage the individual. He did this through the forgotten people, neither workers nor bosses but \"the great and sober and dynamic\" middle class, the \"salary-earners, shopkeepers, skilled artisans, professional men and women, and farmers\".\nAttuned to the cities Turnbull's first words as Prime Minister were also about elevating the individual and promoting individual freedom of choice. \"This will be a thoroughly Liberal government. It will be a thoroughly Liberal government committed to freedom, the individual and the market.\"\nHis political strategy is evolving. He is hoping to appeal to the creative and economically successful classes, to keep aspirational outer-suburban voters in the tent through the promise of his economic competence in changing times. His themes are competence and modernisation.\nTurnbull is lining up to put the cities at the centre of his political strategy. Just as for Whitlam, championing investment in urban life suits the times. Cities are increasingly regarded as the true engines of economic growth. A new economic literature is being written on the role of cities: as the economy becomes more knowledge-based, it is the cities that are the drivers of future wealth. The creative class of designers, software engineers, scientists, mathematicians, financial professionals and consultants are the people who are at work creating the data-driven industries of tomorrow. Turnbull knows this. These people gravitate to vibrant, well-resourced, socially open and pedestrian- and bike-friendly cities.\nMenzies was, as well, the ultimate traditionalist; Turnbull is a progressive. He champions the causes of the inner city, such as marriage equality and women in leadership, and benefits from a different position on climate-change advocacy.\nOn cultural symbolism, Menzies and Turnbull are opposites. Menzies used the Cold War to define his convictions. The Cold War loomed larger for Menzies than Islamic terrorism and ISIS do for Turnbull. Menzies, the great Empire loyalist, had a nationalism that was of a variety we scarcely understand today. Turnbull was radicalised in his Australian nationalism by his time at Oxford (as were other Australians, such as Rupert Murdoch) and led the movement for Australia to become a republic, a step beyond Menzies' imagination.\nThe reform hurdle It is tempting to see parallels between Turnbull and Keating. Turnbull supports the Keating commitment to an Australian republic, relentless engagement with Asia and the search for a new compact with Aboriginal Australia. While Keating was the nation's most reforming treasurer, Turnbull knows that economic reform is a far harder project these days. He would share Keating's spirit of economic reform but operates in a different context.\nTurnbull, like Hawke, wants to bring people together but he is unlikely to have Hawke's unique skills as a consensus builder. The first defining event of the Hawke prime ministership was the April 1983 economic summit, which was called as a meeting between leaders of business, government and trade unions to discuss unemployment and inflation, and a prices and incomes accord. One of Turnbull's early acts as Prime Minister was to reconvene the National Reform Summit. This had originally been convened – in a sign of the times – not by government but by newspapers, The Australian Financial Review and The Australian .\nThe contrast between Turnbull and Howard is apparent. While both have credentials as economic reformers, the contrast in their political strategies is a defining element. Howard's electoral strength lay with aspirational outer-suburban families who were socially conservative, and whom the Liberal Party considered tired of reform, displaced by recession and uncomfortable about the rapid redefinition of their country. Howard's political strategy was to appeal to their instincts and desires for stability, nostalgia, safety and, famously, a \"relaxed and comfortable\" future under his leadership.\nIt is a tribute to Howard that he encouraged Turnbull, despite the philosophical differences between them. It was Howard who encouraged Turnbull not to leave politics after his defeat in the party room by Tony Abbott.\nReclaiming the Liberals' cultural influence Turnbull has an acute understanding of the limitations of the cultural approach of both Howard and Abbott. They chose to operate from outside the cultural and creative centres of Australian life. The price of this strategy has been the loss of cultural influence – that loss is now probably unsustainable. Hence the need for Turnbull and a new approach. As Paul Kelly recently argued in The Australian newspaper, \"In Australia, conservatives have lost influence in the educational institutions, schools and universities, lack any presence in the ABC as public broadcaster and are weak across the entire creative arts. The consequence is apparent: conservatives lack both the educational method and creative imagination to shape the mind and to sway opinion.\"\nTurnbull reads the times differently to many in the Liberal Party. In fact, in Australia today, those in the country's boardrooms read the future very differently to most in the Australian Parliament – on both sides of our politics. The boardrooms of Australia are apprehensive of the disruption – the \"Uberisation\" – and the disintermediation of their industries. Banking and finance, insurance, retail, all of the big employers in the nation know harsh change is coming. Most MPs are radically unprepared and underappreciate the radical transformations taking place in the global economy that are only just beginning to be felt in our economic accounts.\nTurnbull is aware of the demands of this new economic reality. His response is to confront it head on. In his first speech as Prime Minister, he said: \"The Australia of the future has to be a nation that is agile, that is innovative, that is creative. We can't be defensive, we can't future-proof ourselves. We have to recognise that the disruption that we see driven by technology, the volatility in change, is our friend, if we are agile and smart enough to take advantage of it.\"\nBut \"agile\" is just a word until it has been given tangible policy expression. This won't be easy and is Turnbull's greatest challenge. What will he do on the tax reform front? What will he do on industrial relations reform? What will he do on spending restraint to restore the budget? The answers to these questions will test both his skill and his conviction.\nTo perform in this new economy, our innovation and education system need serious reform. By every measure – the global Programme for International Student Assessment results, mathematics and science literacy, industry researcher engagement, R&D investment, venture capital availability, patents and commercialisation of intellectual property – Australia is not a leading nation.\nIn categories such as industry and industry-research engagement we are second to last in the OECD. To make true his opening statement as Prime Minister – \"We will ensure that all Australians understand that their government recognises the opportunities of the future and is putting in place the policies and the plans to enable them to take advantage of it\" – will require the implementation of system and policy change that defied the Abbott government. The task is daunting. The policy setting now in place cannot do the heavy lifting required.\nThe Liberal Party will need to do some reinvention of its own. In the age of Uber and Google, new industries and ideas are required. As the demographer Richard Florida has demonstrated, new jobs are created faster in cities. Australia's economy can only diversify, retool and respond to the new opportunities of the service economy and Asia if its creative talent is harnessed. One of Turnbull's missions must be to end the long-term war between the Liberal Party and the creative class.\nThis could be the beginning of a new chapter in Australian politics. The meaning of Malcolm Turnbull could be to rewrite the rule book on what it means to be a Liberal and an Australian in the digital age.\nElena Douglas is adjunct professor at the University of Western Australia and founder of public knowledge agency Knowledge Society. With Australia's Chief Scientist, Professor Ian Chubb, she will host Knowledge Nation – A Summit for the Jobs and Skills of Tomorrow on December 10, in Sydney.", "external_links": ["https://books.google.com.au/books/about/History_of_Australia.html?id=PYpNYjr_xQEC", "http://www.econlib.org/library/Enc/CreativeDestruction.html"], "published": "2015-10-22T21:15:00.000+03:00", "crawled": "2015-10-23T05:07:01.470+03:00", "highlightTitle": ""}