{"organizations": [], "uuid": "17e40aee91128991935578ac83c0814379321300", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=KKR", "section_title": "Yahoo! Finance: KKR News", "url": "http://finance.yahoo.com/news/eu-mergers-takeovers-oct-8-132953419.html", "country": "GB", "title": "EU mergers and takeovers (Oct 8) - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "EU mergers and takeovers (Oct 8) - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "17e40aee91128991935578ac83c0814379321300"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/eu-mergers-takeovers-oct-8-132953419.html", "ord_in_thread": 0, "title": "EU mergers and takeovers (Oct 8) - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS, Oct 8 (Reuters) - The following are mergers under review by the European Commission and a brief guide to the EU merger process:\n\nAPPROVALS AND WITHDRAWALS\n-- Italian investment company Exor, the holding company of the Agnelli family, to acquire Bermuda-based reinsurer PartnerRe (approved Oct. 7)\n-- Private equity firm KKE to acquire Swiss software licencing company SoftwareOne Holding AG (approved Oct. 7)\n\nNEW LISTINGS\n-- French insurer Axa to acquire insurer Genworth Financial Inc's lifestyle protection insurance business (notified Oct. 5/deadline Nov. 10/simplified)\n\nEXTENSIONS AND OTHER CHANGES\nNone\n\nFIRST-STAGE REVIEWS BY DEADLINE\n\nOCT 12\n-- U.S. investment firm Colony Capital and French insurer Axa to jointly acquire data center operator Groupe Data 4 (notified Sept. 7/deadline Oct. 12/simplified)\n\nOCT 14\n-- U.S. chipmaker Intel to acquire U.S. peer Altera (notified Sept. 9/deadline Oct. 14)\n\nOCT 16\n-- PGA Motors SAS, which is indirectly controlled by German carmaker Volkswagen AG, to acquire car seller MSA Groupe SAS (notified Sept. 11/deadline Oct. 16)\n-- Private equity firms Blackstone Group and Corsair Capital to jointly acquire U.S. investment management firm First Eagle Management (notified Sept. 11/deadline Oct. 16/simplified)\n\n\nOCT 19\n-- Oil trader Vitol to acquire the other half of storage company VTTI from Malaysian shipping company MISC Bhd (notified Sept. 14/deadline Oct. 19/simplified)\n-- Investors Parcom Capital and Pon Holdings to acquire Dutch engineering services company Royal Imtech's marine unit (notified Sept. 14/deadline Oct. 19)\n-- Buyout fund Gilde Fund and Parcom Fund to acquire Dutch textiles and geosynthetics supplier Ten Cate (notified Sept. 14/deadline Oct. 19/simplified)\n-- French bank BNP Paribas to acquire GE Capital Corp's European car leasing business (notified Sept. 14/deadline Oct. 19/simplified)\n\nOCT 20\n-- Carlyle Group LP to acquire data storage unit Veritas from antivirus software maker Symantec Corp (notified Sept. 15/deadline Oct. 20/simplified)\n\nOCT 21\n-- Private equity firm Hellman & Friedman Capital Partners to acquire Dream Luxco SCA, the holding company of security services provider Securitas Direct Group (notified Sept. 16/deadline Oct. 21/simplified)\n\nOCT 23\n-- Also Holding AG, a unit of Germany's Droege International Group AG, to acquire Polish IT company PC Factory S.A. (notified Sept. 18/deadline Oct. 23)\n-- Private equity firm Bain Capital to acquire French food producer Davigel Group (notified Sept. 18/deadline Oct. 23/simplified)\n\nOCT 26\n-- Chilean-based miner Antofagasta to acquire 50 percent of Canadian minier Barrick Gold Corp's Zaldivar copper mine (notified Sept. 21/deadline Oct. 26/simplified)\n\nOCT 27\n-- U.S. plane maker Lockheed Martin to acquire U.S. peer Sikorsky Aircraft from United Technologies Corp (notified Sept. 22/deadline Oct. 27/simplified)\n-- Financial industry software maker Fidelity National Information Services to acquire U.S. peer SunGard Data Systems Inc (notified Sept. 22/deadline Oct. 27/simplified)\n\nOCT 28\n-- Grosvenor Group and Canada's Public Sector Pension Investment Board to jointly acquire a real estate property in Milan, Italy (notified Sept. 23/deadline Oct. 28/simplified)\n\nOCT 29\n-- U.S. data center operator Equinix to acquire British peer Telecity Group (notified Sept. 24/deadline Oct. 29)\n\nOCT 30\n-- Hutchison Whampoa to acquire Telefonica's O2 UK subsidiary (notified Sept. 11/deadline extended to Oct. 30 from Oct 16 after the British competition authority asked to take over the case)\n-- Private equity firm Triton to acquire Dutch engineering services company Imtech's Nordic businesses (notified Sept. 25/deadline Oct. 30)\n-- German home improvement store OBI to acquire Austrian retailer BauMax (notified Sept. 25/deadline Oct. 30/simplified)\n\nNOV 9\n-- Coca-Cola Enterprises, Coca-Cola Iberian Partners, German bottler Coca-Cola Erfrischungsgetraenke AG and Icelandic bottler Vífilfell hf to merge (notified Oct. 2/deadline Nov. 9)\n-- U.S. chipmaker Avago Technologies to acquire U.S. peer Broadcom Corp (notified Oct. 2/deadline Nov. 9)\n\nNOV 10\n-- BT Pension Scheme and Canada Pension Plan Investment Board to acquire a London property (notified Oct. 5/deadline Nov. 10/simplified)\n\nDEC 9\n-- U.S. drinks can maker Ball Corp to acquire British rival Rexam Plc (notified June 15/deadline extended to Dec. 9 from Nov. 25)\n\nJAN 13\n-- U.S. packages delivery company FedEx to acquire Dutch peer TNT (notified July /deadline extended to Jan. 13 from Dec. 8 after the companies asked for more time)\n\nJAN 18\n-- South African paper maker Mondi to acquire some assets from portfolio company Walki (notified July 29/deadline extended to Jan. 18 from Sept. 2 after the European Commission opened an in-depth investigation)\n\nFEB 10\n-- U.S. office supplier Staples to acquire U.S. rival Office Depot (notified Aug. 21/deadline extended to Feb. 10 from Sept. 25 after the European Commission opened an in-depth investigation)\n\nMARCH 3\n-- Cable telecoms company Liberty Global's Belgian subsidiary Telenet to buy mobile network operator Base from Dutch group KPN (notified Aug. 17/deadline extended for the fourth time to March 3 from Feb. 18)\n\nSUSPENDED\n-- Oilfield services provider Halliburton to buy rival Baker Hughes in a stock and cash transaction (notified July 23/deadline suspended after the companies provided insufficient information)\n-- SOCAR, Azerbaijan's state energy company, to buy stakes in Greek natural gas grid operator DESFA from Greek natural gas utility DEPA (notified Oct. 1/deadline suspended on Jan. 21)\n\nGUIDE TO EU MERGER PROCESS\n\nDEADLINES:\nThe European Commission has 25 working days after a deal is filed for a first-stage review. It may extend that by 10 working days to 35 working days, to consider either a company's proposed remedies or an EU member state's request to handle the case.\nMost mergers win approval but occasionally the Commission opens a detailed second-stage investigation for up to 90 additional working days, which it may extend to 105 working days.\n\nSIMPLIFIED:\nUnder the simplified procedure, the Commission announces the clearance of uncontroversial first-stage mergers without giving any reason for its decision. Cases may be reclassified as non-simplified - that is, ordinary first-stage reviews - until they are approved.\n(Compiled by Foo Yun Chee)\nMergers, Acquisitions & Takeovers European Commission Private equity firm Genworth Financial Inc", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T19:18:28.960+03:00", "highlightTitle": ""}