{"organizations": [], "uuid": "2c3260844c6f09e41ed5bd1030d7dd3b97fa2b78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/heritage-newspapers/rss/627", "section_title": "Heritage Newspapers : Personal Finance", "url": "http://business-news.thestreet.com/heritage-newspapers/story/retirees-are-feeling-the-financial-burden-of-rent/13321454", "country": "US", "title": "Retirees Are Feeling the Financial Burden of Rent", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Retirees Are Feeling the Financial Burden of Rent", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:50:00.000+03:00", "replies_count": 0, "uuid": "2c3260844c6f09e41ed5bd1030d7dd3b97fa2b78"}, "author": "", "url": "http://business-news.thestreet.com/heritage-newspapers/story/retirees-are-feeling-the-financial-burden-of-rent/13321454", "ord_in_thread": 0, "title": "Retirees Are Feeling the Financial Burden of Rent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robert McGarvey"], "text": "Retirees Are Feeling the Financial Burden of Rent Written by: Robert McGarvey 10/13/15 - 8:50 AM EDT More Headlines 3 Mistakes That Will Completely Derail Your Retirement \nNEW YORK ( MainStreet ) — The report out of Harvard’s Joint Center for Housing Studies is a gusher of bad news about apartment rentals, and the worst news is about the grim future that awaits senior citizens living on fixed incomes. Entitled “Projecting Trends in Severely Cost-Burdened Renters: 2015–2025,” the study projects that rents will keep climbing - faster than inflation - and the pains that will cause seniors on fixed incomes are obvious and sharp. The study focused especially on renters who are “severely burdened” by rents -- amounting to one in four renters in 2013 who paid over half their income for a place to live. “Roughly twice” as many renters now are “cost burdened” compared to 1960, said Harvard. But the numbers just may be about to go up. Millennials -- who are heavily renters -- are taking it on the chin in this rental marketplace, but the group with the worst outlook, per Harvard, is senior citizens. “Today, 30% of elderly renters are paying more than half their incomes on housing,” said Harvard. Particularly hard hit will be women. Said the Harvard researchers: “Older women in particular are increasingly likely to live alone and face severe cost burdens.” The report also noted a steep growth in seniors is forecast: “According to the U.S. Census’s 2014 National Population Projections, the population aged 65 and older is expected to jump to 74 million by 2030, an increase of 33 million in just two decades.” The report grimly predicted: “As the population of older people grows, so will the number of rent-burdened older households.” Why so bleak? Supply-demand equations are in play. Said Harvard: “Vacancy rates have fallen to their lowest level in two decades, and rents have soared.” A reason is that there just is not much construction of affordable housing. The other reason: “Over the last decade, the share of renter households in the United States has increased significantly as homeownership rates have fallen from a high of 69.2% in the second quarter of 2004 to 63.4% in the second quarter of 2015, the lowest level since 1967,\" said the Harvard report. \"We are now seeing more renters than at any other time in U.S. history.” As rents have gone up, Social Security has stagnated. Do the math. The average Social Security benefit now is $1,328. For a couple it is $2,176. For a single paying half of his/her income that caps rent at $664. For a couple, $1,088. Not that much is available in many cities at either level. Worse: seniors have been flocking to rentals. There is no end in sight to the misery ahead for seniors on fixed incomes as they are caught in a perfect storm of constrained supplies of affordable apartments, rising rents and their own income stagnation . “With fixed incomes, retirees can certainly be the hardest hit when it comes to rent increases,\" said Brian Coyne, head of sales and industry relations at apartment rental site Zumper. \"Rent increases statistically keep up with inflation at the least, so rents will always be increasing.“ 1", "external_links": [], "published": "2015-10-13T15:50:00.000+03:00", "crawled": "2015-10-13T16:18:34.350+03:00", "highlightTitle": ""}