{"organizations": ["INEC"], "uuid": "90e52ee43cb830cd7a5dc45fd57ca6b2cf686f49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510050036.html", "country": "US", "title": "Nigeria: Jega - Technology Will Enhance INEC's Credibility", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Jega - Technology Will Enhance INEC's Credibility", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:48:00.000+03:00", "replies_count": 0, "uuid": "90e52ee43cb830cd7a5dc45fd57ca6b2cf686f49"}, "author": "", "url": "http://allafrica.com/stories/201510050036.html", "ord_in_thread": 0, "title": "Nigeria: Jega - Technology Will Enhance INEC's Credibility", "locations": ["Nigeria", "Abuja"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jega", "Ademola Adebayo"], "text": "Nigeria: Multiple Blasts Rock Abuja, 14 Feared Dead, 32 Injured By Ademola Adebayo \nFormer Chairman, Independent National Electoral Commission (INEC), Professor Attahiru Jega, has expressed optimism that increasing use and mastery of technology by the commission would enhance the transparency and credibility of Nigerian elections. \nA statement by Kayode Idowu Chief Press Secretary to the former INEC Chairman quoted him as saying this when he spoke in Washington, United States, where he was given the 2015 Charles T. Manatt Democracy Award by the International Foundation for Electoral Systems (IFES). \nThe former INEC Chair according to the statement noted that credit for the success of Nigeria's elections was not his alone but also his colleagues in the Commission, the different stakeholder groups and international partners, and especially the generality of Nigerian citizens. \nHe said: \"I am humbled to be receiving the 2015 Democracy award, and will also like to recognise my colleagues at INEC for their dedication to a credible and transparent electoral process. Since I assumed the chairmanship of INEC in 2010, we worked hard to make the commission an Election Management Body (EMB) characterised by professionalism and integrity. From the beginning, our mission was not to just improve INEC, but to make it one of the most effective EMBs in the world.\" \nHe urged the international community to stay alert on the Nigerian electoral process, saying: \"consolidating and deepening democracy in countries like Nigeria with a long history of authoritarian rule requires a collective and collaborative endeavour among domestic and international stakeholders.\" \nAccording to the statement, the ceremony was the sixth of the annual award whereby IFES singles out a U. S. Democrat, a Republican and an International Awardee to be honoured for contributions to global growth of democracy. Nigeria \nWhy their names are being sent to the Senate in batches President will give ministers targets He used the last four … see more » Copyright © 2015 Daily Trust. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-05T08:48:00.000+03:00", "crawled": "2015-10-05T09:12:24.285+03:00", "highlightTitle": ""}