{"organizations": [], "uuid": "49e6ac61c14a307fb41ba89f4639f8b439e7567d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/EN-AB381_MENgit_G_20151013181956.jpg", "site_section": "http://www.wsj.com/public/page/news-personal-finance.html", "section_title": "Personal Finance &amp; Money - Planning, Budgeting, Investment, Services, News - Wsj.com", "url": "http://www.wsj.com/articles/the-importance-of-having-friends-for-older-guys-1445220135", "country": "", "title": "The Importance of Having Friends (for Older Guys)", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "The Importance of Having Friends (for Older Guys) - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T06:02:00.000+03:00", "replies_count": 0, "uuid": "49e6ac61c14a307fb41ba89f4639f8b439e7567d"}, "author": "Julie Halpert", "url": "http://www.wsj.com/articles/the-importance-of-having-friends-for-older-guys-1445220135", "ord_in_thread": 0, "title": "The Importance of Having Friends (for Older Guys)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Larry Gitman, age 68, regularly takes trips with Pacific Atlantic Cycling Tours, based in Sharon, Wis. The attraction, he says, is not the rides so much as the friendships. Through the rides, Mr. Gitman has befriended nearly a dozen men who gather annually at a Pacific Atlantic training center in Arizona.\n“The shared experience athletically, socially and aesthetically—plus sharing the pain of long climbs—tends to create a bond,” says Mr. Gitman, an emeritus professor of finance living in La Jolla, Calif. “The more you ride with the same riders, the stronger the bond becomes.”\nThe problem is as old as the idea of retirement itself: Men lose friends as they age, and have difficulties making new ones. While women often develop robust social networks, men usually rely on work for social interaction, an outlet that disappears when they leave the office.\nPals wanted There are signs, however, that older men are breaking new ground. Increasing numbers of men over 50—through travel groups, fitness clubs, community-service programs, Web-based organizations and other outlets—are seeking, well, pals. And the deeper the connection, the better.\nJournal Report Insights from The Experts Read more at WSJ.com/Encore More in Encore: The New Retirement To Age Better, Avoid Stereotypes About Aging Keep Your Bonds Safe When Is Fainting Serious? Stay ‘Fast After 50’ Boost Your Brain Power “Boomers are not just looking for relationships; they’re looking for members of their tribe,” friends who share values and experiences, says Brent Green, a marketer and author of a book about baby boomers’ reinventing themselves.\nAnd the benefits are more than social. Indeed, a growing body of research links friendship with good health in later life. “Study after study shows [an active social life] correlates with getting sick less,” says Terry Real, a family therapist and author in Arlington, Mass.\nA 2010 survey by AARP, the Washington advocacy group, found that a perceived lack of social support and a shrinking network of friends were associated with loneliness, which, in turn, was tied to poor health. Those who rated their health as excellent were less than half as likely to be lonely as men who rated their health as poor (25% vs. 55%).\nA survey in 2011 that asked people if they were happy with their decision to retire found that, on average, retired men and women had one-third fewer friends and spent about half as much time in the company of friends as people who still worked. The survey was conducted by Marketing Analysts Inc., a market-research firm in Charleston, S.C.\nRob Pascale, an author and co-designer of the study, says part of the issue for men appears to be that they are socially conditioned to be more competitive and independent than women, who tend to be taught from an early age to develop close connections. Men are also more tied to their jobs, Mr. Pascale says, so they “are more likely to feel out of place when they first retire, because the primary way they defined themselves is gone.”\nWhile social isolation can be an issue for all retirees, Mr. Real, the Massachusetts therapist, adds that men in particular “have fewer friends with each passing year after 50.”\nThat was the case with Tron Jordheim in Columbia, Mo. The 56-year-old marketing executive was finding it tougher to make friends as he aged. Almost everything else in his life—his career, supporting his children, looking after his parents, trying to keep his love life alive with his partner—took priority.\n“Sometimes the idea of hanging out with friends seems to be a luxury that we cannot afford,” Mr. Jordheim says.\nBut recognizing a need for male friends, and a life outside of work and family, he joined a Rotary club, where the majority of men are over 50.\n“Working together on fundraising and community-service programs gives an excuse to be together,” says Mr. Jordheim, who adds that he has met many interesting people he otherwise wouldn’t have known.\nHarry Adler, 57, and Larry Pepper, 55, say more men their age are asking to join the Minneapolis men’s book club they belong to. The group now has 20 members.\n“This was a way to have social time but serious conversation,” says Mr. Adler, an education consultant. Each month, the host picks the next book. One rule: It can’t be a book that a wife recommended.\n“We talk about the books, but we have meaningful conversations that are tangents relating to our own lives,” says Mr. Pepper. When one man’s teenage child died, the club became a support network. Members took turns cooking meals for his family. “We’ve been there for each other,” Mr. Adler says.\nWeb enabled The Internet is helping older men who want to connect. John Boese says he co-founded GoFindFriends.com in January to help 20-somethings in New York City make friends. After getting more than 500 emails from men 50 and older wanting to participate, Mr. Boese says, he plans to expand the site for that demographic next.\nMike Balistreri, a San Jose, Calif., business owner, says he used Meetup, a site that helps people form local groups, to organize the Dribblin’ Geezers, a bunch of men mostly in their 50s who play basketball and socialize twice a week in San Jose. The group sports some 200 members, many of whom hadn’t been on the court for 10 years, says the 54-year-old.\n“Our motto is ‘Exercise without injury,’ ” he says. “It’s common for us to sit around after we play…talking about our kids or health issues, which men don’t do very often.”\nRe-enactors unite John Golder of Port Washington, N.Y., says some of his closest friends are men he has gotten to know since joining a group of World War II re-enactors for the British army’s Argyll and Sutherland Highlanders. He found the group online while exploring his Scottish family history, he says.\nMost of the men are in their 50s and older, partly because of the investment required: upward of $2,000 to purchase the uniforms, period weapons and other gear. The 54-year-old Mr. Golder says the group attends re-enactments and other events in Pennsylvania, New Jersey, Ohio and Massachusetts.\nWhether sitting in a foxhole firing semiautomatic weapons (loaded with blanks) or dressing up in ceremonial uniforms and arguing whether the badges are displayed correctly, it forges a tight connection, Mr. Golder says.\nAs time moves on, Mr. Real, the Massachusetts therapist, says he anticipates that older men will have fewer problems maintaining and creating social ties. The World War II generation, he says, “would never just go meet a bunch of guys they don’t know and go bicycling.” But millennials, who tend to place a high value on quality of life, he says, are likely to develop more meaningful relationships as they age.\nSays Mr. Real, “The atrophy of men’s friendships over 50 could change.”\nMs. Halpert is a writer in Ann Arbor, Mich. She can be reached at reports@wsj.com .", "external_links": [], "published": "2015-10-19T06:02:00.000+03:00", "crawled": "2015-10-19T06:24:18.807+03:00", "highlightTitle": ""}