{"organizations": [], "uuid": "74cbc7ebd5e0a5a018303169cbd877e41fd678ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/a496a6a367e876dd0db4f11b6a327044", "site_section": "http://www.news.com.au/finance/small-business", "section_title": "Small Business | Finance &amp; Small Businesses | News.com.au", "url": "http://www.news.com.au/finance/small-business/small-business-and-commerce-can-show-new-government-how-to-turn-around-the-national-economy/story-fn9evb64-1227537471533", "country": "AU", "title": "Ditch the rhetoric and enact reforms", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Ditch the rhetoric and enact reforms", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T01:23:00.000+03:00", "replies_count": 0, "uuid": "74cbc7ebd5e0a5a018303169cbd877e41fd678ac"}, "author": "Ross Greenwood", "url": "http://www.news.com.au/finance/small-business/small-business-and-commerce-can-show-new-government-how-to-turn-around-the-national-economy/story-fn9evb64-1227537471533", "ord_in_thread": 0, "title": "Ditch the rhetoric and enact reforms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Financial expert Ross Greenwood.\nRoss Greenwood The Daily Telegraph POLITICAL change sees a new prime minister, treasurer, small business minister and a new minister for innovation and science.\nEach is vital to the small and medium-sized business sector — the engine room of economic growth in Australia, and employment.\nAustralia’s economic growth rate of 2 per cent a year is insufficient to generate the profits and jobs for local companies to invest and grow. And although the economy is in transition from a resource construction phase to … well, that’s the problem the Abbott government struggled with: transition to what?\nPLAY TO STRENGTHS\nThe onus is now on Treasurer Scott Morrison, Small Business Minister Kelly O’Dwyer and Innovation Minister Christopher Pyne to articulate our nation’s strengths and opportunities, and to translate it into workable policy.\nThe self-titled 21st-century government needs to address key issues that have been talked about but not enacted in the past: industrial relations, taxes and capital availability. Each of these are areas where Australia loses competitiveness against our regional neighbours and the world.\nIf maximum advantage is to be gained from the Free Trade Agreements — as well as low interest rates and the low dollar — then these other impediments need to be addressed.\nChange, even political change, is nothing to be afraid of, if it delivers the genuine ­reform the nation needs. Australian businesses are already changing and adapting to a new world of high-speed communications, flexibility in the workplace and the rapid movement of money around Australia and the world.\nIt is government systems and Australia’s tax laws that have been slow to keep pace.\nSUCCESS STORIES\nThrough this column, for almost 18 months, we have shown there are plenty of small businesses that have adapted to the difficult, changing environment and that have succeeded. They all have issues — that is the nature of business — but most of the 70-plus companies we have profiled have found ways to prosper.\nSmall business is always the riskiest of endeavours. But the rewards to the entrepreneur — and the country as a whole — are immense if it succeeds.\nThe more small businesses that do succeed (and which ­remain based in Australia) the greater prosperity and job ­opportunity the whole community will enjoy in this post-mining boom era. It must be nurtured, encouraged and celebrated by government at the highest levels.\nSo I say to those government ministers I named: there is no harm in looking at many of the companies we have profiled here for guidance on creating a narrative for future growth in Australia’s economy.\nIt is in these small and ­medium-sized businesses that the future lies, if only government will listen … then act.\nBUSINESS BUILT BRICK BY BRICK\nRyan Steyn of Empower Construction / Picture: Peter Kelly Source: News Limited\nRYAN Steyn was in trouble at school and his parents had had enough.\nSo they sent him packing. For a Year 11 student, being sent “home” — to a boarding school in South Africa — was one hell of a wake-up call. It might also have been the making of his business, Empower Constructions.\nRyan learnt that his life in Australia was far better than in South Africa.\nOn his return, he began a personal training business. To fund it, he worked for his father’s waterproofing company and then with some subcontractors. He was working with the lightweight building material Hebel bricks.\nThen another important business lesson occurred that shaped his future.\nRyan stopped being paid by a contractor. The subcontractor builder said to him: “I will pay you directly to finish the job.”\nHowever, the unfairness of the situation hit home.\n“The penny dropped,” he says. “I could see there were some people with integrity, but others had none.”\nSo he started Empower Construction with the aim to supply and install Hebel brickwork to building sites. The first job he got was at Normanhurst Girls’ High School. For someone just starting it was a massive job.\n“I arrived at the supply yard and there were five or six big trucks loading this stuff up. We had a tiny van — doing it two packs at a time,” Ryan says.\nBut from that humble beginning, Empower — in conjunction with CSR, which makes the Hebel building material — became the biggest supplier in Sydney.\nEight years later, Ryan looks on with pride at that same supply yard and says: “There were four trucks being loaded up there the other day — and they were all my trucks.”", "external_links": ["http://cdn.newsapi.com.au/image/v1/a496a6a367e876dd0db4f11b6a327044", "http://widgets.outbrain.com/outbrain.js", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/6ae08f9e5b77c61f99af58bd4af124c5", "http://www.dailytelegraph.com.au/"], "published": "2015-09-22T01:23:00.000+03:00", "crawled": "2015-10-20T12:49:22.501+03:00", "highlightTitle": ""}