{"organizations": [], "uuid": "fa6c9bb35c3f9885d5a75c4289152c1529d240b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/news-herald/rss/627", "section_title": "The News Herald    : Personal Finance", "url": "http://business-news.thestreet.com/news-herald/story/10-hot-luxury-cars-with-econobox-mileage/13311923", "country": "US", "title": "10 Hot Luxury Cars With Econobox Mileage", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "10 Hot Luxury Cars With Econobox Mileage", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:43:00.000+03:00", "replies_count": 0, "uuid": "fa6c9bb35c3f9885d5a75c4289152c1529d240b9"}, "author": "", "url": "http://business-news.thestreet.com/news-herald/story/10-hot-luxury-cars-with-econobox-mileage/13311923", "ord_in_thread": 0, "title": "10 Hot Luxury Cars With Econobox Mileage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Notte"], "text": "10 Hot Luxury Cars With Econobox Mileage Written by: Jason Notte 10/05/15 - 9:43 AM EDT \nNEW YORK ( MainStreet ) – Luxury and efficiency once existed on polar opposite ends of the automotive spectrum. Now, their fates are as entwined as the spaghetti-bowl lanes of an interstate interchange. \nA luxury car likely isn't the surest sign that a driver cares about meeting the Environmental Protection Agency's goal of a fleet's combined 54.5 miles per gallon by 2025. The University of Michigan Transportation Research Institute found that cars and light trucks purchased in 2014 got an average of 25.4 miles to the gallon, and luxury vehicles tend to have mileage well south of that figure. Of the more than 220 vehicles identified as luxury sedans by the EPA between the 2015 and 2016 model years, roughly two dozen manage more than 25 miles per gallon combined. \nHigh-end luxury vehicles including the Bentley Mulsanne (just 13 miles per gallon combined), the Rolls Royce Phantom (14 mpg), the Mercedes-Benz Maybach S600 (15 mpg) and BMW 760Li (15 mpg) aren't helping. However, even somewhat less-swank options like the Mercedes-Benz CLS500 (24 mpg) and BMW 328i (26 mpg) aren't all that thrifty with their fuel. More Headlines Obamacare Mistakes: Consumers Continue to Make Errors in Choosing Benefits \nThis isn't great news for luxury automakers, who've seen sales slump 1.8% year-to-date, according to MotorIntelligence. While cost is always going to keep the luxury sector's 747,000 cars sold through August a small percentage of the 5.3 million cars sold in the U.S. during that timeframe, changing consumer patterns are having an impact on sales. \nThrough August, Jaguar, Maserati and Bentley have all seen sales decline by roughly 4% apiece. Audi's total sales are up 12% so far, but car sales are near flat at a 0.5% uptick. Mercedes-Benz, meanwhile, has seen sales climb 8%, though its cars have only received a 1.1% boost. In fact, BMW's 7.1% boost in car sales is an anomaly in its class, with only Tesla's 6.1% gain coming anywhere close. \nThe luxury sedan is changing, and some automakers are far more prepared for it than others. With help from the EPA's FuelEconomy.gov site, we compiled a list of the most fuel-efficient luxury sedans on the market. The BMW i3 didn't make the cut because, well, it's tiny and not really a sedan, but its electric efficiency would still put it well ahead of most of the cars on this list: 1", "external_links": [], "published": "2015-10-05T16:43:00.000+03:00", "crawled": "2015-10-05T18:27:47.727+03:00", "highlightTitle": ""}