{"organizations": [], "uuid": "0e8d4df7567c9f31738ddded0100fb8ac923bc54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/heart-1.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/be-positive-to-keep-heart-disease-at-bay/43583.html", "country": "IN", "title": "Be positive to keep heart disease at bay", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Be positive to keep heart disease at bay", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T16:23:00.000+03:00", "replies_count": 0, "uuid": "0e8d4df7567c9f31738ddded0100fb8ac923bc54"}, "author": "IANS", "url": "http://www.moneylife.in/article/be-positive-to-keep-heart-disease-at-bay/43583.html", "ord_in_thread": 0, "title": "Be positive to keep heart disease at bay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Be positive to keep heart disease at bay 43583 Be positive to keep heart disease at bay 0 Comments, Be the first to comment + COMMENT IANS | 06/10/2015 06:53 PM | People with a positive psychological state such as those who are enthusiastic or interested are likely to develop long-term healthy habits that are important for lowering the risk of heart disease, says a new study. Over the course of five years, researchers tracked more than 1,000 patients with coronary heart disease. The researchers found that patients who reported higher positive psychological states were more likely to be physically active, sleep better and take their heart medications and were also less likely to smoke, compared to patients with lower levels of positive states. \"Negative emotions and depression are known to have harmful effects on health, but it is less clear how positive emotions might be health-protective,\" said Nancy Sin, postdoctoral fellow at Pennsylvania State University in the US. \"We found that positive emotions are associated with a range of long-term health habits, which are important for reducing the risk of future heart problems and death,\" Sin noted. The researchers assessed psychological well-being of participants at baseline and again at a five-year follow-up by asking the participants to rate the extent that they had felt 10 specified positive emotions, including \"interested\", \"proud\", \"enthusiastic\" and \"inspired\". Physical activity, sleep quality, medication adherence and alcohol and cigarette use were also measured at baseline and again five years later. Higher levels of positive emotions were associated with less smoking, greater physical activity, better sleep quality and more adherence to medications at baseline, the study found. They found no correlation between positive emotions and alcohol use. \"Efforts to sustain or enhance positive emotions may be promising for promoting better health behaviours,\" the study said. The findings appeared in the journal Psychosomatic Medicine. Disclaimer: Information, facts or opinions expressed in this news article are presented as sourced from IANS and do not reflect views of Moneylife and hence Moneylife is not responsible or liable for the same. As a source and news provider, IANS is responsible for accuracy, completeness, suitability and validity of any information in this article. More in Moneylife", "external_links": [], "published": "2015-10-06T16:23:00.000+03:00", "crawled": "2015-10-06T17:50:11.370+03:00", "highlightTitle": ""}