{"organizations": [], "uuid": "1874fdcc9c8f6d303484191761c89a8fa854d0f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/technology-environment-earS.jpg", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/economy/govt-extends-validity-of-environment-clearance-to-7-yrs/153603", "country": "IE", "title": "Govt extends validity of environment clearance to 7 yrs", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Govt extends validity of environment clearance to 7 yrs | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:53:00.000+03:00", "replies_count": 0, "uuid": "1874fdcc9c8f6d303484191761c89a8fa854d0f9"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/govt-extends-validity-of-environment-clearance-to-7-yrs/153603", "ord_in_thread": 0, "title": "Govt extends validity of environment clearance to 7 yrs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles White House enlists companies in climate push Govt to tap Rs 10k cr idle funds for BPL age, health cover ONGC-Cairn jointly utilise gas facilities Government has extended the validity of environment clearance (EC) from five years to seven years, a senior Environment Ministry official said.\n“We have notified the extension of the validity of EC from five years to seven years. The EC can be renewed for a maximum period of three years,” the official told PTI.\nFor extension of EC, an application should be filed before the regulatory authority within the validity period. The regulatory authority may also consult the Expert Appraisal Committee (EAC) or State Level Expert Appraisal Committee (SEAC), as the case may be, for grant of such extension.\nAccording to the gazette notification, if the application filed within one month after the validity of EC, such cases should be referred to concerned EAC or SEAC. Based on their recommendation, the delay should be condoned at the level of the Joint Secretary in the Union Environment Ministry.\nIf the application has been filed more than one month after the validity period of EC but less than three months after such validity period, then, based on the recommendations of the EAC or SEAC, the delay should be condoned with the approval of the Minister in charge of Environment, Forest and Climate Change, or Chairman, as the case may be, it said.\n“No condonation for delay shall be granted for any application for extension filed 90 days after the validity period of EC,” the notification added.\nIt is mandatory to take environment clearance for execution of both ‘A’ and ‘B’ category projects in the country. The EC is granted after carefully assessing the environment impact of a project and taking into account the environment management plan.\n 19, 2015 4:53 pm", "external_links": [], "published": "2015-10-20T00:53:00.000+03:00", "crawled": "2015-10-20T00:36:19.431+03:00", "highlightTitle": ""}