{"organizations": [], "uuid": "7128cc5ecb93caad4d75061de4cddfac8f51943c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03285/Let-signs-use_3285613k.jpg", "site_section": "http://www.telegraph.co.uk/newsfeed/rss/money_city.xml", "section_title": "Finance - Business news and market updates - Telegraph", "url": "http://www.telegraph.co.uk/finance/property/11918909/Essex-and-Hertfordshire-named-top-buy-to-let-hotspots.html", "country": "CH", "title": "Essex and Hertfordshire named top buy-to-let hotspots", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Essex and Hertfordshire named top buy-to-let hotspots", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T07:15:00.000+03:00", "replies_count": 0, "uuid": "7128cc5ecb93caad4d75061de4cddfac8f51943c"}, "author": "Elizabeth Anderson", "url": "http://www.telegraph.co.uk/finance/property/11918909/Essex-and-Hertfordshire-named-top-buy-to-let-hotspots.html", "ord_in_thread": 0, "title": "Essex and Hertfordshire named top buy-to-let hotspots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nLandlords in the east of England are enjoying the largest returns on property, as the high cost of buying in London outweighs the amount new investors are making from rental yields in the capital. \nHalstead, Borehamwood and Brentwood are the places benefiting most from strong rental and house price growth over the past year, according to Rightmove. \nThe property website recorded average house price growth over the past year, as well as the average rent a landlord would have collected in that time. Using this data, Rightmove then ranked the towns and villages offering lucrative gains for buy-to-let investors. \nPlaces in Essex and Hertfordshire make up seven of the top 10 investor hotspots, with Cottingham in Yorkshire the only Northern town to make the list. \nBuy-to-let investors in Halstead, Essex, have achieved rental yields of 26.3pc in the past year, on average. This compares with just 13.8pc in London. \nAnnual rental yield in the east of England has raced ahead of other regions, with rents rising 6.4pc last year, compared with 4.5pc nationally outside London. \n\"Investors and tenants who have been priced out of London and the South East have looked for better value areas in the East, and it seems they’ve found a winning formula. If you look at the top 10, six of the areas have asking prices below the national average, making it affordable for buy-to-let investors and tenants,\" said Sam Mitchell, head of lettings at Rightmove. \nIn top-ranked Halstead, in Essex, the average asking price was £181,695 over the three months to September, up 21pc from £150,078 in the same period last year. \nThe small town in the Braintree district of Essex has attracted people looking for a village lifestyle within commuting distance to London. A typical two-bedroom house costs around £180,000. \nHalsted in North Essex has a population of just over 11,000 Photo: Alamy \nOver the year, landlords in Halstead would have collected £7,837 in rent, on average. \nAdding this amount to the property's capital price growth, and dividing the total by the house price a year ago, gives a rental yield of 26.3pc - making the area the most lucrative buy-to-let spot in the country, the data suggest. \n“During the past year we have seen an increase in the number of buy-to-let properties being purchased in our area as property prices are a little lower compared to our neighbouring market town of Braintree, situated directly to the south. The demand is extremely high and tenants are renting most properties within just a few days,\" said Kevin Mixture, of Scott Maddison Estate Agents, in Halstead. \nRanked second in the top 10 buy-to-let hotspots, Borehamwood in Hertfordshire attracts typical rents of £13,691 a year. Compared with an annual rise of £56,308 for the price of a typical property, there is a 26.1pc return on investment. \nBrentwood, in Essex, comes in at number three with a rental yield of 25.9pc per year. \nThe town has risen in popularity thanks to reality TV show The Only Way Is Essex. Typical annual rents in Brentwood are £12,206 a year, among the highest in the county, and average property prices have risen a fifth over the year to £308,811. \nEssex property prices are relatively affordable compared to the other Home counties Photo: Ashley Dace \nThe town has good transport links, and is just a 30-minute train journey from the City of London. \nHomes in Cottingham, the only Northern town to make Rightmove's top 10, have an average asking price of £150,211. However, attracting rents of £5,936, there is the potential for a 25.7pc return on investment.", "external_links": [], "published": "2015-10-09T07:15:00.000+03:00", "crawled": "2015-10-09T07:52:07.837+03:00", "highlightTitle": ""}