{"organizations": ["Advantage YouTube Has Over Facebook Inc.", "Facebook"], "uuid": "5d8f27f11e679cc191266da6d2734cdc6ac91aaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://g.foolcdn.com/editorial/images/181570/fb-f-logo__blue_144.jpg", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=FB", "section_title": "Yahoo! Finance: FB News", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13as088p6/*http://www.fool.com/investing/general/2015/10/19/1-advantage-youtube-has-over-facebook-inc-in-the-w.aspx", "country": "US", "title": "1 Advantage YouTube Has Over Facebook Inc. in the Web Video War", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "1 Advantage YouTube Has Over Facebook Inc. in the Web Video War", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:00:00.000+03:00", "replies_count": 0, "uuid": "5d8f27f11e679cc191266da6d2734cdc6ac91aaf"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13as088p6/*http://www.fool.com/investing/general/2015/10/19/1-advantage-youtube-has-over-facebook-inc-in-the-w.aspx", "ord_in_thread": 0, "title": "1 Advantage YouTube Has Over Facebook Inc. in the Web Video War", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John-Erik Koslosky"], "text": "1 Advantage YouTube Has Over Facebook Inc. in the Web Video War Facebook continues its push into video, but companies have a good reason to continue using Alphabet's YouTube. John-Erik Koslosky Oct 19, 2015 at 12:00PM Source: YouTube \nAs Facebook ( NASDAQ:FB ) pushes deeper into Web video, making clips a growing part of the news feeds of its nearly 1.5 billion users, Alphabet 's ( NASDAQ:GOOG ) ( NASDAQ:GOOGL ) YouTube has ample reason for concern. After all, Facebook more than a year ago laid claim to serving up more videos to its users than YouTube, and it appears to be picking up steam with the move to mobile. \nBut Alphabet also has at least one big advantage in courting companies to use its platform to reach customers. \nYouTube is a growing part of Alphabet's business. Although the company formerly known as Google has not been breaking out the segment's financials, eMarketer pegged the video service's 2015 revenue at $3.5 billion. \nWhile that would make up less than 5% of Google's total revenue for the year, YouTube has also been growing at twice the rate of the business overall. Source:Facebookbrand.com. \nVideo is going social That should make Facebook's brash and forceful foray into the space a bit unnerving for Alphabet investors. Facebook, after all, has a massive user base. Not only that, but its users spend a lot of time on its platform. Facebook's apps account for one of every five minutes spent on mobile devices, the company has said. \nAnd CEO Mark Zuckerberg sees video as an important piece of Facebook's growth, telling analysts recently that the company is \"entering into a period where [social media is] going to increasingly be primarily video, and we're seeing huge growth there.\" \nSo Facebook's courtship of video advertisers poses a formidable threat to YouTube and any other Web video services out there. \nThe \"ripple effect\" But Alphabet's YouTube platform has at least one distinct advantage over Facebook for companies looking to get their messages out to prospective customers: It's what The Wall Street Journal referred to in a recent article as the \"ripple effect.\" \nCiting research from ad firm Visible Measures, WSJ noted that YouTube users who see a video uploaded to the site by a content provider or advertiser are far more likely to also view other videos uploaded by that particular brand. \nThis gives companies looking to reach prospective customers additional value, since they can count not just on a single view, but on that ripple outward as viewers see more of their content on the platform. \nCalculating a video's shelf life This is something unique to YouTube. Visible Measures dissected the traffic to companies' videos on YouTube and Facebook. It found that views of newly posted YouTube videos made up some 45% of the total views, while 55% of the views were of previously posted videos. \nContrast that to Facebook, where 95% of the total views come from newly posted videos, and just 5% came from older clips. \nThat's a distinct advantage for Google's YouTube. Brands can count on videos that are uploaded there having a long shelf life, as opposed to those on Facebook, which may be rolled out to more viewers initially but have little chance of being seen after that. \nVisible Measures pegged the useful shelf life of a Facebook video at about three days. After that, there's a precipitous drop-off in exposure. \nYouTube, meanwhile, sees views still rolling in weeks and months after a video is first released. For those videos released to different platforms, YouTube accounted for more than half of the views after the first week of release, and nearly two-thirds of the views that come three or more months after release. \nThat's not all she wrote... Facebook is already at work figuring out how it can challenge YouTube on this front. Facebook users may have seen that it is now experimenting with \"suggested videos.\" \nIt still doesn't have the mechanisms in place to pose a significant challenge to YouTube's ripple effect, but Facebook will look for ways to create a ripple effect of its own. \nThe Web video market is both fast-growing and fast-changing. Alphabet investors shouldn't take it as a given that YouTube's advantage will hold up, but for now, YouTube offers brands a distinct advantage over Facebook, and one that should continue to attract companies to its platform. \nThe next billion-dollar iSecret The world's biggest tech company forgot to show you something at its recent event, but a few Wall Street analysts and the Fool didn't miss a beat: There's a small company that's powering their brand-new gadgets and the coming revolution in technology. And we think its stock price has nearly unlimited room to run for early in-the-know investors! To be one of them, just click here . \nJohn-Erik Koslosky owns shares of Alphabet (A shares) and Facebook. The Motley Fool owns shares of and recommends Alphabet (A shares), Alphabet (C shares), and Facebook. Try any of our Foolish newsletter services free for 30 days . We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . Compare Brokers John-Erik Koslosky Staff Writer Fool contributor John-Erik Koslosky has been picking his own stocks since the market crashed in 2008. He aims for a mix of value and growth, but mostly, just looks to buy great businesses. Follow @JE_Koslosky Article Info Oct 19, 2015 at 12:00PM Technology and Telecom", "external_links": [], "published": "2015-10-19T19:00:00.000+03:00", "crawled": "2015-10-20T12:50:20.988+03:00", "highlightTitle": ""}