{"organizations": [], "uuid": "e978eeae7a4b3208d5a2f5abe598b3e427c1cdd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2011/08/11/13034479/Equias Alliance logo.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/10/prweb13034479.htm", "country": "US", "title": "Minnesota Consultant Selects Equias Alliance BOLI and Benefit Advisors", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Minnesota Consultant Selects Equias Alliance BOLI and Benefit Advisors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "e978eeae7a4b3208d5a2f5abe598b3e427c1cdd6"}, "author": "David Shoemaker, CPA/PFS, CFP®", "url": "http://www.prweb.com/releases/2015/10/prweb13034479.htm", "ord_in_thread": 0, "title": "Minnesota Consultant Selects Equias Alliance BOLI and Benefit Advisors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Equias Alliance, LLC is very pleased to announce that Kelly Coughlin, CPA, MBA of Edina, Minnesota has joined the firm as a bank financial risk management Consultant. Kelly brings over 25 years of experience working in the financial services industry. During this time, he has served as a CPA with PricewaterhouseCoopers (PWC); Director of Risk Management for a Minneapolis- and London-based subsidiary of Lloyds Bank; and CEO/Founder of GlobalBridge, a financial technology and investment company providing technology and investment solutions to middle market banks located throughout the US. Kelly began his career in 1983 in financial services offering what was then a unique and leading-edge product, packaged mortgage-backed securities, to banks and credit unions. He then worked in the Manhattan office of PWC (Coopers & Lybrand) on assignments that included the NYSE and the largest internal control review of a financial services company in US history.\nKelly also served as director of risk management under a British bank parent, Lloyds Bank. And then as CEO of GlobalBridge, he worked closely with many of his former clients, most of whom were banks. Recently, as CEO of TheBizGeeks, a management consultant firm, he was introduced by one of his clients to the bank-owned life insurance (BOLI) industry and realized this line of business would allow him to use many of the skills he had acquired over his career in the banking industry.\nAccording to David Shoemaker, President of Equias Alliance, “Kelly Coughlin is a seasoned professional with years of experience in the banking industry. We are very pleased to have someone with his educational and work experience become part of our organization. Kelly is a CPA, has an MBA from Babson College and has over 25 years of experience working with banks and other financial services companies. He will be a welcome addition to Equias Alliance.”\nAbout Equias Alliance\nEquias Alliance delivers nonqualified benefit and BOLI administration and portfolio services to banks across the United States via its team of 20 consultants and 32 support personnel located in 15 regional offices. Equias Alliance offers a near-seamless approach from design to implementation. The Equias Alliance team has helped over 800 banking organizations recruit, retain, and reward executives, directors and employees critical to each bank’s success.\nEquias Alliance can be found on the Internet at http://www.equiasalliance.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5lcXVpYXNhbGxpYW5jZS5jb20="], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T11:13:14.364+03:00", "highlightTitle": ""}