{"organizations": [], "uuid": "078b2475b3942df81848d458a33147809bf0d176", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15224_3344.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/fca-and-pra-set-out-new-rules-on-60680/", "country": "US", "title": "FCA and PRA Set Out New Rules on Whistleblowing.", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "FCA and PRA Set Out New Rules on Whistleblowing.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:59:00.000+03:00", "replies_count": 0, "uuid": "078b2475b3942df81848d458a33147809bf0d176"}, "author": "DLA Piper", "url": "http://www.jdsupra.com/legalnews/fca-and-pra-set-out-new-rules-on-60680/", "ord_in_thread": 0, "title": "FCA and PRA Set Out New Rules on Whistleblowing.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FCA and PRA Set Out New Rules on Whistleblowing. more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=01a847cc-ae27-451c-9c38-68a03f70ef2d\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nThe FCA has published new rules designed to encourage a culture in which individuals raise concerns and challenge poor practice and behaviour. The new regime represent a significant expansion on the scope of the previous rules and guidance on whistleblowing. \nUnder the new regime relevant firms will be required to: Appoint a Senior Manager as their whistleblowers’ champion Adopt internal whistleblowing arrangements able to handle all types of disclosure from all types of persons Tell UK-based employees about the FCA and PRA whistleblowing services, and require appointed representatives and tied agents to tell their UK-based employees about the FCA whistleblowing service Present a report on whistleblowing to the board at least annually Incorporate text in settlement agreements explaining that workers have a legal right to whistleblow, and Inform the FCA if it loses an employment tribunal with a whistleblower. \nRequirement to appoint a whistleblowers’ champion in force from 7 March 2016, remaining requirements in force from 7 September 2016. \nBackground \nFollowing recommendations in 2013 from the Parliamentary Commission on Banking Standards that banks should (1) put in place mechanisms to allow employees to raise concerns internally; and (2) appoint a senior person to take responsibility for the effectiveness of these arrangements, the FCA launched a consultation in February 2015 on the proposed rules of a new whistleblowing regime. This is against a backdrop of a significant increase in the number of whistleblowing reports being received by the FCA; there were 1,340 whistleblowing disclosures in financial year 2014/15 as compared to 1,040 in 2013/14, representing a yearly increase of 28%. The FCA published the new rules on 6 October 2015. \nWho does the new regime apply to? \nThe new regime will apply to: UK deposit-takers with assets of £250m or greater (including banks, building societies and credit unions) PRA-designated investment firms, and Insurance and reinsurance firms within the scope of Solvency II, the Society of Lloyd’s and managing agents. (collectively 'Relevant Firms'). \nThe new regime will also act as non-binding guidance for all other firms regulated by the FCA. The new rules do not apply to UK branches of overseas banks, although the FCA has noted they will explore this possible extension in future consultations. The FCA has further noted that once sufficient time has passed to allow the effectiveness of the new rules to be analysed, they will consider whether the rules should be applied more broadly to other regulated firms such as stockbrokers, mortgage brokers, insurance brokers, investment firms and consumer credit firms. \nWhat are the new requirements? \nThe new rules introduce a number of requirements which Relevant Firms will need to adopt. The following provides an overview of some of the key requirements. \nRequirement to appoint a whistleblowers' champion \nRelevant Firms must appoint a whistleblowers' champion, though this specific title need not be used. This function should be fulfilled by someone who is a non-executive director, although if a Relevant Firm's governance structure does not include such a position there is no requirement to create such a post. The appointed person must be subject to the Senior Managers Regime or the Senior Insurance Managers Regime (ie a director or senior manager of an insurance firm). \nThe whistleblowers' champion will have responsibility for \"ensuring and overseeing the integrity, independence and effectiveness\" of the Relevant Firm's policies and procedures on whistleblowing. The whistleblowers' champion should have access to independent legal advice and training, along with sufficient information to carry out their responsibilities. However, they do not need to have a day-to-day operational role handling disclosures from whistleblowers (save that if they are contacted directly by a whistleblower they will need to determine an appropriate course of action), and need not be based in the UK if they can perform their function effectively from elsewhere. \nRequirement to adopt suitable whistleblowing arrangements \nRelevant Firms must adopt procedures to enable them to handle all types of whistleblowing disclosure (including anonymous disclosures), from all types of whistleblower (including, for example customers and employees). Whilst these procedures must be promoted to, amongst others, UK-based employees, there is no expectation that these arrangements will be promoted to anyone else, for example members of the general public. These procedures must ensure the effective assessment and escalation of disclosures, and whilst not all disclosures will result in investigative action, the consideration given to each disclosure should be properly recorded. The Relevant Firm's procedures for dealing with whistleblowing must be available in writing to UK-based employees, and appropriate training should be provided for UK-based employees, managers of UK-based employees, and employees responsible for operating the firm's internal arrangements. \nImportantly, the new rules do not place any regulatory duty on a Relevant Firm's staff to whistleblow, as respondents to the February 2015 consultation feared that this could put a whistleblower who feared reprisals in a difficult position. This concern is perhaps interesting given the protection that exist in legislation to prevent reprisals against employees who whistleblow. \nRequirement to notify individuals about the FCA and PRA whistleblowing services \nUK-based employees of Relevant Firms must be notified about the FCA and PRA whistleblowing services. This does not prevent those firms from encouraging employees to use internal whistleblowing procedures first, though they must make employees aware that there is no requirement to use the firm's internal processes in the first instance. \nRelevant Firms must also ensure that their appointed representatives and tied agents inform their UK-based employees about the FCA whistleblowing services. There is not however any requirement for the Relevant Firm's own whistleblowing procedures to be promoted to employees of its appointed representatives or tied agents. \nRequirement to prepare an annual report \nRelevant Firms must prepare a report, at least annually, for the board, which is available to the FCA and PRA on request, but which need not be made public. The whistleblowers' champion need not prepare the report, but should oversee its preparation. There is no specific guidance on the content of the report, meaning firms are free to prepare this as they see fit. \nRequirements concerning settlements with employees at employment tribunals \nRelevant Firms must include text in any settlement agreements with employees explaining the employee's legal rights. Settlement agreements must expressly state that employees may make protected disclosures if they wish, and suitable sample wording is provided in the rules. The rules further require that settlement agreements must not include any warranties by employees that they do not know any information that could form the basis of a protected disclosure, or require them to state whether or not they have made a protected disclosure. Relevant firms have discretion as to whether or not these provisions are included in employment contracts, and whether or not they request employment agencies include this text in settlement agreements entered into with workers. \nFurthermore where an employment tribunal finds that a whistleblower has suffered detriment or been unfairly dismissed as the result of making a protected disclosure, the Relevant Firm must notify the FCA of this outcome. \nTimeline \nRelevant firms have until 7 September 2016 to comply with the new rules, although the requirement to appoint a whistleblowers’ champion will take effect on 7 March 2016, the same date as the rest of the Senior Managers Regime. In the interim period the whistleblowers’ champion will be responsible for overseeing the steps their firm takes to prepare for and implement the new regime. \nConclusion \nThe FCA recognises that a substantial number of firms to whom the new regime will apply already have a strong framework in place to facilitate whistleblowing by employees, and ensure employees who decide to whistleblow are suitably protected against reprisals. Nonetheless the new regime will require Relevant Firms to consider, adjust and implement suitable policies as necessary, against a fairly tight deadline. Given that firms are already preparing for a number of new legislative regimes (the Senior Managers Regime, Solvency II, the Fourth Money Laundering Directive etc.) the timing of these new rules may not be entirely welcome. Relevant Firms should take swift action to ensure that they are ready for the new regime by 7 September 2016.", "external_links": [], "published": "2015-10-13T00:59:00.000+03:00", "crawled": "2015-10-13T01:12:26.159+03:00", "highlightTitle": ""}