{"organizations": [], "uuid": "1f1f66da31dc73efffd44745f48fa130818941b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2014/09/03/13003936/wincor.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/10/prweb13003936.htm", "country": "US", "title": "Wincor Nixdorf Names Stan Holcomb VP and GM Software and Services in North America", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Wincor Nixdorf Names Stan Holcomb VP and GM Software and Services in North America", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "1f1f66da31dc73efffd44745f48fa130818941b5"}, "author": "Angela Dejene", "url": "http://www.prweb.com/releases/2015/10/prweb13003936.htm", "ord_in_thread": 0, "title": "Wincor Nixdorf Names Stan Holcomb VP and GM Software and Services in North America", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wincor Nixdorf, a leading provider of comprehensive IT solutions in banking and retail, today named Stan Holcomb Vice President and General Manager of Software, Professional Services and Services, in North America, extending is current role of VP of Services. Prior to joining Wincor Nixdorf, Holcomb served as Vice President of the Global Services Group at Mitel, a unified communications solutions provider. “Stan’s leadership and expertise provides the vision and forward-thinking we need in today’s evolving marketplace,” said Wincor Nixdorf USA President & CEO Javier López Bartolomé. “Stan will be tremendous asset to our team as we continue to build on our clients’ success.”\nKnown for its best-in-class software and technological edge in hardware for the banking and retail industry, Wincor Nixdorf continues to stay ahead of the curve, demonstrated by new innovations and market growth in North America. Nearly 35,000 ATMs in North America utilize transformation, security or multivendor software components from Wincor Nixdorf, and over 150 000 devices are serviced by Wincor Nixdorf in the region.\nWincor Nixdorf leads the market as the number one multivendor software solutions provider in North America, offering software solutions that meet customers’ diverse needs including updating and integrating software for IT landscapes and optimizing IT and customer business processes at banks and retail chain stores.\n“Stan has extensive experience growing both Software and Professional Services businesses at Alcatel-Lucent, Avaya and Mitel Networks,” said Edward McGrath, Director Human Resources at Wincor North America. “His breadth of experience and industry knowledge supports the Wincor Nixdorf vision and our ability to navigate the challenges of today’s rapidly changing marketplace.”\nWincor Nixdorf’s powerful service capabilities follow their advanced banking and retail technology into the field. In the last year, the company dramatically increased the worldwide reach and coverage of its service team, including those who are not only trained to service Wincor Nixdorf products, but can also service multi-vendor platforms. Wincor Nixdorf’s customer-centric approach to services ensures the success of its customers and reaffirms its commitment to the North American banking and retail market.\n###\nAbout Wincor Nixdorf:\nWincor Nixdorf is one of the world’s most successful IT solution specialists for process optimization at the consumer touch-point, covering its core industries of banking and retail. With its U.S. headquarters located in Austin, Texas, Wincor Nixdorf Inc. provides a broad range of innovative hardware and software solutions, complemented by high-end services to many of the world’s biggest and most well-known business organizations, raising the overall efficiency of procedures and workflow to improve consumer engagement and reduce operational costs. Wincor Nixdorf has a presence in more than 130 countries and annual sales revenue of approximately $3 billion. For more information, visit http://www.wincor-nixdorf.com/usa .", "external_links": ["http://www.wincor-nixdorf.com/usa", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy53aW5jb3Itbml4ZG9yZi5jb20vdXNh"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T02:04:00.995+03:00", "highlightTitle": ""}