{"organizations": [], "uuid": "ee4f4b172a25cc48a598a35ecdc32437ccc3529c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l.yimg.com/bt/api/res/1.2/tpO3.Y6tikIm9tHfL1MghQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-14T150917Z_3_LYNXNPEB9D0NJ_RTROPTP_3_SKODA-OUTLOOK_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/vws-vahland-quits-due-differences-122631580.html?l=1", "country": "GB", "title": "VW veteran lined up to be North America boss quits", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "VW veteran lined up to be North America boss quits - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee4f4b172a25cc48a598a35ecdc32437ccc3529c"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/vws-vahland-quits-due-differences-122631580.html?l=1", "ord_in_thread": 0, "title": "VW veteran lined up to be North America boss quits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nWinfried Vahland in Mlada Boleslav March 20, 2013. REUTERS/David W Cerny By Jan Schwartz and Andreas Cremer\nHAMBURG/BERLIN (Reuters) - The man Volkswagen (VOWG_p.DE) lined up less than three weeks ago to head its North American business resigned on Wednesday, dealing a blow to the German carmaker's efforts to recover from a scandal over its rigging of U.S. diesel emissions tests.\nNews of the resignation of company veteran Winfried Vahland came as Germany's Spiegel magazine reported that at least 30 Volkswagen managers were involved in the test cheating. VW said the figure was without any basis. \nLast week, the head of Volkswagen's U.S. business, Michael Horn, said he thought only \"a couple of software engineers\" were responsible.\n\"Vahland was a good manager,\" said London-based analyst Arndt Ellinghorst at banking advisory firm Evercore ISI. \"VW is facing massive challenges and a completely new start.\"\nVW, Europe's largest carmaker, is in crisis after admitting last month it installed software in diesel vehicles to deceive U.S. regulators about their true level of toxic emissions.\nThe U.S. Federal Trade Commission, which probes companies accused of deceptive advertising, said on Wednesday it had the joined Justice Department and Environmental Protection Agency in investigating Volkswagen.\nThe scandal has wiped out a quarter off Volkswagen's market value, forced out its long-time chief executive, and rocked both the global car industry and the German economy.\nOn Tuesday, the company said it would cut investment plans at its core VW division by 1 billion euros ($1.1 billion) a year through 2019 and speed up savings as it braces for a clean-up bill that some analysts say could reach 35 billion euros to cover regulatory fines, vehicle recall costs and lawsuits. \nVW's premium Audi division, source of about 40 percent of group profit, will also cut spending in the coming years, two Volkswagen sources told Reuters on Wednesday. \nAudi managers are reviewing the brand's 2015-19 budget of 24 billion euros and are due to outline possible cost cuts to its supervisory board by its next meeting on Dec. 3, they added. \n\nDIFFERENCES OF OPINION\nVahland was at Volkswagen for more than 25 years, leading its rapid expansion in China before heading Czech division Skoda.\nSkoda said he was leaving of his own choice because of unspecified differences of opinion over the company's organization of its North American business, confirming what sources close to the matter earlier told Reuters.\n\"This decision is expressly not connected to the current events around the diesel topic,\" a Skoda statement said.\nGerman weekly Auto Bild earlier reported Vahland's departure, noting he was passed over for the top job at Volkswagen after Chief Executive Martin Winterkorn resigned on Sept. 23 because of the scandal.\nVolkswagen had appointed 58-year-old Vahland to join the management of the VW brand on Nov. 1 as head of its operations in the United States, Mexico and Canada as part of a broader reshuffle that led to Porsche CEO Matthias Mueller taking the helm of the group.\nSources had told Reuters before Vahland's appointment that he was also the favorite to get a new management board position to oversee the group's North American operations, which were struggling even before the test rigging scandal.\n\nINVESTIGATIONS\nVolkswagen is under pressure to identify those responsible for the wrongdoing and fix up to 11 million affected diesel vehicles. It has been criticized by politicians, investors and consumers for the time it is taking to produce answers. \nSpiegel, citing preliminary results of investigations by law firm Jones Day and Volkswagen itself, said the dozens of managers implicated in test rigging would be suspended.\nIt also cited a person familiar with the matter as saying the circle of those involved or who knew about the cheating could widen further.\nNew CEO Mueller is expected to speak to top management on Thursday about the current state of the investigations, steps to refit affected models and possible spending cuts.\nAs part of its response to the crisis, the company announced plans on Tuesday to step up development of electric and hybrid vehicles.\nGerman Economy Minister Sigmar Gabriel warned on Wednesday against condemning diesel technology because of the problems at Volkswagen but said Germany needed to do better in switching to alternative engines.\nThe car industry employs more than 750,000 people in Germany and is a major source of export income. Diesel vehicles are particularly important in Europe, accounting for about a half of sales, compared with just a small fraction in the United States.\nGabriel said he was in favor of incentives to reduce the price difference between electric and conventional vehicles. However, the German finance ministry said it saw such incentives as \"problematic.\"\n\n(Writing by Georgina Prodhan and Mark Potter; Editing by Maria Sheahan and Giles Elgood)\nVolkswagen Winfried Vahland", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T02:23:15.072+03:00", "highlightTitle": ""}