{"organizations": [], "uuid": "e5793b7e951626fbf4c01f208fe94435ceb24a6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/h/p/d/w/p/image.related.articleLeadwide.620x349.gk8imy.png/1444785889290.jpg", "site_section": "http://www.canberratimes.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.canberratimes.com.au/business/banking-and-finance/westpac-rate-rise-ushers-end-of-the-property-boom-20151013-gk8imy.html", "country": "AU", "title": "Westpac rate rise ushers end of the property boom", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Westpac rate rise ushers end of the property boom", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T09:24:00.000+03:00", "replies_count": 0, "uuid": "e5793b7e951626fbf4c01f208fe94435ceb24a6d"}, "author": "", "url": "http://www.canberratimes.com.au/business/banking-and-finance/westpac-rate-rise-ushers-end-of-the-property-boom-20151013-gk8imy.html", "ord_in_thread": 0, "title": "Westpac rate rise ushers end of the property boom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COMMENT\nReturn to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Westpac raises home loan rates\nWestpac may lose customers with mortgage rate rise\nPascoe: Insurers for Uber\nPascoe: Fundamentals first\nGreens: metadata laws 'a complete debacle'\nReplay video Return to video Video settings Please Log in to update your video settings\nWestpac raises home loan rates Why has Westpac raised its home loan rates? Mal Maiden explains the decision and identifies the state that is going to feel the pain the most.\nPT1M34S 620 349 Autoplay On Off Video feedback Video settings Westpac raises home loan rates History will show that if there was a day that marked the start of the end of Australia's residential property boom, it was today.\nRegulators and legislators who've spent the past two years worrying about an overheated property market should now be diverting attention to the fallout when the home market starts to deflate. That market appears to be increasingly close to being caught in a pincer between a big increase in supply and the start of moves by banks to increase interest rates on home loans.\nWestpac's move could herald the end of the property boom. Photo: VIRGINIA STAR\nWestpac has announced it will be the first of the big banks to raise interest rates for owner occupied home loans . Over the past few months rates on some investment property loans have increased but the owner occupied residential heartland has until now been shielded .\nAdvertisement It is a fair bet that in the Australian banking landscape - where there is limited price based competition between the major lenders - that others will follow.\nThere have been plenty of mortgage holders still hoping that the Reserve Bank will usher in another cut to official rates this year and they'll be jolted at the news of the a first large bank increasing rates.\nThose predicting a fall in residential property prices as early as the first quarter of calendar 2016 should be feeling like they're on safer ground.\nBigger safeguards The reason for the rise in interest rates is simple enough. The amount of capital that the banks need to hold against mortgages has increased by 50 per cent thanks to recent regulatory changes.\nBanks are also feeling the pressure from additional requirements to hold more capital in the interests of making the banking system as a whole safer. Over the past six months all the banks have been fortifying their balance sheets by either raising fresh equity or selling assets to bolster cash.\nWestpac is the last of the four majors to make a big move in this regard but on Wednesday announced it would raise $3.5 billion.\nThe bottom line to regulatory moves to ensure the major banks are in the top quartile when it comes to capital safeguards among their global peers - as recommended by the Murray Financial System Inquiry - was always going to come at a cost.\nAnd there were plenty of banks executives who, while disagreeing with the need to raise more capital, made it clear enough that those costs were more likely to be passed onto customers than to shareholders.\nThe news a of rate rise came as Westpac announced its 2015 result on Wednesday , including a 2 cent increase in its dividend and cash earnings up 3 per cent\nThe head of the consumer bank at Westpac George Frazis said raising interest rates was a \"difficult decision and one that is not taken lightly. We acknowledge that it does impact customers, even in an environment where interest rates remain near historic lows\".\n\"We have sought to carefully balance the needs of our borrowers, depositors and our shareholders, as well as the competitive market we operate in. Increases in the cost of doing business inevitably influence business decisions, including price,\" Mr Frazis said.\nMore banking and finance news and analysis", "external_links": [], "published": "2015-10-14T09:24:00.000+03:00", "crawled": "2015-10-14T05:06:51.635+03:00", "highlightTitle": ""}