{"organizations": [], "uuid": "8ce1e49a3667b77e9e33591a320da51e2d16761c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/TWb3UgcG6SE05.gLvk_i8Q--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-11T133919Z_1_LYNXNPEB9A0E7_RTROPTP_3_USA-FED_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/feds-fischer-says-2015-u-133919988.html?l=1", "country": "GB", "title": "Fed's Fischer says 2015 U.S. rate rise 'an expectation, not a commitment'", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Fed's Fischer says 2015 U.S. rate rise 'an expectation, not a commitment' - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 10, "uuid": "1bbfd4dea328bc1bc5822a32c5388aef93444923"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/feds-fischer-says-2015-u-133919988.html?l=1#post-0", "ord_in_thread": 0, "title": "Fed's Fischer says 2015 U.S. rate rise 'an expectation, not a commitment'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nFederal Reserve Vice Chairman Stanley Fischer in Jackson Hole, Wyoming August 28, 2015. REUTERS/Jonathan Crosby (Reuters) - U.S. Federal Reserve policymakers are still likely to raise interest rates this year but that is “an expectation, not a commitment”, and could change if the global economy pushes the U.S. economy further off course, Federal Reserve Vice Chairman Stanley Fischer said.\n\n“Both the timing of the first rate increase and any subsequent adjustments to the federal funds rate target will depend critically on future developments in the economy,” Fischer told a group on the sidelines of the International Monetary Fund meeting in Peru. \n\nHe said “considerable uncertainties” surrounded the U.S. economic outlook, particularly the drag on exports from slowing global growth, low investment caused by the decline in oil prices and what he called a “disappointing” recent drop in U.S. job growth.\n\n\nHe said he felt the U.S. economy was still generating enough jobs to continue making progress towards the Fed’s goal of maximum employment and that inflation would eventually rise. Based on that, he said, the U.S. central bank should be able to keep on track with an initial rate hike expected in October or December.\n\nBut he also cautioned the group that the United States is now more exposed than ever to international events and that developments in China and elsewhere had already influenced the Fed to delay a widely expected rate increase in September.\n\n“We do not currently anticipate that the effects of these recent developments on the U.S. economy will prove to be large enough to have a significant effect on the path for policy,” he said. “That said, recent employment reports have been somewhat disappointing and, as always, we are closely monitoring developments that could affect our sense of the economic outlook and the risks surrounding that outlook.”\n\nFischer was speaking on the sidelines of an IMF meeting where some other central bankers were encouraging the Fed to eliminate uncertainty and move forward with their rate “lift-off.”\n\nBut Fischer said the implications of a global slowdown were to0 serious to ignore and would not let the Fed overcommit on its plans.\n\nEven though uncertainty about the Fed’s intentions might itself roil global markets, “We remain committed to communicating our intentions as clearly as possible – but not more than the facts warrant,” he said.\n\n(Reporting by Howard Schneider; Editing by Greg Mahlich)\nStanley Fischer", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T00:21:31.536+03:00", "highlightTitle": ""}