{"organizations": ["GNA", "Reroy Cables"], "uuid": "5c452942e064ab82df6309fca221f06385046a6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/jne5hus22b_mrskatepapafioquartey.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/651423/1/reroy-cables-wins-cimg-manufacturing-company-of-th.html", "country": "US", "title": "Reroy Cables wins CIMG manufacturing company of the year", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Reroy Cables wins CIMG manufacturing company of the year", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T12:00:00.000+02:00", "replies_count": 0, "uuid": "5c452942e064ab82df6309fca221f06385046a6c"}, "author": "", "url": "http://www.modernghana.com/news/651423/1/reroy-cables-wins-cimg-manufacturing-company-of-th.html", "ord_in_thread": 0, "title": "Reroy Cables wins CIMG manufacturing company of the year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  25 October 2015 11:00 CET Reroy Cables wins CIMG manufacturing company of the year By GNA \nAccra, Oct. 24, GNA - Reroy Cables, a leading indigenous cable manufacturing company that produces fire-resistant cables, was adjudged the 2014 Manufacturing Company of the Year at the 26th Chartered Institute of Marketing Ghana (CIMG) Awards. \nThe company's Chief Executive Officer, Mrs Kate Quartey-Papafio won the CIMG marketing woman of the year for 2013. \nReroy Cables was one of the nominated indigenous Made in Ghana Products, shortlisted to receive the Pride of Ghana honours at the maiden edition of the Ghana Made Product Awards and Exhibition 2012. \nThe awards sought the Pride of Ghanaian indigenous products and expose them to Ghanaians across the country in an effort to create awareness, promote and build product loyalty to save the economy and move it to international level. \nIn an interview with Reginald Quartey-Papafio, Executive Member of the Reroy Group, he said the company prides itself with high quality standard of goods and services. \nMr Quartey-Papafio said the company has strategically positioned itself to deliver local content for the cable industry and focus on giving priority to Ghanaian cable manufacturers to compete effectively with foreign counterparts. \nHe urged all to show patriotism and participate in the wellbeing and financial stability of the nation and make conscious efforts to buy Made in Ghana products, to boost the country's economy. \nMr Quartey-Papafio commended President John Mahama for banning the importation of electrical cables and transformers due to quality concerns. \nPresident Mahama stated that many fire outbreaks in the country can be prevented if local businesses begin investing in the manufacturing of quality electrical cables and transformers. \nMr Quartey-Papafio said the company had manufactured an improved fire resistant cable onto the Ghanaian market with the state-of-the-art machines to address fire outbreaks in the country. \n'The local cable manufacturers need reliable and affordable electricity supply to enable them to produce at optimal levels as well as be able to compete effectively with our foreign counterparts', he added. \nGNA", "external_links": [], "published": "2015-10-25T12:00:00.000+02:00", "crawled": "2015-10-25T13:41:41.089+02:00", "highlightTitle": ""}