{"organizations": ["Services Ltd"], "uuid": "e4530cbce87df4258da69dc9e1d6f74c21026a4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510260155.html", "country": "US", "title": "Angola: Mineral Water Plant Unveiled in Soyo", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Angola: Mineral Water Plant Unveiled in Soyo", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T08:04:00.000+02:00", "replies_count": 0, "uuid": "e4530cbce87df4258da69dc9e1d6f74c21026a4d"}, "author": "", "url": "http://allafrica.com/stories/201510260155.html", "ord_in_thread": 0, "title": "Angola: Mineral Water Plant Unveiled in Soyo", "locations": ["Angola", "Malawi Soyo", "Soyo Mozambique", "Sumba", "Kikuilo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Abraão Gourgel", "Dania Lda", "Gourgel"], "text": "Mozambique: Mozambican Refugees May Lose Shelter in Malawi Soyo — A mineral water bottling plant, called \"Mpampam\" with the capacity to process one million and 280 thousand liters per month, was inaugurated Thursday in the town of Kikuilo, commune of Sumba, by the minister of Economy, Abraão Gourgel. The factory, belonging to the national company Nencanza-Oils and Services Ltd, of Dania Lda group, was built over a period of eight months and has installed capacity to process 850,000 bottles of one and half liter and one million bottles of 0.5 liters per month. The economic undertaking is budgeted at around 600 million Kwanzas, from building and its equipment, and provided 30 jobs, of which 11 are young women. On the occasion, the minister of Economy, Gourgel, congratulated the company for the initiative and called on other businessmen to seize the facilities that the Government program \"Angola invests\" is providing businessmen with a view to contributing to the diversification of the national economy. According to the Cabinet minister, the challenge assumed by the Angolan government to reverse the situation of extreme dependence on oil through the development and promotion of the diversification of the economic structure, to ensure the enlargement of the growth base and consequent increase in jobs. Angola \nBafana Bafana will not be participating at the 2016 CHAN tournament, despite beating Angola 2-1 in a qualifier in Luanda … see more » Copyright © 2015 Angola Press Agency. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,600 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-26T08:04:00.000+02:00", "crawled": "2015-10-26T08:22:33.275+02:00", "highlightTitle": ""}