{"organizations": [], "uuid": "494e94390ff17c8a6096dda193346fcf5afee31d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-food-beverage/?format=rss", "section_title": "Food & Beverage News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/ab-inbev-goes-hostile-lite-213308746.html", "country": "GB", "title": "AB InBev goes 'hostile-lite' in pursuit of SABMIller", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "AB InBev goes 'hostile-lite' in pursuit of SABMIller", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:33:00.000+03:00", "replies_count": 0, "uuid": "494e94390ff17c8a6096dda193346fcf5afee31d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ab-inbev-goes-hostile-lite-213308746.html", "ord_in_thread": 0, "title": "AB InBev goes 'hostile-lite' in pursuit of SABMIller", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0.00 \nAB InBev wants shareholders to back a deal that SAB claims would discriminate most of its investors \nCarlos Brito, the boss of Anheuser-Busch InBev, may not have gone hostile in his bid to secure a £65bn takeover of SABMiller (Amsterdam: MI8.AS - news ) , but he’s not exactly being friendly either. \nAB InBev has issued a statement in which the prolific Brazilian dealmaker appealed to investors in the FTSE 100 brewer who back a deal to pressure the British company’s board . \n“If shareholders agree that we should be in proper discussions, they should voice their views and should not allow the board of SABMiller (Xetra: BRW1.DE - news ) to frustrate this process and let this opportunity slip away,” Mr Brito said. It (Other OTC: ITGL - news ) is a strategy that Berenberg analysts described as “hostile-lite”, and Mr Brito hopes it will force the brewer’s board to engage with AB InBev. \nBut Mr Brito is asking shareholders to support a bid that SAB chairman Jan du Plessis argues is “deliberately designed to be unattractive to many of our shareholders”. \nThe bid, rejected by all of SAB’s board - bar the three directors that represent its biggest shareholder, Altria - comes in two parts. The first is an all-cash offer that values SAB at £42.15 a share. The second is a mixture of cash and unlisted AB InBev paper, which after five years would convert into ordinary listed shares. The value of this part of the bid - the so-called “partial share alternative” - is worth £37.49. \nMr Brito described the unlisted stock as designed “with and for” SAB’s two biggest investors. Tobacco firm Altria holds 26.6pc of SAB, while BevCo, the holding company of Colombia’s Santo Domingo family, has a 13.9pc stake. Both would likely incur a huge capital gains tax bill if they accepted an all-cash bid, and the offer of unlisted shares and cash would significantly limit the hit. \nWhile both parts of the offer are open to all investors, it is a pre-condition of a formal AB InBev bid that Altria and BevCo accept the “partial share” element. Furthermore, the “partial share” is limited to 41pc of SAB stock, and Altria and BevCo combined own about 41pc. If more opt in, the stock will be allocated on a pro-rata basis. \nSAB has argued that the dual structure “discriminates against the substantial proportion of SABMiller shareholders who may not be able to hold unlisted shares”. The FTSE 100 brewer went on to note that, because of movements in AB InBev’s share price, the value of the “partial share” offer, which is tailored to Altria and BevCo, could rise above that of the all-cash element most investors would have to take. \nAB InBev only made its first public offer on Wednesday and SAB investors are now weighing its merits. Investment firm Allan Gray told The Telegraph it was “currently engaged in discussions” with SAB directors. \nHowever, the dual stucture of AB InBev’s offer underlines the point that it is Altria and BevCo that are critical to SAB’s fate. Altria has already backed a £65bn takeover, which BevCo rejected. If the Santo Domingos, who have two SAB board seats, change their stance then a takeover looks unavoidable . \nGiven Mr Brito says the “partial share alternative” was drawn-up “with and for” BevCo and Altria, it suggests the Colombians are amenable to a deal and that they are simply waiting for AB InBev to offer the right price.", "external_links": [], "published": "2015-10-09T00:33:00.000+03:00", "crawled": "2015-10-09T09:25:00.476+03:00", "highlightTitle": ""}