{"organizations": [], "uuid": "4296bb287c30f3fa66e3afcfd33434a2d6545ead", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://www.modernghana.com/logo/final_log.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/648162/1/tourism-industry-in-ghana-needs-public-private-par.html", "country": "US", "title": "Tourism industry in Ghana needs public private partnership - Mr Landry", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Tourism industry in Ghana needs public private partnership - Mr Landry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:00:00.000+03:00", "replies_count": 0, "uuid": "4296bb287c30f3fa66e3afcfd33434a2d6545ead"}, "author": "", "url": "http://www.modernghana.com/news/648162/1/tourism-industry-in-ghana-needs-public-private-par.html", "ord_in_thread": 0, "title": "Tourism industry in Ghana needs public private partnership - Mr Landry", "locations": ["Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Landry"], "text": "  9 October 2015 11:00 CET Tourism industry in Ghana needs public private partnership - Mr Landry By GNA \nAccra, Oct. 8, GNA - Mr Adrian Landry, outgoing General Manager of the Labadi Beach Hotels, says the tourism industry needs public private partnership in order to develop to its desired limit. \nMr Landry said this at the farewell and welcoming cocktail event for the old and new General Manager at the Labadi Beach Hotel, in Accra. \nHe said over the years management of the hotels has introduced city and guilds examination for its staff to better equip them to serve their clients better and efficiently. \nMr Landry expressed appreciation to the staff and management and board of the hotel for the warm reception given him over the past nine years of his stay at the hotel, and urged them to continue to work hard to the best of their ability for the betterment of the hotel and the tourism and hospitality sector. \nHe said he was optimistic that his new replacement would manage the hotel with much enthusiasm to improve it from its current state, and urged the staff to give him the needed support. \nMr Landry called on stakeholders in the hospitality and tourism sector in Ghana to project the country in the limelight of the international community to attract more investors into the economy. \nMr Michael W. Rathgeb, the New General Manager said Ghana has a lot of potential and as a new leader of the hotel his is looking to harness the prospects for the development of the hospitality industry. \nHe said the hotel's success in the last nine years was highly attributed to having a well experienced management team, which was spearheaded by Mr Adrian Landry, the outgoing General Manager, and he was ready to continue with the good work of his predecessor. \nMr Rathgeb therefore, called on management and staff to provide the needed support to maintain the hotel as one of the only two five star Hotels in the country. \nThe Labadi Beach Hotel is one of the only two five star Hotels in Ghana established in 1991 and has 164 rooms including, two Presidential Suites, four Executive Suites, four Superior Suites and two paraplegic rooms. \nThe hotel has in recent months added a 600- seater conference facility as well as an exercise pool and a spa. \nGNA", "external_links": [], "published": "2015-10-09T13:00:00.000+03:00", "crawled": "2015-10-09T13:31:41.795+03:00", "highlightTitle": ""}