{"organizations": [], "uuid": "8d992aba800147a54f4f32fcaa9b3d211a28cc17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/5/9/s/1/image.related.afrArticleLead.620x365.gk2gqd.png/1444374037534.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/more-than-an-air-mattress-airbnb-pumps-up-the-luxury-20151006-gk2gqd", "country": "AU", "title": "More than an air mattress: Airbnb pumps up the luxury", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "More than an air mattress: Airbnb pumps up the luxury | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T15:00:00.000+03:00", "replies_count": 0, "uuid": "8d992aba800147a54f4f32fcaa9b3d211a28cc17"}, "author": "Misa Han", "url": "http://www.afr.com/news/more-than-an-air-mattress-airbnb-pumps-up-the-luxury-20151006-gk2gqd", "ord_in_thread": 0, "title": "More than an air mattress: Airbnb pumps up the luxury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bailey rents the five bedroom mansion in Clareville in Sydney's northern beaches through Airbnb. Janie Barrett Share on twitter by Misa Han For Bailey, the sharing economy means more than simply letting out his spare sofa bed. The 32-year-old interior and exterior designer manages a five-bedroom mansion in Clareville, in Sydney's northern beaches, owned by a friend and rented out for the hefty price of $990 a night through Airbnb.\nThe Airbnb experiment paid off. The house generates between $7000 and $8000 a week in rent, and up to $16,000 a week in the peak season. The property is booked 70 per cent of the time. If he rented out the property on a longer term, he would get only up to $4000 a week.\n\"With a permanent rental, you've got a security of a 12-month lease but with Airbnb you can see if it works for you or not and use the property on the weekend as a holiday home,\" says Bailey, who tells AFR Weekend he does not have a last name – confirmed by a quick look at his driver's licence.\nAn entire beach mansion is a far cry from an air mattress in someone's living room. But such is the genesis of Airbnb, which began in 2008 when its co-founders, Brian Chesky and Joe Gebbia hosted strangers on inflatable mattresses at their San Francisco apartment to pay the rent .\nTass Schmidt rents out a luxury farm property in Jamberoo through Airbnb. Supplied Airbnb is now valued at about $US25 billion ($34.7 billion). Having swiftly moved into the mid-market with listings rivalling major hotel chains, it's now flirting with the luxury end. But numbers are so far small: just 200 of its 10,000 listings in Sydney go for more than $1000 a night. In Melbourne, it's just 30 out of 9000 listings.\nTass Schmidt, who manages a luxury, $800-a-night five bedroom farm property in Jamberoo from an on-site office through Airbnb, said high end customers now expected better service. \"We're starting to offer the kind of services guests would expect in a five star hotel. It might not be at that level, but it's the intention,\" she says.\nSchmidt says as more luxurious properties emerge on platforms like Airbnb it opened up more opportunities for property managers. \"The owners are usually so wealthy and they usually want a bit of return for their property and they don't want to be on call.\"\nLuxury travellers still reluctant Bailey chilling out in the Clareville mansion. Janie Barrett Incumbents of luxury tourism industry are keen to preserve their patch. Alissa Hildebrand, chief executive of travel concierge company Valet Private, says high-end customers are reluctant to use Airbnb.\n\"You really don't know what you're getting. It's a big risk for luxury travellers to pay a significant amount of money and paying it upfront with no real guarantee,\" she says.\nShe thinks those who list their luxury properties on Airbnb need to refine their offering.\n\"If they want to target the luxury market, they need to get small things right like fire protection, provide 100 per cent guarantee for their properties, and perhaps have an external agency managing the property for them,\" she says.\nOther sharing economy-style platforms hope to keep the high end to themselves. Onefinestay inspects all the properties before listing them on its website and provides its own concierge and cleaning services. It says only one in 10 properties are accepted for listing, keeping its well-heeled clients away from riff-raff. The platform only covers homes in London, Los Angeles, New York or Paris, with no plans to expand into Australia.\nThe NSW government is inquiring into the regulation of short-term holiday letting, while the new federal Tourism Minister, Richard Colbeck, has flagged he will consider the impact of sharing-economy businesses such as Uber and Airbnb on the local tourism industry .\nTourism Accommodation Australia wants short-term rentals to be registered and a limit on how long the property can be rented out, where the host is not present.\n\"We're not concerned about individual operators who are putting up their house for rent. If somebody at Point Piper wants to rent out their house then it's up to them,\" TAA's Carol Giuseppi​ says.\n\"Where we are concerned is unregulated multi-unit owners who are operating a commercial business. Then you should have proportionate regulation,\" she said.\nAs for Bailey, he's happy to help his friend clean up an easy $7000 per week on the house in Clareville. And at the high-end, people are better behaved.\n\"Most people have been really respectful. You've got most people at the executive level so most people are amazing.\"", "external_links": ["http://techcrunch.com/2015/08/19/airbnb-and-the-humble-hustle/", "https://twitter.com/misahan", "http://www.onefinestay.com/", "https://www.airbnb.com.au/rooms/7116442"], "published": "2015-10-09T15:00:00.000+03:00", "crawled": "2015-10-09T22:05:14.917+03:00", "highlightTitle": ""}