{"organizations": ["ZNBC", "MMD"], "uuid": "7b73a21dba0e1dcb526b940fb372d5560317ef06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510191245.html", "country": "US", "title": "Zambia: 'Super' Dora Gets Energy Role", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zambia: 'Super' Dora Gets Energy Role", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:59:00.000+03:00", "replies_count": 0, "uuid": "7b73a21dba0e1dcb526b940fb372d5560317ef06"}, "author": "", "url": "http://allafrica.com/stories/201510191245.html", "ord_in_thread": 0, "title": "Zambia: 'Super' Dora Gets Energy Role", "locations": ["Zambia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dora Siliya", "Peter Adamu", "Lawrence Evans", "Siliya"], "text": "Zambia: Simuusa Fights for PF Adoption in Wake of Rejection By Peter Adamu The flamboyant Patriotic Front Petauke Central Member of Parliament Dora Siliya was this afternoon unveiled as Energy Minister. Formerly of the MMD as spokesperson and chief government mouthpiece, Siliya bounces back following a torturing political career that landed her through a rigorous court process for alleged abuse of authority, charges alleged instigated by her foes whom she once referred to as \"little men with little brains.\" Today, the former ZNBC newscaster bounced back into mainstream government operations with an appoint as energy minister at a critical time when the country is facing power deficit. Siliya told journalist it was humbling to bounce back; \"My family and I are deeply humbled by the confidence by the Head of State in giving me this opportunity to serve the Zambian people. We are peace loving citizens and with our collective efforts, we will ensure we attend to the problems facing the energy sector.\" The charismatic politician was sworn in alongside Lawrence Evans who is Deputy Minister of Livestock and Fisheries. Zambia \nPRESIDENT Edgar Lungu yesterday led Zambians in their multitudes as the country commemorated the National Day of … see more » Copyright © 2015 Zambia Reports. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,700 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-19T12:59:00.000+03:00", "crawled": "2015-10-19T19:01:21.521+03:00", "highlightTitle": ""}