{"organizations": [], "uuid": "1425d25a1ba38fadd6e740bd1b36c5c4468ab419", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=CKSW", "section_title": "Yahoo! Finance: CKSW News", "url": "http://finance.yahoo.com/news/clicksoftware-announces-appointment-ceo-145500204.html", "country": "US", "title": "ClickSoftware Announces Appointment of New CEO", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "ClickSoftware Announces Appointment of New CEO - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "1425d25a1ba38fadd6e740bd1b36c5c4468ab419"}, "author": "ClickSoftware Technologies Ltd", "url": "http://finance.yahoo.com/news/clicksoftware-announces-appointment-ceo-145500204.html", "ord_in_thread": 0, "title": "ClickSoftware Announces Appointment of New CEO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BURLINGTON, Massachusetts, October 1, 2015 /PRNewswire/ --\nClickSoftware Technologies Ltd ., a leading provider of automated mobile workforce management and optimization solutions for the service industry, is pleased to announce the appointment of Tom Heiser as the Company's new Chief Executive Officer. Tom will replace Paul Ilse, an Operating Partner with Francisco Partners, who initially served as Interim-CEO upon the closure of ClickSoftware's acquisition by Francisco Partners in July 2015. Paul will continue to support ClickSoftware's strategic initiatives serving as a business advisor on behalf of Francisco Partners, and will ensure Tom's smooth transition into the CEO role.\n(Photo: http://photos.prnewswire.com/prnh/20151001/273077 )\n\nTom brings with him more than three decades of experience in a full range of senior leadership roles in technology companies within the software and IT industry. He joins ClickSoftware from Arxan Technology, a TA Associates portfolio company, where he served as Interim-CEO. Prior to that, Tom served for almost 30 years with EMC in a variety of operational and executive roles including most recently as EVP of Cloud Strategies and Execution. He was directly involved in the formation of EMC's Cloud Infrastructure and Services Division. He also previously served as the President of RSA Security, a security division of EMC Corporation. Tom served on the board of directors of Cyber-Ark Software, one of the most successful NASDAQ IPOs back in 2014, and is also very familiar with the fast-pace growth Israeli high-tech companies.\n\"The Board looks to Tom with confidence. He is a proven leader who has time and time again demonstrated strong growth and performance in all businesses he has managed,\" said Matt Spetzler, partner at Francisco Partners. \"Accelerating our growth and differentiating our offering to optimize customer experience is critical to our success. Tom's experience and proven track record in general management, global markets, channels, cloud delivery models and product strategies will be the catalyst we need to extend our value globally.\"\n\"Tom's deep software industry experience and market leadership credentials provide a strong complement to our executive leadership team,\" said Hannan Carmeli, President at ClickSoftware. \"We look forward to the contribution he will make in helping us extend ClickSoftware's global leadership position, in building and guiding our global reputation and brand, and in further growing the success of our sales teams and partner ecosystem.\"\nTom Heiser's appointment follows an extensive international search conducted by the Board. He will officially assume the duties of ClickSoftware CEO on October 1, 2015.\n\"ClickSoftware is a technology leader with a well-earned reputation as an innovator and trusted provider of automated mobile workforce management and optimization solutions. I am excited with the opportunity to lead it and look forward to working with the exceptional team that is behind its many accomplishments,\" said Tom Heiser.\nAbout ClickSoftware \nClickSoftware is a leading provider of automated mobile workforce management and service optimization solutions for the enterprise, both for mobile and in-house resources. As pioneers of the \"Service chain optimization\" and \"The real-time service enterprise\" concepts, our solutions provide organizations with end-to-end visibility and control of the entire service management chain by optimizing forecasting, planning, shift and task scheduling, mobility and real-time management of resource and customer communication.\nAvailable via the cloud or on-premise, our products incorporate best business practices and advanced decision-making algorithms to manage service operations more efficiently, in a scalable, integrated manner. Our solutions have become the backbone for many leading organizations worldwide by addressing the fundamental question of job fulfillment: Who does What, for Whom, With what, Where and When.\nClickSoftware delivers superb business performance to service sector organizations of all sizes. The Company is headquartered in the United States and Israel, with offices across Europe, and Asia Pacific. For more information, please visit http://www.clicksoftware.com . Follow us on Twitter .\nMedia Contacts: \nNoa Schuman \nClickSoftware \n+972-3-7659-467 \nNoa.Schuman@clicksoftware.com \nProfessional Services Information Technology Francisco Partners ClickSoftware", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T17:39:04.321+03:00", "highlightTitle": ""}