{"organizations": [], "uuid": "f7a7db0536adfaafd2bc6d4d4dbff1b943422729", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/maggi-1.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/nestle-india-asks-why-fresh-tests-on-maggi/43612.html", "country": "IN", "title": "Nestle India asks why fresh tests on Maggi", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Nestle India asks why fresh tests on Maggi", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T15:42:00.000+03:00", "replies_count": 0, "uuid": "f7a7db0536adfaafd2bc6d4d4dbff1b943422729"}, "author": "IANS", "url": "http://www.moneylife.in/article/nestle-india-asks-why-fresh-tests-on-maggi/43612.html", "ord_in_thread": 0, "title": "Nestle India asks why fresh tests on Maggi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Nestle India asks why fresh tests on Maggi 43612 Nestle India asks why fresh tests on Maggi 0 Comments, Be the first to comment + COMMENT IANS | 08/10/2015 06:12 PM | Nestle India on Thursday asked the apex consumer court why fresh tests were being ordered on Maggi noodles on food safety when a similar exercise has already been conducted as per directions of the Bombay High Court. The matter came up before the National Consumer Disputes Redressal Commission, which heard it for nearly three hours. The bench of Justice V.K. Jain and Justice B.C. Gupta was hearing a class action suit filed against Nestle India. It said the commission would hear the application again on October 15 with regard to fresh tests on Maggi samples. \"We are waiting for the results of the samples from three government-recommended laboratories as it was ordered by the high court. As such what is the need of parallel tests,\" Nestle's attorney asked about the suit filed by the consumer affairs ministry for alleged unfair trade practices by Nestle. Nestle's attorney said sampling should not be done to devalue the larger bench. Apprehensions about the samples being tampered with cannot be ruled out as they were not recommended either by the FSSAI officials or the consumer directly, the counsel said. On the issue of monosodium glutamate (MSG), the attorney said MSG was permitted for seasoning in noodles and since the product was not meant for children below 12 months of age, mentioning \"No added MSG\" on the packet was not mandatory. Disclaimer: Information, facts or opinions expressed in this news article are presented as sourced from IANS and do not reflect views of Moneylife and hence Moneylife is not responsible or liable for the same. As a source and news provider, IANS is responsible for accuracy, completeness, suitability and validity of any information in this article. More in Moneylife", "external_links": [], "published": "2015-10-08T15:42:00.000+03:00", "crawled": "2015-10-08T16:16:33.000+03:00", "highlightTitle": ""}