{"organizations": [], "uuid": "73ab45cf79ebcdf6382b27bd10c9790493ff4bd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/TcPS0Cs1WpiCKyIvgg9YYQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-24T193052Z_1_LYNXNPEB9N0DB_RTROPTP_3_AUTOS-GM_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/uaw-gives-gm-sunday-night-193052495.html?l=1", "country": "GB", "title": "UAW sets Sunday night deadline for pact with GM, strike possible", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "UAW sets Sunday night deadline for pact with GM, strike possible - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 10, "uuid": "73ab45cf79ebcdf6382b27bd10c9790493ff4bd1"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/uaw-gives-gm-sunday-night-193052495.html?l=1", "ord_in_thread": 0, "title": "UAW sets Sunday night deadline for pact with GM, strike possible", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nGeneral Motors Co. headquarters is seen in Detroit, Michigan, September 17, 2015. REUTERS/Rebecca Cook By Bernie Woodall\nDETROIT (Reuters) - The United Auto Workers union set a Sunday night deadline for General Motors Co (GM.N) to agree to a new four-year contract, setting up a possible strike of GM's U.S. operations.\nThe current contract will expire at 11:59 p.m. ET on Sunday (0359 GMT Monday). The union could tell its 52,700 GM members to walk off their jobs at that time. However, if the union's negotiators believe there is progress toward an agreement, the deadline can be postponed.\nGM and the union have been in talks since July and have for the last several days intensified negotiations to reach a deal. The UAW and Fiat Chrysler Automobiles NV (FCAU.N) (FCHA.MI) have a new contract that goes into effect on Monday, while Ford Motor Co (F.N) has yet to enter intensified talks with the union.\nIn a statement, GM responded: \"We are working with them to address the issues and remain committed to obtaining an agreement that is good for employees and the business.\"\nGM workers are prepared to strike at the Fort Wayne, Indiana plant that makes profitable GM pickup trucks, said Brian Hartman, president of the UAW local there.\n\"We have everything ready to roll if it comes,\" said Hartman, referring to a possible order to strike from UAW President Dennis Williams or Cindy Estrada, UAW vice president for GM affairs. \nHartman said workers at the Fort Wayne plant were pleased that the Fiat Chrysler deal ratified this week gave a clear path for workers hired after 2007 to reach top pay. But, he said, they want it to take four years not eight from hiring to reach top pay, which will be about $30 per hour by the end of the four-year Fiat Chrysler contract.\n\"GM being in a different (more profitable) position than Chrysler, our members are looking for a bigger pie, not a bigger piece of the pie,\" Hartman said, referring to words of Walter Reuther, UAW president from 1946 to 1970.\nIt was only minutes before a strike deadline on Oct. 7 that Fiat Chrysler and the UAW reached agreement, averting the first strike on a Detroit automaker since 2007.\nIn several concessionary contracts with the UAW since 2007, GM has lowered its average labor costs to about $55 per hour from about $75. GM executives have said the company must keep labor costs at a point where they do not threaten GM's double-digit North American profit margins achieved this year.\nThe UAW has said often \"this is our time\" to receive remuneration from concessions in 2007 and 2009 that helped GM to survive a bankruptcy in a government-sponsored bailout.\nHowever, GM executives have made clear that its continued health largely depends on its ability to keep labor costs competitive with foreign-owned companies with U.S. plants. The rivals have eroded the No. 1 U.S. automaker' s market share for decades.\nAverage U.S. labor costs for Toyota Motor Co are about $48 per hour, and those of Nissan Motor Co are $42, according to estimates by the Center for Automotive Research.\n\n(Reporting by Bernie Woodall; Editing by Richard Chang and Marguerita Choy)\nUnited Auto Workers GM", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T01:37:03.541+03:00", "highlightTitle": ""}