{"organizations": [], "uuid": "ff312087501cecf2d4753925c2ee0fdfc5666ae1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.investors.com", "main_image": "http://www.investors.com/image/Biz10-autos-1026-company.jpg.cms", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://news.investors.com/102315-777154-ferrari-apple-tesla-motors-industry-highlights.htm?ven=yahoocp&src=aurlled&ven=yahoo", "country": "GB", "title": "Apple's Cook, Ferrari IPO, Unreliable Tesla And GM Earnings - Investors.com", "performance_score": 0, "site": "investors.com", "participants_count": 1, "title_full": "Apple's Cook, Ferrari IPO, Unreliable Tesla And GM Earnings - Investors.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "ff312087501cecf2d4753925c2ee0fdfc5666ae1"}, "author": "yahoo", "url": "http://news.investors.com/102315-777154-ferrari-apple-tesla-motors-industry-highlights.htm?ven=yahoocp&src=aurlled&ven=yahoo", "ord_in_thread": 0, "title": "Apple's Cook, Ferrari IPO, Unreliable Tesla And GM Earnings - Investors.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "T he Ferrari (NYSE: RACE ) IPO, Tesla Motors ' (NASDAQ: TSLA ) reliability and Apple 's (NASDAQ: AAPL ) interest in injecting its technology into autos were among the industry highlights.\nConsumer Reports Dings Tesla \nTesla generated buzz when it began downloading to customers a software upgrade in mid-October that includes Autopilot, another Mobileye (NYSE: MBLY )-generated software program. Autopilot provides a range of new features, such as an autopilot mode that lets the Model S steer within a lane and change lanes with the tap of a turn signal.\n  View Enlarged Image \nBut the buzz faded, and Tesla stock dropped nearly 7% Tuesday after Consumer Reports said the Model S reliability \"lags its high performance.\" The report said a survey \"chronicled an array of detailed and complicated maladies,\" including problems with power equipment, charging gear and the center console. Tesla closed down 1.2% Fri.\nFerrari IPO RACEs \nLate Tuesday, Fiat Chrysler Automobile (NYSE: FCAU ) spun off Italian luxury sports car maker Ferrari in an initial public offering . Pricing at 52, the high end of its range, Ferrari raised $894.4 million. Fiat Chrysler still owns 80% of Ferrari, which began trading on the NYSE as \"RACE\" Wednesday . Ferrari opened up 15% on Wednesday, closing up 6% in its debut, though at the session low. Fiat Chrysler fell 4.6% that day. FCAU, which reports on Oct. 28, rose 0.3% on Thursday and about 1% Friday.\nGeneral Motors Earnings Strong \nGeneral Motors (NYSE: GM ) on Wednesday reported strong third-quarter results. Earnings per share minus one-time items climbed 55% to $1.50, beating estimates by 32 cents a share.\nRevenue fell 1% to $38.84 billion, topping Wall Street's $38.55 billion estimate. Adjusting for the effects of the strong dollar, sales would have been $2.3 billion higher.\nGM CFO Chuck Stevens said the earnings beat was the beginning of a secular trend. \"We expect our earnings to accelerate in the next several years,\" he said, \"with double-digit earnings-per-share growth.\"\nGeneral Motors stock rose 5.8% on Wednesday, then rose modestly on Thursday and Friday, hitting four-month highs.\nApple Sees Car Revolution \nMeanwhile, Apple CEO Tim Cook said at an industry event Monday night he sees revolutionary changes coming to the auto industry amid a push toward self-driving cars. \"I do think that industry is at an inflection point for massive change, not just evolutionary change,\" Cook said at the Wall Street Journal's WSJDLive Technology Conference.\nAuto Autonomous Rush Hour \nThere's speculation that Apple will develop its own Apple Car, but some industry observers said Apple may be late to the party. Cook's comments came just weeks after GM said it would test autonomous Chevy Volts next year, with a little help from its friend Mobileye, which makes camera-based advanced driver-assist systems for many carmakers, including Tesla.", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T02:08:31.918+03:00", "highlightTitle": ""}