{"organizations": [], "uuid": "90f8cee3314a13c3d508e2860333c7d874954605", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/10/prweb13009290.htm", "country": "US", "title": "INFOVISA Partners with Reich & Tang to Deliver FDIC Insured Sweep Alternative", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "INFOVISA Partners with Reich & Tang to Deliver FDIC Insured Sweep Alternative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "90f8cee3314a13c3d508e2860333c7d874954605"}, "author": "Brandon Tipton", "url": "http://www.prweb.com/releases/2015/10/prweb13009290.htm", "ord_in_thread": 0, "title": "INFOVISA Partners with Reich & Tang to Deliver FDIC Insured Sweep Alternative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "INFOVISA™ today announced that it has partnered with Reich & Tang to offer an FDIC insured cash solution to its client base. Reich & Tang, a leading national FDIC insured investment provider, will administer the programs, which will be offered to all of INFOVISA’s bank trust, independent trust company, not-for-profit, foundation, and college and university clients. “We are very excited to add more depth and choice of cash investments to all of our client segments,” said Mike Dinges, president and CEO of INFOVISA. “Clearly there is an increasing demand for FDIC insured investments in light of money market mutual fund reform. We feel that this, coupled with the uniquely achieved high levels of FDIC insurance through Reich & Tang’s Demand Deposit Marketplace program, enables our clients to safely minimize risks and potentially increase returns on their cash investments.”\nDemand Deposit Marketplace (DDM) is an automated, daily cash sweep solution that enables investors to achieve millions of dollars in FDIC insurance while maintaining daily liquidity. The program automatically allocates investor deposits among several banks participating in the program, wherein the deposits never exceed the maximum FDIC coverage of $250,000 per bank per tax identification number. The new joint interface further streamlines the cash sweep process between INFOVISA and Reich & Tang.\n“We love to see companies like INFOVISA being proactive and getting ahead of the market,” said Michael Lydon, president and CEO of Reich & Tang. “DDM will certainly add immediate value to INFOVISA’s clients and the investors they serve. There are many predictable downsides to money market mutual fund reform and likely several that have not yet been contemplated. INFOVISA has effectively removed this risk and uncertainty for their clients by giving them the choice to pursue an FDIC insured strategy that is outside the scope of money fund reform.”\nThe DDM offering is scheduled to go live for INFOVISA clients in October. “We made the promise to give our clients the tools they need to help them effectively run their businesses. The DDM offering is the latest extension of that promise,” concluded Dinges.\n# # #\nAbout Infovisa\nInfovisa is an independent provider of data processing systems and related services for bank trust departments, independent trust companies, not-for-profit foundations, colleges, and universities. The Cornelius, North Carolina company is privately held by a holding company that focuses on possessing companies that serve the financial services industry. Over the years, the family-owned holding company has initiated new companies to explore opportunistic market niches.\nAbout Reich & Tang\nReich & Tang is one of the nation's largest firms dedicated solely to offering deposit and liquidity solutions to financial intermediaries and public and private investment entities. The firm is focused on creating, improving, and delivering smarter ideas to help banks, brokerages, trust managers, RIAs, and public and private sector clients maximize the value of their deposit, liquidity, and short-term investment programs. This singular focus across multiple business lines combines to form a unique perspective and expertise that provides a deeper insight into the multiple disciplines of cash management.\nMedia Contacts\nINFOVISA | http://www.infovisa.com | 704-892-3270\nReich & Tang | Frank V. Bonanno | fbonanno(at)rnt.com | 212.830.5318", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5pbmZvdmlzYS5jb20="], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T10:41:37.671+03:00", "highlightTitle": ""}