{"organizations": [], "uuid": "00afe0eae4698f7dbb2f085dfa09a0f32c3bb324", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/b/p/h/d/image.related.afrArticleLead.620x365.gkfhvk.png/1445476872871.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/nonmining-business-investment-likely-to-pick-up-says-nab-20151022-gkfhvk", "country": "AU", "title": "Non-mining business investment likely to pick up, says NAB", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Non-mining business investment likely to pick up, says NAB | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:21:00.000+03:00", "replies_count": 0, "uuid": "00afe0eae4698f7dbb2f085dfa09a0f32c3bb324"}, "author": "Post to Linkedin", "url": "http://www.afr.com/markets/nonmining-business-investment-likely-to-pick-up-says-nab-20151022-gkfhvk", "ord_in_thread": 0, "title": "Non-mining business investment likely to pick up, says NAB", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Current business investment activity has lifted from the lows of recent years to stabilise at around long-run average elevated levels. Michele Mossop Share on twitter by Mark Mulligan Business investment should pick up from current low levels, according to National Australia Bank's latest quarterly survey of sentiment, although some of this will be offset by the ongoing decline in resources-related capital expenditure.\nNAB said its latest quarterly survey of 920 companies, taken over two weeks from late August, showed respondents more upbeat about the economy than in recent quarters.\n\"According to the NAB survey measure of business capital expenditure, current business investment activity has lifted from the lows of recent years to stabilise at around long-run average elevated levels,\" the bank said.\nIt said although the investment hurdle return rate remained \"elevated\" at 14 per cent, the index measuring capital expenditure intentions over the next 12 months had risen 2 points, from 18 to 20, between the second and third quarters. The latest reading, however, was lower than the 21 points registered in the March quarter.\nThere was, however, divergence in the outlook according to industry type, with respondents from mining and manufacturing businesses planning to further cut investment.\n\"Mining investment is under-represented in our survey, meaning the degree of offset coming from the mining sector may not be fully captured,\" NAB warned.\nThe index tracking expected business conditions over the next 12 months also climbed, from 19 in the second quarter to 25 in the third. Conditions in the survey quarter, meanwhile, surged five points to 11, which is its highest level since early 2008, before the ravages of the global financial crisis took hold.\nBusiness confidence in the survey period, however, slumped from 4 points to zero, although the reading predates Malcolm Turnbull's replacement of Tony Abbott as prime minister.\n \"The fall in confidence is likely a reflection of the timing of the survey, which took place just prior to the change in Liberal leadership and at a time when recent concerns over emerging markets were at their peak,\" the bank said.\n\"The more timely monthly Business Survey showed that confidence posted a partial recovery in September once these issues settled down.\"\nNAB said the survey results suggested unemployment in Australia \"will remain elevated for some time\". However, this would gradually improve, partly because population growth was slowing.\n\"While current employment conditions suggest jobs growth of about 15,000 per month – enough to keep the unemployment rate stable – the 12-month expectation is more consistent with job growth of around 17,000 per month over the next six months, which may be sufficient to see the unemployment rate ease a little from current levels,\" the bank said.", "external_links": ["https://twitter.com/@MulliganMark"], "published": "2015-10-22T09:21:00.000+03:00", "crawled": "2015-10-22T05:08:04.343+03:00", "highlightTitle": ""}