{"organizations": [], "uuid": "ca1fb10baae45e6f407b3f079dcb46e084a84d56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/28/102871094-GettyImages-482125066.1910x1000.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=KMB", "section_title": "Yahoo! Finance: KMB News", "url": "http://www.cnbc.com/2015/10/21/early-movers-gm-ba-ko-sndk-kmb-tmo-tup-cmg-race-more.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=103096066", "country": "US", "title": "Early movers: GM, BA, KO, SNDK, KMB, TMO, TUP, CMG, RACE & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "Early movers: GM, BA, KO, SNDK, KMB, TMO, TUP, CMG, RACE & more", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "ca1fb10baae45e6f407b3f079dcb46e084a84d56"}, "author": "yahoo", "url": "http://www.cnbc.com/2015/10/21/early-movers-gm-ba-ko-sndk-kmb-tmo-tup-cmg-race-more.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=103096066", "ord_in_thread": 0, "title": "Early movers: GM, BA, KO, SNDK, KMB, TMO, TUP, CMG, RACE & more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell : \nGeneral Motors — The automaker earned an adjusted $1.50 per share for the third quarter, well above estimates of $1.18 a share. Revenue also beat forecasts, and GM said it would achieve a 10 percent North American profit margin this year, one year sooner than expected. \nBoeing — Boeing reported third quarter profit of $2.52 per share, 30 cents above estimates. Revenue also beat Street forecasts, and the jet maker also raised its full year earnings and revenue guidance. \nCoca-Cola — Coke came in 1 cent above estimates with adjusted third quarter earnings of 51 cents per share, though revenue fell short of forecasts. Coke's results, like those of many large multinational companies, were hurt by the impact of a strong dollar. \nSanDisk — The memory chip maker will be bought by hard drive manufacturer Western Digital for $86.50 per share in cash and stock, for a total value of $19 billion. \nKimberly-Clark — The consumer goods maker earned an adjusted $1.51 per share for the third quarter, 2 cents above estimates, with revenue also beating forecasts. The company also raised its full-year forecast despite the negative impact of a strong U.S. dollar. \nThermo Fisher Scientific — The scientific solutions provider earned an adjusted $1.80 per share for the third quarter, a penny above estimates, with revenue also above forecasts. Thermo Fisher also raised its full-year forecast, as it benefits from growth in key markets such as China, favorable currency impact, and recent acquisitions. \nTupperware — The household goods maker earned an adjusted 79 cents per share for its latest quarter, 8 cents above estimates, and revenue also beat Street forecasts. Tupperware's results were helped by growth in a variety of different markets around the world. \nCoach — Morgan Stanley upgraded the luxury goods maker to \"equal-weight\" from \"underweight,\" saying bad news such as market share declines and negative earnings revisions have now been priced into the stock. \nYahoo — Yahoo missed estimates by 2 cents with adjusted quarterly profit of 17 cents per share. Revenue was also slightly short of forecasts and the company also gave weaker than expected current quarter revenue guidance. Yahoo also announced a new search advertising deal with Google . \nChipotle Mexican Grill — Chipotle earned $4.59 per share for the third quarter, 3 cents shy of estimates, with the restaurant chain's revenue matching forecasts. Same-restaurant sales did grow a better-than-expected 2.6 percent, but that's far below the double-digit increases seen a year earlier. \nIntuitive Surgical — The company reported quarterly profit of $.47 per share, beating estimates of $4.23, and revenue also beat analysts' projections. The maker of robotic surgical equipment was helped by an increase in surgeries using its systems. \nFerrari — Ferrari priced its initial public offering at $52 per share, at the top of the expected range. The IPO values the automaker at $9.8 billion. Fiat Chrysler — which sold 10 percent of its Ferrari stake in the offering — is seeing its shares fall as some investors expected the offering to price at a higher level. \nTwitter — Twitter was downgraded to \"underweight\" from \"equal-weight\" at Morgan Stanley, citing limited user growth and a lack of advertiser demand growth. \nCredit Suisse — The bank announced plans to raise $6.3 billion, as its new chief executive officer tries to boost the bank's financial strength. \nSyngenta — Chief Executive Officer Mike Mack will step down at the end of October, with Chief Financial Officer John Ramsay taking the top spot at the chemical maker on an interim basis. \nToyota — The automaker will recall 6.5 million vehicles globally to fix a power window switch defect. \nSony — Sony is cutting the price of its PlayStation 4 video game console in parts of Europe by 50 euro to 349 euro. \nExpedia — The travel website operator plans to put more information on airline fees on its sites, which include Expedia, Travelocity, Orbitz, and Hotwire. \nKLA-Tencor — KLA-Tencor will be bought by rival semiconductor equipment maker Lam Research for $10.6 billion in cash and stock, valuing KLA-Tencor at $67.02 per share. That represents a 24 percent premium to the stock's Tuesday closing price. \nStarbucks — Starbucks and Fiat illegally benefited from illegal tax deals, according to a new European Union ruling. Starbucks said it plans to appeal the decision. \n\nQuestions? Comments? Email us at marketinsider@cnbc.com \n\nPeter Schacknow Senior Producer, CNBC Related Securities Symbol Price   Change %Change GM ---", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T08:06:56.952+03:00", "highlightTitle": ""}