{"organizations": [], "uuid": "f87dbd8dbfdda50d82a4237d2930b2dc8e603fbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://finance.yahoo.com/news/growing-tactic-among-retailers-price-180609939.html", "country": "GB", "title": "A Growing Tactic Among Retailers: Price-Matching Policies - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "A Growing Tactic Among Retailers: Price-Matching Policies - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "f87dbd8dbfdda50d82a4237d2930b2dc8e603fbe"}, "author": "Matilda James", "url": "http://finance.yahoo.com/news/growing-tactic-among-retailers-price-180609939.html", "ord_in_thread": 0, "title": "A Growing Tactic Among Retailers: Price-Matching Policies - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 2015 in the Internet World: Must-See Updates \n( Continued from Prior Part )\nPrice matching at Target Price-matching policies are gaining traction among leading retailers aiming to lure customers and gain a competitive edge. A noteworthy example of a company reverting to this strategy is Target (TGT), one of the leading retailers in the US, which announced that it will begin matching prices of products by listing the prices of rivals like Amazon.com (AMZN) and Wal-Mart (WMT) on its own website.\nThe price-matching feature will be available at Target’s 29 websites starting October 1. The company also plans to match prices of products from brick-and-mortar retailers such as Costco Wholesale (COST) and CVS in an effort to gain a competitive edge over rivals during the upcoming 2015 holiday shopping season.\n\nAccording to a report from eMarketer, during the 2015 holiday season, US retail sales should grow at a YoY (year-over-year) rate of 5.6%. This growth should be the highest since 2011, as the graph above shows.\nThe holiday season is generally the busiest period for retailers. Although Amazon didn’t announce many details on how its 2014 holiday season fared, Wal-Mart announced that its Thanksgiving 2014 was its second-biggest day ever for online sales.\nSimilarly, Target mentioned that Thanksgiving 2014 was its biggest online day ever. Best Buy (BBY) faced some issues with its website as it crashed repeatedly due to a surge in mobile traffic.\nFor diversified exposure to Amazon, you can invest in the PowerShares QQQ Trust Series 1 ETF (QQQ), which has about 4.9% of its holdings in Amazon.\nIn the next part of this series, we’ll look at some of the revenues and operating losses of Google’s new ventures.\nContinue to Next Part \nBrowse this series on Market Realist: \nPart 1 - Mobile Apps versus Websites: User Favorites or Audience Lures? Part 2 - How Accusations of Exploiting Android Could Impact Google Part 3 - Why Android’s User Base Is Growing at Such a Fast Pace Target", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T00:49:37.272+03:00", "highlightTitle": ""}