{"organizations": ["Vodafone"], "uuid": "e5d8324e4936c23a296cdef5377b5b00f1f26474", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/afv2ylk88s_5264410248957_6429501462469.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/649064/1/vodafone-to-reward-180000-customers-in-latest-yee-.html", "country": "US", "title": "Vodafone to reward 180,000 customers in latest 'Yee Twi K' promo", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Vodafone to reward 180,000 customers in latest 'Yee Twi K' promo", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T21:36:00.000+03:00", "replies_count": 0, "uuid": "e5d8324e4936c23a296cdef5377b5b00f1f26474"}, "author": "", "url": "http://www.modernghana.com/news/649064/1/vodafone-to-reward-180000-customers-in-latest-yee-.html", "ord_in_thread": 0, "title": "Vodafone to reward 180,000 customers in latest 'Yee Twi K' promo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Myjoyonline"], "text": "  19:36 CET Vodafone to reward 180,000 customers in latest 'Yee Twi KÉ”' promo By Myjoyonline \nCIMG Telecoms Company of the year, Vodafone Ghana will for the next 70 days reward over 180,000 customers nationwide with exciting cash prizes and airtime daily, weekly and monthly, in its latest promo dubbed “Yee Twi KÉ”.” \nAt the launch of the promo, Director of Marketing at Vodafone Ghana, Agnes Emefa Essah said the“Yee Twi KÉ””promo seeks to award GHS100,000 to the ultimate winner. \nAccording to her, this is Vodafone’s way of showing appreciation to its loyal customers for their continuous support and patronage, and to celebrate the inroads the company has made in the telecom sector over the past six years. \n“Six years ago, we brought refreshment to the Ghanaian telecommunications landscape when we took over Ghana Telecom. Our new campaign, “Yee Twi KÉ””, will reward over 180, 000 customers’ nationwide within 70 days”. \nIt is truly an industry first; especially with the magnitude of people that are to be rewarded throughout the entire duration of the promotion”, she said. \nHow to win a prizeUnder the mechanics of the promotion, Emefa said Vodafone’s recharge cards would, in the coming days, take on a new format with features including two scratchable panels - the concealed recharge pin and the hidden prize. \nCustomers are required to scratch the panels to reveal the identity of the prizes won. \nThe customer is required to simply Scratch Top-up and Win’ or build points as they recharge, make calls, send SMS, browse the internet or purchase bundles including Vodafone RED and Vodafone X. \nCustomers can withdraw the cash at any Vodafone Cash agent or Vodafone Retail Shop nationwide, after successfully registering for the mobile money service. Customers can also buy airtime with their prize money. \n“The ‘scratch and win’ aspect of the promotion is open to both pre-paid and hybrid customers; however the point accumulation aspect is only for consumer mobile prepaid customers”, Emefa added.", "external_links": [], "published": "2015-10-13T21:36:00.000+03:00", "crawled": "2015-10-13T21:14:22.843+03:00", "highlightTitle": ""}