{"organizations": [], "uuid": "a4984928b3b3d4ab6020770b9e688c51d56aa957", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-mortgages/?format=rss", "section_title": "Mortgages News | Headlines - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/boe-help-smaller-lenders-compete-204501933.html", "country": "GB", "title": "BoE to help smaller lenders compete better in mortgage market", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "BoE to help smaller lenders compete better in mortgage market", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:45:00.000+03:00", "replies_count": 0, "uuid": "a4984928b3b3d4ab6020770b9e688c51d56aa957"}, "author": "", "url": "https://uk.finance.yahoo.com/news/boe-help-smaller-lenders-compete-204501933.html", "ord_in_thread": 0, "title": "BoE to help smaller lenders compete better in mortgage market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Oct 22, 2015, 23:20 BST - UK Markets closed BoE to help smaller lenders compete better in mortgage market Reuters - UK Focus – 1 hour 35 minutes ago -0.87 \nBy Huw Jones \nLONDON, Oct (HKSE: 3366-OL.HK - news ) 22 (Reuters) - The Bank of England will help new lenders cut how much capital they have to set aside to cover defaulting mortgages so they can compete better with their bigger rivals, a top BoE official announced on Thursday. \nBritain's government is keen to increase competition in banking, a sector where just four lenders, HSBC, Lloyds, RBS (LSE: RBS.L - news ) and Barclays (LSE: BARC.L - news ) make up 77 percent of high street accounts and dominate mortgage lending. \nUK finance minister George Osborne has given the Bank of England, whose Prudential Regulation Authority regulates lenders, a new, extra remit to boost competition. \nBoE Deputy Governor and PRA Chief Executive Andrew Bailey said that one way to fulfil this remit will be to help new banks compete better in offering home loans. \nCurrently, large banks like HSBC and Barclays can use their own models for calculating how much capital to set aside against mortgages. Smaller lenders must use a method set out by regulators, known as the standard approach. \nIn-house models are more sensitive to risks than the standard approach and come up with a lower capital requirements. \n\"The consequence of this is that smaller banks and building societies cannot compete effectively in lower risk asset markets such as prime mortgages because the capital requirements are too far apart and in favour of large banks,\" Bailey told a financial services audience. \n\"This forces them into riskier assets and undermines their position.\" \nThe Bank is taking a twin-track approach: seeking to persuade the European Union to change its bank capital law to ease the burden on smaller lenders; and in the meantime help smaller lenders get approval to use their own models for mortgages. \n\"We welcome internal model applications by smaller banks and we will do what we can to help them meet the required prudential standards, which are largely set out in the EU legislation,\" Bailey said. \nBrussels has begun a consultation on reviewing its bank capital rules to see whether changes could be made to help lenders provide more funds for the economy. \nThe BoE has told the EU it wants a more tailored approach to capital requirements at smaller lenders. \n\"This is an important issue, and one that matters if we are to have growing challenger banks,\" Bailey said in reference to a new generation of lenders like Virgin, Metro (Other OTC: MTRAF - news ) , Aldermore and Atom. \nThe move will help soften the blow of a new industry-wide surcharge on profits from next year. \nThe PRA has authorised ten banks in the last two years, and has a \"substantial\" pipeline of interested parties, Bailey said. \n(Reporting by Huw Jones; Editing by Elaine Hardcastle)", "external_links": [], "published": "2015-10-22T23:45:00.000+03:00", "crawled": "2015-10-23T01:20:22.079+03:00", "highlightTitle": ""}