{"organizations": [], "uuid": "14d9840212df4471276de586a28e89f395053af5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KP684_1005la_G_20151005104025.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/how-much-should-scientists-check-other-scientists-work-1444074456", "country": "US", "title": "How Much Should Scientists Check Other Scientists’ Work?", "performance_score": 2, "site": "wsj.com", "participants_count": 1, "title_full": "How Much Should Scientists Check Other Scientists’ Work? - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T23:47:00.000+03:00", "replies_count": 0, "uuid": "14d9840212df4471276de586a28e89f395053af5"}, "author": "Shirley S. Wang", "url": "http://www.wsj.com/articles/how-much-should-scientists-check-other-scientists-work-1444074456", "ord_in_thread": 0, "title": "How Much Should Scientists Check Other Scientists’ Work?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS A question is dividing the scientific community: Is there a value to public health in spending time and money to replicate long-completed, peer-reviewed studies?\nTwo recent high-profile papers that scrutinize older research have raised questions about the fundamental reliability of scientific findings.\nOne, a reanalysis of data from a study published in 2001 on antidepressant use in children, describes the original analysis as flawed. The new study, published in the journal BMJ , is prompting some scientists to call for the original study to be retracted.\nENLARGE Brian Nosek is a psychology professor at the University of Virginia and the director of the Center for Open Science. Photo: Polaris The other, published in the journal Science , tried to replicate the findings from 100 classic psychology studies—but could only do so in about 40% of cases. It has led to soul-searching within some in the field about what the results mean about the trustworthiness of study findings in psychology.\nThough researchers often share data more readily than they used to, thorny questions loom: Does an inability to replicate a study mean that the original study is wrong and should be retracted? And is this push for transparency actually helping to improve science?\nScientists have historically tended to keep their study data private. They typically have submitted only data analyses and interpreted results in a manuscript to a committee of peers to consider for publication in academic journals, a process known as peer review.\nBut some scientists, including those involved in the two new studies, have recently questioned why data isn’t shared more openly. They say this would allow researchers to better learn from and check each other’s work.\nWith a peer-reviewed publication, “I’m making the presumption that it’s an accurate report of what actually occurs in the world,” says Brian Nosek, a co-author on the Science paper. He is executive director of the Center for Open Science and a psychology professor at the University of Virginia.\nA Drug in Question Key dates related to the research of the use of the antidepressant paroxetine, also known as Paxil, by adolescents.\nENLARGE Photo: Getty Images/Photo Researchers RM 2000: Researchers write up Study 329, with paroxetine described as safe and effective for adolescents, and submit it for publication. 2001: Study 329 is published in the Journal of American Academy of Child and Adolescent Psychiatry, describing paroxetine as safe for adolescents. 2004: The U.S. Food and Drug Administration requires a black-box warning about increased risk of suicidal thoughts for children and adolescents taking SSRIs, including paroxetine. 2007: The FDA expands the SSRI black-box warning to include young adults up to 24. 2012: GlaxoSmithKline\n, maker of Paxil, agrees to pay $3 billion in damages in a Justice Department lawsuit regarding unlawful promotion of certain prescription drugs, including Paxil. 2015: The reanalysis of Study 329 is published in BMJ, saying that paroxetine didn’t show any benefit and posed a safety risk to the original study’s participants, who were all adolescents, contrary to Study 329’s conclusions. Source: Study 329 reanalysis group, U.S. Justice Department\nGovernment regulators use peer-reviewed clinical trials of experimental drugs to decide whether to approve new treatments. Unreliable or flawed studies could lead to drugs being used in the population that are less effective or safe than believed, possibly leading to patient harm. (The vast majority of trials and studies that pass peer review aren’t retracted or questioned later.)\nScientists often aim to publish as much of their research as possible in high-impact journals. Depending on the field, negative trials or replications of previous work are difficult to publish. That incentive structure needs to change, Dr. Nosek says.\nHe says that just because a study doesn’t replicate doesn’t mean the initial finding was wrong. The problem could lie with experimenters’ explanations of the data rather than the findings themselves.\nSometimes a field’s understanding of a phenomenon simply improves over time, experts say. But if older findings do turn out to be wrong, retraction may not be the best action to take. For instance, publications could add a link or annotation on the original study to the later study, Dr. Nosek says.\nA leading psychology journal, Psychological Science, last year implemented an initiative. It acknowledges when authors of a paper agree to share their data, in a push to reward transparency. There has been a “marked rise” in authors’ willingness to share their data and materials since the initiative began, says Eric Eich, the just-departed editor in chief of Psychological Science, and a psychology professor at the University of British Columbia.\nDr. Nosek’s group is working toward a partnership with Retraction Watch , a website that tracks when studies are retracted from journals.\nAnother group of researchers recently spurred controversy over an already contentious project, dubbed Study 329. It examined the effectiveness of the antidepressant Paxil, or paroxetine, in children and adolescents. An independent team of scientists published a reanalysis of the study based on the original data and disagreed with the conclusion of the original paper, which was published in 2001 .\nThe original study overstated the benefits of paroxetine and understated the harms, says David Healy, a professor of psychiatry at Bangor University in Wales, and one of the authors on the reanalysis. He has testified in lawsuits against GlaxoSmithKline , the manufacturer of the drug, about the safety of paroxetine.\n(Dr. Healy says his Study 329 research has received “no funding from a company or lawyer or any outside source.” He has served as a consultant to several drug companies through the years, including a company that later became a part of GSK.)\nENLARGE Adam Marcus, left, and Ivan Oransky, right, are co-founders of Retraction Watch, a website that keeps track of published academic studies that have been retracted. Photo: Ivan Oransky The authors of Study 329 say they stand by the way they conducted the study. Neal Ryan is a professor of child and adolescent psychiatry and clinical and translational science at the University of Pittsburgh and one of the study’s authors. He calls the re-evaluation of the study “biased.”\nDr. Healy, who has long spoken out about the safety risks of antidepressants in young people, responds, “Unquestionably everybody is biased. You shouldn’t be in the position where you need to trust me.” Rather, he says, the data should be available so people can judge for themselves whether they believe findings are valid or not.\nParoxetine, like other antidepressants in the class known as selective serotonin reuptake inhibitors, or SSRIs, was slapped with a black-box warning, the U.S. Food and Drug Administration’s strongest caution, initially in 2004 for its possible risk of increasing suicidal thoughts and behavior in children and adolescents.\nDr. Healy says the original paper should be retracted because the results are wrong. Having the paper remain publicly available means that a doctor or patient could come across it without knowing about what’s happened with the drug since then, and they could take the medicine and suffer harm.\nThe original study’s authors say the study shouldn’t be retracted because it was conducted properly.\n“Retraction is typically fraud or you completely screwed something up and it’s not right,” Dr. Ryan says.\nIn the original Study 329, Dr. Ryan says the paper accurately showed that paroxetine didn’t significantly improve depression on the primary outcome measure, a questionnaire that assessed depression, compared with a placebo. But other measures of depression in the study suggested that paroxetine benefited the participants, he says.\nThe analysis and reporting of side effects in the publication was “entirely comparable” to how side effects in other antidepressant studies were being analyzed and reported at the time, Dr. Ryan says.\nGlaxoSmithKline, which sponsored the original study and provided the detailed data from the trial to Dr. Healy’s team for the reanalysis, doesn’t believe the 2001 paper needs to be retracted because “we don’t believe the paper reflects anything other than the authors’ honestly held views at the time,” a GSK spokesman wrote in an email.\n“Clearly since then there has been a lot more learned about antidepressant use in paediatrics and the increased risk of suicidality,” the spokesman added.\nThe Committee on Publication Ethics, an authority that guides academic publishing, has set guidelines on retraction . The guidelines say journal editors should consider retraction if there is clear evidence that the findings are unreliable because of misconduct, such as fraud or honest error. Other reasons include plagiarism.\nThe editorial team of the Journal of the American Academy of Child and Adolescent Psychiatry, which published the 2001 study, “has reviewed allegations against study 329 several times over, and after thorough assessment, found no basis for editorial action regarding the 2001 article,” wrote Andres Martin, the editor in chief of the journal, in an email to the Academy membership on Sept. 25.\nOther experts in the field not connected to the studies also say reanalysis won’t change how doctors prescribe Paxil at this point. They argue most physicians who would prescribe it know about the widely publicized risk of suicidal thoughts.\nBut Harlan Krumholz, a Yale University cardiologist and professor who wasn’t involved with either of the 329 studies, says that the discrepancy between the original study findings and the reanalysis was striking enough to warrant further investigation.\n“For the benefit of the original authors, society, patients and the company, an in-depth investigation is needed to either exonerate them or demonstrate their misdeeds,” Dr. Krumholz wrote in an email. “They deserve a fair and impartial investigation of what happened—and so does the public.”\n“Regardless of the result, this is one of the strongest cases I have seen for open science and data sharing,” Dr. Krumholz says. “It cannot be that it takes more than a decade to enable a replication analysis.”\nWrite to Shirley S. Wang at shirley.wang@wsj.com", "external_links": ["http://retractionwatch.com/", "http://pss.sagepub.com/content/early/2013/11/25/0956797613512465.full", "http://publicationethics.org/files/retraction", "http://www.jaacap.com/article/S0890-8567(09)60309-9/abstract", "http://si.wsj.net/public/resources/images/BN-KP686_1005la_M_20151005104025.jpg", "http://si.wsj.net/public/resources/images/BN-KP685_1005la_M_20151005104025.jpg", "http://www.sciencemag.org/content/349/6251/aac4716", "http://www.bmj.com/content/351/bmj.h4320", "http://si.wsj.net/public/resources/images/BN-KP683_1005la_H_20151005104025.jpg", "http://si.wsj.net/public/resources/images/BN-KP686_1005la_H_20151005104025.jpg", "http://si.wsj.net/public/resources/images/BN-KP683_1005la_M_20151005104025.jpg", "http://si.wsj.net/public/resources/images/BN-KP683_1005la_P_20151005104025.jpg"], "published": "2015-10-05T23:47:00.000+03:00", "crawled": "2015-10-05T23:08:33.352+03:00", "highlightTitle": ""}