{"organizations": [], "uuid": "3547774408d07cb05030b8b7f32c513079fd6e7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510021584.html", "country": "US", "title": "South Africa: Ex-FNB Boss Invests in Wine Startup", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Ex-FNB Boss Invests in Wine Startup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:46:00.000+03:00", "replies_count": 0, "uuid": "3547774408d07cb05030b8b7f32c513079fd6e7f"}, "author": "", "url": "http://allafrica.com/stories/201510021584.html", "ord_in_thread": 0, "title": "South Africa: Ex-FNB Boss Invests in Wine Startup", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Duncan Alfreds"], "text": "By Duncan Alfreds \nFormer First National Bank CEO Michael Jordaan has announced an investment in local online wine retailer Port2Port. \nJordaan has invested an undisclosed amount in the startup. He tweeted the announcement through Montegray Capital, which is his startup investment vehicle. \nMeanwhile, Jordaan is also expected to take a directorship at Port2Port. \n\"Mr Jordaan's involvement is not limited to the financial but will more importantly include a mentorship role as a director of the company,\" Nicolò Stortiglione Pudel, spokesperson for Port2Port, told Fin24. \nPort2Port sells premium wines with its best sellers at over R200 per bottle. \n\"Having only launched nine months ago, it is thanks to an elaborate focus on offering a highly curated product catalogue and high-end digital platform that we've had great feedback from the industry and have already managed to attract a very loyal customer base. (Especially proud of our 45% returning customer rate),\" Pudel said. \nThe company will use Jordaan's cash to improve warehousing and logistics as well expand its range, said Pudel. \n\"Additionally the funding will be instrumental in developing our ever-evolving digital platform, which we are constantly curating to include more custom products, from Iranian Caviar and Champagne to Fine and Ultra Fine Spirits, Glassware and a number of other product ranges we are pursuing. Equally important will be the investment in greater marketing efforts and exposure.\" \nJordaan is a wine lover and retired to Stellenbosch following his tenure at FNB. \nSource: Fin24", "external_links": [], "published": "2015-10-02T17:46:00.000+03:00", "crawled": "2015-10-03T16:39:54.353+03:00", "highlightTitle": ""}