{"organizations": [], "uuid": "2470fcf07c5229eea87664d31ccfc5d2b5998029", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/ngex-announces-sale-49-interest-220000985.html", "country": "US", "title": "NGEx Announces Sale of Its 49% Interest in the GJ Project", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "NGEx Announces Sale of Its 49% Interest in the GJ Project", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T01:00:00.000+03:00", "replies_count": 0, "uuid": "2470fcf07c5229eea87664d31ccfc5d2b5998029"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ngex-announces-sale-49-interest-220000985.html", "ord_in_thread": 0, "title": "NGEx Announces Sale of Its 49% Interest in the GJ Project", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Oct 5, 2015, 23:18 BST - UK Markets closed NGEx Announces Sale of Its 49% Interest in the GJ Project Press Release : NGEx Resources Inc. – 18 minutes ago -0.03 Related Content VANCOUVER, BRITISH COLUMBIA--(Marketwired - Oct 5, 2015) - NGEx Resources Inc. (\"NGEx\" or the \"Company\") ( NGQ.TO )( NGQ.ST ) is pleased to announce that NGEx and Teck Resources Limited (\"Teck\") have entered into an agreement (the \"Purchase Agreement\") to sell their respective interests in the GJ copper-gold project (the \"GJ Project\") located in northwest British Columbia, Canada to Skeena Resources Limited (TSX VENTURE: SKE ) (\" Skeena \"). NGEx holds an undivided 49% interest in the GJ Project and Teck holds an undivided 51% interest in the GJ Project. \nUnder the terms of the Purchase Agreement which is subject to TSX Venture Exchange approval, Skeena will acquire 100% of the GJ Project in return for the following consideration: $1.5 million payable on closing, with $500,000 payable in cash and $1.0 million payable by the issuance of Skeena common shares having a market value of $1,000,000 (market value to be based on a 10- day volume weighted average Exchange trading price); $1.5 million payable by the issuance of Skeena common shares on or before the 2nd anniversary of the closing; $1.5 million payable by the issuance of Skeena common shares on or before the 5th anniversary of the closing; and $4.0 million payable in cash within 45 days of commercial production from the GJ property. \nNGEx will receive 49% of all proceeds from the sale including a 49% share of the retained royalties as discussed below. \nNGEx and Teck will retain a 2% Net Smelter Return (NSR) Royalty on the GJ Block which contains the GJ Resource of which 1% can be purchased for $2 million. Teck and NGEx will retain a 1% NSR on the Northern Block of Claims of which 0.5% can be purchased for $1 million. Teck and NGEx's royalties will be held under separate royalty agreements in favour of Teck and NGEx respectively. As such, NGEX will hold a 0.98% NSR on the GJ Block and a 0.49% NSR on the Northern Block. \nNGEx continues to focus on its core South American copper-gold projects including Los Helados, Josemaria, and Filo del Sol. This transaction is part of the Company's continuing effort to rationalize its portfolio and to realize value from its non-core projects. \nAbout NGEx \nNGEx is a Canadian mineral exploration company with exploration projects in Chile, Argentina, and Canada. The Company's shares are listed on the Toronto Stock Exchange and Nasdaq Stockholm under the symbol \"NGQ\". The Company's focus is on advancing its South American projects which include several large copper-gold systems including the Josemaria, Los Helados, and Filo del Sol projects, located on a land package that the Company holds in Chile's Region III and adjacent San Juan Province, Argentina. Los Helados is part of a joint venture in which the Company holds 60% and Pan Pacific Copper Co., Ltd. holds 40%. Josemaria is part of a joint venture in which the Company holds 60% and Japan Oil, Gas, and Metals National Corporation (JOGMEC) owns 40%. In addition, NGEx holds a 100% interest in Filo del Sol amongst an extensive portfolio of other 100% owned early stage exploration projects located in Chile and Argentina. \nOn behalf of the board \nWojtek Wodzicki, President and CEO \nAdditional Information \nThe information in this release is subject to the disclosure requirements of NGEx Resources under the Swedish Securities Market Act and/or the Swedish Financial Instruments Trading Act. This information was publicly communicated on October 5, 2015 at 3:00 p.m. Pacific Time. \nCautionary Note Regarding Forward-Looking Statements \nThis news release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation, concerning the business, operations and financial performance and condition of NGEx Resources Inc. Forward-looking information includes, but is not limited to, statements with respect to the closing of the agreement and timing of future payments with regards to the sale of the GJ Project. Generally, this forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\" or the negative connotations thereof. All such forward-looking information is based on the opinions and estimates of the relevant management as of the date such statements are made and are subject to important risk factors and uncertainties, many of which are beyond the Company's ability to control or predict. \nForward-looking information is necessarily based on estimates and assumptions that are inherently subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: risks and uncertainties relating to, among other things, the inherent uncertainties regarding cost estimates, changes in commodity prices, currency fluctuation, financing, unanticipated resource grades, infrastructure, results of exploration activities, cost overruns, availability of materials and equipment, timeliness of government approvals, taxation, political risk and related economic risk and unanticipated environmental impact on operations as well as other risks and uncertainties described under \"Risks Factors\" in the Company's Annual Information Form available under the Company's profile at www.sedar.com and the Company's website. \nAlthough the Company has attempted to identify important factors that would cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated, or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. All of the forward-looking information contained in this document is qualified by these cautionary statements. Readers should not place undue reliance on forward-looking information. \nForward-looking information is provided for the purpose of providing information about management's current expectations and plans and allowing investors and others to get a better understanding of the Company's operating environment. These factors are not, and should not be construed as being, exhaustive. Statements relating to \"mineral resources\" are deemed to be forward-looking information, as they involve the implied assessment, based on certain estimates and assumptions that the mineral resources described can be profitably produced in the future. The forward-looking information contained in this press release is expressly qualified by this cautionary statement. The Company expressly disclaims any intention or obligation to update or revise any forward-looking information whether as a result of new information, events or otherwise, except in accordance with applicable securities laws. Contact:", "external_links": [], "published": "2015-10-06T01:00:00.000+03:00", "crawled": "2015-10-06T01:18:19.134+03:00", "highlightTitle": ""}