{"organizations": [], "uuid": "df5a7ba06a2604d9cb09f08eaad3ffb98a2dc048", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-10/10/full/1444499731-2756.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss#", "section_title": "Finance", "url": "http://www.business-standard.com/article/companies/cbi-raids-bank-of-baroda-branch-for-rs-6-000-crore-forex-violations-115101000945_1.html", "country": "IN", "title": "CBI raids Bank of Baroda branch for Rs 6,000-crore forex violations", "performance_score": 0, "site": "business-standard.com", "participants_count": 3, "title_full": "CBI raids Bank of Baroda branch for Rs 6,000-crore forex violations | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 2, "uuid": "717f8ff12569b8ed355cb9a1330611d205db72da"}, "author": "BS Reporters", "url": "http://www.business-standard.com/article/companies/cbi-raids-bank-of-baroda-branch-for-rs-6-000-crore-forex-violations-115101000945_1.html#post-0", "ord_in_thread": 0, "title": "CBI raids Bank of Baroda branch for Rs 6,000-crore forex violations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Central Bureau of Investigation (CBI) on Saturday raided Bank of Baroda (BoB)'s branch in Ashok Vihar, New Delhi, for alleged foreign exchange violations. Two other premises were also searched - the residences of two bank officials allegedly involved in the case.\n\nA CBI spokesperson said the agency had registered a case against 59 current account holders and unknown bank officials on a complaint by Bank of Baroda.\n\nThe case is being jointly investigated by the CBI, the Enforcement Directorate and the Serious Fraud Investigation Office.\n\n\"It was alleged 59 current account holders and unknown bank officials conspired to send overseas remittances, mostly to Hong Kong, of foreign exchange worth about Rs 6,000 crore in an illegal and irregular manner, in violation of established banking norms, under the garb of payments towards suspected non-existent imports,\" read a CBI statement.\n\nThe bank, on its part, has suspended two officials for allegedly being involved in Rs 6,172-crore illegal foreign exchange transactions.\n\nThe case has also led to political mudslinging, with the Opposition Congress tearing into the central government. Former Union minister and Congress leader R P N Singh said, \"In one and a half years the prime minister and his government were able to get back only Rs 4,144 crore of black money and from one bank alone, Rs 6,172 crore has gone out. This could not have been done without somebody (powerful) knowing about it. The PM makes tall speeches about no scandals in his regime and about checks and balances in place. This belies his claims.\"\n\nThe bank's executives said the event had caused reputational loss, adding the lender was internally investigating a failure of information technology systems to put up alerts for such high-value transactions.\n\nThe unearthing of the alleged scam comes at a time P B Jayakumar is slated to take charge as BoB's chief executive and managing director on Tuesday (October 13). In August, Jayakumar, a former Citibank executive, was picked for the post from private sector firm VBHC Value Homes, where he was managing director and chief executive.\n\nThe bank had been without a full-time CEO for 14 months and this had hit operations, including monitoring, officials said. Currently, BoB has only one full-time executive director, B B Joshi.\n\nRanjan Dhawan, former managing director and CEO in-charge, retired from the post on September 30. The last full-time CMD was S S Mundra, who took charge as Reserve Bank of India (RBI) deputy governor in July.\n\nIn August, K V Rama Moorthy, another executive director, was abruptly moved to Kolkata-based United Bank of India.\n\nBoB executives said in the recent past, some episodes had hit the bank's image. First, RBI had approved a 70-million dirham loan to the troubled Atlas Jewellery Group by the bank's Dubai branch. Following this, the government transferred executive director K V Rama Moorthy, as he was heading the Dubai branch at that time. Had he stayed with the bank, it could amount to conflict of interest, RBI had told the government.\n\nIn addition, there was an alleged bill-discounting scam in Gujarat. Early this month, the bank had detected Rs 350 crore of irregularities in bill discounting - though the bills were discounted, the payment is pending.\n\nAn internal investigation by the bank showed Rs 6,172 crore was sent from India to Hong Kong for the import of cashews, pulses and rice, but nothing was imported and the money was deposited in 59 bank accounts of several companies.\n\nFor the transaction, bank officials did not take proforma invoices and no documents were obtained showing whether the goods were received from Hong Kong or not, it was said.\n\nIt came to the notice of the bank that in 2014-15, its Ashok Vihar branch recorded unusually high forex transactions of Rs 21,528 crore, against Rs 45 crore in 2013-14, primarily due to advance remittances for imports by newly opened current accounts. Between August 1, 2014, and August 12, 2015, 8,667 transactions were conducted.\n\nIn one case, a company had made 408 remittances amounting to Rs 170 crore. The total remittances from the branch amount to Rs 6,172 crore.\n\nIn one of the \"major irregularities\" noticed by the bank, Rs 451,67,550 was transferred from a customer account and credited to an office account to make the balance 'nil' on July 14 this year. The bank noted the same company \"hadn't made any remittances through our Ashok Vihar branch\". It added such entries were taking place on a daily basis.\n\nAfter an inspection, the bank found there were 245 manual entries of suspicious nature in the Consul Office account since December 2014. Even when customer accounts did not have sufficient balances, advance remittances were made.\n\nFor instance as on April 24 this year, the opening balance for a company was Rs 123.35 lakh; the account was credited Rs 392.62 lakh but the amount it transferred was Rs 1,124.66 lakh. The amount transferred from the office account was Rs 623.15 lakh.\n\nCiting several such examples, the inspection report stated the matter should be investigated in detail.\n\nWHAT BoB’S INTERNAL AUDIT SHOWED Though Rs 6,172 cr was sent from India to Hong Kong for import of cashews, pulses and rice, nothing was imported\n  In FY15, its Ashok Vihar branch in New Delhi recorded unusually high forex transactions of Rs 21,528 cr\n  In one case, a company had made 408 remittances, amounting to Rs 170 cr\n  There were 245 manual entries of suspicious nature in the Consul Office account since December 2014", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-11T11:00:06.166+03:00", "highlightTitle": ""}