{"organizations": [], "uuid": "cffec69d004401895e8a8ec76cdab8755d6b6233", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/22/590x/talktalk-614580.jpg", "site_section": "http://www.express.co.uk/posts/rss/21/finance", "section_title": "Daily Express :: Finance Feed", "url": "http://www.express.co.uk/finance/city/614580/boss-not-quitting-TalkTalk-cyber-attack", "country": "IE", "title": "I won’t quit, says boss after TalkTalk cyber attack", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "I won’t quit, says boss after TalkTalk cyber attack", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T22:20:00.000+02:00", "replies_count": 0, "uuid": "cffec69d004401895e8a8ec76cdab8755d6b6233"}, "author": "", "url": "http://www.express.co.uk/finance/city/614580/boss-not-quitting-TalkTalk-cyber-attack", "ord_in_thread": 0, "title": "I won’t quit, says boss after TalkTalk cyber attack", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dido Harding"], "text": "I won’t quit, says boss after TalkTalk cyber attack I won’t quit, says boss after TalkTalk cyber attack THE chief executive of TalkTalk said last night she had no intention of stepping down after last week’s cyber attack and maintained bank accounts had not been plundered as a result. PUBLISHED: 20:20, Sun, Oct 25, 2015 | UPDATED: 20:40, Sun, Oct 25, 2015 GETTY TalkTalk chief Dido Harding is not quitting after last week’s cyber attack \nDido Harding said the scale of the attack was not as large as first believed but that despite this, the company took the “big decision” last Thursday to warn all their customers. \nShe said: “The good news is that we can allay some of their fears.” \nTalkTalk revealed that no unprotected credit card information was stolen and “customers don’t need to worry that criminals will be using their credit cards, because they can’t”. \nThe huge data hack is believed to have been launched by a jihadi group. Related articles We must learn from TalkTalk: More must be done to protect us from... \nHarding has faced calls to resign but last night she said: “At the end of the day our customers will make that decision. At the moment I am totally focused trying to do what is right for our customers. \n“If you looked at my inbox you would see, aside from the very large number of cyber security experts offering their assistance… a large number of customers who are angry and frustrated with TalkTalk and with me. \n“But you would see a surprising number who are saying thank you for being so open and honest. \n“I think our customers will judge TalkTalk and all of our leadership and not just me, by how we handle and manage this and look after them through this crime, rather whether or not this crime happened.” GETTY Experts have warned that other fraudsters will also attempt to hijack victims information \nWhen asked about customers who have been told they will have to pay if they want to leave, she said the company would “deal with customers on a case-by-case basis”. \nReferring to compensation she said: “At this stage I can’t tell you who has been affected and who hasn’t and I can’t tell you specifically what the scale of harm is. At the moment I am totally focused trying to do what is right for our customers Chief executive of TalkTalk, Dido Harding \n“What we will do is treat customers on a case-by-case basis. So if they think they are out of pocket today, they should contact us. \n“We are very happy to have this conversation. This exercise of communication from us is to make sure we will look after our customers. \n“We, and they, are victims of a crime. It’s not a breach, it’s a crime, it’s an attack. And we want to make sure they are looked after but we have to do this on a case-by-case basis.” \nShe said claims that millions of pounds have gone from bank accounts “were extreme and inflammatory” and that it was not possible with the information that was accessed. GETTY TalkTalk chief Dido Harding maintained bank accounts had not been plundered GETTY TalkTalk has over four million customers in the UK \nThe company has announced it is offering customers 12 months of free alerts so a reference agency will tell them of any significant change to their credit. \nIt comes as customers face the threat of fraudulent applications for credit cards or loans which would hit credit ratings. \nThe company said it is writing to all its four million customers but reminded them it “will never call and ask to provide personal details or passwords”. \nShares fell on Friday 10.7 per cent to 239.7p but recovered later. Related articles", "external_links": [], "published": "2015-10-25T22:20:00.000+02:00", "crawled": "2015-10-26T00:45:22.773+02:00", "highlightTitle": ""}