{"organizations": [], "uuid": "ccd1dcc9a2fba00d10fef63603e7b972d8ddfdaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/02/Budget-savings.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/banking-finance/rbi-rate-cut-after-effects-small-savings-to-feel-the-squeeze/149076", "country": "IE", "title": "RBI rate cut after-effects: Small savings to feel the squeeze", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "RBI rate cut after-effects: Small savings to feel the squeeze | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T20:13:00.000+03:00", "replies_count": 0, "uuid": "ccd1dcc9a2fba00d10fef63603e7b972d8ddfdaa"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/rbi-rate-cut-after-effects-small-savings-to-feel-the-squeeze/149076", "ord_in_thread": 0, "title": "RBI rate cut after-effects: Small savings to feel the squeeze", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles CBI searches Bank of Baroda branches for Rs 6,100 crore suspected black money transfer Indian rupee firms up against the US dollar, surges 77 paise to close at 8-week high at 64.74 Base rate to come down next week: Romesh Sobti, Managing Director & CEO, IndusInd bank The government’s announcement that interest rates offered by a range of small saving schemes would be reviewed in the wake of the RBI repo rate cut has reignited the debate on the impact that such schemes have on the lending rates of banks. Experts, however, are clear. Going forward, those investing in small savings scheme should be prepared for a lower-interest-rate regime as inflation takes a slide and banks prune their lending rates commensurately.\nEven though rates on small saving schemes have been linked to yields on government securities of comparable maturity, experts said that the interest rates on these savings need to be rationalised to reflect the economic shift in wake of declining inflation. The consumer price index (CPI) stood at 3.66 per cent during the month. This is within the comfort zone of Reserve Bank of India, which has set a target of 6 per cent for 2016.\nThe banks have for long been arguing that the transmission of monetary policy easing has not happened so far due to high small savings rates. The RBI has reduced rates by 125 bps to a four-and-a-half-year low of 6.75 per cent while banks have transmitted only up to 70 bps in their base rate. This is because, banks argue, high rates on small savings schemes run by the government make their fixed deposits uncompetitive and in turn does not allow them to reduce the cost of borrowing.\nWhile the leading banks are currently offering 7-8 per cent interest rate on a five-year fixed deposit of less than Rs 1 crore, small savings command rate ranging between 8.4-9.3 per cent, making it difficult for banks to reduce deposit rates. Hence, the reluctance to transmit the policy rate cut by RBI to borrowers.\n“The weak transmission until recently has led to the banks citing higher small savings rate as one of the key hindrances for them to lower their deposit rates that, in turn, will allow them to lower the lending rates. Small savings directly compete with bank deposits for household savings. The deposit growth has been correcting sharply since FY15 essentially due to negative real rates of return. Remember, consumer inflation had stubbornly remained elevated between 8-10 per cent during FY11 to FY14. Since January 2014, the real rate has turned positive, which with a lag will support deposit growth. With improved alignment of small savings rate to market rates, banks will be better place for lowering their deposit rates without seriously affecting mobilisation,” Shubhada Rao, chief economist, Yes Bank, told The Indian Express, adding that banks are the largest intermediaries of domestic savings.\nSmall saving schemes and rationalisation\nIn July 2010, the government had constituted an expert committee led by RBI’s then deputy governor Shyamala Gopinath for a comprehensive review of the National Small Savings Fund (NSSF), which includes Post Office savings account, Post Office time deposits ( 1,2,3 and 5 years), Post Office recurring deposits, Post Office monthly account, senior citizens savings scheme, National Savings Certificate ( VIII-Issue and IX-Issue), Public Provident Fund, Kisan Vikas Patra and Sukanya Samriddhi Account.\nIt was asked to review the existing parameters for the small saving schemes in operation and recommend steps to make them more flexible and market linked. Among other things, the committee recommended benchmarking the interest rates on small savings schemes to the yield on government bonds with a spread of 25 basis points, to be revised annually.\nHowever, the time has come where small savers should be prepared to get lower returns on their deposits, Rajiv Kumar, former secretary general of Ficci, who was a part of the Gopinath Committee, said that. “Government can’t and should not offer such high rates. The notion that small savers are from deprived section is misplaced. The scale does not matter, the margin does,” he said while ruling out any impact of the reduction in rates on the savings behaviour of people.\nAccording to the government data, while the outstanding balance under all National Savings Schemes and Saving Certificates in Post Office stood at over Rs 6,15,021.56 crore as on March 31, 2014, aggregate bank deposits were Rs 77,05,560 crore in the same period. The aggregate bank deposits stood at Rs 85,33,290 crore in 2014-15.\nImpact of review on small savers\nMadan Sabnavis, chief economist, CARE ratings, cautioned that the overall savings behaviour of people may get impacted if the rates are lowered. “If you look at small savings, they have not been moving up. Funds don’t get transferred from one bank to the other only on the basis of high rates. Small savings is more of a rural phenomenon. Banks feel disadvantaged because of the high rates offered by the small savings scheme but I don’t think that is happening. Rationalisation is though needed as there are schemes with no limits and the government is paying higher cost,” he said.\nAnother fallout, as pointed out by Abizer Diwanji, partner and national leader, financial services, EY, is that if the rates are revised downwards, people investing in such schemes may get lured by dubious or ponzi schemes that promise to offer astronomical returns. However, financial inclusion is unlikely to be adversely impacted as it is behaviour driven and not rate driven.\n“This indicates that the government does not want people to save rather they want them to spend. The government wants the country to move towards consumer economy. What incentives will people have if they reduce the rates,”\nCPI leader and Rajya Sabha member D Raja said. DL Sachdev, national secretary, All India Trade Union Congress said: “We will not allow the finance minister to intervene in interest rates at the level of employees’ provident fund.”\nThe way forward\nThe government has budgeted Rs 22,408 crore from small savings to meet its budget deficit. Also, reducing the rates significantly will not be easy as it may channelise the money into gold and real estate, leading to generation of black money . While the small savings schemes may give lower returns going forward, people would still have options to invest in tax-free bonds and corporate deposits which offer stable and higher rates, financial planner Vishal Dhawan said.\nHe added that those investing in these schemes need stability and predictability and corporate deposits fit into their needs.\n 10, 2015 12:13 pm", "external_links": [], "published": "2015-10-10T20:13:00.000+03:00", "crawled": "2015-10-10T15:30:44.418+03:00", "highlightTitle": ""}