{"organizations": ["Former Infosys CFO V Balakrishnan"], "uuid": "81d9da2d1cc6dd4cb7ba090472c7bf35bf0cf502", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oneindia.com", "main_image": "http://www.oneindia.com/img/2014/04/06-balakrishnan-infosys-600.jpg", "site_section": "http://news.oneindia.in/rss/news-business-fb.xml", "section_title": "India Business News, Latest Finance News Headlines, Indian Stock Market & economic news", "url": "http://www.oneindia.com/business/former-infosys-cfo-v-balakrishnan-joins-chennai-firm-1902732.html", "country": "IN", "title": "Former Infosys CFO V Balakrishnan joins Chennai firm", "performance_score": 0, "site": "oneindia.com", "participants_count": 0, "title_full": "Former Infosys CFO V Balakrishnan joins Chennai firm", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:51:00.000+03:00", "replies_count": 0, "uuid": "81d9da2d1cc6dd4cb7ba090472c7bf35bf0cf502"}, "author": "", "url": "http://www.oneindia.com/business/former-infosys-cfo-v-balakrishnan-joins-chennai-firm-1902732.html", "ord_in_thread": 0, "title": "Former Infosys CFO V Balakrishnan joins Chennai firm", "locations": ["Chennai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Balakrishnan"], "text": "Former Infosys CFO V Balakrishnan joins Chennai firm Published: Sunday, October 18, 2015, 10:21   \nChennai, Oct 18: Former chief financial officer of IT major Infosys Ltd V Balakrishnan on Friday joined city-based digital consultancy firm Kaar Technologies as an independent director. \nA veteran in the information technology sector, Mr Balakrishnan would also head audit committee of Kaar Technologies, its chairman and CEO Maran Nagarajan said. V Balakrishnan \n\"We are happy to welcome Bala. He joined the Board today,\" Mr Nagarajan told reporters here. \nThe company hopes to maintain the current CAGR (compound annual growth rate) of over 50 per cent and clock Rs 1,000 crore revenue by 2020, Mr Nagarajan said, adding that Mr Balakrishnan's rich experience from Infosys would be utilized for growth of Kaar Technologies in the digital space. \n\"We are growing exponentially. Our CAGR grew by 50 per cent over the last few years. We hope to maintain that growth and aim to reach Rs 1,000 crore revenue by 2020\", he said. \nTo a query he said the company also hopes to go public by 2020. \n\"We are planning to become public listed company by then (2020)\", he said, adding that the company also requires to raise funds. \n\"Predominantly the funds raised would be for geographic expansion of the company,\" Mr Nagarajan said. \nThe board is yet to decide on the funds to be raised, he added. \nExpressing happiness on joining Kaar Technologies, Mr Balakrishnan said that out of the $140 billion industry in the IT space, $100 billion comes from the services sector. \n\"I hope the next $100 billion would come from specialised sectors like the high-end consultancy firms and technology companies,\" he said. \n\"I am very happy to join the Board of Kaar Technologies. I hope this will be one of the success stories that comes out of Chennai,\" he added. \nOn the occasion, Kaar Technologies also announced that its board has decided to allot five per cent of the entire equity to the employees. \nThe company, which has a global presence, clocked Rs 130 crore in revenue last year and expects to register Rs 175 crore this year, Mr Nagarajan said. \nPTI", "external_links": [], "published": "2015-10-18T07:51:00.000+03:00", "crawled": "2015-10-18T09:54:01.542+03:00", "highlightTitle": ""}