{"organizations": ["DSM", "Facebook"], "uuid": "41dae91be10005401b8d71cc38c391721c124206", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510121733.html", "country": "US", "title": "Tanzania: Arrested for Wearing Seatbelt", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Tanzania: Arrested for Wearing Seatbelt", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:10:00.000+03:00", "replies_count": 0, "uuid": "41dae91be10005401b8d71cc38c391721c124206"}, "author": "", "url": "http://allafrica.com/stories/201510121733.html", "ord_in_thread": 0, "title": "Tanzania: Arrested for Wearing Seatbelt", "locations": ["Nigeria", "Tanzania"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: Stakeholders Set New Agenda for Customs Reform I was arrested by a police officer when we were re fueling at one petrol station in the city centre. The Police had come and started questioning me and my driver on where we were coming from. We answered him but strangely he said I had committed an offence for wearing a seatbelt whilst fueling my vehicle. I refused to go to the police station and was put under arrest. Is it necessary to remove your seatbelt when filling fuel in your vehicle? XR, DSM The law which obliges wearing of seatbelts is the Road Traffic Act. Section 30 of this law requires that no person shall drive a motor vehicle or any other vehicle unless that person and any front seat passenger in that motor vehicle is securely wearing a seatbelt. We have searched all over and have not found any specific law that states one should remove their seatbelt when fueling their vehicle. There are such laws in other countries, and our research reveals that it is generally good practice to do so as you can jump out of the car faster in case of a fire, but in Tanzania this is the first time we are hearing of this. Unless there were other facts that you have hidden from us, you cannot be arrested for wearing a seatbelt when fueling. Rumour on facebook A young friend of mine posted on facebook a rumour that she thought was true about a certain politician who is unfit to hold office for certain moral reasons. Surprisingly she has been getting threats and calls from security personal who want to know where she is located as they want to question her. She has run away to an upcountry town. Facebook is a place of joy, nothing serious. Is our freedom of speech curtailed? EH, Dar The recently enacted Cyber Crimes Act 2015 has some onerous provisions one of which is section 16 that makes it an offence to publish any information or data in a computer system knowing that such information or data is false, deceptive, misleading or inaccurate, and with intent to defame, threaten, abuse, insult, or otherwise deceive or mislead the public. We believe your friend has published information which is false but we are unsure if the intent as provided for under section 16 is present. This offence is punishable by a fine of 5 million shillings or to imprisonment of not less than 3 years, or both. It does not matter that facebook is a leisurely website. It has the capacity to do a lot of damage and this law has been enacted to address this. This applies to all facebook, twitter and other similar website users, including WhatsApp, whereby if you publish something along the lines you stated, there are high chances state security organs can arrest and charge you. This is the law and whether it is unconstitutional or not can be debated, but as of todate you must abide by it. The Cyber Crimes Act also provides another section whereby if you initiate or send, whether you are the originator or not, any e mail to another person to intimidate, harass or cause emotional distress to that person, you can also be imprisoned. So be careful what e mails you forward to people as you might end up unknowingly in jail. Cessation of business by foreign company We are a foreign company in Tanzania supplying the mining sector and have encountered intolerable red tape. We have to go to multiple bodies for multiple approvals and there is no interdepartmental communication within the government. Overall the investment climate has deteriorated and it is clear that Tanzanians don't want foreign investment. We are a branch office under a certificate of compliance and wish to close our office in Tanzania. How do we go about this? GR, Dar It is sad that you encountered such challenges. We suggest you contact the Tanzania Investment Centre which may be able to assist as Tanzania is welcoming investors to come invest here. It is a land of opportunities, but you are right, there have been, of late, a number of complaints against bureaucracy within Government departments. As for the relevant law applicable upon cessation of business by a foreign company in Tanzania, the Companies Act caters for your queries. Section 441 of the Companies Act provides a way forward and states that if any foreign company ceases to have a place of business in Tanzania it shall immediately give notice in writing of the fact to the Registrar for registration and as from the date on which notice is so given the obligation of the company to deliver any document to the Registrar shall cease and the Registrar shall strike the name of the company off the register. Furthermore, where the Registrar has reasonable cause to believe that a foreign company has ceased to have a place of business in Tanzania, he may send by registered post to the person authorized to accept service on behalf of the company and, if more than one, to all such persons, a letter inquiring whether the company is maintaining a place of business in Tanzania. If the Registrar receives an answer to the effect that the company has ceased to have a place of business in Tanzania or does not within three months receive any reply, he may strike the name of the company off the register. Another point worthy noting is that where the name of a foreign company is struck off the register, it shall within three months of the date of striking off, dispose of all land held by it in Tanzania by virtue of section 435, and if any such land is held by the company at the expiration of such period of three months, such land shall be deemed to be bona vacantia and shall accordingly belong to the Government. Failure to comply with the foregoing, the company and every officer or agent of the company who knowingly and willfully authorizes or permits the default, shall be liable to a fine, or in the case of a continuing offence, a default fine. Tanzania \nMALE chauvinism in Rombo district has been the main problem for women who deserve to acquire inheritance once their … see more » Copyright © 2015 Tanzania Daily News. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-12T14:10:00.000+03:00", "crawled": "2015-10-12T21:50:54.051+03:00", "highlightTitle": ""}