{"organizations": [], "uuid": "00fa1473f1cf5b1efc755da6df1de9a4e621576e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/d5cotfOMg72flUNP.VEWrQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-21T033214Z_2_LYNXNPEB9J1JQ_RTROPTP_3_JAPAN-ECONOMY-TRADE_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/japan-export-growth-slows-sharply-033214753.html?l=1", "country": "GB", "title": "Japan export growth slows sharply, raising fears of recession", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Japan export growth slows sharply, raising fears of recession - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 5, "uuid": "00fa1473f1cf5b1efc755da6df1de9a4e621576e"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/japan-export-growth-slows-sharply-033214753.html?l=1", "ord_in_thread": 0, "title": "Japan export growth slows sharply, raising fears of recession", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nWorkers load containers onto trucks from a cargo ship at a port in Tokyo, Japan, October 20, 2015. REUTERS/Toru Hanai By Tetsushi Kajimoto\nTOKYO (Reuters) - Japan's annual export growth slowed to a crawl in September as slumping sales in China shrank the volume of shipments, raising fears that weak overseas demand may have pushed the economy into recession. \nMinistry of Finance data showed exports rose just 0.6 percent in the year to September, against a 3.4 percent gain expected by economists in a Reuters poll. \nThat was the slowest growth since August last year, following the prior month's 3.1 percent gain. The weak yen helped increase the value of exports, but volume fell 3.9 percent, the third straight month recording an annual decline.\nWednesday's data was the first major indicator for September and is part of the calculation of third quarter gross domestic product. A third quarter contraction would put Japan into recession, following the second quarter's negative GDP result.\n\"Given this data, the economy probably contracted about an annualized 0.5 percent in July-September. External demand, capital spending and inventory investment were a likely drag, while consumption picked up,\" said Koya Miyamae, senior economist at SMBC Nikko Securities.\nChina's slowdown and soft domestic demand weighed on factory output and the broader economy, although the Bank of Japan saw the effects of China's slowdown as limited for now, sticking to its rosy growth outlook.\nStill, weak indicators will keep the central bank under pressure to ease policy again to hit its ambitious 2 percent inflation target next year.\nSome analysts expect the BOJ to move at its Oct. 30 monetary meeting, when it also issues long-term economic and price projections.\n\"Weak exports were within the BOJ's expectations so this data alone could not be a trigger. But there's no doubt that pressure will mount on the BOJ to act if weakness persists,\" said Taro Saito, senior economist at NLI Research Institute.\nSaito said the third quarter GDP outcome is likely to be largely flat or slightly negative, depending on the strength of data such as factory output and household spending due next week.\n\nCHINA SYNDROME HITS TRADE POWERHOUSES \nChina's economic growth has dipped below 7 percent for the first time since the global financial crisis, despite a barrage of stimulus measures.\nFlow-on effects of the slowdown are spreading though Asia, with South Korean exports tumbling while Taiwan's export orders continued to slide recently, sapping Asia’s trade powerhouses.\nAnalysts worry that a China-led global slowdown could drag down the Japanese economy, keeping Tokyo under pressure to deploy fresh monetary and fiscal stimulus in coming months.\nA Japanese finance ministry official said: \"We must pay the utmost attention to China.\"\nExports to China fell 3.5 percent in September from a year earlier, down for a second straight month on falling shipments of light oil and car parts.\nShipments to Asia - which account for about a half of Japan's overall exports - fell 0.9 percent in the year to September. That was the first decline in seven months.\nExports to the United States, a major buyer of Japanese products, rose 10.4 percent in September, led by shipments of cars. In volume terms, U.S.-bound exports fell 4.7 percent.\n($1 = 119.8800 yen)\n\n(Reporting by Tetsushi Kajimoto; Editing by Eric Meijer)\nBudget, Tax & Economy Japan", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T08:57:46.693+03:00", "highlightTitle": ""}