{"organizations": [], "uuid": "89ad72286f6861def3a16f56752e12486cb4d534", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/neighbour-cut-down-tree-sue-121557396.html", "country": "US", "title": "'My neighbour cut down my tree. Can I sue for damages?'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "'My neighbour cut down my tree. Can I sue for damages?'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:15:00.000+03:00", "replies_count": 0, "uuid": "89ad72286f6861def3a16f56752e12486cb4d534"}, "author": "", "url": "https://uk.finance.yahoo.com/news/neighbour-cut-down-tree-sue-121557396.html", "ord_in_thread": 0, "title": "'My neighbour cut down my tree. Can I sue for damages?'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Oct 21, 2015, 07:30 BST - UK Markets open in 30 mins. 'My neighbour cut down my tree. Can I sue for damages?' By Nicole Blackmore | Telegraph – 18 hours ago 0.00 \nAsk (LSE: 0QVN.L - news ) an expert: How to settle a property dispute without involving lawyers \nMy neighbour has leant over our 5ft wall and cut down the mature tree at the bottom of my garden without consultation or consent. I was on holiday at the time and he dumped the remains in my garden. \nMy garden is a small one, in the middle of a street of Victorian terraced homes in London. The tree provided complete privacy from overlooking properties and a home to nesting birds. \nHe is not answering my phone calls but has replied to my text messages claiming that the tree was in his garden, which is clearly untrue. \nWhat are my legal rights? Can I ask that he covers the cost of a replacement mature tree and any associated clearing and planting costs? LB, via email \nDisputes with neighbours are often difficult and can be emotionally charged. Legal costs can far exceed the actual sums concerned. Your best option here is to try to settle the disagreement between yourselves, or through a mediator, before referring the matter to the courts. \nWhen you come to sell your property the details of this dispute will have to be disclosed, so it will also be useful to show that the disagreement has been resolved. \nAndrew Tugwell, head of property disputes at Payne Hicks Beach solicitors, said your neighbour had rights to trim trees that cross the property boundary, but only up to the boundary. If he has cut branches or removed a tree on your property then this is trespass and you have a claim for damages covering the cost of a replacement mature tree, clearing and planting. \nYour neighbour might argue that the tree had damaged his wall or a jointly owned wall. Damage caused by tree roots could be an issue, but would not give your neighbour the right to cut down your tree. \n“Invite your neighbour to agree that the tree was on your land as a first step, or to justify any alternative view,” Mr Tugwell said. “Obtain one or more estimates for replanting and ask your neighbour to agree to pay the costs and to confirm that they will not trespass again. \n\"I would warn your neighbour that if he does not agree, you will seek a declaration from the court as to the correct boundary and to recover your replanting costs.” \nTo show that the dispute has been resolved, you could ask your neighbour to sign and return a plan with the correct boundary shown with a red line. It’s also a good idea to ask him to sign a copy of the estimate, showing his approval to pay costs. The Land Registry recognises agreements documented between parties concerning boundaries. \nThe Royal Institution of Chartered Surveyors offers free advice concerning boundary disputes and can recommend experts to assist. \nHave a question for our experts? Email moneyexpert@telegraph.co.uk \n...answers are included in our weekly newsletter: click here and enter your email", "external_links": [], "published": "2015-10-20T15:15:00.000+03:00", "crawled": "2015-10-21T10:30:23.336+03:00", "highlightTitle": ""}