{"organizations": ["Burberry Group plc", "Winners Antofagasta plc", "ARM Holdings plc & Rolls-Royce Holding PLC"], "uuid": "6cb270cfec97952459d56261824392d212a7ac07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/last-week-winners-antofagasta-plc-123755090.html", "country": "GB", "title": "Have Last Week’s Winners Antofagasta plc, Burberry Group plc, ARM Holdings plc & Rolls-Royce Holding PLC Got Further To Rise?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Have Last Week’s Winners Antofagasta plc, Burberry Group plc, ARM Holdings plc & Rolls-Royce Holding PLC Got Further To Rise?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T14:37:00.000+02:00", "replies_count": 0, "uuid": "6cb270cfec97952459d56261824392d212a7ac07"}, "author": "", "url": "https://uk.finance.yahoo.com/news/last-week-winners-antofagasta-plc-123755090.html", "ord_in_thread": 0, "title": "Have Last Week’s Winners Antofagasta plc, Burberry Group plc, ARM Holdings plc & Rolls-Royce Holding PLC Got Further To Rise?", "locations": ["Antofagasta"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Today I am looking at the fortunes of four recent FTSE 100 risers. Antofagasta \nCopper giant Antofagasta (LSE: ANTO) rose a chunky 3% last week as investor appetite towards the mining sector flooded back. However, such bumps higher have proved extremely rare thanks to the dark clouds blighting the commodities sector -- Antofagasta alone has fallen 28% during the past six months alone -- and I believe fresh weakness can be expected. \nThe resources segment was boosted last week by China's decision to cut interest rates yet again. But given policymakers' failure to jump-start its economy despite several similar measures this year alone, there is no guarantee that copper demand will pick up any time soon. And while fellow miner Freeport-McMoRan also vowed to cut production again last week, the industry still needs broader action to tackle the market imbalance. I believe copper prices remain on shaky ground. Burberry \nTo say that luxury handbag and raincoat play Burberry (LSE: BRBY) has endured a year to forget would be something of an understatement. But shares flipped 7% higher between Monday and Friday as bargain hunters piled in, and although further turbulence can be expected as demand from China remains pressurised, I believe the fashion house remains a terrific long-term selection. \nIndeed, Burberry advised this month that total revenues crept 2% higher during April-September to £774m, underpinned by double-digit percentage growth across Europe, the Middle East, India and Africa, as well as low single-digit rises across The Americas. Make no mistake: Burberry still has to find the remedy to falling sales in Asia, but I remain convinced a combination of formidable brand power and rising affluence levels across new and established markets should power sales skywards. ARM Holdings \nMicrochip builder ARM Holdings (LSE: ARM) also enjoyed a solid spurt higher during the course of last week, and the share price added 10% during the period to charge back above the £10 marker. The Cambridge business gained on the back of solid results that showed revenues leap 24% in July-September, to £243.1m, a result that powered pre-tax profit 30% higher to £102.9m. \nARM Holdings continues to prove its dominance at the top of the smartphone and tablet PC segments, and inked 38 new licence agreements during the quarter, including six for its next-generation ARMv8-A product. And these new accords spanned both traditional and new tech markets alike, supporting the chipbuilder's decision to enter hot growth segments like servers, networking and 'The Internet of Things.' I fully expect product shipments to keep rocketing higher. Rolls-Royce Holding \nEven though engineering leviathan Rolls-Royce (LSE: RR) advanced 3% during the course of the past week, I reckon the stock could experience fresh pressure thanks to enduring uncertainty over the oil price and consequently capital expenditure across the fossil fuel industry. Indeed, Rolls-Royce has fallen a colossal 35% since April as 'black gold' prices have run out of puff. \nStill, I believe the London firm remains a terrific all-round growth selection. Earlier this month Rolls-Royce announced a variety of cost-cutting measures across its Marine division to mitigate falling revenues, as well as increasing R&D spend to increase its competitiveness in this area. And I am convinced Rolls-Royce's market-leading position in a variety of other markets -- and especially that of the commercial aerospace segment -- should allow it to post spectacular sales growth over the long haul. \nBut whether or not you fancy stashing the cash in Rolls-Royce, or indeed any of the firms mentioned above, I strongly recommend you check out this totally exclusive report that highlights a wide array of FTSE stars waiting to deliver spectacular returns. \nOur \" 5 Dividend Winners To Retire On \" wealth report highlights a selection of incredible stocks with an excellent record of providing juicy shareholder returns. Among our picks are top retail, pharmaceutical and utilities plays that we are convinced should continue to provide red-hot dividends. \nClick here to download the report -- it's 100% free and comes with no further obligation . \nRoyston Wild has no position in any shares mentioned. The Motley Fool UK has recommended ARM Holdings and Burberry. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-10-26T14:37:00.000+02:00", "crawled": "2015-10-26T14:49:49.351+02:00", "highlightTitle": ""}