{"organizations": [], "uuid": "89fe7bc2a350666d85e4e656413e0f8f305b3b45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/02/12989006/Screen Shot 2015-10-02 at 4.33.49 AM.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12989006.htm", "country": "US", "title": "Hearsay Social Announces Social Business Training to Drive Advisor Success on Social Media", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Hearsay Social Announces Social Business Training to Drive Advisor Success on Social Media", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "89fe7bc2a350666d85e4e656413e0f8f305b3b45"}, "author": "Connie Sung Moyle", "url": "http://www.prweb.com/releases/2015/09/prweb12989006.htm", "ord_in_thread": 0, "title": "Hearsay Social Announces Social Business Training to Drive Advisor Success on Social Media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hearsay Social ®, provider of the Predictive Social Suite for financial advisors and insurance agents, today announced Social Business Training, a comprehensive e-learning offering that educates advisors on how to leverage the power of digital and social media to engage with today’s omnichannel consumers. In a survey of more than 700 advisors and agents conducted by Hearsay Social earlier this year, more than 60 percent said the most challenging part of using social media to grow business is knowing what to say or how to manage relationships. Hearsay Social’s interactive Social Business Training offering provides advisors and agents with the tools and skills to be proactive on social media, attract prospects, retain clients and build deeper relationships.\n“Social media and digital technologies are transforming the way advisors and agents are doing business,” said Abhay Rajaram, vice president of global customer success at Hearsay Social. “While it is clear these new technologies have incredible potential, they can often overwhelm advisors who are looking for a simple, structured way to get started. Social Business Training cuts through the information overload and helps advisors create a social media business plan that they can act on right away.”\nSocial Business Training Coursework\nAt the heart of Social Business Training are progressive courses that sit on an interactive e-learning platform. Within each course are learning modules featuring video, audio, text, knowledge checks, activities, a reference library and more. The platform puts advisors and agents in the driver’s seat, so they can steer their own learning and interact with the coursework at their own pace. Advisors launch the program by simply clicking a button on their Hearsay Social dashboard.\nExamples of available courses include:\nUnderstanding Social Media for Business: Advisors will learn why social, mobile and digital are the new imperatives, and get an overview of the major social media networks\nGetting Started on Social for Your Business: Advisors will gain practical guidance on how to create and grow their networks, build credibility and develop a social media strategy\nOptimizing Your Social Presence: Once they’ve established their social presence, advisors and agents will learn how to elevate their brand with promoted content and by leveraging more advanced social tools\nMeasuring Your Success: Advisors and agents will learn the key metrics that matter, how to quantify performance, and how to boost conversions with paid advertising\nSocial Business Training also provides reporting capabilities for company administrators in charge of training and education, including the ability to see how many and which advisors are participating in and progressing through the courses. Additionally, the platform can be co-branded with the company’s logo and can host company-specific documents and other materials as needed.\nAvailability: Social Business Training is available to current Hearsay Social customers.\nMore Information: To learn more about the Social Business Training offering, visit the Hearsay Social blog .\nAbout Hearsay Social\nHearsay Social provides the Predictive Social Suite for financial advisors and insurance agents across the world’s largest financial institutions, including seven of the top 10 global financial services companies and leading firms such as New York Life, Raymond James, Vanguard and Penn Mutual. Hearsay Social powers more than 115,000 financial relationship managers worldwide, allowing them to engage today’s social, mobile customer through Facebook, LinkedIn, Twitter, Google+ and mobile-first websites. Advisors receive unique client insights through multi-channel signals, and the predictive Content Library makes it easy to share the right content at the right time. Built-in enterprise integration and governance powers compliance and supervision for global firms, seamlessly addressing industry regulations and enforcing policy.\nHearsay Social is a SIFMA strategic partner, LIMRA Elite Strategic partner, GAMA partner and Efma Associate Partner, and has raised $51 million from Sequoia Capital, NEA and private investors. Named a 2015 CNBC Disruptor and a 2015 Best Place to Work in the Bay Area, the company is headquartered in Silicon Valley with dedicated local presences in New York, Chicago, Atlanta, Austin, Toronto, London, Paris, Munich and Hong Kong.\nStay up to date on the latest Hearsay Social developments and news in social business and financial services by visiting the company’s blog , as well as its Facebook , Twitter , LinkedIn and Google+ pages.\nHearsay Social and the Hearsay Social logo are trademarks or registered trademarks of Hearsay Social, Inc. or its subsidiaries worldwide.\n© 2015 Hearsay Social, Inc. All rights reserved. All other trademarks are the property of their respective owners.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cubGlua2VkaW4uY29tL2NvbXBhbnkvaGVhcnNheS1zb2NpYWw=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2hlYXJzYXlzb2NpYWwuY29tL3Byb2R1Y3Qvb3ZlcnZpZXcv", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9wbHVzLmdvb2dsZS5jb20vK0hlYXJzYXlTb2NpYWwv", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2hlYXJzYXlzb2NpYWwuY29tLzIwMTUvMTAvaW50cm9kdWNpbmctc29jaWFsLWJ1c2luZXNzLXRyYWluaW5nLWZvci1hZHZpc29ycy8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly90d2l0dGVyLmNvbS9oZWFyc2F5c29jaWFs", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5oZWFyc2F5c29jaWFsLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuZmFjZWJvb2suY29tL2hlYXJzYXlzb2NpYWw=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2hlYXJzYXlzb2NpYWwuY29tL2Jsb2cv"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T23:58:28.611+03:00", "highlightTitle": ""}