{"organizations": [], "uuid": "5b6d029e8144e5de5da8b0de88fecceb73d0fbdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/4/l/z/k/image.related.afrArticleLead.620x365.gk5jl5.png/1444397245727.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/hedge-funds-see-more-pain-to-come-20151009-gk5jl5", "country": "AU", "title": "Short selling at record highs as hedge funds bet rally won’t last", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Short selling at record highs as hedge funds bet rally won’t last | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T20:45:00.000+03:00", "replies_count": 0, "uuid": "5b6d029e8144e5de5da8b0de88fecceb73d0fbdc"}, "author": "Matthew Smith and Patrick Commins", "url": "http://www.afr.com/markets/hedge-funds-see-more-pain-to-come-20151009-gk5jl5", "ord_in_thread": 0, "title": "Short selling at record highs as hedge funds bet rally won’t last", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Watermark's Justin Braitling thinks the sharemarket is more likely to drop further in coming months than continue this week's gains. Michel O'Sullivan by Matthew Smith and Patrick Commins Short selling positions in the Australian market have reached record levels as hedge funds bet equity gains made in the past week could give way to further sharemarket losses.\nAnalysis by AFR Weekend reveals short positions in the S&P/ASX 200 grew sharply from September 2014 onwards, coinciding with the dramatic sell-off of the Australian dollar sparked by signs the US Federal Reserve was preparing to increase interest rates.\nShort positions have now grown to a total of 5.8 billion shares, or 2 per cent of the total equity, issued by companies targeted by short sellers.\nFive straight days of gains gave the market its best week in four years, up 4.5 per cent to close at 5279 points. The rally has prompted some to call that the bottom may have been reached after six months of falls.\nWatermark's Justin Braitling thinks the sharemarket is more likely to drop further in coming months than continue this week's gains. Michel O'Sullivan But despite the rally, short positions have remained in place. Hedge funds are now waiting for the next signs the sharemarket will give way to further losses, possibly greater than the rout investors endured during August and September this year.\n\"I'd probably describe this [week of gains] as a bit more of a blow back than a rally,\" said Justin Braitling, director of Watermark Funds Management.\nMr Braitling, who manages close to $500 million, says he had positioned his portfolios \"net short\", meaning he thinks the sharemarket is more likely to drop further in coming months than continue this week's gains.\n\"We're waiting for further signals whether the recent losses were simply a correction or a turning point into a bear market,\" he said.\n Some institutional investors, including Terry Campbell, chairman of the country's largest listed investment company, Australian Foundation Investment Company, have this week called a near bottoming of the market .\nCitigroup emerged this week with a bullish view that the ASX 200 would reach a 6200 level by the end of this calendar year , a 23 per cent rise from its September 30 close of 5022.\nBut the large amount of short positions and the wide range of companies in which they've been taken, suggests hedge funds are betting on further falls.\nHedge funds revel in volatile markets, making returns when markets drop by borrowing shares and then buying them back at lower levels. The most shorted companies on the ASX 200 include Myer Holdings, Mineral Resources, Orica, Monadelphous Group, Cabcharge and Flight Centre.\nA further dip in the ASX 200 below the 5000 mark in coming months could spell a bear market and a signal for hedge funds to increase their short exposure.\n\"There is clearly some valuation support [at the lower share price levels] but there is still clearly risk. I'd predict sideways and choppy markets over a new bull market,\" said Sean Fenton, Tribeca Investment Partners portfolio manager.\nMr Fenton described the recovery in the last week more as a reaction to the sell-off rather than a recovery, sparked by a miniature sell-down of the US dollar. He noted commodity and resources stocks had bounced back the most this week.\nBHP Billiton, Rio Tinto, Woodside Petroleum, Santos and Origin Energy were among the biggest gainers this week, all posting double-digit returns since Wednesday. It was the resources segment which led the rest of the market down to new lows when the likes of Glencore were forced to raise dilutive capital in order to shore up battered balance sheets.\nA further strengthening of the US dollar, as is expected as the US interest rate tightening cycle draws closer, will continue to put downward pressure on the Australian dollar and the mining and resources sector.\n\"The broader thematic of a slowing China and downward pressure on the Australian dollar is still in place, the last week we've seen a small shift in terms of the pattern of the markets but we still believe in the broader thematic,\" Mr Fenton said.\nThe flood of short interest in the ASX will likely remain in place while there is still downward pressure on the Australian dollar and macro economic conditions continue to conspire against mining and resources companies.", "external_links": [], "published": "2015-10-09T20:45:00.000+03:00", "crawled": "2015-10-09T22:05:42.109+03:00", "highlightTitle": ""}