{"organizations": [], "uuid": "3ebcd2da98970661c99cd6ab988c7f2ca9280297", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/22/pandora-settlement-idUSL1N12M3IO20151022", "country": "US", "title": "Pandora to pay record labels $90 mln to use golden oldies", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Pandora to pay record labels $90 mln to use golden oldies | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T02:10:00.000+03:00", "replies_count": 0, "uuid": "3ebcd2da98970661c99cd6ab988c7f2ca9280297"}, "author": "Andrew Chung", "url": "http://www.reuters.com/article/2015/10/22/pandora-settlement-idUSL1N12M3IO20151022", "ord_in_thread": 0, "title": "Pandora to pay record labels $90 mln to use golden oldies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK Oct 22 Pandora Media Inc on Thursday said it would pay $90 million to settle a lawsuit with five record labels that accused the online music streaming service of cheating them out of royalties on pre-1972 recordings.\nNo other terms of the settlement were disclosed by Pandora and the labels, including Sony Music Entertainment, UMG Recordings, Warner Music Group, Capitol Records and ABKCO Music & Records.\nThe deal further scales back a bitter dispute between the music industry and broadcasters over the right to play songs recorded before Feb. 15, 1972. Federal copyright law does not cover those songs and the industry has been filing lawsuits in a attempt to expand its royalty rights.\nIn June, the companies settled a similar lawsuit against satellite radio provider Sirius XM Holdings Inc for $210 million.\nThe record companies sued Pandora in April, 2014 in New York state court in Manhattan, demanding an end to Pandora's \"massive and continuing unauthorized commercial exploitation\" of older songs.\nThe complaint said the music in question included some of the most legendary artists including the Beatles, the Rolling Stones, the Grateful Dead, Bob Dylan and Elvis Presley.\nPandora's chief executive officer, Brian McAndrews, said in a statement, \"We pursued this settlement in order to move the conversation forward and continue to foster a better, collaborative relationship with the labels.\"\nRecording Industry Association of America Chairman Cary Sherman called the settlement \"a significant milestone and a big win for the music community.\"\nPandora is also facing a legal challenge over pre-1972 songs brought by members of the 1960s band the Turtles, known for the hit \"Happy Together.\" That case is currently pending at the 9th U.S. Circuit Court of Appeals.\nCapitol and UMG are part of Vivendi SA, and Sony Music is part of Sony Corp.\nThe case is Capitol Records et al v Pandora Media Inc, New York State Supreme Court, New York County, No. 651195/2014. (Reporting by Andrew Chung; Editing by Alexia Garamfalvi and Christian Plumb)", "external_links": [], "published": "2015-10-23T02:10:00.000+03:00", "crawled": "2015-10-23T01:20:30.614+03:00", "highlightTitle": ""}