{"organizations": [], "uuid": "b997daec9aa30453bfe3892b0ee08696c773f505", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/h/z/g/t/image.related.articleLeadwide.620x349.gkdaba.png/1445329990932.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2550/consumer-discretionary/retailing", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/retail/woolworths-lowes-weigh-masters-options-as-clock-starts-ticking-20151019-gkdaba.html", "country": "AU", "title": "Woolworths, Lowe's weigh Masters options as clock starts ticking", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Woolworths, Lowe's weigh Masters options as clock starts ticking", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "b997daec9aa30453bfe3892b0ee08696c773f505"}, "author": "", "url": "http://www.smh.com.au/business/retail/woolworths-lowes-weigh-masters-options-as-clock-starts-ticking-20151019-gkdaba.html", "ord_in_thread": 0, "title": "Woolworths, Lowe's weigh Masters options as clock starts ticking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The clock is ticking for Woolworths' Masters chain. Photo: Glenn Hunt\nWoolworths is expected to pull the plug on its $2.2 billion foray into the home-improvement market if joint venture partner Lowe's decides to exercise an option to sell its $1.1 billion stake.\nAnalysts believe Woolworths is unlikely to continue to run the loss-making Masters chain single-handedly if Lowe's exercises its put option and forces Woolworths to buy its 33 per cent stake for more than $800 million.\n\"If Lowe's wants out Woolies will want out as well,\" one analyst said.\nThe clock is ticking on the six-year-old joint venture, which has racked up losses of more than $600 million and is not expected to break even for another four years.\nAdvertisement Under the revised terms of the agreement, Lowe's can officially exercise its put option any time after October 20, giving Woolworths 13 months' notice to buy its stake.\n\"It will at least force Woolworths' hand to make a decision,\" another analyst said.\nAs reported last week, Woolworths and Lowe's injected another $105 million into the joint venture on September 30 , the fifth capital injection in 2015, taking the total value of their investment to $3.32 billion, up from $2.9 billion at the end of 2014.\nAnother $200 million Analysts believe Woolworths and Lowe's might need to invest another $200 million into the joint venture over the next 12 months to keep it afloat, because Masters is estimated to be losing more than $50 million each quarter.\nWoolworths is under increasing pressure from analysts and investors to bite the bullet and either look for buyers for Masters or cut its losses and close the chain.\nLosses at Masters blew out from $176 million to $245 million in 2015, while profit at Home Timber and Hardware recovered to $21 million, taking total home-improvement losses to $224.7 million in 2015 and to $604 million over the past four years.\nWoolworths' new chairman Gordon Cairns has indicated to investors he is less wedded to Masters than former chairman Ralph Waters and outgoing chief executive Grant O'Brien.\nAnalysts believe Mr Cairns and the Woolworths board might make a decision on Masters' future before the retailer appoints a new chief executive, saying it would be easier to secure the right candidate if tough decisions had already been made.\n​\"But he [Mr Cairns] wants to make a decision based on facts,\" one analyst said.\nWoolworths has declined to comment on the joint venture with Lowe's, saying only that it would update the market as required if anything changed in the relationship.\nSelling sites and stock Citigroup estimates it would cost Woolworths $1.6 billion to exit leases and buy out Lowe's, but it could recoup between $700 million and $970 million selling sites and stock, so the net loss would be between $300 million and $900 million.\nMorgan Stanley estimated if Lowe's exercised its put option Woolworths would have to pay $500 million to the US retailer if it decided to wind up Masters or $900 million if it elected to continue with the business.\nIn the event of a wind-up, Woolworths would probably fetch 100¢ in the dollar for Masters' properties, 25¢ in the dollar for plant and equipment and 80¢ for inventory, but the lease exit costs would be about $640 million and redundancy costs about $40 million.\n\"Net, we believe that Woolworths could realise between $600 million and $1 billion upon wind-up,\" Morgan Stanley said.\nOne analyst believes Lowe's might even consider buying Woolworths' 66 per cent share of the joint venture. Lowe's chairman Robert Niblock told investors two months ago he was \"pleased with the progress\" in Australia.\n\"Lowe's is not getting the same pressure from shareholders [as Woolworths],\" the analyst said. \"If Woolworths says it's too hard, Lowe's could take the two-thirds Woolworths own. You can't rule it out.\"", "external_links": ["http://www.afr.com/business/retail/gordon-cairns-the-right-man-to-tackle-big-problems-at-woolworths-and-origin-energy-20150917-gjpfh4", "http://www.afr.com/business/retail/woolworths-lowes-tip-105-million-into-masters-as-deadline-looms-20151012-gk6vjw"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T23:00:49.466+03:00", "highlightTitle": ""}