{"organizations": ["Lessors Attracting Small & Mid-Sized Businesses   Non-Bank Lenders", "Greenwich Associates"], "uuid": "b63b34e96a3e60c498818fc4ee42f97399078759", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.equipmentfa.com", "main_image": "", "site_section": "http://www.equipmentfa.com/rss/feeds/latestnews.xml", "section_title": "Equipment Finance Advisor", "url": "http://www.equipmentfa.com/news/4802/non-bank-lenders-lessors-attracting-small-mid-sized-businesses", "country": "US", "title": "Non-Bank Lenders, Lessors Attracting Small & Mid-Sized Businesses", "performance_score": 0, "site": "equipmentfa.com", "participants_count": 0, "title_full": "Non-Bank Lenders, Lessors Attracting Small & Mid-Sized Businesses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:15:00.000+03:00", "replies_count": 0, "uuid": "b63b34e96a3e60c498818fc4ee42f97399078759"}, "author": "", "url": "http://www.equipmentfa.com/news/4802/non-bank-lenders-lessors-attracting-small-mid-sized-businesses", "ord_in_thread": 0, "title": "Non-Bank Lenders, Lessors Attracting Small & Mid-Sized Businesses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Non-Bank Lenders, Lessors Attracting Small & Mid-Sized Businesses October 16, 2015, 07:15 AM Related: Greenwich Associates , Small Business \nOne in four of U.S. small businesses and mid-sized companies are obtaining credit from non-bank providers, and—in a finding sure to catch the attention of bank executives—nearly all say the experience was so positive that they would borrow from non-bank lenders again.“While some companies certainly do turn to alternative providers after being turned down by traditional banks, non-bank providers are widely viewed as being easier to work with than traditional banks.”In a new Greenwich Report, Non-Bank Lenders Woo Small and Mid-Sized Companies with Service, and, Increasingly Price , approximately one-quarter of the 218 small businesses and mid-sized companies taking part in a recent Greenwich Market Pulse obtained credit from a non-bank provider in the past 18 months.About 8 in 10 of these companies say the process of obtaining credit is easier with non-banks than with traditional banks. A full 51% contend it is “much easier” to get credit from non-bank lenders. Of even more concern to traditional banks is the fact that roughly 94% of non-bank borrowers say they would obtain credit from a non-bank provider again. That figure is up from the approximately 89% of non-bank borrowers who said they would return to non-banks for credit last year.“There is still a perception that companies borrowing from non-banks are doing so because other banks won’t provide them with credit,” says Greenwich Associates consultant Dana Schwaeber. “While some companies certainly do turn to alternative providers after being turned down by traditional banks, non-bank providers are widely viewed as being easier to work with than traditional banks.”The most popular types of non-bank lenders are specialty finance leasing companies including OEM financing, which were used by one-third of the non-bank borrowers. About a quarter borrowed from special-purpose entities, including business development companies and hedge funds, and about 1 in 5 raised capital through private placements or private loans. Today's Other News", "external_links": [], "published": "2015-10-16T14:15:00.000+03:00", "crawled": "2015-10-16T16:35:29.390+03:00", "highlightTitle": ""}