{"organizations": ["Volkswagen"], "uuid": "01c5cbaf81f8524cd6dc9f5f4386e8d857e9d9ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/volkswagen-recall-could-last-2017-195550675.html", "country": "US", "title": "Volkswagen recall could last into 2017, says stricken car maker's UK chief", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Volkswagen recall could last into 2017, says stricken car maker's UK chief", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T22:55:00.000+03:00", "replies_count": 0, "uuid": "01c5cbaf81f8524cd6dc9f5f4386e8d857e9d9ab"}, "author": "", "url": "https://uk.finance.yahoo.com/news/volkswagen-recall-could-last-2017-195550675.html", "ord_in_thread": 0, "title": "Volkswagen recall could last into 2017, says stricken car maker's UK chief", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Oct 12, 2015, 21:01 BST - UK Markets closed Volkswagen recall could last into 2017, says stricken car maker's UK chief By Alan Tovey | Telegraph – 5 minutes ago 151.91 +11.31 \nVolkswagen (Other OTC: VLKAF - news ) 's UK managing director Paul Willis says 1.2m cars affected by emissions scandal could take over a year to remedy \nCrisis-hit Volkswagen’s UK boss refused to say if customers would be compensated for the auto maker selling 1.2m cars in Britain fitted with “defeat devices” that let them beat emissions tests. \nGiving evidence to MPs on the Transport Committee, Paul Willis, UK managing director of German auto maker, said there was also a “risk” a huge recall to modify affected vehicles in Britain might run into 2017. \nAP \nVW had an \"absolute obligation to fix these cars and put them right\", he said, but added: “I think it's premature to talk about loss of value. This is a very important issue, but it's not a safety-related issue. We have to make sure we regain customers’ trust .” \nThe scandal engulfing VW after its admission that 11m of its diesel cars worldwide have equipment which allows them to cheat pollution tests has caused its share price to plunge 40pc, wiping €25bn off the company’s value. \nIts focus moved to Britain today with lawmakers quizzing the company’s top UK boss. Mr Willis said about 400,000 of the affected vehicles will require mechanical modifications, rather just an update to their software, and that 1,000 of rigged cars were sold to British drivers despite the UK arm knowing they had defeat devices. \nVW treated consumers like a “pack of fools” MPs told Mr Willis, who said the company had “mishandled the situation, without a shadow of a doubt” and “apologised sincerely and unreserved”. \nBut grilled over who knew what at the company, Mr Willis said it was unlikely to have reached the top. \"I find it absolutely implausible that senior people in the company would have known of these issues with regard to the testing regime,\" he said. \nVW had behaved in an “appalling” way, said Transport Secretary Patrick McLoughlin, who also gave evidence. \nHe also doubted the claim that the decision to fit defeat devices to cars was the work of just a few people. “I think everybody finds it hard to believe it was just one or two rogue engineers,” he said. \nHe was also questioned about whether the Government was considering whether it could fine VW. Conservative MP Mark Menzies urged the minister to “vigorously pursue VW while it still has money in its back pocket”. The Government already has the power to prosecute the company if it knowingly made a false statement to regulators over its cars performance, Mr McLoughlin said. \nThe news came as VW had its credit rating cut by S&P to A- from A, potentially making it more expensive for the car maker to borrow money. \nAnother blow came with the European Investment Bank (EIB) saying it could recall up to €1.8bn in outstanding loans to VW. Werner Hoyer, EIB chief executive, said the lender was examining whether any of its funds had been used to help the company cheat tests. \nThe warning follows talk the European Central Bank could suspend its purchases of bonds backed by VW loans. \nIt (Other OTC: ITGL - news ) was also reported that Martin Winterkorn, the former chief executive of VW Group who resigned five days after scandal broke, is quitting his remaining roles at the car maker. \nDespite leaving the top job at VW Group last month, Mr Winterkorn stayed on as chief executive of Porsche SE, the holding company that has a majority stake in VW. He also remained chairman of VW’s Audi (LSE: 0FG8.L - news ) marque, trucks division Scania and the group’s Truck & Bus holding. \nHowever, Mr Winterkorn has come under pressure from the German state of Lower Saxony, VW’s second-biggest shareholder, and others to sever his remaining links with the auto giant. \nLast week prosecutors and police in Germany raided VW’s offices and the homes of staff to collect evidence, although prosecutors have said that Mr Winterkorn is not under formal investigation. \nIn the latest round of vehicle withdrawals, the carmaker said it was recalling up to 2,000 diesel cars sold in China.", "external_links": [], "published": "2015-10-12T22:55:00.000+03:00", "crawled": "2015-10-12T23:01:46.422+03:00", "highlightTitle": ""}