{"organizations": ["ZESA"], "uuid": "e4dc92327e66096b989ecde31030352361f478f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510091386.html", "country": "US", "title": "Zimbabwe: Five Things to Do When There Is No Zesa", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Five Things to Do When There Is No Zesa", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T15:39:00.000+03:00", "replies_count": 0, "uuid": "e4dc92327e66096b989ecde31030352361f478f6"}, "author": "", "url": "http://allafrica.com/stories/201510091386.html", "ord_in_thread": 0, "title": "Zimbabwe: Five Things to Do When There Is No Zesa", "locations": ["Cuba", "Dubai", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stephen King", "Philani", "Adam", "Kundai Marunya", "Waza", "God", "Philani Amadeus Nyoni"], "text": "opinion By Philani Amadeus Nyoni Do you ever find yourself with nothing to do when the power goes out? Ilizwi263 blogger, Philani Amadeus Nyoni, suggests five activities to help pass the Zesa-less hours. Listen to an audio book When I first discovered I was asexual, my doctor advised I try watching porn. That was weird because back then porn was on videotapes, and the only way to watch it was after midnight, on the 14 inch television in the lounge, with the volume down. I wasn't staying up for that sh*t so he suggested literary porn, or literotica, to use the name preferred by writers of the genre. Then technology caught up and we had audio porn, which is basically a husky voiced woman reading the literotica. Eventually I learnt other normal books are available in audio. Download a Stephen King and walk through the dark listening to that on your earphones. Now that gets me stiff - with fear! Call black people I don't mean racially black, I mean Muvhango black... like dark black people. Preferably, hide your number and say: \"My my, you have really gained weight haven't you?\" My favourite line is: \"Is this your boob I'm touching?\" or while stroking the darkness: \"Is this doing anything for you?\" Run Around Your Neighbourhood Naked We in Zimbabwe have a rare opportunity and like my mama always said: be grateful for everything you have. How many people can run around naked in the middle of the night? Witches have been doing it for years and I assure you, it's quite an experience. You will feel alive, the cool air permeating the hair of your nether regions, and said nethers swinging, dangling and slapping like Adam chasing Eve for a peach. I usually do my run at 20:25; five minutes before ZESA is scheduled to come back on. The course takes me 15 minutes and no one has ever seen my goods. Alternatively, paint yourself like a zombie and in a slow creepy voice, say to anyone who is unfortunate enough to happen your way in the dark, 'I - want - brain.' I swear it's f*cking hilarious, weird if you have your clothes off. It makes you seem like some kind of sexual delinquent with a fetish for fellatio in the middle of the road. Make a bonfire We all make fires to cook and stuff when the power goes out, but if you haven't been zonked, danced around a bonfire banging the shit out of congas, my friend, you haven't experienced the joy of a power outage. Visit people you can't stand The Catholics in my neighbourhood visit each other on Tuesdays when the power goes out, and I figured it makes sense. If you can't watch TV, might as well talk to God and complain about it like: 'when I asked for my daily bread I thought the electricity for the toaster was tacitly included'. At least in the dark the neighbours can't see you just pawned your TV to pay last month's rent and might export one of your kidneys to Cuba for the current month. And technology is taking the personal feel out of relationships, since you don't have anything to do and the phone is out of battery, try visiting someone; not your sweetheart for a slow walk under the moonlight, try visiting someone you can't stand. While they are being obnoxious, lower your pants, squat and keep going 'yeah... aha... no way! Shit!' while you coil a brown rope onto their new Persian rug freshly imported from Dubai. This article was originally published on ilizwi263. Waza is proud to feature as part of its content local bloggers who have a knack for expressing their unique perspectives, independent thoughts and engaging stories. The opinions expressed here are those of the author. Be sure to check out Waza blogger Kundai Marunya's take on Zimbabwe's power issues, and don't miss Philani's other articles on Waza. Zimbabwe \nThe 2015 Ibrahim Index of African Governance (IIAG) was released on Monday placing Seychelles in the 6th spot in the … see more » Copyright © 2015 Waza. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-09T15:39:00.000+03:00", "crawled": "2015-10-09T17:11:44.434+03:00", "highlightTitle": ""}