{"organizations": [], "uuid": "6e48a08d15f6cfd836e636d6efa4126f679ae689", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/general-motors-navistar-develop-commercial-135001108.html", "country": "GB", "title": "General Motors & Navistar to Develop Commercial Vehicles - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "General Motors & Navistar to Develop Commercial Vehicles - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "6e48a08d15f6cfd836e636d6efa4126f679ae689"}, "author": "Zacks Equity Research", "url": "http://finance.yahoo.com/news/general-motors-navistar-develop-commercial-135001108.html", "ord_in_thread": 0, "title": "General Motors & Navistar to Develop Commercial Vehicles - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "General Motors Company GM and Navistar International Corporation NAV recently signed a long term agreement for the development of medium-duty, conventional cab Class 4/5 commercial vehicles. This joint effort will strengthen the product line-up of Navistar. The partnership will also expand General Motors’ Chevrolet commercial truck portfolio with the addition of new medium-duty conventional cab trucks.\n\nBoth the companies will combine their expertise to build the new line of vehicles. Navistar will provide its rolling chassis configurations and manufacturing capabilities while General Motors will offer its commercial components and engines.\n\nThese vehicles are expected to be manufactured from 2018 at Navistar's facility in Springfield, OH. Navistar intends to hire 300 new workers and invest over $12 million in the plant. The funds will be utilized to upgrade the equipment infrastructure of the facility.\n\nNavistar’s partnership with General Motors will help the former offer better technologies to customers. in the medium-duty vehicle range. It will also improve the company’s scale of operations.\n\nGeneral Motors is gaining new contracts to expand its business. In Jun 2015, the company entered into a partnership agreement with Japanese company, Isuzu Motors Ltd. Per this agreement, General Motors will re-enter the U.S. medium-duty truck market by 2016 with Chevrolet-branded vehicles supplied by Isuzu. The deal will help General Motors to expand its commercial-vehicle offerings with low cab-forward models that are produced by Isuzu, based on the Isuzu N-Series. These vehicles will be sold by Chevrolet dealers in the U.S. Both the companies will explore further options by utilizing General Motors’ commercial-vehicle parts for Isuzu products.\n\nCurrently, General Motors is a Zacks Rank #3 (Hold) stock while Navistar holds a Zacks Rank #4 (Sell).\n\nBetter-ranked stocks in the auto industry include Ford Motor Co. F and PACCAR Inc. PCAR, both carrying a Zacks Rank #2 (Buy).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report >>\n \n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report \n \nFORD MOTOR CO (F): Free Stock Analysis Report \n \nPACCAR INC (PCAR): Free Stock Analysis Report \n \nNAVISTAR INTL (NAV): Free Stock Analysis Report \n \nGENERAL MOTORS (GM): Free Stock Analysis Report \n \nTo read this article on Zacks.com click here. \n \nZacks Investment Research Automotive Industry Personal Investing Ideas & Strategies General Motors Navistar commercial vehicles", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-01T17:41:28.586+03:00", "highlightTitle": ""}