{"organizations": [], "uuid": "8249e9de1c0361e96b1c9c066163a4c2fea27c9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/weak-trading-hits-jpmorgan-profit-013012813.html", "country": "GB", "title": "Weak trading hits JPMorgan, profit falls in three core businesses", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Weak trading hits JPMorgan, profit falls in three core businesses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:30:00.000+03:00", "replies_count": 0, "uuid": "8249e9de1c0361e96b1c9c066163a4c2fea27c9d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/weak-trading-hits-jpmorgan-profit-013012813.html", "ord_in_thread": 0, "title": "Weak trading hits JPMorgan, profit falls in three core businesses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Oct 14, 2015, 02:49 BST - UK Markets open in 5 hrs 11 mins Weak trading hits JPMorgan, profit falls in three core businesses Reuters – 19 minutes ago \nA view of the exterior of the JP Morgan Chase & Co. Corporate headquarters in the Manhattan borough … By Sweta Singh and Richa Naidu \n(Reuters) - JPMorgan Chase & Co, the biggest U.S. bank by assets, reported a 6.4 percent decline in revenue and profit declines in three of its four main businesses, underscoring how weak trading markets and low interest rates have hurt banks in recent months. \nLike other banks, JPMorgan has been struggling to increase revenue in the face of weak demand for loans and low interest rates, which have been stuck near zero for overnight funds since December 2008. \nTrading was particularly volatile during the quarter as worries about the impact of an economic slowdown in China roiled financial markets, discouraging investors from making big bets and muddying the outlook for U.S. interest rates. \nChief Financial Officer Marianne Lake offered little hope that conditions would improve anytime soon, saying on a conference call that analyst estimates for the current quarter appeared to be too high in light of slow market trading. \nThe lender, kicking off third-quarter results for big U.S. banks, managed a 22 percent rise in net income but this was mainly due to a tax benefit and lower spending on employee pay. \nThe bank, whose shares were little changed in extended trading on Tuesday, said net income fell in its commercial banking, asset management, and corporate and investment banking businesses. The only unit to post a higher profit was consumer and community banking, where net income rose 4 percent. \nRevenue from trading fixed income, currencies and commodities fell 22.6 percent to $2.93 billion. Adjusted for the sale of a physical commodities business and other changes, revenue from fixed-income trading would have fallen 11 percent. \n\"When you look at other companies that will report I expect it's going to be exactly the same situation,\" said Michael Yoshikami, who oversees $1.5 billion as chief executive of Destination Wealth Management in Walnut Creek, California. \nBank of America Corp and Citigroup Inc, which report on Wednesday and Thursday respectively, have said they expect trading revenue to drop about 5 percent in the quarter. \nMarkets and Investor Services revenue fell 15.6 percent to $5.41 billion, contributing to a more-than-expected 6.4 percent drop in overall net revenue to $23.54 billion. \nNet income applicable to common stockholders was $6.27 billion, or $1.68 per share, up from $5.13 billion, or $1.35 per share last year. Analysts on average had expected $1.37 per share, according to Thomson Reuters I/B/E/S. \nLOW RATES, WEAK DEMAND \nThe results in the latest quarter included tax benefits of $2.2 billion. The prior-period results included legal expenses of $1 billion, which had reduced earnings per share by 26 cents. \n\"We saw the impact of a challenging global environment and continued low rates reflected in the wholesale businesses’ results, while the consumer businesses benefited from favorable trends and credit quality,\" CEO Jamie Dimon said in a statement. \nThe U.S. Federal Reserve held off on an interest rate rise that many had expected in mid September, citing worries about global growth, jittery markets and muted inflation. \nLow interest rates compress the spread between banks' cost of funds and the interest earned from loans and securities. \nNoninterest expenses fell 3 percent to $15.4 billion, while provision for credit losses fell 10 percent to $682 million. \nCompensation costs fell 6.5 percent to $7.32 billion in the quarter, and were down 1 percent in the first nine months of the year. JPMorgan had 235,678 employees as of Sept. 30, down 3 percent from a year earlier. \nThe bank's total assets shrank 4 percent to $2.42 trillion, making it the first time the bank's assets have fallen for two quarters in a row since 2009. \nJPMorgan, like other big banks, is shedding assets to appease regulators, who fear its size could pose a risk to the financial system in the event of a failure. \n(Reporting by Sweta Singh and Richa Naidu in Bengaluru, David Henry and Dan Freed in New York; Editing by Ted Kerr)", "external_links": [], "published": "2015-10-14T04:30:00.000+03:00", "crawled": "2015-10-14T04:54:43.658+03:00", "highlightTitle": ""}