{"organizations": [], "uuid": "250a93a58e31ea135d4152ebdb571e47fcb53d7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03473/electricity-meter-_3473102k.jpg", "site_section": "http://www.telegraph.co.uk/newsfeed/rss/money_pf.xml", "section_title": "Personal finance - How to grow your wealth and spend less money - Telegraph", "url": "http://www.telegraph.co.uk/finance/personalfinance/money-saving-tips/jessicainvestigates/11932972/ScottishPower-ignored-my-meter-readings.html", "country": "CH", "title": "'ScottishPower ignored my meter readings'", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "'ScottishPower ignored my meter readings'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T21:03:00.000+03:00", "replies_count": 0, "uuid": "250a93a58e31ea135d4152ebdb571e47fcb53d7f"}, "author": "Jessica Gorst-Williams", "url": "http://www.telegraph.co.uk/finance/personalfinance/money-saving-tips/jessicainvestigates/11932972/ScottishPower-ignored-my-meter-readings.html", "ord_in_thread": 0, "title": "'ScottishPower ignored my meter readings'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'ScottishPower ignored my meter readings' A new mum on a dual-fuel tariff finds herself £500 in debt ScottishPower failed to register meter readings on the dual-fuel account for eight months Comments \nWhen we switched to ScottishPower over a year ago after moving house, the supply was put on a dual tariff for both gas and electricity. It was agreed that I would pay £88 a month by direct debit. \nI submitted both meter readings at the beginning of this year. However, on checking my online account, I realised we were only being billed for gas. I queried this with ScottishPower, which, for five months, sent me delaying emails. \nAmy Moore and her daughter Daisy Photo: Philip Hollis \nThen one came prompting me to submit current meter readings. I did this and was notified at that point that my direct debit was increasing to £166 a month. The meter readings I had submitted had not been taken into account. It turned out that I owed £515. \nHad I known this was building up, I could have increased my direct debits and paid off the deficit as I went along. Can you help? Amy Moore, Hants \nScottishPower failed to register meter readings on your dual-fuel account for eight months. It says that, when you joined it, it calculated according to the usage at your old address. This came to £1,096 annually, while the energy you actually used cost £1,496 over the past year. \nThis came at a time when you were on a tight budget as you were on maternity leave. Indeed, the arrival of your new baby probably triggered the increased energy consumption. \n• 'One year on, where's my Scottish Power gas bill?' \nThe cheapest tariff ScottishPower has offered over the time at issue is its Online Energy July 2016, which would have cost you £1,293. \nIt is now changing your supply over to this better tariff and crediting your account with the £203 difference between it and the one you had actually been put on. \nScottishPower says that with the recent recruitment of 500 additional customer advisers to its call centres, its average speed of answering calls has greatly improved. \n• If you want to contact Jessica, click here", "external_links": [], "published": "2015-10-16T21:03:00.000+03:00", "crawled": "2015-10-16T22:53:25.824+03:00", "highlightTitle": ""}