{"organizations": [], "uuid": "f7a6f75590ec73692d7533d0001718d4092d6843", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/k/3/x/k/t/image.related.articleLeadwide.620x349.gkgekg.png/1445553023403.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/20/industrials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/aviation/qantas-expects-lower-fuel-bill-thanks-to-the-oil-price-slump-20151022-gkgekg.html", "country": "AU", "title": "Qantas expects lower fuel bill thanks to the oil price slump", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Qantas expects lower fuel bill thanks to the oil price slump", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "f7a6f75590ec73692d7533d0001718d4092d6843"}, "author": "", "url": "http://www.smh.com.au/business/aviation/qantas-expects-lower-fuel-bill-thanks-to-the-oil-price-slump-20151022-gkgekg.html", "ord_in_thread": 0, "title": "Qantas expects lower fuel bill thanks to the oil price slump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Qantas spent a record $4.5 billion on fuel in the 2013-14 financial year, but since then, costs have been going down.\nQantas has lowered its forecast for how much it will spend on fuel this financial year slightly as a result of the ongoing weakness in the oil price.\nThe airline, in its September traffic update published ahead of its annual meeting in Perth on Friday, said its full-year fuel bill was expected to be between a low of $3.61 billion and a worst-case scenario of $3.85 billion, including the cost of its options. That compares with an August forecast of between $3.64 billion and $3.94 billion. In the 2014-15 financial year, the carrier had reported a fuel bill of $3.9 billion, down from a record $4.5 billion the previous year.\nQantas said the fuel bill estimate covered a planned increase in international flights. The airline expects to raise international capacity by 6 per cent this year at Qantas, and by 8 per cent at its Jetstar offshoot.\nFor the December half, Qantas expects a first-half fuel bill of $1.76 billion, down nearly 19 per cent from $2.16 billion the prior year.\nAdvertisement In addition to the lower fuel costs, Qantas has reported an improved operating environment. Since the start of the financial year in July, it has reported a 1.1 percentage point rise in seats, filling 81.1 per cent across its network. It has also reported a higher revenue per available seat kilometre in its domestic and international arms compared with last year.\nAnalysts expect Qantas will report record pretax underlying earnings of $1.69 billion this financial year, giving the airline the capacity to return cash to investors beyond the already announced $505 million payout that shareholders will vote on at their annual meeting on Friday.\nHowever, Qantas chairman Leigh Clifford last week warned investors that capital management would not be considered again until the half-year results in February , and the airline wanted to ensure it retained a conservative cash balance in the case of unforeseen events like a volcanic eruption or outbreaks of travel-demand impacting diseases such as SARS.\nAt its annual meeting in Perth, the airline is expected to face questions from the Australian Shareholders Association, which has recommended its members vote against its remuneration report. The ASA said the long-term incentive plan was of concern and should be longer than a three-year period. It also would like Qantas to increase its targets for total shareholder returns and use actual value rather than \"fair value\" when awarding share rights to its chief executive Alan Joyce.\nThe airline's monthly statistics released on Friday showed that in September, Qantas reported an overall 3.6 per cent increase in capacity that was outpaced by a 5.5 per cent increase in demand. Both yields, or returns from fares, and the percentage of seats filled rose at Qantas and Jetstar in the domestic market.\nIn the international market, Qantas reported flat revenue per available seat kilometre. Jetstar's was lower as it transitions to an all Boeing 787-9 fleet in September with more seats to fill.", "external_links": ["http://www.watoday.com.au/business/aviation/qantas-will-seek-further-growth-in-hong-kong-20150908-gjhsoh.html"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T02:04:17.176+03:00", "highlightTitle": ""}