{"organizations": [], "uuid": "498f80290cab0792a2a0ecd23f18d420aeb82f5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-15/australian-jobs-unexpectedly-fall-in-september-aussie-drops", "country": "US", "title": "Australian Jobs Unexpectedly Fall in September, Aussie Drops", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Australian Jobs Unexpectedly Fall in September, Aussie Drops - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T08:35:00.000+03:00", "replies_count": 0, "uuid": "498f80290cab0792a2a0ecd23f18d420aeb82f5f"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-15/australian-jobs-unexpectedly-fall-in-september-aussie-drops", "ord_in_thread": 0, "title": "Australian Jobs Unexpectedly Fall in September, Aussie Drops", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australian employers unexpectedly cut jobs in September, signaling record-low interest rates are yet to put the economy on a sustainable footing and offset a slump in mining investment.\nEmployment fell 5,100 from August compared with a median forecast of a 9,600 increase. The jobless rate held at 6.2 percent, matching the median forecast. Full-time jobs fell 13,900; part-time employment rose by 8,900 The participation rate, a measure of the labor force as a proportion of the population, fell to 64.9 percent from 65 percent in August and compared with a median forecast of 65 percent The central bank cut its benchmark rate to a record-low 2 percent in May but investment by non-mining firms has so far failed to pick up leaving housing construction as one of the few bright spots in the economy.\n“The labor market’s resilience masks weak fundamental trends, which are likely to weigh on domestic demand in future,” Konstantinos Venetis, an economist at Lombard Street Research, said in a research note ahead of the release. “The RBA’s task is only going to get harder from here. Domestic and external macro headwinds are set to intensify, skewing the risks for real GDP growth to the downside.”\nThe Australian dollar fell and traded at 73.11 U.S. cents at 11:34 a.m. in Sydney, from 73.40 cents before the data was released.", "external_links": [], "published": "2015-10-15T08:35:00.000+03:00", "crawled": "2015-10-15T03:41:45.865+03:00", "highlightTitle": ""}