{"organizations": [], "uuid": "2b422ea3c8ea1d2ade316a81bf44a0ce702c8119", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/2hVp1oWASU.7CYD0oBj40w--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://globalfinance.zenfs.com/en_us/News/Reuters/51c7670042204247275365d8eebce810.cf.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/dell-dusts-off-dot-com-212515141.html", "country": "GB", "title": "Why Dell Is Using Tracking Stock for Its EMC Bid - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Why Dell Is Using Tracking Stock for Its EMC Bid - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "2b422ea3c8ea1d2ade316a81bf44a0ce702c8119"}, "author": "Lu Wang, Oliver Renick, Dani Burger", "url": "http://finance.yahoo.com/news/dell-dusts-off-dot-com-212515141.html", "ord_in_thread": 0, "title": "Why Dell Is Using Tracking Stock for Its EMC Bid - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\n\nAbout a quarter of Dell Inc.’s $67 billion valuation for EMC Corp. hinges on a type of security that most of Wall Street considers an artifact of the technology bubble: tracking stock. Should anyone be concerned?\nRoughly $9 of the $33.15 a share takeover price will be conjured by allowing EMC holders to hang on to the company’s stake in Palo Alto, California-based software maker VMware Inc., acquired 11 years ago. To do that they’ll get stock designed to mimic shares of VMware that are already publicly traded. In effect, EMC holders get a market for shares they couldn’t previously touch -- although they won’t exactly own them, either.\nMore from Bloomberg.com: This Analyst Says China's Stock Rally-to-Rout Is About to Repeat \nThe concept of creating stock that reflects a set of assets without conferring all the normal privileges of ownership dates to the 1980s -- and became a full-blown craze during the dot-com era. The market crash of 2000 spelled doom for the lion’s share of trackers. A handful still exist in John Malone’s media empire, while most of the others have been retired.\n“My experience had been that they’d gone away, they were popular in the late ’90s but they all either converted into real spinoffs or got folded back into the parents,” Joseph Cornell, founder and editor at Spin-Off Research in Chicago, said in a phone interview. “They’re a flaky security. They don’t have the same characteristics of a real spinoff -- it’s a way to highlight the assets without giving up control. They’re kind of a ‘trust-me’ security.”\nMore from Bloomberg.com: Internet of Things? Stock You've Never Heard of Just Rose 500% \nEMC owns roughly 81 percent of VMware, with the rest trading publicly under ticker VMW. Hopkinton, Massachusetts-based EMC paid $635 million for VMware in 2004, then spun off a stake in 2007. The business carried a market value of more than $34 billion as of last week, ranking it among the biggest corporate investment returns in tech history.\nPossible Discount While the companies released only a few details about how the WMware tracker will be designed, Michael Dell and EMC Chief Executive Officer Joseph M. Tucci said in a CNBC interview Monday that they expect the price to hew closely to the public version of VMware when it’s issued. Still, the two securities won’t be the same.\nMore from Bloomberg.com: Dell to Buy EMC in Deal Worth About $67 Billion \n\"They don’t have any voting rights and they don’t actually own the asset, only the economic interest in the asset,\" Derrick Wood, an analyst at Susquehanna International Group LLP said by phone. \"If VMware were to go bankrupt, they’d have no rights on any of the assets. We think that the tracking stock will trade at a 5 to 10 percent discount because it doesn’t have any voting rights.\"\nAt the same time, benefits may accrue from the additional liquidity in VMware, a company that differs from other tracking stock candidates because its assets are already known to investors who have had eight years to analyze its results as an independent firm.\n“It’s sort of unprecedented, but that’s the argument that EMC is making because they want to justify this idea that they can issue this as a good compensation for shareholders,” said Jason Benowitz, a New York-based senior portfolio manager at Roosevelt Investment Group Inc. which oversees $4.5 billion and owns shares of VMware.\n“Typically there is much less historical transparency into the operations of a business unit that has a tracking stock,” Benowitz said. “That is another reason why the tracking stock discount could be narrower in this case.”\nShare Dilution VMware stock dropped 8.1 percent on news of the buyout, a swoon analysts ascribed to concerns about millions of new shares coming to the market. Mizuho Securities USA cut its rating on VMware to neutral from buy on Monday.\n“We think the introduction of tracking stock combined with Dell’s purchase of EMC will be a negative for the stock,” analyst Abhey Lamba wrote. “Our checks on VMW’s near-term business remain positive but the increase in effective float will likely have a negative impact on stock performance.”\nMuch of the negative sentiment that blew up around tracking stocks over the last decade stems from their performance during the Internet bubble, when companies were eager to highlight anything with a dot-com handle.\nGM Pioneers Trackers have been around since 1984, when General Motors Co. introduced a class of stock linked to its former computer-services unit, Electronic Data Systems Corp. A second class, for its Hughes Electronics Corp. satellite unit, came out the following year. General Motors retired Electronic Data in June 1996, and spun off Hughes in 2003.\nDuring that span, as many as 39 trackers were minted -- though only 10 remained a year after GM disposed of Hughes in a deal with News Corp., according to a research note in 2004 from Lehman Brothers Holdings Inc. Among those that famously fizzled were Walt Disney Co.’s Go.com and Alcatel SA’s Alcatel Optronics.\nLiberty Media One corporate mogul who never gave up on the concept is Malone, the billionaire founder of Tele-Communications Inc. who is now chairman of Liberty Media Corp. Malone split his Liberty Interactive Corp. into two tracking stocks in 2012, one that tracks interests in home shopping services QVC and HSN and another that included interests in Expedia Inc., Time Warner Cable Inc. and AOL Inc.\n“I’d point to Liberty Media today, which has a collection of tracking stocks and people view the management as quite savvy,” Benowitz said. “They’ve been able to exchange these different tracking things to realize value over time, and they do it in a tax-efficient way.”\nThe VMware security differs from most earlier versions of tracking stocks in several respects. In most incarnations, such shares were issued to reflect subsidiary assets of a company that itself was publicly traded -- something EMC will no longer be. The stock being created in the Dell buyout will represent a stake in a full-blown, existing public company and trade in the same market as VMW’s common stock.\nViewed from that perspective, the creation of tracking stock to fuel Dell’s buyout of EMC makes more sense, according to a note from Kevin Buttigieg, an analyst at MKM Partners LLC. Among other things it shows that Dell wants to maintain control over a company in a way that simply selling the VMware stock outright wouldn’t have allowed.\n“EMC holders will have to decide whether they want to keep the VMware tracking stock or sell it and put their money elsewhere,” said Lamba at Mizuho. “It’s helping them get some more value out of their ownership, but if it were an all cash deal it would be more attractive. There’s more certainty in the value whereas a tracking stock depends on the value of VMware’s stock.”\nMore from Bloomberg.com\nThe Russians Are Going: London Listing Exodus as Prices Sag Ferrari Scion, Steered Away From Racing, Ends Up a Billionaire Fourteen Wall Street Veterans Share the Best Advice They've Ever Received Read Why Dell Is Using Tracking Stock for Its EMC Bid on bloomberg.com\nInformation Technology Personal Investing Ideas & Strategies VMware tracking stock", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T02:38:12.015+03:00", "highlightTitle": ""}