{"organizations": [], "uuid": "80555bb77abe8941f95d8c31e640f5d3e3cc2289", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30224842/grafton-county-economic-development-council-ceo-named-young-professional-of-the-year-at-rising-stars-awards-ceremony", "country": "US", "title": "Grafton County Economic Development Council CEO Named Young Professional of the Year at Rising Stars Awards Ceremony", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Grafton County Economic Development Council CEO Named Young Professional of the Year at Rising Stars Awards Ceremony - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:01:00.000+03:00", "replies_count": 0, "uuid": "80555bb77abe8941f95d8c31e640f5d3e3cc2289"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30224842/grafton-county-economic-development-council-ceo-named-young-professional-of-the-year-at-rising-stars-awards-ceremony", "ord_in_thread": 0, "title": "Grafton County Economic Development Council CEO Named Young Professional of the Year at Rising Stars Awards Ceremony", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chris Wellington, CEO of Grafton County Economic Development Council, received Young Professional award from Stay Work Play and NH Public Radio at the sixth annual Rising Stars Awards.\n(PRWEB) October 09, 2015\nThe sixth-annual Rising Stars Awards, an initiative of Stay Work Play, in partnership with New Hampshire Public Radio, welcomed more than 550 guests on Monday, October 5 to celebrate New Hampshire’s outstanding young people and organizations. The Rising Stars Awards was created in 2010 to celebrate and recognize New Hampshire’s young professionals and entrepreneurs, college students and the businesses and programs that go the extra mile to recruit and retain them.\nAmong the winners was Chris Wellington, the new CEO of the Grafton County Economic Development Council (GCEDC). Chris was named this year’s Young Professional of the Year for a combination of his professional and community service accomplishments. Prior to starting at GCEDC in April, Chris worked for the New Hampshire Division of Economic Development as a Business Resource Specialist. Chris has also served on various boards and committees including Big Brothers Big Sisters of New Hampshire, the Manchester Young Professional Network and Families in Transition.\n“All the finalists in each category have done so much for New Hampshire and it is truly an honor to receive a Rising Stars Award and be recognized as this year’s Young Professional of the Year,” said Chris Wellington, CEO of GCEDC. “This award provides me with even more incentive to make a difference in Grafton County and ensure we are meeting our mission of helping to create and retain jobs in the county and working closely with our 39 municipalities to move economic development projects and initiatives forward.”\n“The winners of this year’s Rising Stars Awards are a group of hardworking and innovative leaders who are setting an example for the culture of young people in our state. They are dedicated to giving back to their communities and being trailblazers to make NH a better place,” stated Kate Luczko, President & CEO of Stay Work Play. The Rising Stars Awards was hosted by Taylor Quimby, producer of NHPR’s “Word of Mouth” and Governor Maggie Hassan provided opening remarks. The Honorable Tina Nadeau, Chief Superior Court Justice, gave the keynote address.\nDuring the awards ceremony, winners were recognized in seven categories. The 2015 Rising Stars Awards winners are:\n-Young Entrepreneur of the Year\nAlex Freid, Post-Landfill Action Network (PLAN)\n-College Student of the Year\nAlicia Frazier, Southern New Hampshire University (SNHU)\n-Best Student Video\nAlicia Frazier, Southern New Hampshire University (SNHU)\n-Young Professional of the Year\nChris Wellington, Grafton County Economic Development Council\n-Civic Leader of the Year\nBryan Bouchard, Southern New Hampshire University (SNHU)\n-People’s Choice for Coolest Companies for Young Professionals\nCranmore Mountain Resort of North Conway\n-Coolest Companies for Young Professionals\nRed River Computers of Claremont\nSingle Digits of Bedford\n-Leadership Development Program of the Year\nHoffmann-Haas Fellowship, an initiative of the NH Center for Nonprofits\nAbout Grafton County Economic Development Council\nGCEDC is a 501(c)3 organization founded in 1997 and is one of ten recognized Regional Development Corporations in New Hampshire. GCEDC partners with municipalities and businesses throughout Grafton County to promote and support economic development projects and has several loan programs available to businesses to help retain and create jobs in the area. GCEDC also owns and operates the Enterprise Center at Plymouth in partnership with Plymouth State University and the Dartmouth Regional Technology Center in partnership with Dartmouth College and North Country Council. Additional information on GCEDC is available on the website http://www.graftoncountyedc.org or by contacting Chris Wellington at cwellington(at)graftoncountyedc(dot)org or (603) 674-3167.\n //www.prweb.com/releases/2015/10/prweb13013196.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13013196.htm"], "published": "2015-10-09T18:01:00.000+03:00", "crawled": "2015-10-10T07:18:21.803+03:00", "highlightTitle": ""}