{"organizations": [], "uuid": "3c6ce2dca5c749a720ac8498ac30493f8b2053dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-14/bank-of-korea-decision-day-guide-look-for-revisions-to-cpi-gdp", "country": "US", "title": "Bank of Korea Decision-Day Guide: Look for Revisions to CPI, GDP", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Bank of Korea Decision-Day Guide: Look for Revisions to CPI, GDP - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T05:00:00.000+03:00", "replies_count": 0, "uuid": "3c6ce2dca5c749a720ac8498ac30493f8b2053dd"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-14/bank-of-korea-decision-day-guide-look-for-revisions-to-cpi-gdp", "ord_in_thread": 0, "title": "Bank of Korea Decision-Day Guide: Look for Revisions to CPI, GDP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bank of Korea board members will decide Thursday whether to leave the key interest rate unchanged at a record-low 1.5 percent or cut it even lower.\nWith 15 of 17 economists surveyed by Bloomberg projecting no change, the focus will be on the BOK’s quarterly update of projections for the consumer price index and economic growth, as well as Governor Lee Ju Yeol’s press conference. Just two analysts forecast a 25 basis-points reduction to a new low of 1.25 percent.\nRecent comments by Governor Lee and Finance Minister Choi Kyung Hwan suggest policy makers are upbeat about the economy, especially domestic demand. Industrial output in August unexpectedly expanded along with an increase in retail sales. Still, the ratio of inventories to shipments for manufactured goods was close to the highest level since 2008 and exports, which account for about half the nation’s gross domestic product, have fallen every month this year.\nThe BOK will announce its policy decision about 10 a.m. in Seoul, and a statement on the decision is released about 10:40 a.m. The revised outlooks will follow. Here are the key points to watch:\nPolicy decision Analysts at Barclays Plc, Nomura Holdings Inc., and Citigroup Inc. are among those who postponed their call for an October rate cut to later this year on signs of better-than-expected economic activity.\nRecent comments by the governor suggest the central bank doesn’t see an immediate need for lower borrowing costs. Lee told lawmakers this month that he disagreed with views that the BOK must cut now to make use of the opportunity created by the Federal Reserve postponing an increase in rates in the U.S.\nStill, the possibility of a reduction can’t be ruled out. The BOK has surprised markets in the past, such as with its cut in March, when only two of 17 analysts surveyed had predicted the change.\nInflation and growth BOK watchers and investors will focus on how much the central bank reduces its estimates for 2.8 percent growth and 0.9 percent inflation for this year. While analysts in the most recent Bloomberg survey projected 2.4 percent GDP expansion, Lee has signaled only a slight revision.\nBOK has been more optimistic about 2016, forecasting growth of 3.3 percent. A change in the forecast will help gauge whether the central bank sees recent positive data as temporary or sustainable.\nLee’s comments\nWith the governor making notably fewer public appearances than the finance minister, his comments at the press briefing Thursday will be closely watched.\nBond yields have been hovering near record lows, suggesting that markets still see a rate cut as likely in the near term. Investors will be searching for hints to justify their views.\nPrevious comments by Lee that “current interest rate is supportive of the economy” and that “growth is in line with previous projections” have been read as signals that the BOK doesn’t think lower rates are needed.\nThe Governor could stress the need for structural reforms, rather than shifts in monetary policy. Before a rate cut, Lee has made comments including that the central bank puts a priority on supporting the economy.\nAs South Korea is the world’s biggest exporter to neighboring China, a larger-than-expected decline in China’s imports would bode ill for the economy.\nAnother key area of interest would be currency movement. The Korean won, which weakened 5.9 percent against the dollar in the third quarter, strengthened 3.3 percent just this month. It also gained against the yen. A gradual weakness in the won tends to benefit exporters, and the central bank has expressed caution against excessive currency movements in one direction.", "external_links": [], "published": "2015-10-15T05:00:00.000+03:00", "crawled": "2015-10-15T00:25:02.672+03:00", "highlightTitle": ""}