{"organizations": ["Inc.", "FTI"], "uuid": "836c4c4f8c95458928e4a734235be2bcc89507e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=FCN", "section_title": "Yahoo! Finance: FCN News", "url": "http://finance.yahoo.com/news/fti-consulting-projects-u-online-113000205.html", "country": "US", "title": "FTI Consulting Projects U.S. Online Retail Sales to be $380 Billion in 2016", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "FTI Consulting Projects U.S. Online Retail Sales to be $380 Billion in 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:30:00.000+03:00", "replies_count": 0, "uuid": "836c4c4f8c95458928e4a734235be2bcc89507e9"}, "author": "", "url": "http://finance.yahoo.com/news/fti-consulting-projects-u-online-113000205.html", "ord_in_thread": 0, "title": "FTI Consulting Projects U.S. Online Retail Sales to be $380 Billion in 2016", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FTI Consulting Projects U.S. Online Retail Sales to be $380 Billion in 2016 FTI Consulting, Inc. 6 hours ago Content preferences Done \nWASHINGTON, Oct. 22, 2015 (GLOBE NEWSWIRE) -- FTI Consulting, Inc. ( FCN ), the global business advisory firm dedicated to helping organizations protect and enhance their enterprise value, today released its U.S. Online Retail Sales Forecast: Middle Aged but Still Looking Good , which projects U.S. online retail sales of consumer goods to reach $380 billion in 2016, a 12 percent increase from expected 2015 U.S. online sales of $340 billion. \nGenerally, U.S. online sales continue to grow at low double-digit rates compared to low single-digit rates for store-based sales. However, online sales growth has slowed down slightly in recent quarters and FTI Consulting's Retail & Consumer Products practice expects this trend of gradually slowing growth and smaller gains in market share to persist as the online channel continues to mature. These trends can vary materially by product category. \nUltimately, FTI Consulting’s forecast model projects U.S. online sales to reach $550 billion by 2020 and market share for online sales to be 17 percent compared to 10.5 percent currently. Looking ahead, the firm’s Retail & Consumer Products practice expects overall online market share to plateau at approximately 20 percent a decade from now, as inherent limits to the channel’s sales and market share potential are approached. \n“Despite the online retail channel’s double-digit sales growth rate, there are some distinct signs that the channel as a whole has passed peak growth and that deceleration is setting in,” said Bob Duffy , Global Leader of FTI Consulting’s Corporate Finance/Restructuring segment and the firm’s Retail & Consumer Products practice. “Given the nature of the consumer adoption model that governs such phenomena, we can project how this maturation will occur.” \nBy now, most large omni-channel retailers have successfully developed their online businesses, with many deriving 10 percent or more of total sales from the online channel. However, much of this growth has been cannibalized from stores. \n“The next challenge for these retailers will be to move beyond the objective of sales growth at any cost and to ensure that their online platforms, in concert with store-based strategies, are improving ROI of the entire enterprise rather than redirecting sales,” added Mr. Duffy. \nThe full forecast can be accessed here . \nAbout FTI Consulting FTI Consulting, Inc. is a global business advisory firm dedicated to helping organizations protect and enhance enterprise value in an increasingly complex legal, regulatory and economic environment. With more than 4,400 employees located in 26 countries, FTI Consulting professionals work closely with clients to anticipate, illuminate and overcome complex business challenges in areas such as investigations, litigation, mergers and acquisitions, regulatory issues, reputation management, strategic communications and restructuring. The Company generated $1.76 billion in revenues during fiscal year 2014. For more information, visit www.fticonsulting.com and connect with us on Twitter (@FTIConsulting) , Facebook and LinkedIn . FTI Consulting", "external_links": [], "published": "2015-10-22T14:30:00.000+03:00", "crawled": "2015-10-22T20:57:12.860+03:00", "highlightTitle": ""}