{"organizations": [], "uuid": "e0e166a1ed226470141120c3e736ab7b53dac48d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/bxJMP4.qcn8uheJdyzmCQg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/315b8d997e77e53ebb1522452dc3cfeaf1723f21_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/g20-ministers-endorse-crackdown-corporate-152848974.html", "country": "GB", "title": "G20 ministers endorse crackdown on corporate tax evasion", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "G20 ministers endorse crackdown on corporate tax evasion", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:51:00.000+03:00", "replies_count": 0, "uuid": "e0e166a1ed226470141120c3e736ab7b53dac48d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/g20-ministers-endorse-crackdown-corporate-152848974.html", "ord_in_thread": 0, "title": "G20 ministers endorse crackdown on corporate tax evasion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Oct 9, 2015, 17:15 BST - UK Markets closed G20 ministers endorse crackdown on corporate tax evasion By Jeremy Tordjman | AFP – 46 minutes ago View Photo \n\nFinance ministers from the world's leading economies gave the green light Friday to a new plan to crack down on tax evasion by multi-national corporations which costs countries at least $100 billion a year. \nThe so-called Base Erosion and Profit Shifting (BEPS) plan, which seeks to close the loopholes multi-nationals use to avoid taxes, was adopted by finance ministers from the G20 group of leading industrialized and emerging economies at a meeting in Lima, Peru. \nG20 leaders must now give final approval at a summit in November in Turkey, although the initiative was swiftly dismissed as lacking bite by one prominent critic. \nThe 15-point plan aims to tackle low tax bills for the likes of Google (Xetra: A0B7FY - news ) and McDonald's, which have managed to sharply reduce their taxes while remaining within the law, provoking public outrage in recent years. \nTurkish Deputy Prime Minister Cevdet Yilmaz, who announced the G20 decision, called it a \"historic moment\" for the fight against tax evasion that costs governments an estimated $100 billion to $240 billion a year or more. \nHe said the plan addressed a \"very comprehensive set of issues\" including profit-shifting across borders, corporations' use of no-tax status in multiple countries and the digital economy. \n\"These are very complicated issues that required an extensive technical effort and a hard-to-build consensus in some cases,\" he said. \nBut the work on consensus-building has only just begun. \nPreventing countries from shifting profits to low-tax jurisdictions and debt to high-tax jurisdictions will require \"a very large group of countries\" to get on board with the plan, Yilmaz said. \n\"We encourage the participation of non-G20 countries, particularly the developing countries, on an equal footing,\" he told a press conference. \nInternational charity Oxfam has criticized the plan as a \"toothless\" package that will do nothing to stop poor nations being cheated out of billions of dollars. \n\"Rich governments are all bark and no bite when it comes to corporate tax dodging,\" said Oxfam's Manon Aubry when the plan was announced Monday. \nBut the author of the long-awaited initiative, the Organisation for Economic Cooperation and Development (OECD), said it would give governments across the board a much-needed fiscal boost. \n\"Base erosion and profit shifting is sapping our economies of the resources needed to jump-start growth, tackle the effects of the global economic crisis and create better opportunities for all,\" said OECD secretary general Angel Gurria. \n- Globalization loopholes - \nThe man who supervised the drafting of the plan, the OECD's Pascal Saint-Amans, has said it means \"playtime is over\" for tax-dodging multi-nationals. \nThe OECD calculates that national governments lose $100 billion to $240 billion a year, or four to 10 percent of global tax revenues, because of companies that game the system. \nSaint-Amans described that as a \"very conservative\" figure. \nThe plan, which applies to international companies with revenues of at least 750 million euros, seeks to make them pay tax in the country where their main business activity is based. \nIt (Other OTC: ITGL - news ) also seeks to stop multi-nationals from winning no-tax status in two places at once, using technicalities to declare they are based in low-tax jurisdictions and artificially shifting profits to foreign subsidiaries. \nIt will require them to detail their business to tax authorities country by country. \nThe OECD has called for a multilateral deal by the end of 2016 enabling countries to update bilateral tax treaties in line with the new plan without the need to renegotiate them one by one. \nIt comes nearly a year after the \"LuxLeaks\" revelations that some of the world's biggest companies -- including Pepsi and Ikea -- lowered their tax rates to as little as one percent in secret pacts with tax authorities in Luxembourg. \nLuxembourg's Finance Minister Pierre Gramegna joined the calls for governments around the world to sign up for the new plan. \n\"We need a level-playing field, which means we have to implement it all together and at the same pace,\" he said.", "external_links": [], "published": "2015-10-09T19:51:00.000+03:00", "crawled": "2015-10-09T20:01:04.091+03:00", "highlightTitle": ""}