{"organizations": [], "uuid": "84044ca2edb6abaa311f4303c671036884215b57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/i/m/l/u/image.related.afrArticleLead.620x365.gkiknj.png/1445852697874.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/world/startups-take-on-challenge-of-nuclear-fusion-20151026-gkiknj", "country": "AU", "title": "Start-ups take on challenge of nuclear fusion", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Start-ups take on challenge of nuclear fusion | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T10:25:00.000+02:00", "replies_count": 0, "uuid": "84044ca2edb6abaa311f4303c671036884215b57"}, "author": "Dino Grandoni", "url": "http://www.afr.com/news/world/startups-take-on-challenge-of-nuclear-fusion-20151026-gkiknj", "ord_in_thread": 0, "title": "Start-ups take on challenge of nuclear fusion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The C-2U machine at Tri Alpha Energy, a fusion company in California. NYT by Dino Grandoni A group of start-ups is promising a new and virtually unlimited source of power, one that produces none of the gases scientists say contribute to global warming.\nThe only problem? A way to harness the energy source, nuclear fusion — the reaction that gives birth to sunlight — still needs to be invented.\nSuch an achievement has long evaded government scientists and university researchers, despite decades of work and billions of dollars in research. But backed by hundreds of millions in venture capital and some of the wealthiest people in the technology industry, a handful of young companies say they can succeed where government has fallen short.\nNuclear fusion is one of many areas of science and energy now getting the backing of venture capitalists. The investor dollars coming into fusion start-ups, like those in many areas of science, still pale in comparison with the money spent by governments. But signs of progress, including some results that have eclipsed government projects, have generated hope among some scientists that the companies could help develop a fusion reactor within their lifetimes.\nAt the very least, they talk a confident game — even though the history of fusion science is littered with frustration and false starts. Some fusion scientists, unable to evaluate the start-ups' unpublished scientific results, doubt the companies' chances.\n\"The fusion era is here and coming,\" said William Lese, a managing partner at Braemar Energy Ventures, a venture capital firm with a stake in General Fusion, one of the leading start-ups in the field. \"The increase in activity in this space is perhaps a sign of that.\"\nNuclear fusion occurs when two atoms are squeezed together so tightly that they merge. That single, larger atom releases a tremendous amount of energy.\nThis happens naturally at the centre of the sun, where gravity easily crushes hydrogen into helium, spewing forth the sunlight that reaches Earth. But on Earth, making hydrogen hot and dense enough to sustain a controlled fusion reaction — one that does not detonate like a thermonuclear bomb — has been a challenge.\n The potential upsides of the power, though, provide a huge incentive. Fusion reactions release no carbon dioxide. Their fuel, derived from water, is abundant. Compared with contemporary nuclear reactors, which produce energy by splitting atoms apart, a fusion plant would produce little radioactive waste.\nThe possibilities have attracted Jeffrey Bezos, founder of Amazon.com. He has invested in General Fusion, a start-up in British Columbia, through Bezos Expeditions, the firm that manages his venture capital investments. Paul Allen, a co-founder of Microsoft, is betting on another fusion company, Tri Alpha Energy, based in Foothill Ranch, California, an hour south of Los Angeles, through his venture arm, Vulcan Capital.\nPeter Thiel — the co-founder of PayPal, who once lamented the superficiality of the technology sector by saying, \"We were promised flying cars and we got 140 characters\" — has invested in a third fusion start-up, Helion Energy, based near Seattle, through Mithril Capital Management.\nGovernment money fueled a surge in fusion research in the 1970s, but the fusion budget was cut nearly in half over the next decade. Federal research narrowed on what scientists saw as the most promising prototype — a machine called a tokamak, which uses magnets to contain and fuse a spinning, doughnut-shape cloud of hydrogen.\nToday's start-ups are trying to perfect some of the ideas that the government left by the wayside.\nAfter earning his doctorate from the University of California, Irvine, in the mid-1990s, Michl Binderbauer had trouble securing federal funds to research an alternative approach to fusion that the American government briefly explored — one that adds the element boron into the hydrogen fuel. The advantage of the mixture is that the reaction does not fling off neutrons that, like shrapnel, can wear down machine parts and make them radioactive.\nMr Binderbauer, along with his PhD adviser, Norman Rostoker, founded Tri Alpha Energy, eventually raising money from the venture capital arms of Mr Allen and the Rockefeller family. The company has raised over $US200 million.\n\"We basically said, \"What would an ideal reactor look like?' \" said Mr Binderbauer, who is now the company's chief technology officer. Mr Rostoker died late last year.\nGeneral Fusion is pursuing an approach that uses pistons to generate shock waves through the hydrogen gas. Compressed hard enough, the hydrogen atoms will begin to fuse. General Fusion has raised about $US74 million from private investors and another $US20 million from the Canadian government.\nIts reactor concept, like that of Tri Alpha Energy, would yield power plants much smaller than a commercially viable tokamak, which would need to be larger than many stadiums are in order to work. General Fusion's idea to compress a ball of hydrogen, too, is borrowed from a government project aborted decades ago. The company's innovation on that approach is to use cannon-size pistons for the compression.\nCritics in the nuclear physics field say it is unlikely start-ups will succeed with these alternative approaches.\n\"They just keep pounding on the same dead horse,\" said Edward Morse, a nuclear physicist at the University of California, Berkeley. \"What happens in fusion is that the same ideas pop up every two decades. It's like a game of whack-a-mole.\"\nIn addition, private funds cannot match those of the most ambitious government fusion energy project, the International Thermonuclear Experimental Reactor, or ITER, a stadium-size tokamak being built in France by the European Union, along with the United States and five other nations, for about $US14 billion. The United States is committed to funding about 9 per cent of the project.\nStill, the Energy Department is also hedging its bet, granting $US30 million to alternative fusion projects, including Helion Energy, which received $US4 million.\n\"In all of our selections, it's not about a start-up versus something else,\" said Eric Rohlfing, deputy director for technology of the Advanced Research Projects Agency-Energy, the government agency that made the grants. \"It's about the quality of the idea.\"\nThe start-ups counter critics by saying that they can be more efficient than government projects.\nWhen Tri Alpha Energy's panel of outside advisers visited the construction site of the company's lab in 2007, the concrete was still being poured. Some advisers doubted the company would be conducting experiments within a year, as Mr Binderbauer said they would.\nBut by the following year, the machine was ready. \"When I walked these guys out there to see that, their jaws dropped,\" Mr Binderbauer said.\n\"I do recall being surprised by how fast they said they would get the facility ready,\" said Burton Richter, a professor emeritus at Stanford and Nobel laureate in physics who advised Tri Alpha Energy.\nThis past June, Tri Alpha reached a new milestone: Its machine superheated a ball of hydrogen to 10 million degrees Celsius and held it for five milliseconds — much longer than government projects achieved using the same method.\n\"You may ask: 'Five milliseconds? That's nothing.' Certainly, that's the blink of an eye to a layperson,\" Mr Binderbauer said. \"But in our field, that's half an eternity.\" His next goal is to increase that temperature tenfold.\nOther fusion efforts have set even more ambitious goals. When Lockheed Martin announced its own fusion project last year, the company said it expected to build a prototype within five years.\nBut history would suggest that struggles lie ahead. For example, the American government's other major approach to fusion, used by a California lab that fires 192 giant lasers at a container holding hydrogen to compress and fuse it, missed a 2012 deadline for producing more energy than the lasers put in.\nThat checkered past is not stopping the start-ups.\n\"We're moving very quickly,\" said Michael Delage, vice president for strategy at General Fusion. \"Is it two years away? Three years away? Four years away? Maybe. We'll let you know when we get there.\"", "external_links": [], "published": "2015-10-26T10:25:00.000+02:00", "crawled": "2015-10-26T13:10:37.896+02:00", "highlightTitle": ""}