{"organizations": [], "uuid": "271bf5d703c936af918a0bfcdf604e85c8342322", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/g/f/4/j/image.related.afrArticleLead.620x365.gkgely.png/1445554954025.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/opinion/why-cant-soviet-stolen-art-be-recovered-but-nazi-theft-can-20151022-gkgely", "country": "AU", "title": "Why can't Soviet stolen art be recovered, but Nazi theft can?", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why can't Soviet stolen art be recovered, but Nazi theft can? | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:48:00.000+03:00", "replies_count": 0, "uuid": "271bf5d703c936af918a0bfcdf604e85c8342322"}, "author": "Noah Feldman", "url": "http://www.afr.com/opinion/why-cant-soviet-stolen-art-be-recovered-but-nazi-theft-can-20151022-gkgely", "ord_in_thread": 0, "title": "Why can't Soviet stolen art be recovered, but Nazi theft can?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why does some Nazi-stolen art - , like the Gustav Klimt painting in the film \"Woman in Gold\" - end up back with its owners, while Soviet-stolen works do not? Roadshow Publicity by Noah Feldman Vincent van Gogh's \"The Night Cafe\" will stay at the Yale University Art Gallery, the US Court of Appeals for the 2nd Circuit ruled this week, even though the Bolsheviks stole it from a private collector in 1918. The court said it has no authority to consider the validity of a foreign government's act confiscating private property.\nSo how come confiscated Nazi art, like the Gustav Klimt painting in the film \"Woman in Gold,\" can end up returned to its rightful heirs, while Soviet-confiscated art can't? The legal answer turns out to be surprisingly convoluted. In essence, it's this: The Nazis are different.\nA whole bag of legal tricks has been used to dodge the doctrine that would otherwise bar courts from considering the ownership of stolen Nazi art. And the executive branch, from the 1950s until the present, has used its influence on behalf of the heirs to confiscated Nazi property, while making no comparable effort on behalf of those whose works were expropriated by the Communists.\nThe resulting landscape makes almost no sense. It's not as though the Soviet Union under Lenin and Stalin was so much more humane than Germany under Hitler. The Communists were responsible for roughly as many deaths as the Nazis -- maybe more, depending on how you count. Either the courts should return government-stolen property, or they shouldn't: The rules shouldn't vary based on details that are hard to follow even for lawyers.\nThe 2nd Circuit's decision in the Van Gogh case followed its decision in a 2012 case involving another painting originally owned by the same distinguished Russian collector, Ivan Morozov -- the portrait of Madame Cezanne in her conservatory held by the Metropolitan Museum of Art.\nBoth paintings were seized by the Bolsheviks in a decree of December 19, 1918, that targeted Morozov and two other private collectors. In 1933, the paintings were sold by the Soviets under Stalin to Stephen Carlton Clark, an American collector who was also the founder of the Baseball Hall of Fame in Cooperstown, New York. Clark donated them in his will, one to Yale where he'd gone to college and the other to the Met where he had served on the board.\nMorozov's great-grandson, Pierre Konowaloff, sued both institutions claiming ownership. The courts barred his suit under the doctrine known as the \"act of state\". This judge-made doctrine, formulated most clearly by the US Supreme Court in a 1964 case called Banco Nacional de Cuba v. Sabbatino, holds that courts \"will not examine the validity of a taking of property within its own territory by a foreign sovereign government, extant and recognised by this country at the time of suit,\" unless a treaty says otherwise.\nThe idea behind the act of state doctrine is plausible: The courts shouldn't be doing foreign policy. Sitting in judgment of the acts of a foreign sovereign would involve making finely detailed judgments about that government's actions under its domestic law as well as international law and perhaps U.S. law. That could anger foreign nations, and it would arguably violate the principle of \"comity,\" meaning mutual respect among sovereigns and courts.\n Because the Supreme Court has the last word on what courts can and can't do, the act of state doctrine is law. And you can see why the 2nd Circuit applied it to the paintings taken by the Bolsheviks. So long as the confiscation was an act of the Soviet state, the court can't revisit its validity.\nAnd what about Nazi art? Here things get messy. In 1947, in a decision by the great Judge Learned Hand, was sometimes known as the \"10th Justice,\" the 2nd Circuit applied the act of state doctrine and held that it couldn't consider the claims of Arnold Bernstein to the shipping line that he owned and that had been confiscated by the Nazis. Hand reasoned that, although the US had declared the Nazi regime illegitimate, any reparations claims would have to be worked out in negotiations that were then ongoing between the executive branch and the German government. He didn't want the courts to interfere in those reparations talks.\nIn 1949, in an extraordinary and unusual act, the State Department released a letter it sent to Bernstein's attorneys, which said that it was \"the policy of the Executive to relieve American courts from any restraint upon the exercise of their jurisdiction to pass upon the validity of the acts of Nazi officials.\" Responding to that statement, the 2nd Circuit reversed itself and in 1954 allowed Bernstein's suit to go forward.\nThe Bernstein letter is just one of several tools used to promote the idea of a Nazi exception to the act of state doctrine. One court held that the Nazi authority that confiscated art, the Einsatzstab Reichsleiter Rosenberg, wasn't technically the German government. (Morozov's heirs tried to claim that the Communist Party wasn't the state, to no avail.)\nIt's also been considered relevant by some courts that the Third Reich was repudiated its entirety by the international community, and that for some purposes the German government isn't considered its successor. But the current Russian state is also in an ambivalent relation to the former Soviet Union --and this distinction really shouldn't make a difference.\nFinally, the contemporary US government has taken active steps to facilitate the recovery of property stolen by Nazis, taking a lead role in the Holocaust era assets conference that produced the Terezin Declaration, seeking fair solutions of cultural disputes. The act of state doctrine doesn't apply if a treaty contradicts it, but that 2009 declaration isn't binding.\nThe upshot is that in this, as in so other things, the Nazis are treated as different, without a fully satisfying answer why. In this case, at least, the difference isn't justified by law but by complicated judicial politics. Don't expect any movies about Communist confiscated art anytime soon.\nNoah Feldman, a Bloomberg View columnist, is a professor of constitutional and international law at Harvard and the author of six books, most recently \"Cool War: The Future of Global Competition.\"", "external_links": [], "published": "2015-10-23T06:48:00.000+03:00", "crawled": "2015-10-23T05:03:20.563+03:00", "highlightTitle": ""}