{"organizations": [], "uuid": "8b5c5ff0271941a971ef94c23087c073760dd09c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/06/RETIREMENT-TH-T.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/personal-finance/tax-talk-know-income-tax-laws-to-ease-your-sunset-years/150265", "country": "IE", "title": "Income tax laws and retirement: Top 7 empowering points", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Income tax laws and retirement: Top 7 empowering points | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:06:00.000+03:00", "replies_count": 0, "uuid": "8b5c5ff0271941a971ef94c23087c073760dd09c"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/personal-finance/tax-talk-know-income-tax-laws-to-ease-your-sunset-years/150265", "ord_in_thread": 0, "title": "Income tax laws and retirement: Top 7 empowering points", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles 'India home to 2,080 uber-rich with wealth over $50 mn' Investing: Multiply your happiness Not future-ready We all would like to plan for a comfortable retirement and safeguard the sunset years of our life. Any person who has attained age of 60 years or more is qualified as senior citizen and a person aged 80 years or more is considered as very senior citizen for the purpose of income tax provisions. The law provides for additional income exemption limit for senior and very senior citizens. The basic income exemption limit for senior citizens is Rs 3 lakh for financial year 2015-16 while the very senior citizens currently enjoy higher exemption limit of Rs 5 lakh. Here we list top 7 empowering points you should know to make your life and those of your loved ones, easier in the future:\n1. Interest received on fixed deposits is taxable in the hands of recipient and the banks are required to deduct tax at source if such interest credited/payable by a branch exceeds Rs 10,000. If the taxable income of senior citizen, including interest on deposits, does not exceed basic exemption limit, a declaration in Form 15H can be furnished to the bank for no deduction of tax.\n2. The government introduced reverse mortgage scheme for senior citizens in 2008 with the intention of securing a stream of cash flow for them. Under this scheme, senior citizens can avail of periodic payments from approved lenders against the mortgage of their house while they continue to be the owner and occupy the house. They are not required to repay the loan during their lifetime but the loan is repaid through sale of the house property after their death. The government has extended benefit of the scheme in the form of taxation as well by exempting the mortgage transaction from purview of capital gain tax in the hands of the senior citizen. However, the transaction of sale of property by the mortgagee for the purpose of recovering the loan is regarded as transfer and liable for capital gain tax.\n3. With a view to mitigate hardships of preparing tax estimates and payment of taxes in three instalments during a year, relaxation has been provided to senior citizens from advance tax payment . The senior citizens not having business income are exempted from payment of advance tax during the year and are allowed to discharge their tax liability at the time of filing income tax return.\n4. Tax benefit is also available on the Senior Citizens Savings Scheme which provides steady source of income to the senior citizens. The amount invested under this scheme qualifies as tax saving investment under Section 80C for maximum deduction up to Rs 1.5 lakh.\n5. Medical expenses tend to escalate as people approach their old age. The government has provided some relief and support to senior citizens in this regard. A higher deduction can be availed in respect of payment towards medical insurance for senior and very senior citizens to the extent of Rs 30,000 per year from financial year 2015-16.\nFurther, in case no payment has been made towards medical insurance, very senior citizens can claim deduction up to maximum of Rs 30,000 per year towards actual medical expenses incurred by them.\n6. Additional deduction has been granted in respect of expenses incurred on medical treatment of specified ailments and supported by medical prescription from a specialist. Such deduction can be claimed up to Rs 60,000 for expenses incurred for senior citizens. From FY2015-16, higher deduction of up to Rs 80,000 is allowable for expenses incurred on medical treatment of the specified ailments for very senior citizens.\n7. As per income tax provisions, electronic filing of return is mandatory for persons with total income of Rs 5 lakh and above. However, very senior citizens are exempted from electronic filing of return even if their income exceeds Rs 5 lakh provided the returns are furnished in ITR 1 or ITR 2.\nThe writer is senior director, Deloitte Haskins and Sells. With inputs from Sheetal Gothoskar, manager, Deloitte Haskins and Sells LLP\n 13, 2015 12:06 am", "external_links": [], "published": "2015-10-13T08:06:00.000+03:00", "crawled": "2015-10-13T22:27:07.478+03:00", "highlightTitle": ""}