{"organizations": ["Facebook"], "uuid": "546d95560a3d19e5b76cac0b7c446aeba5446c26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zdnet.com", "main_image": "http://zdnet1.cbsistatic.com/hub/i/r/2015/10/16/60c5bc8a-5831-4e6c-9eaa-e218bbbb47f4/thumbnail/770x578/85afacb0a68ef7ccd1870c942222fe29/messenger-historical-messages-removed-zdnet-tsu.png", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=FB", "section_title": "Yahoo! Finance: FB News", "url": "http://www.zdnet.com/article/is-facebook-afraid-of-social-network-rival-tsu/", "country": "US", "title": "Is Facebook afraid of social network rival Tsu?", "performance_score": 1, "site": "zdnet.com", "participants_count": 0, "title_full": "Is Facebook afraid of social network rival Tsu?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:33:00.000+03:00", "replies_count": 0, "uuid": "546d95560a3d19e5b76cac0b7c446aeba5446c26"}, "author": "", "url": "http://www.zdnet.com/article/is-facebook-afraid-of-social-network-rival-tsu/", "ord_in_thread": 0, "title": "Is Facebook afraid of social network rival Tsu?", "locations": ["Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tsu"], "text": "ZDNet Japan Is Facebook afraid of social network rival Tsu? Tsu has 4.2 million users, while Facebook has over 1.4 billion. Yet the social networking Goliath has apparently stopped allowing Tsu users to post items to Facebook and has removed all historical posts and links referring to the site. | Topic: Social Enterprise \nOn September 25, users of social network site Tsu discovered that they could no longer post items to Facebook or Instagram mentioning the URL \"Tsu.co\". Tsu users and employees reported these blocks to Facebook and Instagram. Tsu users commented across the platform that there was an issue. \nA few days later the Tsu api to Facebook was shut down. Error messages referred to the fact that the content was deemed to be malicious. What's Hot on ZDNet Thanks to Microsoft, iPhone 6s Plus is now a great enterprise smartphone \nWho is Tsu to earn this distinction? \nIt opened up its \"Open Web\" platform to enable viral content to be searchable across the web and has recently launched TsuGroups to beta test communities . User criticism \nIn the past, some users have criticised Tsu for permitting images on the platform that were not created by users. The platform has since introduced checks and measures to ensure that content was original. It has refused to pay users that posted images grabbed from the web, or used scripts, bots and other social activities to try to game the system. \nAlso, some users have complained that they did not receive pay outs when they reached the pay-out minimum of $100. Popular users on Tsu can earn over $100 per day, but the majority of users make only a few cents from ad revenue. \nThe social network start-up signed up to become a Facebook partner, using Facebook's Post, Share and Connect apis to enable its users to share their Tsu content on Facebook. \nFacebook, like Apple, has an approval process for apps that access its platform. Tsu's access app was approved on April 30 2015, and users have been cross posting items to the Facebook since then. Since September 25th 2015 any user who types the Tsu.co URL into Facebook Messenger is blocked from doing so. \nInstagram images now load with the caption and Tsu URL stripped from the upload. \nMentioning the URL on your Instagram profile throws a \"Link not allowed\" error. \nInitially when photos were shared from Tsu to Facebook, a photo album called \"Tsu photos\" was created. \nThe album no longer appears in any Facebook user profiles who used the sharing feature on Tsu. Old Facebook Messenger messages referencing the URL have been removed. \nRapper 50 Cent has a profile page on Facebook with over 38 million Likes of the page. He is also a verified user on Tsu with over 131,000 followers. \nOn July 3, the rapper posted a Power Premier video directly to Facebook. He included a link to for fans to watch the video on Tsu.co. \nHe did not use Tsu's share api to access Facebook but directly typed the message. His post was removed by Facebook. \nTsu co-founder Drew Ginsburg has been posting images to Facebook for almost three years without any issues while the social networking platform was in stealth. \nHe said that \"two to three years of [his Tsu content] photos are missing from Facebook without any notification.\" \nBritish artist Claudia Everest has a profile on Tsu and a Facebook page which she uses to sell her dog pictures. She has posted an average of 25 pictures per day for 10 months from Tsu to her Facebook profile and then manually added the links to her \"A dog a day\" Facebook business page. \nShe estimates that over 7,500 posts have been removed from Facebook. \"It has had quite an impact on myself and my business,\" said Everest. \"The whole idea that Facebook have labelled my dogs as malicious content is laughable\". \nMusician Nicky Romero has over six million users on Facebook and 26,000 followers on Tsu. \nHe posted to Facebook \"Add me on Tsu! New social hype\". He did not include the Tsu link within the text itself but included an image captioned with his tsu link. \nThis post was removed. \nFounder and CEO of Tsu, Sebastian Sobczak said that he estimated that \"five to ten million items have been removed from Facebook - both automated and manual\". \nHe said: \"We are investigating the extent of what is going on between Facebook and Tsu. We have contacted them but they have not responded from any of the three platforms which have removed any historical mentions of Tsu. We encourage users to see if any content has been deleted and to contact these platforms to find out why their content has been censored.\" \nSo what is Facebook afraid of? Tsu has 4.2 million users, Facebook has over 1.4 billion users. Sobczak's take: Facebook is \"not afraid of us, but afraid of the [Tsu] philosophy. You can not use other people's content for commercial purposes and not give them any value for it.\" \nI reached out to Facebook for comment, and a spokesperson said: \"We require any website or app that integrates with Facebook to comply with our platform policies.\" \nDevelopers creating apps to access Facebook's api have to adhere to the policies over product quality and data which are defined on Facebook's developer site in addition to its community standards . \nIf Tsu is violating the terms of the agreement with Facebook, why did Facebook wait five months before blocking the api? If it considers Tsu to be an incentive-based site, why does it still allow references to most other incentive sites that pay you to post content or YouTube.com which operates in a similar way? \nFacebook has removed historical mentions of Tsu. It has deleted \"millions of posts from Facebook which were not anything to do with the api\" said Sobczak. These posts \"were made by Facebook users natively on Facebook that had nothing to do with us\" he added. \nTsu has no api to Facebook Messenger so I am puzzled as to why Facebook Messenger has blocked all references to Tsu. Deleting old content from users linking to the platform does not make sense either. \nPerhaps Facebook thinks that Tsu is a \"get rich quick\" incentive site. Some sites are set up so that all users need to do is to surf around that site and make money. On Tsu, the content creators - not the content consumers - receive revenue share - exactly the same as the YouTube incentive model. \nFacebook has over 2.4 billion installs across its platform, Instagram and Facebook Messenger, Tsu has over 4 million users on its platform. Is Facebook trying to prevent Tsu from increasing its user base? \nOr is this the start of David (Tsu) taking on the mighty Goliath (Facebook)? \nHere's what I'd like to see happen: Facebook should start talking to Tsu about how to resolve this, re-enable sharing, and unblock the Tsu.co domain. \nWhat do you think? Let me know by leaving a Talkback below. \nDisclosure: I joined Tsu as a user to take a look at the site before I wrote about the platform in 2014 and I still use the platform regularly. Join Discussion", "external_links": [], "published": "2015-10-16T20:33:00.000+03:00", "crawled": "2015-10-16T23:14:50.449+03:00", "highlightTitle": ""}