{"organizations": [], "uuid": "f6b5a846bc1c54ce1cf0391f3c27432a0c08937f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30250162/srs-real-estate-partners-adds-top-retail-leasing-team-in-southern-california-office", "country": "US", "title": "SRS Real Estate Partners Adds Top Retail Leasing Team in Southern California Office", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "SRS Real Estate Partners Adds Top Retail Leasing Team in Southern California Office - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T21:02:00.000+03:00", "replies_count": 0, "uuid": "f6b5a846bc1c54ce1cf0391f3c27432a0c08937f"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30250162/srs-real-estate-partners-adds-top-retail-leasing-team-in-southern-california-office", "ord_in_thread": 0, "title": "SRS Real Estate Partners Adds Top Retail Leasing Team in Southern California Office", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The addition will strengthen SRS’ services for the Southern California retail market.\nDALLAS, TX (PRWEB) October 13, 2015\nAs the retail real estate market in Southern California continues to grow and evolve, SRS Real Estate Partners (SRS) is proud to announce the addition of a powerhouse project leasing team that will even better position the office to capitalize on the dynamic market and grow market share. The new team joining the SRS Southern California office located in Newport Beach , includes senior vice president and co-market leader Terrison Quinn, vice president Casey Mahony, associate Erik Manarino and senior marketing coordinator Jesika Tran-Nguyen, all previously of Colliers International. They are joining the existing SRS team led by senior vice president and co-market leader Garrett Colburn and including senior vice president Scott Landgraf, senior associate Townsand Cropsey, and associate Michael Fowle. Combined, the two teams create a collection of some of the top retail brokers in Southern California, representing some of the largest landlords and owners in the business, and some of the most active national retailers in the country. Growth in Southern California, including Los Angeles and San Diego, is a priority for SRS as they look to expand their North American retail services platform.\n“We are thrilled to have the Quinn and Mahony team on board as they are some of the most reputable project leasing brokers in the region and represent more than five million square feet of retail in almost 50 shopping centers,” said Colburn. “They are a great cultural fit for our office and SRS as a whole.”\nQuinn’s team will continue to focus on project leasing and big box store disposition throughout Southern California and has consistently completed 80-100 transactions per year for the past several years. Some notable transactions recently completed by the team include long-term leases with tenants such as Nordstrom Rack, 24 Hour Fitness, Hobby Lobby, Ross, Planet Fitness, Cost Plus World Market, ULTA, Verizon, Starbucks, Dunkin’ Donuts and Wells Fargo.\n“We are very fortunate to join such a great group of people and platform that is fully committed to retail,” said Quinn. “The tenant and landlord relationships that SRS has cultivated locally and nationally will undoubtedly enhance our business and service to our clients.”\n“We couldn’t be happier with the strategic growth of our Southern California office and with the addition of the Quinn and Mahony team,” said Chris Maguire , CEO for SRS Real Estate Partners. “That office now has an unparalleled team of brokers under one roof, with a great book of business. The sky is the limit for such a talented team in a market the size of Southern California.”\nAbout SRS Real Estate Partners\nSRS Real Estate Partners is the largest real estate company in North America exclusively dedicated to retail services. Headquartered in Dallas with more than 20 offices worldwide, SRS’ strong reach and international presence provide the company with unparalleled knowledge both globally and domestically. As a result, clients of SRS have a competitive edge through a full range of offerings including brokerage services, corporate services, development services, investment services and management services. Since its inception in 1986, SRS has built a strong foundation in the retail real estate world and grown into one of the industry’s most influential and respected leaders. Our success is measured in the achievement of our clients’ objectives, satisfaction and trust. For more information, please visit http://www.srsre.com .\n //www.prweb.com/releases/2015/10/prweb13017752.htm\n ", "external_links": ["http://www.srsre.com/newport-beach", "http://www.prweb.com/releases/2015/10/prweb13017752.htm", "http://www.srsre.com/people/chris-maguire"], "published": "2015-10-13T21:02:00.000+03:00", "crawled": "2015-10-13T20:38:30.349+03:00", "highlightTitle": ""}