{"organizations": [], "uuid": "567b63719931cd2eb454cd021f229261d5e3e9d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/22/space-risks-idUSL8N12J1YA20151022", "country": "US", "title": "Space age perils: hackers find a new battleground on the final frontier", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Space age perils: hackers find a new battleground on the final frontier | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T19:17:00.000+03:00", "replies_count": 0, "uuid": "567b63719931cd2eb454cd021f229261d5e3e9d3"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/22/space-risks-idUSL8N12J1YA20151022", "ord_in_thread": 0, "title": "Space age perils: hackers find a new battleground on the final frontier", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Thousands of new satellites due to be launched\n* New risks make space ventures more expensive\n* Space already a $330-billion industry\nBy Ari Rabinovitch\nJERUSALEM, Oct 22 (Reuters) - Space, the 'final frontier', is rapidly becoming an extra-terrestrial battleground for corporate espionage and other types of cyber attack as hackers seek to gain commercial advantage from rival networks operating in the $330-billion space economy.\nAt the same time, a mounting threat from orbiting junk hurtling through space and threatening spaceships and satellites is pushing up the cost of commercial ventures and could be a brake on future investment.\nIndustry-watchers say the many and varied challenges are driving up costs that might soon become prohibitive. But if the challenges are clear, hard solutions from the industry are few.\nThree-quarters of investment in the space economy comes from the booming commercial sector that is attracting companies like Virgin Galactic, SpaceX, Facebook and Google, according to the nonprofit Space Foundation.\nThe amount of data now being beamed between satellites supporting commercial networks on earth is growing rapidly, making them a ripe target for cyber attacks, said Luca del Monte, a senior strategist at the European Space Agency, and one of many experts who attended the annual International Astronautical Congress last week in Israel.\nSpace presents a double opportunity for hackers - the hardware up in orbit and the information it transmits.\nSatellites were becoming \"trophy attacks\" for hackers, said one space insurer.\nCompanies are increasingly having to arm themselves against malware planted inside their hardware before it is sent up - again something that drives up overheads.\nWith intense competition to get satellite networks up and operational in space, companies are finding themselves shopping in less reliable markets.\n\"To build so many satellites, you can no longer rely on the usual supplier next door,\" del Monte said.\n\"There will be a big geographical extension, into Asia, countries you don't control. So you need to examine each component you get and make sure it has no bugs or a latent virus that will activate in space,\" he said.\nHe speaks from experience. In one case, his agency received microcircuits made of material whose composition, under the microscope, was found to have been tampered with at a fundamental level.\nHad the attack not been detected, it would have interfered with a random number generator in a way that would have helped hackers to access the satellite, with worrying repercussions, he said.\nThe space industry is also one of the most active battlegrounds for corporate espionage, said Andrew Rogoyski, vice president for cyber security at the Montreal-based CGI Group.\nIncreasing commercial interaction - between large and small companies, governments and the private sector - means greater exposure to risk.\n\"Space is primarily about intellectual property. It's aspirational, very high-tech, very extreme technology that takes a long time to develop,\" Rogoyski said.\n\"A cyber attack to steal from an industry rival can be a huge time-saver,\" he said, predicting that cyber security will increasingly take up big chunks from company budgets.\n\"VEIL\" OF DEBRIS\nDenis Bensoussan, head of the satellite department at specialist insurer Beazley, says space investment is becoming riskier.\nThere is now, on average, a 10 percent chance of some sort of project failure, he said, usually at launch or during early operations.\nThe average satellite costs around $250 million, which means an insurance premium of $25 million. After building and launch costs, that's the third-highest expense for satellite operators.\nCurrent policies do not include the risk of data breach by hackers, he said, but coverage is starting to be offered.\n\"Satellites are becoming trophy attacks for hackers. It's increasingly a cause for concern,\" said Bensoussan.\nSpace debris - fragments from fuel tank explosions or other space mishaps - is a more overt threat to operational satellites and spaceships, however.\nHalf a million pieces of junk about the size of marbles, along with 20,000 pieces larger than a ball, are whipping around Earth at speeds 10 times faster than a bullet in what computer-generated images show is a \"veil\" of dense clutter.\nA crash between Russian and U.S. satellites in 2009 and a Chinese anti-satellite missile test in 2007 added more than 5,000 pieces of debris alone, according to NASA.\nA generally accepted rule is that new systems must be able to reenter the atmosphere on their own for burn-up within 25 years of launch. But that costs money and there is no guarantee the groups planning to send thousands of new satellites into space will do so.\n\"If the debris risk gets worse, insurance conditions and prices will get tougher and higher,\" Bensoussan said.\nIt's widely felt within the industry that a level of stricter, more enforcible guidelines for manoeuvering in space will have to be adopted, and this will open a huge new market.\n\"Space debris removal could become our core business,\" said Gerrit Hausmann, a business development manager at Germany's OHB System AG, a leading space company.\nOHB is competing for a contract with Europe's space agency to remove an eight-ton satellite from orbit during a 2021 mission by using a sort of tugboat with a robotic arm.\nOther ideas put forward by numerous companies in recent years include satellites armed with nets, harpoons, adhesive walls, even tentacles that will either push the debris toward Earth for burn-out or into an out-of-the-way \"graveyard orbit\".\n(Editing by Richard Balmforth )", "external_links": [], "published": "2015-10-22T19:17:00.000+03:00", "crawled": "2015-10-22T18:29:08.719+03:00", "highlightTitle": ""}