{"organizations": ["World Health Organisation", "LPG", "CO"], "uuid": "7c8cbad803b5b5013771741b6d8b63c777046fa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/lpg-autogas-clean-roads-not-just-lab/45766", "country": "US", "title": "LPG Autogas: Clean on the Roads, Not Just in the Lab", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "LPG Autogas: Clean on the Roads, Not Just in the Lab", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T10:02:00.000+03:00", "replies_count": 0, "uuid": "7c8cbad803b5b5013771741b6d8b63c777046fa9"}, "author": "", "url": "http://businesswireindia.com/news/news-details/lpg-autogas-clean-roads-not-just-lab/45766", "ord_in_thread": 0, "title": "LPG Autogas: Clean on the Roads, Not Just in the Lab", "locations": ["France", "New York", "USA", "Tokyo", "Paris", "Turkey", "LPG", "Europe", "Lab Paris", "London", "Japan", "South Korea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tuesday, October 20, 2015 12:32PM IST (7:02AM GMT) LPG Autogas: Clean on the Roads, Not Just in the Lab Paris, France Not only are emissions from diesel engines, according to the World Health Organisation, carcinogenic; we now have significant doubt on their real on-road performance following the recent diesel scandal in the USA and Europe. Air pollution is the world’s largest single environmental health risk causing 3.7 million premature deaths each year. Transport plays a major role in this pollution. While the world is looking into how to solve the problem of emissions from transport, there is already a solution available which could reduce air pollution while saving many lives. So what’s the solution? Autogas Autogas (LPG as an automotive fuel) is the clean, safe and convenient alternative fuel. Autogas is in fact the world’s best kept secret. Take for instance Tokyo, where 90% of taxis run on Autogas or Turkey where 46% or private cars are LPG-fuelled, drastically improving air quality and reducing CO 2 emissions. While Autogas has been very successfully developed in some parts of the world, such as Japan, South Korea and Turkey to name just a few, the enormous worldwide potential of this fuel still remains untapped. Why can’t we use it more in cities like London, Paris, New York where this kind of solution is desperately needed? Why is it sometimes overlooked when it can deliver immediate and impressive emission reductions? The answer is invariably lack of a suitable policy environment and failure of government and local authorities to encourage its use. Autogas burns cleanly producing up to: 96% less nitrogen oxides (NOx) than diesel, 68% less NOx than petrol, 22% lower CO2 than petrol and 120 times less small particle emissions than diesel vehicles. With growing renewable (bio) sources of LPG, Autogas is not just today’s fuel but is a fuel for the future that delivers results every time. The Autogas industry is ready to work with all stakeholders to provide genuine emissions reductions now. For more information visit www.auto-gas.net , view information video http://auto-gas.net/libraries/video and for an overview of automotive emissions visit http://bit.ly/1hNe24E The World LPG Association promotes the use of LPG worldwide to foster a cleaner, healthier and more prosperous world and aims to add value to the industry sector through driving premium demand for LPG, while also promoting compliance with good business and safety practices.", "external_links": [], "published": "2015-10-20T10:02:00.000+03:00", "crawled": "2015-10-20T10:07:27.022+03:00", "highlightTitle": ""}