{"organizations": [], "uuid": "283e665f2964742ca58c8b51e8d28ddf2046ddd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510051089.html", "country": "US", "title": "Zimbabwe: In Darkness We Are One", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: In Darkness We Are One", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T12:50:00.000+03:00", "replies_count": 0, "uuid": "283e665f2964742ca58c8b51e8d28ddf2046ddd1"}, "author": "", "url": "http://allafrica.com/stories/201510051089.html", "ord_in_thread": 0, "title": "Zimbabwe: In Darkness We Are One", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Daphne Jena"], "text": "opinion By Daphne Jena \nThe entire SADC region, and much of Africa, is facing unprecedented shortages of electricity, leading to long periods without power. Waza blogger Daphne Jena suggests that common problems should lead to common solutions. \nGoing for more than twelve hours without power is just a nightmare, even if you want to cut down on your electricity costs. This did not seem to be the case with Mai Tinashe, she did not look bothered by having to find an alternative source of heat. If you are thinking Mai Tinashe is one of those people who have invested in solar power or some form of green fuel, you are wrong. \nMai Tinashe is my hairdresser. Recently, during one of my visits she happened to be one of those mothers who had to ensure that their children had warm baths and hot meals throughout the day. The electricity supply company only makes things more difficult for women, doesn't it? \nMaking plans \nWhen your hairdresser works from home, it is inevitable that you will find out how she runs her household. I eavesdropped on Mai Tinashe's conversation with a fellow tenant, Mai Monalisa. \nApparently Mai Monalisa was informing Mai Tinashe that she was almost done with making breakfast for her children, and Tinotenda should be getting ready to start making porridge for breakfast. Tinotenda is Mai Tinashe's daughter. \nSince her mother was busy with my hair, Tinotenda had to make meals for her siblings. \nCommon problem \nWhat is Mai Monalisa's business in how and when meals were prepared in Mai Tinashe's kitchen? I did not keep that question to myself for long, I asked Mai Tinashe right away. \n\"We are using the same fire to cook, it's cheaper that way\", that was the response I got from Mai Tinashe. \nBesides increasing sales for paraffin, liquid petroleum gas and firewood vendors, I would not have thought of anything else that comes out of a situation where electricity goes out during the early hours of the morning. \nIt is amazing how we cope differently with the challenges that we face every day. With the worsening situation of power cuts who would have suspected that something positive would come out of them? \nSharing solutions \nMai Tinashe explained to me that, since she and Mai Monalisa used firewood as an alternative source of heat, they always used the same fire to make meals. This was a cheaper and convenient option for them as that meant that they had to both contribute to the purchase of one bundle of firewood. \nThey would spend $1 together instead of paying $1 each for separate bundles of firewood. This is also convenient as it would be easier to manage one spot to ensure that the children do not play too close to the fire. It just made things a whole lot easier. \nInnovative \nI found this situation more innovative than old fashioned. It would appear old fashioned because my grandmother used to tell me how the whole village would borrow cinder from one homestead that would have lit a fire first. \nThis was a sign of unity demonstrated by our elders. Because one didn't know from whose hut they would have to borrow cinder, they had to maintain good relations with everyone in the village. \nI thought to myself, if only we could all find a uniting factor in all the challenges we face among family members, workmates and even among governments. It is not long ago that social media was awash with jokes making fun of people living in South Africa and neighbouring countries, for they had started experiencing power cuts almost as frequently as we did in Zimbabwe. \nPeople made fun of each other and some of these jokes ended up in verbal fights between friends and colleagues. \nWorthy example \nMai Tinashe and Mai Monalisa's example is what our leaders should be emulating; it is what we should do as people. Before we start judging or blaming each other for contributing to a problem, we should first come up with quick solutions for the benefit of everyone. \nPower shortages have been haunting African countries individually, and collectively, for years now. The whole of the SADC region is struggling to generate electricity for its 277 million people, yet the problem has been evident for years now. \nHad our leaders possessed the mind of these two ladies, maybe by now they could have come up with solutions for the benefit of their citizens. Instead, some take advantage of problems to discredit the next leader or to prove that they are economic and strategic thinking experts. \nI am not saying there is anything wrong with one trying to prove themselves as innovative leaders. Yes crisis situations are very good opportunities to show how one mastered the art of problem solving. However in some cases we should think beyond getting a pat on the back for being the wise one. \nCommon good \nWe are all happier when everybody is comfortable, just like Mai Tinashe and Mai Monalisa's children were all well fed after having good and warm meals for breakfast. Had the two women decided to make their meals in isolation, they would have had to pay more for firewood, or risk not having enough firewood to make meals for the duration of the load-shedding, which usually lasts more than half of the day. \nThese two women did not only demonstrate good economics of saving; they also showed how unity can make endurance to power-cuts less stressful. \nUnfortunately, my hairstyle was quite simple and Mai Tinashe being efficient at her work as she is was done with me in no time. If it wasn't that I also had to rush to my own work station, I would have wanted to wait till the offals that both families were having for lunch with sadza were ready. \nHad I thought sharing a fire was a bad idea then I might have had another thing coming, because the offals for both families were cooked in one big pot! \nThis article was originally published on ilizwi263. \nWaza is proud to feature as part of its content local bloggers who have a knack for expressing their unique perspectives, independent thoughts and engaging stories. The opinions expressed here are those of the author. \nBe sure to check out Waza blogger Kundai Marunya's take on the electricity problems in Zimbabwe, and don't miss Daphne's other writing on Waza. Zimbabwe \nZimbabwe is one of the African countries where governance has improved most in the four years up to 2014. Senegal just … see more » Copyright © 2015 Waza. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-05T12:50:00.000+03:00", "crawled": "2015-10-05T15:48:41.197+03:00", "highlightTitle": ""}