{"organizations": ["Genel Energy PLC", "Falkland Oil & Gas Limited"], "uuid": "3254a1e75d834f704789d685ec09e6a025e6ceef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/3-oil-stocks-set-double-103823902.html", "country": "GB", "title": "3 Oil Stocks Set To Double? Falkland Oil & Gas Limited, Genel Energy PLC And Amerisur Resources plc", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "3 Oil Stocks Set To Double? Falkland Oil & Gas Limited, Genel Energy PLC And Amerisur Resources plc", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:38:00.000+03:00", "replies_count": 0, "uuid": "3254a1e75d834f704789d685ec09e6a025e6ceef"}, "author": "", "url": "https://uk.finance.yahoo.com/news/3-oil-stocks-set-double-103823902.html", "ord_in_thread": 0, "title": "3 Oil Stocks Set To Double? Falkland Oil & Gas Limited, Genel Energy PLC And Amerisur Resources plc", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Oct 9, 2015, 11:55 BST - UK Markets close in 4 hrs 35 mins 3 Oil Stocks Set To Double? Falkland Oil & Gas Limited, Genel Energy PLC And Amerisur Resources plc By Peter Stephens | Fool.co.uk – 17 minutes ago 384.50 +14.5000 \nThe disastrous state of the oil industry has clearly caused huge challenges for investors. In fact, in the last year there has been a 'sea of red' among oil stocks, with valuations plummeting in response to an oil price which is still showing little sign of mounting a sustainable comeback. \nHowever, during such periods, there are also opportunities. As John Rockefeller famously said, the time to buy is when blood is running in the streets and, when it comes to the oil sector, this is undoubtedly the case. \nAs such, a doubling of valuations for some oil companies is entirely possible. Clearly, this depends on the future performance of the price of oil. If it were to fall further then even the most financially sound and lowest cost operator may struggle to deliver a positive return. However, if the oil price does gain upward momentum (which seems likely in the long run), then returns could be very generous. \nOne stock which undoubtedly has the potential to double is Genel Energy (LSE: GENL). Its main challenge, aside from the oil price, is its location in Iraq/Kurdistan. Being so close to a major conflict zone not only puts serious question marks on its future capability to continue as a business, but also hurts investor sentiment. \nRealistically, then, an improvement in the political outlook for the region is likely to be required in order for Genel Energy's share price to double. However, on its current valuation and given its very high quality asset base, there is scope for this to take place. For example, Genel Energy trades on a price to earnings growth (PEG) ratio of just 0.7 and has a price to book value (P/B) ratio of only 0.3; both of which indicate huge potential upside. \nIt's a similar story with Falkland Oil & Gas (LSE: FOGL). Unlike the majority of its sector peers, it has enjoyed a relatively positive 2015 as a result of its drilling programme delivering better than expected oil reserve estimates which has helped to push its share price higher by 18% since the turn of the year. \nIn the short run, more good news is very realistic, since two of the four proposed wells are yet to be drilled. In the longer term, Falkland Oil & Gas' P/B ratio of 0.6 indicates that it is very cheap and that a doubling of its share price could take place, with the political outlook for the Falkland Islands seemingly relatively secure under the present UK government. \nMeanwhile, Amerisur (LSE: AMER) seems to be recovering from a somewhat disappoint recent set of results, with its shares being up 12% today and 24% in the last month. A key reason for this is clearly improved sentiment surrounding the sector, but also a realisation by the market that Amerisur appears to be capable of coping with a lower oil price in the short run. \nFor example, it is embarking on a cost-cutting drive so as to return to profitability over the short to medium term, while its P/B ratio of 2.2 indicates upside potential for a business which is set to be profitable as soon as next year. \nClearly, Amerisur will need an oil price rise in order to post higher levels of profitability, which in turn could lead to improved investor sentiment in the stock. But, with a forward price to earnings (P/E) ratio of 13, its shares could realistically double over the medium to long term. \nOf course, Genel Energy, Falkland Oil & Gas and Amerisur aren't the only companies that could boost your portfolio returns. However, finding the best stocks at the lowest prices can be challenging when work and other commitments get in the way. \nThat's why the analysts at The Motley Fool have written a free and without obligation guide called 10 Steps To Making A Million In The Market. \nIt's a step-by-step guide that could make a real difference to your financial future and allow you to retire early, pay off your mortgage, or even build a seven-figure portfolio. \nClick here to get your free and without obligation copy - it's well-worth a read! \nPeter Stephens has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-10-09T13:38:00.000+03:00", "crawled": "2015-10-09T13:56:08.008+03:00", "highlightTitle": ""}