{"organizations": ["National Pension Commission", "Central Bank of Nigeria", "PenCom", "CPS", "CBN", "PRA", "DG PenCom", "Money Market Instruments", "Stock Exchange", "Securities and Exchange Commission", "Nigeria Stock Exchange", "NSE"], "uuid": "8624ee39dd8d9422a80fa3a343a9c4661d291570", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510131049.html", "country": "US", "title": "Nigeria: Deploying Idle Pension Funds", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Deploying Idle Pension Funds", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T13:34:00.000+03:00", "replies_count": 0, "uuid": "8624ee39dd8d9422a80fa3a343a9c4661d291570"}, "author": "", "url": "http://allafrica.com/stories/201510131049.html", "ord_in_thread": 0, "title": "Nigeria: Deploying Idle Pension Funds", "locations": ["Nigeria", "Mauritania"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Anohu-Amazu", "Amazu", "Chinelo Anohu"], "text": "Mauritania: Lack of Will Undermines Anti-Slavery Law editorial The shortage of critical development infrastructure in the country is often attributed to lack of funds. It is for this reason that we welcome the opening of a new window of opportunity for access to funds that could finance the development of key infrastructure in Nigeria. Director General of the National Pension Commission (PenCom) Mrs. Chinelo Anohu- Amazu opened this window when she said only N156 billion out of N3.95 trillion investible funds accumulated from the Contributory Pension Scheme (CPS) has thus far been utilized. That means as much as N3.77 trillion is still idle. Fortunately, the Pension Reform Act 2014 (PRA 2014) actually provides for deploying idle pension funds into viable long term infrastructural projects. The PenCom director general was speaking during a visit to the Nigeria Stock Exchange (NSE) where she called for collaboration between the commission and the exchange. The collaboration is expected to among other spinoffs, expand and deepen the NSE. According to the DG PenCom, the PRA 2014 actually authorizes the deployment of idle pension funds into the development of infrastructure and housing through properly packaged bonds and other instruments. However any such allowable instrument needs to be structured and traded on the platform of a Stock Exchange that is licensed or recognized by the Securities and Exchange Commission (SEC), as well as Money Market Platforms recognized by the Central Bank of Nigeria, CBN. This provision is intended to serve two purposes. First, it is intended to bridge the huge gap between need and availability of infrastructure and housing in Nigeria. Secondly it is to facilitate the disbursement of such funds in a safe and organized manner with minimum risk to such funds. In the light of the foregoing PenCom said it has issued regulations in respect of Investment of Pension Funds Assets to guide and advance how such resources should be invested. It also said it would issue more guidelines as the need arises. Until now pension funds have been invested mostly in traditional options such as Federal Government securities, equities, Money Market Instruments and Corporate Debts. The impact of these investment ventures on the public sector has been limited as they are mainly directed by private sector interests. The significance of the disclosure by Mrs. Anohu-Amazu draws from the promise offered the country in the viability of a huge window of investible funds which can change the infrastructural and housing landscape of the country. Available statistics even put her figure as conservative given that the new pension system currently covers only five percent of Nigerian workers. The implication is that as much as N30 trillion is realizable for infrastructural and housing development if the CPS is expanded to include workers in the economy's informal sector. The PRA 2014 provides that firms with as few as three employees could enroll their workers in the scheme. With such an expansive reach the CPS will capture millions of potential pensioners in its basket. Beyond the availability of investible funds through the CPS window is the issue of subjecting access to such funds to the rigorous terms and conditions of the stock exchange and other established financial platforms. That situation is appropriate for the protection of pension funds from unscrupulous processes of disbursement. As the property of beneficiaries for whom such is kept for regulated and programmed release at defined periods in future, pension funds must enjoy strict supervision in their management. While the initiative by PenCom is commendable, the task still remains for it to engage in increased advocacy with respect to inducing prospective stakeholders in infrastructure and housing development to access the funds. The stakeholders under consideration include the federal, state and local governments who are vested with the responsibility of developing infrastructure within their statutory jurisdictions. Other stakeholders are housing development agencies in the public and private sectors of the economy. A big financial window has opened to finance key development projects in Nigeria. We must seize upon it. Nigeria \nEver since Nigeria started harvesting its petroleum endowment, its economy's umbilical cord has avoidably been firmly … see more » Copyright © 2015 Daily Trust. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-13T13:34:00.000+03:00", "crawled": "2015-10-13T13:55:36.237+03:00", "highlightTitle": ""}