{"organizations": [], "uuid": "e58016fdde495ae058e40819d2a00bbfd2a15181", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/fiat-chrysler-avoids-strike-tentative-043132811.html", "country": "GB", "title": "Fiat Chrysler avoids strike with new tentative contract - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Fiat Chrysler avoids strike with new tentative contract - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 3, "uuid": "a4e3dcbf3918e83913d259187304f86ccde6d549"}, "author": "Dee-Ann Durbin, Associated Press", "url": "http://finance.yahoo.com/news/fiat-chrysler-avoids-strike-tentative-043132811.html#post-0", "ord_in_thread": 0, "title": "Fiat Chrysler avoids strike with new tentative contract - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (AP) -- Fiat Chrysler has avoided an expensive strike at its U.S. plants after reaching a tentative labor agreement with the United Auto Workers union.\nUAW announced the agreement just after 11:59 p.m. Wednesday, which was the deadline the union had set to reach a new deal or possibly go on strike.\nThe Italian-American automaker confirmed it had reached a new tentative agreement with the union but said in a statement that the company cannot discuss the specifics because the deal is subject to member ratification. A spokeswoman declined further comment.\nUAW, which represents around 40,000 FCA factory workers at 23 U.S. plants, said in a post on its website that its bargaining committee had \"secured significant gains.\"\nLocal union leaders will vote on the proposed deal Friday at a meeting in Detroit. If the leaders approve the tentative agreement, UAW will release details and the ratification process will begin, a UAW spokesman said.\nThis is the second tentative agreement FCA and the union have reached. Last week, UAW members overwhelmingly rejected a previous proposal, saying it didn't go far enough in restoring benefits workers lost in previous contracts. Union workers made concessions in recent years to help struggling automakers return to health. But now that the companies are making money, members want a bigger share.\nThe deal rejected last week included pay raises, the potential for increased profit sharing and a $3,000 signing bonus. But members are seeking an end to the current two-tier pay structure, more specific guarantees of new vehicles for U.S. factories and a return of cost-of-living pay raises.\nUAW's four-year contracts with FCA, Ford and General Motors expired on Sept. 14, but workers remained on the job under a contract extension. The union said in September it had chosen FCA as its target company in the negotiations; usually the first deal reached serves as a basic template for the other two companies.\nWhen they kicked off contract talks in July, both UAW President Dennis Williams and FCA CEO Sergio Marchionne said they would consider it a personal failure if they can't reach an agreement and workers strike.\nFCA workers haven't gone on strike since 2007, and such a move would have been expensive for the company. A weeklong strike could have cost as much as $1.7 billion in revenue and $35 million in net income, according to Sean McAlinden, chief economist for the Michigan-based Center for Automotive Research.\n___\nAssociated Press writer Tom Krisher contributed to this report.\nUnited Auto Workers", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T09:08:15.013+03:00", "highlightTitle": ""}