{"organizations": [], "uuid": "f8c3060710ff41c32fe5384e8a84371e1d0992fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/20/china-britain-idUSL8N12J3CH20151020", "country": "US", "title": "UPDATE 2-Rights supporters throng palace route as China's Xi starts UK visit", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 2-Rights supporters throng palace route as China's Xi starts UK visit | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:09:00.000+03:00", "replies_count": 0, "uuid": "f8c3060710ff41c32fe5384e8a84371e1d0992fa"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/20/china-britain-idUSL8N12J3CH20151020", "ord_in_thread": 0, "title": "UPDATE 2-Rights supporters throng palace route as China's Xi starts UK visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Protesters, supporters line Mall to see Xi\n* Xi to stay with royal family, meet political leaders\n* Business deals to be inked, including on nuclear power\n* Opposition leader to raise issue of human rights\n* Uighur leader says red carpet 'stained with blood' (Recasts, adds protesters,)\nBy Michael Holden and Elizabeth Piper\nLONDON, Oct 20 (Reuters) - Human rights protesters vied with China supporters and tourists to see President Xi Jinping ride in a carriage to Buckingham Palace on Tuesday, the first day of a state visit Britain hopes will cement financial ties.\nHailed as the beginning of a 'golden era' or 'golden time' in Sino-British relations, the visit, which will seal a host of business deals, has been criticised by activists who accuse Prime Minister David Cameron of turning a blind eye to abuses.\nIt has also ruffled feathers among some of Britain's traditional allies, such as the United States, where Xi's visit last month was tainted by friction over cyber-theft and Beijing's moves in Asian maritime disputes.\nBut for Britain, the four-day visit is the culmination of a three-year charm offensive to show Britain \"walking tall on the world stage\", in a government minister's words. Cameron also hopes to attract investment in infrastructure, nuclear power and his government's planned transformation of northern England.\nThousands of supporters held red and yellow Chinese dragons and huge portraits of Xi as they posed for photographs on The Mall in front of Buckingham Palace, where Xi and his wife, Peng Liyuan, will stay as guests of Queen Elizabeth.\nBut hundreds of people protesting against China's human rights record interrupted the pomp. They held banners saying: \"Down with the Communist Party\" and \"End the crackdown\" on freedom of speech.\n\"It (Xi's visit) shows that England is not giving a damn about human rights,\" said Aisha Nahmmacher, 24, from south London, one of those demonstrating on The Mall.\nA leader of China's Muslim Uighur minority said on Monday the red carpet being laid out by Britain was stained with the blood of his people. Hundreds have been killed in violence in the region, blamed by Beijing on Islamist militants.\nCameron and his government have been keen to keep human rights in the background of the visit and set a different tone after he angered Beijing in 2012 by meeting the Dalai Lama, the exiled spiritual leader of Tibet.\nOpposition Labour party leader Jeremy Corbyn has said he will raise human rights when he meets Xi on Tuesday, however, and on Monday forced Cameron to say he would bring up the impact of cheap Chinese imports on struggling British steel-makers.\nGOOD \"ETIQUETTE\"\nBritain has won praise from China for its discretion in dealing with human rights issues by raising them behind the scenes, a policy London says is more effective than hectoring Beijing publicly.\nA visit to China last month by finance minister George Osborne sealed the deal, with the Global Times, an influential Chinese tabloid, praising his \"etiquette\".\nIn an interview with Reuters on the eve of the trip, Xi heaped praise on Britain for what he called a \"visionary and strategic choice\" to strengthen commercial ties with China.\nBritain became the first Western nation to join the China-led Asian Infrastructure Investment Bank this year after Washington had pressed allies not to join, and in 2014, the country was the top destination for Chinese money with $5.1 billion in investment, according to law firm Baker & McKenzie.\nOne deal expected to be signed during Xi's visit is a plan for two state-owned Chinese utilities to invest in a 16 billion pound ($25-billion) nuclear power project being built by French utility EDF at Hinkley Point in southwest England.\nAlthough traditionally reticent about commenting other countries' politics, Beijing has expressed hopes the European Union remains united, concerned about any weakening of the bloc which it views as a vital counterbalance to the United States. Cameron has pledged to renegotiate Britain's relationship with the EU ahead of a referendum on membership to be held by 2017.\nIn a pointed commentary before Xi's arrival in Britain, Global Times said in an editorial: \"Apparently the concept of a 'golden era' between the two countries has made some people uncomfortable.\n\"This has hurt the twisted dignity of those who still consider the West the centre of the world.\"\n(Additional reporting by Ben Blanchard in Beijing; Editing by Catherine Evans )", "external_links": [], "published": "2015-10-20T15:09:00.000+03:00", "crawled": "2015-10-20T14:21:19.524+03:00", "highlightTitle": ""}