{"organizations": [], "uuid": "0c27e410cbd8a821523df5c1daa45f35b1d8f315", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/HmhFLNtaRlVQSAjjhCkuFA--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://media.zenfs.com/en-US/homerun/cnbc.com/ef836326042115b30b1a40d9b3393106.cf.png", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/drowning-homeowners-getting-relief-040100243.html?l=1", "country": "GB", "title": "Drowning homeowners are getting relief", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Drowning homeowners are getting relief - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 10, "uuid": "0c27e410cbd8a821523df5c1daa45f35b1d8f315"}, "author": "Diana Olick", "url": "http://finance.yahoo.com/news/drowning-homeowners-getting-relief-040100243.html?l=1", "ord_in_thread": 0, "title": "Drowning homeowners are getting relief", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nCherezoff | Getty Images. Strong home price gains this past spring and summer have given drowning homeowners a new supply of air. Strong home price gains this past spring and summer have given drowning homeowners a new supply of air. \nWhile the number of borrowers in a negative-equity position on their mortgages is still high, at just over 14 million, that number is falling fast, especially for those most seriously underwater. \nThere were 6.9 million U.S. homes seriously underwater at the end of the third quarter of this year, according to RealtyTrac, a foreclosure sales and analytics company. It defines \"seriously underwater\" as owing at least 25 percent more on the mortgage than the home is currently worth. \nThe tally represents 12.7 percent of all properties with a mortgage. The number is down from 7.4 million at the end of the second quarter and is the lowest level since RealtyTrac began looking at underwater data in 2012.\nAt the worst of the housing crisis, in the middle of 2012, there were 12.8 million seriously underwater homes representing 28.6 percent of all homes with a mortgage.\n\n\"After a lull late last year and early this year, home sales volume and average sales prices picked up dramatically again in the second and third quarters of this year, resulting in a substantial drop in seriously underwater homeowners,\" said Daren Blomquist, vice president at RealtyTrac. \"On the other hand, the number and share of equity-rich homeowners also dropped dramatically between the second and third quarters.\"\nThis is because more borrowers are either selling and moving or pulling money out of their homes. Cash-out refinances jumped 68 percent in the second quarter of this year compared to those of a year ago, according to Black Knight Financial Services. \nMore than 10 million properties today are considered \"equity rich,\" where the borrower owns at least half the home outright. That is 19 percent of all properties with a loan, according to RealtyTrac.\nAll the improvements in home equity would seem to bode well for future home sales, but several barriers still stand in the way. First and foremost is the short supply of homes for sale in general, both new and existing. Homeowners don't want to sell if they're not sure they can't find something better. Second is the fact that home prices are rising more than historical norms right now, and some sellers think they can do better if they wait longer. Finally, while the underwater borrower situation is improving, it is far from over, and in some markets, it is still severe. \nFlorida markets continue to hold the lion's share of underwater homes. In Las Vegas, Cleveland, Chicago and Toledo, Ohio, about one-quarter of the properties with a mortgage are seriously underwater.\n\nAs for those boasting the most home equity, take a look at San Jose, San Francisco, Honolulu, Los Angeles and New York. \n\nMore From CNBC \nTop News and Analysis \nLatest News Video \nPersonal Finance \nReal Estate Loans RealtyTrac", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T20:09:42.218+03:00", "highlightTitle": ""}