{"organizations": [], "uuid": "3c1b18ff1a6f9926cd30f840ee31d7fabc48b3e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/3/7/a/r/image.related.afrArticleLead.620x365.gkbt8y.png/1444432766212.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/fairfax-ipsos-poll-malcolm-turnbull-puts-coalition-ahead-20151017-gkbt8y", "country": "AU", "title": "Fairfax Ipsos poll: Malcolm Turnbull puts Coalition ahead", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Fairfax Ipsos poll: Malcolm Turnbull puts Coalition ahead | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T16:00:00.000+03:00", "replies_count": 0, "uuid": "3c1b18ff1a6f9926cd30f840ee31d7fabc48b3e3"}, "author": "Phillip Coorey", "url": "http://www.afr.com/news/politics/fairfax-ipsos-poll-malcolm-turnbull-puts-coalition-ahead-20151017-gkbt8y", "ord_in_thread": 0, "title": "Fairfax Ipsos poll: Malcolm Turnbull puts Coalition ahead", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Malcolm Turnbull beat Bill Shorten in every one of the 10 positive character attributes. Dallas Kilponen Share on twitter by Phillip Coorey The Coalition has surged to a commanding lead over Labor under the leadership of Malcolm Turnbull whose own personal ratings have soared to heights not seen since Kevin Rudd was at his zenith.\nIn a crushing poll for the Labor Opposition, Mr Turnbull also beats Bill Shorten in every one of 10 positive character attributes, trouncing him in terms of trust, competency, strength and vision, and even taking away the Labor leader's long-held lead on social issues.\nThe Prime Minister is the first leader to best his rival lead in all 10 attributes since they were first tested 20 years ago.\nLargest lead The latest Fairfax/Ipsos poll, the first taken since Mr Turnbull ousted Tony Abbott a month ago, shows the Coalition leading Labor on a two-party-preferred basis by 53 per cent to 47 per cent. This is the largest lead the Coalition has held in the poll since it won the September 2013 election by the same margin.\nThe last national Fairfax/Ipsos poll, taken two months ago in August, had the Coalition trailing Labor by 54 per cent to 46 per cent, a lead that had become so entrenched it led to Mr Abbott's ousting.\nThe latest poll has the Coalition's primary vote lifting 7 percentage points since August to 45 per cent and Labor's falling 6 points to 30 per cent, its lowest primary vote since the election and 3 points lower than the 33 per cent it received on election day. There have been sharp falls for Labor in NSW and its stronghold of Victoria, Mr Shorten's home state.\nThe Greens slipped 2 points to 14 per cent.\n Preferred PM The public's admiration for Mr Turnbull has him leading Mr Shorten by 67 per cent to 21 per cent as preferred Prime Minister. Two months ago, Mr Shorten led Mr Abbott by 45 per cent to 39 per cent.\nMr Turnbull's approval rating has hit 68 per cent, just 1 point below the 69 per cent poll record Mr Rudd achieved in May 2008, six months after his election victory.\nMr Turnbull's disapproval rating is just 17 per cent, lower than Mr Rudd's 22 per cent in May 2008.\nBy contrast, Mr Shorten's approval rating has dropped 7 points to 32 per cent and his disapproval rating has risen 7 points to 56 per cent. These are his worst approval ratings since the 2013 federal election.\nThe poll of 1403 voters was taken from Thursday night to Saturday night at the end of what had been one of Labor's worst parliamentary weeks this term.\nShots fired – and backfired Its attempts to make an issue of Mr Turnbull's wealth and his significant investments in the Cayman Islands backfired when the Prime Minister gave a candid and staunch defence of his success which left many on Labor also feeling uncomfortable at the tactic.\nEarlier in the week, Labor and the government made peace over the China-Australia Free Trade Agreement after Labor offered a compromised set of demands to protect Australian jobs but so as not to jeopardise the agreement. The poll showed the public supports the FTA by 54 per cent to 33 per cent.\nLabor had long feared a switch from Mr Abbott to Mr Turnbull, and the poll bears out those fears. A run of similar polls over coming months would inevitable lead to speculation about Mr Shorten's leadership and whether there was anyone better to take on Mr Turnbull at the 2016 election.\nLabor views On Sunday, Labor frontbencher Ed Husic admitted Labor did not relish the prospect of a Turnbull prime ministership.\n\"I think the natural political reaction if I could put it, to the change of events, would be, we would have preferred to have Tony Abbott there from our own political perspective but the fact of the matter is, the country's better that he's not,\" he told Sky News.\n\"We think that it allows for the type of engagement and discussion, and to have difficult policy issues discussed in a much better way than both sides wondering whether or not a scare campaign would be launched, and being able to tackle those issues in the national interest.\n\"Malcolm Turnbull's a different proposition to Tony Abbott and will be a lot more difficult to deal with in that way.\n\"At least this way you can have both sides put their ideas on the table, and have it as a contest of ideas.\"\nLabor will be alarmed at its plunging fortunes in Victoria where, according to the poll, its primary vote has dived from 37 per cent in August to 28 per cent now. It trails the Coalition 53-47 on a two-party basis in Victoria.\nBecause of the relatively small sample size, the Victorian numbers have 5.3 per cent margin of error.\nIn NSW, the Coalition leads on the primary vote by 49 per cent to 31 per cent and on a two-party-preferred basis by 55 per cent to 45 per cent.", "external_links": ["https://sasha-project.s3.amazonaws.com/afr-prod/2015/10oct/Ipsos_Oct_2015_hype/index.html", "https://sasha-project.s3.amazonaws.com/afr-prod/archive/responsiveJSV2/pym.min.js", "https://twitter.com/PhillipCoorey", "https://sasha-project.s3.amazonaws.com/afr-prod/2015/10oct/Ipsos_Oct_2015_extra_hype/index.html"], "published": "2015-10-18T16:00:00.000+03:00", "crawled": "2015-10-18T11:48:16.804+03:00", "highlightTitle": ""}