{"organizations": [], "uuid": "de89ccc7c109f37b7a6c5d48d2ce90835bc92711", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/HFT0261015.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/action-on-high-frequency-trading-sebi-says-fact-finding-exercise-already-underway/43814.html", "country": "IN", "title": "Action on High Frequency Trading: SEBI says fact-finding exercise already underway", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Action on High Frequency Trading: SEBI says fact-finding exercise already underway - Moneylife", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T20:29:00.000+02:00", "replies_count": 0, "uuid": "de89ccc7c109f37b7a6c5d48d2ce90835bc92711"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/action-on-high-frequency-trading-sebi-says-fact-finding-exercise-already-underway/43814.html", "ord_in_thread": 0, "title": "Action on High Frequency Trading: SEBI says fact-finding exercise already underway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow @mldigital In a reply to a set of 51 questions raised by Moneylife on 12th September on high frequency trading in NSE, SEBI has just informed us that the issue is drawing its serious attention and that a fact-finding exercise is already underway   Market regulator Securities and Exchange Board of India (SEBI) told Moneylife that its Technical Advisory Committee (TAC) has extensively discussed the issue of high frequency trading (HFT) and the matter is drawing its serious attention. SEBI was replying to a detailed email sent on 12 September 2015 by Sucheta Dalal, Managing Editor of Moneylife. It said, \"We would like to thank you for taking efforts to flag the issue. We would like to inform you that a fact-finding exercise is already under way by SEBI. The matter has also been discussed extensively in the Technical Advisory Committee of SEBI and is drawing its serious attention. While we have noted the issues raised in your email, you will appreciate that we would not like to make comments on matters which are under investigation.\"   The same 51-point questionnaire was also sent to top executives of National Stock Exchange (NSE). However, there has been no response from the stock Exchange. In June this year, Moneylife had written about the allegations by a Whistleblower about NSE’s HFT operations in 2011-14 period . Moneylife had duly contacted NSE for its response before writing the article. On that occasion too, the NSE had refused to respond despite three attempts by Moneylife to elicit its views. After Moneylife published the articles on HFT , NSE filed a Rs100 crore defamation suit against Moneylife with prayers to remove the articles and stop Moneylife from writing further on the issue. A single Judge in Bombay High Court dismissed this. The judge also asked NSE to pay to Ms Dalal, Debashis Basu, Editor & Publisher of Moneylife Rs1.5 lakh each as cost and Rs47 lakh to two trusts, Tata Memorial Hospital and the Masina Hospital for free treatment of the poor. The Exchange has filed an appeal against that order.    Of the 51 questions Moneylife had asked to SEBI and NSE, some the questions were: What is the additional information that a co-location user get vis-a-vis other brokers? What is the response time that NSE co-location users receive vis-a-vis non-co-location users?  How many physical co-location facilities does NSE have? Why is there more than one colocation?  What are the advantages a person will enjoy if he or she continued to get faster information vis-a-vis others in NSE co-location? What advantages do members in co-location receive vis-a-vis members who are not in co-location? What is the value of orders placed by members in last 5 years from NSE co-location?  Under which SEBI circular or guidelines did NSE start providing co-location facilities? If these services were started before any guidelines were formulated, did NSE ask for specific SEBI approval for starting such facilities? Were some NSE members ever allowed to log in ahead of others systematically? Here is the reply we received from SEBI...   Subject: Your email to Chairman, SEBI with regard to complaint of a market participant against NSE   This has reference to your email dated September 12, 2015 to Chairman, SEBI wherein you had sought certain details regarding an anonymous complaint of a market participant against NSE.   We would like to thank you for taking efforts to flag the issue. We would like to inform you that a fact finding exercise is already under way by SEBI. The matter has also been discussed extensively in the Technical Advisory Committee of SEBI and is drawing its serious attention. While we have noted the issues raised in your email, you will appreciate that we would not like to make comments on matters which are under investigation. However, we would like to inform on the various measures taken by SEBI, in the recent past.    SEBI has ensured that regulation of the securities market keeps pace with the dynamism displayed by the capital markets. SEBI has taken various proactive measures over the last few years to ensure that appropriate risk management framework is in place to address the risks associated with adoption of such technological advancements.    In line with the above emphasis, SEBI was one of the first securities market regulators globally to put in place a framework for regulation of algorithmic trading. SEBI has also put-in place a regulatory framework to ensure fair and equitable access to the co-location facility and integrity and security of the data and trading systems. The regulatory framework was finalized after taking on-board views of the market participants through a discussion paper floated on May 03, 2013. High Frequency Trading (HFT) recently has drawn the attention of IOSCO too and the member jurisdictions are deliberating the impact of such trading on the market structure and market participants. SEBI is in the process of studying various issues involved and gather international experience to take further regulatory steps to regulate HFT.   In addition, SEBI has also issued circulars on various other technology related areas such as Cyber security and cyber resilience framework for stock exchanges, clearing corporation and depositories, Testing requirements for trading software, Business continuity planning and disaster recovery, Direct Market Access, Internet Based Trading, Safeguards to avoid trading disruption in case of failure of software vendor, etc.   We may like to state that SEBI would take all necessary steps in the interests of investors in securities and market integrity.", "external_links": [], "published": "2015-10-26T20:29:00.000+02:00", "crawled": "2015-10-26T17:06:58.224+02:00", "highlightTitle": ""}