{"organizations": [], "uuid": "c055a1ff436725e6018ac419ce88851ef013d9ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l.yimg.com/bt/api/res/1.2/pPLj5Zcz9bXyereJlfpEYA--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-09T214125Z_2_LYNXNPEB9817Z_RTROPTP_3_GAS-CONFERENCE_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/exclusive-ge-nears-deal-sell-213431078.html?l=1", "country": "GB", "title": "Exclusive: GE nears deal to sell over $30 billion of loans to Wells Fargo - source", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Exclusive: GE nears deal to sell over $30 billion of loans to Wells Fargo - source - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 10, "uuid": "b00ab9a9a5af51709c8754cc416edefa662868f3"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/exclusive-ge-nears-deal-sell-213431078.html?l=1#post-0", "ord_in_thread": 0, "title": "Exclusive: GE nears deal to sell over $30 billion of loans to Wells Fargo - source", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nThe logo of General Electric is pictured at the 26th World Gas Conference in Paris, France, June 2, 2015. REUTERS/Benoit Tessier By Mike Stone\n(Reuters) - General Electric Co (GE.N) is in advanced talks to sell a specialty finance portfolio, worth more than $30 billion, to Wells Fargo & Co (WFC.N), according to a person familiar with the matter, as the industrial conglomerate returns to its roots.\nWells Fargo has so far outbid other parties for General Electric's vendor financing, commercial distribution finance and direct lending assets, the person with direct knowledge of the situation said on Friday.\nA deal could be announced by the time Wells Fargo publishes its third-quarter earnings on Wednesday, the person added, cautioning that the negotiations were ongoing and could still fall apart.\nThe source asked not to be identified because the matter is confidential. GE and Wells Fargo representatives declined to comment.\nThe sale of the loans would leapfrog GE well past its target of shedding about $100 billion worth of finance assets by the end of this year.\nThe company unveiled its latest divestment agreement on Monday - for its North American corporate aircraft financing portfolio - bringing its total deals to date related GE Capital to $97 billion.\nGE announced in April it would sell off some $200 billion in GE Capital financing assets as it focuses more on its manufacturing of industrial goods, setting off a series of transactions for the U.S. conglomerate.\nGE Capital's commercial distribution finance offers lending to dealers and manufacturers of durable goods, such as boats, recreational vehicles and off-road vehicles. Direct lending provides asset-based loans and equipment leasing to a range of mid-size and larger companies. Vendor finance allows larger networks of equipment dealers networks to offer third-party financing to buyers of equipment such as office imaging, construction, material handling and technology.\nGE's overhaul attracted fresh attention earlier this week, when activist investor Nelson Peltz's Trian Fund Management revealed it had taken a $2.5 billion stake in the company.\nWells Fargo's CFO John Shrewsberry told Reuters in a July interview that portions of GE's Commercial Loans and leases portfolio would \"fit nicely\" with Wells Fargo's businesses. With this transaction, Wells Fargo would add more interest-bearing assets to its already large lending portfolio. \nSince GE has begun to sell its finance assets earlier this year, Wells Fargo has also agreed to purchase both GE's railcar leasing business and purchased a portion of commercial real estate loans worth $9 billion.\n\n(Reporting by Mike Stone in New York; Additional reporting by Lewis Krauskopf and John Tilak in Toronto; Editing by Leslie Adler, Bernard Orr)\nConglomerates General Electric GE Capital", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T17:04:01.926+03:00", "highlightTitle": ""}