{"organizations": [], "uuid": "23538630e2f8cb1e7798e584c62bebc9f2dafa2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/nifty-sensex-trending-up-ndash-thursday-closing-report/43712.html", "country": "IN", "title": "Nifty, Sensex trending up – Thursday closing report", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Nifty, Sensex trending up – Thursday closing report", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T16:32:00.000+03:00", "replies_count": 0, "uuid": "23538630e2f8cb1e7798e584c62bebc9f2dafa2a"}, "author": "Moneylife Digital Team &amp; IANS", "url": "http://www.moneylife.in/article/nifty-sensex-trending-up-ndash-thursday-closing-report/43712.html", "ord_in_thread": 0, "title": "Nifty, Sensex trending up – Thursday closing report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Nifty, Sensex trending up – Thursday closing report 43712 Nifty, Sensex trending up – Thursday closing report 0 Comments, Be the first to comment Moneylife Digital Team & IANS | 15/10/2015 07:02 PM | As long as Nifty stays above 8,145, the market may head higher We had mentioned in Wednesday’s closing report that Nifty, Sensex are looking weak and that a close above 8,150 can recharge the bulls. The Indian equity markets made gains after three consecutive sessions of losses which came in the wake of disappointing quarterly results and negative sentiments emanating from the Chinese markets. With positive cues from the Asian markets the indices in the Indian stock markets moved into an upward trend, which could carry into tomorrow’s trading as well. For foreign investors one positive factor is that the rupee is likely to remain steady for the rest of the fiscal helped by strong macroeconomic fundamentals, which will lead to higher capital inflows and a comfortable balance of payment situation, says an India Ratings and Research report. \"The key reasons for the expecting stability in the rupee are better macroeconomic fundamentals of the economy among the emerging economies, a comfortable balance of payment situation, the postponement of policy normalisation by the US Fed to December 2015 or maybe to 2016 and a healthy capital inflow,\" India Ratings and Research said in the report. The rating agency expects the rupee to trade in the range of 64.50-66.25 for the remainder of 2015-16. The rupee today opened at 64.74 as against the previous close of 65.03. Market analysts pointed out that lowered chances of a US rate hike, buoyant global markets and rising rupee value propelled the Indian stock markets higher on Thursday. In Asian markets, Japan's Nikkei closed the day's trade up 1.15% while Hong Kong's Hang Sang rose 2.00% and China's Shanghai Composite index increased by 2.32%. Both the domestic institutional investors (DIIs) and foreign institutional investors (FIIs) were net buyers in the day's trade. According to data with stock exchanges, the DIIs bought stocks worth Rs291.73 crore and the foreign institutional investors (FIIs) picked up stocks worth Rs102.21 crore in the day's trade. Sector-wise, only S&P BSE information technology (IT) index closed in the red. It slipped by 14.95 points. The S&P BSE automobile index augmented by 417.16 points, capital goods index gained by 191.74 points, banking index surged by 178.34 points, oil and gas index rose by 136.88 points and metal index was higher by 105.33 points. Major Sensex gainers during Thursday's trade were: Tata Motors, up 8.06% at Rs.380.70; BHEL, up 3.02% at Rs.211.70; Maruti Suzuki, up 3.01% at Rs.4,379.85; Tata Steel, up 2.94% at Rs.255.30; and Hero MotoCorp, up 2.46% at Rs.2,567.45. The major Sensex losers were: Mahindra and Mahindra, down 0.86% at Rs.1,274.95; Wipro, down 0.86% at Rs.577.65; Hindalco Industries, down 0.85% at Rs.87.95; Hindustan Unilever, down 0.84% at Rs.790.70; and Cipla, down 0.83% at Rs.672.60. The top gainers and top losers of the major indices are given in the table below: The closing values of major Asian indices are given in the table below: The European indices were up by 1-1.5%. More in Moneylife", "external_links": [], "published": "2015-10-15T16:32:00.000+03:00", "crawled": "2015-10-15T17:28:08.954+03:00", "highlightTitle": ""}