{"organizations": [], "uuid": "36076432f90de0bbb34a13503baeb3b10f356cb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/17/film-beastsofnonation-idUSL1N12H00A20151017", "country": "US", "title": "RPT-Fukunaga overcomes obstacles in making of Netflix's 'Beasts of No Nation'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "RPT-Fukunaga overcomes obstacles in making of Netflix's 'Beasts of No Nation' | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T04:22:00.000+03:00", "replies_count": 0, "uuid": "36076432f90de0bbb34a13503baeb3b10f356cb5"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/17/film-beastsofnonation-idUSL1N12H00A20151017", "ord_in_thread": 0, "title": "RPT-Fukunaga overcomes obstacles in making of Netflix's 'Beasts of No Nation'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats to add additional reporting credit)\nBy Piya Sinha-Roy\nLOS ANGELES Oct 16 (Reuters) - With actors not turning up on set, crew sicknesses, equipment going missing and unpredictable weather, the filming of war drama \"Beasts of No Nation\" is fast becoming a captivating tale in itself.\n\"There were distinct, daily moments where I sat there completely demoralized, thinking this is going to be a complete failure,\" filmmaker Cary Fukunaga told Reuters ahead of the film's simultaneous release on Friday in U.S. theaters and online streaming platform Netflix Inc.\n\"Beasts,\" written, directed and produced by Emmy-winning Fukunaga, follows a pre-teen boy named Agu, whose happy, simple life with his family is suddenly and violently torn apart as a civil war breaks out in the unnamed West African country.\nAgu, played by newcomer Ghanaian actor Abraham Attah, escapes death but is captured and recruited by the mercenary Commandant (Idris Elba) and his rag-tag army of child soldiers.\nSitting at an upscale hotel in Los Angeles earlier this week, Fukunaga laughed a little as he reflected on the strenuous film shoot in Ghana.\nHe credited British actor Elba, the only professional actor in the cast and of half-Ghanaian descent, from helping to get approval for the shoot, to portraying a conflicted villain on screen.\n\"He brought humanity in a way that was unexpected for that role,\" the director said.\nWhile the story is fictional, Fukunaga said he channeled the real brutality of war in scenes of jarring violence - in one moment, Agu swings a machete into a man's skull.\n\"Maybe it's too much for some people, but I think it's necessary to not sugarcoat the brutality, to not sugarcoat the actions of these children,\" he said.\n\"Even then, I think I could have been more severe sometimes.\"\n\"Beasts\" was independently financed with a budget around $6 million, before being acquired by Netflix as the platform's first original film.\nFukunaga said he wasn't worried about the film finding its audience given Netflix's 65 million subscribers, and while \"it was always going to be a struggle to get people to go to the cinema,\" he hoped that audiences would opt to see it on big screens.\nNetflix CEO Ted Sarandos told Reuters this week that he was not concerned about the violence in \"Beasts\" limiting its audience - the film was \"already a success in terms of the amount of coverage and excitement around it.\"\n\"It's a real story of life in a turbulent world,\" Sarandos said.\n(Reporting by Piya Sinha-Roy, additional reporting by Jessica Toonkel; Editing by Diane Craft )", "external_links": [], "published": "2015-10-17T04:22:00.000+03:00", "crawled": "2015-10-17T04:01:07.012+03:00", "highlightTitle": ""}