{"organizations": [], "uuid": "b8d3cc40c2b178335a5369f3f6df9661bf304b28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/312656?filename=312656.png&amp;size=1", "site_section": "http://globenewswire.com//Rss/industry/8775/Specialty%20Finance", "section_title": "GlobeNewswire: Industry News on Specialty Finance", "url": "http://globenewswire.com/news-release/2015/10/08/774483/0/en/NASDAQ-STOCKHOLM-WELCOMES-CLX-COMMUNICATIONS-TO-THE-MAIN-MARKET.html?f=22&fvtc=3&fvtv=8775", "country": "US", "title": "NASDAQ STOCKHOLM WELCOMES CLX COMMUNICATIONS TO THE MAIN MARKET", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "NASDAQ STOCKHOLM WELCOMES CLX COMMUNICATIONS TO THE MAIN MARKET", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:15:00.000+03:00", "replies_count": 0, "uuid": "b8d3cc40c2b178335a5369f3f6df9661bf304b28"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/08/774483/0/en/NASDAQ-STOCKHOLM-WELCOMES-CLX-COMMUNICATIONS-TO-THE-MAIN-MARKET.html?f=22&fvtc=3&fvtv=8775", "ord_in_thread": 0, "title": "NASDAQ STOCKHOLM WELCOMES CLX COMMUNICATIONS TO THE MAIN MARKET", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NASDAQ STOCKHOLM WELCOMES CLX COMMUNICATIONS TO THE MAIN MARKET October 08, 2015 04:15 ET | Source: Nasdaq Nordic \nStockholm, October 8, 2015 — Nasdaq (Nasdaq: NDAQ) announced that CLX Communications AB (short name: CLX), a Mid Cap company within the Technology sector, has started trading of its shares on the Main Market of Nasdaq Stockholm. CLX Communications is the 70 th company to list at Nasdaq’s Nordic markets* in 2015. \nCLX Communications is a technology company operating through two business units, where both divisions base their operations on the proprietary CLX Communications platform. The enterprise division, called CLX Networks, offers cloud-based communication services to enterprises, enabling them to communicate with employees and customers via mobile phones or connected things (Internet of Things) in mobile networks. The operator division, operating under the brand Symsoft, provides mobile operators with solutions for voice, messaging and data services, and customer experience management. CLX Communications currently employs more than 130 professionals at 14 different offices across the world. For more information, please visit www.clxcommunications.com . \n“We are very proud of the significant interest shown in CLX Communications from investors and the general public” said Johan Hedberg, CEO and co-founder of CLX Communications. “We founded CLX with a mission to simplify communications globally and our journey has just begun. We are part of a massive shift in the communications market. We welcome our new shareholders and look forward to continue to develop and grow the company in a public environment.” \n“We are excited to welcome CLX Communications to the Nasdaq Stockholm Main Market,” said Adam Kostyál, senior vice president and head of European listings at Nasdaq. “As an entrepreneurial growth company, CLX Communications will make an exciting addition to our Technology sector. We very much look forward to support CLX on its journey as a publicly traded company.” \n*Main markets and Nasdaq First North at Nasdaq Copenhagen, Nasdaq Helsinki, Nasdaq Iceland and Nasdaq Stockholm. \nAbout Nasdaq Nasdaq (Nasdaq: NDAQ) is a leading provider of trading, clearing, exchange technology, listing, information and public company services across six continents. Through its diverse portfolio of solutions, Nasdaq enables customers to plan, optimize and execute their business vision with confidence, using proven technologies that provide transparency and insight for navigating today's global capital markets. As the creator of the world's first electronic stock market, its technology powers more than 70 marketplaces in 50 countries, and 1 in 10 of the world's securities transactions. Nasdaq is home to more than 3,600 listed companies with a market value of over $9.6 trillion and more than 10,000 corporate clients. To learn more, visit nasdaq.com/ambition or business.nasdaq.com . \nNasdaq Copenhagen, Nasdaq Helsinki, Nasdaq Iceland, Nasdaq Riga, Nasdaq Stockholm, Nasdaq Tallinn, Nasdaq Vilnius, Nasdaq Clearing and Nasdaq Broker Services are respectively brand names for the regulated markets of Nasdaq OMX Copenhagen A/S, Nasdaq OMX Helsinki Ltd., Nasdaq OMX Iceland hf., Nasdaq OMX Riga, AS, Nasdaq OMX Stockholm AB, Nasdaq OMX Tallinn AS, AB Nasdaq OMX Vilnius, Nasdaq OMX Clearing AB, Nasdaq OMX Broker Services AB. Nasdaq Nordic represents the common offering by Nasdaq Copenhagen, Nasdaq Helsinki, Nasdaq Iceland and Nasdaq Stockholm. Nasdaq Baltic represents the common offering by Nasdaq Tallinn, Nasdaq Riga and Nasdaq Vilnius. \nCautionary Note Regarding Forward-Looking Statements \nThe matters described herein contain forward-looking statements that are made under the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements include, but are not limited to, statements about Nasdaq and its products and offerings. We caution that these statements are not guarantees of future performance. Actual results may differ materially from those expressed or implied in the forward-looking statements. Forward-looking statements involve a number of risks, uncertainties or other factors beyond Nasdaq's control. These factors include, but are not limited to factors detailed in Nasdaq's annual report on Form 10-K, and periodic reports filed with the U.S. Securities and Exchange Commission. We undertake no obligation to release any revisions to any forward-looking statements. Media Relations Contact:", "external_links": [], "published": "2015-10-08T11:15:00.000+03:00", "crawled": "2015-10-09T00:04:14.495+03:00", "highlightTitle": ""}