{"organizations": [], "uuid": "28b7d2e65fd6b09d7271401edfbe08a9412a74f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/08/20/102935106-GettyImages-160894614.1910x1000.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.cnbc.com/2015/10/16/cramer-game-plan-your-portfolio-could-get-crushed.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=103085371", "country": "GB", "title": "Cramer game plan: Your portfolio could get crushed", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "Cramer game plan: Your portfolio could get crushed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "28b7d2e65fd6b09d7271401edfbe08a9412a74f0"}, "author": "yahoo", "url": "http://www.cnbc.com/2015/10/16/cramer-game-plan-your-portfolio-could-get-crushed.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=103085371", "ord_in_thread": 0, "title": "Cramer game plan: Your portfolio could get crushed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Over the many years Jim Cramer has been involved with the stock market, he has seen the same sophomoric strategy over and over again this time of year: investors sell in September to avoid the treachery of October. \n\"But given that we are on track to have the best October in four years…maybe investors will think twice before they put their brains and portfolios on month-by-month autopilot,\" the \" Mad Money \" host said. \nNext week is one of four weeks that Cramer says there are way too many companies that report. It will be a terrible time to make snap judgments, or it could crush your portfolio. That means after a company reports, wait to hear the conference call. \nIn Cramer's experience, an earnings release and simple headlines prove to be right only 50 percent of the time. So, it is important to do the homework. \n\"That's a coin toss, and we don't invest in coin-toss situations,\" Cramer said. \nWith that in mind, Cramer outlined the stocks and events he will be watching next week.\nPortfolio crushing week? \"Maybe investors will think twice before they put their brains and portfolios on month by month autopilot\" -Jim Cramer Monday: Halliburton, Valeant, IBM \nHalliburton : Cramer cares a great deal about this company, not only because it is the second largest oil service company, but because he wants to know how the planned merger with Baker Hughes is going. With the recent price cutting due to the decline in oil and gas prices, Cramer thinks the merger could stabilize pricing and create a strong rival to the competition. \nIBM : Cramer is looking to hear that the fastest growing portion of the company — the cloud, big data and cognitive businesses — have become a larger portion of the sales pie. This will calm worries about its slower-growing legacy business. If the faster-growing product lines can accelerate without a slowdown in the older divisions, Cramer thinks a bottom in the stock could come in, and he'll be pounding the table on it. \nTuesday: United Technologies, Verizon, Chipotle\nChipotle : Lately, the stock has pulled back, but Cramer thinks this could be just profit taking. He recommended using deep-in-the-money call options to bet on this stock going into the quarter. \nWednesday: Boeing, General Motors, Kimberly Clark, Kinder Morgan \nBoeing : Cramer is interested to see what Boeing has to say, as it will have to refute the talk of a wide body airplane glut, an idea generated by Delta the other day. Boeing's stock was beaten down after that statement and has tried to calm down since. \n\"If you ask me, Boeing's a keep-your-bat-on-your-shoulders situation,\" Cramer said. \nGeneral Motors: Is there any hope for Latin America? Is there a turn in China? Cramer will be all ears to find out what GM has to say. Otherwise, he's not enamored with the stock; there are too many moving parts to it for his taste. \nRead more from Mad Money with Jim Cramer \nCramer Remix: The reason why the market rallied \nTheranos CEO fires back at WSJ: I was shocked \nCramer: Enjoy the rally. It's only temporary \nThursday: 3M, Eli Lilly, Alphabet, Amazon, Microsoft, Caterpillar, McDonald's \nThis will be a hideous day for Cramer, and he's not looking forward to it. In fact, he thinks it will be absolutely miserable! \n\"It seems like everybody who hasn't yet reported decides to do it that session,\" he said. \n3M: Cramer is afraid that this one will be a tough quarter from 3M because if its exposure in Asia. That said, he has tremendous faith in CEO Inge Thulin to deliver in the long term. \nAlphabet, Amazon, Microsoft: It might sound crazy and random, but Cramer likes all three of these stocks. Hopefully, Alphabet will be better than the old Google, but he has faith. \nMcDonald's : Will it pull off something big? Cramer thinks CEO Steve Easterbrook has this company on a long-term turnaround, but it might be safer to wait and see what it has in store after the magnificent run the stock has had. \nFriday: American Airlines, Procter & Gamble, VF Corp \nAmerican Airlines: Now that it has merged with U.S. Airways, Cramer thinks there could be concerns about its merger integration. \nUltimately, next week will bring a jumble of earnings. Cramer thinks it is important to avoid taking the bait, or portfolios could get crushed. That means investors should stop, listen, learn and then pull the trigger. \nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC \nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine \n\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com \nAbigail Stevenson Digital Producer Related Securities Symbol Price   Change %Change HAL ---", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T11:39:06.828+03:00", "highlightTitle": ""}