{"organizations": [], "uuid": "9fd1b1f5c70b4d97b47c88801ba290d8eaf31148", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/adept-handling-profit-alerts-theyll-162940615.html", "country": "US", "title": "Be adept at handling profit alerts - they'll be more frequent", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Be adept at handling profit alerts - they'll be more frequent", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T19:29:00.000+03:00", "replies_count": 0, "uuid": "9fd1b1f5c70b4d97b47c88801ba290d8eaf31148"}, "author": "", "url": "https://uk.finance.yahoo.com/news/adept-handling-profit-alerts-theyll-162940615.html", "ord_in_thread": 0, "title": "Be adept at handling profit alerts - they'll be more frequent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0.00 \nBurberry and Walmart both warned on profits this week. \nTwo profits warnings, two very different triggers but one painful outcome both Burberry and Walmart saw their shares fall by more than 10pc in a single day last week. \nActually, both companies have something else in common far from presenting investors with a shocking new piece of information, both were merely confirming what they had already told their shareholders. The really surprising thing about each of these warnings was that so many were surprised. \nIn the case of Walmart, last week’s warning which knocked around $20bn off the retailer’s market capitalisation simply added detail to August’s earnings guidance. Two months ago, the company flagged a higher wage bill and the high cost of competing online with the likes of Amazon Prime. \nLast week’s alert, which wiped a 10th off the share price, merely quantified the squeeze on these two fronts up to 12pc off earnings in 2017. \nAs for Burberry, the impact of China’s slowdown on a business which sells up to 40pc of its luxury coats and scarves to Chinese buyers, can hardly have come as a shock. \nBack in July, Burberry warned that Hong Kong, responsible for a 10th of company sales, had been hit by declining numbers of mainland Chinese visitors thanks to local hostility and the relative attraction of regional destinations like Japan, where Burberry has a smaller footprint. \n* Questor share tip: Time (Xetra: 17T.DE - news ) to check out of Burberry * Brokers target Burberry after sales miss first-half targets What is interesting about these profit warnings is the fact that the information they provided should really have been in the price already. The glacial incorporation of new developments into investors’ understanding is a slap in the face for the efficient market hypothesis. In a world of instant and widespread information, the value of effective interpretation much harder to do and slower to achieve is undiminished. \nThis is particularly the case when the information disagrees with our view of the world. Investors are reluctant to accept ideas which do not confirm their biases. In the case of Burberry, the Chinese slowdown is hard to digest if your whole investment strategy over the past 10 years or so has been based on the unstoppable rise of a vast urbanised middle class in the emerging world. \nThe disruptive idea hinted at by Walmart’s profit warning is even more unsettling . What if the multi-decade shift in economic power from Labour to Capital (Other OTC: CGHC - news ) has run its course just at the moment when thinkers like Thomas Piketty are bringing the idea into the intellectual mainstream. The introduction of the living wage in Britain, China’s increasingly uncompetitive labour force and now perhaps early signs of a reversal of America’s growing inequality have big implications for investors. Walmart share price 5-day graph (Source: Bloomberg) \nInvestors need to grapple with so many of these revolutionary thoughts at once if they are to stand any hope at all of predicting the next profit warnings and so protect their portfolios. For example, a publishing friend of mine forecast to me this week that his industry will soon follow the music business into the Spotify model. Why would anyone buy a book when they can buy a subscription that gives them access to a global library? \nWhy, for that matter, would anyone buy a fridge? If you have ever wondered why your current fridge is so much shoddier than your previous one, the answer is in the ownership model. It (Other OTC: ITGL - news ) is not in the manufacturer’s interest to make a better fridge that lasts even longer. But if you leased the fridge from Bosch (BSE: BOSCHLTD.BO - news ) it would absolutely make sense for them to make a great machine with a higher re-sale value at the end of the contract. \nEconomic disruption is one reason why I expect there to be more profit warnings in future. Another reason is cyclical. We are at that stage in the cycle when companies can no longer patch up earnings growth with cost-cutting, share buy-backs and other smoke and mirrors. Eventually companies need to rebase expectations. \nThis is what happens when a new chief executive takes over, but sometimes you don’t need to wait for a new boss to clear the decks. \nSo if profit warnings are inevitable and likely to become more frequent, how should you handle them? \nFirst (Other OTC: FSTC - news ) , have a plan don’t react in the heat of the moment because you will make a poor decision. Try and judge whether the warning is a one-off or a symptom of something harder to fix. \nThink laterally about who else might be affected by the same problem (or benefit from it). \nAnd make sure that your portfolio is sufficiently diverse that the next Walmart or Burberry doesn’t finish you off. \nTom Stevenson is an investment director at Fidelity Worldwide Investment. The views expressed are his own. He tweets at @tomstevenson63.", "external_links": [], "published": "2015-10-17T19:29:00.000+03:00", "crawled": "2015-10-17T20:21:06.196+03:00", "highlightTitle": ""}