{"organizations": ["Cabela"], "uuid": "82bb1e333a809f48319c3f9b262fdb692d5c7232", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.just-style.com", "main_image": "http://i3.aroq.com/3/financials.jpg", "site_section": "http://www.just-style.com/alerts/rsssectornews.aspx?id=4", "section_title": "Latest Finance industry news - from just-style.com", "url": "http://www.just-style.com/news/cabelas-under-armour-rocky-brands_id126448.aspx", "country": "GB", "title": "US Q3 in brief: Cabela's, Under Armour, Rocky Brands", "performance_score": 0, "site": "just-style.com", "participants_count": 0, "title_full": "US Q3 in brief: Cabela's, Under Armour, Rocky Brands", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:11:00.000+03:00", "replies_count": 0, "uuid": "82bb1e333a809f48319c3f9b262fdb692d5c7232"}, "author": "", "url": "http://www.just-style.com/news/cabelas-under-armour-rocky-brands_id126448.aspx", "ord_in_thread": 0, "title": "US Q3 in brief: Cabela's, Under Armour, Rocky Brands", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Font size Email Print \njust-style's round-up of Q3 apparel and footwear industry results \nThird-quarter comparable store sales for the US retail sector as a whole are predicted to rise 1.6%, with earnings growth of 3.1%, according to Retail Metrics. In the most recent filings for the period, Cabela's posted an 18.9% fall in profit, Under Armour has lifted its full-year guidance, while Rocky Brands saw its earnings plummet, and Wolverine Worldwide lowered its outlook after net income and sales declines. Cabela's \nOutdoor and camping retailer Cabela's has said it has a number of initiatives underway to improve new store productivity and profitability, after reporting an 18.9% decline in profit. For the three months to 26 September, net income amounted to $43.7m, compared to $53.8m in the same period of last year. Revenue increased 4.6% to $926.5m from $886m a year ago, while comparable store sales fell 4.2%. Retail store revenue increased 6.5% to $637.8m and direct revenue declined 7.9% to $161.6m. The company said it plans to open seven stores in 2016, followed by no more than that in 2017. Under Armour \nPerformance wear specialist Under Armour has lifted its full-year outlook, after booking a double-digit increase in third-quarter net profit. Net income reached US$100m for the three months to 30 September, up 13% from $89m in the same period a year ago. Net revenues increased 28% to $1.20bn from $938m last year. Apparel revenues grew 23% to $866m, footwear revenues jumped 61% to $196m, while accessories revenues rose 22% to $104m. Gross margin, however, slipped to 48.8% from 49.6%. The company now expects full-year net revenues to rise $3.91bn, up from its earlier guidance of $3.84bn, representing growth of 27% over 2014. Operating income is predicted to reach $408m, compared to its previous forecast of $405-408m. Rocky Brands \nUS apparel and footwear company Rocky Brands posted a 41.9% decline in profit, reflecting softer than expected demand in its work and hunting categories. Net income amounted to $1.8m for the three months to 30 September, compared to $3.1m in the same period of the prior year. Sales fell 3.7% to $70m from $72.7m a year ago. Wholesale sales fell 12% to $54.7m, while retail sales grew 8.4% to $10.3m and military sales increased more than fourfold to $5.1m. Gross margin fell 180 basis points to 31.6%. Wolverine Worldwide \nUS clothing and footwear business Wolverine Worldwide has lowered its full-year outlook, after posting a 20.6% decline in third-quarter net profit. Net earnings amounted to US$46m for the 12 weeks to 12 September, compared to $57.9m in the same period of last year. Revenue to $678.9m from $711.1m in the prior year, while gross margin was flat at 40%. The company now expects full-year earnings per share to range from $1.28-1.31, compared to its earlier guidance of $1.39-1.46. Revenue is forecast to be between $2.69 and $2.71, down from its earlier expectations of $2.82-2.85bn, representing a 2.6-1.8% fall year-on-year.", "external_links": [], "published": "2015-10-22T20:11:00.000+03:00", "crawled": "2015-10-23T00:49:13.710+03:00", "highlightTitle": ""}