{"organizations": [], "uuid": "afd186f6e1c928d07518cf482d727c7eb19bc9a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/fintech/wp-content/uploads/sites/10/2015/10/20-iMac_right.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/fintech/p2p/gmo-click-enters-p2p-lending-with-maneo-partnership/", "country": "US", "title": "GMO Click Enters P2P Lending with Maneo Partnership", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "GMO Click Enters P2P Lending with Maneo Partnership", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T18:44:00.000+03:00", "replies_count": 0, "uuid": "afd186f6e1c928d07518cf482d727c7eb19bc9a8"}, "author": "", "url": "http://www.financemagnates.com/fintech/p2p/gmo-click-enters-p2p-lending-with-maneo-partnership/", "ord_in_thread": 0, "title": "GMO Click Enters P2P Lending with Maneo Partnership", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GMO Click Enters P2P Lending with Maneo Partnership GMO Click Enters P2P Lending with Maneo Partnership A collaboration uniting one of the globe's oldest P2P lenders with a longstanding securities broker is set to introduce new customers to online lending. Advertising Print This Post \nFor investors, P2P lending has quickly grown from a fringe asset class to a popular alternative to traditional fixed income securities. Focused on various types of loans such as for small businesses, student loans or do it yourself home improvement projects, with the P2P lending platform, private investors lend directly to borrowers. As electronic marketplaces, many platforms are able to provide lending terms to borrowers that are below those they can source from banks. In addition, due to record low interest rates around the globe, investors are seeing higher returns than those of traditional fixed income products. \nThe growth in P2P lending has led to a growing market and increased competition for new borrowers and investors. As a result, many lending platform operators are looking towards partnerships to assist in customer referrals. Examples of partnerships include deals with accounting and software firms that deal with small and medium businesses, cooperation with websites that serve the home improvement sector, and personal finance app developers. \nAdding to the list of partnerships is a deal announced today between GMO Click Securities and P2P lender Maneo . Both based in Japan and serving the local market, Maneo operates a P2P lending platform, which according to the firm has been used to raise ¥34 billion (@$283 million) in loans since its founding in 2007. \nPartnering together, GMO and Maneo plan to work together to increase P2P lending as an investment product for retail investors. As part of the deal, GMO Click is expected to introduce P2P investing to its customers and act as a source of leads to Maneo. \nIn addition to acting as a customer referral source which is similar to other partnerships closed by P2P lenders, GMO Click and Maneo are also expected to collaborate on several operating initiatives. Among them include creating liquidity pools of lending capital, developing new markets to offer loan services for, including mezzanine loans, and having ongoing business development discussions of the P2P lending industry. \nBeyond being another P2P lending partnership, the deal is noteworthy as it involves a brokerage firm. Despite what could be considered overlapping customer bases, as of yet, there has been very little cooperation between investment brokers and P2P lenders or equity crowdfunding platforms. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-10-20T18:44:00.000+03:00", "crawled": "2015-10-20T15:50:19.301+03:00", "highlightTitle": ""}