{"organizations": [], "uuid": "17d71a60b8ca7789cf811fc0da4f2ae12578d68f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/beijing-versus-the-billionaire/150293", "country": "IE", "title": "Beijing versus the billionaire", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Beijing versus the billionaire | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:23:00.000+03:00", "replies_count": 0, "uuid": "17d71a60b8ca7789cf811fc0da4f2ae12578d68f"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/beijing-versus-the-billionaire/150293", "ord_in_thread": 0, "title": "Beijing versus the billionaire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Editorial: Making govt accountable Editorial: Drought in farm reforms Studying Consumption China’s government and Hong Kong’s wealthiest man, the much-admired Li Ka-shing, have been waging an acidic spat—one that increasingly looks like a bitter divorce being played out in tabloid newspapers. Indeed, Chinese media have lately been directing a relentless stream of vitriol at Li. His “crime”? Buying low in Europe and selling high in China—that is, acting like an investor.\nThe trigger for this wave of scorn was Li’s sell-off of some of his prime Shanghai properties, after relocating his corporate registry from Hong Kong to the Cayman Islands. This is a completely mundane and rational business decision, aimed at minimising tax obligations. Indeed, some 70% of all Hong Kong-listed companies have a Caribbean registry, and even a number of major mainland companies, including the Internet giant Alibaba, are registered in offshore tax havens.\nBut, in the Chinese media’s puerile narrative, the move exposes Li as “ungrateful” and “unpatriotic”. He is “abandoning” China—which, it is claimed, enabled him to rise from extreme poverty to become one of the world’s wealthiest men—when the country needs him most.\nThis absurd account neglects the fact that Li was already one of the world’s wealthiest people before he ever invested in China. Perhaps more important, it fails to recognise that Li’s Chinese land holdings still amount to more than 20 million square meters (215 million square feet)—nearly a quarter of the size of Manhattan—and that the number of retail outlets he owns in China has increased by 70% in two years.\nBut the facts are irrelevant. This is a matter of politics. As China attempts to tighten its grip on Hong Kong, Li is showing independence, and China’s new rulers—who, true to their communist roots, believe firmly in top-down control—do not like it one bit.\nThe ongoing squabble represents a significant shift in Li’s relationship with China’s government. A former adviser to Deng Xiaoping and confidante of former President Jiang Zemin (whose political influence is now waning), Li was among the first to invest in China after the Tiananmen Square massacre of 1989. He long touted the motto, “I don’t do anything against China’s interest, and I don’t say anything that may hurt China’s reputation.”\nThat changed in 2012, when Leung Chun-ying was appointed as Hong Kong’s chief executive. China’s first choice for the position, Henry Tang, was forced to withdraw because of private indiscretions and a disgraceful bid to have his wife take the fall for a zoning violation.\nLeung became China’s man in Hong Kong, responsible for doing the Chinese government’s bidding—including taking an uncompromising position against pro-democracy protests by students and intellectuals. Indeed, even as China’s agenda in Hong Kong has become increasingly tough—and thus unpopular locally—Leung has proved himself to be absolutely loyal to China’s rulers.\nLi, however, stood by Tang. More problematic, he has occasionally dissented publicly from Leung’s various misguided policies. As any student of the People’s Republic knows, expressions of political disagreement, however mild, can be lethal. There is no “agree to disagree” in China; once the leader has spoken, there is only “obey”.\nIn Li’s case, the stakes are particularly high. Unlike most of Hong Kong’s tycoons, who are considered excessively focused on political expedience, Li is viewed as a person of strong conscience and thus worthy of considerable respect. He even enjoys the affectionate nickname “Superman”.\nBut now, China’s rulers, through Leung, are pushing potentially disastrous policies aimed, in Chinese Communist Party parlance, at “de-colonising” Hong Kong. For example, officials recently declared that judicial independence and the separation of powers are “colonial” legacies that should be discarded, with China’s government and Hong Kong’s chief executive, not the local courts, calling all the shots. In this moment of transition, dissent from someone of Li’s standing could have precisely the kind of destabilising impact that China’s leaders fear. So Li has to be “de-deified”.\nChina’s attacks have pushed Li, after almost three weeks of stony silence, to do something he had never done before: strike back. Not only did he point out that all of the accusations about his intentions to abandon China were false; he openly accused China of using tactics from the Cultural Revolution that left him “trembling with fear” and sent “shivers down the spine.”\nLi concluded his statement with the message, delivered via three lines by two canonical Chinese poets from the ancient Tang and Song dynasties, that his home was where he felt safe. The subtext to any literate Chinese was clear: “China may be my ancestral country, but I am a free man, free to choose my home.”\nLi, an avid reader of world history and literature, has apparently not taken to heart the lesson that so many Chinese have learned, through great personal tragedies, since 1949. The core values of China’s government are not informed by the humane civility of Tang or Song poets, but by the twisted dialectics of Marxism-Leninism and the amoral militaristic tradition of a party that still cherishes its often brutish and violent habits of governance.\nAs China’s leaders continue to push for more control over Hong Kong, spinal shivers are likely to become an increasingly common feature of life there.\nSin-ming Shaw, a private investor, was recently a visiting scholar at the University of Michigan\nCopyright: Project Syndicate, 2015\n 13, 2015 12:23 am", "external_links": [], "published": "2015-10-13T08:23:00.000+03:00", "crawled": "2015-10-13T10:08:31.811+03:00", "highlightTitle": ""}