{"organizations": [], "uuid": "0ab8aa77e76e224f7a022061fe200b1758358cb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/k/4/i/3/x/image.related.articleLeadwide.620x349.gk4c9e.png/1444283633304.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2530/consumer-discretionary/consumer-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/retail/cola-price-war-keeps-costs-down-for-consumers-20151008-gk4c9e.html", "country": "AU", "title": "Coke vs Pepsi: Cola price war keeps costs down for consumers", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Coke vs Pepsi: Cola price war keeps costs down for consumers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "0ab8aa77e76e224f7a022061fe200b1758358cb6"}, "author": "", "url": "http://www.smh.com.au/business/retail/cola-price-war-keeps-costs-down-for-consumers-20151008-gk4c9e.html", "ord_in_thread": 0, "title": "Coke vs Pepsi: Cola price war keeps costs down for consumers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One of retail's oldest battles is heating up again this summer. Photo: Glen Hunt\nCoke addicts rejoice, the cola wars should keep the price of your beloved black beverage down this summer after Coca-Cola Amatil reverted to deep discounting to drive sales in September.\nFor one week in September Coke was even cheaper than arch rival Pepsi, according to Deutsche Bank's latest supermarket pricing survey.\nHeavy discounting in the three months to the end of September narrowed the price gap between Coke and Pepsi and drove Coke's price premium below the long term average of 40 per cent.\nCoca Cola Amatil has cut prices to levels not seen since the aftermath of the Coke Life launch\nCoca-Cola Amatil led the latest cola price cutting spree, according to Deutsche analyst Michael Simotas​, driving Coca-Cola prices down 7.7 per cent in the quarter.\nAdvertisement Pepsi also cut prices across the quarter but not as savagely as Coca-Cola and its prices lifted towards the end of the period.\nIn the same time frame competitor Schweppes put up its prices by 3.3 per cent after a 2.5 per cent decline in the last quarter of fiscal 2015.\n\"Amatil continued to have some of the deepest promotions we have ever seen,\" Mr Simotas said.\n\"It is notable that in one week of September, Coca-Cola was at a 6 per cent price discount to Pepsi. This has happened before but not since October 2013.\"\nThe discounts put Coke prices at levels not seen since the deep discounting that followed the release of Coke Life and suggest the new formulation has not provided a big boost to sales.\nDeutsche's supermarket inflation index showed Coca-Cola Amatil retreated from deep price cuts around the middle of this year but it got the red pen out again around July and then again around August.\nA spokesperson for Coca-Cola Amatil said the company would continue to pursue \"targeted price investment as appropriate\".\nOne analyst said Coca-Cola Life was formulated to capture a more health conscious Coke drinker, who had cut down on their consumption in response to the concerns about the amount of sugar in the drink.\n\"But they (Coca-Cola Amatil) are also trying to bring back in people who don't like the taste of Diet Coke but who were worried there was a lot of sugar in Coke,\" he said.\nLife was also targeting a younger drinker, who has turned away from Cola in favour of water, juices and flavoured milks.\nDespite this marked demographic shift in just one generation, Coke and Pepsi are still major drivers of foot traffic for the major supermarkets Coles, Woolworths and the IGA retailers.\nBut the constant discounts and promotions have reduced the effective pulling power of cola as a category.\nMore retail news and analysis", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T10:18:55.749+03:00", "highlightTitle": ""}