{"organizations": [], "uuid": "93e9cdec9586fe7880125437e85fcf74c8230dac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l.yimg.com/bt/api/res/1.2/HGvfuGy1ogtLly1UGuylSw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-26T051226Z_1_LYNXNPEB9P07X_RTROPTP_3_USA-FED_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/yellen-consensus-builder-needs-send-051226100.html?l=1", "country": "GB", "title": "Yellen, consensus-builder, needs to send strong signal at Fed meet", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Yellen, consensus-builder, needs to send strong signal at Fed meet - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 3, "uuid": "93e9cdec9586fe7880125437e85fcf74c8230dac"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/yellen-consensus-builder-needs-send-051226100.html?l=1", "ord_in_thread": 0, "title": "Yellen, consensus-builder, needs to send strong signal at Fed meet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nFederal Reserve Chair Janet Yellen holds a news conference following the Federal Open Market Committee meeting in Washington September 17, 2015. REUTERS/Jonathan Ernst By Ann Saphir\nSAN FRANCISCO (Reuters) - Federal Reserve Chair Janet Yellen, praised as an adept listener and consensus builder, may need to adopt a stronger tone at this week's policy meeting if she expects to keep a December interest rate rise in play. \nYellen's inclusive style has been tested recently by two fellow governors who publicly appeared to disagree with her view, shared by Vice Chair Stanley Fischer, that the Fed will probably need to raise interest rates this year. \nGovernors are permanent members of the Fed's policy-making panel who typically vote with the chair, and it is unusual for them to publicly contradict the Fed chief. Yet both Lael Brainard and Daniel Tarullo, speaking shortly after Yellen and Fischer, listed an array of risks to economic growth that suggested rate hikes should wait. \nMost other Fed voters, with the notable exception of the dovish president of the Chicago Fed, have suggested that they, like Yellen, support a 2015 rate rise. The arithmetic suggests Yellen could face as many as three dissents from her 10-member panel if she decides to raise rates at the Fed's December meeting. \nIt may not come to that since regardless of the debate about the timing of the rate lift-off nearly all Fed policymakers do agree on a broad scenario of gradual rate increases once they start. Fed tradition may also count: though regional presidents sometimes dissent, no governor has done so since 2005.\nWhat is perhaps more troubling for Yellen than the specter of dissents is that many investors do not believe the Fed will raise rates at all this year. Unless Yellen manages to shift those expectations well ahead of time, possibly starting with the Oct. 27-28 meeting, a rate hike could roil markets.\n\"It’s urgent for the committee to communicate more clearly about their policy strategy,\" Yellen's former advisor Andrew Levin said, adding that the onus for doing so is on the Chair.\nA Fed spokeswoman declined to comment for this story.\nYellen's style contrasts with that of some of her predecessors, notably Alan Greenspan, who used to dictate the outcome of meetings as, or even before, they began. \nYellen spends the better part of the days leading up to each policy-setting meeting talking in person or by phone with each of her 16 fellow policymakers, her schedules show. Not even Ben Bernanke, a former academic who like Yellen valued consensus, appears to have conferred as much on so regular a basis.\nThat consensual style has paid dividends, enabling Yellen to keep hawkish members of the committee on side.\nRichmond Fed President Jeffrey Lacker heeded Yellen's call to wait with rate hikes for more clarity that inflation was firming, breaking ranks with her only just last month. \nIt also may have helped in September when San Francisco Fed President John Williams, a centrist, saw strong arguments on both sides, but ultimately agreed to \"go along\" with Yellen's majority, as he told reporters afterwards.\n\nCOMMUNICATING WITH MARKETS\nFed officials have pledged that any rate rise would not come as a surprise to markets. Yet now Yellen and investors appear at odds, with markets now betting that the first hike in a decade will come in March 2016 at the earliest.\nMarkets virtually rule out a move this month, and see a 39 percent chance of a December hike based on fed funds futures trading.\nThis week's meeting needs to improve those odds to keep December on the cards.\nTo convince markets a rate hike is coming, the statement needs to suggest that only a deterioration in the economy could forestall it, said Levin. \nAnother option would be for the Fed to flag a rate rise by softening, or removing, its warning about the risks from a global slowdown that stopped it from raising rates last month.\nYellen could be still persuaded by weak economic data and her dovish colleagues that the economy needs more time to withstand a rate rise. A change of heart would also need some clear explanation, and could draw criticism anyway. \n\"She could be facing a fork in the road where there are several dissents no matter which way they go,\" Levin said.\nWhile the U.S. unemployment rate is near normal at just above 5 percent, inflation is unusually low and the Fed is alone in contemplating policy tightening while its peers in Europe, Japan and China remain in an easing mode. Such a constellation makes finding consensus on policy harder than usual.\n“People don’t know where their (the Fed's) next step is,” Stanford University professor John Taylor told Reuters. “There can be a lack of consensus about the rationale for the choice, but the choice has to be made.” \nFormer Vice Chair Don Kohn, though, believes that Yellen can remain true to her collaborative style, and reflect, rather than simply direct, the view of the majority.\n“She has worked hard to build a committee consensus,” Kohn said. “This is a very difficult decision that isn’t clear cut one way or another. It’s up to the chair to find and guide the center of gravity.” \n\n(Reporting by Ann Saphir; Editing by David Chance and Tomasz Janowski)\nBudget, Tax & Economy Janet Yellen Fed", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T09:39:15.560+02:00", "highlightTitle": ""}