{"organizations": [], "uuid": "375f98a41b0b154080ad489d60f9847f74d0df05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/the-richest-politicians-in-the-u-s-163344675.html?l=1", "country": "GB", "title": "The Richest Politicians in the U.S.", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "The Richest Politicians in the U.S. - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 10, "uuid": "375f98a41b0b154080ad489d60f9847f74d0df05"}, "author": "Palmer Gibbs", "url": "http://finance.yahoo.com/news/the-richest-politicians-in-the-u-s-163344675.html?l=1", "ord_in_thread": 0, "title": "The Richest Politicians in the U.S.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View photo\n. When billionaire businessman Donald Trump announced his campaign in June, he told the crowd he would self-fund his presidential bid, explaining, “I’m using my own money. I’m not using the lobbyists. I’m not using donors. I don’t care. I’m really rich…”\nThe Donald’s campaign to be the Republican nominee for the White House is unique for many reasons, but one of the main things that sets him apart may well be his enormous personal wealth. With a net worth that reaches far into the billions, his “I’m really rich” self-assessment feels like a bit of an understatement.\nWhile Trump’s wealth is an outlier, even in the moneyed business of political campaigns , many other politicians sport hefty bank accounts of their own. Using a variety of data sources and research, InsideGov took a look at the richest active politicians, ranking the top 24 officials and candidates. While creating the list, InsideGov consulted data from the Center for Responsive Politics and included federal-level legislators, governors and declared presidential candidates.\n \n#24. Lincoln Chafee A Rhode Island native, Lincoln Chafee might just be the most interesting politician you’ve never heard of. Chafee started out in the Senate as a Republican, then became his state’s governor after running as an independent. After one term in the Governor’s Mansion, Chafee decided to run for president in 2016 as a Democrat. Chafee and his wife, Stephanie, both come from wealthy, well-connected families (her family founded the prestigious Rhode Island School of Design in 1877). Fun fact: During his announcement, Chafee – whose father was a Republican politician – said the U.S. should adopt the metric system.\n \n#23. Rep. James Renacci Diversity is the key to Rep. James Renacci’s wealth. The Ohio Republican, who was first elected to the House in 2010, has made his money from real estate investments, car dealerships, a restaurant and two sports teams.\n \n#22. Sen. James Risch Sen. James Risch built his personal wealth as a trial lawyer, and served in Idaho as a state senator, lieutenant governor and governor before being elected to the U.S. Senate in 2008. He was re-elected in 2014, and is the chairman of the Energy Subcommittee.\n \n#21. Sen. Bob Corker After founding a construction company when he was 25 years old, Sen. Bob Corker stayed in that line of work, eventually acquiring two real estate companies. The two-term senator now holds a number of different investment funds and accounts.\n \n#20. Carly Fiorina The only woman running for president in the crowded Republican primary field, Carly Fiorina uses her executive experience at AT&T, Lucent Technologies and Hewlett-Packard to argue she is best suited to be commander in chief. But her tenure at those companies is under scrutiny. In the six years she was the CEO at HP , 30,000 employees were laid off and she banked $100 million.\n \n#19. Rep. Chris Collins An Empire State native, Rep. Chris Collins started out in the business world as the CEO of an industrial gear manufacturer and later invested in a handful of companies based in western New York. Collins was first elected to the House in 2012, and before that, served as the executive of Erie County.\n \n#18. Rep. Alan Grayson After getting his undergraduate, law and master's degrees from Harvard, Rep. Alan Grayson started his career as a lawyer with an emphasis on contract law. He then ran IDT Corporation, a telecommunications company. The Democratic congressman is running for Senate, an open position since Republican Sen. Marco Rubio is campaigning for the White House.\n \n#17. Sen. Dianne Feinstein A native of San Francisco, Sen. Dianne Feinstein served in city government for years before first getting elected to the Senate in 1992. Feinstein has multiple real estate investments , and her husband, Richard C. Blum , heads up an investment firm called Blum Capital Partners.\n \n#16. Rep. Suzan DelBene Rep. Suzan DelBene built her career in the technology sphere, starting out at Microsoft in the late 1980s. She founded drugstore.com, the online health and beauty store, and eventually returned to Microsoft as its vice president of mobile communications. After an unsuccessful run for the House in 2010, the Washington State Democrat was elected in 2012; a local newspaper reported that DelBene spent millions of her own money on her first two congressional races.\n \n#15. Rep. Scott Peters Rep. Scott Peters started out as an environmental lawyer and served on the city council before getting elected to the House in 2012. The San Diego congressman’s wife, Lynn E. Gorguze , is the president and CEO of Cameron Holdings, an investment company with offices in St. Louis and La Jolla.\n \n#14. Rep. Vern Buchanan A big source of wealth for Rep. Vern Buchanan is his national string of auto dealerships, Buchanan Automotive Group. In 2008, the Florida Republican faced a first round of accusations of campaign fraud – that he had employees from his dealerships make campaign contributions and then reimbursed them. The House Ethics Committee later investigated Buchanan for errors found on his financial disclosure forms, but ultimately cleared him.\n \n#13. Sen. Richard Blumenthal Sen. Richard Blumenthal started his career in law, and was the state’s Attorney General for 20 years. The Connecticut Democrat, who went to Yale Law School with Hillary Clinton , was first elected to the U.S. Senate in 2010. Blumenthal’s wife, Cynthia, has family connections to New York real estate: her father, Peter Malkin, is a part-owner of the Empire State Building.\n \n#12. Rep. Nancy Pelosi Rep. Nancy Pelosi, a longtime congresswoman from San Francisco, became the first female Speaker of the House in 2007 , and remains the highest-ranking female politician in the U.S. Pelosi and her husband, Paul, own multiple properties in the Bay Area, including a vineyard in Napa.\n \n#11. Gov. Rick Scott Gov. Rick Scott was first elected in 2010, and four years later, he eked out another term in the Governor’s Mansion by just one percentage point. Scott made his fortune in the health care industry, forming the Columbia Hospital Corporation in the 1980s. He has spent almost $90 million of his own money during his campaigns in Florida.\n \n#10. Rep. Michael McCaul A Texas native, Rep. Michael McCaul was first elected to the House in 2004 to represent the 10th District, which covers Austin and some outer suburbs of Houston. McCaul’s wife, Linda, is the daughter of the founder of radio broadcasting giant Clear Channel Communications. In 2011, Roll Call reported that the Republican representative’s wealth ballooned in a year after “large transfers from his in-laws.”\n \n#9. Rep. Dave Trott Armed with a law degree from Duke University, Rep. Dave Trott heads up Trott Law , a real estate finance law firm. The Michigan Republican is serving in his first term in the House, and has been a major donor to the Republican Party and GOP candidates.\n \n#8. Rep. Jared Polis A Boulder, Colo., native, Rep. Jared Polis has represented his home district in the House since 2008. He formed American Information Systems, an IT company, while still in college at Princeton University, and was named an entrepreneur of the year in 2000 by Ernst and Young. Polis is the first openly gay parent in the House.\n \n#7. Rep. John K. Delaney Rep. John Delaney founded two lending companies, Health Care Financial Partners and CapitalSource, which both went public on the New York Stock Exchange. The Maryland Democrat, whose district covers the outer suburbs of D.C., was first elected to the House in 2012.\n \n#6. Sen. Mark Warner Sen. Mark Warner served as Virginia’s governor in the early 2000s and was first elected to the Senate in 2008 (he narrowly won a second term in 2014). The Democrat made most of his money from the cell phone industry, investing in Nextel early on and starting an IT venture capital firm called Columbia Capital .\n \n#5. Rep. Darrell Issa Rep. Darrell Issa has topped the list of wealthiest members of Congress for years, having built a fortune on his car alarm services company, Directed Electronics. The California Republican founded the business in the mid ‘90s, and stepped down in 2000 when he was first elected to the House.\n \n#4. Gov. Mark Dayton As a descendent of the founder of the Target Corporation, Gov. Mark Dayton is part of one of America’s wealthiest families, according to Forbes . The Democrat served in the Senate for one term before being elected as Minnesota’s governor in 2010.\n \n#3. Gov. Bill Haslam Gov. Bill Haslam jumped to the upper reaches of the list of wealthiest politicians in 2015. The Republican, who was the mayor of Knoxville before moving into the Governor’s Mansion in 2010, is the heir to the Pilot Flying J, a chain of truck stops in the U.S. and Canada. Cheaper gas prices meant the private company scored a larger profit in 2014 – and padded Haslam’s bank account.\n \n#2. Gov. Pete Ricketts Gov. Pete Ricketts’ dad, Joe, is the founder of TD Ameritrade, an online broker and investing company. The Ricketts family, which Forbes lists as the 66th richest family in America with a net worth of $4.5 billion, is also the major owner of the Chicago Cubs baseball team. But the first-term governor out of Nebraska isn’t the only member of the family to be involved in politics: his brother, Todd, heads up the conservative super PAC Ending Spending , and his sister, Laura, formed LPAC , a political group that promotes pro-lesbian candidates and policies.\n \n#1. Donald Trump Like The Donald said: “I’m really rich.” The TV personality and real estate tycoon made his money from his various commercial properties. Soon after he announced he was running for president, Trump claimed he was worth $10 billion , but that figure has been disputed, most recently by Forbes, which claimed Trump was worth closer to $4 billion. Either way, he has enough money to run for president as many times as he pleases.\nResearch More on U.S. Politicians \nPolitics & Government Legislative Branch Donald Trump Lincoln Chafee White House Dianne Feinstein Chris Collins", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T02:22:27.690+03:00", "highlightTitle": ""}