{"organizations": ["Credit Acceptance Corporation Southfield", "Credit Acceptance", "Credit Acceptance Corporation"], "uuid": "5601647c44524f17cd74b01e77d8aa954a77a445", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "", "site_section": "http://globenewswire.com//Rss/industry/8773/Consumer%20Finance", "section_title": "GlobeNewswire: Industry News on Consumer Finance", "url": "http://globenewswire.com/news-release/2015/09/30/772440/10151262/en/Credit-Acceptance-Announces-Completion-of-75-0-Million-Revolving-Secured-Warehouse-Facility.html?f=22&fvtc=3&fvtv=8773", "country": "US", "title": "Credit Acceptance Announces Completion of $75.0 Million Revolving Secured Warehouse Facility", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Credit Acceptance Announces Completion of $75.0 Million Revolving Secured Warehouse Facility", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:55:00.000+03:00", "replies_count": 0, "uuid": "5601647c44524f17cd74b01e77d8aa954a77a445"}, "author": "", "url": "http://globenewswire.com/news-release/2015/09/30/772440/10151262/en/Credit-Acceptance-Announces-Completion-of-75-0-Million-Revolving-Secured-Warehouse-Facility.html?f=22&fvtc=3&fvtv=8773", "ord_in_thread": 0, "title": "Credit Acceptance Announces Completion of $75.0 Million Revolving Secured Warehouse Facility", "locations": ["Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Credit Acceptance Announces Completion of $75.0 Million Revolving Secured Warehouse Facility September 30, 2015 16:55 ET | Source: Credit Acceptance Corporation Southfield, Michigan, Sept. 30, 2015 (GLOBE NEWSWIRE) -- Credit Acceptance Corporation (NASDAQ: CACC) (referred to as the \"Company\", \"Credit Acceptance\", \"we\", \"our\", or \"us\") announced today the completion of a $75.0 million revolving secured warehouse facility with an institutional investor. Under this facility, we will contribute loans to a wholly-owned special purpose entity (\"SPE\") and the SPE may borrow up to the lesser of 80% of the net book value of the contributed loans or $75.0 million during the facility's revolving period. The facility will cease to revolve on September 30, 2018. If the facility is not renewed prior to this date, and we and the SPE are in compliance with the terms and conditions of the agreement, any amounts outstanding will be repaid over time as the collections on the loans securing the facility are received. No borrowings were initially made on the facility. Borrowings under the facility will bear interest at a rate equal to LIBOR plus 200 basis points. We will receive a servicing fee of 6.0% of the cash flows related to the underlying consumer loans. The remaining 94.0%, less amounts due to dealers for payments of dealer holdback, will be used to pay principal and interest on the notes as well as the ongoing costs of the financing. Using a unique financing structure, our contractual relationships with our dealers remain unaffected with the dealers' rights to future payments of dealer holdback preserved. Description of Credit Acceptance Corporation Since 1972, Credit Acceptance has offered automobile dealers financing programs that enable them to sell vehicles to consumers, regardless of their credit history. Our financing programs are offered through a nationwide network of automobile dealers who benefit from sales of vehicles to consumers who otherwise could not obtain financing; from repeat and referral sales generated by these same customers; and from sales to customers responding to advertisements for our product, but who actually end up qualifying for traditional financing. Without our financing programs, consumers are often unable to purchase a vehicle or they purchase an unreliable one. Further, as we report to the three national credit reporting agencies, an important ancillary benefit of our programs is that we provide a significant number of our consumers with an opportunity to improve their lives by improving their credit score and move on to more traditional sources of financing. Credit Acceptance is publicly traded on the NASDAQ under the symbol CACC. For more information, visit creditacceptance.com . CONTACT: Investor Relations: Douglas W. Busk Senior Vice President and Treasurer (248) 353-2700 Ext. 4432 IR@creditacceptance.com Related Articles", "external_links": [], "published": "2015-09-30T23:55:00.000+03:00", "crawled": "2015-10-02T06:23:16.116+03:00", "highlightTitle": ""}