{"organizations": [], "uuid": "8e3662cbae1bb031fec7d9e3b84bf48c781d4a3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/LE-AA431_LABS_G_20151012121138.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/nontech-companies-launch-innovation-labs-1444734539", "country": "US", "title": "Nontech Companies Launch Innovation Labs", "performance_score": 3, "site": "wsj.com", "participants_count": 1, "title_full": "Nontech Companies Launch Innovation Labs - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:09:00.000+03:00", "replies_count": 0, "uuid": "8e3662cbae1bb031fec7d9e3b84bf48c781d4a3b"}, "author": "Elizabeth Dwoskin", "url": "http://www.wsj.com/articles/nontech-companies-launch-innovation-labs-1444734539", "ord_in_thread": 0, "title": "Nontech Companies Launch Innovation Labs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS These days, it seems like every company wants to be a tech company.\nThe idea isn’t to develop mass-market software or electronic gadgets, but for each company to find its own way to gain a technological edge—or risk getting disrupted.\nMore in Journal Report The Untapped Value of Customer Data A Crucial Skill Millennials Bring to Today’s Far-Flung Workplaces The Key Reason Companies Succeed or Fail Digitally Say Goodbye to Computer Screens “One day, companies may wake up and realize they’ve been Ubered,” says Forrester Research Inc. FORR 0.25 % analyst James McQuivey, a reference to how Uber Technologies Inc. has shaken up the transportation industry with its ride-sharing app. “They are aggressively trying to prepare for and even pre-empt that outcome.”\nTo that end, many companies that don’t spring to mind when you think of advanced technology have been setting up innovation labs in and around San Francisco, rubbing elbows with many of the startups fueling the latest technology boom. Hardware chains Lowe’s LOW 0.65 % Cos. and Home Depot Inc., HD 0.47 % retailers Target Corp. TGT 0.42 % , Walgreens Boots Alliance Inc., WBA 0.98 % American Eagle Outfitters Inc. AEO -0.86 % and Sears Holdings Corp. SHLD -0.74 % , and real-estate giant Westfield Corp. WFGPY -0.07 % are among dozens of big-name businesses that have built labs in the San Francisco Bay Area in recent years.\nThe labs are used to develop technologies and business strategies, recruit tech talent, showcase new technology and meet with hot startups that could be potential acquisitions. To help attract talent, spur creativity and freshen companies’ images, the labs are designed to look and feel like startups, complete with ping pong tables, whiteboards, brainstorming pods, brightly colored office furniture, and catered breakfast and lunch.\nThe question is whether these innovation labs, most of which are just a few years old, will come to represent substantial changes in the way sprawling corporate giants launch new products, says Hayagreeva Rao, a professor at Stanford University’s Graduate School of Business, whose research focuses on scaling up innovation.\nTaking the wheel At Visa Inc. V 1.37 % ’s 12,000-square-foot innovation center in downtown San Francisco, the company says it is trying to build the future of the payments industry. That future isn’t about plastic that you slip into your wallet, it’s about payments made with smartphones and other mobile devices, says Jim McCarthy, the company’s global head of innovation and strategic partnerships.\nThe concept for the downtown space arose out of Visa’s fears of market disruption. Back in 2012, Google launched Google Wallet, an app that allows people to pay for items in stores with their smartphones. The problem for Visa and others in the credit-card industry was that, because of the way the app’s technology was configured, purchases made by consumers with their credit cards through Google Wallet would appear to card companies as if they were made at Google—rather than at the merchant where the consumer bought the item. That made it nearly impossible for the card companies to resolve disputes or detect fraud.\nGoogle’s surprise move was a wake-up call, Mr. McCarthy says. “We needed to become more willing to drive innovation rather than sit back and wait for things to break,” he says.\nThe 50 or so engineers at Visa’s innovation center have built software that solves the problem of identifying where purchases were made with Google Wallet and other payment apps. They’ve also collaborated with a U.S. auto maker—Visa won’t say which one—to build a credit-card payment system directly into a car, which is on display at the innovation center. The technology is designed to allow a driver to make a payment at a gas station or a drive-through without having to fish out a credit card.\nTechnology that delivers At Westfield, an Australian real-estate company that owns upscale shopping malls all over the world, Kevin McKenzie, the company’s chief digital officer, runs Westfield Labs, on the top floor of the company’s flagship San Francisco mall. The location helps Westfield’s engineers maintain contact both with the stores in the mall and their patrons.\nIn the lab’s first project, in 2013, engineers built proprietary software that gives people who visit the Westfield website in Australia a daily update on the inventory available in mall stores there. That project boosted foot traffic in stores, Mr. McKenzie says.\nWestfield also uses its lab to meet up-and-coming startups that may offer an edge or pose a challenge to the company’s business. Westfield recently invested in a startup called Deliv that delivers packages from the mall to consumers’ homes—an attempt to stay competitive with Amazon.com Inc. AMZN 1.92 % If the idea takes off, Westfield will then have a role in orchestrating and facilitating the delivery process, rather than sitting on the sidelines, Mr. McKenzie says.\nGoing another way All of this represents a new approach to corporate innovation, which usually has involved hiring outside consultants for specific projects or building small offices in Silicon Valley focused on acquisitions, says Stanford’s Dr. Rao.\nIncreasingly, outside consultants are out, in-house engineers are in. And companies including Visa say they aren’t just keeping up with new technology but also are trying out a new identity as cutting-edge innovators.\nOne potential drawback of this approach, Dr. Rao says, is that while companies create labs to insulate creative people from the day-to-day constraints of running a business, sometimes the labs can become peripheral, lacking in real power.\nIt’s too early to tell whether many of the newer experiments have staying power. But some of the older labs already aren’t what they used to be. Nordstrom Inc., JWN 0.58 % which was early to the innovation trend, founding its lab in 2010, significantly scaled it back earlier this year in favor of placing technology innovators in various business groups. Amazon scaled back its decade-old Silicon Valley innovation center, Lab126, earlier this year, dismissing dozens of engineers, after the failure of the company’s Fire phone. Those shifts suggest that companies are still trying to get the innovation model right.\nOne alternative to a full-scale lab, Dr. Rao says, is a startup accelerator, where executives get six weeks away from business as usual to work on a single project. That recreates the frenzied pace of a startup and breaks up the bureaucratic inertia that can set in at any company, the professor says.\n“When you’re away from the mother ship, you don’t have to focus on briefing and managing the boss. You can focus on the customer, the competitor, and go to market quickly,” Dr. Rao says.\nMs. Dwoskin is a Wall Street Journal reporter in San Francisco. Email her at elizabeth.dwoskin@wsj.com .", "external_links": [], "published": "2015-10-13T15:09:00.000+03:00", "crawled": "2015-10-13T14:59:47.400+03:00", "highlightTitle": ""}