{"organizations": [], "uuid": "88fb8b1558e42313aefbb71adcf323396d0f3585", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/4/m/z/c/image.related.afrArticleLead.620x365.gk9ue5.png/1445832263957.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/objective-funds-model-lets-the-numbers-decide-20151015-gk9ue5", "country": "AU", "title": "Objective funds model lets the numbers decide", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Objective funds model lets the numbers decide | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T08:09:00.000+02:00", "replies_count": 0, "uuid": "88fb8b1558e42313aefbb71adcf323396d0f3585"}, "author": "Jeremy Chunn", "url": "http://www.afr.com/personal-finance/objective-funds-model-lets-the-numbers-decide-20151015-gk9ue5", "ord_in_thread": 0, "title": "Objective funds model lets the numbers decide", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An investment selection process developed by two local analysts doesn't make guesses or assumptions or forecasts. Simon Letch by Jeremy Chunn Howitzer-calibre fund managers, photographed thousands of times by The Australian Financial Review, probably can't help it if people start to think of them as magicians after a while. If their subjective expertise really does add value investors will come to believe they're superhuman – and pay for their powers.\nThe truth is, these managers themselves may never know how much of their fortune is good luck.\nAn investment selection process which was utterly objective would make these guys suddenly irrelevant, of course. If it worked.\nTwo local chaps reckon they've cracked it.\nGraham Taylor, an actuarial analyst with Taylor Fry, and Cary Helenius, executive director of investor relations advisory Market Eye, have developed a model which scores and ranks companies on 15 financial data from semi-annual reports.\nLooking over 10 years' of results for 225 companies, they found the share prices for about 61 per cent of companies in the top quartile of their results went on to outperform by 9 percentage points over the following 12 months. About 60 per cent of the bottom quartile underperformed by 7 percentage points.\nAnalysts at investment companies run spreadsheets too, \"but every fund manager will always be putting in their own views over the top of it,\" says Helenius. \"We're not making guesses or assumptions or forecasts.\"\nThe method devised by Taylor and Helenius over the past four years, which they call fundamental financial analytics, is purely objective. Looking at the numbers and nothing else \"seems to be giving us encouraging results\".\n Stock picking The team back-tested a stock-picking variant of the model over the past 11 years' of data and say it beat the benchmark by between 4 and 8 percentage points per annum.\nHelenius, a former research analyst at JBWere, developed the model with Taylor primarily for use at company board level, not for investors. The goal was to find an objective way to look at how the market responds to financial decisions.\n\"When they're making financial decisions in a company there is usually very little support for that decision based on how the equity market actually reacts,\" Helenius says. \"Often it's done on gut feel or judgement. We don't think they are getting a lot of objective support for their financial decisions. This provides them with a real framework for those decisions.\n\"This database can be used by companies to look at financial decisions and see what has happened in the market when [similar] decisions have been made in the past and how have investors responded: positively or negatively.\"\nThe model uses profit and loss, balance sheet and cash flow data, the rate of change for the data and blends of data in a generalised linear model, says Taylor, similar to that applied in motor insurance. \"We don't know what the brokers and analysts do, but [the stock-picking variant] is likely to be novel,\" he says.\nIf it were to stand up as an stock-selection model the next decision would be on timing investment decisions. Do you trade on the day results are out for a company or rebalance the entire portfolio only when all results are in? Helenius says either route might work.\n\"The [share price] impact doesn't all happen on the day of a result,\" he says. \"If the company has good financials that carries on for the next six months.\"", "external_links": [], "published": "2015-10-26T08:09:00.000+02:00", "crawled": "2015-10-26T13:50:29.398+02:00", "highlightTitle": ""}