{"organizations": [], "uuid": "80e6146d7a1bef976b6352a8b37d031b0c0035d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/26/merck-keytruda-lung-idUSL1N12Q16O20151026", "country": "US", "title": "Merck's Keytruda extends survival in lung cancer study", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Merck's Keytruda extends survival in lung cancer study | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T17:58:00.000+02:00", "replies_count": 0, "uuid": "80e6146d7a1bef976b6352a8b37d031b0c0035d4"}, "author": "Ransdell Pierson", "url": "http://www.reuters.com/article/2015/10/26/merck-keytruda-lung-idUSL1N12Q16O20151026", "ord_in_thread": 0, "title": "Merck's Keytruda extends survival in lung cancer study", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 26 Merck & Co's approved Keytruda lung cancer treatment provided superior overall survival to chemotherapy in a late-stage study of patients with advanced disease whose tumors produce a protein called PD-L1 associated with increased risk of the disease.\nThe U.S. drugmaker on Monday said patients taking the approved 2 milligram dosage of Keytruda and those taking an experimental 10 milligram dose had longer overall survival compared with those taking docetaxel, a standard treatment for non small cell lung cancer (NSCLC), the most common form of lung cancer. Keytruda thereby met its main goal of the study.\nPatients whose tumors had especially high levels of PD-L1 also went longer without a progression of disease than those taking docetaxel, Merck said. Those whose tumors expressed PD-L1, but not at high levels, did not show such a statistically significant benefit in progression-free survival.\nSafety of Keytruda was consistent with what had been seen in previous trials among lung cancer patients, Merck said in a release that included only summary \"topline\" information from the results.\nMore detailed data from the study will be provided soon, Merck said, adding that it will ask the U.S. Food and Drug Administration later this year to add the new data to the drug's package insert label.\nU.S. regulators in October approved Keytruda on an accelerated basis for patients with advanced non-small cell lung cancer whose tumors produce PD-L1. The approval was contingent on the company providing more detailed data in the future on Keytruda's safety and effectiveness.\nKeytruda and a similar treatment from Bristol-Myers Squibb Co called Opdivo are antibodies designed to block the interaction between PD-L1 and another protein, PD-1, whose natural function is to put checks on the immune system. By blocking the interaction, the drugs aim to enable the patient's own immune system to recognize and therefore attack the cancer.\nWall Street analysts expect cancer immunotherapies to earn combined annual sales of over $20 billion by 2020. (Reporting by Ransdell Pierson; Editing by James Dalgleish )", "external_links": [], "published": "2015-10-26T17:58:00.000+02:00", "crawled": "2015-10-26T17:06:48.993+02:00", "highlightTitle": ""}