{"organizations": [], "uuid": "310636cb5267e5311cdeb59c99ce158ebaa78c66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-08/04/full/1438677114-7121.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss#", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/insurers-reinsurers-may-not-get-tax-incentives-in-gift-city-115101200716_1.html", "country": "IN", "title": "Insurers, reinsurers may not get tax incentives in GIFT City", "performance_score": 0, "site": "business-standard.com", "participants_count": 1, "title_full": "Insurers, reinsurers may not get tax incentives in GIFT City | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "310636cb5267e5311cdeb59c99ce158ebaa78c66"}, "author": "M Saraswathy", "url": "http://www.business-standard.com/article/finance/insurers-reinsurers-may-not-get-tax-incentives-in-gift-city-115101200716_1.html", "ord_in_thread": 0, "title": "Insurers, reinsurers may not get tax incentives in GIFT City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Gujarat International Finance Tec-City (GIFT) that was to enable India to become a global reinsurance hub may not offer any tax incentives to the insurers, reinsurers setting up presence in the region.\n\nThis area which will be an International Financial Service Centre will allow insurers and reinsurers to offer foreign currency policies from India.\n\nLarge companies like General Insurance Corporation of India have set up presence at GIFT City. Further, there are also some private insurers who have expressed interest to set up offices in that area.\n\n\"We have been told that separate tax incentives will not be provided for setting up offices in GIFT City. This could be a dampener for many Indian insurers and foreign reinsurers to set up presence here,\" said a senior industry official.\n\nGIFT is conceptualised as a global Financial and IT Services hub, a first of its kind in India, designed to be at or above par with globally bench-marked financial centres such as Shinjuku, Tokyo, Lujiazui, Shanghai, La Defense, Paris, London Dockyards among others.\n\nGIFT Master Plan facilitates Multi Services SEZ with IFSC (International Financial Services Centre) status, Domestic Finance Centre and associated Social infrastructure.\n\nInsurance, Assurance and Reinsurance, the areas of business opportunities include life and non-life insurance business, assurance companies, captive insurance and reinsurance and related operations. Insurance Regulatory and Development Authority of India (IRDAI).\n\nAs per IRDAI guidelines, an applicant can set up an IFSC Insurance Office (IIO) in the Special Economic Zone (SEZ) to carry on reinsurance business.\n\nThe regulator said these insurers or reinsurers can accept reinsurance business of all classes of business within the SEZ and from outside the country.\n\nThey can also accept re-insurance business from the insurers operating in the DTA in accordance with the Irdai regulations on reinsurance.\n\nAn applicant being an Indian insurer may (except a statutory body) also establish an IIO to transact specified Direct Insurance Business within the SEZ. However, the same IIO granted Certificate of Registration may also transact specified Direct Insurance Business.\n\nA committee was also appointed for this purpose. The committee noted the limited availability of qualified actuaries, especially those working in general insurance and those with requisite knowledge of reinsurance business.\n\nTo overcome this, it suggested foreign branch operations of reinsurers, operating out of IFSC, be allowed to use the services of their group / regional actuary or actuarial function head as 'certifying actuary' until local talent is developed.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T15:48:23.513+03:00", "highlightTitle": ""}