{"organizations": [], "uuid": "08604aae6a7a5b3075bf7aba3a81a42a84c3fc71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "usfinancepost.com", "main_image": "http://usfinancepost.com/wp-content/uploads/2015/10/apple-imac-5K.jpg", "site_section": "http://usfinancepost.com/feed", "section_title": "Finance Post", "url": "http://usfinancepost.com/apple-unveils-new-4k-and-5k-imacs-also-updates-magic-accessories-25317.html", "country": "US", "title": "Apple unveils new 4K and 5K iMacs, also updates Magic accessories", "performance_score": 0, "site": "usfinancepost.com", "participants_count": 1, "title_full": "Apple unveils new 4K and 5K iMacs, also updates Magic accessories", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T22:29:00.000+03:00", "replies_count": 0, "uuid": "08604aae6a7a5b3075bf7aba3a81a42a84c3fc71"}, "author": "Joel Joseph", "url": "http://usfinancepost.com/apple-unveils-new-4k-and-5k-imacs-also-updates-magic-accessories-25317.html", "ord_in_thread": 0, "title": "Apple unveils new 4K and 5K iMacs, also updates Magic accessories", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Twitter \nApple has just updated its iMac lineup with two new models, featuring 4K and 5K displays. The smaller model featuring a 21.5-inch Display will come with Retina 4K resolution, while the larger one, with a 27-inch Display featuring 5K resolution. Other than the higher resolution displays, the new iMac models come with faster processors and graphics, along with two thunderbolt ports. Sponsored Links \nThe company calls the new iMacs as the most stunning iMacs they have ever made. The statement from the company’s SVP Philip Schiller is given below. \n“From the first iMac to today, the spirit of iMac has never wavered — deliver the ultimate desktop experience with the latest technologies, gorgeous displays and cutting-edge designs,” said Philip Schiller, Apple’s Senior Vice President. “These are the most stunning iMacs we’ve ever made. With our gorgeous new Retina displays, more powerful processors and graphics and all-new Magic accessories, the new iMac continues to redefine the ultimate desktop experience.” \nThe updated 21.5-inch iMac comes with the fifth generation 3.1GHz Core i7 Broadwell processor along with integrated Intel Iris Pro Graphics 6200 chipset. On the other hand, the 27-inch 5K iMac features the sixth generation 3.3GHz Core i5 and i7 Skylake processor options with AMD Radeon R9 GPU. Both the displays have P3 color gamut which reportedly comes with 25 percent color space translating into life like color reproduction. \nApple is also offering new Fusion Drive configuration options. Users can start with 1TB of HDD with 24GB of flash memory. Other higher storage options include 2TB and 3TB of storage options with 128GB SSD. \nAlong with the update to the iMac lineup, Apple has also updated its Magic accessories which include the new Magic Keyboard, Magic Trackpad 2 and the Magic Mouse 2. The new Magic Trackpad 2 comes with Force Touch enabled and a comparatively larger design with up to 29 percent more surface area. The updated Magic mouse 2 has more or less the same design but comes with an improved internal structure with lesser moving parts, which should ensure better life. It also has a built-in lithium ion rechargeable battery. \nAs for the Magic Keyboard, it features Bluetooth for wireless connectivity along with a rechargeable lithium ion battery. The company claims that the battery can be charged within two hours using the lightening to USB cable. The Magic keyboard, Trackpad 2 and Mouse 2 will retail for $99, $129, and $79 respectively. As for the 21.5-inch 4K iMac and the 27-inch 5K iMac, they will start at $1099 and $1499 respectively. TAGS", "external_links": [], "published": "2015-10-13T22:29:00.000+03:00", "crawled": "2015-10-14T21:35:38.912+03:00", "highlightTitle": ""}