{"organizations": [], "uuid": "b34f0697493a7c4a40539fcc2a3bd9c8764b9dc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://www.modernghana.com/logo/final_log.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/647724/1/pyxera-global-signs-mou-with-trace-to-promote-anti.html", "country": "US", "title": "Pyxera Global signs MOU with TRACE to promote anti-bribery in businesses", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Pyxera Global signs MOU with TRACE to promote anti-bribery in businesses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T19:00:00.000+03:00", "replies_count": 0, "uuid": "b34f0697493a7c4a40539fcc2a3bd9c8764b9dc9"}, "author": "", "url": "http://www.modernghana.com/news/647724/1/pyxera-global-signs-mou-with-trace-to-promote-anti.html", "ord_in_thread": 0, "title": "Pyxera Global signs MOU with TRACE to promote anti-bribery in businesses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  7 October 2015 17:00 CET Pyxera Global signs MOU with TRACE to promote anti-bribery in businesses By GNA \nTakoradi, Oct.7, GNA - The Ghana Supply Chain Development Programme being managed by Pyxera Global, has signed a memorandum of understanding with TRACE International, a leading anti-bribery and corruption business association, to ensure that SMEs in the oil and gas field industry were certified as doing clean businesses. \nThe MOU signed between the two partners would also facilitate certification of local SMEs to enable them to be listed on TRACE database as companies that could be contracted by Multinational Companies in the oil and gas sector. \nMr. Kofi Koomson, Technical Team Lead of Pyxera Global, said this at a partnership engagement networking workshop organized by Pyxera Global to bring well established business and multinational companies closer to the doorsteps of SMEs in the region. \nThe partnership engagement would again build synergies and better relationships between operators in the industry. \nMr. Koomson mentioned that per the TRACE, local SMEs contracted by member International Oil Companies were compliant with due diligence processes. \nMs. Majorie Janczak, Head of Training and Communication, noted that about 34 training workshops had so far been organized with over 168 SMES and Bulk Service Providers served. \nMs Janczak said 92 industry specific certificates had been issued, five trainers certified, whilst 80 companies had already been linked to IOCs with 39 contracts amounting to 13 \nShe said building capacities of local operators and linking them to the oil and key industry remained one priority of the Ghana supply chain programme, funded by the United States of America under the USAID. \nThe Training Manager added that 2, 500 participants had undergone training on Health, Safety and Environment, quality, bids, contracts, strategic planning and financial management. \nGNA", "external_links": [], "published": "2015-10-07T19:00:00.000+03:00", "crawled": "2015-10-08T01:52:39.048+03:00", "highlightTitle": ""}