{"organizations": [], "uuid": "599c1be71f515b6bc981edf3201807e5c1c973fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KX363_PGcmo_G_20151023114132.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/p-gs-eyes-big-ad-agency-related-savings-1445616244", "country": "US", "title": "P&G’s Eyes Big Ad Agency-Related Savings - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "P&G’s Eyes Big Ad Agency-Related Savings - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:04:00.000+03:00", "replies_count": 0, "uuid": "599c1be71f515b6bc981edf3201807e5c1c973fa"}, "author": "Nathalie Tadena", "url": "http://www.wsj.com/articles/p-gs-eyes-big-ad-agency-related-savings-1445616244", "ord_in_thread": 0, "title": "P&G’s Eyes Big Ad Agency-Related Savings - WSJ", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Procter & Gamble PG 2.11 % is targeting $200 million in ad agency-related savings this year, as the world’s largest advertiser continues to eye cost-efficiencies to boost bottom-line results.\n“We are strengthening marketing – greater reach, higher frequency, greater effectiveness, at less overall cost,” said P&G Chief Financial Officer Jon Moeller on the company’s earnings call with analysts on Friday.\nIn its last fiscal year, the consumer products giant reduced the number of agencies it works with by nearly 40% and cut agency and production spending by $300 million.\n“These are non-working savings that enable us to invest in working media and sampling dollars,” Mr. Moeller added.\nThe owner of brands such as Tide detergent and Pampers diapers in April signaled plans to pare back on the number of agencies it works with on ads, media buying, public relations, package design and in-store marketing, a move that would result in cost savings of up to $500 million. It soon after launched a review of its media account in North America.\nP&G, considered a bellwether of broader spending trends among big marketers, is in the midst of a major transformation as it seeks to regain sales momentum after years of sluggish growth. P&G is close to divesting 100 brands to focus on 65 core brands and has been making deep cost cuts across the company. In its fiscal first quarter, P&G’s organic sales fell 1% . As top-line growth remains sluggish, P&G’s cutbacks on non-working marketing spending, such as agency fees, has helped the company improve its profitability.\nFor the fiscal year that ended June 30, P&G reported advertising expenses of $8.29 billion for 2015, down from $9 billion in the prior year. P&G said the company expects its working marketing dollars to increase this year on both an absolute basis and on a percentage of sales basis.\n“We’re going to continue to fund increases in spending that matters with reduction in spending that doesn’t,” Mr. Moeller said.\nP&G is one of an unprecedented number of big marketers that have put their media agencies in review this year in an effort to cut back on agency fees and media costs, as well as test their partners’ digital chops. While more than half of the pitches in this year’s wave of reviews have been completed, several of the biggest contests have yet to be decided.\nThe financial pressure big clients are exerting on their agencies was apparent in French ad holding company Publicis’ weaker-than-expected third-quarter results . On Thursday, Publicis cut its full-year sales outlook, pointing to a pullback in ad spending from its U.S. clients. Publicis is particularly vulnerable in this year’s wave of activity compared to its rivals because many of its big clients, among them P&G, have put their accounts up for review.\n“It’s not due to one client or one problem, it’s due to a number of small unfortunate events that happened to us all at once,” Publicis Chief Executive Maurice Lévy said Thursday. Large clients in the automobile, consumer goods and pharmaceuticals sectors, particularly in the U.S., all withheld ad spending in the latest period, Mr. Levy noted.\n“When they are having good numbers they are putting more money, and when they are having bad numbers they are cutting their investment,” Mr. Levy said on Thursday’s earnings call.\nWrite to Nathalie Tadena at nathalie.tadena@wsj.com", "external_links": ["http://www.pginvestor.com/Cache/1001201800.PDF?O=PDF&T=&Y=&D=&FID=1001201800&iid=4004124"], "published": "2015-10-23T20:04:00.000+03:00", "crawled": "2015-10-23T19:16:22.034+03:00", "highlightTitle": ""}