{"organizations": [], "uuid": "57d06ea6870293803fa3fb70dc2a3752d35dbd55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/n/j/a/5/image.related.afrArticleLead.620x365.gk1wyv.png/1444074749049.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/commodities/energy/oil-jumps-with-russia-prepared-to-talk-20151005-gk1wyv", "country": "AU", "title": "Oil jumps with Russia prepared to talk", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Oil jumps with Russia prepared to talk | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:52:00.000+03:00", "replies_count": 0, "uuid": "57d06ea6870293803fa3fb70dc2a3752d35dbd55"}, "author": "afr.com", "url": "http://www.afr.com/markets/commodities/energy/oil-jumps-with-russia-prepared-to-talk-20151005-gk1wyv", "ord_in_thread": 0, "title": "Oil jumps with Russia prepared to talk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices have rebounded. Crude oil prices rose more than 2 per cent on Monday, bolstered by a rally in US gasoline and Russia's willingness to meet other major oil producers to discuss the market.\nHigher stock prices on Wall Street provided further support to oil and other dollar-denominated commodities.\nGlobal crude benchmark Brent rose by $US1.35, or 2.7 per cent, to $US49.48 a barrel after striking a session high at $US49.87.\nUS crude was up 96 cents, or 2 per cent, at $US46.50 after an intraday peak at $US46.94.\nGasoline surged nearly 4 per cent, helping drive up prices for both crude and other refined fuels.\n\"Fuel products are leading the way today though they also seem to be deriving their strength from the broader risk appetite contributed by the equities rally,\" said Peter Donovan, broker at Liquidity Energy in New York.\nRussia, one of the world's top three oil producers, said it was prepared to meet OPEC and non-OPEC oil producers to discuss the market if such a meeting is called. A separate meeting between Russian and Saudi officials was being planned for the end of October, Russian Energy Minister Alexander Novak has said.\nMoscow had been unwilling in the past to cut its oil output to support prices. Last November, it declined to cooperate with the Organization of the Petroleum Exporting Countries to defend market share.\n Russian oil output hit a new post-Soviet monthly high of 10.74 million barrels per day in September, despite a drop in global crude prices to 6-1/2-year lows in August.\nDespite Monday's rally, some analysts braced for renewed pressure on oil prices from US government data this week that could show further builds in crude inventories.\nMarket intelligence firm Genscape reported a modest drop of about 150,000 barrels on the week for inventories at the Cushing, Oklahoma storage hub for U.S. crude, traders who saw the data said.\nThat sparked concern among some that there would be builds instead of draws in Cushing when the US Energy Information Administration reports weekly storage data on Wednesday.\nThe EIA said US oil stockpiles in total rose nearly 4 million barrels the week ending September 25.\n\"We still are bearish on oil given the excess in the market, and the time required to clear all the excess crude and oil products supply,\" Abhishek Deshpande, London-based analyst for French bank Natixis, told the Reuters Global Oil Forum.\nHedge funds trimmed bullish oil bets for the first time in six weeks , losing faith in a swift recovery as Russia boosted output to the highest since the Soviet Union collapsed.", "external_links": [], "published": "2015-10-06T03:52:00.000+03:00", "crawled": "2015-10-06T12:09:19.766+03:00", "highlightTitle": ""}