{"organizations": ["UN Over Deaths Police", "International Trade Union Confederation"], "uuid": "f045503794928f610dd55f41e0534e7df9e1d912", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510121814.html", "country": "US", "title": "Swaziland: Textile Protest - Police Fire Guns", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Swaziland: Textile Protest - Police Fire Guns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:23:00.000+03:00", "replies_count": 0, "uuid": "f045503794928f610dd55f41e0534e7df9e1d912"}, "author": "", "url": "http://allafrica.com/stories/201510121814.html", "ord_in_thread": 0, "title": "Swaziland: Textile Protest - Police Fire Guns", "locations": ["Nhlangano", "Swaziland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Swaziland: King Reported to UN Over Deaths Police in Swaziland fired guns and teargas at workers engaged in a legitimate protest against employment conditions. According to different local newspaper reports between 2,000 and 3,000 workers at the Zheng Yong Garment factory in Nhlangano had a confrontation with the company's security guards. According to the Swazi Observer newspaper one of the workers was 'assaulted heavily by the guards' which led to workers throwing missiles. Management at the textile firm called in the police. According to the Observer, 'It was then that gunshots were heard which saw another stampede as the workers ran in different directions.' According to the Times of Swaziland, 'Witnesses said the violence was sparked by an incident, on Wednesday [7 October 2015] afternoon, where one of the textile firm workers was attacked by the security guards, following a misunderstanding with one of them. 'Apparently, the worker had complained after he discovered that his E10 had gone missing from a table where one of the security officers was keeping guard. 'An argument ensued when the man enquired about the whereabouts of his money from the security guard, leading to an exchange of blows. 'Other security guards stationed at the company are said to have wasted no time and rushed to the scene upon receiving a report. 'However, it is alleged that instead of calming the situation, they added fuel to the fire.' Police are routinely called in during legitimate industrial disputes and there is a long history of weapons being fired at striking workers. Police in Swaziland have also been criticised for having a shoot-first-ask-questions-later policy. In June 2015, Swaziland was named as one of the ten worst countries for working people in the world, in a report from the International Trade Union Confederation (ITUC). Swaziland \nHuman rights lawyer, Femi Falana (SAN), has dragged King Mswati III of Swaziland to United Nations (UN) over killing of … see more » Copyright © 2015 Swazi Media Commentary. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-12T14:23:00.000+03:00", "crawled": "2015-10-12T21:50:41.561+03:00", "highlightTitle": ""}