{"organizations": [], "uuid": "a76c6b5234c09be545417b00312932b0efe22d82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/ford-f-increase-investment-china-160004188.html", "country": "GB", "title": "Ford (F) to Increase Investment in China to Gain Market Share - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Ford (F) to Increase Investment in China to Gain Market Share - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "a76c6b5234c09be545417b00312932b0efe22d82"}, "author": "Zacks Equity Research", "url": "http://finance.yahoo.com/news/ford-f-increase-investment-china-160004188.html", "ord_in_thread": 0, "title": "Ford (F) to Increase Investment in China to Gain Market Share - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Unfazed by the recent weakness in the Chinese market, Ford Motor Co. F is planning to augment its investment in the nation to secure higher market share. Per Reuters, the company will invest nearly 11.4 billion Yuan ($1.8 billion) for research and development in China over the next five years.\nFord has been trying to enhance its sales in the Chinese market by modifying its vehicles to meet consumer preferences. As a result, it has gained significant market share over the last few years. Currently, Ford is the fifth largest foreign automaker in China, per Reuters. The top four positions are held by General Motors Company GM, Volkswagen AG VLKAY, Hyundai Motor Co. and Nissan Motor Co. Ltd. NSANY.\nFord will also expand its portfolio of hybrid, plug-in hybrid and electric vehicles in the nation over the next few years. Next year, it will launch the C-MAX Energi, a plug-in hybrid, and the Mondeo conventional hybrid in China.\nThe importance of the Chinese auto market cannot be denied, given its huge size. Despite the declining vehicle sales in the nation in recent months, China remains the world’s largest auto market. Thus, attaining a wider share in this market may substantially boost an automaker’s sales volume.\nFord and its joint venture, Changan Ford (“CAF”), invested $760 million to open an assembly plant – Changan Ford Hangzhou Plant – in Hangzhou, China in Mar 2015. The facility will augment the annual production capacity of CAF by 250,000 units to 1.4 million vehicles and help the company increase its global sales to 9.4 million vehicles per year by 2020.\nFord invested another $600 million to set up an assembly plant in Chongqing, China in Nov 2014 which increased its passenger vehicle capacity by 360,000 vehicles. In the same month, Ford inaugurated its first three Lincoln stores in China. It aims to open 60 stores and launch 5 new Lincoln vehicles in the nation by 2016.\nFord currently carries a Zacks Rank #3 (Hold).\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report \n \nFORD MOTOR CO (F): Free Stock Analysis Report \n \nNISSAN ADR (NSANY): Free Stock Analysis Report \n \nGENERAL MOTORS (GM): Free Stock Analysis Report \n \nVOLKSWAGEN-ADR (VLKAY): Free Stock Analysis Report \n \nTo read this article on Zacks.com click here. \n \nZacks Investment Research Automotive Industry Autos Ford Motor Co. China Changan Ford", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T03:07:02.276+03:00", "highlightTitle": ""}