{"organizations": [], "uuid": "539a77bbccc052323df3a6207b4beecfdcf433d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/1/2/w/g/e/r/image.related.thumbnail.320x214.gh5i34.png/1444696874791.jpg", "site_section": "http://www.canberratimes.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.canberratimes.com.au/small-business/trends/the-ultimate-revenge-on-customers-20150519-gh5i34.html", "country": "AU", "title": "The ultimate revenge on customers: reverse reviews", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "The ultimate revenge on customers: reverse reviews", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:41:00.000+03:00", "replies_count": 0, "uuid": "539a77bbccc052323df3a6207b4beecfdcf433d3"}, "author": "Kate Jones", "url": "http://www.canberratimes.com.au/small-business/trends/the-ultimate-revenge-on-customers-20150519-gh5i34.html", "ord_in_thread": 0, "title": "The ultimate revenge on customers: reverse reviews", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ed Charles: reverse reviews are a stunt. Photo: Supplied\nFor business owners, it's the ultimate payback. For customers, it's their worst nightmare.\nReviews in reverse give fed-up business owners the chance to turn the tables on their paying customers. In what could be the first of many businesses to take this new spin on customer service, staff at a hotel chain took to writing online reviews of guests.\nThe Art Series Hotel Group offered guests who opted into its Reverse Reviews program a free night's accommodation, but only if they received five stars for their behaviour.\n\"For too long you've been able to review us, now it's our turn. But be warned, if you misbehave . . . everyone will know,\" the hotel group's website reads.\nAdvertisement Marketing director Ryan Tuckerman says the program wasn't introduced to curb the trashing of hotel rooms or the raiding of minibars.\nInstead, he says, it was a fun experiment in customer behaviour.\n\"It's all done in a fun way and we want to interact with the guest,\" he says.\n\"We want to see what happens when guests are being watched.\n\"Will they be friendlier to staff? Will they be neater?\"\nMore than 100 customers opted into the program, which ran earlier this year. Published reviews praise five-star guests for their friendliness, while two-and-a-half star guests are criticised for being impatient at check-out or leaving behind messy rooms.\nIn what experts call a \"review economy\", much of a business' credibility relies on healthy online feedback.\nRating websites such as TripAdvisor​ and Yelp have armed customers with near-anonymous ways to condemn or compliment businesses, particularly those in the hospitality sector. Both sites give businesses a right of reply to customer reviews, but don't go so far as to allow management to post reviews of customers.\nOn one hand, business owners who open up about how they feel about their customers risk driving them away. On the other, they encourage customers to rein in their behaviour and by doing so, create a happier workplace.\nHowever, is honesty always the best policy?\nThe Art Series Hotel Group's Reverse Reviews model has received mixed reactions from customer service and social media experts.\nCustomer service trainer Derek Stockley​ says the program is an innovative way to inspire better behaved guests.\n\"It's a fairly unique approach with a lot of value,\" he says.\n\"Every hotel you stay in will ask you to fill out a survey, but with this system, the hotel guest gets the feedback.\"\nHowever, Ed Charles, a digital consultant at Tomato Media, says the hotel's unorthodox review program is just a gimmick.\n\"They are just promoting the idea of doing it as a cynical marketing move; it's just a publicity stunt, to be honest,\" he says.\nAllowing employees to pen reviews of customers undermines the customer's relationship with the business, Charles says.\n\"When you build a brand, which some call a trust symbol, you build trust with the customer. I think it breaks that bond of trust between the business and the customer,\" he says.\nTwo-way review systems are fairer and more credible for both parties, Charles says.\n\"Airbnb is, in my view, the best; where reviews are only published once both parties have reviewed each other,\" he says.\n\"You can also leave comments on the review.\"\nCustomers may not always be right but taking an online crack at them is rife with risk.\nNew Zealand business Ekim Burgers attracted cries of outrage on social media when owner Mike Duffy posted a long-winded rant on Facebook about his customers.\nDuffy took aim at drunken lawyers, lazy parents and \"no idea housewives\" after a customer sent him a private message on Facebook saying her child had been vomiting after eating at Duffy's cafe.\n\"Almost 20 years in this f---ing industry and never had a person who ate what I cook get sick from it,\" he wrote on the cafe's Facebook page.\nYelp public relations and local business outreach manager Nicholas Lembro says there's a place for the mutual airing of grievances but business owners need to be tactful.\n \"We think businesses should, of course, engage with their customers, especially on platforms where consumers are already active, like Yelp,\" he says.\n\"We do recommend business owners respond to reviews on Yelp and that they do so in a calm and diplomatic manner and thank their customers for their feedback.\"", "external_links": ["http://www.traveller.com.au/art-series-hotels-reviews-guests-research-shows-badly-behaving-hotel-guests-flash-passersby-and-steal-1mbt8x"], "published": "2015-10-13T08:41:00.000+03:00", "crawled": "2015-10-14T05:13:11.967+03:00", "highlightTitle": ""}