{"organizations": [], "uuid": "94d679118653c616f6c5d5a04912857ce4740849", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/taiwan-to-prosecute-woman-who-gave-birth-on-flight/43751.html", "country": "IN", "title": "Taiwan to prosecute woman who gave birth on flight", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Taiwan to prosecute woman who gave birth on flight - Moneylife", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T20:59:00.000+03:00", "replies_count": 0, "uuid": "94d679118653c616f6c5d5a04912857ce4740849"}, "author": "IANS", "url": "http://www.moneylife.in/article/taiwan-to-prosecute-woman-who-gave-birth-on-flight/43751.html", "ord_in_thread": 0, "title": "Taiwan to prosecute woman who gave birth on flight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A woman who gave birth on a China Airlines flight enroute to Los Angeles from Taipei, will be prosecuted in Taiwan to compensate the airlines for the expenses caused due to the childbirth.   Minister of Transport and Communications Chen Jian-yu said the airlines (of which the ministry is the largest shareholder) will claim compensation for extra costs incurred due to the childbirth, EFE reported on Tuesday.   The passenger, under current regulations, had not declared herself to be in her 36th week of pregnancy and the childbirth forced the plane to divert from its route and land in Anchorage, Alaska, so that the mother and baby could receive medical attention in a hospital.   The route diversion cost the airlines more than $33,000, according to the airlines.   Apparently the passenger was travelling to the US so that her baby could be born there and obtain US citizenship that is granted automatically to those born on its soil.   The woman returned to Taiwan following her deportation, while her baby is in the care of a friend in the US.   Disclaimer: Information, facts or opinions expressed in this news article are presented as sourced from IANS and do not reflect views of Moneylife and hence Moneylife is not responsible or liable for the same. As a source and news provider, IANS is responsible for accuracy, completeness, suitability and validity of any information in this article.", "external_links": [], "published": "2015-10-20T20:59:00.000+03:00", "crawled": "2015-10-20T15:53:05.235+03:00", "highlightTitle": ""}