{"organizations": [], "uuid": "34fdc8d32d7f977ebc4435a9f107dd13e79db7dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ezinearticles.com", "main_image": "//ezinearticles.com/members/mem_pics/Angella-Conrard_51406.jpg", "site_section": "http://feeds.ezinearticles.com/category/Finance:Home-Equity-Loans.xml", "section_title": "Finance:Home Equity Loans Articles from EzineArticles.com", "url": "http://EzineArticles.com/?Should-I-Get-a-Reverse-Mortgage-or-a-HELOC-Credit-Line?&id=9186299", "country": "US", "title": "Should I Get a Reverse Mortgage or a HELOC Credit Line?", "performance_score": 0, "site": "ezinearticles.com", "participants_count": 0, "title_full": "Should I Get a Reverse Mortgage or a HELOC Credit Line?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T23:26:00.000+03:00", "replies_count": 0, "uuid": "34fdc8d32d7f977ebc4435a9f107dd13e79db7dc"}, "author": "", "url": "http://EzineArticles.com/?Should-I-Get-a-Reverse-Mortgage-or-a-HELOC-Credit-Line?&id=9186299", "ord_in_thread": 0, "title": "Should I Get a Reverse Mortgage or a HELOC Credit Line?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Angella Conrard"], "text": "Basic PLUS Author | 8 Articles Joined: October 21, 2006 Should I Get a Reverse Mortgage or a HELOC Credit Line? By Angella Conrard | Submitted On October 02, 2015 \nThe number of financial products available to older homeowners is growing. Access to home loans, credit lines, and reverse mortgages appears to be improving. But which is the best option for you? \nRising Expenses & Uncertainty \nMany older homeowners are on fixed incomes. The challenge many face is that expenses such as healthcare costs are not fixed. Healthcare costs certainly are not fixed. \nAt the same time more boomers and seniors are finding their kids aren't financially supporting themselves. Fortune and The Pew Research Center reveal that even though unemployment for young adults has dropped to around 8% in mid-2015, even fewer are now living independently than in 2010 (just 67%). Yet, financial expert Dave Ramsey warns that \"the biggest expense facing baby boomers today is not their children's' college bills, but parent's elder care.\" \nMany retirees are finding they are far less flush than expected too. The stock market hasn't been kind, and is still estimated to be around 60% overvalued. At the same time the Social Security Administration continues to warn that there isn't going to be enough money to pay out what is due. \nThankfully trillions are being regained in home equity. Yet, many Americans are finding they are house rich, and cash poor again. Liquidity and cash is key to surviving and enjoying the next few years. \nSo what are the best ways to tap into underutilized home equity? \nConventional Mortgages, Second Mortgages & Credit Lines \nThe Mortgage Bankers Association and Mortgage Credit Availability Index shows that access to home mortgage credit has been rising since February 2012. Inman News credits this largely to the expansion of mortgage programs. \nConventional mortgages, second mortgages, and home equity lines of credit (HELOCs) are all options. Yet, the traditional versions of these loan programs come with a number of challenges and disadvantages for older homeowners. \nMost notably this includes: \n1. Difficulty in qualifying for home mortgage loans \n2. The need to consistently generate income to pay mortgage payments \n3. High interest rates on 2nd mortgages \n4. Potential for lenders to cap or close credit lines during housing downturns \n5. Leaving large debts, and monthly financial obligations for heirs \nHow Do HECM Reverse Mortgages Work? \nA HECM is the FHA reverse mortgage program . This is a federally guaranteed and sponsored Home Equity Conversion Mortgage. It allows homeowners aged 62 and older to convert illiquid home equity to liquid, usable cash and credit. \nThe real beauty of this financial tool is that is pays the homeowner, versus the reverse. \nThe payouts on reverse mortgages are flexible and can be customized to your personal needs. \nYour funds can be taken as a lump sum, monthly payments over a specific amount of time, monthly payments over your lifetime, drawn from a credit line or a combination of these options \nThe most flexible option is the credit line. \nHighlights of a Reverse Mortgage Credit Line include: \n1. A built in growth feature which consistently adds access to more funds over time. \na. A reverse mortgage credit line grows at a compounding rate (interest rate +1.25%) \nb. Any payments made to your principle balance will also cause your line of credit to rise by the same amount. The increase of your credit line will grow at the compounding rate, giving you more money for use in the future. \n2. A reverse mortgage credit line is 'open credit', you can borrow from it, or put money back into it without penalty. \n3. Once established, your credit line works independently from your home value and your loan balance. \n4. Cannot be taken be taken away during market downturns (as long as you meet your contractual obligations such as paying your property taxes and homeowner's insurance.) \n5. Can be set up in early retirement years and be reserved for future increased liquidity, while maintaining just a minimum of a $100 balance. \n6. Can be used to avoid taking out money from investment accounts during market downturns or used in lieu of taking Social Security income until your benefits are maximized. \nYour reverse mortgage credit line cash can be used for any purpose from paying off credit card bills, to making home repairs, to helping kids and parents, gifts for the grandkids, investing, and covering medical bills. Or just keep it as a reserve fund. It's your money - you choose. \nFind Out More... \nHaving more liquidity is a pressing issue for millions of Americans today. Traditional mortgages and HELOCs can sometimes be more of a nuisance and threat than benefit for aging homeowners. In contrast; a reverse mortgage credit line can help property owners stay ahead of their financial needs without increasing their burden. It's your money. Make sure you are making the most of it! \nCheck out the Reverse Mortgage Calculator to see what you are entitled to today. \nClaim your free reverse mortgage information package at Reverse-Your-Mortgage.com, where you can find out more about your options and even live chat with Angella Conrard, CRMP, a reverse mortgage expert... or call 866-949-7030", "external_links": [], "published": "2015-10-02T23:26:00.000+03:00", "crawled": "2015-10-03T08:46:45.464+03:00", "highlightTitle": ""}