{"organizations": [], "uuid": "0115b518ea612da424ca8e7a8d8ff7cbfef4af42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/us-stocks-decline-healthcare-stocks-171043245.html", "country": "GB", "title": "US STOCKS-Decline in healthcare stocks checks gains by GM, tech - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "US STOCKS-Decline in healthcare stocks checks gains by GM, tech - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "0115b518ea612da424ca8e7a8d8ff7cbfef4af42"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/us-stocks-decline-healthcare-stocks-171043245.html", "ord_in_thread": 0, "title": "US STOCKS-Decline in healthcare stocks checks gains by GM, tech - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Valeant sinks after Citron report, drags Allergan, Endo\n* GM, Boeing rise after strong results\n* Twitter falls after Morgan Stanley downgrade\n* Ferrari up on debut\n* Dow up 0.37 pct, S&P down 0.08 pct, Nasdaq down 0.39 pct (Updates to early afternoon)\nBy Abhiram Nandakumar\nOct 21 (Reuters) - Wall Street was little changed in early afternoon trading on Wednesday as gains by General Motors and technology stocks were limited by a slide in healthcare stocks.\nValeant Pharmaceutical's U.S.-listed shares lost a fourth of their value and fell to $106.00 after short-seller Citron Research released a critical report on the company.\nAllergan fell 4.6 percent to $251.37 and Endo International slumped nearly 13 percent to $54.98, weighing the most on the S&P 500 and the Nasdaq composite indexes. Both companies have business models similar to that of Valeant.\nThe S&P 500's healthcare sector fell 1.3 percent, leading the four decliners among the 10 major S&P sectors.\nHealth insurers Aetna, Humana, Anthem and Cigna fell between 4 and 6 percent after Democratic presidential candidate Hillary Clinton said she had \"serious concerns\" about the mergers the companies were proposing.\nAt 13:05 p.m. ET (1705 GMT), the Dow Jones industrial average was up 63.04 points, or 0.37 percent, at 17,280.15, the S&P 500 was down 1.61 points, or 0.08 percent, at 2,029.16 and the Nasdaq composite index was down 19.13 points, or 0.39 percent, at 4,861.84.\n\"During the course of the third quarter, we actually saw consensus estimates drop for both revenue and earnings,\" said Eric Weigand, senior portfolio manager at the Private Client Reserve at U.S. Bank.\n\"You could make the point that there is a low hurdle for companies to exceed on these diminished expectations.\"\nShares of General Motors rose 6.5 percent to $35.64, while Boeing rose 1.7 percent to $141.31, after both industry heavyweights reported better-than-expected results.\nOf the S&P 500 companies that have reported results so far, 42 percent have exceeded revenue estimates. About 60 percent typically beat estimates in a quarter, according to Thomson Reuters data.\nS&P 500 companies are expected to report a 3.5 percent decline in third-quarter profit and a 3.8 percent fall in revenue.\nAmerican Express and eBay report after the close.\nKLA Tencor soared 22.5 percent to $66.00 after the semiconductor equipment maker agreed to be bought by Lam Research in a $10.6 billion deal. Lam rose 5.7 percent to $74.04.\nSandisk rose 2.8 percent to $77.26 after it agreed to be bought by Western Digital in a $19 billion deal.\nFerrari was up 8.5 percent at $56.42 in its debut on the New York Stock Exchange.\nTwitter fell 6.1 percent to $29.02 after Morgan Stanley downgraded the stock to underweight, citing increased competition and limited scope for user growth.\nVMware sank 20 percent to $55.02 after the virtualization software maker forecast current-quarter revenue below estimates.\nYahoo was down 3.7 percent at $31.61 after the Internet company's quarterly earnings and profit missed expectations.\nDeclining issues outnumbered advancing ones on the NYSE by 1,722 to 1,260. On the Nasdaq, 1,726 issues fell and 970 advanced.\nThe S&P 500 index showed 25 new 52-week highs and four new lows, while the Nasdaq recorded 48 new highs and 67 new lows.\n(Reporting by Abhiram Nandakumar in Bengaluru; Editing by Don Sebastian)\nStocks & Offerings Morgan Stanley Nasdaq GM Twitter", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T21:00:39.695+03:00", "highlightTitle": ""}