{"organizations": [], "uuid": "9d09abb180536ab9f580eb3e7cded1bcf52cb8e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "econews.com.au", "main_image": "", "site_section": "http://econews.com.au/category/finance-news/feed", "section_title": "Eco News » Finance", "url": "http://econews.com.au/48280/unep-how-to-align-global-finance-with-sustainable-development/", "country": "AU", "title": "UNEP: how to align global finance with sustainable development", "performance_score": 0, "site": "econews.com.au", "participants_count": 1, "title_full": "UNEP: how to align global finance with sustainable development", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:04:00.000+03:00", "replies_count": 0, "uuid": "9d09abb180536ab9f580eb3e7cded1bcf52cb8e7"}, "author": "David Twomey", "url": "http://econews.com.au/48280/unep-how-to-align-global-finance-with-sustainable-development/", "ord_in_thread": 0, "title": "UNEP: how to align global finance with sustainable development", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nA new United Nations Environment Program (UNEP) report released at the International Monetary Fund (IMF)/World Bank annual meetings shows how to harness the assets of the world’s financial system for sustainable development. \nThe core findings of a two-year Inquiry by the United Nations Environment Program, are summarised in the new report, The Financial System We Need . \nKey findings of the UNEP reports are that:– A ‘quiet revolution’ is underway as financial policymakers and regulators take steps to integrate sustainable development considerations into financial systems to make them fit for the 21 st century.– Momentum is building and is largely driven by developing and emerging nations including Bangladesh, Brazil, China, Kenya, and Peru, with developed country champions including France and the UK.– Amplifying these experiences through national and international action could channel private capital to finance the transition to an inclusive, green economy and support the realization of the Sustainable Development Goals. \nCommenting on the release Achim Steiner, UN Under-Secretary-General and Executive Director of UNEP said: “UNEP’s inquiry has for the first time compiled and analysed inspiring initiatives from across the world that seek to better align the financial system with sustainable development, showing that there is much to be learnt from the developing world. \n“We now need to raise the level of ambition and cooperation to ensure that the heartland of the global economy, the financial system, can evolve to serve its core purpose of growing and sustaining the real economy. \n“UNEP’s report opens a new chapter by setting out how such an evolution can be achieved,” he added. \nAlso speaking at the launch, Yi Gang, Deputy Governor of the People’s Bank of China, said the UNEP report “delivers a vision of embedding sustainable development into the core of financial and capital markets. \n“It should be a very useful guide and reference for many governments, financial institutions and international organisations in thinking about how to advance green finance.” \nMr Yi praised UNEP’s contribution to the joint study with China’s central bank on the country’s green financial system, and said that “we have benefited significantly from UNEP’s vision of sustainable finance as well as its analysis on international experience,” and “are looking forward to continuing this partnership with UNEP in the future.” \nDr Atiur Rahman, Governor of the Bangladesh Bank, and a member of the Inquiry`s Advisory Council , speaking at the launch, said: “For the first time, the Inquiry has mapped the many innovations around the world seeking to ensure that the financial systems serves its purpose of financing inclusive, green development”. \nJohn Lipsky, former first Deputy Managing Director of the IMF and a member of the Inquiry`s Advisory Council , added: “Reforming the financial system remains unfinished business, we have stabilised the system, but have a long way to go in designing a financial system that meets the needs of sustainable development. ” \nHenri de Castries, Chief Executive of AXA, one of over 40 partners of the Inquiry, said “I welcome the Inquiry, as only a financial system with a sustainability orientation serves the economy and society, and so provides a sound foundation for fostering the long-term orientation of finance.” \nRachel Kyte, Vice President and Special Climate Envoy, World Bank Group, said: “The UNEP Inquiry has uncovered a new generation of policy innovations that aim to ensure the financial system serves the needs of inclusive, environmentally-sustainable, economic development. \n“Its findings are an important input in advancing a new generation of financial system reform and support the delivery of our most important sustainability goals, and could play an important role for implementing the results of the forthcoming Paris climate talks.” \nThe UNEP Inquiry into the Design of a Sustainable Financial System was established in January 2014 with a mandate to advance policy options that would improve the effectiveness of the financial system in supporting sustainable development. \nSupported by a high-level Advisory Council of financial leaders, the Inquiry has looked in-depth at practice in more than 15 countries as well as across key segments of the financial system, such as banking, bond and equity markets, institutional investment, insurance as well as monetary policy. \nTo reach its findings, the Inquiry has worked with central banks, environment ministries, international financial institutions as well as major banks, stock exchanges, pension funds and insurance companies. \nThe Inquiry has identified five types of measures that are being introduced by financial rule-makers:– Enhancing market practice through better disclosure, clearer responsibilities and improved product criteria.– Harnessing the public balance sheet, through fiscal incentives, public financial institutions and central bank action– Directing finance through policy measures, such as priority sector lending, legal requirements and liability regimes– Transforming financial culture, through capacity building, reformed incentives and market structure– Upgrading system governance, through guiding principles, regulatory mandates and performance measurement. \nIn total, the Inquiry found over 100 measures that are already in place, including:– China, a portfolio of 14 distinct recommendations to advance China`s green financial system, covering information, legal, institutional and fiscal measures– France, new disclosure requirements on climate change have been introduced for institutional investors as part of the country’s energy transition legislation– Kenya, has advanced financial inclusion through scaling of mobile based payment services, which is now also supporting green financing– Peru, new due diligence requirements have been introduced for banks to help reduce social and environmental externalities.– USA, emphasises fiscal measures to accelerate green finance, and had made significant advances in disclosure and investor action. \nThe Inquiry`s report presents a Framework for Action that includes a toolbox of nearly 40 different measures, a set of five policy packages across banking, bond and equity markets, institutional investors and insurance, and a prioritised set of 10 next steps to promote international financial cooperation. \nAlong with The Financial System We Need , the Inquiry will also be launching the ‘Inquiry Live’ website which will house a dedicated platform the body of knowledge and research materials encompassing the Inquiry’s work over the past 20 months. \nThe website will provide a one stop shop to all of the Inquiry’s research materials, as well as a dedicated portal for partner countries to enable communication and sharing of knowledge. \nThe country portal will initially be dedicated to the 15 countries where there has been enhanced country engagement. \nThe report is available at: www.unep.org/inquiry as well as www.unepinquiry.org", "external_links": [], "published": "2015-10-09T00:04:00.000+03:00", "crawled": "2015-10-09T10:43:04.340+03:00", "highlightTitle": ""}