{"organizations": [], "uuid": "860e5cf82c0878bd356964a8c24c27a853492e4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6KK91LkcmqR_93rBNpnK2Q--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/rtr4aam7-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Top stories from Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/tata-steel-job-cuts-latest-053418801.html", "country": "GB", "title": "Tata Steel Job Cuts Latest To Hit Industry", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Tata Steel Job Cuts Latest To Hit Industry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T08:43:00.000+03:00", "replies_count": 0, "uuid": "860e5cf82c0878bd356964a8c24c27a853492e4a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/tata-steel-job-cuts-latest-053418801.html", "ord_in_thread": 0, "title": "Tata Steel Job Cuts Latest To Hit Industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Oct 20, 2015, 07:21 BST - UK Markets open in 39 mins. Tata Steel Job Cuts Latest To Hit Industry By (c) Sky News 2015 | Sky News – 37 minutes ago View Photo \n\nTata Steel (BSE: TATASTEEL.BO - news ) is expected to announce 1,200 job losses later - in a move which could effectively bring steelmaking in Scotland to an end. \nAbout 400 of the affected roles are thought to be at its plants in Dalzell and Clydebridge, with the remaining 800 in Scunthorpe. \nFirst Minister Nicola Sturgeon has already pledged to establish a taskforce once Tata's plans are confirmed, in an attempt to secure a viable future for Scotland's traditional steel industry. \nIt (Other OTC: ITGL - news ) is the second blow to the sector this week following yesterday's news that Caparo Industries was to enter partial administration, with 1,700 jobs at risk. \nThe UK-based company, owned by Labour peer Lord Paul, has plants nationwide - but most are situated in the West Midlands. \nAccording to the TUC, one in six British steelworkers now face the prospect of losing their jobs overall, with approximately 5,200 workers in the UK threatened with redundancy. \nDavid Cameron has promised to raise the issue of the \"dumping\" of cheap steel onto the market with Chinese President Xi Jinping during his four-day state visit to the UK – however, unions say this gesture is not enough to safeguard the industry. \nRoy Rickhuss, general secretary of the Community steelworkers' union, said: \"The Prime Minister needs to do more than 'raise' the issue. \n\"He needs to tell the Chinese premier what action he's going to take to stop Chinese steel damaging the future of a vital foundation industry in the UK.\" \nDue to overcapacity in the Chinese market, the price of steel has fallen by 40% in the past year - from about £318 a tonne to £191 a tonne. The drop has meant many UK firms are no longer able to compete. \nEarlier this week China bailed out one of its own state-owned commodity miners, Sinosteel, which is facing a cash crisis and is struggling to repay its debts. \nAny prospect of buyers being found for Caparo's subsidiaries by administrators at PwC is bleak, given the failure to find a buyer for SSI UK's steelworks in Redcar. \nThe Government held a summit last week to address the future of the ailing UK steel industry.", "external_links": [], "published": "2015-10-20T08:43:00.000+03:00", "crawled": "2015-10-20T09:26:57.846+03:00", "highlightTitle": ""}