{"organizations": [], "uuid": "417a98d9d8ccbe54f224ae6ec51856d85f146ed3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/z/g/b/f/image.related.afrArticleLead.620x365.gju6uw.png/1444956182468.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/personal-finance/six-hedge-fund-strategies-for-retail-investors-20150924-gju6uw", "country": "AU", "title": "6 hedge fund strategies for retail investors", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "6 hedge fund strategies for retail investors | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T21:15:00.000+03:00", "replies_count": 0, "uuid": "417a98d9d8ccbe54f224ae6ec51856d85f146ed3"}, "author": "Kate Cowling", "url": "http://www.afr.com/personal-finance/six-hedge-fund-strategies-for-retail-investors-20150924-gju6uw", "ord_in_thread": 0, "title": "6 hedge fund strategies for retail investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Retail investors should know more about hedge funds as fund managers increasingly begin to allocate more to alternative strategies. Karl Hilzinger by Kate Cowling Retail investors are wary of hedge funds. The combination of high fees, impenetrable jargon and a period of underperformance during the GFC left many underwhelmed by the sector.\nBut as investment experts increasingly begin to allocate more to alternative strategies, you should arm yourself with the knowledge about what they do, even if it doesn't fit your overall risk profile.\nRemember that no two hedge fund strategies are alike. Just because they use the same label doesn't mean the funds are easily comparable.\nWhen doing your research, ask how the fund is expected to perform if the market goes up or down 10 per cent. Find out about maximum drawdowns, performance fees and high watermarks. Make considerable effort in trying to understand how the positions are entered and exited because, at the end of the day, it's your money and there are no guarantees.\nAnd the golden rule? If you don't understand it, walk away.\nLong/short: This involves buying or taking a \"long\" position in a series of stocks while selling or \"going short\" in others. Going short involves selling a stock you don't own in the expectation you will buy it back cheaper. The money received from the short sale is often reinvested in long positions creating a ratio of long positions to short positions of 130/30. This is traditionally deployed in paired strategies where a long position is taken in one stock while shorting another in a similar industry. The goal is to take advantage of the superior company's fundamentals without having too much exposure to the market. Market neutral : This strategy seeks to lower market risk to near zero, often through a combination of long/short positions. This may involve taking an equal number of both positions. They are typically benchmarked against the cash rate or the 10-year bond rate and will generate performance fees for the managers when they produce returns that outperform these measures. In principle, it's a great way to control for market volatility, but true market neutrality is very difficult to achieve. Event driven: Managers look to future events that may change the price of a company, such as mergers, acquisitions or bankruptcies, and invest on that basis. Takeover bids are often rejected or revised. Some companies will attract a counter bid from third or even fourth parties. Event-driven managers look for opportunities where a reasonable premium is yet to be factored into the price. Macro: The macro strategy involves buying and selling assets that are susceptible to global events at the time. For instance, stocks that will rise or fall as the dollar moves, or on China's next sell-off, or when the Federal Reserve lifts interest rates. Many of the biggest are unrestricted as to what assets or markets in which they can operate. Arbitrage: Arbitrage-related strategies involve exploiting future price changes or corrections through high-volume trades. For instance, you may buy a stock in one market and quickly resell it in another to cash in on the difference, but with hundreds of securities at a time. There are many varieties, including statistical arbitrage, merger arbitrage, conversion arbitrage and relative value arbitrage. Quantitative: \"Quant\" funds use rules-based strategies to buy or sell stocks. They aim to remove any element of human judgment from the process of trading. One of the best-known is the Medallion Fund run by former NSA code-breaker Jim Simons. It charged an entrance fee of 5 per cent and outperformance of 44 per cent. It reportedly delivered 34 per cent outperformance a year and was closed to new investors in 2009. ", "external_links": [], "published": "2015-10-15T21:15:00.000+03:00", "crawled": "2015-10-16T06:09:33.344+03:00", "highlightTitle": ""}