{"organizations": [], "uuid": "ca309c3923d3ae3a7956f4a1d772fc6f13f72cce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/bankers-insurers-to-have-long-weekend-from-october-21/43675.html", "country": "IN", "title": "Bankers, insurers to have long weekend from October 21", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Bankers, insurers to have long weekend from October 21", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T09:47:00.000+03:00", "replies_count": 0, "uuid": "ca309c3923d3ae3a7956f4a1d772fc6f13f72cce"}, "author": "IANS", "url": "http://www.moneylife.in/article/bankers-insurers-to-have-long-weekend-from-october-21/43675.html", "ord_in_thread": 0, "title": "Bankers, insurers to have long weekend from October 21", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Bankers, insurers to have long weekend from October 21 43675 Bankers, insurers to have long weekend from October 21 0 Comments, Be the first to comment + COMMENT IANS | 13/10/2015 12:17 PM | Bankers and insurers in Tamil Nadu in particular and across the nation in general will have a long weekend starting October 21 while a top bank union leader said that public would not be inconvenienced much given the alternate delivery channels for banking service. Between October 21 and 25, branches of government owned banks and insurance companies would remain closed due to festivals and weekly closures. Bank union leaders agree that it is going to be a long weekend but also cite it is not a new phenomenon in the country. \"The holidays are known at the beginning of the year itself. The bank managements could have proactively discussed with the unions to sort out the issue,\" a senior leader in a bank officer's association told IANS. Second and fourth Saturdays of a month are holidays for government-owned banks. The officer said the unions would have even agreed to shift the holiday falling on Saturday (October 24) to some other Saturday. \"If such an idea is implemented than leave on October 24 should not be denied to those employees for that day as they might have planned travel or other things in advance,\" he added. All India Bank Employees' Association (AIBEA) general secretary C.H. Venkatachalam however told IANS that it is only in Tamil Nadu that the holidays are consecutive. \"In many other states and union territories it is not the case. It is also not the first time when banks are closed for consecutive days due to festivals,\" he said. Union leaders say that in West Bengal every year, four consecutive days are holidays for banks due to festivals. \"Banking is only a public utility and not an essential service in India. Today there are alternate delivery channels for availing banking service. Private sector corporates would also have holidays enabling their employees to celebrate the festivals,\" he added. Bank union leaders say the management should plan well so that the automatic teller machines (ATM) are loaded with sufficient cash for people. Almost all the banks have privatised cash loading in ATMs and so they have to plan stocking of cash carefully. \"In banks, there is no concept of compensatory leave - for working on a holiday - whereas in private sector it is there,\" the official added. Disclaimer: Information, facts or opinions expressed in this news article are presented as sourced from IANS and do not reflect views of Moneylife and hence Moneylife is not responsible or liable for the same. As a source and news provider, IANS is responsible for accuracy, completeness, suitability and validity of any information in this article. More in Moneylife", "external_links": [], "published": "2015-10-13T09:47:00.000+03:00", "crawled": "2015-10-13T11:16:54.643+03:00", "highlightTitle": ""}