{"organizations": [], "uuid": "27fd0a2a89f72841f0f161c19ec793b74276cfc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-09/credit-suisse-said-to-weigh-stock-sale-of-up-to-8-3-billion", "country": "US", "title": "Credit Suisse Said to Weigh Stock Sale of Up to $8.3 Billion", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Credit Suisse Said to Weigh Stock Sale of Up to $8.3 Billion - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:17:00.000+03:00", "replies_count": 0, "uuid": "27fd0a2a89f72841f0f161c19ec793b74276cfc3"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-09/credit-suisse-said-to-weigh-stock-sale-of-up-to-8-3-billion", "ord_in_thread": 0, "title": "Credit Suisse Said to Weigh Stock Sale of Up to $8.3 Billion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Credit Suisse Group AG Chief Executive Officer Tidjane Thiam is considering selling stock in an offering that may raise 6 billion francs ($6.2 billion) to 8 billion francs, people with knowledge of the discussions said.\nThe bank plans to proceed with the sale after presenting a new strategy to investors later this month, said one person, who asked not to be identified because the matter is private. The company hasn’t made a final decision on the amount, the people said.\nThiam, 53, who took over from Brady Dougan in July, will present a strategy update on Oct. 21. He is under pressure to raise capital as Swiss regulators are looking to toughen requirements designed to shield the system from future financial crises. Thiam has said he plans to allocate more resources to wealth management and strengthen the bank’s position in Asia, while scaling back the investment bank, mirroring an approach of UBS Group AG.\nInvestors surveyed by Goldman Sachs Group Inc. on average estimated the bank will raise about 5.4 billion francs, according to a note from Oct. 1. Tougher capital requirements, litigation costs and the future direction of the company will all help determine the extent of any capital increase, UBS analysts Daniele Brupbacher and Mate Nemes said in a note on Friday.\nCredit Suisse rose 2.2 percent to 24.10 francs at 5:16 p.m. in Zurich. The shares dropped 3.6 percent on Thursday after the Financial Times reported that the lender is preparing a “substantial” share sale.\n“We are conducting a thorough assessment of Credit Suisse’s strategy, evaluating all options for the group, its businesses and its capital usage and requirements,” the bank said in a statement late Thursday. Tobias Plangg, a Zurich-based spokesman for Credit Suisse, declined to comment beyond the statement.", "external_links": [], "published": "2015-10-09T23:17:00.000+03:00", "crawled": "2015-10-09T18:42:14.281+03:00", "highlightTitle": ""}