{"organizations": [], "uuid": "bb979dc458b673e08b3065518034e30158acd2de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510050038.html", "country": "US", "title": "Angola: Telecommunication Firms to Have New Broad Band Services", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Angola: Telecommunication Firms to Have New Broad Band Services", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:51:00.000+03:00", "replies_count": 0, "uuid": "bb979dc458b673e08b3065518034e30158acd2de"}, "author": "", "url": "http://allafrica.com/stories/201510050038.html", "ord_in_thread": 0, "title": "Angola: Telecommunication Firms to Have New Broad Band Services", "locations": ["Angola", "Tanzania"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tanzania: E-Technology Software to Keep Cattle Records \nLuanda — Telecommunication and Information Technologies minister José Carvalho da Rocha last Wednesday, in Luanda, announced that the three big telephone companies (Unitel, Movicel and Angola-Telecom) will soon have licences to operate fully in all the areas of the country?s telecommunications sector, for the benefit of the population. \nThe government official - who said so to the press in the end of the joint session of the Economic Commission and Real Economy Commission, both of the Cabinet Council, which was chaired by President José Eduardo dos Santos - explained that the said companies will gain full intervention in the areas of fix telephone lines, mobile phones and subscription television services. \nHe went on to say that these operators will need to have access to broad band telecommunications services, through the benefits of the digital system. \n\"What will happen soon is that we'll stop having television and radio broadcasting in the analogical system and begin the digital one\", clarified the minister. \nJosé Carvalho da Rocha further explained that this type of service will bring greater speed and better access to the internet system, which is something the public need. \nThe mentioned meeting also passed the memorandum on the new legal framework for the licensing of telecommunications firms, among a few other juridical instruments. Angola \nThe acting National Police commander, chief commissioner Paulo de Almeida, Friday in southwestern Namibe province, urged … see more » Copyright © 2015 Angola Press Agency. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-05T08:51:00.000+03:00", "crawled": "2015-10-05T09:13:31.472+03:00", "highlightTitle": ""}