{"organizations": [], "uuid": "0165bf46ef34d21533d8ffafab1b1750dc963075", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/d/b/s/9/image.related.afrArticleLead.620x365.gkd9eu.png/1445378531492.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/lifestyle/health/mens-health/major-breast-cancer-organisation-warms-to-giving-men-a-spot-on-its-pink-ribbon-20151019-gkd9eu", "country": "AU", "title": "Major breast cancer organisation warms to giving men a spot on its pink ribbon", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Major breast cancer organisation warms to giving men a spot on its pink ribbon | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T09:16:00.000+03:00", "replies_count": 0, "uuid": "0165bf46ef34d21533d8ffafab1b1750dc963075"}, "author": "Jill Margo", "url": "http://www.afr.com/lifestyle/health/mens-health/major-breast-cancer-organisation-warms-to-giving-men-a-spot-on-its-pink-ribbon-20151019-gkd9eu", "ord_in_thread": 0, "title": "Major breast cancer organisation warms to giving men a spot on its pink ribbon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The National Breast Cancer Foundation thinks the idea of a blue dot has merit but says changing logos can be costly. Supplied Share on twitter Share on Google Plus by Jill Margo One of the major breast cancer organisations in Australia has warmed to the idea of adding a dot of blue to the pink ribbon that universally symbolises breast cancer in women.\nQueensland breast cancer sufferer Rod Ritchie has advocated for the dot which would represent the small number of men who get this cancer too.\nWhile the pink-washing of breast cancer has successfully raised awareness among women, some men feel it blots out the fact that they also get the disease. Low awareness means they don't recognise their symptoms, are diagnosed later and are more likely to die of their cancer.\nThe National Breast Cancer Foundation, which uses the pink ribbon logo, thinks the concept has merit and will consider it at its next strategy meeting in February.\nThe foundation is the leading community-funded organisation in Australia raising money exclusively for research into this disease and over the past 21 years ago has raised more than $115 million.\n\"It is a good idea and we are quite warm about it. We are very conscious that men are affected by breast cancer in a number of ways, as patients and partners,\" acting CEO Jackie Coles says.\n\"But changing logos can be costly. On social media it is relatively straightforward but in rebranding it can get pricey. We need to balance changing logos with best use of our funds.\"\n\"It is something I am personally very inclined towards and it may be something we feed in slowly as and when we get material rebranded, so make change in a cost-effective manner.\"\n While pink ribbons in general are not exclusive to the foundation, it has trademarked its ribbon.\nOne dot for 1 per cent A single dot would represent the 1 per cent of all breast cancers that occur in men. This year 145 Australian men are expected to be diagnosed with it and 25 are expected to die of it, according to Cancer Australia.\nBreast Cancer Network Australia, the peak national organisation for those affected by the cancer, has the silhouette of a pink lady as its logo.\nIt is not looking to add any blue to her at this stage.\nThe network has more than 100,000 members and 300 member groups. Its CEO Christine Nolan says it is a change in the logo would be a significant undertaking with financial costs, and would require consultation with members and the board.\n\"But further to that, we're not sure that putting a blue dot on a pink skirt would meet the needs of most men affected by breast cancer.\"\nHowever, it was looking for ways to modify its digital environment to provide separate pathways for men affected by breast cancer, with different content, imagery and branding.\nThe McGrath Foundation, which aims to ensure that every family in Australia experiencing breast cancer has access to a breast care nurse, has no plans to add a bit of blue.\nIts logo of two black cricket stumps embracing a pink one, was chosen by its late founder, Jane McGrath. The foundation provides support to both men and women.", "external_links": ["https://plus.google.com/https://plus.google.com/110990585086401178539/posts", "https://twitter.com/https://twitter.com/jillmargo1"], "published": "2015-10-20T09:16:00.000+03:00", "crawled": "2015-10-21T05:10:20.869+03:00", "highlightTitle": ""}