{"organizations": [], "uuid": "e9ba88f87ce6357d2f285d9030109483681216fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=RENT", "section_title": "Yahoo! Finance: RENT News", "url": "http://finance.yahoo.com/news/sponsorhubs-acquisition-rentrak-corporation-creates-131524395.html", "country": "GB", "title": "Sponsorhub's Acquisition By Rentrak Corporation Creates Synergy, Says CEO - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Sponsorhub's Acquisition By Rentrak Corporation Creates Synergy, Says CEO - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "e9ba88f87ce6357d2f285d9030109483681216fa"}, "author": "Jim Probasco", "url": "http://finance.yahoo.com/news/sponsorhubs-acquisition-rentrak-corporation-creates-131524395.html", "ord_in_thread": 0, "title": "Sponsorhub's Acquisition By Rentrak Corporation Creates Synergy, Says CEO - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View photo\n. The acquisition of Sponsorhub by Rentrak Corporation (NASDAQ: RENT ) creates synergy between the two companies. Sponsorhub provides advertisers and sponsors with unique insight into sports and entertainment related chatter on social media. One of Sponsorhub’s specialties is tracking fan emotion during sporting and other events. \nThe recently announced acquisition of sports and entertainment industry big data platform Sponsorhub by Rentrak Corporation creates a synergy between the two companies, according to Sponsorhub founder and CEO Bob Johnston.\nBenzinga spoke with Johnston about what this merger means moving forward.\nRelated Link: Bob Peck: comScore-Rentrak Merger Has 'Strategic Merit,' Notes Combined Company 'Creates Stronger Competitor' \nBenzinga: Could you start by explaining what Sponsorhub is and what it does? \nBob Johnston: Sponsorhub is an analytics platform for the enterprise space. We work with advertisers to measure their largest engagements around sports entertainment.\nWithin sports, we help large advertisers track and measure endorsements of athletes, sponsorships of leagues, teams – and on the entertainment side, product placements within TV and film.\nTherein lies the synergy with Rentrak since it is the pre-eminent measurement platform for the film industry. However, it doesn’t have an automated social media measurement platform. Rentrak brought us in to be its social listening layer across all the other measurements it is already doing.\nBZ: What sorts of events and entities does Sponsorhub track on behalf of advertisers? \nBJ: I can give you a couple of examples. We've checked over the years things like the World Cup, the Olympics, as you know, the U.S. Open. We've tracked the Americas Cup. We did a special project over there for those guys.\nWe have a number of advertisers that are sponsors of the NFL, for example. They spend millions of dollars on different teams in specific markets and they want to make sure they're getting the right pay back on their investments.\nWe work with advertisers to track engagement across major league sports down to the team level as well as the level of individual players.\nIf you have a specific athlete and you're McDonald's or Reebok, you may want to see how that athlete is trending with a specific market such as St. Louis or Cincinnati.\nBZ: So, Sponsorhub’s tracking can be quite specific? \nBJ: We can go right down to the granular level, minute per minute within a game or a TV show. We can track all social listening activity around that. That’s our secret sauce.\nSports and entertainment are the two sectors we have targeted most, but they're not exclusive. We've done a number of other engagements, but the go-to market play for us has been those two.\nBZ: Clearly, there’s a need. How have analytics been done before Sponsorhub? \nBJ: If you look at the sports industry alone, it's $250 billion worldwide. It's a massive amount of dollars spent. Yet, the tracking and analytics is mostly done with spreadsheets.\nIt's very old school, there's not a lot of technology. There are various other \"listening platforms\" out there, but they're not retrofitted specifically to the sports entertainment genre.\nWe've created a platform specifically for that and it's purely a social listening platform.\nBZ: What do you think is driving the synergy between social media and sports events or other large events? \nBJ: That’s a great question. What’s really driving it is fan engagement. Fans are passionate about a sports team or specific athlete, much more than a product, maybe with the exception of Apple products.\nWe looked at that and realized if we could help a brand track the level of emotion a fan (consumer) has for a specific athlete or team in the context of the brand that's a partner of that team, then it becomes really interesting and useful.\nWe spend a lot of time tracking and measuring the emotions of fans. We can look at happiness, anger, surprise and delight. We have all these emotions within our dashboard and we can roll them up to a brand and say, “We are going to tell you how the fans at tonight’s Red Sox/Yankees game were trending as it relates to your brand.”\nBZ: How will this acquisition add value to Rentrak, and similarly, what does it mean for Sponsorhub? \nBJ: We're exploring what new products we can bring to market for this sort of sports and entertainment genre based on what Rentrak already has.\nWe each have existing stuff that's worked well, and has been running across many brands. Now, I think we want to figure out when you push these two things together what can we create that's very novel and different from what's already out there?\nRelated Link: Benzinga's Top Downgrades \nBZ: Is there any part of that that has to do with targeting consumers more efficiently? \nBJ: That's the other side of the coin. We don't just want to help you optimize your spending. Within the context of an engagement, let's say you're involved with the Olympics, which is multi week. You should be able to look at the data we're providing and that Rentrak is providing, and within a day's notice change your marketing if it is trending the wrong way.\nIn fact, we did that for a client for the Olympics a while back. In Sochi, some TV ads trended the wrong way based on (feedback on) Google, Facebook, Twitter and so forth. We optimized their creative on the fly, which is super cool.\nAt the time of this writing, Jim Probasco had no position in any mentioned securities. \nImage Credit: Public Domain \nSee more from Benzinga \nRealtyShares Has Returned More Than Million To Investors Trillium's Inside Look At Surveyor Visier CEO Started A BI Solutions Revolution © 2015 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. \nPersonal Investing Ideas & Strategies Rentrak Bob Johnston", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T09:49:35.712+03:00", "highlightTitle": ""}