{"organizations": [], "uuid": "c1088aba200d66243f72f2af85baa62c0d0c6bd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/fe-columnist/bit-by-bit-the-recommerce-market/153761", "country": "IE", "title": "Bit by bit: The recommerce market", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Bit by bit: The recommerce market | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T08:19:00.000+03:00", "replies_count": 0, "uuid": "c1088aba200d66243f72f2af85baa62c0d0c6bd6"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/bit-by-bit-the-recommerce-market/153761", "ord_in_thread": 0, "title": "Bit by bit: The recommerce market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Editorial: Losing the pulse Editorial: Fixing MNC tax issues Professional hazard The iPhone 6s and 6s Plus have hit store shelves in India, which is, according to some estimates, the most expensive market for these devices. Of late, the high-end smartphone category here has started moving much ahead of the rest of the segment. In other words, the more expensive products have a better chance at survival than something closer to the mid-range. But does that mean the budget-conscious can’t ever think of owning an Apple phone or a high-end Samsung? Well, no. And this is where the refurbishment, or the recommerce, industry is becoming increasingly relevant here.\nThe recommerce market in India is seeing new players every other month, with customers getting the option of buying refurbished models at very affordable prices as well as disposing of their old devices for good prices. For instance, an Apple iPhone 5c 16GB is available for Rs 19,990 on Greendust.com, almost 30% cheaper than the Rs 32,000 pricing on Flipkart . The price advantage is not always this huge, but you will get some good deals with the right research. And the offers are not limited to smartphones, as most of these websites deal in everything from laptops to televisions. According to a recent report by the Associated Chambers of Commerce and Industry of India, the recycled products market in India is expected to cross Rs 1.15 lakh crore ($18.4 billion) by the end of this year.\nHitendra Chaturvedi, the founder and CEO of Greendust, says they source products directly from the company or distributors of the company in India, and these are refurbished in-house. He adds only genuine spare parts are used to refurbish and all the devices come with after-sales service, warranty and extended warranty. Rahul Chowdhury, the CEO and co-founder of Reboot Systems India, says they have focused primarily on the B2B space for procurement of disposable e-goods, apart from the dealer network cultivated in the 10 largest cities. At the moment, only about 10% of the procurements from the company come from end-consumers.\nReGlobe, meanwhile, works with professional buyers of second-hand devices across the country who pay it a commission for every transaction that happens through the platform. Nakul Kumar, the co-founder and COO, says they work with localised professional buyers of second-hand devices who do the pickup from customer’s homes and pay cash. Here the refurbishment is done by the buyers and hence ReGlobe does not sell any products online. They, however, drive the exchange/buy-back programmes of e-commerce sites such as Snapdeal , Amazon , eBay and Infibeam, as well as manufacturers like Apple.\nWhile Indians do not have an issue picking up an old device from a local shop, they will think twice before doing the same from an online seller. This is why Greendust’s Chaturvedi says the biggest challenge in the sector is trust. So, Greendust-certified refurbished products come with a one-year warranty that can be extended by opting for the GreenDust Protection Plan. The company claims it has over 600 service centres across India and after-sales services is provided by certified technicians and 90 mobile service vans through the week.\nData with the sites suggest Apple and Samsung still command the aspirational market that drives their sales. Also, Bangalore seems to be way ahead of other Indian cities when it comes to selling and buying old devices. “The response has been phenomenal. We currently refurbish about 6,600 products per month and all of them get sold as soon as they are available. That’s why we are increasing our capacity to about 10,000 products a month by December this year and take it up to 20,000 by March 2016—tripling capacity in the next six months,” says Chowdhury of Reboot. He says among PCs, Dell, HP and Lenovo are popular and says people opt for refurbished PCs because they don’t want to buy assembled ones. In the mobility category, they only sell Apple products as “people love to own an Apple.”\nHowever, it is wrong to assume that the sales of refurbished products are limited to expensive brands. Chaturvedi says customers look for value and that is why the Xiaomi Redmi 1S was a super-hit at Rs 4,999 on his site. Chowdhury adds a refurbished iPhone 5s for Rs 24,600 will be cosmetically and functionally as good as a new iPhone and will come in a brand-new box with a replaceable warranty. This is why he is struggling to source more Apple products to keep up with the demand.\nWith the growing popularity among end-consumers and the possibilities thrown up by e-commerce, companies such as ReGlobe are thinking big and want to cover more of the country. For those of them that can win the trust of the Indian market, there seem to be some good times ahead.\nnandagopal.rajan@expressindia.com\n 20, 2015 12:19 am", "external_links": [], "published": "2015-10-20T08:19:00.000+03:00", "crawled": "2015-10-20T00:37:36.515+03:00", "highlightTitle": ""}