{"organizations": ["Tinubu Methodist Church Lagos"], "uuid": "b918a7ef89be9f4a21f7d8c305b1a77347994bb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510260064.html", "country": "US", "title": "Nigeria: Auto-Crash - Obasanjo Hale and Hearty - Aide", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Auto-Crash - Obasanjo Hale and Hearty - Aide", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T07:39:00.000+02:00", "replies_count": 0, "uuid": "b918a7ef89be9f4a21f7d8c305b1a77347994bb5"}, "author": "", "url": "http://allafrica.com/stories/201510260064.html", "ord_in_thread": 0, "title": "Nigeria: Auto-Crash - Obasanjo Hale and Hearty - Aide", "locations": ["Abidjan", "Nigeria", "Ivory Coast"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sagamu", "Obasanjo Hale", "Vitalis Ortese", "Olusegun Obasanjo", "Kessington Adebutu", "Stella Obasanjo", "Obasanjo", "H.E."], "text": "Cote d'Ivoire: Peace-CI Opens Cote d'Ivoire's Largest Election Situation Room Barely 24 hours after surviving an auto crash on the Lagos-Ibadan Expressway, former President Olusegun Obasanjo, has jetted out of Nigeria to observe the presidential elections in Ivory Coast. Obasanjo was said to have been involved in auto crash on the Lagos-Ibadan Expressway, on his way back from the memorial programme in honour of his late wife, Stella Obasanjo. A statement by his media aide, Vitalis Ortese, said the elder statesman was on his way to the 80th birthday church service of lottery company billionaire, Kessington Adebutu, on Saturday, October 24, 2015, when the accident occurred. Undeterred by the occurrence, the retired general had arrived his home and boarded a plane to Abidjan in Ivory Coast, where he is expected to participate in the observation of the presidential elections. The statement read: \"The Office of His Excellency, former President Olusegun Obasanjo GCFR wishes to clarify that, H.E. President Olusegun Obasanjo GCFR is hale, hearty and away in Abidjan Cote Ivoire, where he is observing the Presidential Elections holding in that country. \"The office also wishes to confirm, that yesterday Saturday, October 24, 2015, H.E. former President Olusegun Obasanjo was indeed involved in an incident on the Ibadan-Lagos Expressway, after Sagamu roundabout, while he was on his way to join in the celebrations of the 80th birthday anniversary of Chief Kessington Adebutu in Tinubu Methodist Church Lagos. \"The vehicle, he was traveling in suffered a burst left tire at the rear and swerved several times but did not hit any curb or any car in front or behind until it did an 180-degree turn and faced where it was coming from, and he had to change vehicles. \"Former President Olusegun Obasanjo wishes to convey his deep appreciation to all those, who by way of calls, personal messages and prayers, and indeed members of the general public, who have shown overwhelming concern about his welfare.\" Nigeria \nThe International Crisis Group, a global, Brussels-based NGO dedicated to preventing and resolving conflict, selected … see more » Copyright © 2015 Vanguard. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,600 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-26T07:39:00.000+02:00", "crawled": "2015-10-26T08:21:57.659+02:00", "highlightTitle": ""}