{"organizations": [], "uuid": "6ef2f1b93cc9804515b0d214113cceee9abb5b45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.send2press.com", "main_image": "https://www.send2press.com/mediaboom/15-0224-mid-america-500x375.jpg", "site_section": "http://send2pressnewswire.com/news/finance-newswire/feed", "section_title": "Send2Press for Journalists » Finance", "url": "https://www.send2press.com/newswire/mid-america-mortgage-expands-national-footprint-opens-branches-in-kansas-city-mo-overland-park-kan-2015-1015-06.shtml", "country": "US", "title": "Mid America Mortgage Expands National Footprint, Opens Branches in Kansas City, Mo., Overland Park, Kan.", "performance_score": 0, "site": "send2press.com", "participants_count": 1, "title_full": "Mid America Mortgage Expands National Footprint, Opens Branches in Kansas City, Mo., Overland Park, Kan.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T20:46:00.000+03:00", "replies_count": 0, "uuid": "6ef2f1b93cc9804515b0d214113cceee9abb5b45"}, "author": "Send2Press Newswire", "url": "https://www.send2press.com/newswire/mid-america-mortgage-expands-national-footprint-opens-branches-in-kansas-city-mo-overland-park-kan-2015-1015-06.shtml", "ord_in_thread": 0, "title": "Mid America Mortgage Expands National Footprint, Opens Branches in Kansas City, Mo., Overland Park, Kan.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Banking and Finance » Mid America Mortgage Expands National Footprint, Opens Branches in Kansas City, Mo., Overland Park, Kan. PRESS RELEASE Mid America Mortgage Expands National Footprint, Opens Branches in Kansas City, Mo., Overland Park, Kan. Thu, 15 Oct 2015, 17:46:47 EDT \nADDISON, Texas, Oct. 15,   Mid America Mortgage, Inc. (Mid America) Owner and Chief Executive Officer Jeff Bode announced the firm has expanded its operations into Missouri, Iowa and Kansas with its newest branch locations in Kansas City, Mo. and Overland Park, Kan. \"Mid America Mortgage is committed to helping consumers throughout the nation to achieve their homeownership goals,\" Bode said. \"With our Kansas City branch, we have further extended our reach into the Midwest and look forward to providing borrowers in this area with a wide range of home financing products and a superior level of service.\" Mid America Mortgage recently announced its intent to begin originating eMortgages , which was one of many initiatives that attracted technology-driven Midwest Sales Manager Jeffrey Layne to move his mortgage business and join the company. \"I have to consider where to service my personal clients first. As a loan originator, I love Mid America's wide range of product offerings and its extremely competitive interest rates. In addition, when the loan is closed, there's a high probability my customer will ultimately make his or her mortgage payment to my company. That is part of creating lifelong relationships,\" Layne explained. In addition, Layne said the responsibility he feels to support his team's growth in building strong, referral-based partnerships also lead him to move his business to Mid America. \"Mid America's marketing department is hands down the best in the business,\" he added. \"The programs we have available for our originators are making it easy to choose the right folks to do business with.\" \"Mid America Mortgage has been a trusted name in the industry since the 1940s, and we are so very pleased to bring our cornerstone brand to the Kansas and Missouri markets,\" said National Production Manager Donna Wright. \"It's a great time to grow with the right people. Jeff Layne is a great example of who we are looking to grow with, and we're encouraged to find others of the same mindset who appreciate what we offer mortgage professionals.\" Due to state licensing rules in Missouri, the company will do business as Mid America Lending in that state. For more information on Mid America's latest branch or to contact a Mid America mortgage professional in the Kansas City area, visit http://www.midamericamortgage.com/kansas-city/ . About Mid America: Additional information about Mid America Mortgage, Inc. can be found on the company's website at http://www.midamericamortgage.com/about/ . Career Opportunities:", "external_links": [], "published": "2015-10-15T20:46:00.000+03:00", "crawled": "2015-10-16T01:14:38.097+03:00", "highlightTitle": ""}