{"organizations": [], "uuid": "66824cbd94e0f0b90af8f9782c7ddc7cbfec3bbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/h/7/7/u/8/image.related.articleLeadwide.620x349.gkf83r.png/1445455873374.jpg", "site_section": "http://www.smh.com.au/business/banking-and-finance/credit-card-surcharges-targeted-by-turnbull-government-20151019-", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/markets/copper-nears-twoweek-low-on-oversupply-worries-20151021-gkf83r.html", "country": "AU", "title": "Copper nears two-week low on oversupply worries", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Copper nears two-week low on oversupply worries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "66824cbd94e0f0b90af8f9782c7ddc7cbfec3bbf"}, "author": "The Sydney Morning Herald", "url": "http://www.smh.com.au/business/markets/copper-nears-twoweek-low-on-oversupply-worries-20151021-gkf83r.html", "ord_in_thread": 0, "title": "Copper nears two-week low on oversupply worries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "While inventories in LME-approved warehouses have fallen from their August peak, LME copper stocks are still up 60 per cent this year. Photo: Bloomberg\nCopper fell to near two-week lows on Wednesday, under pressure from fund selling as worries about oversupply and slowing demand growth in China weighed on sentiment.\nBenchmark copper on the London Metal Exchange closed 0.5 per cent down at $US5175 a tonne in official trading, after dipping to its lowest level since October 8 earlier in the day. Copper futures December delivery dropped 0.2 per cent to $US2.3605 a pound on the Comex in New York.\nPrices eased on concerns about ample supplies after data a day earlier showed the global copper market shifted into an 8,000 tonne surplus in July from a 16,000 tonne deficit in June.\n\"Any evidence of surplus is feeding the story,\" said Asa Bridle, mining analyst at Cantor Fitzgerald. \"There is still great uncertainty about where we're going.\"\nFor the first seven months of the year, the global copper market had a surplus of 8000 tonnes compared with a deficit of 563,000 tonnes in the same period a year earlier, figures from the International Copper Study Group (ICSG) showed on Tuesday.\nThe data fuelled the negative mood in the market, already soured by worries about slowing demand growth in China, which accounts for about half of global copper consumption.\nTraders said fund selling picked up, as investors reversed course on earlier short-covering anchored in hopes for further fiscal stimulus in China.\n\"Over the last few days, the funds have been selling again,\" one trader said. \"If there were any people who were still rather hopeful that the market might get above some of the longer-term averages, they have just lost heart.\"\nVolumes remained subdued as some hoped copper would fall further. In the fourth quarter, prices are expected to slip below six-year lows of $US5000 touched in August, according to Standard Chartered forecasts.\n\"The environment remains one of demand pessimism,\" said Nicholas Snowdon, metals analyst at Standard Chartered. \"Until we have a macro data point that surprises otherwise, prices are going to continue to grind lower.\"\nInventories in LME-approved warehouses fell to 284,050 tonnes, down more than 23 per cent from a peak in late August. But LME copper stocks are still up 60 per cent this year.\nPrices found some modest support in nearly 10,000 tonnes in new LME cancellations , which signal holders are ready to remove their stored metal from warehouses.\nLead closed 2.4 per cent down at $US1738.50, while tin was 0.3 per cent lower at $US15,925. Nickel eased 1.2 per cent to $US10,280.\nAluminium closed 1.9 per cent lower at $US1515, touching its lowest level in more than eight weeks.\nZinc dipped 2.2 per cent, closing at $US1730. The metal has recently shed much of the gains made earlier this month when Glencore said it would cut its production by 500,000 tonnes.", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T14:23:42.533+03:00", "highlightTitle": ""}