{"organizations": [], "uuid": "2940208e0c01076ced8d8e20926437129269e6b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03068/oxford_alamy_3068787k.jpg", "site_section": "http://www.telegraph.co.uk/newsfeed/rss/money_city.xml", "section_title": "Finance - Business news and market updates - Telegraph", "url": "http://www.telegraph.co.uk/finance/newsbysector/transport/11953953/Chiltern-Railways-launches-rival-London-to-Oxford-service.html", "country": "CH", "title": "Chiltern Railways launches rival London to Oxford service", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Chiltern Railways launches rival London to Oxford service", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:01:00.000+02:00", "replies_count": 0, "uuid": "2940208e0c01076ced8d8e20926437129269e6b5"}, "author": "Ben Martin", "url": "http://www.telegraph.co.uk/finance/newsbysector/transport/11953953/Chiltern-Railways-launches-rival-London-to-Oxford-service.html", "ord_in_thread": 0, "title": "Chiltern Railways launches rival London to Oxford service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Transport Chiltern Railways launches rival London to Oxford service It is the first new rail link between the capital and a British city in more than a century Chiltern Railways is offering a London to Oxford service that rivals Great Western Comments \nA £320m train route has opened today between London and Oxford , the first new rail link between the capital and a British city to open in more than a century. \nChiltern Railways, which is part of Deutsche Bahn-owned Arriva, has started running two services an hour between London Marlylebone, a revamped station at Bicester Village, and a new station called Oxford Parkway. \nIt offers a rival to FirstGroup’s Great Western, which operates the route between the London Paddington and Oxford via Reading. \nIt is thought to be the first new rail link into London from another British city since 1899, when the Grand Central main line connecting London Marylebone to Sheffield was opened. The idea is that it will eventually become part of the proposed East West Rail link between Oxford and Cambridge. \nDavid Cameron, the prime minister, who is the MP for the Oxfordshire constituency of Witney, said it was “an historic moment” for the county. \n“From today there will be more trains, faster journey times and better transport links for people living and working here,” he said. \nChiltern has spent £130m on the line and Network Rail has financed the balance. Rob Brighouse, the managing director of Chiltern, said the train operator was tapping into “latent demand in north Oxfordshire”. \nOxford is “the only rail connected city where more people choose to get the bus than the train into London”, he added. Existing services between London and Oxford “are very crowded”, Mr Brighouse said. \nThe Chiltern route also services Bicester, the outlet mall that is visited by 6.3m shoppers a year and has become a popular destination for Chinese tourists to Britain . \nMeanwhile, the new Oxford station is on the outskirts of the city, rather than in the centre, which means travellers can avoid congestion. \n“By putting the station on the very edge of oxford, we saw we could knock 30 to 45 minutes off the door to door journey time,” Mr Brighouse said.", "external_links": [], "published": "2015-10-26T02:01:00.000+02:00", "crawled": "2015-10-26T02:30:37.039+02:00", "highlightTitle": ""}