{"organizations": [], "uuid": "da5f3e492e9ec78649e5225dd366b111dc8ec0b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=SQNM", "section_title": "Yahoo! Finance: SQNM News", "url": "http://finance.yahoo.com/news/pharmaceutical-sector-due-diligence-report-121200244.html", "country": "US", "title": "Pharmaceutical Sector Due Diligence Report – Opportunities Await", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Pharmaceutical Sector Due Diligence Report – Opportunities Await - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "da5f3e492e9ec78649e5225dd366b111dc8ec0b5"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/pharmaceutical-sector-due-diligence-report-121200244.html", "ord_in_thread": 0, "title": "Pharmaceutical Sector Due Diligence Report – Opportunities Await", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, NY / ACCESSWIRE / October 7, 2015 / Geron Corporation ( GERN ), Idera Pharmaceuticals Inc. ( IDRA ), Sequenom Inc. ( SQNM ) and Mast Therapeutics Inc. ( MSTX ) are four tickers in the pharmaceutical space with upcoming catalysts that could prove to be profitable for investors. The sector faced recent pressure caused by price gouging and reactions from politicians against 'big pharma' monopolies. However, the pharmaceutical sector is comprised of independently moving stocks that move based on news and clinical data releases. This therefore has presented investors with investment opportunities due to the unwarranted decline in the overall sector. Many stocks have already bounced back, others are awaiting their turn.\nFor a more detailed research report with analyst comments and recommendation on the Pharmaceutical Sector please follow the link. There is no cost obligation required to view analyst brief.\nhttp://bit.ly/-Pharma_Sector_Report \nAbout Broad Street Alerts \nWe make the connection between sophisticated investors and high quality micro and small cap companies. An issuer of reports that provide a straightforward assessment of the profiled company. They include stocks traded in the NYSE, NASDAQ, and OTCBB exchanges.\nSafe Harbor Statement \nThis press release may include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements related to anticipated revenues, expenses, earnings, operating cash flows, the outlook for markets and the demand for products. Forward-looking statements are no guarantees of future performance and are inherently subject to uncertainties and other factors which could cause actual results to differ materially from the forward-looking statements. Such statements are based upon, among other things, assumptions made by, and information currently available to, management, including management's own knowledge and assessment of the Company's industry and competition. The Company refers interested persons to its most recent Annual Report on Form 10-K and its other SEC filings for a description of additional uncertainties and factors, which may affect forward-looking statements. The company assumes no duty to update its forward-looking statements.\nCompliance Procedure \nContent is researched, written and reviewed on a best-effort basis by a 3rd party analyst. However, we are only human and may make mistakes. If you notice any errors or omissions, please notify us. This report was prepared for informational purposes only. A full disclaimer can be found by viewing the full analyst report. We do not hold any positions and have not been compensated in any form for this press release and coinciding reports. For more information and services provided beyond this press release please use contact information provided below.\nContact: editor@broadstreetalerts.com \nSOURCE: Broad Street Alerts\nGeron Corporation", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T05:52:23.955+03:00", "highlightTitle": ""}