{"organizations": [], "uuid": "d06f94be90e9bbf75a02f61f513fea1560cef504", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/pHjmImpNRzBFajNCWQO0qw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/d50a70a33af5efb5d85f6d073d2481733693c904_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/tunisia-eu-launch-talks-free-184959746.html", "country": "GB", "title": "Tunisia, EU launch talks on free trade agreement", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Tunisia, EU launch talks on free trade agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T21:49:00.000+03:00", "replies_count": 0, "uuid": "d06f94be90e9bbf75a02f61f513fea1560cef504"}, "author": "", "url": "https://uk.finance.yahoo.com/news/tunisia-eu-launch-talks-free-184959746.html", "ord_in_thread": 0, "title": "Tunisia, EU launch talks on free trade agreement", "locations": ["EU", "Tunisia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Oct 13, 2015, 21:04 BST - UK Markets closed Tunisia, EU launch talks on free trade agreement AFP – 1 hour 14 minutes ago View Photo \n\nTunisia and the European Union launched negotiations Tuesday for a free trade agreement, a deal some Tunisian experts fear could undermine their economy despite assurances to the contrary from Brussels. \nThe European Commission says the Deep and Comprehensive Free Trade Agreement (DCFTA) would help support economic reforms in the North African country, which is trying to consolidate democracy after a 2011 uprising that ousted an autocratic regime. \n\"The aim of the agreement is to improve market access opportunities and the investment climate and support ongoing economic reforms in Tunisia,\" it said on its website. \nEU Trade Commissioner Cecilia Malmstrom announced the launch of the negotiations during a visit to Tunis and talks with Tunisian Trade Minister Ridha Lahouel and Prime Minister Habib Essid. \n\"This agreement... will be beneficial for Tunisia and introduce economic opportunities,\" she told reporters. \n\"We are conscious that there are some concerns... and that is why we must work with the government and have a constant dialogue with businesses and civil society,\" she said. \nLahouel said discussions could last years before a deal is clinched, adding that Tunis will reject anything that undermines its interests. \nThe European Commission said the first round of talks will begin in Tunis Monday and last for a week. \n\"The agreement will build on the existing free trade area under the Euro-Mediterranean Association Agreement, which was signed 20 years ago but mainly focused on trade in goods,\" it added. \nThe EU is Tunisia's largest trading partner, accounting for 57 percent of total commerce. \nThe agreement would open the European market wider to Tunisian goods, but Tunisian economists fear it could have a backlash on their country's struggling economy, arguing that it could force an opening of Tunisian markets and risk unfair European competition. \n\"Tunisia risks loosing 40 percent of its firms if the DCFTA is implemented,\" economist Abdelbasset Sammari was quoted as saying by local media. \nAnother economist, Jameleddine Aouididi said in a recently published study that the EU had its eyes on natural resources found in Tunisia, such as phosphate and gas. \nAccording to EU figures, total trade between Tunisia and the European Union in 2014 reached around 20 billion euros ($22.8 billion). Trade was dominated by machinery and transport equipment but also included textiles, clothing, fuels and mining products (Other OTC: UBGXF - news ) .", "external_links": [], "published": "2015-10-13T21:49:00.000+03:00", "crawled": "2015-10-13T23:06:58.034+03:00", "highlightTitle": ""}