{"organizations": [], "uuid": "4413f1bff9f8abe2b956d53bc61bdb717e5b3429", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/x/v/6/s/image.related.afrArticleLead.620x365.gjzomy.png/1443747473824.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/opinion/who-put-bank-of-england-boss-mark-carney-in-charge-of-the-climate-20151002-gjzomy", "country": "AU", "title": "Who put Bank of England boss Mark Carney in charge of the climate?", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Who put Bank of England boss Mark Carney in charge of the climate? | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:56:00.000+03:00", "replies_count": 0, "uuid": "4413f1bff9f8abe2b956d53bc61bdb717e5b3429"}, "author": "Jeremy Warner", "url": "http://www.afr.com/opinion/who-put-bank-of-england-boss-mark-carney-in-charge-of-the-climate-20151002-gjzomy", "ord_in_thread": 0, "title": "Who put Bank of England boss Mark Carney in charge of the climate?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bank of England governor Mark Carney on climate change. What's next: a BoE treatise on Syria? Bloomberg by Jeremy Warner Like virtually everyone else, central banks failed to see the financial crisis coming. For ordinary mortals, it was excusable; they were entitled to think the authorities had matters under control. For central banks, guardians of the world's monetary system and supposed keepers of the deep knowledge on banking crises, it was not.\nTheir reward for this failure was…er… to be endowed with even more powers and responsibilities than they had before. The fault, it was widely agreed, was not that they had too much power, and had failed to exercise it properly, but too little.\nAlong with setting interest rates and ensuring financial stability, both the Bank of England and the European Central Bank (ECB) have since been given responsibility for micro regulating the banking sector.\nBoth have also wandered into the fiscal sphere by engaging in large scale quantitative easing, while Mario Draghi, president of the ECB, is even credited with having saved the euro through his words and actions.\nMark Carney looks whistfully out the window and contemplates stranded fossil fuel assets. Nic Walker Where governments have proved unequal to the task, central banks have stepped into the breach and done what the politicians couldn't. As if to rub it in, Mr Draghi has taken to regularly lecturing governments on the need for painful fiscal and structural reform . Small wonder these monetary technocrats are today considered more important and influential than the politicians they are notionally answerable to.\nYou'd have thought that managing the economy would be quite enough to be going on with, but no, if elevated to the position of demi-god on the global stage, then some degree of over-reach is only to be expected. By this week wading into the climate change debate , Mark Carney, Governor of the Bank of England, has signalled that there is almost no area of public discourse that can be considered off limits. What next? The war in Syria? Come to think of it, why not put the Bank of England in charge of everything?\nI exaggerate, obviously, and to be fair, the Bank plainly does have some kind of a legitimate interest in global warming. Many financial institutions are highly exposed both to its consequences for insurance claims and the potential impact for savers if the fossil fuels industry is forced by policy action into costly retreat. Royal Dutch Shell alone accounts for nearly a tenth of all dividends paid in the UK. If these payments are under threat, then there are huge implications for pension funds and other forms of saving. Mr Carney is perfectly entitled to point these things out, even if it scarcely seems necessary; most insurers are acutely aware of the risks, and are already well ahead of governments in preparing for them.\nThere was, however, also something faintly reckless and naive about the Governor's intervention. It is no exaggeration to say that the whole of modernity is based on hydrocarbons. Without coal, oil and gas, we'd still be in an age of limited life expectancy, subsistence farming and riding to market on horse and cart. However much we might wish it, this dependence is not going to change for a long time to come.\n Thirty years of extraordinarily costly research and development has resulted in a renewables industry that today accounts for a stunning – wait for it – 1 per cent of global energy supply. Never mind Asia, where they are still rolling out new coal-fired power stations at record speed, even holier-than-thou Germany, with its \"Energiewende\", opened another two this week while simultaneously sanctioning an open cast mine to help fuel them.\nMr Carney made much in his speech of the idea – hatched by the UN sponsored Intergovernmental Panel on Climate Change – that up to a third of the world's proven oil, gas and coal reserves would have to be left in the ground, or \"stranded\", if the rise in global temperatures is to be limited to the prescribed 2 degrees.\nWhat is he doing lending credence to such a tenuous concept? Even if the numerous assumptions – all questionable enough – behind the calculation turned out to be true, it is wholly unrealistic to think that once the limit has been reached, the world is suddenly going to stop burning hydrocarbons. Consider the facts. The world produces oil at the rate of roughly 93 million barrels a day. Just to meet this demand, the oil industry needs to be constantly investing in and developing its reserves. If it were to stop, production would naturally deplete at a very rapid rate, and in an age of still exponential demand growth, the price of hydrocarbons would go through the roof. That really would give Mr Carney a financial crisis to worry about.\nThe \"stranded asset\" debate is a complete red herring. What policy makers should be focusing on is not how to cap hydro-carbon production, but how to incentivise its decarbonisation through use of clean technologies. Mr Carney's intervention was no doubt well meaning, but he should stick to the day job.\nJeremy Warner is a columnist with the Daily Telegraph", "external_links": ["http://www.telegraph.co.uk/news/general-election-2015/politics-blog/11728025/The-blacklash-against-green-energy-is-bad-for-Britain.html", "http://www.telegraph.co.uk/finance/newsbysector/banksandfinance/insurance/11899845/Bank-of-England-governor-Mark-Carney-calls-on-insurers-to-help-prepare-for-climate-change.html", "http://www.telegraph.co.uk/finance/economics/11623416/Mario-Draghi-Structural-reforms-will-unlock-Europes-growth-potential.html", "http://www.telegraph.co.uk/news/worldnews/middleeast/syria/11903976/Putin-has-embarrassed-us-all-in-Syria.-Welcome-to-the-age-of-Russian-power.html", "http://www.telegraph.co.uk/finance/financialcrisis/"], "published": "2015-10-02T08:56:00.000+03:00", "crawled": "2015-10-02T04:12:28.609+03:00", "highlightTitle": ""}