{"organizations": [], "uuid": "171b7bd27e8ccfcfd91e5ce648f76256e9845d98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/warrenelizabeth_121914getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/255726-dem-economists-attack-warren-over-brookings-firing", "country": "US", "title": "Dem economists attack Elizabeth Warren over Brookings firing", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Dem economists attack Elizabeth Warren over Brookings firing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:03:00.000+03:00", "replies_count": 0, "uuid": "171b7bd27e8ccfcfd91e5ce648f76256e9845d98"}, "author": "esmilowitz@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/255726-dem-economists-attack-warren-over-brookings-firing", "ord_in_thread": 0, "title": "Dem economists attack Elizabeth Warren over Brookings firing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dem economists attack Elizabeth Warren over Brookings firing Getty Images By Kevin Cirilli - 10/01/15 07:03 PM EDT Five top Democratic economists are criticizing Sen. Elizabeth Warren (D-Mass.) and the left-leaning Brookings Institution for forcing one of its nonresident economic fellows to resign. Warren raised concerns earlier this week that Robert Litan, a nonresident and unpaid economics fellow at the think tank, was using Brookings to peddle an industry-backed study that was critical of a financial advice regulatory pitch championed by Warren and the White House. In a letter to Brookings earlier this week, Warren questioned the independence of the study, which Litan openly notes in the text \"was supported by the Capital Group, one of the largest mutual fund asset managers in the United States.\" Hours later, Litan was forced to resign. The Democratic economists say they're \"concerned\" about Litan's treatment. They said Warren's approach and Brookings' \"complicity with it threatens ad hominem attack on any author who may be associated with an industry or interest whose views are contrary to hers.\" \"Those who differ with Litan instead should offer a substantive rebuttal to the paper in question, which would do much more to clarify the issue than implicitly depicting him as being inherently corrupted by the sponsorship of his work,\" the economists wrote in a letter submitted to The Washington Post but first obtained by The Hill. The letter was signed by former Clinton economic advisers W. Bowman Cutter and Everett Ehrlich; Harvard University international trade and investment professor Robert Z. Lawrence; former Clinton chief budget economist Joseph Minarik; and former Clinton economic adviser Hal Singer, who co-authored the report in question with Litan. \"Businesses sometimes finance policy research much as advocacy groups or other interests do,\" the economists wrote. \"A reader can question the source of the financing on all sides, but ultimately the quality of the work and the integrity of the author are paramount.\" They praised Litan's quality and integrity as having been \"impeccable over a career of four decades.\" \"In keeping with those standards, he has been completely transparent about the support for, and conduct of, the study in question, as both Brookings and Senator Warren were well aware from the day he first testified before the Congress on the matter,\" the economists wrote. \"To attack him as being 'bought,' or to sever ties with him over an incidental bureaucratic issue, is below the standards that support free and open policy debate,\" they wrote. Tags:", "external_links": [], "published": "2015-10-02T02:03:00.000+03:00", "crawled": "2015-10-02T18:13:58.484+03:00", "highlightTitle": ""}