{"organizations": ["Department of Rural Economy and Agriculture of the African Union Commission", "Rural Economy and Agriculture African Union Commission", "STC", "Rural Development", "Regional Economic Community", "AUC", "Ministerial Inaugural Conference of AU", "STC Conference", "Specialized Technical Committee on Agriculture", "Planning Agency", "Specialized Technical Committee"], "uuid": "2932ed765a9de407eb0f22dea114decb433d5fb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510122193.html", "country": "US", "title": "Africa: STC Conference Concludes With Key Exchanges On Malabo Declaration", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: STC Conference Concludes With Key Exchanges On Malabo Declaration", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T15:36:00.000+03:00", "replies_count": 0, "uuid": "2932ed765a9de407eb0f22dea114decb433d5fb8"}, "author": "", "url": "http://allafrica.com/stories/201510122193.html", "ord_in_thread": 0, "title": "Africa: STC Conference Concludes With Key Exchanges On Malabo Declaration", "locations": ["Ethiopia", "Kenya", "Paris", "Africa", "Malabo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tumusiime Rhoda Peace"], "text": "Kenya: Schoolgirls Dread Their Periods, but Simple Changes Could Help The meeting of AUC's Specialized Technical Committee (STC) on Agriculture, Rural Development, Water and Environment concluded with extensive discussions on the provisions in the Malabo Declaration on Accelerated Agricultural Growth and Transformation. The Department of Rural Economy and Agriculture of the African Union Commission and NEPAD Coordinating and Planning Agency co-organized the Inaugural Conference of the STC. The overall objectives of the Inaugural Conference was to review relevant strategic goals, facilitate mutual accountability and Identify synergies, linkages and complementarities in the on-going agriculture, rural development, water and environment related initiatives, and their implications, read a document from the AUC. More specifically, the Conference aims to review and adopt the Rules of Procedure of the Specialized Technical Committee on Agriculture, Rural Development, Water and Environment; facilitate broad-based consultation and dialogue among all relevant stakeholders on mutual accountability, mutual learning and biennial reporting on previous commitments. It also takes into account various strategic documents related to Agriculture, Rural Development, Water and Environment; identifies synergies, linkages and complementarities in on-going agriculture, rural development, water and environment initiatives and agree on areas of follow up actions at various levels. The Conference also examines and internalizes the strategic and operational modalities for coordination mechanisms between the relevant sector ministries at Member State level, which are also linked to those at Regional Economic Community- REC level. The Inaugural Conference had ministerial segment that was held on 8th and 9th October 2015, preceded by a two day meeting of senior experts that took place on 5th and 6th October 2015. Speaking at the Ministerial Inaugural Conference of AU- STC, Tumusiime Rhoda Peace, Commissioner for Rural Economy and Agriculture African Union Commission said STC mainly reviews relevant strategic goals and facilitates mutual accountability. \"As you may have been following African and global events in recent years, we have been in crafting instruments and guidelines to shape sustainable development issues and solutions for the years to come including SDGs which mainly need joint efforts to be exerted,\" the commissioner said. \"Africa's common position on the global commitments such as the just endorsed 17 sustainable development goals (SDGs) and the twenty first conference of Paris to the united nations framework convention on climate change all these and others demonstrate a desired commitment by leaders at all levels\", she added. African leaders adopted the Malabo declaration in June 2014 to accelerate agriculture growth and transformation (3AGT), with its clearly articulated commitments on eradicating hunger, halving poverty and boosting intra African trade among others. Documents from the AUC show that the STC Conference will provide a peer environment for exchange and learning to support the achievement of individual and collective responsibilities for relevant sector ministries targets. Ethiopia \nFitch Ratings has affirmed Ethiopia's long term foreign and local issuer default ratings (IDR) at \"B\", with a stable … see more » Copyright © 2015 The Ethiopian Herald. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-12T15:36:00.000+03:00", "crawled": "2015-10-12T21:47:29.823+03:00", "highlightTitle": ""}