{"organizations": [], "uuid": "d9d0066562048990d3e32cb2f3f7b7e9364d4f77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/jqFEJHq5fSUXB4oIdZqGEQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_AP_FINANCIALTIMES/f3b7dccda303982f850f6a70670049cb_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/feds-confiscate-lethal-injection-drugs-232411430.html", "country": "GB", "title": "Feds confiscate lethal-injection drugs imported by 2 states", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Feds confiscate lethal-injection drugs imported by 2 states", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:14:00.000+03:00", "replies_count": 0, "uuid": "d9d0066562048990d3e32cb2f3f7b7e9364d4f77"}, "author": "", "url": "https://uk.finance.yahoo.com/news/feds-confiscate-lethal-injection-drugs-232411430.html", "ord_in_thread": 0, "title": "Feds confiscate lethal-injection drugs imported by 2 states", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \nFILE - In this July 23, 2014, file photo, a fence surrounds the state prison in Florence, Ariz., where … \nTUCSON, Ariz. (AP) -- Federal authorities have confiscated shipments of a lethal-injection chemical that Arizona and Texas tried to bring in from abroad, saying such imports are illegal — a move that compounds the nation's severe shortage of execution drugs. \nThe Food and Drug Administration said Friday that it impounded orders of sodium thiopental, an anesthetic that has been used in past executions in combination with drugs that paralyze the muscles and stop the heart. The anesthetic currently has no legal uses in the U.S. \n\"Courts have concluded that sodium thiopental for the injection in humans is an unapproved drug and may not be imported into the country,\" FDA spokesman Jeff Ventura said in a statement. \nArizona paid nearly $27,000 for the sodium thiopental, which federal agents intercepted when it arrived at the Phoenix airport in July, according to documents obtained by The Associated Press. \nTexas and FDA authorities gave fewer details about the confiscation there. Texas is the nation's busiest death penalty state, with about 250 death row inmates and 530 executions carried out over the past four decades. It has not used sodium thiopental in recent years. \nThe national shortage has become more acute over the past few years, ever since European companies started refusing to sell certain drugs to the U.S. Death penalty states have been scrambling to secure supplies, a search that in at least one case led to India and a forlorn-looking business in a residential neighborhood. \nStates have had to change drug combinations or put executions on hold while they look for other options. As backups, Tennessee brought back the electric chair and Utah the firing squad. \nOther states also have looked into buying drugs internationally. \nOhio, which halted executions until at least 2017 because of drug shortage, told the FDA earlier this month it believes it can obtain a drug overseas without violating any laws. \nNebraska ran afoul of the FDA in May when the agency said it could not legally import sodium thiopental and a second lethal-injection chemical it bought for $54,400 from Harris Pharma, a distributor in India. That shipment apparently never made it to the United States. \n\"Just wanted to let you know have a few states who have already ordered sodium thiopental. Would Nebraska be interested as I will have a few thousand vials extra,\" Chris Harris, CEO of Harris Pharma, wrote in April to Nebraska officials, who released the correspondence under a public records request. \nHarris did not name those states, and no one answered the door at the residential address in Kolkata, India, that is listed as the firm's office. \nKey details are blacked out of the Arizona documents, which were released as part of a lawsuit against the corrections department over transparency in executions. \nWhile it is not clear what company the state was doing business with, the paperwork for the purchase resembles the Nebraska paperwork involving Harris Pharma down to the font and formatting. \nMaurie Levin, an attorney who has challenged Texas' death row practices, questioned why any state would want to run the risk of a botched execution by buying drugs from an overseas supplier whose manufacturing standards are not well-known. \nOfficials in Arizona said they believe the drugs impounded there are legal. \n\"The department is contesting FDA's legal authority to continue to withhold the state's execution chemicals,\" Corrections Department spokesman Andrew Wilder said. \nIn Texas, the Department of Criminal Justice said it went through proper federal channels, obtaining an import license from the Drug Enforcement Administration and notifying FDA and Customs. Department spokesman Jason Clark said the state is awaiting a decision from the FDA on the legal status of the imports. \nExecutions have been put on hold in Arizona since the drawn-out death in July 2014 of Joseph Rudolph Wood, who was convicted of killing his ex-girlfriend and her father. Authorities later revealed he was given 15 doses of midazolam and a painkiller. He was supposed to die with one dose. \nArizona, which has 118 death row inmates, announced Friday it is adding another drug combination and making executions more transparent for reporters and inmate attorneys. \nThe state also announced it's seeking to resume a federal lawsuit filed by a group of death row inmates, including Wood. The lawsuit was filed in June 2014, but both parties agreed to put it on hold. The state can't seek execution warrants until that lawsuit is resolved. \n___ \nThis story has been corrected to show that Texas has not used sodium thiopental in recent years, not that it has used the drug. \n___ \nPritchard reported from Los Angeles. Associated Press writers Matthew Perrone in Washington, Michael Graczyk in Houston, Manik Banerjee in Kolkata, India, and Margery Beck in Omaha, Nebraska, contributed to this report. \n___", "external_links": [], "published": "2015-10-24T03:14:00.000+03:00", "crawled": "2015-10-24T03:56:24.528+03:00", "highlightTitle": ""}