{"organizations": [], "uuid": "68a117cb1e758dd544c600d15abfdd362ff16e8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9012098_G.jpg", "site_section": "http://www.cbs8.com/category/120652/money", "section_title": "Money: Personal Finance, Business, Small Business news features - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30255378/asian-stocks-mostly-lower-on-weak-lead-from-us", "country": "US", "title": "Asian stocks mostly lower on weak lead from US", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Asian stocks mostly lower on weak lead from US - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "68a117cb1e758dd544c600d15abfdd362ff16e8b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30255378/asian-stocks-mostly-lower-on-weak-lead-from-us", "ord_in_thread": 0, "title": "Asian stocks mostly lower on weak lead from US", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By YOUKYUNG LEE\nAP Business Writer SEOUL, South Korea (AP) - Asian stock markets extended losses Wednesday following a drop on Wall Street as investors digested weak Chinese trade and low inflation.\nKEEPING SCORE: Japan's Nikkei 225 slid 2 percent to 17,865.37 and South Korea's Kospi dropped 0.5 percent to 2,009.37. Hong Kong's Hang Seng was down 0.8 percent to 22,411.20 and the Shanghai Composite Index in mainland China was nearly flat, down 0.1 percent to 3,289.80. Australia's S&P/ASX 200 fell 0.2 percent to 5,195.10. Stocks in Singapore were flat after trading higher on preliminary data that showed the country narrowly avoided a recession in the third quarter.\nCHINA DATA: Data showed Chinese inflation eased in September, stoking expectations that Beijing would have more leeway for interest rate cuts or other stimulus to prop up slowing economic growth. Consumer prices rose 1.6 percent over a year earlier, driven by a 2.7 percent rise in food costs. Meanwhile, China's weak trade data released Tuesday weighed on sentiment for a second day. China's weak imports for September sparked concerns about demand, dampening prices of commodities. It also drove down currencies of commodity-reliant countries such as Australia.\nANALYST'S TAKE: \"Disappointing Chinese data drove another sell-off in Asia today,\" said Angus Nicholson at IG in Singapore. \"Today's Chinese CPI essentially guaranteed further cuts to the interest rate and the reserve requirement ratio before the year is out.\" He said further rate cuts this year look \"inevitable\" and lower rates will put renewed pressure on China to devalue its currency that has gained against the U.S. dollar, which would help its exports.\nWALL STREET: U.S. stocks finished lower on Tuesday for the first day in five. The Standard & Poor's 500 fell 0.7 percent to 2,003.69. The Dow Jones industrial average declined 0.3 percent to 17,081.89. The Nasdaq composite dropped 0.9 percent to 4,796.61.\nENERGY: Benchmark U.S. crude added 15 cents to $46.81 per barrel in electronic trading on New York Mercantile Exchange. The contract closed 44 cents lower at $46.66 per barrel on Tuesday. Brent crude, used to price international oils, was up 11 cents to $49.80 a barrel in London.\nCURRENCIES: The dollar fell to 119.59 yen from 119.76 yen on Tuesday. The euro rose to $1.1396 from $1.1386.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T08:56:09.822+03:00", "highlightTitle": ""}