{"organizations": [], "uuid": "b578a58a6c0acdb1f2f05ea27a15c876c6f4cf38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/01/12999245/Nick Iarocci BHS-2_Low-Rez-12.jpg", "site_section": "http://www.prweb.com/rss2/homefinance.xml", "section_title": "Home and Family: Banking / Personal Finance", "url": "http://www.prweb.com/releases/LibertyTitleMarinosciLaw/TRID_compliance_2015/prweb12999245.htm", "country": "US", "title": "Liberty Title and Escrow Co. - Marinosci Law Group Completion of TRID Compliance Ahead of Oct 3rd Deadline", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Liberty Title and Escrow Co. - Marinosci Law Group Announces the Completion of TRID Compliance Ahead of Oct 3rd Deadline", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "b578a58a6c0acdb1f2f05ea27a15c876c6f4cf38"}, "author": "Chip Leakas, Marketing Director", "url": "http://www.prweb.com/releases/LibertyTitleMarinosciLaw/TRID_compliance_2015/prweb12999245.htm", "ord_in_thread": 0, "title": "Liberty Title and Escrow Co. - Marinosci Law Group Completion of TRID Compliance Ahead of Oct 3rd Deadline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TRID Compliance — today at the press conference, Liberty Title and Escrow Co. - Marinosci Law Group, PC announced the full availability of TRID Compliance within our title and escrow software, enabling all current customers using our order processing system access to the new forms for real estate settlement transactions. “Liberty Title and Escrow Co. - Marinosci Law Group, PC, made the following significant investments in TRID compliance focusing on these three critical areas: Training, Tools and Technology. TRAINING: (1.) Two National Underwriting partners trained our staff and conducted webinars for our nationwide employees. (2.) Our corporate attorney created PowerPoint presentations and completed mandatory trainings for staff nationwide (3.) Closing Disclosure Form training was loaded to our online employee benefits/training portal (4.) We proactively reached out to all of our clients with a questionnaire in order to understand how they were handling TRID and what their expectation would be of us. TOOLS: (5.) Provided an online Learning Resource Center with sample forms and test environments for ongoing employee training. TECHNOLOGY: (6.) Integrated our title and escrow software with third party information exchange platforms to accommodate software changes on the lender side,” said Nicholas F. Iarocci, Corporate Managing Attorney at Liberty Title and Escrow Co.\n“At Liberty Title & Escrow Co. and the Marinosci Law Group, PC, we are uniquely prepared to handle all aspects of the new TRID reform with an effective date of October 3, 2015,\" said Nicholas F. Iarocci.\nKey elements of our TRID compliance implementation includes:\n(1.) Internet, server, and network security\n(2.) Barracuda encryption transmission software\n(3.) Physical on-site facility and document protection\n(4.) Dedicated funding and accounting departments\n(5.) Ample staffing for the production of new closing disclosures\n(6.) Corporate counsel for continued regulatory compliance” said Nicholas F. Iarocci, Corporate Managing Attorney at Liberty Title and Escrow Co. - Marinosci Law Group, PC.\n“TRID Compliance will ultimately impact every client, whether lender or agent based. Liberty Title and Escrow Co. - Marinosci Law Group, PC clients have a choice in settlement providers only magnifies the importance new CFPB compliance in our industry. As such, Liberty Title & Escrow Co. and the Marinosci Law Group, PC are properly equipped to handle all of your title and closing needs. At Liberty Title and Escrow Co. - Marinosci Law Group, PC’s we are committed to deliver the industry leading platform for title and escrow software to our customers. At Liberty Title and Escrow Co. - Marinosci Law Group, PC, we are unique because of our national reach, capital, and advanced technology. Liberty Title and Escrow Co. - Marinosci Law Group, PC has completed the ALTA Certification Assessment, and is currently both Stewart and SSAE16 Soc Certified. said Nicholas F. Iarocci, Corporate Managing Attorney at Liberty Title and Escrow Co. - Marinosci Law Group, PC.”\nFounded in 1997, Liberty Title and Escrow Co. - Marinosci Law Group, PC Headquartered in Warwick RI, Liberty offers title and escrow services in all 50 states, able to handle the most complex needs with a high level of personal service. Working with realtors, lenders, mortgage brokers, finance companies, credit unions, loan servicers, asset management companies, and home buyers, they focus on delivering the fastest, highest quality title and escrow services nationwide at their customer’s convenience. In addition, Liberty Title is a national Agent licensed in 31 States; our underwriters include Fidelity, First American, and Stewart. The company offers a wide range of products and services designed to work with realtors, lenders, mortgage brokers, finance companies, credit unions, loan services, asset management companies, and home buyers to deliver the fastest, highest quality title and escrow services nationwide at your convenience.", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T13:15:13.916+03:00", "highlightTitle": ""}