{"organizations": [], "uuid": "1039183fe9816205718331b35b241c926d358833", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/22/hypermarcas-ma-kimberly-clark-idUSL1N12M3B820151022", "country": "US", "title": "UPDATE 1-Hypermarcas, Kimberly-Clark in talks over unit - source", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Hypermarcas, Kimberly-Clark in talks over unit - source | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T01:14:00.000+03:00", "replies_count": 0, "uuid": "1039183fe9816205718331b35b241c926d358833"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/22/hypermarcas-ma-kimberly-clark-idUSL1N12M3B820151022", "ord_in_thread": 0, "title": "UPDATE 1-Hypermarcas, Kimberly-Clark in talks over unit - source", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Kimberly-Clark comment, background in paragraphs 4-7)\nSAO PAULO Oct 22 (Reuters) - Hypermarcas SA, the largest Brazilian producer of personal care goods, is in advanced talks to sell a unit that manufactures diapers to Kimberly-Clark Corp, sharpening the company's focus on pharmaceuticals, a source with direct knowledge of the matter said on Thursday.\nThe source, who declined to be identified because the negotiations are under way, did not give a price tag for the transaction. A deal will be announced in coming days, the source added.\nSão Paulo-based Hypermarcas had hired Citigroup Inc, Bank of America Merrill Lynch and Banco Bradesco BBI to find alternatives for the diaper unit, sources told Reuters recently. The alternatives included a potential spin-off, partnerships or might even involve an asset sale, according to a securities filing unveiled in early May.\nHypermarcas had no immediate comment. Kimberly-Clark spokesman Bob Brand said the company does not comment on rumor or speculation.\nAccording to the source, Hypermarcas wanted to exit the diaper market because performance was hobbled by the lack of scale, brand recognition and the rising cost of imported materials for the product amid a sharp drop in Brazil's currency, the real.\nThe diaper unit earned about 860 million reais in revenue last year, according to the filing. Hypermarcas is also the largest maker of over-the-counter medicines in Brazil.\nApart from Kimberly-Clark, Hypermarcas had also offered the unit to a group of companies that included Chile's Empresas CMPC SA, Procter & Gamble Co and Svenska Cellulosa SCA AB. Initially Hypermarcas aimed to raise about 1.5 billion reais ($385 million) with the sale of the unit, which owns the Sapeka and Pompom brands. ($1 = 3.9045 Brazilian reais) (Reporting by Guillermo Parra-Bernal; Additional reporting by Ramkumar Iyer in Bengaluru; Editing by Matthew Lewis )", "external_links": [], "published": "2015-10-23T01:14:00.000+03:00", "crawled": "2015-10-23T00:17:40.395+03:00", "highlightTitle": ""}