{"organizations": [], "uuid": "23d774c102f4b29f1c024879d9ec56b4bfe417fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/c/y/2/t/image.related.afrArticleLead.620x365.gkcwde.png/1445245571257.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/opinion/columnists/consumers-may-help-china-live-up-to-hype-20151019-gkcwde", "country": "AU", "title": "Consumers may help China live up to hype", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Consumers may help China live up to hype | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T18:00:00.000+03:00", "replies_count": 0, "uuid": "23d774c102f4b29f1c024879d9ec56b4bfe417fd"}, "author": "Jennifer Hewett", "url": "http://www.afr.com/opinion/columnists/consumers-may-help-china-live-up-to-hype-20151019-gkcwde", "ord_in_thread": 0, "title": "Consumers may help China live up to hype", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Construction in a frenzied housing market that seemed invincible has slowed due to the glut of apartments most noticeable in second- and third-tier cities. Qilai Shen Share on twitter by Jennifer Hewett There's no end to the great China guessing game. The official third-quarter annual growth figures of 6.9 per cent are slightly better than expectations. If they had been a little worse, international markets would no doubt have been spooked, with that psychology ricocheting around the currency and Australian shares.\nBut any consensus view is no more than averaging out a lot of individual analyst guesses anyway. Nor does it particularly matter whether there's one-tenth of a percentage point one way or another in China's quarterly figures, especially as the accuracy is questionable.\nFar more important is the trend of what is happening in the Chinese economy and how marked those changes are. Beijing has set its target for growth of about 7 per cent for this year. An annual figure of 6.9 per cent may indeed be slightly massaged but it looks close enough for comfort to a market looking for optimism.\nYet none of this quells the perpetual argument between bulls and bears over how realistic the prospects are for continued strong, steady growth in China. Each side always seizes on data that suits.\nRemember all the sombre talk about a \"hard landing\" being imminent? Even China's remarkable economic record of muddling through the risks since is only seen as staving off the inevitable.\nSo the latest figures can be interpreted as marking the slowest pace of growth for six years, suggesting deep structural problems and high debt levels in the economy despite the government's attempt to stimulate growth.\nOr they can provide further evidence the Chinese government, despite some spectacular missteps, is managing the transition of its economy relatively well.\nGlut of apartments It's true that construction in a frenzied housing market that seemed invincible has slowed due to the glut of apartments most noticeable in second- and third-tier cities. According to the National Bureau of Statistics, property investment rose by 2.6 per cent over the first nine months of the year compared to 12.5 per cent during the same period in 2014. That compounds growing doubts about China's future steel production even if Australia's iron ore producers express confidence in increased demand, despite their own much larger increase in export volumes.\nThe obvious degree of overcapacity in the economy is still only responding modestly to government spending and lower rates.\nBut if China's aim is to encourage greater domestic consumption over investment, the figures showing retail sales with a 10.9 per cent increase compared to industrial production at 5.7 per cent seem to follow that script. Fixed-asset investment was showing over 10 per cent growth too, but that's down from over 16 per cent.\nSo while the prices of Australia's big commodities exports show little sign of improving, the figures demonstrate a strongly growing if far less developed alternative – based on Chinese consumerism and the demand for services of all sorts.\nThis won't suddenly provide the same big boost to Australia's national terms of trade as the resources boom did – and is now undoing.\nBut as TD Securities analysis points out, consumption is the driver of GDP growth in China now, accounting for 58.4 per cent of GDP so far in 2015.\n\"The gap between retail sales and industrial production is widening and we expect this rotation of growth theme to continue,\" strategist Annette Beacher said in a note to clients. And for those trying to sell online (from a distance), it would be heartening that China's e-commerce sector accelerated by more than 35 per cent during the first three quarters of this year. Online retail amounts to 10 per cent of the country's retail market.\nRobb emphasises services That's why Trade Minister Andrew Robb has kept emphasising the potential for Australian businesses able to offer services as well as a range of products to meet changing consumer tastes and demand as the key benefit of the China free trade deal .\nThat seems to have persuaded a majority according to the latest Fairfax/Ipsos poll. This shows 54 per cent of people are in favour of the deal and one-third opposed. This is despite the ferocious – and ferociously inaccurate – union ad campaign and Labor's political twitching in response.\nNegotiations between Robb and shadow trade minister Penny Wong are continuing quietly now Labor has finally released proposed amendments to ensure the deal gets through the Senate.\nThere is no substance to Labor's claims that these additional provisions to the operation of 457 visas for temporary skilled foreign workers will protect Australian jobs otherwise under threat from the FTA.\nAt most they have the potential to complicate and delay labour agreements and registration while encouraging the prospect of litigation. The proposals are more about being seen to justify Labor's resistance following pressure from unions like the Construction, Forestry, Mining and Energy Union and the Electrical Trades.\nIt is still unclear to business whether the proposals would end up imposing a requirement for labour market testing for every single job, for example. This is rather than allowing the ability to demonstrate a shortage of available Australians in particular categories, valid for a period of 12 months. Nor is it clear whether Labor's desire to increase the minimum wage floor from $53,900 to $57,000 for those eligible for 457 temporary visas will be retrospective.\nBut opposition and government both know the urgency of the need for political agreement. They accept that failure is no longer an option – as opposed to both being able to loudly claim victory. Not if both parties want to keep faith with the public and all those smaller Australian businesses keen to negotiate their way into what is still a huge and growing market in China. That's the real – fast-changing – world.", "external_links": ["https://twitter.com/http://twitter.com/jennifer_hewett"], "published": "2015-10-19T18:00:00.000+03:00", "crawled": "2015-10-20T02:09:16.680+03:00", "highlightTitle": ""}