{"organizations": [], "uuid": "68baeaa580df89250387a9517f2efbbe4e019bba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/now-see-germany-britain-doesnt-175936909.html", "country": "GB", "title": "Now we see that Germany, like Britain, doesn't believe in common EU rules", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Now we see that Germany, like Britain, doesn't believe in common EU rules", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:59:00.000+03:00", "replies_count": 0, "uuid": "68baeaa580df89250387a9517f2efbbe4e019bba"}, "author": "", "url": "https://uk.finance.yahoo.com/news/now-see-germany-britain-doesnt-175936909.html", "ord_in_thread": 0, "title": "Now we see that Germany, like Britain, doesn't believe in common EU rules", "locations": ["Britain", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Oct 9, 2015, 07:24 BST - UK Markets open in 36 mins. Now we see that Germany, like Britain, doesn't believe in common EU rules By Jeremy Warner | Telegraph – 12 hours ago 0.00 0.00 \nThe European superpower may insist that others follow the rules, but it doesn't want to itself \nThe British, it has been said, will only vote for Europe when they can look across the Channel and see that things are noticeably better over there than they are here. That was certainly the case in 1975, the last time there was a referendum on British membership of what was then called the European Economic Community. \nIt (Other OTC: ITGL - news ) isn’t today, nor is it even remotely likely to become so within the timeframe set for the latest referendum. Even (Taiwan OTC: 6436.TWO - news ) if David Cameron secures substantive concessions, which in itself seems unlikely, he’ll have a fight on his hands winning the argument. Europe’s dismal, and largely self-inflicted, condition, makes for a particularly negative backdrop. \nIt is small wonder that he said so little about it in his conference speech . He has been a lucky Prime Minister so far. Europe could yet transform his hopes of a “turnaround decade” into a colossal derailment at least for him and his Chancellor, if not the growing ranks of would-be successors. \nYou can say one thing about the terrible mess Europe has made of its migrant crisis : it has at least diverted attention from the failure of its own economy, which has been almost forgotten amid the bleeding heart reportage of drowned children and the storming of borders. \nYet the two crises are actually surprisingly similar, if not in genesis then certainly in response. Both speak to Europe’s inability to manage its affairs collectively, a bizarre irony given that effective collective action is meant to be the whole purpose of the European Union. \nIndeed, we can be pretty certain that both crises would have been far better managed had Europe still been a continent of sovereign nations, each determining their own affairs independently, and would also very probably have been less extreme in the first place. \nJust to indulge in a little “virtual history”: fewer migrants would be making the journey if border controls still existed; and on the economy, floating exchange rates would have provided the natural market-based adjustment mechanism denied by monetary union. Instead we have the worst of all possible worlds, an incoherent collective approach which is satisfactory to no one. \nIt’s the International Monetary Fund annual meeting in Peru this week, and already there are the customary calls from international leaders and officials for Germany to do its bit for the eurozone crisis by stimulating its own economy. No doubt this would be vaguely helpful to the depression-engulfed periphery, but the chief economist at Germany’s finance ministry, Ludger Schuknecht, is having none of it. In an article this week he makes the fairly obvious point that further stimulus is not at all appropriate for Germany, which doesn’t need it and, like Britain, wants to get its public debts down in preparation for the challenges of an ageing population. \nRightly or wrongly, most Germans believe they are already doing quite enough in the name of European solidarity. They are taking the lion’s share of the migrants, and they are also essentially bank rolling all of Europe’s bailout funds, including the European Central Bank, which in the absence of anything else performs much the same role. In any case, Mr Schuknecht presumably reflects the view of his government when he says he doesn’t really believe in safety nets or stimulus, which he thinks “futile” and “frivolous”. \nThis is very much the German view of things. Yet it is not a philosophy that applies within the country’s own borders, where fiscal and monetary transfers take place all the time as a matter of course. All sovereign nations work in this way. Unfortunately, agreeing such transfers between nations with widely different economies, welfare and tax systems is, for obvious reasons, like pulling teeth. \nInstead, beleaguered members of the single currency have been required to collapse domestic demand to the point where external financing is no longer necessary, damning Europe to seemingly perpetual stagnation. Europe is a continent trapped in a deflationary spiral of its own making, with no way out. Britons are hardly alone in objecting to “ever-closer union”. \nWhen it comes to the really important stuff, Germany is in the same boat, philosophically happy enough to go along with “more Europe” when it suits but in practice bitterly resistant to anything substantive. Germany routinely ignores rules designed to prevent excessive current account surpluses the underlying cause of Europe’s economic imbalances while insisting on punishing fiscal discipline in others. \nYou can call this a form of imperialism if you like, though no empire ever lasted long by keeping its colonies in penury. But is it the kind of Europe, which even as a fringe member without any of the obligations imposed by monetary union you would really want to be part of? \nAs ever, the British electorate will vote with its pockets; economic failure on such an unnecessary and epic scale does not make a tempting proposition.", "external_links": [], "published": "2015-10-08T20:59:00.000+03:00", "crawled": "2015-10-09T09:25:08.178+03:00", "highlightTitle": ""}