{"organizations": ["BHP Billiton plc And Royal Mail PLC"], "uuid": "7b62713e2d943a7f6e8f959d2d81e0efe44629d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-telecommunications/?format=rss", "section_title": "Telecommunications News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/monitise-plc-bhp-billiton-plc-132847169.html", "country": "US", "title": "Are Monitise Plc, BHP Billiton plc And Royal Mail PLC Set To Shine In 2016?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Are Monitise Plc, BHP Billiton plc And Royal Mail PLC Set To Shine In 2016?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T16:28:00.000+03:00", "replies_count": 0, "uuid": "7b62713e2d943a7f6e8f959d2d81e0efe44629d5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/monitise-plc-bhp-billiton-plc-132847169.html", "ord_in_thread": 0, "title": "Are Monitise Plc, BHP Billiton plc And Royal Mail PLC Set To Shine In 2016?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Oct 19, 2015, 21:14 BST - UK Markets closed Are Monitise Plc, BHP Billiton plc And Royal Mail PLC Set To Shine In 2016? By Peter Stephens | Fool.co.uk – 6 hours ago 437.06 -8.74 \n2015 has been a truly horrific year for mobile payment solution provider Monitise (LSE: MONI). Its shares have fallen by 88% since the turn of the year, its CEO has announced her resignation and the company appears to be no closer to reaching profitability after multiple revenue warnings in recent months. \nLooking ahead, Monitise could be set to benefit from increasing demand for its mobile payment platform. It is certainly a very appealing, slick and widely used product and Monitise has a number of blue-chip clients and major backers. And, with smartphone and tablet sales continuing to rise, there is a major opportunity to provide consumers with increasingly versatile banking apps with additional functionality in 2016 and beyond. \nThe problem, though, is that there remains a question mark as to whether such apps will ever become profitable. For Monitise, this appears to be the 'holy grail' and anything but a black bottom line seems unlikely to convince the market that Monitise has a viable business. And, while a new CEO is likely to refresh the company's strategy, there appear to be better options within the technology and banking space to invest in for investors seeking a highly profitable business with growth potential. In other words, while Monitise has potential, 2016 may not be the year in which it is fully realised. \n2015 has also been a hugely challenging year for BHP Billiton (LSE: BLT). Its shares have fallen in value by 20% since the turn of the year and, realistically, things could get worse before they get better. That's at least partly because BHP is making major changes to its business model including the spin-off of non-core assets as well as generating efficiencies and restructuring. These moves will take time to have an impact on the company's financial performance and, with its dividends not being covered by profit, a dividend cut may be on the cards. This has the potential to hurt investor sentiment in the company in the short run. \nHowever, with BHP Billiton having a strong balance sheet and a sound strategy of reducing costs and increasingly supply, it remains a top notch long term buy. And, even if dividends are cut by half, it would still be yielding a very impressive 3.7%. Therefore, with a hugely appealing asset base, generous yield and long term growth potential resulting from rising demand for commodities in the coming years, BHP appears to be a strong buy at the present time. \nMeanwhile, shares in Royal Mail (LSE: RMG) have risen by a solid 7% since the turn of the year, but improved performance could lie ahead in 2016. That's because the company is expected to return to bottom line growth in the next financial year following a challenging current year. This means that its price to earnings (P/E) ratio of 12.9 may rise as investor sentiment begins to pick up further in the coming months. \nIn addition, with interest rates unlikely to rise at a rapid rate in 2016, Royal Mail's yield of 5.2% has huge appeal - especially since it is well-covered by profit at 1.5 times. Certainly, there are potential challenges ahead for the company as the parcel delivery space becomes increasingly competitive. But, as a good value income stock, Royal Mail has relative appeal and, as such, its shares seem likely to continue to beat the index in 2016 and beyond. \nOf course, there are a number of other stocks that could be worth buying right now and, with that in mind, the analysts at The Motley Fool have written a free and without obligation guide called 1 Top Small-Cap Stock From The Motley Fool. \nThe company in question may have flown under your investment radar until now, but could help you to build a great income from your investments and retire early, pay off the mortgage, or simply enjoy a more abundant lifestyle. \nClick here to find out all about it - it's completely free and comes without any obligation. \nPeter Stephens owns shares of BHP Billiton. The Motley Fool UK owns shares of Monitise. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-10-19T16:28:00.000+03:00", "crawled": "2015-10-19T23:16:20.134+03:00", "highlightTitle": ""}