{"organizations": [], "uuid": "e7ece1e03f6cfed85a15745d63f15bea0008fcf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/18/australia-marijuana-idUSL3N12I0EC20151018", "country": "US", "title": "RPT-Australia to allow marijuana to be grown locally for medical trials", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "RPT-Australia to allow marijuana to be grown locally for medical trials | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T01:03:00.000+03:00", "replies_count": 0, "uuid": "e7ece1e03f6cfed85a15745d63f15bea0008fcf3"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/18/australia-marijuana-idUSL3N12I0EC20151018", "ord_in_thread": 0, "title": "RPT-Australia to allow marijuana to be grown locally for medical trials", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats story published on Saturday; no changes to text)\nBy Morag MacKinnon\nPERTH Oct 17 (Reuters) - Australia is altering its drug laws to allow for the cultivation of marijuana for medicinal and scientific purposes, removing a major hurdle to the establishment of clinical trials of the drug, the government said on Saturday.\nDraft amendments to the Narcotics Drugs Act are being finalised to allow for the controlled cultivation of marijuana, giving patients access to \"a safe, legal and sustainable supply of locally produced products for the first time,\" Health Minister Sussan Ley said in a statement.\nAustralian manufacturers, researchers and patients currently have to access international supplies of legal medicinal marijuana, with cost, limited supply and export barriers making this challenging.\nAllowing for the controlled cultivation of marijuana in Australia will provide the critical \"missing piece\" where laws already exist to licence the manufacture and supply of medicinal cannabis-based products, but local production of the crop remains forbidden, Ley said.\n\"This government is incredibly sympathetic to the suffering of those Australians with debilitating illnesses and we want to enable access to the most effective medical treatments available,\" Ley said.\nThe government plans to create a licensing scheme to ensure that the cultivation of marijuana meets Australia's international obligations and to manage the supply of the drug from farm to pharmacy.\n\"Allowing the cultivation of legal medicinal cannabis crops in Australia under strict controls strikes the right balance between patient access, community protection and our international obligations.\"\nSeveral Australian states have already announced clinical trials for medicinal cannabis. Under Australian law, decriminalisation and medical trials come under state government jurisdiction. The Federal government is responsible for the regulation of the growing and importation of the drug.\nThe proposed changes to the legislation could pave the way for a new medicinal cannabis industry with export potential.\nLast year, Australia's first initial public offering in a medicinal marijuana company, MMJ PhytoTech Ltd <MMJ.AX >, was three times oversubscribed. (Editing by Ed Davies )", "external_links": [], "published": "2015-10-19T01:03:00.000+03:00", "crawled": "2015-10-19T00:34:51.949+03:00", "highlightTitle": ""}