{"organizations": [], "uuid": "693808fc90439ac4704e1ead5b820ab5aea0014a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/o/4/6/e/image.related.articleLeadwide.620x349.gjnqha.png/1442369480138.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4020/financials/diversified-financials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/banking-and-finance/apra-says-big-banks-at-risk-from-shortterm-wholesale-debt-addiction-20150916-gjnqha.html", "country": "AU", "title": "APRA says big banks at risk from short-term, wholesale debt addiction", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "APRA says big banks at risk from short-term, wholesale debt addiction", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "693808fc90439ac4704e1ead5b820ab5aea0014a"}, "author": "James Eyers", "url": "http://www.smh.com.au/business/banking-and-finance/apra-says-big-banks-at-risk-from-shortterm-wholesale-debt-addiction-20150916-gjnqha.html", "ord_in_thread": 0, "title": "APRA says big banks at risk from short-term, wholesale debt addiction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australian Prudential Regulation Authority chairman Wayne Byres said local banks were not ready for the application of the 'net stable funding ratio'. Photo: Michele Mossop\nBanks will need to fund themselves with more long-term debt over time, the chairman of the banking regulator said on Wednesday, a move that will push up bank funding costs to pay for the reduced risk that the financial system will be exposed in a funding crisis.\nAustralian Prudential Regulation Authority chairman Wayne Byres warned banks are not ready for the application of the \"net stable funding ratio\", which will come up for consultation with the industry in the coming months before its introduction in 2018.\nThat net stable funding ratio (NSFR), a key reform of the Basel Committee, requires banks to maintain a stable funding profile that reflects the composition of assets and activities. It limits over-reliance on short-term, wholesale funding.\n\"Given their funding structures, the largest Australian banks don't easily meet the new standard, and as things stand today, international comparisons are not particularly favourable to them,\" Mr Byres said on Wednesday at an event at the Actuaries Institute in Sydney.\nAdvertisement \"So, some further lengthening of Australian bank maturity profiles is therefore likely to be needed over time, to truly strengthen their funding resilience.\"\nBy pushing banks to issue longer-term bonds, the cost of funding for banks will increase. The big banks can currently issue a one-year bond at 26 basis points over the bank bill swap rate; for a five-year bond, the rate is 90 basis points over bills.\nThe extra costs could be passed on to customers in the form of higher interest rates on loans.\n\"There will be an extra cost to consumers if we have a lot more long-term debt,\" said Paolo Tonucci, group treasurer at Commonwealth Bank of Australia.\nGordon Allison, head of treasury development and transformation at National Australia Bank, said new rules on liquidity and the design of net stable funding ratio \"might become a real constraint for banks, and will be something we have to manage carefully. NSFR is a structural challenge and is something that is difficult to shift.\"\nWhile the design of the NSFR is yet to be determined, it will require banks to reduce short-term debt. According to the Reserve Bank of Australia, short-term debt currently comprises about 20 per cent of bank funding, with about 60 per cent of that coming from offshore markets.\nThat is the very type of funding that the financial system inquiry chaired by David Murray said was the most risky, because it could disappear in a crisis. Mr Byres said banks have not materially reduced reliance on short-term, wholesale funding from offshore since the financial crisis. \"As a percentage of total funding, short-term wholesale funding from offshore is virtually unchanged from a decade ago,\" he said.\n\"That is an important issue to address because the key rationale for the FSI's 'unquestionably strong' [capital] recommendation was the recognition that this funding issue has been a key vulnerability in the past.\"\nSignalling equity capital raisings by banks have not ended, Mr Byres also said Australian banks compare less favourably with international banks on the leverage ratio, which divides Tier 1 capital by total assets (without risk weighting the assets). Even though the Australian banks remain above the 3 per cent minimum leverage ratio envisaged by Basel and the ratio is designed to serve as a backstop, \"we shouldn't lose sight of it altogether\", Mr Byres warned.\nBasel has also introduced a liquidity coverage ratio (LCR), which came into force for the larger banks this year. It had improved liquidity, Mr Byres said, although \"the apparent ceasefire in the war for deposits means liquidity profiles have been strengthened less than might first appear\".\nThe net stable funding ratio and LCR might ultimately have a larger impact on bank that the rules on capital levels, he said. \"These measures potentially have a greater impact on the Australian banking sector given its excess of loans over deposits and its reliance on wholesale funding than any of the changes to the capital framework.\"\nHis speech on Wednesday also addressed APRA's focus on enhancing bank culture, which follows a string of scandals in financial planning divisions and an investigation by ASIC over alleged rigging of benchmark interest rates. APRA has written to bank boards of directors this year to emphasise the issue and Mr Byres said on Wednesday a new, small team had been set up to act as a \"centre of expertise to drive our supervisory efforts in relation to governance, culture and remuneration, issues we think are highly interrelated\".\nWhile governance standards are reasonable, \"on culture and remuneration we have more to do before we can be confident these will be genuinely supportive of long-term financial strength rather than, as we have seen in the past, possible threats to it\".", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T11:41:29.716+03:00", "highlightTitle": ""}