{"organizations": [], "uuid": "47736d2a6f43f5179b0a1df8236ddc028562daec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/EducationTrainingServices", "section_title": "Yahoo! Finance: Education & Training Services Industry News", "url": "http://finance.yahoo.com/news/devry-university-hosts-first-veterans-154800113.html", "country": "GB", "title": "DeVry University Hosts First Veterans-Only Virtual Career Fair", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "DeVry University Hosts First Veterans-Only Virtual Career Fair - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "47736d2a6f43f5179b0a1df8236ddc028562daec"}, "author": "DeVry University", "url": "http://finance.yahoo.com/news/devry-university-hosts-first-veterans-154800113.html", "ord_in_thread": 0, "title": "DeVry University Hosts First Veterans-Only Virtual Career Fair", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DOWNERS GROVE, Ill.--(BUSINESS WIRE)--\nDeVry University’s Career Services department will hold its first virtual career fair for veterans today, Sept. 16, from noon to 3 p.m. CDT. The event will offer students and alumni with military backgrounds a convenient opportunity to connect with employers via computer, smartphone or tablet no matter what their location. \n“We’ve hosted two virtual career fairs to date, but this is our first opportunity geared specifically toward military students and alumni,” said Madeleine Slutsky, vice president of career and student services at DeVry University. “Many of our military students are stationed in remote locations, so we are ecstatic to give them the chance to meet with employers and build professional connections all around the country.” \nMore than 20 companies and nonprofit organizations will participate in the career fair, including Xerox, Experis, ADT Security Services, Workforce Opportunity Services, Steris Corporation and Apria Healthcare. \nThe event is open to veterans transitioning to the workforce; veterans or active-duty military personnel who are ready to explore new career options; and military spouses and immediate family members. The event aims to connect students and alumni to jobs that not only use their DeVry University education, but also draw on the skills they have developed through their military experience. \nDeVry University military students and alumni received a formal invitation to the event, which included a link to upload a résumé, photo and other information for potential employers’ review. Confirmed participants can log into the career fair website before the event to search job listings, connect with recruiters and research participating organizations. Employers will conduct live one-on-one chats during the event and will schedule interviews for afterward. Job listings from the career fair will remain active as long as the positions stay open. \nDeVry University provides extensive career services to current students and alumni. This year alone, more than 500 students and alumni have participated in two virtual career fairs, with four more scheduled in the near future. These events sparked more than 900 one-on-one conversations between DeVry University students and alumni and participating employers. \nAbout DeVry University \nDeVry University’s mission is to foster student learning through high-quality, career-oriented education integrating technology, business, science and the arts. Founded in 1931, the university offers undergraduate and graduate degree programs onsite and online covering 34 different career fields within its five distinguished colleges of study: Business & Management, Engineering & Information Sciences, Health Sciences, Liberal Arts & Sciences, and Media Arts & Technology. The university is accredited by The Higher Learning Commission (HLC, www.hlcommission.org ). Its highly credentialed faculty members work in the fields that they teach, providing real-world experiences that prepare students for in-demand careers. \nWith locations across the U.S., DeVry University is one of the largest private-sector universities in North America. The university is a part of DeVry Education Group ( DV ), a global provider of educational services. \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150916006263/en/ \nEmployment & Career DeVry University Contact: DeVry University\nMelanie Wright, 215-390-0281\nmwright1@devry.edu \nor\nMSLGROUP\nKatie Pearson, 312-861-5248\nkatie.pearson@mslgroup.com", "external_links": [], "published": "2015-09-26T03:00:00.000+03:00", "crawled": "2015-09-26T07:53:28.833+03:00", "highlightTitle": ""}