{"organizations": ["LinkedIn Share", "National Geographic Society", "National Geographic Partners National Geographic Society", "Google"], "uuid": "615455b8d12da0ffc19e1e4cdaa7cf1fe1ea0a1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iDqpq1kVnFbc/v1/-1x-1.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=FOXA", "section_title": "Yahoo! Finance: FOXA News", "url": "http://www.bloomberg.com/news/articles/2015-09-09/fox-national-geographic-expand-accord-with-for-profit-company?cmpid=yhoo", "country": "US", "title": "Fox, National Geographic Expand Accord With For-Profit Company", "performance_score": 0, "site": "bloomberg.com", "participants_count": 0, "title_full": "Fox, National Geographic Expand Accord With For-Profit Company", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T01:55:00.000+03:00", "replies_count": 0, "uuid": "615455b8d12da0ffc19e1e4cdaa7cf1fe1ea0a1d"}, "author": "", "url": "http://www.bloomberg.com/news/articles/2015-09-09/fox-national-geographic-expand-accord-with-for-profit-company?cmpid=yhoo", "ord_in_thread": 0, "title": "Fox, National Geographic Expand Accord With For-Profit Company", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Fox"], "text": "The proceeds, along with the continued ownership stake in the nature-oriented cable networks, will give the non-profit National Geographic Society added financial stability and double its resources for investments in science, research and education. Source: Sacramento Bee via Getty Images Fox to own 73 percent of National Geographic Partners National Geographic Society endowment rises to $1 billion Share on LinkedIn Share on Reddit Share on Google+ E-mail \n21st Century Fox Inc. and the National Geographic Society are expanding their 18-year partnership with a new, for-profit company that will own the society’s cable TV channels, 127-year-old magazine, maps and other products. \nFox will own 73 percent of the new media company, called National Geographic Partners, with the non-profit organization holding the rest, under the accord announced Wednesday. The parties valued the deal at $725 million and said it will increase the society’s endowment to $1 billion. Declan Moore, a 20-year veteran of National Geographic, was appointed chief executive officer. \nThe proceeds, along with the continued ownership stake in the nature-oriented cable networks, will give the non-profit National Geographic Society added financial stability and double its resources for investments in science, research and education, according to the statement. Fox, based in New York, gains a majority interest in the organization’s studios, digital media, children’s media and other businesses. The film and TV company already had majority ownership of National Geographic’s cable channels. \n“We believe in the society’s mission of bringing the world to audiences through science, education and exploration,” James Murdoch, CEO of 21st Century Fox, said in the statement. \nWith the proceeds, the society plans to create the National Geographic Grosvenor Center for Education to improve the geographic skills of high school students, and establish centers of excellence in cartography, journalism and photography. \n“It’s a virtuous cycle,\" Gary Knell, the society’s current president and CEO, said in the statement. He will become the first chairman of National Geographic Partners under a shared governance arrangement with Fox.", "external_links": [], "published": "2015-09-10T01:55:00.000+03:00", "crawled": "2015-09-10T10:12:25.592+03:00", "highlightTitle": ""}