{"organizations": ["Voice Quality", "NCA Commends Vodafone"], "uuid": "63d9aa8718badfe39c9ca54bdc22aacb7a2c7637", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/gayheartmensah.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/640248/1/nca-commends-vodafones-voice-quality.html", "country": "US", "title": "NCA Commends Vodafone's Voice Quality", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "NCA Commends Vodafone's Voice Quality", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T19:44:00.000+03:00", "replies_count": 0, "uuid": "63d9aa8718badfe39c9ca54bdc22aacb7a2c7637"}, "author": "", "url": "http://www.modernghana.com/news/640248/1/nca-commends-vodafones-voice-quality.html", "ord_in_thread": 0, "title": "NCA Commends Vodafone's Voice Quality", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  2 September 2015 17:44 CET NCA Commends Vodafone's Voice Quality By Daily Guide \nGayheart Mensah, Director, External Affairs, Vodafone \nThe National Communications Authority (NCA) has placed Vodafone Ghana at the top of the pile in terms of voice quality based on its latest Quality of Service (QoS) test. \nThe NCA's periodic QoS test takes into account the technological efficiencies of all the telecom operators in the country as measured by a number of parameters. \nGayheart Mensah, Director of External Affairs at Vodafone Ghana, said the latest survey focused on the Central Region for the months of May and June and parameters measured included call set-up time, congestion rate, drop rate, call audio quality and coverage signal strength. \nThe statement explained that the company was ranked the highest among all the six mobile voice telecom operators in the country in the Mean Opinion Score for speech quality; chalking a figure of 3.8 on a scale of one to five where one equates to 'very bad' and five corresponds to 'excellent.' \nThe findings are also consistent with an earlier report by independent consulting firm P3 which ranked Vodafone as the best in voice clarity and 3G+ internet speed. \nThe P3 research measured parameters including call set-up, speech quality, as well as downloads and uploads speed. \nMr Mensah said: 'We welcome the findings from the NCA, which has shown consistency with the recent independent endorsement by P3 that ranked the network best in voice clarity and internet speed. \n'The bedrock of any telecommunication company is the quality of its network, and as the terrain continues to be competitive, we need to take our customer commitment to the next level and we will never renege on this.' \nThe NCA's QoS test is carried out in various localities and the results are often based on a lot of factors, including the perspective of users in that particular region.", "external_links": [], "published": "2015-09-02T19:44:00.000+03:00", "crawled": "2015-09-02T19:24:47.413+03:00", "highlightTitle": ""}