{"organizations": [], "uuid": "350a44a44b580e3a1feef7c38711077b983b0ee3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509181892.html", "country": "US", "title": "South Africa: Union Hopes for Sequestration of Aurora Directors", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Union Hopes for Sequestration of Aurora Directors", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T19:06:00.000+03:00", "replies_count": 0, "uuid": "350a44a44b580e3a1feef7c38711077b983b0ee3"}, "author": "", "url": "http://allafrica.com/stories/201509181892.html", "ord_in_thread": 0, "title": "South Africa: Union Hopes for Sequestration of Aurora Directors", "locations": ["South Africa", "Aurora Directors South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Carin Smith"], "text": "South Africa: Court Denies Leave to Appeal the Erroneous Grant of Refugee Status to an Alleged War Criminal By Carin Smith \nIn a final attempt to avoid having to cough up more than R1.7bn for debts of the Aurora gold mine, the Aurora directors have indicated that they plan to petition the Supreme Court of Appeal for leave to appeal, Gideon du Plessis, general secretary of union Solidarity, told Fin24. \nOn Friday the North Gauteng High Court in Pretoria denied the directors of Aurora Empowerment Systems leave to appeal a ruling that they are personally liable for the gold mine's debts. \nKhulubuze Zuma, Zondwa Mandela, Thulani Ngubani and Fazel and Solly Bhana applied for leave to appeal against an earlier judgment in terms of which they were held personally liable for the destruction of the Aurora/Pamodzi gold mines that cost 5 300 workers their jobs. Solidarity represents 189 of these workers. \nAurora Empowerment Systems was the parent company appointed by the Pamodzi liquidators to manage the Pamodzi mines in Springs and Orkney. However, in Solidarity's view the directors of the company \"destroyed both mines through looting and mismanagement\". \nAccording to Du Plessis, some of the former directors have already indicated in their appeal application that neither they nor their families have the financial means to pay the money. If they prove to be unable to comply with the order, jointly or severally, they could, therefore, be sequestrated, said Du Plessis. \nDu Plessis said that, while the legal team of the liquidators can now apply for an order of execution of the court judgment, the Supreme Court of Appeal would have to rule on the matter if the directors indeed petition that court. He reckoned a ruling could be expected within six weeks. \nDu Plessis believed the Aurora directors have a slim chance of success, because the judge in the High Court gave substantive reasons for denying their application for leave to appeal. \nIf the Supreme Court of Appeal dismisses the directors' application, then they immediately become liable for payments of up to about R2bn, said Du Plessis. That would be the R1.7bn in terms of the judgment obtained by the liquidators, as well as debt owed to the likes of Eskom (over R100m) and the SA Revenue Service (over R100m). \nSequestration \nThe next step would then be for their assets to be attached and sold to try and pay the debts. In Du Plessis' view this would probably mean that the former directors will be sequestrated if they cannot settle the debt. \n\"We are after sequestration, because then the insolvency inquiry and investigation will commence immediately and there will be a forensic audit about all their financial dealings from September 2009 when they took control of Pamodzi,\" explained Du Plessis. \n\"We have a strong feeling that some politicians will also be found to be part of these dealings. And if they plead poverty and it is discovered that they actually have a better financial status, then their perjury will be exposed too.\" \nIn order to avoid such a forensic audit, the only thing the former directors can do, in Du Plessis' opinion, is to reach an agreement with the liquidators and various creditors. Solidarity has already appointed a lawyer to commence consultations with the various Aurora directors to establish the possibility of a settlement for its members. \nAlthough the average claim of the Solidarity members is R51 000, Du Plessis said they understand that in terms of the relevant legislation, they could only get a maximum of R28 000 each. \n\"Our hope is to have payment for workers by December, because that would be their sixth Christmas since the start of this corruption saga,\" said Du Plessis. \n\"In the meantime we will obviously put pressure on the process to obtain an order for execution to be issued, because then a sheriff can make an inventory of their assets so that they do not try and dispose thereof.\" \nSource: Fin24", "external_links": [], "published": "2015-09-18T19:06:00.000+03:00", "crawled": "2015-09-18T19:31:52.184+03:00", "highlightTitle": ""}