{"organizations": [], "uuid": "27c0a770407c33edd9d0b88a677c709681449a3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/05/19/12961584/aotmp.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/AOTMP/Anatole/prweb12961584.htm", "country": "US", "title": "Anatole Targets AOTMP Efficiency First® Solution Certification", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Anatole Targets AOTMP Efficiency First® Solution Certification", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "27c0a770407c33edd9d0b88a677c709681449a3a"}, "author": "Lori Wildman", "url": "http://www.prweb.com/releases/AOTMP/Anatole/prweb12961584.htm", "ord_in_thread": 0, "title": "Anatole Targets AOTMP Efficiency First® Solution Certification", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AOTMP is pleased to announce the participation of Anatole in the Efficiency First® Vendor Solution Certification Program . During the Program, Anatole will align its solution capabilities with the Efficiency First® Framework, a standard for driving technical, financial and operational efficiency across enterprise fixed and mobile telecommunications environments.\nAnatole’s participation in the Efficiency First® Vendor Solution Certification Program serves as an outward symbol of its commitment to excellence and desire to provide unparalleled solutions to their clients and the telecom marketplace. Certification will be awarded upon meeting or exceeding top tier performance requirements.\n“By benchmarking Anatole’s Telecom Expense Management solution against the Efficiency First® Framework, the Program will allow Anatole to assess its capabilities and validate the value delivered to its clients,” said AOTMP SVP of Efficiency First® Adoption, Timothy C. Colwell. “AOTMP is excited to partner with Anatole as it builds its position as an enterprise mobility leader in Europe and expands globally; and highly anticipate its future Efficiency First® Solution Certification.”\n“As a global Telecom Expense Management vendor operating for more than 15 years, Anatole has partnered with AOTMP to gain independent verification of our current solutions, methodologies and processes from a recognized industry expert. It is also a great opportunity to raise Anatole's profile as a truly global supplier,” explained Raphael Vergnaud, VP Sales and Marketing. “The disciplined and best practice approach of Efficiency First® certification fits perfectly with our processes and methodologies which underpin our commitment to quality and value to our customers.”\nABOUT AOTMP\nAOTMP is an information services company that helps organizations take their fixed and mobile environment to a greater level of performance and helps telecom vendors achieve excellence in creating value for their clients. Using information and analytics to drive efficiencies, performance and productivity, business solutions are based on their patented Efficiency First® Framework . For more information, visit aotmp.com .\nABOUT ANATOLE\nAnatole provides solutions allowing enterprises to deal with key aspects of telecoms & mobility & IT: cost, policy, usage and assets. Anatole offers a market-leading Telecoms Expense Management solution and a Management Suite for analytics, reporting and management of all Telecoms and IT Assets including enterprise mobility solutions and other user/asset systems.\nAnatole has a complete offering from software solutions to consulting to managed services and professional services. Anatole manages 1.3 billion euros of telecom spending in more than 50 countries throughout the world; and over 150 customers rely on Anatole solutions. Anatole works directly with enterprises as well as mobile operators and systems integrators. For more information, please visit: http://www.anatole.net/en .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5lZmZpY2llbmN5Zmlyc3RkaXJlY3RvcnkuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5hb3RtcC5jb20=", "http://www.anatole.net/en", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2FvdG1wLmNvbS9lZmZpY2llbmN5LWZpcnN0Lw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5hbmF0b2xlLm5ldC9lbg=="], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T16:40:46.968+03:00", "highlightTitle": ""}