{"organizations": ["Host Ecowas"], "uuid": "15ad4c5defd29ef79789ac792ae2e75dafa9aa39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509213221.html", "country": "US", "title": "Nigeria: Okonjo-Iweala Gets New International Jobs", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Okonjo-Iweala Gets New International Jobs", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T20:21:00.000+03:00", "replies_count": 0, "uuid": "15ad4c5defd29ef79789ac792ae2e75dafa9aa39"}, "author": "", "url": "http://allafrica.com/stories/201509213221.html", "ord_in_thread": 0, "title": "Nigeria: Okonjo-Iweala Gets New International Jobs", "locations": ["West Africa", "Nigeria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "West Africa: Buhari to Host Ecowas Summit On Burkina Faso Crisis \nFormer Minister of Finance and Coordinating Minister of the Economy, Ngozi Okonjo-Iweala in the administration of former President Goodluck Jonathan has been hired by U.S. investment bank, Lazard Limited, as a senior adviser. \nOkonjo-Iweala, 61, will join as a senior advisor focusing on the bank's sovereign advisory group, Lazard said in a statement on Monday. \n\"She will bring a unique international expertise and experience that will benefit both our sovereign and corporate clients,\" Matthieu Pigasse, Lazard's global head of mergers and acquisitions and sovereign advisory, said in the statement. \nIn an earlier stint as finance minister of Africa's largest oil producer between 2003 and 2006, Okonjo-Iweala spearheaded talks that led the Paris Club group of creditors to write off $18 billion in debt. \nThe Harvard University-educated economist resigned from the cabinet in August 2006 after a demotion by former President Olusegun Obasanjo. In her more recent stint under Jonathan, she battled to cut government spending and bring order to an opaque fuel-subsidy payment system. \nOkonjo-Iweala, on Monday, also expressed joy over her new job on the board of Gavi, the vaccine group founded by Bill and Melinda Gates. \nOkonjo-Iweala wrote on her via her Twitter handle, @NOIweala: \"I'm excited to join GAVI to immunise 300 million more children in the next five years and save five million to six million more lives.\" Nigeria \nThe trial of the senate president Bukola Saraki over false assets declaration resumed this morning at the Code of … see more » Copyright © 2015 Daily Independent. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-21T20:21:00.000+03:00", "crawled": "2015-09-22T00:03:45.589+03:00", "highlightTitle": ""}