{"organizations": [], "uuid": "55fddf68dc4936fb61e752ab8a066c99a365a06f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/i/4/b/2/image.related.afrArticleLead.620x365.gjgx2z.png/1441777202623.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/the-dos-and-donts-of-winding-up-an-smsf-20150907-gjgx2z", "country": "AU", "title": "Dos and don'ts of winding up an SMSF", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Dos and don'ts of winding up an SMSF | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T11:58:00.000+03:00", "replies_count": 0, "uuid": "55fddf68dc4936fb61e752ab8a066c99a365a06f"}, "author": "Colin Lewis", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/the-dos-and-donts-of-winding-up-an-smsf-20150907-gjgx2z", "ord_in_thread": 0, "title": "Dos and don'ts of winding up an SMSF", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Consider your options before winding up your self-managed superannuation fund. Jessica Shapiro by Colin Lewis If you no longer want the responsibility of running a self-managed superannuation fund, or you're no longer able to (you might be bankrupt or heading overseas for more than two years and so unable to act as a trustee/member) then you need to consider your options.\nAn alternative to winding-up your fund may be to appoint a legal personal representative (LPR) under an enduring power of attorney to act in your place. This may be useful if you're going overseas for more than two years. However, a LPR cannot take over trustee responsibilities if you've become a bankrupt.\nAs your LPR replaces you as a trustee/director of corporate trustee, it's vital you choose the right person as they may have total control of your fund. They're not merely your agent and while they have a duty to act in your best interest as a member, your LPR does not have to follow your instructions.\nIf you want to keep your SMSF but wish to relinquish the trustee responsibilities, you could convert it to a small APRA fund (SAF) – regulated by the Australian Prudential Regulation Authority rather than the Australian Tax Office – and appoint an approved trustee. This may allow you to keep the same investments, without the responsibility. The trustee will, however, charge a fee and may limit the investment flexibility otherwise available to you.\nAssets unable to be transferred, such as \"frozen assets\", real property or collectables, will need to be sold or taken as a benefit payment. Jessica Shapiro So, if you're winding up your SMSF, you have two options: you can transfer the fund to another complying super fund, such as a retail fund or SAF, or take your money, provided you've met a condition of release (COR), and invest outside super.\nBut winding up your SMSF may have implications, including capital gains tax (CGT) and stamp-duty liabilities from the disposal of certain assets and the cessation of insurance policies held by the fund.\nAny assets unable to be transferred, such as \"frozen assets\", real property or collectables, will need to be sold or taken as a benefit payment, provided a COR is met.\nThe allocation of fund reserves to members can affect their contribution caps, while a change in control means you'll need to ensure new arrangements are in place. In other words, death benefit nominations and wills may need to be updated.\n Furthermore, there may be a reassessment by Centrelink and possible reduction in benefits resulting from the rollover of account-based pensions, and a potential loss of Centrelink's favourable assets test treatment.\nAnd be aware, winding up is time-consuming and will not happen overnight.\nBe prepared for delays.\nNow, for a brief rundown of the process.\nCheck the deed and convene trustee meeting. Consult the fund's trust deed to determine if there's any specific winding-up procedure that must be followed and hold a trustee meeting to discuss, approve and minute the winding up. Calculate any outstanding expenses, taxes and refunds. As the costs of administration and winding up are the first priority, you must provide for accounting, audit, actuarial, legal, and administration fees for work done and still to be done, as well as current and estimated future tax liabilities, including CGT on the disposal of assets You should ensure receipt of, and record, outstanding income, including the refund of excess franking credits. Dispose of assets and calculate member entitlements. You may need to sell assets. Super law requires all transactions be done at an arm's length – on commercial terms at market values. The proceeds will determine your entitlements (after fees and taxes) and a reconciliation of member balances to net fund assets should be made. Remember that selling assets or an in-specie payment to another fund or yourself is a CGT event and must be accounted for in the final return. If a defined benefit pension is being run, an actuary must calculate the commutation value. Transfer entitlements to another fund / pay out benefits. Benefits may be paid as cash or as an in-specie transfer where allowed and possible. You should provide in writing details of the fund to which you want your benefits transferred. Alternatively, if you've met a COR, you may cash out your benefits. If you're running a pension, ensure that the pro-rated minimum pension amount is paid before rolling over or cashing out. You must ensure tax is withheld from payments and reported to the ATO, if relevant. You're still entitled to any amounts received by the fund after a benefit payment and they must be accounted for. Pay outstanding expenses and tax. For simplicity, amounts for outstanding expenses and tax could be held in a non-interest bearing account to avoid the need to distribute income, account for tax and to do an annual return. A second benefit payment may be required to clear any remaining funds if expenses have been overprovided for, or if there are further amounts received such as excess franking credits. Complete final accounts and annual return. You must ensure all tax and reporting obligations have been met at the time your SMSF is wound up, including lodging the fund's final annual return once the final audit is completed, completing PAYG summaries for members under age 60 receiving a pension, issuing benefit payment summaries where benefits have been paid to members and meeting any outstanding tax obligations and the ATO supervisory levy. You should wait until your SMSF has no assets and liabilities before lodging the final returns. Notify the regulator and members.The ATO must be notified within 28 days of the fund winding up. Also, the members must be notified, but it's likely this will have been met at the trustee meeting. Following the winding up of your SMSF, bank accounts can be closed and, if there's a corporate trustee, it may have to be deregistered. Finally, wait for the ATO to confirm that it has cancelled the fund's ABN. And remember, even though you may no longer have a SMSF, you'll still need to keep the fund's records for up to 10 years. Colin Lewis is head of strategic advice at Perpetual Private.", "external_links": [], "published": "2015-09-08T11:58:00.000+03:00", "crawled": "2015-09-09T10:22:59.818+03:00", "highlightTitle": ""}