{"organizations": [], "uuid": "0bf2b2696561c03a137a98dbf23792d6c3201278", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/Apple-iPad-Pro-Ret.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/tech/apple-event-live-bigger-ipad-announced-by-tim-cook-at-monster-event-price-starts-799/133281", "country": "IE", "title": "Apple Event Live: Bigger iPad announced by Tim Cook at ‘monster’ event; price starts $799", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Apple Event Live: Bigger iPad announced by Tim Cook at ‘monster’ event; price starts $799 | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T07:34:00.000+03:00", "replies_count": 0, "uuid": "0bf2b2696561c03a137a98dbf23792d6c3201278"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/tech/apple-event-live-bigger-ipad-announced-by-tim-cook-at-monster-event-price-starts-799/133281", "ord_in_thread": 0, "title": "Apple Event Live: Bigger iPad announced by Tim Cook at ‘monster’ event; price starts $799", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles No shoppers’ stop: Crisil Trai offers 15-day deadline for telcos to minimise call drops L&T not in hurry to fill top post, says AM Naik Apple Event Live: Apple Inc announced a bigger iPad – ‘iPad Pro’ – with a new keyboard and stylus aimed at business customers. Chief Executive Tim Cook promised a day of “monster” news on Wednesday, but shares of the company remained nearly flat as executives showed off the iPad, which will be priced starting at $799.\nCook began by talking up the Apple Watch, saying customer satisfaction for the new product was 97 percent. Apple is working with French luxury goods maker Hermes on a new watch collection, and Facebook Messenger is coming to the device, he added.\nHe then rolled out the ‘iPad Pro’ with a 12.9 inch screen and said it had performance similar to a desktop computer. Apple showed off a “smart” keyboard and a stylus called “Pencil”.\nApple said it had partnered with Cisco Systems Inc and IBM to help power the iPad pro, which it said is up to 1.8 times faster and has a 10-hour battery life. Many people on Twitter seemed unimpressed by the new iPad and lamented its large size, however.\nShares of Apple were up less than 1 percent at $112.68.\nCook promised “monster announcements” at the event, which is also expected to feature an updated version of its Apple TV device and of its iPhones, which drove nearly two-thirds of the company’s $49.6 billion in revenue in the most recent quarter.\nApple is widely expected to keep the size of the phones the same but upgrade it with an improved camera and Force Touch, a display technology that responds differently depending on how hard users press their screens.\nA year after Apple rolled out iPhones with larger screens, touching off a frenzy of sales that saw revenue in the most recent quarter increase 32.5 percent from the same quarter a year ago, the latest upgrades may leave some investors and consumers underwhelmed.\n“It’s getting harder and harder for Apple to compete against itself,” said analyst Bob O’Donnell of TECHnalysis Research. Apple shares are up more than 14 percent over the last year, although they are down nearly 12 percent in the last three months.\nFortunately for Apple, most consumers buy smartphones under a two-year upgrade cycle, meaning the company will still likely scoop up a lot of sales, said analyst Patrick Moorhead of Moor Insights & Strategy.\n“The key point of reference is not how the new phone compares to the iPhone 6, it’s how it compares to the iPhone 5s,” he said.\nExpectations have been rising for an revamped Apple TV, a set-top box that has seen few significant updates since its release in 2007. Although Apple has yet to hammer out deals for a long-awaited television service, analysts say the company is poised to overhaul the hockey-puck-sized device.\nThe device is expected to gain an App Store and an interface that allows users to make requests through the Siri digital assistant and search for specific programs and movies across apps. The company may also discuss the device’s role as a hub for gaming.\n“It’s a big day for the big screen!” Apple Senior Vice President Eddy Cue tweeted before the event.\nNearly 20 percent of U.S. broadband households own at least one streaming media player, and Apple has a long way to go in the market, according to data from research firm Parks Associates.\nRoku is the leader in streaming media boxes, accounting for 34 percent of all streaming devices sold in the United States in 2014, according to data from research firm Parks Associates. Google Inc’s Chromecast and Amazon .com Inc’s Fire TV were next. The Apple TV box came in fourth.\n“It’s important that (Apple) come out and really get up to date and potentially eclipse some of the other living room devices out there,” Moorhead said.\nFirst Published on September 09, 2015 11:34 pm", "external_links": [], "published": "2015-09-10T07:34:00.000+03:00", "crawled": "2015-09-10T02:35:03.522+03:00", "highlightTitle": ""}