{"organizations": [], "uuid": "4ebe7626fb3627b691c3792598d537876eb809c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiplinger.com", "main_image": "http://www.kiplinger.com/kipimages/pages/13897.jpg", "site_section": "http://www.kiplinger.com//about/rss/kiplinger.rss", "section_title": "Kiplinger's Personal Finance", "url": "http://www.kiplinger.com/article/insurance/T027-C000-S002-get-the-most-from-your-health-plan.html?rss_source=rss", "country": "US", "title": "Tactics to Get the Most From Your Health Plan in 2016", "performance_score": 0, "site": "kiplinger.com", "participants_count": 0, "title_full": "Tactics to Get the Most From Your Health Plan in 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T07:00:00.000+03:00", "replies_count": 0, "uuid": "4ebe7626fb3627b691c3792598d537876eb809c9"}, "author": "", "url": "http://www.kiplinger.com/article/insurance/T027-C000-S002-get-the-most-from-your-health-plan.html?rss_source=rss", "ord_in_thread": 0, "title": "Tactics to Get the Most From Your Health Plan in 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tactics to Get the Most From Your Health Plan in 2016 Costs are rising, but you may find more ways to save. Follow @Kiplinger Thinkstock \nWhether you get coverage through your employer or on your own, it’s time to pick your health plan for 2016. Premiums and out-of-pocket costs continue to rise (not always in obvious ways), but you may find new incentives that can help contain your costs. See Also: 50 Ways to Cut Your Healthcare Costs \nLarge employers expect their health care tab to increase by about 5% for 2016, according to the National Business Group on Health. They plan to pass along some of the increase to employees, particularly when it comes to dependents; employees should now expect to contribute 20% of their own premiums and 24% for their dependents (higher-income employees may pay more). About one-third of employers plan to add a surcharge for spouses who could get coverage elsewhere. \nBecause of the Supreme Court decision that same-sex couples have a constitutional right to marry, nearly one-fourth of employers who offer domestic partner coverage specifically for same-sex couples plan to drop that benefit for 2016, according to a survey by human resources consultant Mercer. Affected same-sex couples would need to marry to continue coverage for a partner. Among companies that offer domestic partner benefits to both same-sex and opposite-sex couples, 8% plan to drop the benefit this year. Advertisement \nEmployers continue to give employees a stake in controlling costs: 83% of large employers plan to offer a consumer-directed health plan in 2016, in most cases high-deductible health insurance paired with a health savings account; 33% will make it their only option. More than half contribute to employees’ HSAs, giving them tax-free money for medical expenses; some add more if you participate in a wellness program to stop smoking or lose weight, for example, or take a health risk assessment. “Wellness incentives can put money in your pocket,” says Sandy Ageloff, of Towers Watson, a benefits consulting firm. \nMany insurers are adding telemedicine—doctor’s appointments either over the phone or online—as a way to provide lower-cost care in certain situations. A telemedicine doctor’s appointment may cost $40 or $50, while an actual office visit might cost $150. \nHigh-priced specialty drugs are the fastest-growing portion of employers’ medical costs. You may have to pay 30% or more of the cost of these drugs or face hurdles before they’ll be covered. You may be required to try a lower-cost medication first or to get preauthorization. Before switching plans, check if your meds are covered and compare out-of-pocket costs and special requirements. Look for discounts at preferred pharmacies. \nMany of these trends will be more pronounced if you buy health insurance on your own. Open enrollment for individual health insurance runs from November 1 to January 31. It’s important to compare your options, because some insurers are increasing premiums much more than others. New insurers are entering the market in several states, and you may get a different premium subsidy based on changes in your income and premiums in your area. Provider networks continue to shrink, so make sure your doctors are included. \nIf you don’t have coverage, there’s more incentive to get it: The penalty for not having insurance in 2016 jumps to $695 per person or 2.5% of yearly household income, whichever is larger.", "external_links": [], "published": "2015-09-30T07:00:00.000+03:00", "crawled": "2015-09-30T15:57:08.775+03:00", "highlightTitle": ""}