{"organizations": [], "uuid": "33679cc9e078743dd2ca845e38734073305ce7ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/04/bayer-covestro-ipo-idUSL5N11A0HY20150904", "country": "US", "title": "UPDATE 1-Bayer to launch Covestro IPO, eying 2.5 bln euros", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Bayer to launch Covestro IPO, eying 2.5 bln euros | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T11:56:00.000+03:00", "replies_count": 0, "uuid": "33679cc9e078743dd2ca845e38734073305ce7ad"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/04/bayer-covestro-ipo-idUSL5N11A0HY20150904", "ord_in_thread": 0, "title": "UPDATE 1-Bayer to launch Covestro IPO, eying 2.5 bln euros", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* 2.5 bln eur IPO volume targeted, or about a quarter of shares\n* Parent Bayer to focus on healthcare, vet drugs and pesticides\n* Plans to carry out IPO in Q4 (Adds projected IPO volume, background on parent Bayer)\nFRANKFURT, Sept 4 (Reuters) - Bayer's Covestro, Europe's fourth-largest chemicals maker, plans to launch an initial public offering in the fourth quarter, aiming to raise roughly 2.5 billion euros ($2.8 billion) in new capital as its parent focuses on drugs and pesticides.\nThe offering will consist only of new shares but the proceeds will primarily serve to repay loans to Bayer, lowering Covestro's overall net debt including pension liabilities to 2.5-3.0 times adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) for 2015, Bayer said in a statement.\nSeveral people familiar with the plans said Bayer was guiding investors for an issue volume of roughly 2.5 billion euros, accounting for a quarter of Covestro's targeted equity value of about 10 billion euros or more, but the exact figures would depend on market future conditions.\nA spokesman for Bayer, whose stock was down 2.4 percent, declined to comment on the volume.\nBayer unveiled plans about a year ago to split off its plastics business, formerly known as Bayer MaterialScience, to focus entirely on healthcare, veterinary medicine and farming pesticides, shedding parts of the market discount that diversified listed groups are typically burdened with.\nLowering its debt will give Bayer more firepower to grow in these so-called life science businesses. It has said it was anticipating consolidation in the crop chemicals and seeds industry and it also has costly drug development and marketing campaigns to fund. ($1 = 0.8977 euros) (Reporting by Ludwig Burger , Arno Schuetze and Patricia Weiss; editing by Thomas Atkins)", "external_links": [], "published": "2015-09-04T11:56:00.000+03:00", "crawled": "2015-09-04T11:04:02.599+03:00", "highlightTitle": ""}