{"organizations": [], "uuid": "9fff9046cd33fabc890c63d5de18c93f13a28878", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/narayana-murthy-s-reuters.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/companies/wrong-policies-hit-indias-chances-to-lead-in-hardware-narayana-murthy/137342", "country": "IE", "title": "Wrong policies hit India’s chances to lead in hardware: Narayana Murthy", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Wrong policies hit India’s chances to lead in hardware: Narayana Murthy | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T00:29:00.000+03:00", "replies_count": 0, "uuid": "9fff9046cd33fabc890c63d5de18c93f13a28878"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/companies/wrong-policies-hit-indias-chances-to-lead-in-hardware-narayana-murthy/137342", "ord_in_thread": 0, "title": "Wrong policies hit India’s chances to lead in hardware: Narayana Murthy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Brad Pitt splurges 250,000 pounds for motorbike Hero buys Firefox, eyes premium market Havells sets up its first home appliances plant in India Infosys co-founder Narayana Murthy has singled out “erroneous policies” pursued by successive governments at the Centre for constraining India’s massive potential to lead in the hardware sector.\n“Though India has made rapid strides in the software sector, it lags in the hardware sector,” Murthy said here last night while speaking at a felicitation programme.\nThe 69-year-old IT czar was conferred with the Lifetime Achievement Award by the Nagpur chapter of the Engineers Forum on the occasion of Engineers Day celebrations.\n“Though India had the potential to lead the world, it had lost this precious opportunity in the past following erroneous policies pursued by successive governments at the Centre at that time,” Murthy said.\n“As far as production of hardware is concerned, China is billed as the factory of the world. India too possessed a similar potential. However, policies by the central government between 1975 and 1991 put India on the backburner,” Murthy, who is dubbed as the father of Indian IT industry, noted.\n“Despite this, India rules the software sector all over the world, which has given it a unique confidence and edge,” Murthy said, attributing it to the 24X7 work model.\nAs a result, it has become “the largest job provider”.\nHe suggested that India should adopt multi-culture system and recruit people from all over the world to make further progress in this direction.\nPainting a grim picture, Murthy said engineering colleges in India are churning out only 25 per cent quality engineers. “If India were to improve standard of engineering colleges, they must be given full autonomy,” Murthy added. On growth of IT industry, he said it is the biggest employer in India today, generating employment for 2,000 people every year.\nIn fact, the segment has displaced the public sector as the largest creator of jobs, which in turn has stimulated the economy. “All these achievements are being undone as engineering education in country is not up to the mark,” he regretted.\nHe also Quote: d the McKinsey report which said only 25 per cent of engineering graduates are employable.\n“This should be an eye-opener for us… the need is to tone up the education sector as the quality of our engineers is below average,” Murthy added.\n 17, 2015 4:29 pm", "external_links": [], "published": "2015-09-18T00:29:00.000+03:00", "crawled": "2015-09-17T22:46:21.357+03:00", "highlightTitle": ""}