{"organizations": [], "uuid": "b73e16b67640c197c5c31c5477a624236bb24131", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/7/p/2/1/image.related.articleLeadwide.620x349.gjdy3w.png/1441232096741.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/markets/currencies/shrinking-currency-reserves-to-slow-tightening-of-global-monetary-policy-20150902-gjdy3w.html", "country": "AU", "title": "Shrinking currency reserves to slow tightening of global monetary policy", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Shrinking currency reserves to slow tightening of global monetary policy", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "b73e16b67640c197c5c31c5477a624236bb24131"}, "author": "Simon Kennedy", "url": "http://www.smh.com.au/business/markets/currencies/shrinking-currency-reserves-to-slow-tightening-of-global-monetary-policy-20150902-gjdy3w.html", "ord_in_thread": 0, "title": "Shrinking currency reserves to slow tightening of global monetary policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deutsche Bank predicts 2015 will mark the peak of reserve accumulation after two decades of growth. Photo: Bloomberg\nThe great global monetary tightening of 2015 is under way, but it's not being led by the Federal Reserve.\nEven as US policy makers ponder whether to raise interest rates this month, one recent source of central bank liquidity in financial markets is drying up and the loss of it partly explains August's trading volatility.\nBehind the drawdown are the foreign exchange reserves run by the central banks. Bolstered following financial crises in the late 1990s as a buffer against capital outflows and falling currencies, such hoards fell to $US11.43 trillion in the first quarter from a peak of $US11.98 trillion in the middle of last year, according to the International Monetary Fund.\nDriving the decline is a combination of forces including the economic slowdown and recent devaluation in China, the Fed's pending rate hike, the collapse of oil and decisions in Switzerland and Japan to cease intervening in currencies.\nAdvertisement Each means central banks are either paring their reserves to offset an exit of capital or manage currencies, have less money flowing into their economies to salt away or no longer need to sit on as much. Whichever it is, the shrinking of reserves means much less money flowing into the financial system given authorities tended to recycle their cash piles into local currency or liquid assets such as bonds.\nIn the words of Deutsche Bank strategist George Saravelos and colleagues, welcome to the world of \"quantitative tightening\".\nThey predict 2015 will mark the peak of reserve accumulation after two decades of growth with China in the vanguard as its new currency regime means it has to pare reserves to avoid a freefall in the yuan. It has already reduced its holdings to $US3.65 trillion from $US3.99 trillion in 2014.\nFor markets, Deutsche Bank says less reserve accumulation should mean higher bond yields and a rising US dollar against rivals including the euro and yen. There are implications too for other central banks if the resulting rise in market borrowing costs hampers their ability to tighten monetary policy.\n\"This force is likely to be a persistent headwind towards developed market central banks' exit from unconventional policy in coming years, representing an additional source of uncertainty in the global economy,\" Saravelos and colleagues in a report to clients on Tuesday. \"The path to 'normalisation' will likely remain slow and fraught with difficulty.\" ﻿", "external_links": [], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-03T05:23:59.045+03:00", "highlightTitle": ""}