{"organizations": ["Central Excise and Service", "BMR & Associates", "Central Board of Excise and Customs"], "uuid": "afb7d4a1d018b4143d4bfa4e4c01d67a0e0771f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneycontrol.com", "main_image": "http://www.moneycontrol.com/news_image_files/2015/356x200/i/income_tax_356X200_2309_356.jpg", "site_section": "http://www.moneycontrol.com/rss/pfcolumns.xml", "section_title": "Moneycontrol Personal Finance Columns", "url": "http://www.moneycontrol.com/news/tax/early-closureservice-tax-disputes-reality-or-farce_3214161.html", "country": "IN", "title": "Early closure of service tax disputes: Reality or farce", "performance_score": 0, "site": "moneycontrol.com", "participants_count": 0, "title_full": "Early closure of service tax disputes: Reality or farce", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T12:57:00.000+03:00", "replies_count": 0, "uuid": "afb7d4a1d018b4143d4bfa4e4c01d67a0e0771f8"}, "author": "", "url": "http://www.moneycontrol.com/news/tax/early-closureservice-tax-disputes-reality-or-farce_3214161.html", "ord_in_thread": 0, "title": "Early closure of service tax disputes: Reality or farce", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Poonam Harjani", "Priyanka Rathi", "Rajeev Dimri"], "text": "Sep 23, 2015, 03.27 PM | Source: Moneycontrol.com Early closure of service tax disputes: Reality or farce Concept of oral SCN envisaged in the Circular does not seem to work much in favour of the tax payer. Clause regarding conclusion of proceedings, on settlement of dispute, in a way adds credibility to the government’s new initiative to settle tax disputes. The same is also likely to encourage statutory compliance by the tax payer. Like this story, share it with millions of investors on M3 Early closure of service tax disputes: Reality or farce Concept of oral SCN envisaged in the Circular does not seem to work much in favour of the tax payer. Clause regarding conclusion of proceedings, on settlement of dispute, in a way adds credibility to the government’s new initiative to settle tax disputes. The same is also likely to encourage statutory compliance by the tax payer. Post your opinion here Rajeev Dimri Recently, with a view to encourage statutory compliance by the taxpayers and facilitate expeditious dispute resolution, the penalty provisions under Central Excise and Service Tax laws have been simplified by the Finance Act, 2015 (“Act”). Now, the tax payer can pay the reduced amount of penalty in case of tax payment defaults irrespective of whether or not such default is fraught with mens-rea, though the cap on penalty in case of case of fraudulent conduct by the tax payer is higher, and logically so. However, a beneficial provision, where one could claim total relief from penalty, in cases involving bona-fide belief stands deleted by the present amendment. This has been a major blow to the tax payers and now there exists no room for claiming absolute relief from penalty once the show cause notice (“SCN”) is issued. Under the amended penalty provisions, though one cannot claim absolute immunity from penalty but enough incentive has been provided for early closure of disputes in case of bona-fide defaults. Prior to these amendments, the benefit of reduced penalty post issuance of SCN was available in case of willful evasion of tax but the same was not applicable to the case where non-payment of tax was due to genuine oversight or mistake. This lead to the dichotomy to the extent that the penalty for bona-fide omission cases, on many occasions, worked out more than the penalty applicable for cases involving fraud and suppression.The rationalized penalty provisions now treat the genuine cases of default more leniently and incentivize settlement of the dispute at the earliest possible stage. The gist of the changes made in the penal provisions vide the Act can be summarised as follows:•Where the case involves non-wilful evasion of tax, no penalty is payable, if the tax along with interest is paid within 30 days or before the issue of SCN. The maximum penalty in such cases has been capped at 10% of the total service tax demand. Further, if tax and interest is paid within 30 days of the communication of the order, then the tax payer has the option of paying reduced penalty of 25% of the penalty confirmed in the order. However, this benefit can be availed, only when the 25% penalty is also paid within 30 days of the order. •Where the case pertains to wilful evasion of duty, penalty of 100% of the tax demand is payable. Further, taxpayer has the option to pay reduced penalty of 15% if tax and interest is paid within 30 days of issue of SCN. Further, in this case also, the tax payer has the option of paying reduced penalty of 25% of the penalty confirmed in the order within 30 days of the communication of order.A look at these amended provisions clearly indicates that the government is making a concerted effort to incentivize the taxpayers who are bona fide or having realized their mistake, want to settle the dispute with the department. The amended provisions identify various stages where the tax payer can opt to settle the dispute with the government. Starting from the stage of detection of tax evasion by the authorities till the passage of the order by the adjudicating authority, the taxpayer has been given the option to mend its ways. Having opted for payment of tax, interest and a reduced penalty, the said exercise would be in vain if the proceedings against the tax payer were still to continue. Therefore, the new penal provisions also envisage the conclusion of proceedings on settlement of dispute at the stage of SCN. Further as per the existing provisions, no SCN would be served, if taxpayer pays the dues with interest on its own ascertainment and duly informs the department about the same. However this option is available to the tax payer only where there is no wilful evasion of tax / duty. Thus, there was ambiguity as to whether in cases involving wilful evasion of tax, is it mandatory for the department to issue SCN? Recently the Central Board of Excise and Customs (“CBEC”) has issued Circular F.No. 137/46/2015-Service Tax dated - August 18, 2015 (“Circular”) whereby this issue has been sought to be clarified.The Circular mentions that in a case involving the extended period of limitation, the tax payer can request for waiver of a written SCN after settling the tax liability. In such a case, the issuance of SCN would be oral and if the tax payer desires, the representation against SCN can also be oral. However, the pre-condition for the waiver of SCN is that request of waiver should be made in writing and the tax payer should also accept the grounds of short payment alleged by the department. By avoiding a written SCN, the taxpayer will have an expeditious settlement of dispute but the requirement to accept ground of short payment may be self-incriminatory and the tax payer would lose the right to litigate penalty or invocation of extended period in such cases in absence of SCN.It has been further clarified in the Circular that if the dispute between the taxpayer and the department is settled in aforesaid terms then the proceedings will be deemed to be concluded. In such case, the department has to formally communicate the closure of the proceedings by way of a written intimation to the taxpayer.Whilst the rationalized penal provisions and the clarifications in the Circular offer an opportunity for the taxpayers to settle the claims expeditiously with the department without much hassle, scepticism still prevails in the minds of the taxpayer regarding the practical applicability of the same. The concerns mainly relate to the cases involving extended period of limitation. A new controversy may also arise around the issue of issuance of oral SCN. As discussed above, the concept of oral SCN envisaged in the Circular does not seem to work much in favour of the tax payer. Having said this, the clause regarding conclusion of proceedings, on settlement of dispute, in a way adds credibility to the government’s new initiative to settle tax disputes. The same is also likely to encourage statutory compliance by the tax payer. However, if the dispute is sought to be settled post passing of the adjudication order, there is no clarity regarding closure of proceeding. Thus, in such a case, the ambiguity still persists, if it would be open to the taxpayer to contest the demand in appellate proceedings. As there is no specific bar in the law, the taxpayer should be able to pursue appellate remedies after paying 25% of the penalty confirmed in the Order. Author is leader, Indirect Tax, BMR & Associates LLP Poonam Harjani and Priyanka Rathi contributed to this article Views are personal.", "external_links": [], "published": "2015-09-23T12:57:00.000+03:00", "crawled": "2015-09-23T19:36:57.956+03:00", "highlightTitle": ""}