{"organizations": [], "uuid": "2734b1ad7949bd135b9e21295b78e109b6540041", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l.yimg.com/bt/api/res/1.2/JfMcinbnv5E9XdycIN2_dg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://media.zenfs.com/en-US/video/video.pd2upload.com/video.yahoofinance.com@b9ca48fc-eedd-30d6-87f4-84a9b9d0c44c_FULL.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/4-things-know-tesla-model-130653525.html", "country": "GB", "title": "4 things to know about Tesla’s Model X - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "4 things to know about Tesla’s Model X - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 1, "uuid": "18561f9a84aca2970e338c37c58e8ebb9cbd2d64"}, "author": "Claudia Assis", "url": "http://finance.yahoo.com/news/4-things-know-tesla-model-130653525.html#post-0", "ord_in_thread": 0, "title": "4 things to know about Tesla’s Model X - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tesla to unveil Model X SUV\nNow watching   Next video starts in : 7 Play \nTesla to unveil Model X SUV\n Replay video Up next Tesla's Model X will be a 'segment buster': Analyst \n   Up next   Tesla's Model X will be a 'segment buster': Analyst \nFinance Video\n1\n 3:11 \nNow watching Up next Tesla to unveil Model X SUV \nCan Tesla&#39;s new offering boost sales?\n2\n 4:14 \nNow watching Up next Tesla's Model X will be a 'segment buster': Analyst \nJessica Caldwell, senior analyst at Edmunds.com, says factors such as the lack of an all battery-electric SUV indicate positive sales for Tesla&#39;s new Model X.\n3\n 4:27 \nNow watching Up next Tesla: Auto-Driving Cars Coming in Three Months \nTesla announced that its cars will be able to drive them following an update in the next three months. WSJ&#39;s Mike Ramsey reports. Photo: Tesla\n4\n 2:06 \nNow watching Up next Tesla Model S upgrades range and more \nCNBC&#39;s Phil LeBeau reports the electric automaker is adding several upgrades to its Model S vehicle, including increasing the driving range to 240 miles.\n5\n 3:12 \nNow watching Up next Tesla hints at Model S upgrades \nTesla CEO Elon Musk tweeted that the car will receive an update that will &quot;end range anxiety.&quot;\n6\n 1:24 \nNow watching Up next Volkswagen Scandal Tarnishes Hard-won US Reputation as Green Company \nWhen Ashley Scarpa, a Lakeland, Florida, restaurateur and environmental volunteer, bought a Volkswagen Passat diesel last year she thought she was doing her bit for the planet. Now she feels like a jilted lover. After revelations that VW gamed its emissions monitors to make 11m of its cars seem greener than they were – a move that may be responsible for adding nearly 1m tonnes of air pollution every year – she is understandably upset. In the meantime, she has no choice but to keep driving the car she thought was an environmentally sound choice when she chose it over hybrid models. Ashley said, “I’m disgusted that I have to drive my polluting vehicle two hours on the freeway to get there.” Scarpa is not alone. Volkswagen is still a niche player in the US, where it has done much to promote its image as a green company. Until the scandal broke the company was running ads that depicted Tanner Foust, a Volkswagen rally driver and host on Top Gear USA, driving elderly women around in a TDI Volkswagen. The spots were meant to dispel myths about diesel, that they were dirty and loud. All of VW’s clean diesel ads have now been removed from the automaker’s official YouTube channel.\n7\n 1:08 \nNow watching Up next National coffee day fast facts \nHere are some things you didn&#39;t know about coffee\n8\n 1:55 \nNow watching Up next The hidden costs of homeownership \nEgypt Sherrod, host of HGTV&#39;s &quot;Flipping Virgins&quot; shares how you can prepare for unexpected expenses when owning a home.\n9\n 1:28 \nNow watching Up next Can you identify these famous voices? \nBig name celebrities are jumping into the TV commercial game. Can you put the names to these familiar voices?\n10\n 3:06 \nNow watching Up next Hotels invest in upgrades at record levels \nHotel companies across the U.S. are investing at record levels to upgrade rooms and lobbies.\nLoad More >\nMuch-awaited SUV rolls out of Tesla factory Tuesday\nBloomberg MA MB MC MD ME MG ZF ZG ZQ ZR ZS ZT ZU\nIt’s almost here. After delays and much hand-wringing, the first Tesla Motors Inc. all-electric Model X vehicles will roll out of the company’s Fremont, Calif., factory door on Tuesday.\nTesla ( TSLA ) will mark the occasion with an event scheduled to start at 7 p.m. Pacific. The press invitation was quite simple (a shadowed Model X with its falcon wings up); the event is unlikely to be so subdued.\nTesla has wanted to make an SUV for some time, and even expressed that wish before the first Model S sedans were on the road.\nWhen Tesla executives were making the rounds ahead of the company’s 2010 initial public offering, their slide show presented four body possibilities based on the same car platform: a sedan as well as an SUV, a cabriolet, and a van.\nWhile the cabriolet and van never materialized, the SUV concept was spot on. SUVs, including compact SUVs, have been gaining ground over other car body types in the last few years.\nSee also: Tesla’s secret weapon in the battle for luxury car market may be women\nThe Model X is more than a year behind schedule, but investors don’t appear to mind. Tesla shares are up 18% so far this year, and have gained 6.2% in the past 12 months. They have lost some ground in the past three months (down 2.5%), but that performance compares with losses of 5.5% for the S&P 500 index ( ^GSPC )  so far this year, losses of 1.1% in the last 12 months, and a crushing retreat of 7.5% for the index in the past three months.\nHere’s what you should know about the Model X:\nPatience is a virtue \nBuyers reserving their Model X now can expect to get the car in early 2016, according to Tesla’s website. They also have to shell out $5,000 to reserve the car, which is double the amount for buyers looking to reserve a Tesla Model S (such buyers are looking at a November delivery date for their sedans.)\nThe wait was even longer for the early adopters, who made the first reservations in 2012. Think the $5,000 reservation deposit is pricey? Those who wanted the fully loaded “Signature” version had to put down $40,000 to reserve their car.\nIt’s a pretty price \nWhich takes us to price. Tesla has not disclosed base prices for the X. When the owners of those first “Signature” models received their invitations to configure their cars, however, it became known that those one-of-a-kind founders’ cars would cost at least $132,000 ($144,000 with add-ons such as the “ludicrous” speed mode and other accessories. For more on those, see below)\nTeslamotorsclub.com A screenshot of Tesla Motors Club blog showing the specs for a Model X Signature series. D MA MB MC MD ME MG ZQ ZR ZT ZU\nChief Executive Elon Musk took to Twitter earlier this month to defend the price disparity between a Model S (which starts at $75,000 for a base model with a less powerful battery) and X:\nhttps://twitter.com/elonmusk/status/639170376186990592\nWhat you get for that money \nDuring Tesla’s second-quarter earnings call in August, Musk called the seats in the Model X “a sculptural work of art.” Those were harder to figure out, he said, than the falcon wings, which have been a distinct characteristic of the Model X from the get-go.\nMusk has said the Model X is “maybe the hardest car in the world to build.”\nFrom the early invitations to configure the cars we know the seats in the Model X will be “independently operable,” although it is not clear what that means.\nThe X, like the top-of-the-line Model S P85D, can also be upgraded to the “ludicrous speed” mode, which makes the cars faster — they can go 0-60 miles per hour in 2.8 seconds rather than 3.1 seconds.\nHow it affects Tesla \nWith the Model X, Tesla is targeting families and hoping well-heeled households will have both the Model X and the Model S in their garages.\nThe Model X is a continuation of Tesla’s goal to churn out attractive, fast electric cars on its way to achieve its ultimate goal —to produce an electric car for the masses and to reach production of half a million cars by the end of this decade.\nThe Model 3, that mass-market car, is expected to come to market in two to three years.\nThere have been hiccups: In August, Tesla dialed down its own prediction for 2015 deliveries, from 55,000 to a range of 50,000 to 55,000 cars. Deliveries are Tesla’s proxy for sales.\nOn the same day Musk tweeted about the pricey X, saying that Tesla will be taking orders on the Model 3 in March 2016 and that the car will cost $35,000.\nThat’s in line with cheaper electric cars such as General Motors Co.’s ( GM ) Chevy Volt, which is scheduled for redesign, and Nissan Motor Co. Ltd.’s (XTKS:7201) Leaf. These are already available — but come without the Tesla cachet.\n\nClaudia Assis is a San Francisco-based reporter for MarketWatch. Follow her on Twitter @ClaudiaAssisMW. \n\nMore From MarketWatch \nThe one thing the bull market needs to get back on its feet U.S. house prices rise 0.6% in July, Case-Shiller index shows 10 cities where home prices hit record highs  \nAutomotive Industry Tesla Motors", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T03:00:05.381+03:00", "highlightTitle": ""}