{"organizations": [], "uuid": "172e40a98c39fb2341bd4a78838224f0a0dec710", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/Y2QGMo2qqk9rcL4W8t8Fng--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/6f87222e0bb4fb0cf1abf5e70dee1d10d07dc378_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Top stories from Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/spanish-jobless-claims-rise-first-091859188.html", "country": "GB", "title": "Spanish jobless claims rise for first time in 7 months", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Spanish jobless claims rise for first time in 7 months", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T12:18:00.000+03:00", "replies_count": 0, "uuid": "172e40a98c39fb2341bd4a78838224f0a0dec710"}, "author": "", "url": "https://uk.finance.yahoo.com/news/spanish-jobless-claims-rise-first-091859188.html", "ord_in_thread": 0, "title": "Spanish jobless claims rise for first time in 7 months", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Sep 2, 2015, 10:32 BST - UK Markets close in 5 hrs 58 mins Spanish jobless claims rise for first time in 7 months AFP – 12 minutes ago View Photo \n\nSpain registered in August its first a increase in jobless claims in seven months, data showed Wednesday, but with elections just months away the government dismissed it as a seasonal uptick that does not wipe away improvements over the past year. \nJobless claims increased last month by 21,679, or 0.54 percent, to 4.07 million, the labour ministry said in a statement. \nAugust is traditionally weak for the Spanish jobs market as hotels and restaurants cut back on staff as the busy summer tourism season comes to an end. \nThe number of people without work rose mainly in the services sector, with increases also in manufacturing and in the construction, but declined in the agriculture sector as the harvest season began. \nHowever the number of registered unemployed was down by 359,975 or 8.1 percent over August 2014, the biggest annual decline ever registered during the month of August, the labour ministry said. \nConservative Prime Minister Mariano Rajoy is betting on an improved economy to give him a boost as he prepares for what promises to be a hard-fought re-election campaign at the end of the year. \nSecretary of state for employment, Juan Pablo Riesgo, said the latest unemployment figures \"confirm the improvement of the Spanish labour market.\" \n\"Unemployment continues to fall, if one does not take into account the seasonal component, and the important rhythm of the fall in unemployment has been maintained this year,\" he added. \nThe labour ministry's monthly figure is a different measure from the quarterly unemployment rate, which is based on surveys and stood at 22.4 percent in the second quarter, according to the National Statistic Institute. \nSpain emerged in 2013 from five years of on-off recession. The government forecasts the economy to grow 3.3 percent this year -- more than twice the average growth rate forecast for eurozone countries (Other OTC: UBGXF - news ) .", "external_links": [], "published": "2015-09-02T12:18:00.000+03:00", "crawled": "2015-09-02T12:35:49.812+03:00", "highlightTitle": ""}