{"organizations": ["Glencore", "Sainsbury"], "uuid": "8273c7e77f082f3c385b057e223da6655e4cc04a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-oil-gas/?format=rss", "section_title": "Oil News | Gas News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/london-close-stocks-buoyed-glencore-181100649.html", "country": "US", "title": "London close: Stocks buoyed by Glencore and Sainsbury's", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "London close: Stocks buoyed by Glencore and Sainsbury's", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T21:11:00.000+03:00", "replies_count": 0, "uuid": "8273c7e77f082f3c385b057e223da6655e4cc04a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/london-close-stocks-buoyed-glencore-181100649.html", "ord_in_thread": 0, "title": "London close: Stocks buoyed by Glencore and Sainsbury's", "locations": ["London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "3,340.00 +135.00 \nLONDON (ShareCast) - (ShareCast News) - The FTSE rose on Wednesday as a batch of negative economic data was offset by gains in supermarket stocks and a rebound in Glencore (Xetra: A1JAGV - news ) . Glencore dominated the FTSE 100 after saying it has taken proactive steps to position the mining company to withstand current market conditions including weak commodity prices. The group's stocks plunged on Monday after Investec (LSE: INVP.L - news ) highlighted debt concerns and said there was little equity value for shareholders. \nJ Sainsbury (Other OTC: JSAIY - news ) also rallied after saying it expected full-year underlying pre-tax profit to be moderately ahead of its £548m forecast as it reported a 0.3% increase in second quarter retail sales, excluding fuel. The news lifted shares in Morrison Supermarkets and Tesco (Xetra: 852647 - news ) . \nInvestors digest mixed data In economic data, UK GDP was unexpectedly revised lower to 2.4% year-on-year from the previous estimate of 2.6%, according to the Office for National Statistics. However, it marked a considerable improvement from the 0.4% rate recorded in the previous three months. \n\"Given that the Bank of England has long questioned the official GDP data, producing their own back-casts in their Quarterly Inflation Report, today's revisions should not have a material impact on the thought process of the Monetary Policy Committee,\" said Cebr economist Sam Alderson. \n\"Instead, their focus will be on how the economy performs in the coming months. Given recent indicators, this is unlikely to be strong enough to encourage members to hike rates until the middle of 2016.\" On the upside, the UK's current account deficit fell to £16.8bn in the three months to June, down from a revised deficit of £24bn in the first quarter. Analysts had been expecting a deficit of £22bn. \nThe Eurozone's annual consumer price index fell 0.1% in September compared to a 0.1% increase in August, Eurostat's flash estimate revealed, missing analysts' expectations for zero growth. \n\"The return of inflation to negative territory in the euro-zone will heap additional pressure on the ECB to up the scale of its asset purchase programme,\" said Jack Allen, European economist at Capital Economics. The Eurozone's seasonally-adjusted unemployment rate held steady in September compared with August at 11%, but was down from 11.5% in August last year. The figure for August was revised up a touch from 10.9%. Analysts had been expecting a rate of 10.9% for September. \nGerman unemployment rose by 2,000 in September, compared to estimates for a 5,000 drop and following the previous month's 6,000 decline. The unemployment rate remained at 6.4% this month, as expected. \nGerman retail sales fell 0.4% month-on-month compared with a sharp 1.6% rise registered in July and falling short of analysts' expectations for a 0.2% gain, the Federal Statistics Office said. On a year-on-year basis, retail sales grew 2.5% but remained short of the 3.1% consensus forecast and comfortably below the 3.8% year-on-year increase registered in the previous month. \nStateside, the private sector generated 200,000 jobs in September, boosted by hiring at the largest corporations, according to private consultancy ADP. Economists had been expecting a reading of 188,000. The previous month's tally was revised a tad lower, to show a gain of 186,000 compared with a preliminary forecast of 190,000. The report comes ahead of the all-important non-farm payrolls on Friday. \nManufacturing output in the Chicago region fell into contraction territory in September, data released on Wednesday showed. According to figures released by MNI Indicators, the Chicago Purchasing Managers' Index slumped from 54.4 in August to 48.7 in September and below the 50 threshold that indicates expansion. \nThe Federal Reserve is monitoring economic data in determining the timing of the first interest rate increase in nine years. \nFed Chair Janet Yellen will speak after the close in St. Louis, potentially elaborating on her remarks that she expected the central bank will raise interest rates this year. \nOn the corporate front, Aviva (Other OTC: AIVAF - news ) was given a boost after Charles Stanley (LSE: CAY.L - news ) upgraded the stock to 'accumulate' from 'hold'. \nEntertainment One (Other OTC: ENTMF - news ) slumped following news it is looking to take a 70% stake in creator and producer Astley Baker Davies Limited, the company that produces the Peppa Pig show, for £140m. The company already holds joint ownership rights for Britain's favourite pig with ABD, and will fund the acquisition through a four-for-nine rights issue raising £193.6m - the extra cash is to pay off debt. N+1 Singer recommended a 'sell' rating on the shares, saying that the proposal looks like a \"rescue rights\" and questioned whether there is a hole in the balance sheet. \nWizz Air Holdings flew higher for the second day in a row after the low-cost airline raised its full-year net profit guidance on Tuesday and said it has traded well in the first half of the 2016 financial year. \nVictrex (LSE: VCT.L - news ) edged higher after Liberum initiated coverage of the stock at 'buy' with a 2,200p price target. \nMarket Movers techMARK 3,002.18 +1.45% FTSE 100 6,052.63 +2.43% FTSE 250 16,654.12 +1.29% FTSE 100 - Risers Glencore (Amsterdam: GX8.AS - news ) (GLEN) 91.57p +14.11% Sainsbury (Amsterdam: SJ6.AS - news ) (J) (SBRY) 260.00p +13.39% Tesco (TSCO) 182.95p +6.80% Morrison (Wm) Supermarkets (MRW) 165.90p +6.28% Aviva (Amsterdam: AW8.AS - news ) (AV.) 452.10p +5.53% Wolseley (EUREX: WLYH.EX - news ) (WOS) 3,855.00p +5.44% Prudential (Amsterdam: PD8.AS - news ) (PRU (HKSE: 2378-OL.HK - news ) ) 1,390.50p +4.51% GKN (GKN (LSE: GKN.L - news ) ) 266.80p +4.42% Associated British Foods (LSE: ABF.L - news ) (ABF) 3,334.00p +4.03% Rolls-Royce Holdings (RR.) 676.50p +3.92% FTSE 100 - Fallers Fresnillo (Amsterdam: FN6.AS - news ) (FRES) 589.50p -1.17% Berkeley Group Holdings (The) (BKG) 3,330.00p -0.15% FTSE 250 - Risers Kaz Minerals (LSE: KAZ.L - news ) (KAZ) 83.50p +14.86% Aggreko (EUREX: AGKF.EX - news ) (AGK) 949.50p +8.39% AO World (Other OTC: AOWDF - news ) (AO.) 170.00p +6.92% Victrex plc (VCT) 1,757.00p +5.72% Ophir Energy (Other OTC: OPGYF - news ) (OPHR) 89.55p +5.29% Allied Minds (Other OTC: ALLWF - news ) (ALM) 355.70p +5.24% Premier Oil (LSE: PMO.L - news ) (PMO) 66.85p +4.21% Wizz Air Holdings (WIZZ) 2,038.00p +3.98% Mitie Group (Other OTC: MITFF - news ) (MTO) 305.10p +3.81% Just Eat (Other OTC: JSTLF - news ) (JE.) 409.80p +3.64% FTSE 250 - Fallers Entertainment One Limited (ETO) 248.50p -8.64% Vedanta Resources (Other OTC: VDNRF - news ) (VED) 419.00p -4.84% BBA Aviation (LSE: BBA.L - news ) (BBA) 267.60p -2.69% Cranswick (CWK) 1,590.00p -1.85% Ted Baker (Other OTC: TBAKF - news ) (TED) 3,212.00p -1.47% Centamin (DI (KSE: 003160.KS - news ) ) (CEY) 60.90p -1.46% Brewin Dolphin Holdings (BRW) 256.50p -1.38% Jimmy Choo (LSE: CHOO.L - news ) (CHOO) 138.40p -1.28% Indivior (Berlin: 2IV.BE - news ) (INDV) 226.20p -1.18% Sophos Group (LSE: SOPH.L - news ) (SOPH) 233.40p -0.98% FTSE TechMARK - Risers Torotrak (TRK) 7.05p +4.14% Spirent Communications (Other OTC: SPMYY - news ) (SPT (Taiwan OTC: 8431.TWO - news ) ) 75.50p +2.03% Dialight (DIA (Amsterdam: DI6.AS - news ) ) 635.00p +2.01% KCOM Group (LSE: KCOM.L - news ) (KCOM) 89.00p +1.42% Consort Medical (Other OTC: CSRMF - news ) (CSRT) 935.00p +1.30% Skyepharma (SKP) 353.00p +1.29% SDL (SDL (LSE: SDL.L - news ) ) 325.25p +1.17% XP Power Ltd (LSE: XPP.L - news ) . (DI) (XPP) 1,599.00p +0.95% NCC Group (LSE: NCC.L - news ) (NCC (BSE: NCC6.BO - news ) ) 275.00p +0.82% Sepura (SEPU) 175.00p +0.14% FTSE TechMARK - Fallers Filtronic (FTC) 6.50p -3.70% RM (RM (LSE: RM.L - news ) .) 163.50p -2.68% Oxford Biomedica (LSE: OXB.L - news ) (OXB) 7.76p -1.90% Ricardo (RCDO) 875.50p -1.79% Oxford Instruments (Other OTC: OXGGY - news ) (OXIG) 581.50p -1.44% BATM Advanced Communications Ltd (Other OTC: BTAVF - news ) . (BVC) 20.00p -1.23%", "external_links": [], "published": "2015-09-30T21:11:00.000+03:00", "crawled": "2015-09-30T22:35:26.050+03:00", "highlightTitle": ""}