{"organizations": [], "uuid": "7c9471875dfc69e7ef95cd87e78cd320a1b66670", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/e/t/f/z/image.related.afrArticleLead.620x365.gjet9d.png/1441337985754.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/real-estate/residential/the-timebomb-at-the-heart-of-the-australian-housing-boom-20150903-gjet9d", "country": "AU", "title": "The asbestos time-bomb at the heart of the Australian housing boom", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The asbestos time-bomb at the heart of the Australian housing boom | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T09:10:00.000+03:00", "replies_count": 0, "uuid": "7c9471875dfc69e7ef95cd87e78cd320a1b66670"}, "author": "Anne Hyland", "url": "http://www.afr.com/real-estate/residential/the-timebomb-at-the-heart-of-the-australian-housing-boom-20150903-gjet9d", "ord_in_thread": 0, "title": "The asbestos time-bomb at the heart of the Australian housing boom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An increasing number of recent victims say exposure to asbestos may have come from home renovation. Roderick Shaw Share on twitter Share on Google Plus by Anne Hyland Is your house a time-bomb ready to explode? It could be if you undertake a do-it-yourself renovation on a home built prior to the 1990s.\nThe fears of Australian scientists and government agencies that the boom in do-it-yourself home renovations, boosted by popular television shows, would create a third wave of asbestos victims is now emerging in the statistics of people being diagnosed with mesothelioma. Mesothelioma is the cancer associated with exposure to asbestos.\nLast year, at least 50 Australians a month were diagnosed with mesothelioma, according to the Australian Mesothelioma Registry.\nAn increasing number of recent victims have indicated exposure to asbestos potentially came from home renovation.\nPeter Tighe, head of the Asbestos Safety and Eradication Agency, said home owners who demolish a kitchen or bathroom themselves to save money don't understand that asbestos could be present in unexpected places if their home was built prior to 2000.\n\"There were some 3000 building products manufactured from post second-World War to the end of 1990s that contained asbestos. From glue that was used to stick down vinyl tiles, in putty used on windows or in lagging that was around hot water pipes. We're getting more and more people who were involved in some form of do-it-yourself renovation coming down with mesothelioma.\"\nThe first wave of Australian asbestos victims were those in the mining and manufacturing industries; the second wave installed products containing asbestos and were made famous in the bitter class action brought against building products company James Hardie.\n\"This is a ticking time-bomb. It's out there,\" said Mr Tighe, who heads the federal government agency. \"It's like a snake that's curled up and sitting in the sun. If you don't go near it and you treat it with respect you're not going to have a problem. If you go into its nest and disturb it you've got a problem.\"\n Get a professional to clear asbestos\nMr Tighe asked people to pay professionals to treat their home for asbestos rather than risk their lives. He said popular do-it-yourself TV home renovation shows used professionals to remove asbestos.\n\"Before they send in the punters to do the renovation on those TV renovation shows, they have the professionals come in and remove asbestos if it's in the home. The problem is they don't publicise that. Instead, what you see is a punter on TV with a sledge hammer.\"\nProfessor Nico van Zandwijk, director of the Asbestos Diseases Research Institute, said there is \"more and more evidence that home renovation in Australia is a credible source of this dreadful disease\".\nHe's also raised concerns around the proper disposal of asbestos, which is treated differently across state, territory and local governments and is typically put into landfill.\nMr van Zandwijk has warned that unless government bodies ensure the disposal of asbestos is done correctly, and that sufficient warnings of the risk were issued, they could risk legal action.\n\"If the site is a burial site for asbestos waste it should be secluded from the rest of the environment with concrete put on it and never touched again. But the practice is sometimes different. If it becomes clear the government or organisation hasn't complied fully with the rules there could be legal action. I don't think that would be unreasonable.\"", "external_links": ["https://twitter.com/newsandimages", "https://plus.google.com/https://plus.google.com/113603699450999731037"], "published": "2015-09-04T09:10:00.000+03:00", "crawled": "2015-09-04T10:06:32.886+03:00", "highlightTitle": ""}