{"organizations": [], "uuid": "66f34ee3ceeee29306f7d80a73d2dce79024bc14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://assets.bwbx.io/images/ik.HqZRCf0qU/v1/-1x-1.jpg", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=FB", "section_title": "Yahoo! Finance: FB News", "url": "http://www.forbes.com/sites/steveschaefer/2015/09/30/donald-trump-stock-investments-facebook-bofa-boeing/", "country": "US", "title": "What the World Will Look Like When They Block All the Ads", "performance_score": 0, "site": "forbes.com", "participants_count": 0, "title_full": "What the World Will Look Like When They Block All the Ads", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T16:36:00.000+03:00", "replies_count": 0, "uuid": "66f34ee3ceeee29306f7d80a73d2dce79024bc14"}, "author": "", "url": "http://www.forbes.com/sites/steveschaefer/2015/09/30/donald-trump-stock-investments-facebook-bofa-boeing/", "ord_in_thread": 0, "title": "What the World Will Look Like When They Block All the Ads", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Events What the World Will Look Like When They Block All the Ads It'll never happen. But the terrifying specter has the ad and media industries buzzing—and planning for battle—at Advertising Week. \nAs thousands of advertisers run from panel discussions to open-bar mixers in New York this week, there will be one nagging thought at the back of their minds. \nPeople don’t like them very much. \nSoftware that blocks ads in Web browsers and mobile devices tops the list of concerns at Advertising Week. There are signs that the craze has already started to subside. Ad-blocking apps have slipped from the top of the Apple Store charts , and analysts at JP Morgan and at UBS say they believe that concerns may be out of proportion with the actual risk. Still, if ad blocking does become pervasive, it could become an existential problem for the ad and media industries. \nCan companies keep people from actively rejecting ads just by making them better? Or will there be a more fundamental shift in the economics of online media? \nBob Lord, president of AOL, says it will be the latter. \nAOL’s ad business hasn’t felt much pain from the recent crop of ad blockers, Lord said in an interview before AOL’s Ad Week party on Monday. But the trend will probably force media companies to offer parallel versions of their services, he said. Some customers won’t pay but will see targeted ads; others will pay a subscription fee to avoid advertising. \nLord predicts a short-term struggle between online publishers and ad-blocking companies in which publishers withhold content from people who use ad blockers. At the same time, companies that have traditionally produced content supported by advertising—including AOL—will move increasingly toward subscriptions. \n“As the consumer behaviors change, we have to play in both models,” said Lord. “The jury is still out on where we’re going to land, but ultimately consumers are going to have to make the choice.” \nThis would be a major change for AOL, which owns the Huffington Post, runs Verizon's new Go90 mobile video service, and just announced that it is working with the rapper Snoop Dogg to make an online reality show about his youth football league. The company counts on advertising to support all of its businesses, except for its curiously resilient dial-up Internet service . \nLord isn’t the only one pondering a world in which some consumers reject advertising entirely. At the AOL party, tables were piled high with copies of an issue of Advertising Age that showed a darkened Times Square on the cover. Inside, Simon Dumenco, an editor-at-large for the magazine, had laid out the apocalyptic scenario that would ensue if advertising were to disappear. \n“Imagine what we’re calling, in a perverse but timely thought experiment, A World Without Advertising ,” he wrote. “Consider it something of a love letter to the industry, which has been keeping the lights on at a lot of places we love.” \nThe piece attempts to calculate how much certain services would cost if the companies offering them had to rely entirely on subscription fees. To replace the $148 million it makes in quarterly ad revenue, Ad Age reckons, the New York Times would have to raise its cheapest digital subscription to $335 a year, from $195 now, without losing any subscribers. Buzzfeed would instantly vanish. \nFor Facebook, Dumenco cites an article written by Zeynep Tufekci, an assistant professor at the University of North Carolina, suggesting that the social media company should create a paid option for people who don’t want to be tracked or subjected to advertising. Tufekci suggested that a quarter of Facebook’s users might be willing to pay $1 a month for that option, roughly replacing the ad revenue each brings in and accounting for over $4 billion in annual revenue. Dumenco takes this to mean Facebook would lose three-quarters of its users and two-thirds of its revenue if it didn't have an ad-supported service. \nThis is a leap. Tufekci is suggesting that many people would pay for an ad-free alternative, with the rest using Facebook as it already exists. She argues that the whole thing would be a wash for Facebook. \nIt's a moot point. Mark Zuckerberg isn’t going to let people avoid advertisements. At Advertising Week, company executives have pointed out that Facebook is immune to mobile ad blockers because users access the service through an app, rather than through a Web browser. Earlier suggestions that the company offer an ad-free version of its service have been non-starters. \nBut Google last November began offering something of a compromise service . Called Contributor, it allows people to pay from $2 to $10 a month to see 5 percent to 50 percent fewer ads on some of the websites they visit. Google then shares that revenue with the publishers that are making less from ads. \nNotably, Google isn't offering people a way out of its data-collection practices, which are at the core of the complaints of the anti-ad crowd. The company declined to discuss how the project is going and has done little to promote it since the launch. Gregory Ferenstein, a writer for Venture Beat , went so far as to suggest that Google was setting the project up to fail so it would have evidence that people prefer ads to subscription fees. In any case, publishers that are participating say almost no one is using it. \nEven if customers can convince Google and AOL to offer robust alternatives to their ad-based businesses, the companies are going to try to funnel people right back into that model. Targeted ads require enormous amounts of data gathered from users, and Silicon Valley fortunes are built on the advantages that come from being able to exploit that data through secret algorithms that help target people more effectively. Even if they could replace some revenue by offering subscriptions, they won't want to if they don't have to. \nAOL’s Lord makes a claim common among Ad Week participants—that people actually crave advertising, so long as it’s done well. If you believe this, ad blockers can be rendered irrelevant with cleverer marketing. \n“The more enjoyable and entertaining I make the advertisement,\" he said, \"the more likely people will be to lean into advertising.”", "external_links": [], "published": "2015-09-30T16:36:00.000+03:00", "crawled": "2015-09-30T17:06:10.614+03:00", "highlightTitle": ""}