{"organizations": ["IDP Camps Newborn UN General Assembly"], "uuid": "2a9517822022bd75f19b163980ac1ab745ae33b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509280808.html", "country": "US", "title": "Nigeria: Sirius Petroleum Raises U.S.$1.55 Million to Finance Ororo Field Development", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Sirius Petroleum Raises U.S.$1.55 Million to Finance Ororo Field Development", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T12:20:00.000+03:00", "replies_count": 0, "uuid": "2a9517822022bd75f19b163980ac1ab745ae33b1"}, "author": "", "url": "http://allafrica.com/stories/201509280808.html", "ord_in_thread": 0, "title": "Nigeria: Sirius Petroleum Raises U.S.$1.55 Million to Finance Ororo Field Development", "locations": ["Nigeria", "U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Saraki", "Oladunjoye Phillip"], "text": "Nigeria: Saraki's Wife Takes Case for IDP Camps Newborn UN General Assembly By Oladunjoye Phillip \nSirius Petroleum, an exploration and development-focused oil and gas company, said on Tuesday that it has raised GBP 1 million ($1.55 million) through a share placing in order to help it finance its Ororo Field well permit application in Nigeria. \nSirius said that it would collaborate with Guarantee Petroleum and Owena Oil & Gas in applying for a well permit for the Ororo-2 well from the Department of Petroleum Resources (DPR). \nThe company said it will also begin work to obtain an up-to-date environmental impact assessment (EIA), noting that in addition to applying for the well permit, Guarantee Petroleum, Owena Oil & Gas and Sirius intend to apply to the Ministry of Petroleum Resources in Nigeria to legally ratify Sirius' 40-percent participatory interest in the Ororo Field. \nThe firm also said that in conjunction with the placing, Calvet International has agreed to reduce by GBP 500,000 ($775,000) the total amount of a loan facility that will be available to Sirius. This, it said, means that the firm's undrawn 'Calvet Facility' will now be GBP 700,000 ($1.1 million). \nSirius Chief Executive, Bobo Kuti, said, \"I have set out a near-term set of objectives for Sirius which sees all of our plans and recent activity come together and should lead to significant developments that bring Sirius closer to developing the Ororo Field. \n\"A collaborative approach with Guarantee Petroleum and Owena Oil & Gas provides multiple levels of technical and in-country knowledge and, in collaboration with Havoc Partners, aligns with our strategy to progress the development of our first asset. \n\"The Nigerian oil and gas industry has the full support of the new government administration, which has re-focused the regulators, the Nigerian National Petroleum Corporation and the Department of Petroleum Resources, to work closely with indigenous companies to bolster the nation's natural resources production. This initiative ties in with our strategy to build a significant portfolio of producing assets through local partnerships.\" Nigeria \nStudents of the University of Lagos, UNILAG, Akoka, on Monday, shut the university's two exit gates, to protest what … see more » Copyright © 2015 Daily Independent. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-28T12:20:00.000+03:00", "crawled": "2015-09-28T13:06:25.303+03:00", "highlightTitle": ""}