{"organizations": [], "uuid": "62d912a0b5c240c69ee2c0558c4255a4bed8471c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/11/markets-global-idUSL5N11H14C20150911", "country": "US", "title": "GLOBAL MARKETS-Stocks end solid week on cautious note as Fed decision hangs in balance", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "GLOBAL MARKETS-Stocks end solid week on cautious note as Fed decision hangs in balance | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T13:00:00.000+03:00", "replies_count": 0, "uuid": "62d912a0b5c240c69ee2c0558c4255a4bed8471c"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/11/markets-global-idUSL5N11H14C20150911", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks end solid week on cautious note as Fed decision hangs in balance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Stocks stay on track for best week in eight\n* Fed rate decision next week hangs in the balance\n* \"Quite a fragile time\" - equity fund manager\nBy Jamie McGeever\nLONDON, Sept 11 (Reuters) - Global stocks around the world slipped into the red on Friday but remained on track for their biggest weekly gain in eight as investors grappled with the possibility of U.S. interest rates rising next week.\nWhile next Thursday's eagerly anticipated decision from the Federal Reserve hangs very much in the balance, meaning the potential for market volatility remains high, stocks and government bond yields have moved higher this week.\nReflecting the growing uncertainty as the big day approaches, however, the dollar slipped on Friday and was on track for a fall of nearly 1 percent on the week, its first weekly decline in three.\n\"We're going through quite a fragile time, and we'll have to see how it evolves from here. That will depend on Fed action, as well as whether there's further negative news from China,\" said Veronika Pechlaner, European equity fund manager at Ashburton.\n\"This is not the time to make huge bets either way, but longer term we remain constructive on equities.\"\nIn early trading on Friday European shares were lower. The FTSEuroFirst index of leading 300 shares was down 0.5 percent at 1,408 points, but still up more than 1 percent on the week, its best performance since mid-July.\nBritain's FTSE 100 was down 0.2 percent at 6,139 points, Germany's DAX was down 0.5 percent at 10,161 points and France's CAC 40 was off 0.3 percent at 4,582 points.\nU.S. stock futures slipped 0.2 percent, suggesting a slightly weaker opening on Wall Street. The S&P 500 has bounced back from last week's 3.4 percent fall, however, and is well on track for its best week since July.\nMSCI's broadest index of Asia-Pacific shares outside Japan slipped 0.1 percent, but was on for a rise of more than 2.5 percent on the week, its biggest weekly gain in five months.\nChinese shares ended another choppy week little changed on Friday. The Shanghai Composite Index rose 1.2 percent on the week, a welcome relief for investors after it had lost around 20 percent in the preceding three.\nChinese industrial output, retail sales and investment data on Sunday will give clues on whether the world's second-largest economy is continuing to lose momentum and help set the tone for markets next week.\nYUAN FIRMS, DOLLAR STEADIES\nU.S. data on Thursday suggested the labour market was gaining momentum in early September as fewer Americans filed for weekly unemployment benefits. But a separate report showed weak inflation, further clouding the outlook for what the Fed will decide to do at its Sept. 16-17 policy meeting.\nConsidering volatile global equities, increasing uncertainty over China and emerging markets, and other major central banks around the world easing policy rather than tightening, it could be a high bar for the Fed to raise rates next week.\n\"Our analysis suggests that the recent tightening in financial conditions, if maintained going forward, would be equivalent to around three (rate) hikes,\" Goldman Sachs U.S. economists wrote in a note to clients.\n\"Given that markets have done much of the Fed's 'dirty work', we expect Fed officials to be on hold at least until December.\"\nIn currencies the dollar was flat against the yen at 120.50 and the euro was up 0.2 percent at $1.1300, meaning the dollar's trade-weighted index was down slightly at 95.40.\nThe benchmark 10-year U.S. Treasury yield was down a basis point on the day at 2.21 percent, but up 8 basis points so far this week.\nThe two-year yield, which is more sensitive to interest rate moves and expectations, was flat on the day at 0.735 percent but up slightly on the week. On Wednesday, it hit a three-month high of 0.766 percent.\nIn commodities, U.S. crude oil futures gave back some of their overnight gains after top exporter Saudi Arabia said it saw no need for a producer summit to defend prices.\nU.S. crude was down 2 percent at $45.00 a barrel, after rallying 4 percent earlier on U.S. Energy Information Administration data that showed strong demand for gasoline.\nBrent, which gained 2.8 percent in the previous session, was down nearly 2 percent at $48.00.\nSpot gold edged down to $1,108 an ounce, on track to drop more than 1 percent for the week, its third straight weekly fall. (Additional reporting by Alistair Smout in London; Editing by Hugh Lawson ; To read Reuters Global Investing Blog click here ; for the MacroScope Blog click on blogs.reuters.com/macroscope ; for Hedge Fund Blog Hub click on blogs.reuters.com/hedgehub )", "external_links": [], "published": "2015-09-11T13:00:00.000+03:00", "crawled": "2015-09-11T12:13:44.562+03:00", "highlightTitle": ""}