{"organizations": [], "uuid": "0b39b9c03fc9497538359b1cfea145ea88787d80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/Narendra-Modi-PTI300.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/miscellaneous/pm-narendra-modi-hits-back-at-sonia-gandhi-says-hawalabaaz-are-unnerved/133558", "country": "IE", "title": "Narendra Modi hits back at Sonia Gandhi, says ‘hawalabaaz’ are unnerved", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Narendra Modi hits back at Sonia Gandhi, says ‘hawalabaaz’ are unnerved | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T22:13:00.000+03:00", "replies_count": 0, "uuid": "0b39b9c03fc9497538359b1cfea145ea88787d80"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/miscellaneous/pm-narendra-modi-hits-back-at-sonia-gandhi-says-hawalabaaz-are-unnerved/133558", "ord_in_thread": 0, "title": "Narendra Modi hits back at Sonia Gandhi, says ‘hawalabaaz’ are unnerved", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Letters to the editor FSDC sub-panel meets BJP, allies to get majority in Bihar assembly polls: Opinion poll Hitting back at Congress President Sonia Gandhi over her barbs against him, Prime Minister Narendra Modi today alleged that “scamsters are unnerved” due to the tough stance of the government on black money and are putting “roadblocks” in the reforms agenda – he also used the word ‘hawalabaaz’.\nAttacking the Sonia Gandhi for her remarks on Tuesday that the Prime Minister has been “reduced to unedifying flip flops” and most of his poll promises were nothing more than “hawabaazi” (empty talk), he said the “hawalabaaz” (scamsters) are seeking answers from him even as his government has plugged leakages in schemes and enriched the nation’s coffers.\nAddressing Bharatiya Janata Party ( BJP ) workers here, Modi said that Congress was resorting to “disruptive tactics” as it was not being able to come to terms with its defeat in 2014 Lok Sabha polls.\nSingling out Congress for the complete washout of Monsoon Session of Parliament and blaming it for delaying Goods and Services Tax (GST) Bill, he said even as other parties favoured that the House should run and the business be transacted, “there is one, which does not accept this”.\n“I wonder whether there is a place for an attitude of confrontation due to sheer arrogance in a democracy. I had publicly appealed to the party, which has been defeated and has been rejected by the people, to allow Parliament to function. While the world is facing a huge economic crisis, India is standing on its feet. Today the country has a never before opportunity to move forward. Let us not waste it,” he said.\nThe Prime Minister said, “We had not prorogued the Monsoon Session with the hope that the opposition party will take into account the hopes and aspirations of the country. But they did not accept and finally with a heavy heart and sadness, we had to decide to prorogue the session yesterday.”\nMaintaining that in a democracy political parties should introspect on how to strengthen themselves if they lose elections, Modi said if people elected somebody for five years, the mandate has to be respected.\n“I know their problem. One after another decisions are being taken by this government. The ‘hawalabaaz’ are disturbed due to the tough law that we have made against black money. The land beneath them is slipping away.\nThey are sensing the danger hovering around them. This group of ‘hawalabaaz’ is trying to put roadblocks,” he said.\nThe government had yesterday given up its plan to reconvene the Monsoon Session of Parliament to get GST Constitutional Amendment Bill approved as Congress virtually scuttled the move.\n 10, 2015 2:13 pm", "external_links": [], "published": "2015-09-10T22:13:00.000+03:00", "crawled": "2015-09-11T04:04:02.755+03:00", "highlightTitle": ""}