{"organizations": [], "uuid": "4e727e78836d306cb92387dbbfeb8dae826a716f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/", "section_title": "Forbes - Personal Finance Information and Personal Finance News - Forbes.com", "url": "http://www.forbes.com/sites/bradthomas/2015/09/01/the-spin-co-wheel-lands-in-reit-dom/", "country": "US", "title": "The Spin-Co Wheel Lands In REIT-dom", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "The Spin-Co Wheel Lands In REIT-dom", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T02:46:00.000+03:00", "replies_count": 0, "uuid": "4e727e78836d306cb92387dbbfeb8dae826a716f"}, "author": "Brad Thomas", "url": "http://www.forbes.com/sites/bradthomas/2015/09/01/the-spin-co-wheel-lands-in-reit-dom/", "ord_in_thread": 0, "title": "The Spin-Co Wheel Lands In REIT-dom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last week I wrote an article explaining the wave of activism that has accelerated the demand for C-Corporations hoping to spin-off real estate into a REIT structure. It appears that the increased demand for capital in the REIT sector (the market capitalization for U.S. Equity REITs is around $900 billion) has enlarged activism support for traditional C-Corps to unlock real estate by spinning-off the property holdings into a tax friendly REIT.I explained in my recent article that “activists generally aren’t astute when it comes to real estate as most of them scour the landscape in an effort to seek out companies in need of new management” however, “these days more and more activists are turning to real estate, the once unnoticed slice of the balance sheet that has the potential to unlock enormous shareholder value if monetized correctly”.\nForbes Real Estate Investor Earn safe, reliable income with the help of veteran real estate expert Brad Thomas in Forbes' newest advisory Forbes Real Estate Investor . Ethan Allen (ETH), Bob Evans (BOBE), Cracker Barrel (CBRL), Dillard’s (DDS), and McDonald’s (MCD) have all been viewed through the REIT lens by activist investors (or suggestivists as some are called) salivating to drive shareholder value by unlocking the real estate in a tax efficient manner. More recently Darden Restaurants Inc. (DRI) has proposed spinning off 430 of its more than 1,500 properties to form a REIT called Four Corners Property Trust Inc. By dividing the real estate into a property company, Darden aims to monetize the sites to payoff around $1 billion in debt. Spin The REIT Wheel It seems that restaurants and retailers aren’t the only companies that are exposed to the REIT bug. [tweet_Quote: display=\"There's a precedent for REIT spins in the gaming industry.\"]There's a precedent for REIT spins in the gaming industry.[/tweet_Quote: ] In late 2013 Penn National (PENN) bifurcated its gaming operations and its real estate properties by forming a new REIT called Gaming and Leisure Properties (GLPI) . Then a few months ago, after months of negotiations, GLPI (the first and so far only casino REIT) struck a deal to acquire Pinnacle Entertainment Inc.'s real estate in an all-stock transaction that carries an implied enterprise value of $4.75 billion. The deal is expected to close in the first quarter of 2016.Keep in mind that although GLPI saves significant taxes at the corporate level (~$1 million per quarter) on the PENN deal, the IRS will get their cut of the revenue as individual investors will be taxed on the dividend income received. GLPI has a Total Capitalization of around $6.07 billion and the company has a health dividend yield of 7.1%. An Even Bigger Bet MGM Resort International (MGM) has also been gaining attention these days as the company said it’s evaluating the “phenomenon” of the valuation gap plaguing its real estate and its losing streak of profitability after activist investor, Jon Litt made his pitch public. MGM executives are now being forced to adopt strategic initiatives to boost its lagging stock price (shares are down ~16 percent YTD). On the recent earnings call MGM said that the REIT option is under serious consideration. Jim Murren, CEO of MGM said, We have a benefit of having a broad portfolio of properties and brands in many markets — much more than most. And that is an advantage that creates multiple options for us. It also creates an obligation, as we need to take the appropriate time to thoroughly vet all of these opportunities, and of course this includes various real estate structures. We need to narrow the field in terms of what is best to continue to maximize short-, medium- and long-term sustainable value to our shareholders. Murren stressed that MGM was not selling the blue chip properties (\"We don't put a for sale sign out on any of our resorts”) and he asserted that MGM's decision not to sell its real estate, particularly on the Strip, has been vindicated over the last several years by the growth of asset values, particularly those of gaming properties, which the CEO posited have increased in value by 30% to 50% in the last year to 18 months.He added, And an asset sale of any significance needs to be carefully weighed against real estate structures. If in fact an asset is a valuable potential REIT candidate or a part of a portfolio of REIT properties, you'd have to take that into account before you determine what to do with the property. Litt’s company, Land & Buildings, has waged an activist movement pressuring MGM and in a recent Memo he said MGM Resorts \"appears to be actively pursuing a REIT conversion…It is our understanding that MGM has a team of investment banks working expeditiously through a complex process to evaluate all options to unlock value for all MGM shareholders.\"Litt called MGM Resorts \"severely undervalued, in our view, with a net asset value of at least $30 per share,\" in contrast with the company's trading price of $19.83.MGM is rated “B+” by S&P and MGM does not payout a dividend.More recently, MGM is said to be close to a sell of one of its blue chip properties. According to SNL Financial, The Mirage, one of the prime casino resorts on the Las Vegas Strip, is reportedly being sold for as much as $1.5 billion. According to John Yelling with SNL Financial, The Mirage, although well-located near the middle of the Strip, is a bit lonely when compared to its MGM sister properties, which are grouped toward the southern end of the fabled thoroughfare, where MGM has been busy investing in new amenities.These investments include a new entertainment district between the Monte Carlo and New York-New York casinos, which will offer a 5,000-seat theater and a 20,000-seat arena. The company is also injecting capital into existing assets, such as the Mandalay Bay convention center, which is being expanded and refurbished. The reported buyer of the Mirage is Starwood Capita l, the former owner of the Riviera casino on the north end of the Strip, which is slated for demolition to make way for an expansion of the Las Vegas Convention Center. Activist Litt appears to be in support of the Mirage sell at the right price as he said, We're encouraged to see that MGM is pursuing strategies to deleverage their balance sheet, and a sale of this asset in the 15 to 20 multiple range, we think, would be a step in the right direction. Otherwise, hang onto and redevelop it — put it in a REIT and redevelop it. As any intelligent investor would agree, [tweet_Quote: display=\"putting all of your chips on black or red is a foolish wager\"]putting all of your chips on black or red is a foolish wager[/tweet_Quote: ] . Remember, there are also two green numbers (zero and double zero) so the wager is not a 50-50 bet, the house has an edge.My point is that diversification is critical and while REITs are growing in popularity it’s important to always maintain adequate diversification and focus on the securities underlying fundamentals. [tweet_Quote: display=\"My best tip for gambling or any form of investing is a simple one: protect your principal at ALL costs.\"]My best tip for gambling or any form of investing is a simple one: protect your principal at ALL costs.[/tweet_Quote: ] Source: SNL Financial Brad Thomas is the Editor of the Forbes Real Estate Investor and writes for Forbes.com and Seeking Alpha. He is also a frequent guest on Fox Business and he is currently writing a book, The Trump Factor: It’s ALL Business , about U.S. presidential candidate Donald J. Trump.", "external_links": ["http://onforb.es/1FRyM1B%20", "http://info.ireitinvestor.com/the-trump-factor"], "published": "2015-09-02T02:46:00.000+03:00", "crawled": "2015-09-01T21:59:15.636+03:00", "highlightTitle": ""}