{"organizations": [], "uuid": "722fe62c5a1750496b8caa705f0f2e79de615155", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-11/ackman-says-he-s-a-little-more-bullish-on-stocks-than-tepper", "country": "US", "title": "Bill Ackman Is a ‘Little More Bullish’ on Stocks Than Tepper", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Bill Ackman Is a ‘Little More Bullish’ on Stocks Than Tepper - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T19:23:00.000+03:00", "replies_count": 0, "uuid": "722fe62c5a1750496b8caa705f0f2e79de615155"}, "author": "Simone Foxman", "url": "http://www.bloomberg.com/news/articles/2015-09-11/ackman-says-he-s-a-little-more-bullish-on-stocks-than-tepper", "ord_in_thread": 0, "title": "Bill Ackman Is a ‘Little More Bullish’ on Stocks Than Tepper", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bill Ackman, the founder of Pershing Square Capital Management, said he’s a “little more bullish” on stocks than hedge fund manager David Tepper.\nStocks are still “pretty cheap,” Ackman said Friday in an interview with CNBC. He added that this doesn’t apply to energy stocks, which he said he doesn’t invest in.\nAckman’s Pershing Square, which manages $18.5 billion, is known for establishing positions in companies, including Canadian Pacific Railway Ltd. and the former Allergan Inc., and pushing them to make sweeping changes. The hedge fund typically makes long-term bets that the stocks of those companies will rise.\nPershing Square Holdings Ltd., a closed-end fund that tracks the firm’s main hedge fund, erased gains for the year after slumping 9.2 percent during the global market rout in August. Ackman said Friday that as a long-term investor he wasn’t concerned about the short-term performance of his wagers.\n“I can’t tell you where any of our stocks are going to be at the end of next month,” he said.\nTepper, the founder of $20 billion hedge fund Appaloosa Management, told CNBC Thursday that market expectations for earnings are very high. He recommended investors who are fully invested take money off the table.\nAckman also said he doesn’t expect that Kraft Heinz Co. and 3G Capital would be able to buy snack giant Mondelez International Inc. in the near future. Analysts have been speculating about a possible deal between the companies since Pershing Square revealed last month that it had amassed a stake in Mondelez that was valued at $5.6 billion at the time.", "external_links": [], "published": "2015-09-11T19:23:00.000+03:00", "crawled": "2015-09-11T17:42:04.920+03:00", "highlightTitle": ""}