{"organizations": [], "uuid": "544ab78ef176b3c64ab271951312dad2329751a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/let-it-go-how-to-move-forward-your-business-without-the-headaches?cid=rss", "country": "US", "title": "Let it Go - How to Move Forward in Your Business without the Headaches", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Let it Go - How to Move Forward in Your Business without the Headaches", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T07:25:00.000+03:00", "replies_count": 0, "uuid": "544ab78ef176b3c64ab271951312dad2329751a2"}, "author": "Anne Zarraonandia, SF Internet Business Examiner", "url": "http://www.examiner.com/article/let-it-go-how-to-move-forward-your-business-without-the-headaches?cid=rss", "ord_in_thread": 0, "title": "Let it Go - How to Move Forward in Your Business without the Headaches", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comment \nMost 7-8 year old little girls can sing all the words to the hit song “ Let it Go ” from the mega-hit “Frozen”. But what does that song have to do with your business? Everything, if you plan to move forward and head toward the avenue of success. As an online seller, we have to answer many emails daily, source, ship, be social on Twitter and Facebook AND try to turn a profit to make a living. No one gets paid just for showing up. In fact, we have to do it all and sometimes the small things get in the way. What is a business owner to do? “Let it Go”! just like the song says. \nSounds easier said than done. But those simple words are good advise. One way to do it, is to unplug. Turn off the iPhone, put the computer to sleep and get outside and take a walk. Everything will still be there when you return. After your break, there might just be a level of relief and new found energy to tackle any situation. \nAnother suggestion, is to find a quick solution to your problem and move on. Perhaps you have an unhappy buyer and sending a refund might not be what you want to do, but in order to “let it go”, maybe it’s the best answer to get some relief. Don’t drag the communication out with countless emails which might have a negative tone. Be extra nice and what do you know, it works wonders with one’s mood. \nThe third trick is to not let business get personal. Most of the people who buy from you, don’t even know you, so why let the things they ask, say and expect, dictate how you feel. It’s business. Take it easy. Take the high road. Let it go and move on! Sounds easy? Well not really, it just takes some practice. Follow best practices, learn from mistakes and begin again. \nJoin a club or group and discuss. This is a popular way of sharing common experiences with fellow online sellers. We are often isolated and on our own. Try meeting up with others who do similar things and share your experiences. When you find out that others have similar experiences, it can calm you down and get rid of those “why does this happen to me” feelings. Just like parents of teenagers who share with other parents that their teens are moody, talk back and sleep too much, we will feel better when we find out about others in our world. \nThere is a popular book called “Don’t Sweat the Small Stuff” by Richard Carlson that is a quick read and puts things in perspective. Is what we are worried about really that big a deal, or are we just over-focusing on it and feeling sorry for ourselves? A list of what is the worst that can happen vs why is this situation really getting to me can be another way to get some relief. Think it through and you will soon see that letting it go is the best way to move forward. Stay in the moment and focus on the positive. \nRead some of your feedback and see what others have said “good” about your service. We seem to always take the ONE comment that is negative and let that define us, but it’s not the majority and again, it’s just one person’s view, not necessarily the truth. If you choose to comment in reply, read it out-loud before clicking the “Send” button and perhaps even walk away from the computer for a while before continuing. Chances are you will feel differently and be able to find a more positive response that “kills them with kindness”. \nNo matter what problems come up in your online business, there is a solution: a refund, a return, a lesson learned. The quicker you can achieve resolve with one of those ideas, the quicker you will be able to “let it go” and move ahead with your day, week, month. Reduce your headaches and daily stress with peace and calm and you might even think about adding some fun to your day with lightness and smiles. If you can “let it go”, you might even finding yourself humming the tune of the song from Frozen!", "external_links": [], "published": "2015-09-01T07:25:00.000+03:00", "crawled": "2015-09-01T10:11:17.396+03:00", "highlightTitle": ""}