{"organizations": [], "uuid": "e9d96a2033c1f9d8deb2bfcab13d9d87fee0e789", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-18/picking-indonesia-winners-is-harder-for-top-funds-on-rupiah-rout", "country": "US", "title": "Picking Indonesia Winners Is Harder for Top Funds on Rupiah Rout", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Picking Indonesia Winners Is Harder for Top Funds on Rupiah Rout - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T09:30:00.000+03:00", "replies_count": 0, "uuid": "e9d96a2033c1f9d8deb2bfcab13d9d87fee0e789"}, "author": "Harry Suhartono", "url": "http://www.bloomberg.com/news/articles/2015-09-18/picking-indonesia-winners-is-harder-for-top-funds-on-rupiah-rout", "ord_in_thread": 0, "title": "Picking Indonesia Winners Is Harder for Top Funds on Rupiah Rout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top fund managers say picking winners in Indonesia has become harder -- but not impossible -- as the rupiah extends declines from a 17-year low.\nPT Sinarmas Asset Management favors snack maker PT Mayora Indah because of its high proportion of overseas revenues and low foreign debt. The top pick for Samsung Asset Management is PT Sri Rejeki Isman, a supplier to Hennes & Mauritz AB, because a falling rupiah boosts its dollar earnings and competitiveness.\nPicking winners in Indonesia was lot easier when record-low U.S. borrowing costs fueled an almost 300 percent surge in the Jakarta Composite Index in the six years through 2014 and gross domestic product expanded at an average 5.7 percent pace. Now, the benchmark gauge is the world’s worst performer after Peru and Egypt as the Federal Reserve gets closer to raising interest rates and the economy is growing at its slowest pace since 2009.\n“We need to focus on companies with low foreign-currency debts and sizable revenue from exports, but that’s not easy to find,” said Jeffrosenberg Tan, at Sinarmas Asset whose Simas Satu Fund has beaten 88 percent of its peers over the past five years. “Mayora is a perfect choice for us. We are keen to add to holdings if the opportunity arises from a market selloff. It appears the dollar appreciation trend will be here for some time.”\nFund Exodus Southeast Asian markets -- which were among the biggest beneficiaries of Fed stimulus as investors sought riskier assets --- have seen an exodus of foreign funds this year. Overseas money managers have sold a net $991 million of Indonesian shares this quarter, poised to be the biggest net outflows in more than two years. Shortfalls in the country’s current account and the government’s budget, as well as relatively high levels of foreign ownership of its debt, make the country vulnerable to external shocks.\nWhile the Fed on Thursday opted to keep rates pinned near zero for now, Yellen told a press conference that most policy makers still expect to raise rates this year.\nMayora, which sells instant coffee and biscuits across Asia, has bucked the downtrend to become the nation’s best-performing consumer goods stock this year with a 32 percent jump. The company earns 40 percent of revenue outside Indonesia and holds no foreign-currency debt. Net income doubled to $32.1 million in the three months ended June from a year earlier.\nBallooning Debt A slumping rupiah and weaker domestic growth has hurt some of the nation’s biggest stocks. Auto distributor PT Astra International, which has the fifth-largest weighting on the Jakarta Composite, has tumbled 20 percent this year. The company earns all its revenue from Indonesia and has seen its debt in local currency terms balloon 43 percent to 47 trillion rupiah ($3.27 billion) in the past 12 months\nThe rupiah will weaken to 14,600 per dollar by the third quarter of next year, according to economists surveyed by Bloomberg News. The currency last traded at 14,459. The same survey forecast that the economy, Southeast Asia’s largest, will grow 4.8 percent this year, the slowest since 2009 and well short of the 7 percent target President Joko Widodo set for his term in office.\nTextile makers that export most of their output are among the biggest gainers on the benchmark stock gauge this year. Sri Rejeki, known as Sritex, has rallied 105 percent, the fifth-best performer on the Jakarta Composite.\nTextile Profits Second-quarter profit at the Sukoharjo, Central Java-based company surged more than fivefold from a year earlier, compared with an average 18 percent drop in earnings at companies on the Jakarta Composite. The company generates more than 50 percent of its revenue overseas and has halved its foreign debt this year to $47 million, out of a total $429 million.\nMayora climbed 1.6 percent at 9:29 a.m. local time, heading for its highest close in six weeks. Sritex gained 0.9 percent. The Jakarta Composite Index added 0.3 percent.\nPT Eratex Djaja, which shipped nearly 99 percent of its output abroad, has jumped 87 percent this year and PT Pan Brothers, a textile company that only serves export markets, has advanced 17 percent.\nSritex’s “outlook appears favorable because its expanding production capacity is helped by improving cost competitiveness versus Chinese producers and it is a dollar earner,” said Alan Richardson, fund manager at Samsung Asset Management, which bought 1 million Sritex shares in May. His Samsung Asean Equity Fund has beaten 96 percent of peers tracked by Bloomberg during the past five years. “If there is a broad market selloff, then I would use it as an opportunity to add more.”", "external_links": [], "published": "2015-09-18T09:30:00.000+03:00", "crawled": "2015-09-18T07:32:40.678+03:00", "highlightTitle": ""}