{"organizations": [], "uuid": "5e9ff90991ef564a3ebab3e388e36e7319f7bac7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/mobilebattery0249.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/make-your-handset-battery-last/43254.html", "country": "IN", "title": "Make Your Handset Battery Last", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Make Your Handset Battery Last", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T10:00:00.000+03:00", "replies_count": 0, "uuid": "5e9ff90991ef564a3ebab3e388e36e7319f7bac7"}, "author": "Yogesh Sapkale", "url": "http://www.moneylife.in/article/make-your-handset-battery-last/43254.html", "ord_in_thread": 0, "title": "Make Your Handset Battery Last", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Make Your Handset Battery Last 43254 Make Your Handset Battery Last 0 Comments, Be the first to comment Yogesh Sapkale | 01/09/2015 12:30 PM | Useful tips on squeezing the most out of your cellphone’s battery For almost every mobile handset user, the most important question at the end of the day is: “Will my mobile’s battery last until I reach home?” This was not the case a few years ago, when we used a basic handset. So what has changed? Well, for a start, we upgraded our handsets to the newer, larger smartphones and are using more apps and consuming more and more data. No wonder, the battery fails to last for a day on a single charge. For Android devices, there are plenty of apps that claim to increase the life of the battery. However, most of them, being free, are loaded with unwanted ads and end up consuming data. After using several such apps, I can say from experience that they hardly make a difference in saving, or increasing, the battery life of your mobile device. One simple tip for increasing the battery’s life is to reduce the brightness of your mobile screen; then slow the CPU speed (if possible) and disable unwanted apps running in the background. In addition, keeping your handset cool also helps. So avoid using mobile in extreme temperatures or near warm places. Car-owners should especially refrain from keeping mobile handsets on the dashboard where it may be exposed to direct sunlight. Another issue is about how we charge the battery. Most people keep the mobile for charging overnight, which is not good. The reason is that most batteries are designed to operate at about 3.6 volts but can accept voltage up to 4.2 volts. In rare cases, the battery may either get damaged or become hot if the charger releases higher voltage. So it is better to charge the battery only until it attains full charge. Unlike the older batteries, the new ones have a slow and low rate of self-discharge and can last long. Moreover, for these batteries, there is no need to discharge it fully before extending its life. Ideally, you can charge the device when the battery level is down to 15%-20%. Some people recharge their battery whenever they can. Nothing wrong with this; but keep in mind that the life span of a battery is calculated in charging-discharging cycles of, typically, 1,000 cycles or recharges. There are new mobile handsets in the market that claim to charge quickly. This makes everyone, even those with old handsets, fall for fast-charging device chargers. But, remember, fast charging or discharging (like playing an action game or watching video on mobile handset) generates excess heat, which takes a toll on the battery’s life. Therefore, if you have been using the device for long and want to recharge, first allow the device to cool a bit, at least until it reaches the room temperature level. Mobile batteries do not accept full recharge when hot. In addition, make sure that the device is not becoming hot while charging. You can check it by touching the device, especially the place where battery is located (no need to remove the cover). If it feels hot, your charger is sending more current through the battery. Stop charging and let the device cool for some time. Again, check how it feels to touch. If it is cool, you can charge it again. Also, make sure you are using the same charger that came bundled with your mobile device. Never use any sub-standard charger for charging your handset. One important issue is: Do not use a battery if there is a bulge or the battery is swollen. This happens due to high-pressure build-up of toxic gases inside the battery. If such a battery is used in extreme conditions, it may explode. In such cases, immediately replace the battery. Use batteries specially prescribed for your handset and buy it from an authorised or authentic shop only. Many people believe that one gets an electric shock or is burned if he/she uses the mobile handset while the device is charging. This is an erroneous impression. Unless the charger is faulty, the device battery would continue to be charged at 5-12 volts which is incapable of giving a ‘big shock’ or burn the user. More in Moneylife", "external_links": [], "published": "2015-09-01T10:00:00.000+03:00", "crawled": "2015-09-02T14:25:39.724+03:00", "highlightTitle": ""}