{"organizations": [], "uuid": "3b14f06dc269558c5bdc80d453049c75b02f1ac0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/g/y/b/a/image.related.afrArticleLead.620x365.gjhvx0.png/1441793425482.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/technology/steve-wozniak-selfdriving-cars-the-next-big-thing-for-apple-20150908-gjhvx0", "country": "AU", "title": "Steve Wozniak: Self-driving cars the next big thing for Apple", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Steve Wozniak: Self-driving cars the next big thing for Apple | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T15:25:00.000+03:00", "replies_count": 0, "uuid": "3b14f06dc269558c5bdc80d453049c75b02f1ac0"}, "author": "Yolanda Redrup", "url": "http://www.afr.com/technology/steve-wozniak-selfdriving-cars-the-next-big-thing-for-apple-20150908-gjhvx0", "ord_in_thread": 0, "title": "Steve Wozniak: Self-driving cars the next big thing for Apple", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apple co-founder Steve Wozniak says self-driving cars will likely be a growth area for Apple. Dominic Lorrimer Share on twitter Share on Google Plus by Yolanda Redrup Tech giant Apple's biggest money maker, the iPhone , may soon lose its top spot to self-driving cars, according to co-founder Steve Wozniak.\n\"If you look at a company the size of Apple... for Apple to think about doing things that are progressive for the company moving forward it has to be something pretty large in terms of the amount that is spent on that category,\" Mr Wozniak told the audience at the Australian Private Equity and Venture Capital Association Limited's (AVCAL) Alpha conference in Melbourne.\n\"That's why I tend to believe all the rumours about Apple working on either electric or self-driving cars... because there's a lot of money in vehicles. It's trillions of dollars.\"\nMr Wozniak also recommended venture capitalists direct their dollars towards technologies which would support the self-driving car revolution.\nApple co-founder Steve Wozniak said tech investors should look at products which will help create self-driving cars. Nic Walker Accidents will 'go way down'\n\"Self-driving cars are so important in everyone's lives, and it's such a huge market when you consider the cost of roads, the cost of cars, the costs of the lasered traffic. Insurance will be a different issue, accidents will go way down,\" he said.\n\"Right now I would say to invest in technologies that are going to be important ones in the way of self-driving cars. I especially like the idea of cameras that have vision that can look around a room and identify objects in a higher level sense.\"\nMr Wozniak also highlighted natural language recognition software and artificial intelligence more broadly as good investments.\n Steve Job's right-hand man in the early days of Apple, Mr Wozniak created the first personal computer and had a long history as an engineer at Apple before leaving in 1985.\nSpeaking hours before Apple's September 9 announcement about the new iPhone and Apple TV , Mr Wozniak (known as Woz) was pushed on what changes were coming.\n\"Very often I hear rumours that Apple's going to introduce a new phone and I write down the list of 20 things that I think would be great, and usually none of those things are in it. I hope there are some surprises,\" he said.\n\"The big things that really change life a lot are surprises. They come out of nowhere and they usually come out of young people.\"\nWoz a smartwatch convert\nSpeaking to The Australian Financial Review's BOSS magazine in July, Mr Wozniak said at the time he did not have Apple's latest product, saying he had misgivings about it after bad experiences with other smartwatches.\nBut now it seems he is converted.\n\"It really does simply simplify a lot of things and it works very well for me,\" he said.\n\"I didn't think at first that it was going to be that way because I've had other smartwatches from other makers... I had horrible experiences and just got rid of them right away. They were an unnecessary piece of junk that got between me and my smartphone which did it all better.\"", "external_links": ["https://twitter.com/YolandaRedrup", "https://plus.google.com/https://plus.google.com/114369306974649582739/about"], "published": "2015-09-09T15:25:00.000+03:00", "crawled": "2015-09-09T19:05:02.832+03:00", "highlightTitle": ""}