{"organizations": [], "uuid": "25aa391a33afd177d8a64906ca58565c1a0f7bf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.v3.co.uk", "main_image": "http://www.v3.co.uk/IMG/414/292414/internet-of-things-live-chat-with-intel-and-the-inquirer.jpg", "site_section": "http://www.v3.co.uk/feeds/rss/category/strategy/finance", "section_title": "The most recent finance from V3.co.uk", "url": "http://www.v3.co.uk/v3-uk/news/2425512/iotuk-programme-launches-to-drive-iot-development", "country": "GB", "title": "IoTUK programme launches to drive IoT development", "performance_score": 0, "site": "v3.co.uk", "participants_count": 1, "title_full": "IoTUK programme launches to drive IoT development", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T11:20:00.000+03:00", "replies_count": 0, "uuid": "25aa391a33afd177d8a64906ca58565c1a0f7bf6"}, "author": "Roland Moore-Colyer", "url": "http://www.v3.co.uk/v3-uk/news/2425512/iotuk-programme-launches-to-drive-iot-development", "ord_in_thread": 0, "title": "IoTUK programme launches to drive IoT development", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  11 Sep 2015 \nThe government's investment in the Internet of Things (IoT) is set to get a boost with the launch of the IoTUK national programme aimed at amplifying the UK's IoT capabilities. \nSet up by the Digital Catapult and the Future Cities Catapult the programme is part of the government's overall £40m investment in the IoT, and IoTUK will oversee organisations given access to the public funding. \nThese organisations will be tasked with creating a city demonstrator, a research hub focused on security and trust in the IoT world, along with building an IoT-centric healthcare test bed. \nNeil Crockett, chief executive of the Digital Catapult, said that IoTUK is about helping the UK maximise the potential of the IoT and smart technology. \n\"This is not about smart fridges and other first-generation IoT point-to-point solutions. This is about the combination of interoperability, artificial intelligence and machine automation to create a game changer in the business models of every sector in the economy,\" he said. \n\"The societal impact, from managing city infrastructure through to the delivery of our health and social services, will be huge. To stay ahead the UK needs to be at the cusp of driving and gaining a new competitive edge from the fundamental technological changes that will happen in the next five years.\" \nIoTUK will aim to boost IoT entrepreneurship and will work with organisations from a wide-range of fields such as healthcare and the industrial sector. \nA focus will be put on helping the public sector and UK businesses advance their IoT capabilities, concentrating on building up specific areas such as IoT security and data trust, data interoperability, design development, and the justification of investment into the area. \nIoTUK will host several workshops and events over the coming months to help organisations, companies and entrepreneurs get involved in case studies and showcases of their IoT work at the Digital Catapult and Future Catapult centres. \nIt will also call for organisations to create challenges and incubation activities to encourage innovation. Another focus will be on facilitating networking and collaboration with organisations across the IoT arena.", "external_links": [], "published": "2015-09-11T11:20:00.000+03:00", "crawled": "2015-09-11T11:47:23.499+03:00", "highlightTitle": ""}