{"organizations": ["RBS"], "uuid": "b26efef80164d0cd4beb1e4902b0cdf5708ce818", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/sir-howard-not-shake-off-132814549.html", "country": "US", "title": "Sir Howard can not shake off the airport debate for RBS just yet", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Sir Howard can not shake off the airport debate for RBS just yet", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T16:28:00.000+03:00", "replies_count": 0, "uuid": "b26efef80164d0cd4beb1e4902b0cdf5708ce818"}, "author": "", "url": "https://uk.finance.yahoo.com/news/sir-howard-not-shake-off-132814549.html", "ord_in_thread": 0, "title": "Sir Howard can not shake off the airport debate for RBS just yet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Howard"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Sep 5, 2015, 14:55 BST - UK Markets closed Sir Howard can not shake off the airport debate for RBS just yet By Ben Marlow | Telegraph – 26 minutes ago 324.60 0.00 \nAny hopes Sir Howard had of focusing on the RBS (LSE: RBS.L - news ) chairmanship look set to be dashed \nSir Howard Davies must have breathed a huge sigh of relief last week when he finally took over as chairman of Royal Bank of Scotland , having finally delivered his long-awaited but controversial report into airports expansion. \nHe is taking on one of the City’s most important and most challenging jobs trying to engineer the rescue of one of Britain’s largest high street lenders from a decade of disaster mired in massive losses and huge misconduct fines. \nUltimately he will be expected to sell off the taxpayer’s stake and return it to public ownership as a healthy, profitable entity. It’s a mammoth undertaking but one that could be seen as less daunting than being the government-appointed airports tsar tasked with solving Britain’s long-standing aviation capacity crisis. \nDavies’ Airports Commission was set up in 2012. It (Other OTC: ITGL - news ) took a year to compile a shortlist of options: a third runway at Heathrow; a second at Gatwick; or a new airport in the South-east called the Heathrow Hub; and a further two before the Commission finally published its 342-page dossier in June. Having racked up £20m of costs, the Commission ruled that Heathrow was the “best answer” . \nIf Sir Howard was hoping his recommendation might mean a quick end to the arduous three-year journey so he could concentrate on his new post at RBS with a clean slate, he is going to be bitterly disappointed. \nThe Commission’s decision was always going to provoke a long and public battle between Gatwick and Heathrow to win the backing of Government for their respective expansion plans, but it now looks like the people behind Gatwick are going to put up one almighty fight . \nHaving already published two reports outlining flaws in the findings, Gatwick’s bosses are about to send a third, more comprehensive, set of files to David Cameron. Some of the points have already been made but there are several new revelations that should strengthen Gatwick’s case. \nChief among those is the claim that the Commission’s calculation of the economic benefits of expanding Heathrow included the boost it would deliver to countries such as Germany and the US. If this is the case, then, frankly, Sir Howard’s entire work begins to look a little farcical. \nSurely this entire exercise was predicated on which proposal would be most beneficial to the UK economy, not any other country? \nOnce those figures are stripped out of the Heathrow case then there is very little to choose from between it and Gatwick, according to sources close to Gatwick. This point is further strengthened by Gatwick’s contention that the Commission’s economic analysis was based on Treasury guidelines, which showed that its economic impact was similar to that of Heathrow. \nYet despite this, the Commission chose to rely on separate analysis by PwC, which gave Heathrow a clear advantage, Gatwick claims. \nGatwick will also once again draw attention to the traffic forecasts that the Commission used. And rightly so. The figures forecast that it will hit 40m passengers a year by 2024, when in fact the airport will do so this year.To get such key figures so disastrously wrong is massively embarrassing and risks undermining the Commission’s entire case. No wonder Gatwick is mounting such a fierce fightback. \nAnother big oversight appears to have been made around the Commission’s estimate of costs to upgrade road and rail links to expand Heathrow, including putting the M4 in a tunnel, and who will foot the bill. Sir Howard’s number crunchers have come up with a figure of £5bn, which is probably far too low, but, more worryingly, the Commission said that Heathrow could pay for this and the boss of Heathrow has already ruled that out. \nGatwick said that its owners, the infrastructure fund Global Infrastructure Partners (Other OTC: PGPHF - news ) , which also owns City and Edinburgh airports, can provide a fully financed proposal and is willing to bear the expansion risks. \nGatwick also argues that the Commission’s interpretation of the law on the Government’s requirement to meet air quality rules is incorrect.While Heathrow already breaches EU rules on air pollution in some areas, even before expansion, Gatwick does not and is not forecast to, it claims. \nSupporters of Gatwick argue the case for its expansion is overwhelming because it’s cheaper, more deliverable, and would mean a further dent to Heathrow’s monopoly, while the latter’s claim is seriously constrained by cost, air quality, and noise. \nAs Stewart Wingate, Gatwick’s chief executive, steps up his campaign in the coming weeks, any hopes Sir Howard had of focusing on the RBS chairmanship look set to be dashed.", "external_links": [], "published": "2015-09-05T16:28:00.000+03:00", "crawled": "2015-09-05T16:55:50.429+03:00", "highlightTitle": ""}