{"organizations": [], "uuid": "d03cab33dc7fa9ea653d1df7b6aba2bcfd1042ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/i/e/v/p/image.related.afrArticleLead.620x365.gjj5ro.png/1441877225329.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/robb-says-jobs-guarantee-would-offend-china-20150910-gjj5ro", "country": "AU", "title": "Robb says jobs guarantee would offend China", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Robb says jobs guarantee would offend China | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T19:30:00.000+03:00", "replies_count": 0, "uuid": "d03cab33dc7fa9ea653d1df7b6aba2bcfd1042ca"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/politics/robb-says-jobs-guarantee-would-offend-china-20150910-gjj5ro", "ord_in_thread": 0, "title": "Robb says jobs guarantee would offend China", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trade Minister Andrew Robb says the government could legislate to safeguard Australian jobs but this would erode goodwill with the Chinese. Andrew Meares Share on twitter by Phillip Coorey The federal government could meet Labor's demand over the China-Australia Free Trade Agreement by legislating to safeguard Australian jobs without altering the agreement, but this would offend the Chinese and erode goodwill, Trade Minister Andrew Robb says.\nMr Robb made the concession on Thursday as the government started referring to the two-way deal as the \"China Export Agreement\" , prompting Labor to suggest that the proper name, the China-Australia Free Trade Agreement, had been dumped because it was proving politically unpopular.\nA government source denied this, saying the terminology tweak aimed to promote the great export potential of the deal.\nDuring more heated scenes in Parliament, the government repeated its claim that Labor's concerns about the deal were motivated by xenophobia and racism. Foreign Minister Julie Bishop called the opposition \"shameless, gormless creatures\" who \"should squirm\".\n﻿ Independent Senator Nick Xenophon, who harbours similar concerns to the Labor Party, rejected the xenophobic tag, saying the agreement contained loose language that he believed did not adequately safeguard jobs.\n\"Despite my name, I'm not xenophobic,\" he said. \"I've got serious concerns with it in its current form.\"\nNo different The government contends the provisions in the agreement are no different to those signed with Japan and South Korea, as well as the deal Labor signed with Chile. Labor contends only the China deal allows for the other country to bring in its own workers on projects valued at more than $150 million and removes mandatory skills assessments for imported tradespeople and others.\n It says if the government means what it says when it claims no job would be filled by a foreigner unless the Australian job market had been tested first, this should be enshrined in law, such as through a change to the Migration Act.\nMr Robb accepted that while this would not require a change to the details of the agreement, it would offend the Chinese because the government had never done it in the case of any other agreement with other countries.\n\"It's not difficult to do but it does create all sorts of complications,\" Mr Robb said. \"It creates a complication because we are going to do things to China tha we haven't done to any other country.\n\"For us to bring in legislation targeted at China, that is going to be an almighty snub and will sour the goodwill.\"\nHe said the demand reflected Labor's \"xenophobic, racist\" attitudes .\nBattle of wills The battle of wills over the trade deal is more about politics than substance, given legislation for the agreement will not be presented to Parliament until late October at the earliest. It needs to be passed by the end of 2015 for the deal to come into effect on January 1, 2016.\nThe fight is worrying business and industry, which fear the deal could be scuttled, while the claims about Chinese workers are playing into the September byelection in the seat of Canning, which has a high proportion of fly-in-fly-out mining workers.\nRecent polls show more Canning voters oppose the deal than like it.\nIn the seat on Thursday, shadow treasurer Chris Bowen said \"our suggestion to the government is very, very simple\".\n\"Just enshrine in the law that before a job is applied or supplied to somebody from overseas it's advertised in Australia. We can see if there are suitably qualified Australian applicants,\" he said.\n\"If [Tony Abbott] really believes that to be the case, then he'll simply agree with us and put it in the law of the land. That is a very simple suggestion by us.\"\nFailing working Australians The Australian Mines and Metals Association accused Labor \"of failing working Australians and the wider community\" by continuing to oppose the deal.\n\"It should urgently commit to passing this vitally important deal for our national prosperity,\" chief executive Steve Knott said.\n\"Australia needs our political leaders to show our region and the world that we are a mature and capable country, able to seize trading opportunities and competitive advantages. For Labor, this is a real test of its maturity and claims to be an alternative government.\"\nLabor has never said it would ultimately block the agreement if the government refused to yield but it is under pressure from the union movement to do so.\nThe agreement has an inbuilt two-year review, which shadow trade minister Penny Wong has previously said could be used by a Labor government to make changes down the track.", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-09-10T19:30:00.000+03:00", "crawled": "2015-09-10T21:08:44.475+03:00", "highlightTitle": ""}