{"organizations": [], "uuid": "99efc035b6f6eb44d29547d70f91b4d463cf7299", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/f/a/5/t/image.related.afrArticleLead.620x365.gjmazm.png/1442386388710.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/climate/warwick-mckibbin-says-he-turned-down-bernie-frasers-climate-job-20150914-gjmazm", "country": "AU", "title": "Warwick McKibbin says he turned down Bernie Fraser's climate job", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Warwick McKibbin says he turned down Bernie Fraser's climate job | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T14:53:00.000+03:00", "replies_count": 0, "uuid": "99efc035b6f6eb44d29547d70f91b4d463cf7299"}, "author": "Geoff Winestock", "url": "http://www.afr.com/news/policy/climate/warwick-mckibbin-says-he-turned-down-bernie-frasers-climate-job-20150914-gjmazm", "ord_in_thread": 0, "title": "Warwick McKibbin says he turned down Bernie Fraser's climate job", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Warwick McKibbin says he couldn't work with the current board of the Climate Change Authority. by Geoff Winestock Environment Minister Greg Hunt – if he keeps his job – is poised to overhaul the nine-person board of the Climate Change Authority, ending the dominance of directors inherited from the Gillard era and its toxic relationship with the Coalition government.\nThe government plans to appoint five new directors including a new chairman to replace former Bernie Fraser, who quit this month amid a spat about the direction of climate policy.\nMr Hunt denied that prominent economist Warwick McKibbin was sounded out about replacing Mr Fraser, a former Reserve Bank of Australia governor. The authority was set up by the previous Labor government to provide it with independent expert advice on policies to mitigate global warming.\nThe plan suggests the government believes a re-invigorated Climate Change Authority can be used to build support for its climate change policies. Until now it has chosen not to fill vacant board positions in line with its policy of abolishing the agency. It was only forced to maintain the authority as part of the deal with the Palmer United Party to pass its direct action climate policy.\nOne crucial task for the new board is a report \"on Australia's policies and future targets for reducing greenhouse gas emissions in the context of its international commitments and the action of other countries\". The report was a condition of the deal with the Palmer United Party and is due by the end of this financial year, which could be in the lead-up to the next federal election.\nProfessor McKibbin said he was approached about taking Mr Fraser's job. He said the authority itself had excellent staff but he would find it hard to work with its current board.\n\"I was asked informally if I was approached would I be interested and I said not under current circumstances,\" he said.\nMr Hunt denied that version of events although he could not explain how Professor McKibbin got the impression that he had been approached.\n \"His name has never been put forward and is not being put forward. He is widely respected but the story will soon be shown to be categorically incorrect,\" Mr Hunt said through a spokesman.\nMr Fraser resigned last week after publicly attacking the Abbott government's target for the Paris talks of cutting emissions by 26 per cent below 2005 levels by 2030. Professor McKibbin, who provided the economic modelling for the government's 26 per cent target, would have been an obvious choice as replacement.\nThe four remaining directors are Clive Hamilton, former executive director of the left-wing Australia Institute, economist John Quiggin, climate scientist David Karoly and the Chief Scientist Ian Chubb. The board lacks a quorum but in its last act before Mr Fraser resigned the board delegated the board's legal authority to Dr Karoly.\nThe Abbott government largely ignored the authority's advice and stopped asking it to produce reports. Last year, it appointed a parallel inquiry under climate change sceptic Dick Warburton to review the renewable energy target.", "external_links": [], "published": "2015-09-16T14:53:00.000+03:00", "crawled": "2015-09-16T22:04:28.970+03:00", "highlightTitle": ""}