{"organizations": [], "uuid": "fc31be233482b3dbc424c9f32f8f704298c0c6d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2013-02/19/full/1361286921-1171.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss#", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/irdai-on-policies-in-electronic-form-115091001059_1.html", "country": "IN", "title": "Irdai on policies in electronic form", "performance_score": 0, "site": "business-standard.com", "participants_count": 1, "title_full": "Irdai on policies in electronic form | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "fc31be233482b3dbc424c9f32f8f704298c0c6d8"}, "author": "Press Trust of India", "url": "http://www.business-standard.com/article/finance/irdai-on-policies-in-electronic-form-115091001059_1.html", "ord_in_thread": 0, "title": "Irdai on policies in electronic form", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Insurance Regulatory and Development Authority of India (Irdai) has asked insurers to maintain all records of policies and claims in electronic form for easy retrieval and compliance with various regulations.\n\n“Every insurer shall maintain a record of every policy issued and a record of every claim made... in electronic form irrespective of maintenance in any other form,” IRDA said in a notification.\n\nNotifying the Irdai (Maintenance of Insurance Records) Regulations, 2015, the regulator said the system of maintenance in electronic format should have necessary security features.\n\nTo ensure safety of data, it said, the records including those held in electronic mode, pertaining to all the policies issued and all claims made in India shall be held in data centres located and maintained in India only.\n\n“Every insurer should ensure that the records held are organised in such a manner as may be required for business use and easy retrieval so as to support policyholder service and compliance with the various laws, regulations, circulars, guidelines and such other regulatory framework as applicable from time to time,” it said.\n\nWith regard to the storage of records in electronic form, it said that insurers should maintain privacy and security of policyholder data, handling virus, vulnerability issues, security of hardware and software and backups, disaster recovery and business continuity and data archival.\n\n“Every insurer should within 90 days from the date of notification of these regulations, file with the Authority, their board approved policy on maintenance and storage of such records,” it said.\n\nWhere such a policy undergoes change, the same should be filed with the regulator, within 30 days from the date of such revision by the board, it added.", "external_links": [], "published": "2015-09-11T03:00:00.000+03:00", "crawled": "2015-09-10T23:04:41.184+03:00", "highlightTitle": ""}