{"organizations": ["Glencore"], "uuid": "ed80c196b8c8df893eeb57ed1a748e379a06ec36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-retail/?format=rss", "section_title": "Retail News | Retail Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/glencore-assets-plunge-hope-bondholders-155522307.html", "country": "GB", "title": "Glencore assets plunge but hope for bondholders remains", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Glencore assets plunge but hope for bondholders remains", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T18:55:00.000+03:00", "replies_count": 0, "uuid": "ed80c196b8c8df893eeb57ed1a748e379a06ec36"}, "author": "", "url": "https://uk.finance.yahoo.com/news/glencore-assets-plunge-hope-bondholders-155522307.html", "ord_in_thread": 0, "title": "Glencore assets plunge but hope for bondholders remains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Sep 28, 2015, 22:28 BST - UK Markets closed Glencore assets plunge but hope for bondholders remains Reuters - UK Focus – 5 hours ago -0.140 \nBy Michael Turner and Alasdair Reilly \nLONDON, Sept 28 (IFR) - Glencore (Xetra: A1JAGV - news ) 's debt and equity plunged on Monday on the back of a damning analyst note, with only the commodity firm's shortest bonds maturing this year managing to resist the sell-off. \nBut the outlook for the debt-laden firm does not appear to be as bleak as the headline figures suggest. Glencore still has access to billions of dollars of undrawn bank loans and, with the company teetering on the edge of losing its investment grade rating, some investors think dropping into junk territory will spark a rally in the issuer's debt. \nGlencore, which reported US$29.55bn of net debt at the end of June, took a hammering on Monday after analysts at Investec warned that if commodity prices stay where they are, and in the absence of a substantial restructuring, \"nearly all the equity value of both Glencore and Anglo American (LSE: AAL.L - news ) could evaporate.\" \nWhile Angle American's five-year CDS reacted by widening 10bp to 423bp, the drama lay in Glencore's CDS moves. The firm's five-year CDS leapt by 214bp to 745bp, according to CreditViews. Those swaps were trading at 368bp in early September. \nGlencore's Eurobonds due in 2016 and beyond plunged, with the issuer's US$1bn May 27, 2016 notes down over three points to 96.25, according to Thomson Reuters Eikon prices. The bonds have been gradually drifting down from par for the last month. \n\"People are scared,\" said a fixed income investor. \"Every day it goes lower and looks cheap, but then the next day it gets cheaper still.\" \nSHORTERS SWOOP \nThis pattern looks unlikely to cease anytime soon, as the bonds are being shorted by hedge funds, which has the effect of pushing prices even lower. \n\"There is no one really stepping in to do anything to stop the fall,\" said the investor. \"There are no marginal buyers, so anyone that can short it, is shorting it.\" \nCollapsing cash prices are even more pronounced at the further reaches of Glencore's curve. The issuer's 1.25bn April (LSE: 0N69.L - news ) 2018s are down over 5.5 points at 94.25, while the US$1.5bn May 2023s have dropped almost nine points to 73.7. \nThe equity has fared even worse, plunging more than 27% in the morning session on Monday to a low of 66.90p by 1:45pm. Shares (Berlin: DI6.BE - news ) quickly bounced from that low and were bid at 74.30p half an hour later. \nGlencore is being punished for its US$29.6bn debt pile - its net debt to adjusted Ebitda was at 2.71 times at the end of August, according to company statements. Earlier this month, Glencore raised US$2.5bn through a share placement, part of a wider plan to cut its net debt by a third by the end of next year but investors remain concerned about the company's outlook. \nAnglo American, meanwhile, had net debt of US$11.9bn, as at July 24, and has seen much less volatility in the stock markets with a far smaller share slump of 8.7%. \n\"Glencore seems to be a lightning rod for these things,\" said a bond investor. \nMONEY TO PAY \nGlencore's short-term debt, however, has held up much better, with the US$1.25bn October 23, 2015 notes still priced a shade above par at 100.02, implying that investors believe they will be repaid the full amount of principal due. \n\"I don't think there's any chance of non-payment,\" said a bond investor. \nThe company said at half-year that it had committed undrawn bank facilities and cash totalling US$10.5bn, comfortably above its US$3bn minimum liquidity threshold, after agreeing a US$15.25bn syndicated committed revolving credit facility in June. The loan, which was agreed with a global syndicate of 60 banks, is split between tranches paying margins ranging from 40bp to 45bp over Libor. \nBut liquidity is not the only challenge Glencore faces. The company is also battling to keep its investment grade rating. \nGlencore, BBB negative outlook by Standard & Poor's, will see its investment grade status under pressure if there is even a small move against the company in the spot prices of commodities such as zinc, nickel and coal, said Goldman Sachs (NYSE: GS-PB - news ) in a research note. \n\"A 5% drop in spot commodity and flat FX would see most of Glencore's credit rating metrics fall well outside the required range to maintain its IG (LSE: IGG.L - news ) rating,\" said the US bank. \"Recent underperformance suggests that the measures exercised are insufficient and more is needed.\" \nA move into junk will see swathes of investors with a mandate to only buy investment grade debt dump the bonds. But this might not be terrible news for Glencore's remaining bond investors. \n\"You may well see a rally,\" said one. \"Yes, the IG funds are no longer able to hold it, but you get different pools of investors move in and buy the debt that are excluded while it is rated triple B.\" \nThis phenomenon has some precedent. UK retailer Tesco (Xetra: 852647 - news ) was cut to sub-investment grade by S&P in January, and the yield on its US$1bn January 2017 bonds reacted by dropping from above 3% to 2.487%. They are now trading at 2.064%. \nGlencore did not respond to requests for comment. (Reporting by Michael Turner and Alasdair Reilly.; Editing by Julian Baker and Sudip Roy)", "external_links": [], "published": "2015-09-28T18:55:00.000+03:00", "crawled": "2015-09-29T00:34:57.580+03:00", "highlightTitle": ""}