{"organizations": ["General Motors"], "uuid": "1b5f23f3d8d0fa7b1ef6497238a0b233cafd05a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://g.foolcdn.com/editorial/images/178718/10874925075_a7a340f893_z_d1.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13asdd8km/*http://www.fool.com/investing/general/2015/09/09/general-motors-is-misunderstood-and-dramatically-u.aspx?source=eogyholnk0000001", "country": "GB", "title": "General Motors Is Misunderstood and Dramatically Undervalued", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "General Motors Is Misunderstood and Dramatically Undervalued", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T18:25:00.000+03:00", "replies_count": 0, "uuid": "1b5f23f3d8d0fa7b1ef6497238a0b233cafd05a0"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13asdd8km/*http://www.fool.com/investing/general/2015/09/09/general-motors-is-misunderstood-and-dramatically-u.aspx?source=eogyholnk0000001", "ord_in_thread": 0, "title": "General Motors Is Misunderstood and Dramatically Undervalued", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Adam Levine-Weinberg"], "text": "General Motors Is Misunderstood and Dramatically Undervalued Profit is rising at General Motors, yet the stock is getting cheaper and cheaper. Adam Levine-Weinberg TMFGemHunter Sep 9, 2015 at 11:25AM \nGeneral Motors ( NYSE:GM ) had a disappointing 2014 as a product safety scandal and a related spate of recalls cut into the company's profit and drove its stock price down. \nGM stock finally seemed to get back on track late last year and rallied as high as $39 in early 2015. In the past few months, though, the stock has plummeted again, falling below the $30 mark to levels not seen even in the midst of GM's recall woes last year. General Motors Stock Performance, data by YCharts . \nHowever, the massive selling in GM stock is at odds with the company's strong fundamentals. Simply put, General Motors is a misunderstood stock today and is a great opportunity for investors who are willing to wait patiently until the market catches on. \nNew bogeymen at General Motors Over the past few years, there has always been one fear or another keeping General Motors stock's valuation at a huge discount to the rest of the stock market. Whether it was the sovereign debt crisis in Europe, the huge spike in recalls in the U.S., or the strong dollar, bears have always found a reason to worry about GM's outlook. \nAs the European auto market has started to recover -- albeit tentatively -- and the U.S. recall crisis has faded, new worries have emerged. The dollar has continued to strengthen, pressuring GM's competitiveness overseas. Most of the big economies of South America have run into trouble, leading to a big drop in revenue -- and an increase in losses -- for the GM South America business segment. \nHowever, the biggest bogeyman by far has been the slowdown in the Chinese economy and its impact on the auto market there. Last month, GM registered its worst sales performance of the year in China, with sales down 4.8% compared to August 2014. One prominent Wall Street analyst went so far as to predict that GM's profit margin in China will be cut in half over the next 10 years. \nChina worries may be overblown While the slowdown in the Chinese auto market is concerning, investors may be overreacting to the headlines. For the past five quarters, GM's quarterly income from its Chinese joint ventures has remained steady at $0.5 billion. \nMoreover, just a month ago, a company spokesperson reiterated that the company expects to maintain a strong profit margin of 9%-10% in China for the full year. GM has been expecting an increase in competition all along, but it is offsetting those headwinds through cost control, greater penetration of the luxury market, and an increase in sales of more profitable SUVs. \nIt's all about North America The most important reason why GM investors should be confident is that the impact of China on the company's profit is often overstated. North America is still the dominant driver of GM's earnings -- and in this region, business is good. \nIndeed, in Q2, General Motors earned a record quarterly operating profit of $2.8 billion in North America. Over the past four quarters, it has earned $9.7 billion in the region, compared to only $2 billion in China. \nIn recent months, GM has continued to post solid U.S. retail sales results month after month, as demand for the company's trucks and SUVs remains as strong as ever. Plus, more help is on the way. GM is updating most of its Chevy car lineup with new versions that will go on sale in the next few months. GM will revamp its U.S. car portfolio in the next few months. Photo: The Motley Fool. \nWhile car sales have contracted in the U.S. this year as consumers have taken advantage of low gas prices to buy larger vehicles, the five models being updated still collectively represent nearly 20% of GM's U.S. sales. The 2016 versions of the two high-volume models in question -- Cruze and Malibu -- have both received very good reviews, which should drive solid sales and strong margins. \nGM is also developing a new profit stream from its auto-lending subsidiary, GM Financial. GM Financial recently became the exclusive provider of subsidized leases for GM vehicles in North America. This, along with other investments in its lending capacity, resulted in GM Financial providing financing for 29.8% of GM's retail sales in North America last quarter -- up from just 10.5% a year earlier. \nFor 2015, the growth in lending volume is being offset by the investments necessary to support this growth. However, General Motors expects strong profit growth at GM Financial beginning next year. \nValuation is bizarrely low After its most recent tumble, GM stock trades for less than six times the average analyst estimate for 2016 earnings. That represents a more than 50% discount to the broader market. \nThere are certainly risks to be aware of with General Motors. The pockets of economic weakness that have affected GM's performance in certain international markets could get worse. A recession in the U.S. could cause a sharp drop in auto sales and an increase in delinquencies within the lending portfolio. \nHowever, at the moment, GM is earning record profits in its home market. That's enough to offset quite a bit of weakness abroad. Moreover, GM has shown time and again a willingness and ability to restructure its operations to respond to supply demand imbalances. \nIn short, there's no good reason for GM stock to have fallen this far. There's no telling how long it will take for this panic to pass, but in the meantime, GM investors can enjoy a 5% dividend yield. That's a great incentive to be patient while General Motors proves its worth to Mr. Market. \nThe next billion-dollar iSecret The world's biggest tech company forgot to show you something at its recent event, but a few Wall Street analysts and the Fool didn't miss a beat: There's a small company that's powering their brand-new gadgets and the coming revolution in technology. And we think its stock price has nearly unlimited room to run for early in-the-know investors! To be one of them, just click here . \nAdam Levine-Weinberg owns shares of General Motors. The Motley Fool recommends General Motors. Try any of our Foolish newsletter services free for 30 days . We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . Compare Brokers Adam Levine-Weinberg Fool Contributor Adam Levine-Weinberg is a senior Industrials/Consumer Goods specialist with The Motley Fool. He is an avid stock-market watcher and a value investor at heart. He primarily covers airline, auto, retail, and tech stocks. Follow him on Twitter for the latest news and commentary on the airline industry! Follow @AdamLLW Article Info Sep 9, 2015 at 11:25AM Industrials", "external_links": [], "published": "2015-09-09T18:25:00.000+03:00", "crawled": "2015-09-10T02:14:49.016+03:00", "highlightTitle": ""}