{"organizations": [], "uuid": "f86f7b0b3a7eea73d3a967eece61975dd69a33ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=VLO", "section_title": "Yahoo! Finance: VLO News", "url": "http://finance.yahoo.com/news/keystone-xl-hillary-clinton-finally-215609697.html", "country": "US", "title": "Keystone XL: Hillary Clinton Finally Says No - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Keystone XL: Hillary Clinton Finally Says No - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 1, "uuid": "bc25787ddce9d9ce52d63a2151d1c357f059dd13"}, "author": "Zacks Equity Research", "url": "http://finance.yahoo.com/news/keystone-xl-hillary-clinton-finally-215609697.html#post-0", "ord_in_thread": 0, "title": "Keystone XL: Hillary Clinton Finally Says No - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After months of silence, Hillary Clinton finally opposed the Keystone XL pipeline project yesterday. The Democratic presidential candidate stated that moving ahead with the project basically implies failing to combat climate change.\n\nIt seems that TransCanada Corp. TRP – the company building the conduit – isn’t influenced by the opposition as the company revealed that it will go ahead to secure the permit for the pipeline development.\n\nKeystone XL Pipeline \n\nEven before Hillary Clinton’s comment, the Keystone XL oil pipeline expansion got both Democrats and Republicans fired up. The pipeline, if approved, would connect the oil sands of Alberta to the U.S. Gulf of Mexico. TransCanada would be the biggest gainer if any positive decision takes the pipeline out of the bottleneck.\n\nThe pipeline would run up to 1,179 miles and carry up to 830,000 barrels of oil per day. The $5.4 billion pipeline project would not only create jobs, but would also be an economic driver for the nation, reducing its dependence on foreign oil.\n\nWhile the Calgary-based company has already invested around $2 billion in the pipeline project, it is awaiting the final nod from the Obama administration. As the impasse over Keystone XL deepens we remain concerned about its effects on TransCanada. The Keystone project was originally partnered by TransCanada and ConocoPhillips COP. In 2009, TransCanada purchased its partners’ stake, becoming the sole owner.\n\nIt is to be noted that the first three phases of the Keystone pipeline have been built already. But while the network started operating in 2010, the Keystone XL portion of the system – that runs 800 miles through Montana, South Dakota and Nebraska, and requires U.S. approval – is still nowhere near finalization even after almost seven years of assessment amid the oil-versus-environment debate. Opposition from Hillary Clinton has further intensified concerns surrounding the future of the pipeline project.\n\nHowever, in the prevailing weak crude pricing environment, a decision against building the pipeline would be a big loss for the nation. Oil will definitely need to be transported into the country, if not through pipelines, then by the accident-prone rail routes. But building the pipeline at one go will drastically lower the transportation cost of oil.\n\nPipeline Project vs. Climate Change \n\nThe Keystone XL oil pipeline will end up being the major carrier of dirty tar sands oil into the refineries of U.S. Gulf of Mexico. Investors should know that tar sand oil extraction and refining processes demand significant energy and hence emit considerable carbon dioxide into the atmosphere.\n\nMoreover, the separation of tarry substance − which is nothing but bitumen − from sand and clay requires huge amounts of water. The water that is used up needs to be stored into tailing ponds as it is much polluted.\n\nHence, the opposition from Hillary Clinton is quite justified if the concern related to climate change is the first priority.\n\nNow, as the Keystone XL deadlock has deepened further in a political imbroglio, our apprehensions on the necessary approvals for the pipeline project continue to rise. There are companies whose fortunes are closely tied to the political game of Keystone. Let's take a look at some of these:\n\nSan Antonio-based Valero Energy Corp. VLO is the first name that comes to mind. The company is slated to benefit immensely as a key customer of the Keystone XL Pipeline. Our bullishness stems from the company’s refiners in the Gulf, which would see its margins skyrocket once the tide of crude is shifted to Canada from dearer overseas sources.\n\nFurther, in Dec 2013, the company came out with an initial public offering for its logistics master limited partnership (MLP) – Valero Energy Partners LP VLP. This MLP has not only enabled Valero to monetize its existing infrastructure, but also offers a favorable financing option for future logistics projects.\n\nThe spin-off was a master stroke by the company for it holds the option of acquiring 15% of the pipeline. In case the deal is approved, the tax advantages alone, we feel, would bring another surefire winner in our ranks.\n\nApart from Valero, the world’s largest publicly traded energy company ExxonMobil Corp. XOM is also another stock we will keep our eyes peeled. The energy giant’s significant refining presence in the Gulf stands to see improved margins once the flow of Canadian sour crude rises. We feel that even if crude prices improve slightly, the company would still be able to boost its refining margins.\n\nFinally in our list comes Findlay, OH-based Marathon Petroleum Corp. MPC with its extensive downstream presence. The company’s is the fourth largest domestic refiner with a combined crude oil processing capacity of approximately 1.7 million barrels per day through its portfolio of seven refineries. Of this, its Detroit refinery is strategically located with adequate capacity to take advantage of the cheaper Canadian crude flow via the Keystone pipeline.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report \n \nVALERO ENERGY (VLO): Free Stock Analysis Report \n \nCONOCOPHILLIPS (COP): Free Stock Analysis Report \n \nEXXON MOBIL CRP (XOM): Free Stock Analysis Report \n \nTRANSCDA CORP (TRP): Free Stock Analysis Report \n \nMARATHON PETROL (MPC): Free Stock Analysis Report \n \nVALERO EGY PTNR (VLP): Free Stock Analysis Report \n \nTo read this article on Zacks.com click here. \n \nZacks Investment Research Commodity Markets Business Hillary Clinton Keystone XL", "external_links": [], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T06:06:21.259+03:00", "highlightTitle": ""}