{"organizations": [], "uuid": "94f6034b3853f94bd457e828378d8a9225b32561", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509260123.html", "country": "US", "title": "Kenya: Support for Strike Is Protest Against Greed", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Support for Strike Is Protest Against Greed", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T12:12:00.000+03:00", "replies_count": 0, "uuid": "94f6034b3853f94bd457e828378d8a9225b32561"}, "author": "", "url": "http://allafrica.com/stories/201509260123.html", "ord_in_thread": 0, "title": "Kenya: Support for Strike Is Protest Against Greed", "locations": ["Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gabriel Dolan"], "text": "opinion By Gabriel Dolan \nSupporting the ongoing teachers strike is not to deny the numerous failings in the education sector. \nAbsenteeism has reached 50 per cent in some counties and lack of discipline and commitment can hardly be attributed to poor remuneration alone. \nOf course failure by the Ministry of Education to plan properly for the introduction of Free Primary Education (FPE) has led to overcrowding, understaffing and shortages in classrooms and learning materials. \nIn 2002, there were six million children in primary school education; by 2013 the figure stood at 11 million. \nDEFICIT OF TEACHERS \nThere is a shortage of 100,000 teachers in public schools and most teachers under the Teachers Service Commission have moved their own children to private schools; where they will be educated by trained teachers who could not be absorbed with TSC. Bizarre but true. \nBut while parents discuss the growth, cost and performance of private schools in national examinations, many of us forget that matters are worse on the other end of the scale in the low cost informal schools found in urban settlements. \nThe Ministry of Education abandoned the provision of education for the masses in informal settlements many decades ago. There are roughly 1,600 informal schools in the slum settlements of the country. \nResearch by African Population Health Research Centre (APHRC) shows that in Nairobi 63 per cent of these children do not learn in public schools while in Mombasa and Eldoret that figure is over 50 per cent. \nELEMENTARY EDUCATION \nMost of these schools are run by churches or charities. Some have excellent facilities and perform well in national examinations but the majority have no permanent buildings, few trained teachers and lack even playgrounds. \nThat is the shocking state of FPE in this country. \nThese schools are located far away from the public view but their very existence points to the shame and failure of successive governments to provide even elementary education to the poorest of its citizens. \nWe must not be afraid to ask whether FPE has been a monumental failure. \nIt has pushed the middle class children into the profit making private schools and the poorest who cannot afford cost sharing into the informal schools. \nPUBLIC SYMPATHY \nYet the education crisis does provide an opportunity to examine the nation's conscience and values. \nPublic support for teachers is a vote of protest against the greed, corruption and wastefulness at all levels of government. \nTeachers live alongside MCAs who earn ten times more and enjoy two or three junkets abroad each year. Teachers too are the most knowledgeable group on matters of CDF and theft at the village level. \nThey get public sympathy because of the great inequality in public salaries and the sheer consumption and greed of the political class. \nFAILED THE TEST \nI expected Cord to support Ababu Nabwamba's motion to cut salaries by 50 per cent. They too failed the integrity and leadership test. There is no real difference between them and the ruling party; the latter have just better access to the trough. \nSo we are headed for more unrest unless the whole political class admit that they are jointly responsible for the education crisis. \nThe education crisis is a crisis of integrity in leadership that has been looming on the horizon for decades. Brinksmanship will not solve it. Only humility can. Kenya \nThe Employment and Labour Relations Court Friday broke the stalemate over teachers' pay by directing them to return to … see more » Copyright © 2015 The Nation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-26T12:12:00.000+03:00", "crawled": "2015-09-27T05:37:18.418+03:00", "highlightTitle": ""}