{"organizations": ["VW"], "uuid": "5c1f91611a33f1c10c5fccd3760511ac71c8ac0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/KW59XOyNI6rHhwifIFXmsQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/1833e676c2e4cb6b6ad1ba725cb6862d8a9ec08d_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Top stories from Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/vw-appoint-chief-pollution-scandal-215232372.html", "country": "GB", "title": "VW to appoint new chief as pollution scandal spreads", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "VW to appoint new chief as pollution scandal spreads", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T02:52:00.000+03:00", "replies_count": 0, "uuid": "5c1f91611a33f1c10c5fccd3760511ac71c8ac0d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/vw-appoint-chief-pollution-scandal-215232372.html", "ord_in_thread": 0, "title": "VW to appoint new chief as pollution scandal spreads", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 25, 2015, 02:49 BST - UK Markets open in 5 hrs 11 mins VW to appoint new chief as pollution scandal spreads By Simon Morgan | AFP – 1 hour 56 minutes ago View Photo \n\nVolkswagen (Other OTC: VLKAF - news ) readied Thursday to announce a new chief as the scandal over its rigged emissions tests showed no signs of slowing down, with the EU calling for national investigations and the US saying it was taking the scam's alleged health implications \"very seriously\". \nThe auto giant is expected to name a new chief executive on Friday to help steer it through the escalating crisis, with German media reporting that the current boss of VW's Porsche luxury sports car division, Matthias Mueller, is the favourite to replace Martin Winterkorn. \nWinterkorn resigned on Wednesday in the wake of VW's shock admission that 11 million of its diesel cars are equipped with devices that can cheat pollution tests. \nThe scandal, which emerged last Friday when US officials publicly accused Volkswagen of cheating and launched a probe, has reverberated around the world and sent the company's share price plummeting. \nWith suspicions spreading to other car manufacturers, the European Union urged its 28 member states to investigate whether vehicles in their countries comply with European pollution rules. \n\"The (European) Commission calls on national authorities to look into the implications for vehicles sold in Europe and ensure that EU pollutant emission standards are scrupulously respected,\" a statement from EU Industry Commissioner Elzbieta Bienkowska said. \n\"Our message is clear: zero tolerance on fraud and rigorous compliance with EU rules,\" said Bienkowska. \nIn Britain, Transport Secretary Patrick McLoughlin said new checks would be carried out across the automobile industry to ensure that the \"unacceptable actions\" at Volkswagen were not repeated. He also backed calls for a Europe-wide probe. \nAuthorities in France and South Korea have already announced investigations into VW's actions. \nIn the United States, the Justice Department said late Thursday that it was taking the allegations against VW \"very seriously\" and was working closely with the Environmental Protection Agency in its own inquiry. \n\"We take these allegations, and their potential implications for public health and air pollution in the United States, very seriously,\" a department spokesman said. \nIt (Other OTC: ITGL - news ) was regulators from the Environmental Protection Agency and the California Air Resources Board who last Friday accused Volkswagen of designing a clean-air cheating device software to evade US limits on nitrogen oxide and other pollutants. \n- BMW (Swiss: BMW.SW - news ) shares tumble - \nIn response to the cheating revelations, investors dumped Volkswagen shares on Monday and Tuesday, sending it into 35-percent meltdown and wiping 25 billion euros ($28 billion) off the company's market. \nThe following day VW chief executive Martin Winterkorn resigned, saying he was \"stunned that misconduct on such a scale was possible in the Volkswagen group\" and that he accepted responsibility as chief executive. \nThe 68-year-old said he was \"not aware of any wrongdoing\" on his part. \nThe resignation appeared initially to turn the tide for Volkswagen on the market, with its shares shooting up 7.9 percent to hit an intraday high of 120.30 euros in the morning in Frankfurt. They ended the day only very modestly higher by 0.58 percent. \nWith the German car industry reeling, top-of-the-range automaker BMW suffered collateral damage on Thursday when its shares skidded after the weekly Auto Bild reported that emissions from one of its diesel models were 11 times higher than European Union norms. \nWhile there was no indication that BMW had cheated in pollution tests -- suggestions it hotly denied -- the report nevertheless shook investors. \nAfter initially plunging 9.7 percent on the report, BMW shares ended the day 5.15 percent lower. \n- Porsche chief frontrunner - \nAs questions grow over how Volkswagen may have carried out such a large-scale scam, the world's biggest auto-manufacturer by sales is seeking a chief executive to steer it through the difficult terrain ahead. \nAccording to the business daily Handelsblatt, the supervisory board has settled on the current chief executive of Porsche, Matthias Mueller. \nBorn in Chemnitz in former East Germany, Mueller was appointed CEO at Porsche in 2010 and enjoys the backing of the group's family shareholders. \nHis nomination would be made public early on Friday afternoon, the newspaper said. \nBeyond repairing the damage to its reputation, the new boss will have to tackle the host of legal challenges facing the company. \nVW has set aside 6.5 billion euros in provisions for the third quarter to cover the potential costs of the disclosures. \n- Downgrade threat - \nAccording to the US authorities, VW has admitted that it equipped about 482,000 cars in the United States with sophisticated software that covertly turns off pollution controls when the car is being driven. \nIt turns them on only when it detects that the vehicle is undergoing an emissions test. \nWith the so-called \"defeat device\" deactivated, the car can spew pollutant gases into the air, including nitrogen oxide, in amounts as much as 40 times higher than emissions standards, said the Environmental Protection Agency. \nThe EPA is conducting an investigation that could lead to fines amounting to a maximum of more than $18 billion. \nPrivate law firms are also lining up to take on the German company, with a class action suit already filed by a Seattle law firm. \nVolkswagen SEAT unit fitted over 500,000 cars it manufactured with the pollution control defeat device, Spanish newspaper El Pais reported Thursday. \nStandard & Poor's warned it may cut Volkswagen's credit rating over the pollution cheating scandal, as fellow rating agency Fitch did on Wednesday.", "external_links": [], "published": "2015-09-25T02:52:00.000+03:00", "crawled": "2015-09-25T04:54:02.589+03:00", "highlightTitle": ""}