{"organizations": [], "uuid": "0f94300cb655b942bfb678fb2e4da4287c232527", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/06/Drought-Ret.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/as-drought-fear-looms-large-narendra-modi-govt-faces-intense-criticism/132869", "country": "IE", "title": "As drought fear looms large, Narendra Modi govt faces intense criticism", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "As drought fear looms large, Narendra Modi govt faces intense criticism | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T21:05:00.000+03:00", "replies_count": 0, "uuid": "0f94300cb655b942bfb678fb2e4da4287c232527"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/as-drought-fear-looms-large-narendra-modi-govt-faces-intense-criticism/132869", "ord_in_thread": 0, "title": "As drought fear looms large, Narendra Modi govt faces intense criticism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Telcos get a boost with spectrum trading nod End of monsoon session ends early GST roll-out hopes Coal linkages to Bihar power project cleared India has just suffered back-to-back drought years for only the fourth time in over a century, summer crops are wilting and reservoir water levels are at their lowest in at least a decade for the time of year.\nYet Prime Minister Narendra Modi ’s government has not held a high-level meeting to discuss drought relief for farmers since June, when its weather office forecast – correctly as it turned out – that this year’s monsoon rains would fall short.\nFifteen months since winning power, in part on his record in boosting agriculture as chief minister of Gujarat, Modi faces growing criticism for failing to shield Indian farmers from deepening hardship.\n“The whole government machinery became complacent,” said Ashok Gulati, an agricultural economist and former adviser to New Delhi. After rain in June, the government “took no precautionary measures” even as the weather turned dry, he told Reuters.\nThe lack of urgency risks worsening rural distress ahead of state elections Modi must win to stand a better chance of passing tough reforms. The next to go to the polls is Bihar, home state of Radha Mohan Singh, the minister responsible for agriculture and farmers’ welfare.\nSingh has been out campaigning in India’s third-largest state by population. A senior official at his ministry said the government was ready to help farmers deal with crop losses. But there were no plans for any new meetings, said the official, who requested anonymity.\nThe government was waiting for states to formally declare a drought before it could pass on benefits, Singh said on Tuesday.\nMODI “ONLY TALKS”\nMeanwhile, across villages in the Maharashtra, weeds grow through drooping sugarcane and soybean crops. Rats infest sunbaked rice fields.\nRains were more than 40 per cent below normal in central Maharashtra. Farmers there, worried that their crops will fail again, said they had lost hope with Modi.\n“He only talks,” said Nanasaheb Patil, 32, a rice grower in the hill village of Bamnoli. Patil got no government aid when unseasonal rain damaged his crops earlier this year. “Since he came to power, nothing has changed for us.”\nCrop damage is no longer as big a worry for India as it was as recently as eight years ago, thanks to bumper harvests of staples like rice, wheat and sugar, aided by government subsidies.\nBut for India’s nearly 200 million marginal farmers, many of whom borrow heavily to cultivate plots smaller than two acres, the fate of one crop can make the difference between life and death.\nReports of farmer suicides are rising, especially from the drought-hit Maharashtrian district of Marathwada, where nearly 600 have killed themselves so far this year, according to local reports. Rains in Marathwada were less than half normal levels.\nMONSOON MISERY\nIndia’s June-September monsoon rains are so far 14 per cent below normal due to El Nino, a weather pattern caused by Pacific Ocean warming that can cause drought in South Asia. Rains were 12 per cent deficient in 2014, cutting grains output by 4.7 per cent in the year to June 2015.\nFarm output could fall this year too. However, the senior agriculture official said he did not foresee a major drop as the sown acreage has been robust.\nBut unlike last year when the monsoon retreated late, this year’s monsoon has already started withdrawing and could leave too little moisture for farmers to sow winter crops like wheat and rapeseed on time.\nWinter crops, heavily dependent on water from reservoirs at 84 per cent of average levels over the last decade, account for about half the grains output.\n“Even if we assume that there won’t be any contraction, the agriculture sector can’t grow beyond 2 per cent in the 2015/16 fiscal year,” Gulati said.\nFirst Published on September 09, 2015 1:05 pm", "external_links": [], "published": "2015-09-09T21:05:00.000+03:00", "crawled": "2015-09-10T02:18:12.622+03:00", "highlightTitle": ""}