{"organizations": [], "uuid": "b4fdbdfed7b19f8edaeb29c15d9aa02e4a4f65e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/0/8/b/l/u/image.related.articleLeadwide.620x349.gjjqrt.png/1431374208650.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/the-economy/abs-data-shows-people-are-finding-jobs-but-cant-find-the-hours-20150910-gjjqrt.html", "country": "AU", "title": "ABS data shows people are finding jobs, but can't find the hours", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "ABS data shows people are finding jobs, but can't find the hours", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "b4fdbdfed7b19f8edaeb29c15d9aa02e4a4f65e7"}, "author": "", "url": "http://www.smh.com.au/business/the-economy/abs-data-shows-people-are-finding-jobs-but-cant-find-the-hours-20150910-gjjqrt.html", "ord_in_thread": 0, "title": "ABS data shows people are finding jobs, but can't find the hours", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video will begin in 5 seconds.\nDon't play Play now Confident economy boosting employment: Abetz Unemployment dropped by 0.1 per cent the because of the government's economic plan says Employment Minister Eric Abetz.\nPT1M13S 620 349 It's easier to get a job than it has been at any time in the past two years, although not as easy to get good hours.\nThe latest employment figures show 61 per cent of Australia's working and retirement age population was in work in August, almost back to the level the Coalition inherited when it took office in September 2013.\nMore people have jobs, but those jobs are not delivering the income growth.\nJames McIntyre, Macquarie Securities Sliding well before the Abbott government took office, Australia's employment-to-population ratio bottomed at 60.5 per cent in October 2014 and has been climbing back since.\nIn the past 10 months an extraordinary 245,000 extra Australians have found work. Photo: Erin Johanson\nIn the past 10 months an extraordinary 245,000 extra Australians have found work, compared to just 68,000 in the Coalition's first 13 months in office.\nAdvertisement Australia's unemployment rate appears to have stabilised, staying in a tight band of 6 to 6.3 per cent for more than a year. The August unemployment rate was 6.2 per cent, down from 6.3 per cent in July.\nBut the good news on jobs hasn't been matched by good news on hours worked. Since October the number of Australians in jobs has climbed 2 per cent, way more than is needed to keep pace with population growth, but the number of hours worked has climbed only 1.3 per cent.\nThe number of those with full-time jobs climbed only 1.7 per cent. Photo: Louie Douvis\nThe number of Australians in part-time jobs climbed 3.2 per cent, while the number with full-time jobs climbed only 1.7 per cent.\n\"The number of hours worked per employee continues to decline,\" said Macquarie Securities analyst James McIntyre. \"More people have jobs, but those jobs are not delivering the income growth at the pace that would ordinarily be expected.\"\nIf job-creation continues at the pace since October, Tony Abbott will comfortably fulfil his election promise of creating 1 million new jobs in his first five years, but if it reverts to the average pace since the election he will fall well short.\nThe so-called underemployment rate calculated by the Bureau of Statistics edged up to 8.4 per cent from 8.2 per cent last August. Australians are defined as underemployed when they are working, but working fewer hours than they would like.\nThe so-called underutilisation rate, which incorporates both the unemployment and underemployment rates, was 10.6 per cent in August, up from 10.4 per cent a year earlier.\nThe Bureau said an extra 17,400 Australians found jobs in August, but its estimate has to be taken with a grain of salt. Its background notes say that because it derives its estimates from a survey it can only be reasonably certain the result was somewhere between a loss of 40,600 jobs and a gain of 75,400.\nOn a trend basis the unemployment rate is improving in Queensland (down to 5.5 per cent), steady in NSW, South Australia and the Northern Territory (6.5, 7.2 and 4.1 per cent) and worsening in Victoria, Western Australia, Tasmania and the ACT (7.1, 5.5, 6.6 and 5.1 per cent).\nPeter Martin is economics editor of The Age .\nFollow Peter Martin on Facebook", "external_links": ["http://datawrapper.dwcdn.net/b90fW/2/", "http://datawrapper.dwcdn.net/GHUbg/5/", "http://pubads.g.doubleclick.net/gampad/ads?sz=4x1&iu=/6411/vid.smh/news&ciu_szs=300x250&impl=s&gdfp_req=1&env=vp&output=xml_vast2&unviewed_position_start=1&cust_params=channel%3Dnews%26show%3Dnationalnews%26ctype%3Darticle%26source%3DABC&correlator=463195", "https://www.facebook.com/pages/Peter-Martin/713739465438660"], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-10T23:48:56.408+03:00", "highlightTitle": ""}