{"organizations": [], "uuid": "4cdf9a6e211a38bfd92af1d65ad2a3265b00e6c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/it-computer-skills-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/jobs/why-it-professionals-constantly-need-to-upskill/135157", "country": "IE", "title": "Why IT professionals constantly need to upskill", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Why IT professionals constantly need to upskill | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T08:00:00.000+03:00", "replies_count": 0, "uuid": "4cdf9a6e211a38bfd92af1d65ad2a3265b00e6c6"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/jobs/why-it-professionals-constantly-need-to-upskill/135157", "ord_in_thread": 0, "title": "Why IT professionals constantly need to upskill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Indian rupee falls 5 paise to 66.38 against US dollar in early trade DishCo - The One-Stop Solution to All Your Hunger Problems Eden Bag: A Budding Ecosystem in the Indian Food Market now Offers “Cash only on Satisfaction” for its Customers News reports in the last few months reveal that many top-tier IT services firms are cutting employee strength, specifically their middle management. The retrenchments are primarily triggered by the lack of desired skill-sets amongst experienced employees. The Simplilearn Customer Insight Survey illustrated the fact that a negligible percentage of IT workers in the age group of 35-55 saw a career increment last year. This indicates a growing skill gap between industry requirements and employee skills. This is especially true for individuals in the information technology industry, and other industries are also expected to feel the ripple effect.\nA national survey in the UK, conducted by a group of economists working with Prof Andrew Oswald of the University of Warwick, found that the job satisfaction of the average employee deteriorates dramatically during mid-life. On the contrary, the number of professionals overcoming a mid-career crisis and experiencing increased job satisfaction are reaching even higher levels compared to early days as an employee. Such a career path will lead to a U-shaped professional graph providing a taste of both success and failure in life.\nRecently, we have come across many IT companies which are making a shift in their traditional hiring pattern. Companies such as Wipro are focusing on automation and technology enhancement that will lead to an alarming one-third of the entire employee count to be slashed. IBM has 4.3 lakh employees across the globe, of which 1.3 lakh are in India, the largest employee base for them globally. News reports say that IBM plans to cut down its head count to 1 lakh in India by the end of 2015. While these well-known foreign and home-grown IT companies claim that layoffs are a part of the organisation’s technology transformations to keep up with changing business needs, it has set alarm bells ringing for a growing number of IT employees in the experience bracket of 5-10 years.\nMeanwhile, organisations are also beefing up their training facilities and are keen on building talent in-house rather than external hiring.\nIndia’s total IT workforce is estimated at around 30 lakh and mid-level managers account for 10-15% of the workforce at tier-1 companies. Their primary job is to allocate engineers to different projects, manage software quality and train new employees. Being involved in purely managerial roles, many of them have lost touch with their basic technical skill of coding. To make matters worse, most of these managerial jobs are not required as these functions are getting automated in such firms. Automation is much more cost-effective in comparison to human resources. Therefore, many companies are automating the entire process of deploying staff across different customer projects using a single dashboard. This process has rendered human resources redundant, leading to uncertainties. Most of these employees were hired during the boom years of Indian IT.\nThe World Economic Forum’s Human Capital Report 2015 has shed valuable insights on the rising demand of talent that will act as a key factor for connecting innovation, competitiveness and growth in the 21st century. The report states that the current education system is inadequate to create appropriate skilled resources to match up to industry expectations. The exponential rate of technological and economic development has increased the gap between education and market requirement. The widening skill gap has necessitated more investment from the company for upskilling their recruits. With the rise of new technologies, new functions are added to the system, while eliminating various others. In fact, changing one’s mindset and embracing newer technologies and responsibilities will also help professionals gain further mileage in their career.\nLynda Gratton, professor of management practice at the London Business School and leader of the Future of Work consortium, argues that the role of middle management is fast disappearing. She reckons that technology is rapidly replacing middle managers with its ability to monitor performance closely, provide instant feedback, and even create reports and presentations.\nAdditionally, the role of the mid-level managers is threatened with the emergence of Gen Y in the workforce, who see no value in reporting to someone who simply keeps track of what they do.\nGiven the increasing importance of automation in the IT services industry, it becomes imperative for mid-level IT professionals to upgrade their professional skills via industry-specific certifications recognised by global accreditation bodies. “If you don’t reskill yourself, you are gone. What got you here, will not take you forward,” Saurabh Govil, the head of HR, Wipro, succinctly summarises the state of affairs in an interview to a leading national newspaper. Moreover, India Skills Report 2015 has estimated that as many as 72% of the employers will prefer to hire candidates below 35 years in the coming years.\nFurthermore, research shows that 91% of hiring managers consider certification a criterion while recruiting, and another 81% of hiring managers believe that certified professionals are far more productive than their non-certified counterparts.\nEmployers don’t need people who can be replaced by machines any more. They need skilled professionals who can add real value. This implies that jobs aren’t secure unless employees are up-to-date with professional skills. Today, one is expected to bring in additional value to the table with technical skills in Big Data, Analytics, advanced cloud computing, security and even digital marketing. Cross-training not only complements the skill-sets but also makes the professional more employable and valuable at the workplace.\nThe author is founder & CEO, Simplilearn\n 14, 2015 12:00 am", "external_links": [], "published": "2015-09-14T08:00:00.000+03:00", "crawled": "2015-09-15T08:19:48.608+03:00", "highlightTitle": ""}