{"organizations": [], "uuid": "afc472f88b10a5f6f7676108fcb794d7d33019b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/australia-shares-rally-second-day-033341296.html", "country": "US", "title": "Australia shares rally for second day led by banks", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Australia shares rally for second day led by banks", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T06:33:00.000+03:00", "replies_count": 0, "uuid": "afc472f88b10a5f6f7676108fcb794d7d33019b5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/australia-shares-rally-second-day-033341296.html", "ord_in_thread": 0, "title": "Australia shares rally for second day led by banks", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Sep 9, 2015, 05:45 BST - UK Markets open in 2 hrs 15 mins Australia shares rally for second day led by banks Reuters - UK Focus – 1 hour 12 minutes ago \n* 148 shares up, 40 down, 12 unchanged (Adds analysis, quotes, stocks on the move) \nBy Pauline Askin and Naomi Tajitsu \nSYDNEY/WELLINGTON, Sept 9 (Reuters) - Australian shares rose for a second straight day on Wednesday, led by broad-based gains across all sectors after a surge in Chinese stocks sparked a rebound in global markets. \nMajor banks led the rally on expectations of another rate cut by the Australian central bank after consumer confidence slid in September. \nThe S&P/ASX 200 index rose 1.7 percent, or 88.1 points, to a one-week high of 5,204.0 by 0300 GMT. The benchmark jumped 1.7 percent on Tuesday. \n\"When you look at those consumer numbers you'd have to say the odds are still stacked favouring a further rate cut in this calendar year and perhaps that's one of the reasons we're seeing the banks up today,\" James McGlew, executive director of corporate stockbroking at Argonaut. \nThe \"big four\" lenders Commonwealth Bank, Westpac , NAB and ANZ were all up more than 3 percent. \nIron ore producers such as Fortescue Metals (Dusseldorf: FVJ.DU - news ) and Rio Tinto jumped but BHP Billiton (NYSE: BBL - news ) was down 1.5 percent after going ex-dividend. \nOil and gas producer Santos (Dusseldorf: STS1.DU - news ) surged nearly 8 percent on a news report that it could become Woodside's next target if the Oil Search (Dusseldorf: OIS.DU - news ) bid fails to gain traction. \nWall Street rose 2 percent following the three-day U.S (Other OTC: UBGXF - news ) . holiday weekend.. \nChina's major stock indexes rose extending gains of the previous session suggesting Beijing's efforts to stabilise the market is beginning to pay off.. \nInvestors will be closely watching for any comments about the strength of the Chinese economy by Reserve Bank of Australia deputy governor later in the day, after Australia's exports to its biggest market slid in August. \nFor more individual stocks activity click on \nNew Zealand's benchmark NZX50 share index rose 44.91 points, or 0.8 percent, to a one-week high of 5,655.22 in early trade, pushing higher on the back of gains in healthcare- and telecommunications-related shares. \nFisher and Paykel Healthcare rose 2.8 percent to a three-week high of NZ$7.64, while retirement home operator Summerset rose 2.7 percent. Both companies have perked up after stumbling during the global broad market sell-off seen in past months. \nTelecom shares extended gains after a major review of the government telecommunications and broadcasting markets announced on Tuesday stoked optimism that projects to improve infrastructure would boost the sector. (Editing by Jacqueline Wong)", "external_links": [], "published": "2015-09-09T06:33:00.000+03:00", "crawled": "2015-09-09T07:49:19.115+03:00", "highlightTitle": ""}