{"organizations": ["Whitbread", "Quindell PLC"], "uuid": "336ef45fe079792b8d644d9f9bd3d51e58847090", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-travel-leisure/?format=rss", "section_title": "Travel Industry News | Leisure Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/now-perfect-time-buy-quindell-103221182.html", "country": "US", "title": "Is Now The Perfect Time To Buy Quindell PLC, Whitbread plc And Brewin Dolphin Holdings plc?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is Now The Perfect Time To Buy Quindell PLC, Whitbread plc And Brewin Dolphin Holdings plc?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T13:32:00.000+03:00", "replies_count": 0, "uuid": "336ef45fe079792b8d644d9f9bd3d51e58847090"}, "author": "", "url": "https://uk.finance.yahoo.com/news/now-perfect-time-buy-quindell-103221182.html", "ord_in_thread": 0, "title": "Is Now The Perfect Time To Buy Quindell PLC, Whitbread plc And Brewin Dolphin Holdings plc?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Sep 30, 2015, 15:52 BST - UK Markets close in 38 mins. Is Now The Perfect Time To Buy Quindell PLC, Whitbread plc And Brewin Dolphin Holdings plc? By Peter Stephens | Fool.co.uk – 4 hours ago 4,662.00 +85.0000 \nShares in Quindell (LSE: QPP) are 2% higher today after the company reported a smaller pretax loss for the first half of the current financial year. While the reduction in pretax loss is only £0.2m, falling from £35.7m last year to £35.5m this year, it shows that the financial performance of the company has not deteriorated, which has been a major concern for its investors in recent months. \nHowever, the results include the performance of Quindell's professional services division, which has now been sold. And, since the end of the first-half period, Quindell has experienced a continuation in challenging trading conditions owing to reputational damage. It has also seen a decline in sales at its Himex division, where there was a temporary disruption in supply with one of its US customers. \nClearly, Quindell is a company in the midst of very difficult circumstances. It remains under investigation by the SFO, is restructuring following the sale of a major part of its business (from which it will return up to £500m to shareholders) and it is also now the subject of a £9m legal claim. So, while today's update is something of a relief for the company's investors, Quindell's share price may yet come under further pressure, which makes it a company worth watching rather than buying at the present time. \nSimilarly, owner of Costa Coffee and Premier Inn, Whitbread (LSE: WTB), is also enduring a somewhat challenging period. That's because the impact of the Living Wage is likely to cause its costs to go up and, rather than have squeezed margins, Whitbread is apparently planning on raising prices. This could hurt sales and cause the company to disappoint on its ambitious earnings growth guidance. \nOf course, Whitbread remains a high quality company with a sound balance sheet and very efficient, lean business model. However, having risen by 189% in the last five years, its shares appear to be fully valued due to them trading on a price to earnings (P/E) ratio of 19.7. And, while the coming months could yield continued growth, rising costs may hurt the business in the long run. \nMeanwhile, wealth manager Brewin Dolphin (LSE: BRW) appears to offer a potent mix of income, growth and value credentials. For example, it trades on a P/E ratio of 14.8 and, when its earnings growth forecasts for the next two years are taken into account, this equates to a price to earnings growth (PEG) ratio of just 1.1. This indicates that Brewin Dolphin's shares offer growth at a very reasonable price. \nFurthermore, as with a number of financial stocks at the present time, Brewin Dolphin offers a top notch yield, with it currently standing at 4.4%. And, with it being covered 1.5 times by profit, there is significant scope for it to rise in future, thereby offering inflation-beating dividend growth in 2016 and beyond. \nOf course, finding stocks that are worth adding to your portfolio is a tough task, which is why the analysts at The Motley Fool have written a free and without obligation guide called 10 Steps To Making A Million In The Market. \nIt's a simple and straightforward guide that could make a real difference to your portfolio returns. As such, 2015 could prove to be an even better year than you had thought possible. \nClick here to get your copy of the guide - it's completely free and comes without any obligation. \nPeter Stephens has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-09-30T13:32:00.000+03:00", "crawled": "2015-09-30T17:58:50.825+03:00", "highlightTitle": ""}