{"organizations": ["Ophir Energy Plc", "Potash Ltd", "LGO Energy PLC & Cairn Energy PLC"], "uuid": "d80031ed8caef4ce2a80b7ccd08e4deb16d06d5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-oil-gas/?format=rss", "section_title": "Oil News | Gas News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/african-potash-ltd-pantheon-resources-114648252.html", "country": "US", "title": "Are African Potash Ltd & Pantheon Resources Plc Any Safer Than Ophir Energy Plc, LGO Energy PLC & Cairn Energy PLC?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Are African Potash Ltd & Pantheon Resources Plc Any Safer Than Ophir Energy Plc, LGO Energy PLC & Cairn Energy PLC?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T14:46:00.000+03:00", "replies_count": 0, "uuid": "d80031ed8caef4ce2a80b7ccd08e4deb16d06d5a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/african-potash-ltd-pantheon-resources-114648252.html", "ord_in_thread": 0, "title": "Are African Potash Ltd & Pantheon Resources Plc Any Safer Than Ophir Energy Plc, LGO Energy PLC & Cairn Energy PLC?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Sep 14, 2015, 12:52 BST - UK Markets close in 3 hrs 38 mins Are African Potash Ltd & Pantheon Resources Plc Any Safer Than Ophir Energy Plc, LGO Energy PLC & Cairn Energy PLC? By Alessandro Pasetti | Fool.co.uk – 6 minutes ago 28.36 -1.7650 \nWhich one of these highly cyclical stocks should you buy -- African Potash (LSE: AFPO), Pantheon (LSE: PANR), Ophir (LSE: OPHR), LGO Energy (LSE: LGO) or Cairn Energy (LSE: CNE)? Up 195% \nAfrican Potash has surged 195% in the last four weeks, having risen from 1.09p per share to its current valuation of 3.25p. Recent news about its pipeline of projects comes alongside new production and distribution deals, which are surely encouraging, and helped its stock move up to a 52-week high of 3.56p earlier this year. Yet African Potash remains a highly speculative bet based on its funding needs. My advice would be to hold its shares only as part of a diversified portfolio, or to a wait a bit longer. Up 60% \nThe value of oil and gas explorer Pantheon has risen over 60% in the last month. Its latest drilling update pushed up the stock from 23p to 28p, which is close to its 52-week high. I am not comfortable investing in a business at this stage of maturity, but management is doing a great job in managing expectations. My quick take? Keep an eye on guidance for its capital requirements and funding needs before investing in it. Until then, look elsewhere for value. Down 20% \nOphir, a more mature oil business with a market cap of over half a billion pounds, has lost 20% of value in the last month of trade. Analysts aren't particularly bullish, given that its earnings profile is uncertain but significant funding needs could weigh on its performance. Dilution risk, in particular, could become a real concern, although its balance sheet is sound at present. Its stock currently trades around a 52-week low of 80.8p. I could easily speculate that a rebound is long overdue, but Ophir has also lost the backing of one of its key shareholders -- Kulczyk Entities -- this year, which isn't ideal in this environment, really. So, I'd give it a pass. Down 15% \nLGO Energy is not a company I dislike, and if I were to place a speculative short-term bet in the oil space, I'd be tempted to snap up its stock in the wake of a -15% performance over the last month. Its stock currently trades at 1.29p, which is close to the low end of its 52-week range (1.15p-6.95p) -- but that's not the main reason why it could be an attractive bet. Its latest drilling update was only mildly encouraging, true, but then LGO boasts a diverse funding base and has proved that its shareholders and lenders are willing to back its plans -- and I would be, too. Down 10% \nCairn is probably the safest bet of all, and that's not only because its share price has been relatively resilient in the last month of trade. Based on its balance sheet and fundamentals, there's reason to believe that its shares could deliver capital gains of between 50% and 100% into 2017, although much depends, of course, on how this business cycle plays out and whether oil prices will trade any higher over the short term. I am bullish, so Cairn is an obvious buy for me at its current price of 139p, which is only 3p away from its 52-week low. \nValue \nThat said, I have a strong feeling that your savings would be better invested in a defensive stock that has risen over 30% in the last month of trade but whose relative valuations is still very low based on its growth projections. \nSo get your FREE copy right away ! \nAlessandro Pasetti has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-09-14T14:46:00.000+03:00", "crawled": "2015-09-14T14:53:15.090+03:00", "highlightTitle": ""}