{"organizations": [], "uuid": "bd664e3b270542ced111cc85c14cf093513367bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/", "section_title": "Forbes - Personal Finance Information and Personal Finance News - Forbes.com", "url": "http://www.forbes.com/sites/robertwood/2015/09/30/yahoo-will-spin-off-alibaba-without-irs-ruling/", "country": "US", "title": "Yahoo Will Spin Off Alibaba Without IRS Ruling", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "Yahoo Will Spin Off Alibaba Without IRS Ruling", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T20:43:00.000+03:00", "replies_count": 0, "uuid": "bd664e3b270542ced111cc85c14cf093513367bb"}, "author": "Robert W. Wood", "url": "http://www.forbes.com/sites/robertwood/2015/09/30/yahoo-will-spin-off-alibaba-without-irs-ruling/", "ord_in_thread": 0, "title": "Yahoo Will Spin Off Alibaba Without IRS Ruling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yahoo will proceed with a tax savvy spinoff plan for its remaining 384 million shares in Alibaba despite not having a favorable ruling from the IRS. On September 2, the IRS revealed that it will not issue a private letter ruling on the plan. A ruling is advance blessing from the IRS, a binding letter you attach to your tax return. In that sense, getting advance approval is worth its weight in gold.It isn't legally required but a ruling is considered standard for a spinoff, where taxes can be enormous if something goes wrong. Even so, Yahoo has announced it will go ahead as planned based on a law firm’s tax opinion on the tax-free treatment of the transaction. Plainly, the fact that the IRS will not rule does not mean it will be taxable even if it proceeds exactly as advertised. Often, the IRS will not rule if the treatment is not crystal clear. An opinion--even a strong opinion--is not as exacting.[caption id=\"attachment_b4db1ce5bdf34aa7afbc67501a4d61fb\" align=\"\" width=\"640\"] Exterior view of Yahoo headquarters in Sunnyvale, Calif. (Photo credit: AP Photo/Marcio Jose Sanchez)[/caption]Yet some may be wondering if Yahoo is tempting fate when the IRS has already said no. Actually, Yahoo is big enough that it is under permanent IRS audit. And this transaction was being discussed even in the absence of the IRS ruling request that Yahoo had to withdraw. Traditionally, asking for a ruling and not getting it made planners nervous to go ahead. Perhaps it would be perceived as throwing down a gauntlet?Yet in the current climate and on this particular issue, Yahoo is probably right to forge ahead based on a legal opinion. The stakes are high, but the criteria for a tax-free spinoff can certainly be encapsulated into a thorough legal opinion. Still, the consequences of this transaction are large. Some estimates suggest that, if the deal is taxable, Yahoo would face a tax bill of $9 billion on the distribution to its shareholders.There is no reason to think that the IRS will try to attack the transaction or disagree with the legal opinion Yahoo is obtaining. In fact, the Yahoo experience may actually cause some companies not to bother. If a legal opinion is good enough for Yahoo on this expensive and high-profile distribution, it ought to be good enough for just about everyone.In that sense, the real winner here may be tax opinions . Opinions may emerge as better in some ways than an IRS ruling. It is true that rulings are binding on the IRS, while tax opinions are not . That is one reason you must attach a copy of the ruling to your tax return when you file it. You never attach an opinion to a tax return.On the plus side, a tax opinion can be written on just about anything. In contrast, the IRS has lists of subjects on which it will not rule. A first line of inquiry should be whether your subject is on a no-rule list. Besides, even if your question is not on a no-rule list, if your issue is plain vanilla, the IRS may call your request one for a “comfort ruling,” something the IRS generally will not issue.Conversely, if the tax issue is unique or difficult, it may be outside the realm of rulings on the other extreme. Maybe that was Yahoo’s Alibaba problem. Many taxpayers feel the middle ground—where you can get an IRS ruling—is generally where you do not need one. If the law is unclear and you really need a ruling, you may not be able to get it. If the law is settled and you are perceived as too needy for comfort, you can’t get that either. Fortunately, tax opinions fill the gaps.One generally should not ask for a ruling unless there is a high likelihood you can get it. If the IRS says it can’t rule and you withdraw your request, the IRS sends an audit notice to the IRS field office in your area. The notice informs field IRS employees that you asked for a ruling, didn’t get it, and withdrew your request. If you proceed with the transaction, your return could be flagged.A tax opinion can be knocked out in days or weeks. A ruling takes weeks or months. Most take six months or more. Today, almost no IRS ruling is submitted without an informal trial run. You talk to the IRS and get their general view on your proposed ruling. Then, you submit a short (5 page or so) memo about the facts, the issue, and the ruling you want. The IRS meets informally in person or by phone, and often can suggest a tentative result. If all is positive, you prepare and submit your ruling request. If not, you don’t.Either way, the informal request is not official, triggers no fee, and no audit notice. If the dollar cost of being wrong is catastrophic, as in Yahoo's situation, a ruling is best. But sometimes you cannot get a ruling and should not ask. Besides, tax opinions are flexible and more versatile. They don't just give protection from IRS penalties. They should help you prevail in the event of an audit. For alerts to future tax articles, follow me on Forbes. You can reach me at Wood@WoodLLP.co m . This discussion is not intended as legal advice, and cannot be relied upon for any purpose without the services of a qualified professional.", "external_links": ["http://www.irs.gov/irb/2015-1_IRB/ar07.html#d0e1367", "http://specials-images.forbesimg.com/imageserve/b4db1ce5bdf34aa7afbc67501a4d61fb/640x0.jpg?fit=scale", "http://www.businessinsider.com/yahoo-to-go-forward-with-alibaba-spinoff-even-without-irs-approval-2015-9", "http://www.reuters.com/article/2015/09/29/yahoo-spinoff-stocks-idUSL3N11Z36X20150929"], "published": "2015-09-30T20:43:00.000+03:00", "crawled": "2015-09-30T15:47:55.086+03:00", "highlightTitle": ""}