{"organizations": [], "uuid": "75f06ececfde36bf4a993832da43c6d17e8f3a6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-21/greece-s-bonds-set-to-extend-advance-as-syriza-wins-election", "country": "US", "title": "Greece's Bonds Set to Extend Advance as Syriza Wins Election", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Greece's Bonds Set to Extend Advance as Syriza Wins Election - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T14:04:00.000+03:00", "replies_count": 0, "uuid": "75f06ececfde36bf4a993832da43c6d17e8f3a6b"}, "author": "Lucy Meakin", "url": "http://www.bloomberg.com/news/articles/2015-09-21/greece-s-bonds-set-to-extend-advance-as-syriza-wins-election", "ord_in_thread": 0, "title": "Greece's Bonds Set to Extend Advance as Syriza Wins Election", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greece’s government bonds may extend their longest run of weekly gains in a year after the nation voted Alexis Tsipras and his Coalition of the Radical Left, or Syriza, into power for the second time in eight months.\nThe nation’s 10-year bonds climbed for the past four weeks, sending yields to a 2015 low, amid speculation that the outcome of the election would not derail Greece’s international bailout. That’s a contrast to the previous vote in January, which prompted a selloff in the securities after it first brought the anti-austerity Syriza party to power.\nSyriza, which took 35.5 percent of the vote according to an official projection by the Interior Ministry based on more than half of votes counted, will enter a coalition with the same small party that helped it rule before.\nTsipras had stepped down on Aug. 20, seeking a fresh mandate after causing political turmoil before finally signing a third aid agreement with Greece’s creditors.\n“This way Tsipras gains legitimacy to apply the necessary reforms,” said Pedro Ricardo Santos, a broker at X-Trade Brokers DM SA in Lisbon. “Investors predict more stability for Greece, but there are still some concerns over how successful the reforms can be. I have no doubt that Greek debt yields will be very sensitive to economic data in the next few months, although markets are likely to show some signs of relief in the short term.”\nThe yield on Greek 10-year government bonds dropped to as low as 8.10 percent on Sept. 18. After being less than 10 percent throughout 2014, it jumped to 19.58 percent in July, as the Syriza government pushed the nation to the brink of an exit from the euro area by negotiating for a more favorable deal in return for a new bailout.\nGreek government securities are this year’s best performers among 29 sovereign debt markets tracked by Bloomberg World Bond Indexes. The bonds returned 19 percent through Sept. 18, compared with a 0.9 percent average gain among their euro-area peers.\nDespite the brightening outlook in the bond market, trading Greece’s debt is still intermittent. Data from the Bank of Greece showed the volume across all maturities totaled 1 million euros ($1.1 million) last month on the central bank’s electronic secondary securities market, or HDAT.\nTrading this month increased to 19 million euros through Sept. 17, set for the highest total since March. Volumes plunged to zero in June for the first time since October 2011 after peaking at 136 billion euros in September 2004, the central-bank data show. Deals are possible on other trading platforms.\nStocks Rebound While Greek stocks remain among the worst performing in the world, they’ve regained 23 percent from their three-year low on Aug. 24.\nAfter losing 16 percent in 2015, their market capitalization has shrunk to $34.7 billion, about the size of Italian lender UniCredit SpA. Some see the equity slump as a buying opportunity and an exchange-traded fund tracking Greek shares received money last week for the first time in five.\nWhile Syriza’s performance Sunday was better than pollsters predicted, the party still came short of a parliamentary majority. It plans to enter another coalition with the right-wing Independent Greeks party, which received 3.7 percent of the vote and 10 seats.\n“If they cannot work with each other, then how is the multitude of reforms and privatizations which have to be enacted in order for Greece to receive further tranches of the bailout going to happen?” Marc Ostwald, a strategist at ADM Investor Services International Ltd. in London, said before the results. Failure to do so could lead to an “upward shift in yields across curve, as per what was seen in the summer,” he said.", "external_links": ["http://www.bankofgreece.gr/Pages/en/Markets/HDAT/statistics.aspx\\"], "published": "2015-09-21T14:04:00.000+03:00", "crawled": "2015-09-21T09:22:48.527+03:00", "highlightTitle": ""}