{"organizations": [], "uuid": "6cf83cadc3f438395f0e63f3e89def722971456a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/g/x/2/a/r/image.related.afrArticleLead.620x365.gjr7hu.png/1442829086601.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/technology/big-banks-cut-off-accounts-of-bitcoin-companies-in-battle-for-the-future-of-payments-20150921-gjr7hu", "country": "AU", "title": "Big Australian banks stun bitcoin companies by closing their accounts", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Big Australian banks stun bitcoin companies by closing their accounts | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T16:30:00.000+03:00", "replies_count": 0, "uuid": "6cf83cadc3f438395f0e63f3e89def722971456a"}, "author": "Post to Linkedin", "url": "http://www.afr.com/technology/big-banks-cut-off-accounts-of-bitcoin-companies-in-battle-for-the-future-of-payments-20150921-gjr7hu", "ord_in_thread": 0, "title": "Big Australian banks stun bitcoin companies by closing their accounts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia's biggest banks are threatening to hobble local bitcoin companies, by suddenly withdrawing banking services from their potential future rivals. Tomohiro Ohsumi Share on twitter Share on Google Plus by Paul Smith Australia's biggest banks are threatening to hobble the hopes of emerging local bitcoin companies, by suddenly withdrawing banking services from their potential future rivals.\nBanks have sent letters to founders of Australian bitcoin exchanges, including Bit Trade and Buyabitcoin, informing them their accounts will be closed, without further explanation.\nIt is understood at least 17 Australian bitcoin companies have received similar letters, with 13 already having their accounts closed.\nThe letters, seen by The Australian Financial Review , were from Westpac Banking Corporation and Commonwealth Bank of Australia, but Ron Tucker, chairman of industry body The Australian Digital Currency Commerce Association, said all large Australian banks were shutting the door on bitcoin companies.\nRon Tucker, middle, with fellow executives of Bit Trade, which has had its account closed by Westpac. Lisa Maree Williams Mr Tucker, who is also the founder of bitcoin exchange Bit Trade, said banks were refusing to explain why accounts were being closed, or discuss what could be done to address the problem.\n\"Our members have been unable to obtain any formal clarification on the reasons for closure, except for references to policy or risk. Just what policies or risks these are have not been specified,\" he said.\n\"The industry is more than happy to talk to the banks about their concerns. However, neither the association nor its members have been given the opportunity.\"\nA threat to industry Senator Sam Dastyari says he is concerned there is an allegation that Australian banks are deliberately choking small businesses. Daniel Munoz The wave of closures threatens the viability of the wave of new financial services businesses springing up to disrupt the existing sector. In August a Senate committee found that bitcoin and other cryptocurrencies were becoming part of the mainstream , and that they should be recognised as a regular currency for Goods and Services Tax purposes.\n\"It is widely recognised that the banking sector could stand to be disrupted, as indicated in comments from Westpac's CEO two weeks ago. Companies in this industry are in the business of offering and developing cost-effective financial services for consumers and businesses,\" Mr Tucker said.\n\"However, should bitcoin companies be shut out of the Australian marketplace because of de-banking actions, this question will forever remain a hypothetical.\"\nLast week it emerged that CBA was working with some of the world's biggest banks to turn the technology behind digital currencies into a safe way to transfer money around the world and potentially replace the cumbersome international money transfer system.\nTony Pearson, acting chief executive of the Australian Bankers' Association, says banks are obliged to close accounts if they can't see a full payments trail under AML/CTF laws. Labor Senator Sam Dastyari, who chaired the Senate Economics References Committee into digital currency, said he was concerned by the banks' actions and there appeared to be no clear justification for suddenly closing accounts.\n\"I am concerned that there is an allegation that Australian banks are deliberately choking small businesses, while setting themselves up to offer the same services,\" Senator Dastyari said.\n\"We don't have a four-pillars policy to allow banks to guillotine emerging industries they are competing with … These small local digital currency companies are essentially competing to provide trading platforms, and develop emerging technologies.\"\nA CBA spokesman said the bank was unable to comment on individual customers' circumstances, but that it served each customer consistently on a case-by-case basis.\nMoney laundering concerns Westpac also refused to discuss individual cases but alluded to the fact that compliance with anti-money laundering and counter-terrorism financing (AML/CTF) laws was an issue, rather than potential competition with bitcoin players.\n\"The current bitcoin operating model requires very tough compliance and assurance requirements to ensure we meet the high standards required under anti-money laundering regulations,\" a bank spokeswoman said. \"We continue to monitor developments in bitcoin, including their regulation.\"\nActing chief executive of the Australian Bankers' Association Tony Pearson said banks were obliged to close accounts if they couldn't see a full payments trail under AML/CTF laws. He said the lack of transparency and regulatory oversight raised a number of risks for users and also posed risks for the payments system.\n\"Given the risks, there is a need for a clear and settled legal and regulatory framework for digital currencies,\" Mr Pearson said.\n\"This framework should be harmonised with other global governments and should have an appropriate balance of regulation and flexibility to allow innovation.\n\"The ABA does not support a self-regulation model for providers of digital currencies or participants in the digital currency industry.\"", "external_links": ["https://plus.google.com/https://plus.google.com/u/0/101552183386293013225/posts", "https://twitter.com/@SaysSmithy"], "published": "2015-09-21T16:30:00.000+03:00", "crawled": "2015-09-21T14:09:43.567+03:00", "highlightTitle": ""}