{"organizations": [], "uuid": "21833ea911b9cf6d7b0bd97945728ae827c2a4d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/montgomery-news/rss/627", "section_title": "Montgomery News : Personal Finance", "url": "http://business-news.thestreet.com/montgomery-news/story/5-best-ways-to-watch-nfl-games-without-cable/13286273", "country": "US", "title": "5 Best Ways to Watch NFL Games Without Cable", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "5 Best Ways to Watch NFL Games Without Cable", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T17:53:00.000+03:00", "replies_count": 0, "uuid": "21833ea911b9cf6d7b0bd97945728ae827c2a4d2"}, "author": "", "url": "http://business-news.thestreet.com/montgomery-news/story/5-best-ways-to-watch-nfl-games-without-cable/13286273", "ord_in_thread": 0, "title": "5 Best Ways to Watch NFL Games Without Cable", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Notte"], "text": "5 Best Ways to Watch NFL Games Without Cable Written by: Jason Notte 09/14/15 - 10:53 AM EDT \nNEW YORK ( MainStreet ) – With tonight's first two Monday Night Football contests of the season -- the Eagles vs. the Falcons and the Vikings vs. the 49ers -- Americans are at the line of scrimmage, waiting to pounce on getting televised access without spending lots of cash. The good news is that getting streaming access is possible, even if it is a game of inches for consumer strategy. \nOf course, the NFL loves itself some television revenue, which is why it's increasingly making its game broadcasts as widely available -- and free -- as possible. Last September, the Federal Communications Commission voted unanimously against government protection of a provision of the National Football League's television blackout rule that prohibited cable and satellite providers from switching to another feed of a home team's game if the local feed was blacked out. Under the NFL's blackout rule, which dates back to an act of Congress in 1961 that created the league's current antitrust agreement, home games couldn't be shown on TV stations that broadcast within a 75-mile radius of the stadium if non-premium tickets weren't completely sold out 72 hours before kickoff. Perhaps sensing some level of consumer disgust with that rule, the NFL shelved it during the offseason and ensured all games would be televised in 2015. \nThanks to financial information released by the publicly owned Green Bay Packers, we know that their share of the 2014 television revenue evenly divided among the league's 32 teams was $226.4 million -- far more than the Packers' $149.3 million in local revenue. Multiplied by 32, that's a $7.2 billion from television alone. That's up from $3 billion in 2010 and represents a 120% increase over the last 11 years. More Headlines 20 Junk Food Products that Will Make You Miss Being a Kid \nThat isn't exactly surprising. New television deals with Fox, CBS and NBC kicked in last year and will pay the NFL and its teams $28 billion -- or roughly $1 billion a year -- for NFL broadcast rights through 2022 that include playoff games and rotating Super Bowl hosting duties. ESPN, meanwhile, pays $1.9 billion each year -- or more than double what any network pays for a season of Major League Baseball -- just to host Monday Night Football through that same span. \nLast year, the NFL also got DirecTV to pay $1.5 billion a year over the next eight years for the rights to the NFL Sunday Ticket multi-channel out-of-town games package. Though DirecTV executives initially refused to go above the $1 billion they were paying annually in their previous deal, losing NFL Sunday Ticket would have scuttled AT&T's $48.5 billion takeover of the company that included a no-penalty out clause if Sunday Ticket negotiations went south. Meanwhile, the league was also able to pry $275 million more out of CBS for partial rights to Thursday Night Football games in 2014. The NFL and CBS renewed the deal at a “slightly higher” rate for this season. \nWhy do networks shell out that much for football? Because absolutely nothing else draws football's ratings. Last year, NFL regular-season games averaged 17.6 million per broadcast, second only to the 17.9 million average in 2010. Games on “free” TV -- CBS, Fox and NBC -- averaged 19.2 million viewers. The Top 20 television broadcasts last fall were all NFL games. Game 7 of last year's World Series (23.5 million viewers) was less watched than an early September matchup between the Kansas City Chiefs and Denver Broncos (25 million). The only non-sports event to join the NFL in the Top 25 was the Macy's Thanksgiving Day Parade (22.6 million viewers), and nearly 10 million more viewers (32 million) tuned in to watch the Dallas Cowboys and Philadelphia Eagles later that day. \nHowever, if you really don't want to pay extra fees for cable or satellite television service, the NFL has no problem with that, either. It has positioned itself in such a way that the overwhelming majority of its games are available without having to subscribe to a single channel. There's a chance you'll miss the occasional NFL Network game here or there, but if it features a team in your market, the NFL is forced to simulcast it on a local affiliate. \nThe NFL knows that sports make up a huge part of the average monthly cable and satellite bill, and it has no interest in giving the middlemen at the networks anything more than they're already getting. According to media research firm SNL Kagan, sports channels made up $947.6 million – or roughly 17% – of the $5.5 billion multichannel television industry in 1995. By 2012, sports channels took in $15.3 billion – or a whopping 38% -- of the overall $40.3 billion multichannel take. The earning power of the only other category that even came close, general variety channels such as TBS and AMC, grew from $820 million to $5.5 billion over the same span, but dropped from nearly equivalent to sports to roughly a third of that genre's value. \nMeanwhile, sports now accounts for nearly $2 out of every $5 spent on pay television. Its monthly cost has risen as well. In 1995, the average monthly cable bill was $6.83, $1.17 of which went to sports channels. That's still a hefty 16%, but it lagged behind the $2.82 movie channels charged at the time. Now, that $1.17 spent on sports wouldn't even cover 20% of the cost of ESPN alone. \nOf the average $34 spent each month on multichannel television, nearly $13 pays for sports channels. That's 38% of the average cable bill, though sports are on only 14 of the average 94 channels offered by multichannel providers. On top of that, Nielsen estimates that only 20% of all multichannel viewing time is spent watching sports. Nobody is making out in that deal. \nConsidering that the league is not really interested in putting money in anyone's pockets other than its own -- it's in the NFL's best interest to keep Time Warner, Comcast, DirecTV, Dish Network and others as small a portion of its business as possible. There's always the local bar that is sure to be showing any number of contests on the gridiron for your televised enjoyment. But if you want to cut the cord and still watch the NFL in the comfort of your own home, the league is happy to help. Here are just a few of the options available: 1", "external_links": [], "published": "2015-09-14T17:53:00.000+03:00", "crawled": "2015-09-14T18:36:21.854+03:00", "highlightTitle": ""}