{"organizations": [], "uuid": "54529a4690030ede8f73f778e4cea0c11c45d55e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/9Tkej4b9rAjyqPTRVZnPNQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/434341f27291ac91bb1f95b79baf098af76a46c4_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/tsipras-regains-slim-lead-hours-093423558.html", "country": "GB", "title": "Tsipras regains slim lead hours ahead of Greek vote", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Tsipras regains slim lead hours ahead of Greek vote", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T12:34:00.000+03:00", "replies_count": 0, "uuid": "54529a4690030ede8f73f778e4cea0c11c45d55e"}, "author": "", "url": "https://uk.finance.yahoo.com/news/tsipras-regains-slim-lead-hours-093423558.html", "ord_in_thread": 0, "title": "Tsipras regains slim lead hours ahead of Greek vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tsipras"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Sep 19, 2015, 11:28 BST - UK Markets closed Tsipras regains slim lead hours ahead of Greek vote By Claire Rosemberg | AFP – 54 minutes ago View Photo \n\nGreece's election hung on a knife-edge Saturday as radical former premier Alexis Tsipras retook a slight lead in the final hours of a tight race against the conservatives for the helm of government. \nHours before a midnight ban on voter surveys, four polls forecast victory for Tsipras over conservative party chief Vangelis Meimarakis by margins ranging from 0.7 to 3.0 percentage points. \nA September 20 victory for Syriza would deliver \"a key message for Europe\", Tsipras told his closing rally in Athens on Friday, referring to the refugee crisis and to EU economic woes. \n\"Do we want a Europe of austerity or one of solidarity and democracy?\" he said. \nAt Tsipras's side were some of Europe's new radical leaders, including Pablo Iglesias, who heads Spain's Podemos party and who called Tsipras \"a lion\" and his rival Meimarakis \"a rabbit.\" \nWearing a white shirt and with his sleeves rolled up, Tsipras said victory Sunday would show \"if the old system that governed for 40 years is going to return or if we are going to take a step forward\". \n\"The people will say no to this old system of corruption, no to the enshrining of the oligarch establishment,\" he added. \nMeimarakis hit back with an interview on Saturday, dismissing Tsipras' seven months in government as \"an experiment that cost (the country) dearly.\" \nTsipras won office in January on an anti-austerity ticket but then upset supporters in July with a U-turn cash-for-reforms deal struck with Greece's international creditors despite a huge \"no\" vote in a referendum on the issue. \nThe left-wing government had earlier shut banks to avert a deposit run and imposed capital controls that are still felt in the economy. \nMeimarakis on Saturday warned voters against re-electing a man who has publicly admitted to opposing the bailout he signed. \n\"Do you know of any other prime minister who brokered a deal, brought it to parliament, voted for it and signed it, whilst saying he does not believe in it?\" the conservative chief told To Vima weekly. \n\"I fear that if Syriza is elected... the country will soon be led to elections again, and this would be disastrous,\" said Meimarakis, a 61-year-old former defence minister. \nBallots open at 0400 GMT on Sunday and close exactly 12 hours later. \nAs per Greek electoral tradition, Tsipras and other political leaders will lunch Saturday with supporters and reporters covering their parties' respective beats. \nEven (Taiwan OTC: 6436.TWO - news ) after the broken promises, many voters believe he acts honestly and with their interests at heart -- a break with past leaders they perceived as corrupt and linked to powerful interests. \n- 'Shifting sands' - \nWith regard to opinion surveys, Greek pollsters called for caution after being burnt previously this year. \n\"It (Other OTC: ITGL - news ) 's the first time I've felt unable at this point to make a forecast,\" political columnist Paschos Mandravelis told AFP. \nPolling institutes are working \"in shifting sands, after seven months of major political upheaval\", said Thomas Gerakis at the Marc Institute. \nIn January, Syriza won office with 36.3 percent of the vote, but Tsipras resigned in August, leading to this weekend's election, with anti-euro hardliners quitting to form a new party, stripping Syriza of a fifth of its MPs. \nOn Friday his flamboyant one-time finance minister Yanis Varoufakis said he would vote for the rebels in Sunday's election. \nThe vote is the third this year for Greeks including the referendum, and the fifth in six years as Tsipras seeks a fresh mandate to push through the tough reforms he pledged under a new 86-billion-euro ($97-billion) international rescue in July. \nIn a flurry of interviews, he has defended his decision to put the country above his party, saying that had he refused to agree the three-year bailout, Greece would likely have been ejected from the eurozone. \nOn Friday, he told Antenna TV that he would \"tug the rope\" in order to secure relief on Greece's huge national debt from EU creditors in the coming months. \nThe vote is expected to deliver a hung parliament, though, and with both Syriza and New Democracy having pledged to stick to the cash-for-reforms package, there will likely be more unpopular austerity on the way whoever ends up in charge.", "external_links": [], "published": "2015-09-19T12:34:00.000+03:00", "crawled": "2015-09-19T13:29:32.487+03:00", "highlightTitle": ""}