{"organizations": [], "uuid": "043b43af529b1f7c956b8d98a94510fe2984d66c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/254235-week-ahead-clock-ticks-down-on-funding-deadline", "country": "US", "title": "Week ahead: Clock ticks down on funding deadline", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Week ahead: Clock ticks down on funding deadline", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T13:00:00.000+03:00", "replies_count": 0, "uuid": "043b43af529b1f7c956b8d98a94510fe2984d66c"}, "author": "mmali@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/254235-week-ahead-clock-ticks-down-on-funding-deadline", "ord_in_thread": 0, "title": "Week ahead: Clock ticks down on funding deadline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Week ahead: Clock ticks down on funding deadline By Kevin Cirilli - 09/21/15 06:00 AM EDT \nThe pope’s visit will dominate Washington, but Republican leaders will be scrambling to find a way to pass a government funding bill by month’s end. \nThere are few legislative days left for lawmakers to act, and the House is in recess this week. Pope Francis is set to arrive on Tuesday and on Wednesday will visit the White House. On Thursday, he will speak before a joint session of Congress. \nConservative Republicans say they’ll oppose any funding bill that includes money for Planned Parenthood following the controversy over the group’s handling of fetal tissue, leaving leaders in a jam. ADVERTISEMENT The House on Friday passed a separate measure to defund the healthcare group for one year, and the Senate may also take up a similar vote next week.\nBut Senate Majority Leader Mitch McConnell (R-Ky.) has said it isn’t possible to defund Planned Parenthood in a must-pass spending bill. GOP leaders want to avoid a potentially politically damaging shutdown with the presidential election looming next year. \nElsewhere, Federal Reserve Chairwoman Janet Yellen will speak at the University of Massachusetts Amherst. The title of her speech is Inflation Dynamics and Monetary Policy, according to the Federal Reserve. SPONSORED CONTENT By Intuit \nMeaningful tax reform starts with tax simplification. Read More \nYellen’s speech comes amid much uncertainty among economists about the timing of an interest rate increase. \nFed policymakers have kept the interest rate at zero percent since the economic collapse in an effort to boost economic growth, and decided again this week to hold rates steady. But many on Wall Street said that the central bank was not clear in its message, and are calling for more clarity. \nAbroad, global markets will be closely watching the results of Sunday’s Greek parliamentary elections. It’s the third vote this year for the country, which is struggling with an economic crisis that threatens to reverberate across Europe. \n\nBill aims to shed light on ‘shadowy’ board of regulators, by Kevin Cirilli: http://bit.ly/1iCENdl \nEmployment up in 29 states, by Vicki Needham: http://bit.ly/1F7539J \nDem calls for no weekends off until shutdown is averted, by Cristina Marcos: http://bit.ly/1iCESxC \nDems might not save Boehner, by Rebecca Shabad: http://bit.ly/1QMulva", "external_links": [], "published": "2015-09-21T13:00:00.000+03:00", "crawled": "2015-09-21T17:48:10.180+03:00", "highlightTitle": ""}