{"organizations": [], "uuid": "ad5912e2f5d2cd88a0ecec5c14eb4cbd80d0ac83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/chamberofcommerce_-022511gn.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/254267-chamber-of-commerce-partners-with-west-african-business-group", "country": "US", "title": "Chamber of Commerce partners with West African business group", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Chamber of Commerce partners with West African business group", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T01:30:00.000+03:00", "replies_count": 0, "uuid": "ad5912e2f5d2cd88a0ecec5c14eb4cbd80d0ac83"}, "author": "esmilowitz@thehill.com (Vicki Needham)", "url": "http://thehill.com/policy/finance/254267-chamber-of-commerce-partners-with-west-african-business-group", "ord_in_thread": 0, "title": "Chamber of Commerce partners with West African business group", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chamber of Commerce partners with West African business group By Vicki Needham - 09/18/15 06:30 PM EDT The U.S. Chamber of Commerce is forming a potentially powerful new business partnership with West Africa to strengthen trade and investment ties. The alliance links the Chamber with the 15-nation Economic Community of West African States (ECOWAS), creating the U.S.-ECOWAS Business Initiative (USEBI) — the first effort of its kind in the region — as part of an effort to churn up large-scale economic growth and improve security throughout the burgeoning area. ADVERTISEMENT “By bringing new jobs to the market, you alleviate a lot of concerns and will help bolster security and peace in the region, and that’s part of what we’re thinking through as we engage there,” Scott Eisner, the Chamber’s vice president of African Affairs, told reporters Friday. The U.S. and African trading relationship can blossom through improved trade facilitation, supply-chain and transportation development and growing the manufacturing base, Eisner said. He said the U.S. and West African private-sector business groups, including the Federation of West Africa Chamber of Commerce and Industry, agreed that now is the time to take the reins and promote far-reaching investment ahead of government efforts to jump-start the region's massive economic potential or risk losing a global competitive edge. In turn, business and the U.S. government will work “hand-and-glove” to develop these regional markets with the goal of lowering trade barriers and increasing competition, Eisner said. One of the aims is to bring more stability to the region and provide an economic framework that mutes government corruption and bureaucratic red tape that can make U.S. investment difficult. Burkina Faso, one of the countries in the group, experienced a coup Wednesday that has led to demonstrations and riots and has been condemned by the United States and France, among other nations. Earlier this summer, President Obama signed the 10-year African Growth and Opportunity Act (AGOA), which provides 39 African nations with tariff-free access to U.S. markets. Passage of that bill spurred the Chamber and its partners to pick up the pace of their efforts in West Africa, Eisner said. U.S. Trade Representative Michael Froman said recently that the elimination of tariffs under AGOA won’t be enough to fully stoke the U.S.-Africa trading relationship. The future of the partnership will depend more on “programs that can support Africa’s own priorities and help build the continent’s capacity to trade competitively in the 21st century global economy,” Froman said during the AGOA trade summit in Gabon in August. Other goals in West Africa include developing the retail and agricultural sectors, expanding access to the Internet and generating a consistent power supply. The formal kick-off for the partnership will be held Sept. 29 in New York. The ECOWAS countries beside Burkina Faso are Benin, Cabo Verde, Cote D’Ivoire, The Gambia, Ghana, Guinea, Guinea Bissau, Liberia, Mali, Niger, Nigeria, Senegal, Sierra Leone and Togo. The Obama administration has ramped up its outreach to Africa over the past six years. This summer, President Obama made his fourth trip to sub-Saharan Africa, likely solidifying the future of the U.S. presence on the continent. Last summer, he held the U.S.-Africa Leaders Summit, hosting more than 50 African leaders to discuss a wide variety of pressing issues from trade and investment to health issues such as stopping the spread of Ebola. National Security Advisor Susan Rice on Friday said the view of Africa has dramatically changed in the global economic equation and, in response, the United States has stepped up its commitments to the continent. “No longer do we view Africa through the prism of poverty and crisis,” she said at the Congressional Black Caucus Foundation Annual Legislative Conference in Washington. “We see Africa for what it is — a dynamic, diverse region brimming with economic potential and boundless possibility,” she said. “Africans are driving their own development, building their own capacity to feed and care for their people and doing more to prevent and resolve African conflicts.”", "external_links": [], "published": "2015-09-19T01:30:00.000+03:00", "crawled": "2015-09-19T08:22:57.215+03:00", "highlightTitle": ""}