{"organizations": [], "uuid": "277166462c760a66f0d60c0c58368b79fe1e7f3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance-commerce.com", "main_image": "http://finance-commerce.com/files/2015/09/Wayzata1-200x200.jpg", "site_section": "http://finance-commerce.com//feed/", "section_title": "Finance & Commerce", "url": "http://finance-commerce.com/2015/09/wayzata-picks-civitas-for-lakefront-project/", "country": "US", "title": "Wayzata picks Civitas for lakefront project", "performance_score": 0, "site": "finance-commerce.com", "participants_count": 1, "title_full": "Wayzata picks Civitas for lakefront project", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T15:00:00.000+03:00", "replies_count": 0, "uuid": "277166462c760a66f0d60c0c58368b79fe1e7f3d"}, "author": "Brian Johnson", "url": "http://finance-commerce.com/2015/09/wayzata-picks-civitas-for-lakefront-project/", "ord_in_thread": 0, "title": "Wayzata picks Civitas for lakefront project", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home / News / Construction & Development / Wayzata picks Civitas for lakefront project The city of Wayzata has selected Denver-based Civitas to design a signature lakefront project along Lake Minnetonka, including this area by the Section Foreman House, 738 E. Lake St. (Staff photo: Bill Klotz) Wayzata picks Civitas for lakefront project By: Brian Johnson September 22, 2015 7:00 am 0 \nHoping to make Lake Minnetonka more inviting and accessible to residents, the city of Wayzata has hired Denver-based Civitas to lead the design of a key lakefront improvement project in the city. \nThe “Lake Effect Signature Project” is intended to improve public spaces along the lakefront extending about a quarter-mile from the Section Foreman House at 738 E. Lake St. to the Wayzata Depot at 402 E. Lake St. \nWayzata officials say it’s part of a multi-year effort to “reconnect residents and visitors” with Lake Minnetonka, and make it more accommodating for bicyclists, pedestrians and other users. \nMary deLaittre, the city’s project consultant, said the lakefront is an important feature of the city’s identity. The problem is, the area is “inaccessible in a variety of ways,” she said. \n“This is a wonderful opportunity to redesign the lakefront as a community asset,” she said in an interview. \nCity officials hope to tap into a mix of public and private funding sources for the project, but no budget has been established yet, deLaittre said. Early next year, the city will create an organization to coordinate and raise funds for the project. \nCivitas’ proposal includes a $310,000 design fee. The city is negotiating with the architecture and urban design firm to refine the fee and scope of services, deLaittre said. \nThe project will “unite” smaller standalone projects identified in the city’s 2014 “ Lake Effect Implementation Strategy,” according to the city. \nCompleted and proposed standalone projects on the lakefront range from bike lanes and landscaping to a new beach concession and rehabilitation of the historic “ Section Foreman House ” at 738 Lake St. E. \nThirteen design teams submitted proposals. The other finalists were Minneapolis-based Coen + Partners, and the Minneapolis office of Chicago-based Perkins + Will with New York-based Workshop Ken Smith. \nCivitas will team with Minneapolis-based Snow Kreilich Architects, Applied Ecological Services of Prior Lake, St. Paul-based Solution Blue Inc. and HR&A Advisors of New York City on the project. \nOn its website , Civitas said it will “focus on how to bring the lake back into the foreground, giving new life to an exciting vision for Wayzata.” \nWayzata Mayor Ken Willcox said in a statement that a project “of this magnitude requires a design team that understands the significance of Lake Minnetonka” to the city’s identity and economic development. \n“It was evident in the Civitas proposal and during the team’s interview that they understood the needs of our community and are ready to work with us on a Signature Project that exemplifies our vision for a revitalized lakefront,” Willcox said. \nSchematic design development will begin next month and run through April. The city and the public will evaluate the designs starting in spring 2016, and the project is scheduled to start in fall 2016, the city said. \nAn 11-member selection committee recommended Civitas for the job. The Wayzata City Council approved the recommendation last week. \nCivitas has led waterfront redevelopment projects in Los Angeles, San Diego, and Tampa, Florida, among other locations. Share this:", "external_links": [], "published": "2015-09-22T15:00:00.000+03:00", "crawled": "2015-09-22T19:06:09.820+03:00", "highlightTitle": ""}