{"organizations": [], "uuid": "370b5eadb5851252525c517712d22da7b57c14e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/21/awards-emmys-idUSL1N11Q0E520150921", "country": "US", "title": "UPDATE 1-Comedies 'Transparent' and 'Veep' dominate early Emmys", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Comedies 'Transparent' and 'Veep' dominate early Emmys | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T05:13:00.000+03:00", "replies_count": 0, "uuid": "370b5eadb5851252525c517712d22da7b57c14e5"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/21/awards-emmys-idUSL1N11Q0E520150921", "ord_in_thread": 0, "title": "UPDATE 1-Comedies 'Transparent' and 'Veep' dominate early Emmys", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts with first winners)\nBy Jill Serjeant\nLOS ANGELES, Sept 20 (Reuters) - Jeffrey Tambor won the best actor Emmy on Sunday for playing a father who transitions to a woman in the transgender comedy \"Transparent,\" giving Amazon.com a major boost for its original streaming content.\nThe lead actor win was the first Emmy Award for Tambor, 71, and the second of the early wins on Sunday for \"Transparent,\" which also won for directing.\nTambor dedicated his Emmy to the transgender community, saying, \"Thank you for your patience, thank you for your courage, thank you for your stories, thank you for your inspiration, thank you for letting us be part of the change.\"\nBradley Whitford also clinched an Emmy for the show when he won for guest actor in a ceremony last week.\nWith gay and transgender themes enjoying a boom in Hollywood, \"Transparent\" is seen as a threat to ABC's \"Modern Family,\" which has won the comedy series Emmy for each of the past five years. That award will be handed out at the end of the evening.\nBut the early awards indicated major support for HBO's White House political comedy \"Veep.\" Julia Louis-Dreyfus won best comedy actress for playing egotistical Selina Meyer, while Tony Hale, who plays her bag man, was named comedy supporting actor. \"Veep\" also clinched the comedy writing statuette.\n\"We'd like to thank HBO for letting us make fun of American politics and make American money,\" writer Simon Blackwell said.\nAllison Janney took the comedy supporting actress award for the second year for playing a recovering alcoholic on CBS's \"Mom.\"\nHost Andy Samberg kicked off the evening with a nod to the challenges of watching the hundreds of shows now on television, singing \"So many shows, so little time.\"\nThe front-runner for the top prize, best drama series, is the stylish 1960s-era advertising show \"Mad Men,\" which is bidding for a record fifth drama series win to crown its final season.\nNo one has ever won an acting Emmy for the influential AMC show in its eight years on the air, but Jon Hamm is expected finally to change all that for his role as conflicted ad executive Don Draper.\nHowever, with seven drama series nominated this year - none of them from the big five U.S. broadcasters - the competition is fierce, especially from the HBO fantasy series \"Game of Thrones\" which had a leading 24 nominations.\nThe Emmy Awards have been criticized in the past for rewarding the same shows and actors year after year. But this time more than half the nominees in the lead acting categories are either first-timers or from new series.\nOscar-nominated Viola Davis (ABC's \"How to Get Away With Murder\") and Taraji P. Henson (Fox's \"Empire\") are considered front runners in the drama actress category, which has never been won by an African-American.\n(Additional reporting by Piya Sinha-Roy and Lisa Richwine ; Editing by Leslie Adler)", "external_links": [], "published": "2015-09-21T05:13:00.000+03:00", "crawled": "2015-09-21T04:30:58.673+03:00", "highlightTitle": ""}