{"organizations": [], "uuid": "a9fa37d568d0ccc9bc2faa5681e28bcd99a305ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/buy-let-market-could-threaten-102215215.html", "country": "US", "title": "Buy-To-Let market could threaten Britain's economic stability, warns Carney", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Buy-To-Let market could threaten Britain's economic stability, warns Carney", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T13:22:00.000+03:00", "replies_count": 0, "uuid": "a9fa37d568d0ccc9bc2faa5681e28bcd99a305ea"}, "author": "", "url": "https://uk.finance.yahoo.com/news/buy-let-market-could-threaten-102215215.html", "ord_in_thread": 0, "title": "Buy-To-Let market could threaten Britain's economic stability, warns Carney", "locations": ["Britain"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print \nLandords are vulnerable to rapidly rising prices in a boom and falling values during a bust, find Bank of England regulators \nThe Bank of England is keeping a close eye on the buy-to-let market as it fears landlords are sensitive to rising interest rates and house prices, threatening Britain's economic stability. \nIn its latest Financial Stability Report, the Bank's Financial Policy Committee warned landlords were vulnerable to buying rapidly when prices are rising but also selling properties quickly if there are signs of a downturn. \n“The outstanding stock of buy-to-let mortgage lending has increased by over 40pc since 2008\", said the FPC. \n\"Over the same period, the stock of owner-occupier mortgage lending rose by only 2pc.\" \nMark Carney, the Governor of the Bank of England, said earlier this month that he was talks with Chancellor George Osborne about giving the Bank greater powers to police the buy-to-let market. \nLast summer, the FPC introduced regulations designed to prevent Britain's housing market from overheating . Banks must now ensure no more than 15pc of residential mortgages are given to people borrowing more than 4.5 times their income and are also required to \"stress test” borrowers’ ability to repay loans. \nHowever, these rules do not currently cover buy-to-let. Mr Carney said the FPC would decide on whether to make recommendations that to tigthen the affordability criteria number \"by the end of the year.\" \nLast November, the FPC asked for more powers to regulate the market. So-called \"powers of direction\" over loan-to value and debt to income rations would allow policymakers to crack down on financial stability concerns more quickly. \nMr Osborne told MPs this month that a decision over new powers would be \"imminent\". \nHowever, the Bank of England gave the thumbs up to the Help to Buy mortgage guarantee scheme (HTB), which uses government support to help first-time home buyers. \nIn a letter to Chancellor George Osborne, Mr Carney said the scheme does not appear to have driven a rise in risky lending. \n“HTB loans accounted for just under 6pc of the flow of mortgages for house purchase, and HTB lending to date only makes up a relatively small proportion of large lenders’ books,” Mr Carney said. \n“The latest data suggest underwriting standards within the scheme and for high loan-to-value (above 90pc) loans more generally remain reasonably prudent, suggesting HTB has not driven any increase in riskier lending.” \nThe Treasury said the committee's assessment on the housing market play a \"crucial role in protecting our hard-won economic security\". \n\"Building a stronger and safer financial system is a key part of the government’s long term plan to provide economic security for working people, which is why the independent Bank of England has been put back at the centre of ensuring emerging risks to financial stability are identified, monitored and effectively addressed,\" said a statement. \nThe quarterly report added that China’s economic slowdown is a threat to Britain’s banks and the wider economy as turmoil in financial markets threatens to spread from the Asian powerhouse. \nBritish asset managers also have extensive investments in China and other emerging markets, which means savers could lose out from a crash in the country. \nHowever, threats from the Eurozone and Greece are fading as the latest crisis in the region appears to have passed according to the Bank’s Financial Policy Committee’s latest Financial Stability Report. \n“ Prospects in China and other emerging market economies (EMEs) have softened since July 2015 and downside risks have risen,” said the FPC, which is headed by governor Mark Carney, noting falling currencies and commodities prices across the regions. \n“China is making the transition to a slower-growth, more liberalised and consumption-driven economy. These transitions are made more challenging by some underlying vulnerabilities arising from a rapid build-up of debt since the crisis: the ratio of credit to GDP in China has more than doubled since 2008, to 195pc. Non-performing loan rates are starting to rise.” \nCombined with the chance of rising interest rates in the US and UK in the near future, this could result in large flows of capital across borders, which could destabilise financial markets. \n“These risks in both China and EMEs more broadly affect UK financial stability through the direct exposures of UK banks, whose claims on China and other EMEs are around 3.5-times [their core capital buffers],” the FPC said. \n“Further, UK asset managers have material holdings of emerging market debt securities. UK financial stability could also be affected more indirectly through markets if reallocation of capital in the global economy tests market functioning, or if capital inflows into advanced economies, including the United Kingdom, encourage looser underwriting standards or stretch asset prices.” \nBut the FPC also noted that “the immediate risks in relation to Greece and the euro area have fallen somewhat from their acute level at the time of publication of the July 2015 Financial Stability Report.”", "external_links": [], "published": "2015-09-25T13:22:00.000+03:00", "crawled": "2015-09-25T14:21:20.890+03:00", "highlightTitle": ""}