{"organizations": [], "uuid": "c183ee4dd0eedd569d66616cce72aa8bb40dbc58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/h/s/c/v/image.related.articleLeadwide.620x349.gjrvcc.png/1442883610263.jpg", "site_section": "http://www.smh.com.au/business/planners-go-rogue", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/china/five-things-on-the-agenda-when-chinas-xi-goes-to-washington-20150921-gjrvcc.html", "country": "AU", "title": "Five things on the agenda when China's Xi goes to Washington", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Five things on the agenda when China's Xi goes to Washington", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "c183ee4dd0eedd569d66616cce72aa8bb40dbc58"}, "author": "David Tweed and Alex Nussbaum and Ye Xie", "url": "http://www.smh.com.au/business/china/five-things-on-the-agenda-when-chinas-xi-goes-to-washington-20150921-gjrvcc.html", "ord_in_thread": 0, "title": "Five things on the agenda when China's Xi goes to Washington", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Chinese leader will land in Seattle, visit the White House and address the United Nations for the first time in a coast-to-coast trip. Photo: Getty\n Xi Jinping is coming to America.\nThe Chinese leader will land in Seattle, visit the White House and address the United Nations for the first time in a coast-to-coast trip at the end of the week that will be parsed by economists, activists and politicians seeking answers from the world's second-biggest economy about its latest stance on climate change, monetary policy and cyber espionage to name but a few hot-button issues.\nHere is a quick ranking of what Americans are most worried about when it comes to China:\nAdvertisement Widening trade deficit The US's trade deficits with China have widened to all-time highs - about $US1 billion each day - even after the yuan appreciated nearly 30 per cent against the dollar over the past decade.\nEconomists have various explanations: China's exporters are so competitive that they grab market shares from others; the American propensity for consuming means the US buys more products from China than it sells to them; and the deficit is exaggerated by accounting issues because the value of end-consumer products, such as iPhones or TVs, are recorded as Chinese exports even as some components are produced elsewhere.\nThe bottom line is that the exchange rate has played a limited role in shifting the trading patterns, contrary to accusations by some US politicians that China's currency manipulation is the main culprit for the trade shortfall.\nSouth China Seas The flow of oil shipments to China through the choke point of the Malacca Straits into the South China Sea explains why China considers the security of its sea lanes to be vital to its national interests: 80 per cent of China's oil imports travel through the waters.\nChina claims about four-fifths of the South China Sea, and its construction of military installations on outposts where it has reclaimed 2900 acres of land have alarmed other claimants including Vietnam and the Philippines. Tensions rose this year when China protested US surveillance flights over the disputed reefs. The American government has demanded China stop any militarisation of the area.\nRobert Kaplan, a senior fellow at the Center for a New American Security in Washington, says Xi wants the US to agree to \"some sort of strategic bilateral arrangement'' to replace the unilateral military arrangement where America has ensured security in the waters since World War II. The US says it is committed \"to ensuring free and open maritime access to protect the stable economic order that has served all Asia-Pacific nations so well for so long\".\nEnvironment The earth is warming dangerously, according to scientists, and China and the US have their hands on the thermostat.\nChina accounted for almost a quarter of greenhouse-gas pollution in 2012, twice as much as the No. 2 emitter, the US, according to figures from the Washington-based World Resources Institute.\nBoth countries are pushing for an international deal to be signed in Paris this year that would commit all nations to rein in heat-trapping emissions. But China's always walked a fine line in those talks, balancing environmental concerns with growth and a resistance to outside scrutiny of its economy. What Obama and Xi can agree on could determine how strong a pact comes out of Paris.\nCybersecurity China's spending on information technology is rising exponentially, and European firms want to get as much of the action as possible.\nBut since revelations by former US contractor Edward Snowden in 2013 of widespread spying in China by the National Security Agency, the authorities accelerated efforts to purge foreign technology from banks, the military, state-owned enterprises and key government agencies.\nUS companies are concerned that their access to China's IT market will be further curtailed should Obama go ahead and sanction Chinese companies or individuals for alleged Chinese hacks into American corporate computer networks. On the agenda, the New York Times reported, is an arms control accord for cyberspace based on an updated yet generic UN code of conduct.\nHuman rights From its one-child policy (partly relaxed in 2013) to arbitrary detentions on religious and political grounds, China's record on human rights has been a bone of contention between the Communist regime and the Western world.\nAuthorities in Beijing are allergic to being schooled on how to conduct domestic policy, with subjects like Tibet, Falun Gong and the 1989 Tiananmen Square protests completely taboo.\nThe most populous nation carries out more executions than the rest of the world put together, according to Amnesty International, but because there are no official numbers, reliable data is hard to come by.\nStill, Amnesty believes \"there are thousands of executions\" carried out there every year, with torture widespread along with various forms of restriction on freedom of expression.\nBloomberg", "external_links": ["http://assets.bwbx.io/images/idzfz40yWZ8k/v1/488x-1.png", "http://assets.bwbx.io/images/iwAYlXF8Trh4/v1/488x-1.png", "http://assets.bwbx.io/images/iFiRBjvqOKCo/v1/488x-1.jpg", "http://assets.bwbx.io/images/ieJEZ5E5qAx8/v1/488x-1.png", "http://assets.bwbx.io/images/isuZe8xHrRLw/v1/488x-1.png", "http://assets.bwbx.io/images/iV66fcnk3Juc/v1/488x-1.png"], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-23T16:41:47.266+03:00", "highlightTitle": ""}