{"organizations": [], "uuid": "a6e54f100b842e72763f49104f29d03d2242839b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/traders/SpeedDesk-9-front-lead.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.thestreet.com/story/13293877/1/general-motors-gm-stock-slumps-following-900-million-ignition-switch-settlement.html?puc=yahoo&cm_ven=YAHOO", "country": "GB", "title": "General Motors (GM) Stock Slumps Following $900 Million Ignition Switch Settlement - TheStreet", "performance_score": 0, "site": "thestreet.com", "participants_count": 1, "title_full": "General Motors (GM) Stock Slumps Following $900 Million Ignition Switch Settlement - TheStreet", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "a6e54f100b842e72763f49104f29d03d2242839b"}, "author": "yahoo", "url": "http://www.thestreet.com/story/13293877/1/general-motors-gm-stock-slumps-following-900-million-ignition-switch-settlement.html?puc=yahoo&cm_ven=YAHOO", "ord_in_thread": 0, "title": "General Motors (GM) Stock Slumps Following $900 Million Ignition Switch Settlement - TheStreet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reddit Email Print Reprint NEW YORK ( TheStreet ) -- Shares of General Motors   ( GM - Get Report )  are down by 1.33% to $30.89 in late morning trading on Friday, after the company announced that it will pay $900 million to settle its ignition-switch proceedings with the Department of Justice.\nThe ignition switch issue has been linked to at least 169 deaths and forced the company to recall millions of vehicles.\nThe $900 million payout allows GM to escape criminal prosecution despite evidence that the company's legal and engineering staffs concealed the deadly issue for nearly a decade, according to  Reuters .\n\nAn independent monitor will oversee the future handling of GM's safety issues as part of the settlement.\nTheStreet has further coverage of the settlement here .\nSeparately, TheStreet Ratings team rates GENERAL MOTORS CO as a Buy with a ratings score of B. TheStreet Ratings Team has this to say about their recommendation:\n\"We rate GENERAL MOTORS CO (GM) a BUY. This is driven by a few notable strengths, which we believe should have a greater impact than any weaknesses, and should give investors a better performance opportunity than most stocks we cover. The company's strengths can be seen in multiple areas, such as its compelling growth in net income, good cash flow from operations, impressive record of earnings per share growth, notable return on equity and largely solid financial position with reasonable debt levels by most measures. We feel its strengths outweigh the fact that the company has had lackluster performance in the stock itself.\"\nHighlights from the analysis by TheStreet Ratings Team goes as follows:\nThe net income growth from the same quarter one year ago has significantly exceeded that of the S&P 500 and the Automobiles industry. The net income increased by 301.8% when compared to the same quarter one year prior, rising from $278.00 million to $1,117.00 million. Net operating cash flow has significantly increased by 51.07% to $5,786.00 million when compared to the same quarter last year. The firm also exceeded the industry average cash flow growth rate of 8.29%. Current return on equity exceeded its ROE from the same quarter one year prior. This is a clear sign of strength within the company. When compared to other companies in the Automobiles industry and the overall market, GENERAL MOTORS CO's return on equity has significantly outperformed in comparison with the industry average, but has underperformed when compared to that of the S&P 500. GENERAL MOTORS CO reported significant earnings per share improvement in the most recent quarter compared to the same quarter a year ago. This company has reported somewhat volatile earnings recently. But, we feel it is poised for EPS growth in the coming year. During the past fiscal year, GENERAL MOTORS CO reported lower earnings of $1.64 versus $2.35 in the prior year. This year, the market expects an improvement in earnings ($4.51 versus $1.64). Regardless of the drop in revenue, the company managed to outperform against the industry average of 7.4%. Since the same quarter one year prior, revenues slightly dropped by 3.7%. The declining revenue has not hurt the company's bottom line, with increasing earnings per share. You can view the full analysis from the report here: GM Check Out Our Best Services for Investors Action Alerts PLUS Portfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade.\nProduct Features: $2.5+ million portfolio Large-cap and dividend focus Intraday trade alerts from Cramer Quant Ratings Access the tool that DOMINATES the Russell 2000 and the S&P 500.\nProduct Features: Buy, hold, or sell recommendations for over 4,300 stocks Unlimited research reports on your favorite stocks A custom stock screener Stocks Under $10 David Peltier uncovers low dollar stocks with serious upside potential that are flying under Wall Street's radar.\nProduct Features: Model portfolio Stocks trading below $10 Intraday trade alerts 14-Days Free Only $9.95 14-Days Free Dividend Stock Advisor David Peltier identifies the best of breed dividend stocks that will pay a reliable AND significant income stream.\nProduct Features: Diversified model portfolio of dividend stocks Updates with exact steps to take - BUY, HOLD, SELL Trifecta Stocks Every recommendation goes through 3 layers of intense scrutinyquantitative, fundamental and technical analysisto maximize profit potential and minimize risk.\nProduct Features: Model Portfolio Intra Day Trade alerts Access to Quant Ratings Options Profits Our options trading pros provide over 100 monthly option trading ideas and strategies to help you become a well-seasoned trader.\nProduct Features: Actionable options commentary and news Real-time trading community View other subscription services that we offer", "external_links": [], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T02:52:17.297+03:00", "highlightTitle": ""}