{"organizations": [], "uuid": "c07f0c61a16fe5ca8785d39968e801f223c4b302", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/OilEu3fj0Wfb2wyCa0wALw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_BusinessWire_New_LIVE_1/shelby_american_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-businesswire/?format=rss", "section_title": "Finance News | Business Wire - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/shelby-celebration-star-2015-goodwood-203800116.html", "country": "GB", "title": "Shelby Celebration to Be Star of 2015 Goodwood Revival", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Shelby Celebration to Be Star of 2015 Goodwood Revival", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T23:38:00.000+03:00", "replies_count": 0, "uuid": "c07f0c61a16fe5ca8785d39968e801f223c4b302"}, "author": "", "url": "https://uk.finance.yahoo.com/news/shelby-celebration-star-2015-goodwood-203800116.html", "ord_in_thread": 0, "title": "Shelby Celebration to Be Star of 2015 Goodwood Revival", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Sep 5, 2015, 00:45 BST - UK Markets closed Shelby Celebration to Be Star of 2015 Goodwood Revival Press Release : Carroll Shelby International, Inc. – 3 hours ago 50 th anniversary of Shelby American’s FIA Sports Car World Championship to be honored Continuation Shelby Cobra Daytona Coupe to be debuted in Europe Carroll Shelby’s grandson and Alan Mann’s son to star in “recreation” press conference Autograph session will feature original team members \nThe UK’s Goodwood Revival will be the international stage for Carroll Shelby International, Inc . (CSBI:PK), Carroll Shelby Licensing and Shelby American to celebrate the 50 th anniversary of its FIA World Sports Car Championship with a host of events and debuts. Among the special activities on Sept. 11-13 will be the European introduction of the continuation Shelby Cobra Daytona Coupe with a “recreation” press conference, an autograph session featuring original team members, appearances by Shelby executives and the first gathering in history of all six Cobra Daytona Coupes in public. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150904005743/en/ Shelby Cobra Daytona Coupe Aluminum. (Photo: Business Wire) \n“The Goodwood Revival will be an important milestone for Shelby,” said Neil Cummings , Co-CEO of Carroll Shelby International and CEO of Carroll Shelby Licensing. “We’re honored to debut our new Cobra Daytona Coupe at Goodwood as the world celebrates the 50 th anniversary of Shelby American earning the United States its first and only World Sports Car Championship. The event is a key part of our international initiative to create a network of dealers and mod shops worldwide.” \nCarroll Shelby International , Carroll Shelby Licensing and Shelby American will host events for the approximately 150,000 spectators from around the world throughout the three days of the Revival. \nShelby members and official Goodwood theatrical company actors will produce a “press conference” that would have taken place in 1965 before the World Championship. The production will feature Aaron Shelby acting as his grandfather, Carroll Shelby, as well as Henry Mann, playing his father Alan Mann next to a polished aluminum Shelby Cobra Daytona Coupe that is identical to the 1960s-built cars. The press conference will take place on Sept. 11 at 2 p.m. in the Bill Shepherd Mustang exhibit (booth #25 in the Retail Village), which is an official Shelby Cobra dealer and a new Shelby mod shop for late model vehicles. The groups will bring this unique experience to life for the first time in history. \n“We’re delighted to honor the 50 th anniversary of Shelby American’s World Sports Car Championship success by recreating the 1965 Sebring pits for what will be a wonderfully nostalgic display,” said Lord March, Goodwood Revival founder. “Gathering all six Shelby Cobra Daytona Coupes for the first time in history was a difficult feat, but the support of their current owners demonstrates the importance of this racing achievement. Since Carroll Shelby’s team was truly an international effort comprised of people and machinery from across the globe, the Goodwood Revival, the world’s largest historic motor racing event, is the perfect place to tell the story of an underdog team who made motor racing history with their achievements.” \nFollowing the production of the press conference, Shelby has invited designer Peter Brock, as well as team drivers Allen Grant and Jack Sears to be part of an autograph session; the session will be repeated on Sept. 12 at 11:30 a.m. There will also be a photo opportunity with the Daytona Coupes in the pits. \n“There are only six original Shelby Cobra Daytona Coupes built in the world, making them worth millions of dollars each today,” said Joe Conway , Co-CEO of Carroll Shelby International and CEO of Shelby American. “The demand was so strong for these unique cars that we are making 50 continuation versions that are available in aluminum and fiberglass. The Goodwood Revival stage will allow us to put those cars, as well as the modern-day Shelbys into proper context for our global fans.” \nBill Shepherd Mustangs recently became both a Shelby Mod Shop for the United Kingdom and Shelby Cobra dealer. The company will host a group of American Shelby executives inside its exhibit, which will feature the continuation Shelby Cobra Daytona Coupes and a continuation FIA Shelby Cobra Roadster. \nAbout Carroll Shelby Licensing \nAutomotive manufacturer and entrepreneur Carroll Shelby is one of the most famous and successful high performance visionaries in the world. He was also a pioneer for modern automotive licensing programs; beginning in the 1960s, he began licensing his name and designs for various products. He founded Carroll Shelby Licensing Inc., which is the exclusive holder of trademarks and vehicle design rights for some of the most famous muscle cars and high-performance vehicles. CSL also holds trademark rights for Shelby-branded apparel, accessories and collectibles. For more information about the company or licensing opportunities, call (310) 914-1843, fax (310) 538-8189, write Carroll Shelby Licensing, Inc., 19021 S Figueroa St., Gardena, CA 90248, or visit www.shelby.com . \nAbout Shelby American, Inc. \nFounded by legend Carroll Shelby, Shelby American manufactures and markets performance vehicles and related products. The company builds authentic continuation Cobras, including the 427 S/C, 289 FIA, 289 street car and Daytona Coupe component vehicles; it offers the Shelby GT, 1000, GT500 Super Snake and GTS post-title packages for the 2005-2015 Ford Mustang. Shelby American also builds the Shelby Raptor muscle truck and Shelby Focus ST hot hatch. For more information, visit www.shelby.com . \nAbout the Goodwood Revival \nStaged every September since 1998, the Goodwood Revivalis the world’s largest historic motor racing and vintage culture event, with a sell-out crowd of nearly 150,000 attending in period clothing each year. Held at the Goodwood Motor Circuit, the only motor sport venue on the planet to remain preserved in its original form, the Revival attracts visitors, racers and celebrities from all over the world. Highlights of the 2015 event, which takes place on September 11-13, include 15 races for racing cars and bikes built up to 1966, a special tribute to motor sport legend Bruce McLaren, a celebration of the 50 th anniversary of Shelby’s world title with a special Sebring pit area, the Freddie March Spirit of Aviation concours d’elegance, numerous air displays, Best-Dressed, the Revival Car Show presented by Stewart Miller and Peter James Insurance, an authentic Revival High Street, and the Over the Road entertainment area. View source version on businesswire.com: http://www.businesswire.com/news/home/20150904005743/en/ Contact \nfor Carroll Shelby International, Inc.Scott Black, 214-520-3430 ext. 303", "external_links": [], "published": "2015-09-04T23:38:00.000+03:00", "crawled": "2015-09-05T02:46:36.750+03:00", "highlightTitle": ""}