{"organizations": [], "uuid": "e10ef2a2f6eafa02115c486e2123a581d687584a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/refugee08915.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/nowhere-to-run/43315.html", "country": "IN", "title": "Nowhere to Run", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Nowhere to Run", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T09:50:00.000+03:00", "replies_count": 0, "uuid": "e10ef2a2f6eafa02115c486e2123a581d687584a"}, "author": "Pia Dangelmayer (ProPublica)", "url": "http://www.moneylife.in/article/nowhere-to-run/43315.html", "ord_in_thread": 0, "title": "Nowhere to Run", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pia Dangelmayer (ProPublica) | 08/09/2015 12:20 PM | A Roundup of Reporting on the Refugee Crisis in Europe Every day we’re struck by terrible headlines concerning the refugee crisis in Europe: Austria finds 71 migrants dead in a truck. Hungarian police officers fire teargas at migrants. Fifty refugees die in a ship’s hold off the coast of Libya. News like this has become almost commonplace. With the Syrian Civil War raging, ISIS displacing millions in Iraq, Ukraine and Russia at loggerheads, and multiple states in Africa mired in poverty, the number of migrants will surely increase in the months to come. To better understand what is at stake, we’ve compiled some of the best reports from the U.S. and Europe. The Global Refugee Crisis, Region by Region The New York Times, August 2015 Why do people leave their country? Why has the United Nations called this migration crisis the worst since World War II? Take a look at the hot spots illuminated by clarifying graphics. Life on Hold – The Struggle of Syrian Refugees in Lebanon Al Jazeera, March 2015 Europeans may feel that they are taking on the biggest influx of refugees, but most Syrians fleeing from war never make it to Europe. While the European Union currently hosts about 350,000 Syrian refugees, Lebanon – a country of 4.5 million – has received nearly 1.5 million. The refugees wait in camps and abandoned buildings. For them, as well as for the country that shelters them, life has changed unalterably. Why Is EU Struggling With Migrants and Asylum? BBC, August 2015 Another year, another record: Germany is expecting more than 800,000 refugees to arrive by the end of this year, 4 times more than the last. Where do they come from, which routes do they take, and what has caused migrant numbers to rise? Scenes From a Tragedy: Just Another Week in Europe’s Migrant Crisis – in Pictures The Guardian, August 2015 Refugees arriving on a beach full of tourists in Greece. A fence set up to seal the border in Hungary. Migrants running after trains and trucks to get from France to England. Flight has many faces – some of them shown in these impressive photographs. On Island of Lesbos, a Microcosm of Greece’s Other Crisis: Migrants The New York Times, August 2015 The Greek isles are a new hotspot in Europe’s migrant crisis. More than 150,000 refugees have already arrived this year. The islands of Lesbos, Kos or Chios, which are close to the coast of Turkey, can hardly cope with the influx.", "external_links": [], "published": "2015-09-08T09:50:00.000+03:00", "crawled": "2015-09-08T10:17:57.050+03:00", "highlightTitle": ""}