{"organizations": [], "uuid": "947e1278315a3046f7b2490dac27720a8875d9d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509221060.html", "country": "US", "title": "Swaziland: King Personally Sued for U.S.$1.5 Million", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Swaziland: King Personally Sued for U.S.$1.5 Million", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T14:56:00.000+03:00", "replies_count": 0, "uuid": "947e1278315a3046f7b2490dac27720a8875d9d9"}, "author": "", "url": "http://allafrica.com/stories/201509221060.html", "ord_in_thread": 0, "title": "Swaziland: King Personally Sued for U.S.$1.5 Million", "locations": ["U.S.", "Swaziland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Swaziland: King 'To Meet Democracy Groups' \nKing Mswati III of Swaziland is to be personally sued for US$1.5 million after the collapse of the Ngwenya iron ore mine in his kingdom. \nThe court action will take place in the British Virgin Islands (BVI) because the King is immune from the law in Swaziland where he rules as an absolute monarch. \nThe case is expected to shed new light on the way the King does business with foreign investors and the control he exerts over them. \nAt one point it is said the King took US$1.5 million from the company running the Ngwenya mine to buy art work from a New York dealer. He refused to repay the company the money and it collapsed soon after with the loss of 700 jobs and debts to creditors of about US$4 million. \nThe court case to be heard in the Eastern Caribbean Supreme Court in BVI has been started by Shanmuga Rethenam, a businessman popularly known as Shan. In an affidavit to the court Shan stated that on 30 June 2011 King Mswati (referred to throughout the document as HMK) granted a seven-year mining lease to SG Iron, which was formerly known as Salgaocar Swaziland, to mine iron ore dumps left in the Ngwenya mining area by the Anglo American Mining Corporation in the 1970s. \nTwenty-five percent of the shares were issued to the Swaziland Government for no payment; 25 percent went to the King 'in trust for the Swazi nation', and 50 percent were issued to Southern Africa Resources Africa Limited (SARL), which was formerly known as Salgaocar Resources Africa Limited. \nIn his affidavit, Shan stated, 'The arrangement by which HMK owned 25 percent of SG Iron \"in trust for the Swazi nation\" is a familiar one in Swaziland. I am aware that HMK owns the Tibiyo Taka Ngwane and Tisuka Taka Ngwane funds, which account for about half of Swaziland's economy, on that basis. In my experience, HMK takes an active interest in the commercial success of his investments and commonly issues instructions through his representatives such as Mr Lutfo [Dlamini] or Mr Sihle [Dlamini], on commercial issues.' \nShan stated that SARL provided all the capital, more than US$50 million, and all the expertise to undertake the iron ore operations at Ngwenya. \nHe stated, 'On 6 April 2012, HMK requested through Mr Sihle [the King's representative on the company's board] that SG Iron pay him an \"advanced dividend,\" which was in effect a loan of US$10 million. SG Iron's directors were given no choice and so, on 16 April 2012, we resolved to agree to HMK's \"request\" and to make the payment of US$10 million. It was HMK's desire to avoid repaying this loan that subsequently led to the collapse of operations at the Ngwenya mine. \nShan added, 'In about June 2011, shortly before the mining lease was awarded, I met HMK in Swaziland. He requested that SARL agree to pay him a personal benefit of US$0.50 per dry metric tonne of iron ore from the Ngwenya mine exported from Swaziland. SARL's directors were given no choice and so we agreed to HMK's \"request\". \nSG Commodities [a company that trades in commodities] was to be the vehicle through which payments would be made, and the payments were always directed to third party recipients on HMK's behalf, so that no payments would be made directly from SARL to HMK. Prior to December 2013, SARL paid HMK through SG Commodities approximately US$700,000 pursuant to that agreement.' \nShan added, 'In or about October or early November 2013, I met HMK in Swaziland. He requested that SG Commodities agree to grant him a loan of US$1.5 million, to be repaid to SG Commodities out of the payments anticipated to be due to HMK pursuant to his agreement with SARL. \nSG Commodities was given no choice and so I agreed on SG Commodities' behalf to HMK's \"request\". On 18 December 2013 Mr Sihle directed SG Commodities on HMK's behalf to advance the US$1.5 million capital sum by making payment to a New York art dealer, Metropolitan Fine Arts & Antiques Inc, from whom HMK had purchased certain artworks.' \nShan added that in early 2014 King Mswati told him he was unable to repay his loan from SG Iron. \nIn his affidavit, Shan stated, 'To avoid his repayment obligations, HMK then set about engineering the collapse of SG Iron and expropriating SARL's investment in Swaziland. On 21 August 2014, Mr Sihle issued an order on HMK's behalf to SG Iron, without consulting or informing me or anyone else from SARL, to stop all sales of iron ore cargo from the Ngwenya mine. \nMining operations were progressing satisfactorily and there was no proper reason to issue any such order. Indeed, the immediate result of the order was that perfectly saleable cargo began to stockpile. The inability to sell cargo cost SG Iron millions of dollars of working capital and created an artificial and wholly avoidable cashflow crisis.' \nShan added, 'In September 2014, in the midst of the crisis, Mr Sihle demanded on HMK's behalf that SARL agree to SG Iron writing off HMK's debt to SG Iron, that SARL write off some of SG Iron's US$57,186,022.53 debt to SARL and that SARL inject further capital into SG Iron. \nNone of the steps demanded by Mr Sihle would have been necessary had HMK simply permitted the sales of cargo to resume, and would have been pointless since sales were prohibited, and so SARL refused. Mining operations collapsed shortly thereafter.' \nShan added, 'Mr Sihle told me that HMK had instructed him to shut down SG Iron and to start afresh, and that if I did anything to retaliate then I would be arrested and an Interppol [international police] notice would be issued against me.' \nShan added, 'What happened next illustrates the power of an absolute monarch who exercises complete control over Swaziland's judiciary, as well as its legislative and executive branches of government. Mr Sihle applied on SG Iron's behalf, without consulting or informing me or anyone else from SARL (and having intimidated me to prevent me from intervening as described above) to the High Court of Swaziland for orders which had the effect of destroying SG Iron and expropriating SARL's investment in Swaziland. At HMK's direction, the court appointed to SG Iron a judicial manager on 10 October 2014, a provisional liquidator on 16 December 2014and a liquidator on 30 January 2015. \nShan added, 'The expropriation of SARL's investment is the subject of an ongoing dispute between SARL and the Kingdom of Swaziland under the Swaziland Investment Promotion Act (1998) and the Southern African Development Community Protocol on Finance and Investment (2006).' \nShan added, 'I caused SG Commodities to make payments to Metropolitan [the art dealer] because HMK, through Mr Sihle, demanded that I do so. I understood that demand to come with an implied threat that, if HMK's demand was not met, the Ngwenya iron ore mine project would be placed in jeopardy. SG Commodities therefore also seeks restitution of those monies by reason of economic duress applied by HMK.' \nKing Mswati III is one of two respondents in the case. The other is Inchatsavane Company (Proprietary) Limited. King Mswati is described as the sole shareholder in this company. \nThe case is to be heard in the BVI because that is where SG Commodities is incorporated. Swaziland \nKing Mswati III, the absolute monarch in Swaziland, is being forced to hold talks with pro-democracy groups, according … see more » Copyright © 2015 Swazi Media Commentary. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-22T14:56:00.000+03:00", "crawled": "2015-09-22T17:11:19.424+03:00", "highlightTitle": ""}