{"organizations": ["European Union", "ITG", "Bloomberg"], "uuid": "44f59c03778b7f34cc558be16663714f93d8dd9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/institutional-forex/wp-content/uploads/sites/9/2015/09/Regulation-form.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/institutional-forex/regulation/itg-publishes-comprehensive-faqs-guide-ahead-of-mifid-ii-passage/", "country": "US", "title": "ITG Publishes Comprehensive FAQs Guide Ahead of MiFID II Passage", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "ITG Publishes Comprehensive FAQs Guide Ahead of MiFID II Passage", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T16:52:00.000+03:00", "replies_count": 0, "uuid": "44f59c03778b7f34cc558be16663714f93d8dd9e"}, "author": "", "url": "http://www.financemagnates.com/institutional-forex/regulation/itg-publishes-comprehensive-faqs-guide-ahead-of-mifid-ii-passage/", "ord_in_thread": 0, "title": "ITG Publishes Comprehensive FAQs Guide Ahead of MiFID II Passage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ITG Publishes Comprehensive FAQs Guide Ahead of MiFID II Passage ITG Publishes Comprehensive FAQs Guide Ahead of MiFID II Passage The primary focus of the FAQs deal with the European Union’s updated Markets in Financial Instruments Directive (MiFID II). Advertising Print This Post Photo: Bloomberg \nITG (NYSE:ITG), an independent execution broker and research provider, has published a composite of frequently asked questions (FAQs) to help assist asset managers in preparing for and dealing with upcoming European regulations surrounding research payments. \nThe primary focus of the FAQs deal with the European Union’s updated Markets in Financial Instruments Directive (MiFID II), whereby grappling proposals to unbundle payments for investment research from trading commissions. \nAmbiguity surrounding the passage of MiFID II regulations is not unusual – as recently as last month the FIX Trading Community, a non-profit industry-wide initiative, fostered a targeted focus on MiFID II, culminating in the creation of six new subgroups to specifically address the regulation . \nOne of the fundamental goals of the new regulation is to force brokers to accurately price and charge for services in distinctively sovereign functions in a bid to enhance transparency and accountability. Moreover, this procedure will also help achieve the most efficient execution, whilst maximizing research value. Currently, European investment managers will be required to implement the changes on a global basis before the end of 2017. \nThe FAQs includes some notable insights such as how asset managers will be paying for research under the proposed MiFID II rules, or how new regulation is likely to affect sell-side pricing, and what steps asset managers should ultimately take in preparation. The full list of FAQs can be accessed at by the following link . \nAccording to Jack Pollina, Global Head of Commission Management and Hedge Fund Business Development at ITG in a recent statement on the FAQs, “Asset managers with clients registered in Europe will inevitably need to adjust their research payment processes. These FAQs discuss the proposed research payment regulations and should help asset managers understand and prepare for the coming changes.” \nITG recently made headlines after reporting lackluster trading volumes last month. The notable decline in volumes was tied to ITG’s recent brush with regulatory authorities, which has caused an outflow of existing business. In July, ITG as well as its affiliate AlterNet Securities, agreed to collectively pay $20.3 million to settle charges over the breach of dark pool trading confidentiality with the US’ Securities and Exchange Commission (SEC) . The SEC stipulated that the broker operated a secret trading desk and misused the confidential trading information of dark pool subscribers. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-09-28T16:52:00.000+03:00", "crawled": "2015-09-28T14:00:10.411+03:00", "highlightTitle": ""}