{"organizations": [], "uuid": "5aa9be11f9f060cdfae916348b32e479d6a8b5f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=AGCO", "section_title": "Yahoo! Finance: AGCO News", "url": "http://finance.yahoo.com/news/3-reasons-why-agco-corporation-125412521.html", "country": "US", "title": "3 Reasons Why AGCO Corporation (AGCO) is a Great Value Stock - Tale of the Tape - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "3 Reasons Why AGCO Corporation (AGCO) is a Great Value Stock - Tale of the Tape - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "5aa9be11f9f060cdfae916348b32e479d6a8b5f4"}, "author": "Zacks Equity Research", "url": "http://finance.yahoo.com/news/3-reasons-why-agco-corporation-125412521.html", "ord_in_thread": 0, "title": "3 Reasons Why AGCO Corporation (AGCO) is a Great Value Stock - Tale of the Tape - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Many investors like to look for value in stocks, but this can be very tough to define. There is great debate regarding which metrics are the best to focus on in this regard, and which are not really quality indicators of future performance. Fortunately, with our new style score system we have identified the key statistics to pay close attention to and thus which stocks might be the best for value investors in the near term. \n\nThis method discovered several great candidates for value-oriented investors, but today let’s focus on AGCO Corporation (AGCO) as this stock is looking especially impressive right now. And while there are numerous reasons why this is the case, we have highlighted three of the most vital reasons for AGCO’s status as a solid value stock below: \n\nPrice to Forward Sales for AGCO Corporation \n\nOne of the most underrated ratios for value investors is the price/forward sales metric. This ratio shows investors how much they are paying for each dollar of revenues generated. In other words, a lower number is better here while a price to sales ratio of 1 means that you are paying one dollar for each dollar in sales. \n\nWith a P/S ratio of 0.57, AGCO investors are paying 57 cents in stock price for each dollar of revenue generated by the company. Compare this to the industry average of 0.82, and it is safe to say that AGCO is undervalued compared to many of its peers on this important metric. \n\n\nPrice/Cash Flow for AGCO Corporation Stock \n\nAn often overlooked ratio that can still be a great indicator of value is the price/cash flow metric. This reading is preferred by some since it avoids amortization and depreciation concerns and can give a more accurate picture of the financial health in a business. \n\nThe P/CF ratio for AGCO comes in at 6.96, and since investors are generally looking for a reading under 20 here, this is pretty good news. Meanwhile, we should also point out that the industry average for this metric is 9.47, so AGCO Corporation has its peers beat in this regard too. \n\nAGCO Earnings Estimate Revisions Moving in the Right Direction \n\nThe solid value ratios outlined in the preceding paragraphs might be enough for some investors, but we should also note that the earnings estimate revisions have been trending in a positive direction as well. Analysts who follow AGCO stock have been raising their estimates for the company lately, meaning that the EPS picture is looking a bit more favorably for AGCO Corporation now. \n\nOver the past 30 days 6 earnings estimates have gone higher compared to no downward revision for the full year. These revisions have helped to boost the consensus estimate as 30 days ago AGCO was expected to post earnings of $2.91 per share for the full year though today it looks to have EPS of $3.10 for the full year. \n\nBottom Line \n\nFor the reasons detailed above, investors shouldn’t be surprised to read that we have AGCO as a stock with a Value Score of ‘B’ and a Zacks Rank #1 (Strong Buy). So if you are a value investor, definitely keep AGCO on your short list as this looks be a stock that is very well-positioned for gains in the near term. \n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days . Click to get this free report >> \n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report \n \nAGCO CORP (AGCO): Free Stock Analysis Report \n \nTo read this article on Zacks.com click here. \n \nZacks Investment Research \nIndustrials AGCO Corporation", "external_links": [], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T00:34:58.016+03:00", "highlightTitle": ""}