{"organizations": ["NZST"], "uuid": "84cb01746f81aa65037030e82e6ad28d3ad66a15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nz.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://nz.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Latest business and finance news from New Zealand and the world's key markets - Yahoo New Zealand Finance", "url": "https://nz.finance.yahoo.com/news/gains-fade-firm-start-005810526.html", "country": "US", "title": "Gains fade after a firm start", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Gains fade after a firm start", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:58:00.000+03:00", "replies_count": 0, "uuid": "84cb01746f81aa65037030e82e6ad28d3ad66a15"}, "author": "", "url": "https://nz.finance.yahoo.com/news/gains-fade-firm-start-005810526.html", "ord_in_thread": 0, "title": "Gains fade after a firm start", "locations": ["New Zealand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fri, Sep 25, 2015, 1:01 PM NZST - New Zealand Markets close in 3 hrs 59 mins Gains fade after a firm start AAP – 2 minutes 53 seconds ago Recommend Print \nA modestly higher start in the Australian share market seemed to be fading in early trade on Friday following a bout of bargain hunting in the previous session. \nThe benchmark S&P/ASX200 index rose close to one per cent early but had pared back to just 0.2 per cent higher within the first half hour of trade. \nInvestors seemed nonplussed by US Federal Reserve chief Janet Yellen's statement overnight that she still expects to increase interest rates in 2015 but economic surprises could affect that plan. \nAhead of her speech, US stocks finished lower on the back of global growth fears as shares in industrial heavyweight Caterpillar sunk after it announced thousands of job cuts. \nThe Dow Jones Industrial Average closed 0.48 per cent lower at 16,201.32. \n\"Everyone was hoping for something more meaningful. I think it added to the smoke and mirrors,\" Patersons economist Tony Farnham said. \nConsumer staples were among the sectors in focus in the local market. Retailer Myer, supermarket rivals Woolworths and Wesfarmers and electronics chain JB HiFi were all trading between one to three per cent higher. \nThe big four banks were mixed, with Commonwealth Bank down 29 cents to $72.21, Westpac slipping eight cents to $30.28, while NAB gained five cents to $30.25 and ANZ added four cents at $27.38. \nEnergy stocks were under pressure despite global crude oil prices edging higher overnight. Oil Search was down 18 cents to $7.67, Santos lost six cents at $4.76, while Origin Energy slipped 10 cents to $6.60 a share. \nKEY FACTS \n* At 1045 AEST on Friday, the benchmark S&P/ASX200 index was up 9.1 points, or 0.2 per cent, at 5,080.8 points. \n* The broader All Ordinaries index was up 10.1 points, or 0.2 per cent, at 5,112.40 points. \n* The December share price index futures contract was flat at 5,058 points, with 16,510 contracts traded. \n* National turnover was 609.5 million securities worth $2.386 billion. @YahooNZBusiness on Twitter, become a fan on Facebook Aust shares open higher AAP \nThe Australian share market has opened higher. At 1010 AEST on Friday, the benchmark S&P/ASX200 index was up 36.6 …", "external_links": [], "published": "2015-09-25T03:58:00.000+03:00", "crawled": "2015-09-25T04:05:41.060+03:00", "highlightTitle": ""}