{"organizations": [], "uuid": "bf2046395959e589a80fe95303d1a80d98acbdd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/upa-awarded-aadhaar-card-projects-over-rs13000-crore-without-tenders/43423.html", "country": "IN", "title": "'UPA awarded Aadhaar card projects over Rs.13,000 crore without tenders'", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "'UPA awarded Aadhaar card projects over Rs.13,000 crore without tenders'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T13:04:00.000+03:00", "replies_count": 0, "uuid": "bf2046395959e589a80fe95303d1a80d98acbdd5"}, "author": "IANS", "url": "http://www.moneylife.in/article/upa-awarded-aadhaar-card-projects-over-rs13000-crore-without-tenders/43423.html", "ord_in_thread": 0, "title": "'UPA awarded Aadhaar card projects over Rs.13,000 crore without tenders'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » 'UPA awarded Aadhaar card projects over Rs.13,000 crore without tenders' 43423 'UPA awarded Aadhaar card projects over Rs.13,000 crore without tenders' 0 Comments, Be the first to comment + COMMENT IANS | 19/09/2015 03:34 PM | Aadhaar card projects of the UIDAI worth over Rs.13,000 crore were awarded without issuing tenders by the previous UPA government, according to a RTI response, an activist said here on Saturday. RTI activist Anil Galgali had submitted queries under the RTI to the UIDAI officials, Public Information Officer S.S. Bisht and Deputy Director-cum-PIO R. Harish who provided the replies about the amount spent on the projects which was then headed by technocrat Nandan Nilekani. In the reply, the UIDAI officials disclosed that total project contracts worth Rs.13,663.22 crore were awarded without any tenders of which an amount of Rs.6,563 crore has been already spent on issuing 90.3 crore Aadhar Cards till May 2015. They further informed that a total 25 companies were awarded different responsibilities for the massive project and their empanelment was done under the process guidelines of Request For Empanelment of May 19, 2014. \"This is shocking as various sections of people, including the Supreme Court and civil society groups have expressed serious concerns about the right to privacy with sensitive personal data of 125 crore population going in the hands of private companies,\" Galgali told IANS. He urged Prime Minister Narendra Modi to order a probe into the UIDAI to ensure transparency in the award of contracts for Aadhaar cards. \"The sensitive datas of finger prints and iris of each and every Indian could be unsafe with private companies,\" cautioned Harsheet Shah, cyber law expert-cum-researcher. According to the information, some of the companies awarded more than one project works include: Tata Consultancy Service, Mac Associates, Wipro, HCL, HP India Sales Pvt. Ltd., National Informatics Centre, Sagem Morpho Securities Pvt. Ltd, Satyam Computer Services Ltd, L1 Identity Solutions, Totem International Ltd., Linkwel Telesystems Pvt. Ltd. Sai Infosystems India Ltd, Geodesic Ltd, ID Solutions, NISG, SQTC, Telesima Communications Pvt. Ltd. Others which secured a single contract include: Reliance Communication, Tata Communications, Aircel, Bharati Airtel, BSNL and Railtel Corporation of India Ltd. Disclaimer: Information, facts or opinions expressed in this news article are presented as sourced from IANS and do not reflect views of Moneylife and hence Moneylife is not responsible or liable for the same. As a source and news provider, IANS is responsible for accuracy, completeness, suitability and validity of any information in this article. More in Moneylife", "external_links": [], "published": "2015-09-19T13:04:00.000+03:00", "crawled": "2015-09-19T13:41:40.630+03:00", "highlightTitle": ""}