{"organizations": ["Associated Press"], "uuid": "6bc0d8d11deac8525adadb3501187c63186f7ba5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/category-currencies/?format=rss", "section_title": "Currency & Forex News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/li-says-china-open-currency-060240291.html", "country": "US", "title": "Li says China to open currency market to central banks", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Li says China to open currency market to central banks", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T10:30:00.000+03:00", "replies_count": 0, "uuid": "6bc0d8d11deac8525adadb3501187c63186f7ba5"}, "author": "", "url": "https://au.finance.yahoo.com/news/li-says-china-open-currency-060240291.html", "ord_in_thread": 0, "title": "Li says China to open currency market to central banks", "locations": ["Australia", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Li"], "text": "Thu, Sep 10, 2015, 7:13 PM AEST - Australia Markets closed Li says China to open currency market to central banks Li says China to open currency market to foreign central banks in latest financial reform Associated Press – 1 hour 43 minutes ago Recommend Print \nBEIJING (AP) -- China plans to allow foreign central banks into its interbank currency market, the country's No. 2 leader said Thursday, in a new move to expand use of the tightly controlled Chinese yuan. \nSpeaking at a business conference, Premier Li Keqiang gave no time frame for the change or details of what foreign institutions would be allowed to do. The move follows Beijing's decision in March to allow some foreign investors into the market in which its state-owned banks trade bonds. \n\"In our next step, we will open the interbank foreign exchange market to non-mainland central bank-type institutions,\" said Li at the World Economic Forum in the eastern city of Dalian. \nBeijing controls the yuan's exchange rate and limits movement of money into and out of China but has been encouraging use of its yuan abroad, mostly for trade. The central bank said its surprise Aug. 11 devaluation of the yuan, which rattled global financial markets, was part of efforts to make the exchange rate more market-oriented. \nWider use of the yuan would reduce costs for China's traders and encourage sales of Chinese goods abroad, economists say. \nThe interbank foreign exchange market is used for setting the exchange rate of the yuan, but buying and selling takes place in a separate market, according to Tan Yaling, director of the China Forex Investment Research Institute. \nUntil now, participants were mostly Chinese banks and a handful of foreign entities, said Tan, a former Chinese central bank analyst. She said expanding the pool of institutions that submit information will more accurately reflect supply and demand. \n\"Including the central bank-type institutions will improve the rationality of the exchange rate,\" said Tan. \nFinancial analysts say moves to making the yuan more market-oriented also are part of Chinese efforts to win acceptance for the yuan as part of the basket of currencies used by the International Monetary Fund to set the value of its internal currency, known as Special Drawing Rights. \nThe IMF staff recommended last month week that China wait until at least October 2016 to be added to the basket that includes the dollar, yen, euro and pound. The Fund's board is due to consider that recommendation in October. @y7finance on Twitter, become a fan on Facebook", "external_links": [], "published": "2015-09-10T10:30:00.000+03:00", "crawled": "2015-09-10T12:17:53.168+03:00", "highlightTitle": ""}