{"organizations": [], "uuid": "d1df4575317cf4af9900de2ab7b94d7c836e4e5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/1/p/b/s/image.related.afrArticleLead.620x365.gjj1wu.png/1441842680984.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/debt-markets/deutsches-joseph-lavorgna-sees-october-rate-rise-20150909-gjj1wu", "country": "AU", "title": "Deutsche's chief US economist Joseph LaVorgna sees October rate rise", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Deutsche's chief US economist Joseph LaVorgna sees October rate rise | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T06:27:00.000+03:00", "replies_count": 0, "uuid": "d1df4575317cf4af9900de2ab7b94d7c836e4e5b"}, "author": "Alexandra Scaggs", "url": "http://www.afr.com/markets/debt-markets/deutsches-joseph-lavorgna-sees-october-rate-rise-20150909-gjj1wu", "ord_in_thread": 0, "title": "Deutsche's chief US economist Joseph LaVorgna sees October rate rise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Fed's preferred gauge of the dollar, the trade-weighted broad dollar index, continues to strengthen. iStock by Alexandra Scaggs Joseph LaVorgna, Deutsche Bank's chief US economist, has had a change of heart about the Federal Reserve.\nIn a report Wednesday, he pushed out his forecast for the Fed's first interest-rate increase in nearly a decade until October. That's a change from two weeks ago, when he and his team predicted that steady growth in the economy would lead the Fed to raise rates this month. International market turmoil and persistently low inflation have led bond futures traders and strategists to trim bets on a September rate rise.\n\"I'm totally convinced they don't need to move\" this month, he said in a phone interview. \"October seems to work really well.\"\nHere are the seven reasons LaVorgna gives for changing his view:\n1) Global stock markets are fragile:\nIn the US, for example, the S&P 500 declined 11 per cent over a six-day span last month, which is twice the normal amount of adjustment that has historically occurred before the initiation of an increase in the fed funds rate.\n2) The Fed's preferred gauge of the dollar, the trade-weighted broad dollar index, continues to strengthen:\nIn Fed models of the economy, this will have an appreciable negative effect on net exports and hence real GDP.\n 3) Financial markets aren't pricing in a rate hike:\nThe financial markets are not discounting a Fed hike this month, and history is clear that policymakers are loathe to disappoint financial markets.\n4) Key members of the Federal Open Markets Committee appear to be backtracking from a September move:\nLaVorgna cites recent statements from Atlanta Fed president Dennis Lockhart, New York Fed president William Dudley, and San Francisco Fed president John Williams.\n5) The Fed still has two more opportunities to raise rates this year:\nThus, the Fed could wait a little bit longer to see if global financial markets settle down.\n6) Because there are still those two meetings left, the Fed doesn't see any risk of losing market credibility:\n\"We feel the Fed has no reason to believe that standing pat in September risks reputational damage, as there is still time to raise rates this year,\" LaVorgna says.\n7) There's no sign of prices picking up any time soon:\nWith headline and core inflation consistently below the Fed's targeted level for over three years, monetary policymakers will have a hard time explaining to the public why they are raising interest rates.\nBloomberg", "external_links": [], "published": "2015-09-10T06:27:00.000+03:00", "crawled": "2015-09-10T04:06:30.405+03:00", "highlightTitle": ""}