{"organizations": [], "uuid": "45cfb10c8dc1c5bb08d95d64a2202415e6287f1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/09/22/12978447/firekeepers346173816_std.63143034_std.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12978447.htm", "country": "US", "title": "FireKeepers Casino Successfully Deploys Group Manager by Playersoft", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "FireKeepers Casino Successfully Deploys Group Manager by Playersoft", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "45cfb10c8dc1c5bb08d95d64a2202415e6287f1f"}, "author": "Jamie Grolle", "url": "http://www.prweb.com/releases/2015/09/prweb12978447.htm", "ord_in_thread": 0, "title": "FireKeepers Casino Successfully Deploys Group Manager by Playersoft", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FireKeepers Casino and Playersoft Technologies are pleased to announce another successful installation of Playersoft’s Group Manager System. FireKeepers Casino has been using the Group Manager product for several months with unparalleled success streamlining their group tour operation . With nearly 3,000 slots and a huge gaming floor, FireKeepers is seeing a lot of players coming in via charter bus and they wanted to ensure the new players had a quick and easy way to register for a player’s card and be properly incentivized to participate in their active promotions. The Group Manager system is both a mobile and desktop application providing FireKeepers a complete overview of casino groups and bus tours. It also allows them to create groups immediately upon arrival and issue them pre-defined offer packages, enrollment in their club, track all play associated with the group in real-time and ties it back to specific charters, groups or events. Additionally, the solution allows FireKeepers to ensure their player reinvestment strategy makes good financial sense for the operation and provides patrons the best possible experience upon arrival. Current users at FireKeepers Casino Hotel, Battle Creek, Michigan are raving about Group Manager:\n“The Playersoft Group Manager System has greatly improved our ability to greet buses. For guests who already have player cards, the process is seamless, and staffing requirements are minimal. For those who do not, the ability to enroll instantly and print cards wirelessly is also an improvement over past processes. As a bonus – group leaders and line run organizers are thrilled with the fact that they no longer need to send manifests in advance.” -Dustin Ploehn, Rewards Club Manager\nThe front line staff are seeing the system as an asset as well:\n“In my opinion, adding this system was one of the best decisions we could’ve made for bus operations. The system has helped us move guests from the bus to the gaming floor quicker, and it is very easy to use! I’ve heard lots of positive feedback from our guests.” - Alissa P., Bus Greeter\n“We are pleased to add FireKeepers to the Playersoft family. Working with customers who take such a progressive approach to operations is always gratifying. FireKeepers success with the product underscores its value to the operation, streamlining, improving and adding to the bottom line,” mentioned Tony de Leon, President & CEO of Playersoft Technologies, Inc.\nFor more information and product demos visit Playersoft Technologies in booth #1636 at the upcoming G2E Conference in Las Vegas at The Las Vegas Sands Convention Center from Sep. 29 – Oct. 1.\nAbout FireKeepers Casino:\nWith over 2,900 slots, 70 table games and a 14-table non-smoking poker room, you’ll be celebrating one win after another from the minute you arrive. FireKeepers Casino Hotel is a 236,000-square-foot casino and hotel in Emmett Charter Township, Michigan, between Battle Creek and Marshall. It is owned and operated by the Nottawaseppi Huron Band of Potawatomi. Construction began May 7, 2008, and the casino opened to the general public on August 5, 2009. Construction was a joint venture between Shingobee Builders and Clark Construction.\nAbout Playersoft\nPlayersoft Technologies focuses on creating systems to streamline all aspects of the fast moving casino industry. Playersoft Technologies was established with a mission to help casino operators improve the players gaming experience, increase player retention and profitability.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5nbG9iYWxnYW1pbmdleHBvLmNvbS9lbi9FeGhpYml0b3JzLzg2NzQ0NS9QbGF5ZXJzb2Z0LVRlY2hub2xvZ2llcw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wbGF5ZXJzb2Z0LmNvbS9wYWdlL2dyb3VwbWFuYWdlciVFMiU4NCVBMg==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5wbGF5ZXJzb2Z0LmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5maXJla2VlcGVyc2Nhc2luby5jb20vdmlzaXQvYnVzLXByb2dyYW1zLw=="], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-23T18:12:20.537+03:00", "highlightTitle": ""}