{"organizations": [], "uuid": "df4da30777159d94e13236a0afef465f9b0f32bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/21/diary-emrg-econ-idUSL4N11O3I420150921", "country": "US", "title": "DIARY-Emerging Markets Economic Events to Oct 2", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "DIARY-Emerging Markets Economic Events to Oct 2 | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T04:02:00.000+03:00", "replies_count": 0, "uuid": "df4da30777159d94e13236a0afef465f9b0f32bd"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/21/diary-emrg-econ-idUSL4N11O3I420150921", "ord_in_thread": 0, "title": "DIARY-Emerging Markets Economic Events to Oct 2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sept 21 (Reuters) -\nFor other diaries, please see:\nTop economic events\nGovernment debt auctions\nPolitical and general news events\nIndex of all diaries\nGuide to economic indicators\n** This Diary is filed daily *** MONDAY, SEPTEMBER 21 ABUJA - Central Bank of Nigeria holds monetary policy meeting (to Sept. 22). PRETORIA - South African Reserve Bank starts its three-day monetary policy committee meeting (to Sept. 23). MEXICO CITY - Central Bank of Mexico publishes monetary policy statement - 1800 GMT. TUESDAY, SEPTEMBER 22 PARIS - Launch of OECD's International Migration Outlook 2015, containing analysis on recent developments in migration movements and policies in OECD countries. OECD Secretary-General Angel Gurria and OECD Director for Employment, Labour and Social Affairs Stefano Scarpetta will present the Outlook's findings at the OECD Conference Centre. MAKATI CITY - Asian Development Bank releases update to its 2015 Asian Development outlook - 0130 GMT. BUDAPEST - Central bank of Hungary holds rate-setting meeting. NAIROBI - Central bank of Kenya announces rate decision. ABUJA - Central bank of Nigeria announces rate decision - 1330 GMT. WEDNESDAY, SEPTEMBER 23 PRETORIA - South African Reserve Bank announces rate decision - 1300 GMT. THURSDAY, SEPTEMBER 24 MANILA - Central bank of Philippines holds monetary policy meeting to announce interest rates - 0800 GMT. TAIPEI - Central Bank of the Republic of China (Taiwan) announces rate decision - 0900 GMT. PRAGUE - Czech National Bank holds monetary policy meeting to announce interest rates - 1100 GMT. JERUSALEM - Bank of Israel announces rate decision - 1300 GMT. SATURDAY, SEPTEMBER 26 CHISINAU - National bank of Moldova holds monetary policy meeting. An interest rate decision is expected. TUESDAY, SEPTEMBER 29 TOKYO - OECD E-Leaders 2015 (to Sept. 30). OECD Deputy Secretary General Mari Kiviniemi will deliver opening remarks. MUMBAI, India - Reserve Bank of India holds monetary policy meeting to announce interest rates. WEDNESDAY, SEPTEMBER 30 WASHINGTON - International Monetary Fund Managing Director Christine Lagarde participates in conversation hosted by the Council of Americas on global economic policies and prospects - 1430 GMT. BUCHAREST - Central bank of Romania holds board meeting, to announce interest rates - 0700 GMT. BANGKOK - Central Bank of Thailand releases its economic forecast - 0030 GMT. BANGKOK - Central Bank of Thailand will publish the minutes of September policy meeting - 0200 GMT.\nFRIDAY, OCTOBER 2 PRAGUE - Czech National bank will publish the minutes of September governing board meeting - 0700 GMT.", "external_links": [], "published": "2015-09-21T04:02:00.000+03:00", "crawled": "2015-09-21T03:43:23.297+03:00", "highlightTitle": ""}