{"organizations": [], "uuid": "23a308df64a3639c07af5288bb090616e7f0d43f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/m/2/s/k/image.related.articleLeadwide.620x349.gjdjw1.png/1441179151591.jpg", "site_section": "http://www.canberratimes.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.canberratimes.com.au/business/banking-and-finance/carlyle-backs-prospa-securitisation-to-boost-sme-lending-20150902-gjdjw1.html", "country": "AU", "title": "Carlyle backs Prospa securitisation to boost SME lending", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Carlyle backs Prospa securitisation to boost SME lending", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T15:32:00.000+03:00", "replies_count": 0, "uuid": "23a308df64a3639c07af5288bb090616e7f0d43f"}, "author": "James Eyers and Sarah Thompson", "url": "http://www.canberratimes.com.au/business/banking-and-finance/carlyle-backs-prospa-securitisation-to-boost-sme-lending-20150902-gjdjw1.html", "ord_in_thread": 0, "title": "Carlyle backs Prospa securitisation to boost SME lending", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Online business lender Prospa will increase its loan book on the back of a fundraising supported by Carlyle and Ironbridge. Photo: Louise Kennerley\nGlobal alternative asset manager the Carlyle Group has invested $50 million in the first securitisation deal in Australia of unsecured, online business loans, which will allow Prospa to step up its small-business lending as the big banks overlook the sector.\nThe securitisation deal, which is only the third globally in the online business lending category, is part of a $60 million capital raising that was also supported by Ironbridge Capital, AirTree Ventures, and former Westpac executive David Fite. The deal was revealed by Street Talk online on Wednesday .\nProspa has lent $70 million to thousands of businesses over the past four years from its balance sheet and plans to increase this to $500 million over the next couple of years. Big banks are largely avoiding lending to SMEs without security because of concerns about managing the risks of unsecured loans.\nBeau Bertoli, Prospa's joint chief executive, said the fintech start-up, which employs 70 people in Sydney, conducted a global search to find the right investors, with deep knowledge of credit markets and deep pockets, to support Prospa's loan growth of \"many hundreds of percent year-on-year\".\nAdvertisement \"It became obvious that [Carlyle and Ironbridge] could work very closely together behind our business, and we could scale up our lending book very quickly off the back of that,\" Mr Bertoli said.\n\"It gives us a very scalable capital model and as we continue to grow so quickly we have the capability to do lots of different things in relation to the securitisation facility. This deal also shows there is a global market appetite for this type of lending and we are confident that off the back of this some local institutions will start to put their toe in the water as well.\"\nIn the US, online lenders CAN Capital and OnDeck have done similar securitisations, which have required an innovative capital structure to be created to deal with the high frequency of repayments.\nIt is understood that Carlyle was attracted to Prospa's proprietary credit underwriting methodology and its access to customer data across the Australian economy.\nPart of the proceeds of the raising will be deployed towards investing in the technology platform and to increase marketing to build more partnerships like the one struck recently with the nation's largest mortgage broker, AFG.\n\"It will allow us to take more capital out there to the small-business customer,\" Mr Bertoli said. On Monday, Small Business Minister Bruce Billson backed the online lending model as a way to boost capital for SMEs and drive economic growth .\nProspa's original seed and series A funder, British-based Entree Capital, also contributed towards the $60 million raising. Prospa worked with KPMG's advisory team on the deal.\nGreg Ruddock, joint chief executive of Ironbridge Capital, said the firm had \"looked at many fintech businesses but Prospa stood out from the crowd as the market leader\".\n\"We are very excited about investing in Prospa to enable them to continue their rapid expansion, as well as help the Australian small-business economy thrive.\"", "external_links": ["http://www.afr.com/business/banking-and-finance/bruce-billson-endorses-disruptive-online-sme-lenders-20150829-gjashm", "http://www.afr.com/street-talk/carlyle-ironbridge-make-60m-investment-in-online-lender-prospa-20150902-gjd59d"], "published": "2015-09-02T15:32:00.000+03:00", "crawled": "2015-09-06T00:12:43.662+03:00", "highlightTitle": ""}