{"organizations": [], "uuid": "a96db7c50e049f2b86594395abe00dd26b8d99df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.investors.com", "main_image": "http://www.investors.com/image/Biz03-GM-0930-company.jpg.cms", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://news.investors.com/092915-773228-gm-ceo-barra-drives-for-connected-car-lead.htm?ven=yahoocp&src=aurlled&ven=yahoo", "country": "GB", "title": "GM Vies For Pole Position In Race To Connected Cars - Investors.com", "performance_score": 0, "site": "investors.com", "participants_count": 1, "title_full": "GM Vies For Pole Position In Race To Connected Cars - Investors.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "a96db7c50e049f2b86594395abe00dd26b8d99df"}, "author": "yahoo", "url": "http://news.investors.com/092915-773228-gm-ceo-barra-drives-for-connected-car-lead.htm?ven=yahoocp&src=aurlled&ven=yahoo", "ord_in_thread": 0, "title": "GM Vies For Pole Position In Race To Connected Cars - Investors.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "G eneral Motors (NYSE: GM ) CEO Mary Barra says the automaker isn't going to cede the smart-car technology lead to other carmakers or technology providers such as Apple (NASDAQ: AAPL ) and Google (NASDAQ: GOOGL ).\nBarra told Reuters on Monday that her goal is to disrupt the market and \"own the customer relationship beyond the car.\"\nBarra cited as an example a Chevrolet Malibu owner who participates in a car-sharing service.\n  View Enlarged Image \nStepping into a GM Cadillac, the driver could use a smartphone app to instantly import settings that could include things such as seat and steering wheel location and environment controls.\nGM is working closely with Google and Apple on smart cars. In May, GM announced it would offer both Apple CarPlay and Google Android Auto compatibility in 14 models this year, including the 2016 Cruze compact that debuted in June.\nBarra told Reuters on Monday in an interview ahead of GM's planned global business update on Oct. 1 that \"we have the platform\" of the vehicle itself on which those connected-car apps and features will run.\nGeneral Motors says it sold more vehicles with cutting-edge 4G LTE wireless equipped cars than the rest of the industry did in the first half of the year. GM forecasts that from 2014 to 2018 it will earn $350 million before interest and taxes on connectivity-related services.\nThat's just a fraction of its $153 billion annual revenue, but Barra says the value of connectivity will grow, and GM wants to establish a leadership position.\nGM plans to unveil its Super Cruise autonomous driving feature next year, which will take advantage of the built-in, high-speed connectivity.\nSuper Cruise, which includes hands-off lane following, braking and speed control under certain driving conditions, will debut first in the Cadillac, Barra said earlier this month.\nGM shares hit an intraday high of 39 on March 23, but have drifted down since then amid three straight quarters of lower year-over-year sales. Shares are down about 26% from that point, trading below its 50-day and 200-day averages. GM closed up 2% in Tuesday midday trading in the stock market today .\nThe market for connected cars, including self-driving vehicles and cars with features that take advantage of built-in, high-speed wireless connectivity, is expected to grow at a rapid rate.\nBI Intelligence estimates that the number of cars with self-driving features will grow at a 134% compound annual rate from 2015 to 2020, when it expects 10 million fully autonomous cars will be on U.S. roads.\nGoogle has developed and is testing working prototypes of self-driving cars, and Tesla Motors (NASDAQ: TSLA ), BMW and others are developing self-driving cars too.\nApple's CarPlay platform, including Siri voice control, is synced to the iPhone and other Apple mobile devices and available on, or committed to, 39 makes, including GM, Ford, Hyundai, Jaguar, Honda, Acura and BMW.\nFord Motor (NYSE: F ), Volkswagen (OTCPK: VLKAY ) and other leading carmakers are under pressure, the report noted, to develop smart-car features.\nFollow James DeTar on Twitter @IBD_JDeTar and Facebook .", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T03:00:05.033+03:00", "highlightTitle": ""}