{"organizations": [], "uuid": "51e0f00c10d530722deabb37670d50d288fc46be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/0vx0tvU2XJAUzYxjYP_FJg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_AP_FINANCIALTIMES/906ce313561b8d2a820f6a706700858d_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/final-approval-oil-train-settlement-165017467.html", "country": "US", "title": "Final approval of oil train settlement is delayed", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Final approval of oil train settlement is delayed", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T21:00:00.000+03:00", "replies_count": 0, "uuid": "51e0f00c10d530722deabb37670d50d288fc46be"}, "author": "", "url": "https://uk.finance.yahoo.com/news/final-approval-oil-train-settlement-165017467.html", "ord_in_thread": 0, "title": "Final approval of oil train settlement is delayed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Sep 24, 2015, 20:03 BST - UK Markets closed Final approval of oil train settlement is delayed Judge delays final approval of $338 million settlement for victims of oil train derailment By David Sharp, Associated Press | Associated Press – 1 hour 3 minutes ago View Photo \nFILE - In this July 6, 2013, file photo, smoke rises from railway cars from now defunct Montreal, Maine … \nPORTLAND, Maine (AP) -- Final confirmation of a $338 million settlement for victims of an oil train derailment that claimed 47 lives in Quebec was delayed Thursday to give the lone party that opposes the plan additional time to reach an agreement on terms to join the settlement or withdraw its objection. \nCanadian Pacific will let the settlement move forward by dropping its opposition if it can come to terms with the U.S. bankruptcy trustee, officials said. \nA bankruptcy judge ordered the parties to reconvene Oct. 5, and Trustee Robert Keach said he's confident the settlement will be confirmed then. \n\"We moved farther down the road to providing some certainty for the victims. While I know that means coming back in a few weeks, I think material progress was made. There is encouragement for the victims,\" Keach told the judge after attorneys emerged from closed-door discussions to ask for more time to negotiate. \nThe settlement plan, which was worth $446 million in Canadian dollars, was negotiated with about two dozen parties with potential liability after a runaway train with 72 oil tankers derailed on July 6, 2013, in Lac Megantic, Quebec. The exploding tankers triggered raging fires that destroyed more than 40 buildings. \nCanadian Pacific, which contended it bore no responsibility for the disaster, was the sole party with potential liability to decline to contribute to the settlement, which included about $83 million (U.S.) to settle wrongful death claims. \nThe railroad contended the plan would hamper its ability to defend itself from lawsuits because the agreement provided legal immunity to settlement participants. \nKeach accused Canadian Pacific of trying to hold up payments to victims to get leverage to negotiate a better settlement deal. But Tim Thornton, attorney for Canadian Pacific, denied Thursday that the railroad was trying to delay payments. He said the railroad only wanted to be treated fairly. \nThe oil shipment from the Bakken region of North Dakota originated with Canadian Pacific, which transported the crude to Quebec before the train moved onto rail lines owned and operated by Montreal, Maine & Atlantic Railway. The Maine-based railroad filed for bankruptcy and was sold after the disaster. \nKeach contends Canadian Pacific bears some responsibility for the severity of the fire by failing to properly classify the crude oil, which was as volatile as gasoline. Others believe Canadian Pacific bear some responsibility because it contracted to get the crude to its final destination in Saint John, New Brunswick. \nWrongful death lawsuits are on hold while the settlement is sorted out. \nIn addition to the bankruptcy and lawsuits, there's also a separate criminal case pending against three workers, each charged with criminal negligence causing death.", "external_links": [], "published": "2015-09-24T21:00:00.000+03:00", "crawled": "2015-09-24T22:05:48.294+03:00", "highlightTitle": ""}