{"organizations": [], "uuid": "aea6cf91b33d15871cc6a357b653a58182b41115", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/253255-auto-state-senators-push-for-better-trade-rules", "country": "US", "title": "Auto-state senators push for better trade rules", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Auto-state senators push for better trade rules", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T21:02:00.000+03:00", "replies_count": 0, "uuid": "aea6cf91b33d15871cc6a357b653a58182b41115"}, "author": "iswanson@thehill.com (Vicki Needham)", "url": "http://thehill.com/policy/finance/253255-auto-state-senators-push-for-better-trade-rules", "ord_in_thread": 0, "title": "Auto-state senators push for better trade rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Auto-state senators push for better trade rules By Vicki Needham - 09/10/15 02:02 PM EDT \nA bipartisan trio of senators from auto-manufacturing states are calling on U.S. Trade Representative Michael Froman to open up foreign markets during global trade talks. \nSens. Sherrod Brown (D-Ohio), Rob Portman (R-Ohio) and Debbie Stabenow (D-Mich.) sent a letter on Thursday urging Froman to ensure that the Trans-Pacific Partnership (TPP), which includes several major auto producers including Canada, Japan and Mexico, phases out tariffs and removes other barriers to U.S. exports to those countries. ADVERTISEMENT “The auto industry was critical to the nation’s recovery after the Great Recession and is a linchpin in our national economy, with 1.7 million workers and more than $70 billion in annual tax revenues,” the senators wrote in their letter. \nAs negotiators move toward finishing the TPP, the senators said the deal must hold Japan to its commitment to eventually end tariffs — a process expected to take decades. They also said North American Free Trade Agreement (NAFTA) rules of origin should be a part of the new deal. \nAny final TPP agreement also must include provisions that aim to crack down on the practice of currency manipulation, a chief complaint of the auto industry, they said. \n“An agreement that does not include these provisions will give our foreign competitors an even greater unfair advantage and will undermine the future of the U.S. auto industry,” the senators wrote. \nA trade representative spokesman insisted that the deal will help the U.S. industry. \n“TPP will be a major step forward to open new markets and level the playing field for American workers and manufacturers, including in the auto industry,” said the spokesman, who described Obama as a champion of the industry. \nPrior to joining the TPP talks, Japan and the United States reached a series of agreements that included the eventual elimination of tariffs on autos. \nBrown and Stabenow wrote to Froman in December 2014 highlighting similar concerns over tariffs, country of origin labeling and currency in the TPP. \nThe senators have pushed for TPP negotiators to add currency manipulation provisions into the final deal. \nThere was some discussion during the last round of TPP talks about including a side agreement that would require finance leaders of the 12 nations in the pact to meet on currency practices. \nHuckabee says Dred Scott still ‘... The infamous decision was overturned by the 14th Amendment. DNC chair closes door on more... “We’re not changing the process. We’re having six debates,” she said. Dems filibuster Iran vote GOP says it will force more votes on Iran next week. Biden parks plane next to Trump's Vice President Biden’s plane parked next to a Trump jet upon landing in... Bond actor donates $47,000 to... However, Sanders' campaign has asked the PAC to cease and desist. House GOP to postpone vote on Iran... House Republicans will now meet at 4 p.m. to discuss strategy. Study: All-male Marine units... Ground combat units with only men were faster, more lethal and less... Trump widens lead atop GOP... Trump picked up 8 points since August, according to a new CNN/ORC... Biden opens up on loss of his son... “I’d be lying if I said that I knew I was there,” Biden said. “I’m being... Obama planning to admit 10K Syrian... Obama will drastically increase the number of Syrians allowed to resettle... McConnell: We're voting again on... McConnell set up a procedural vote on a resolution of disapproval for next... House votes to accuse Obama of... House Republicans want to see the side deals between Iran and the IAEA. Brent Budowsky: Big truths about... OPINION | Let’s look at matters from a larger perspective. Glenn Beck: 'Grow up, Donald Trump' \"I'm not dealing with a third grader anymore because the world is on fire... House GOP changes course on Iran... The House will now hold three separate votes on the nuclear agreement. GOP scores early win in ObamaCare... A federal district judge ruled that the House has standing to sue the... Conservative lawmaker insists GOP... Rep. Jim Jordan says party needs to make its case in \"a compelling,... Trump fires back at Carson: ‘Who... “He was an OK doctor,” Trump said. “He was heavy into the world of... Sanders: 'I'm stunned' by surge in... \"I thought those issues would resonate, but did I think they would... Emilio Estefan recording anti-... The song, which will be released later this month, is called “We’re All... Report: Analysts claim US military... More than 50 intelligence analysts feel their reports are being... Federal contractors tell Obama:... Federal contractors say they are being unfairly targeted with executive...", "external_links": [], "published": "2015-09-10T21:02:00.000+03:00", "crawled": "2015-09-11T09:02:14.276+03:00", "highlightTitle": ""}