{"organizations": ["MBNA"], "uuid": "d95d2c565fd8c8962fe6a13a354488c35fd2e4e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-credit-cards/?format=rss", "section_title": "Credit Card News | Reviews | Advice - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/mbna-cancelled-credit-cards-133437680.html", "country": "GB", "title": "'MBNA cancelled my credit cards'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "'MBNA cancelled my credit cards'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T16:34:00.000+03:00", "replies_count": 0, "uuid": "d95d2c565fd8c8962fe6a13a354488c35fd2e4e4"}, "author": "", "url": "https://uk.finance.yahoo.com/news/mbna-cancelled-credit-cards-133437680.html", "ord_in_thread": 0, "title": "'MBNA cancelled my credit cards'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 25, 2015, 17:38 BST - UK Markets closed 'MBNA cancelled my credit cards' By Jessica Gorst-Williams | Telegraph – 3 hours ago 0.00 0.00 \nOur consumer expert helps a reader whose error in stopping a direct debit payment affected his credit rating \nEarlier this year I went on an extended holiday to Australia. Before going I advised MBNA, which administers the Virgin Atlantic Visa credit card, of my plans. While looking through my bank statement before travelling, I noticed and cancelled a monthly debit of £10.99 which I thought was being paid directly to the merchant. Unfortunately it was paying off a very old MBNA credit card which I had forgotten I had. Clearly this was a mistake on my part. LJ, Surrey \nRather than cancelling the recurring payment directly with the provider of product insurance you no longer needed, you stopped the direct debit payments that were paying off the old credit card the premiums were being billed to. The merchant continued claiming the money and the card ran into arrears. \nWhile you were away, MBNA sent several letters to your home advising you of this. It (Other OTC: ITGL - news ) did not call you even though it had been informed where you were and had your contact details. You paid off the £84 arrears as soon as you knew about them. \nBy then MBNA had cancelled not only the card at issue but also your main credit card. The monthly balance of this card continued to be paid in full by direct debit. That card has never been in default. MBNA refused to reinstate either card. This also affected your credit rating. \n• How to exploit credit card protection \nWhen I became involved you received new cards with no explanation. However, MBNA said it would not and could not adjust the information on your credit files. I disputed this and it has now agreed to take the information off. MBNA has offered £100 for goodwill, which you don’t think is enough. \nMBNA says that, when you were abroad, it wasn’t its policy to call customers to alert them that sums were still hitting their card in this way. Over recent months it has changed its approach and now calls customers to notify them. \n• If you want to contact Jessica, click here", "external_links": [], "published": "2015-09-25T16:34:00.000+03:00", "crawled": "2015-09-25T19:38:08.703+03:00", "highlightTitle": ""}