{"organizations": [], "uuid": "7f02856fd38a40e788b16db624eb71c47dbaa6df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/m/y/c/q/image.related.articleLeadwide.620x349.gjnbvp.png/1442306280128.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/15/materials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/comment-and-analysis/pm-turnbull-needs-to-create-a-new-positive-australian-narrative-20150915-gjnbvp.html", "country": "AU", "title": "PM Turnbull needs to create a new positive Australian narrative", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "PM Turnbull needs to create a new positive Australian narrative", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "7f02856fd38a40e788b16db624eb71c47dbaa6df"}, "author": "", "url": "http://www.smh.com.au/business/comment-and-analysis/pm-turnbull-needs-to-create-a-new-positive-australian-narrative-20150915-gjnbvp.html", "ord_in_thread": 0, "title": "PM Turnbull needs to create a new positive Australian narrative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Abbott had proven incapable of providing the economic confidence that businesses needed. Photo: Alex Ellinghauasen\nOne of Prime Minister Malcolm Turnbull's most important jobs is to get business people believing in themselves and Australia's future again. He can begin the process by discarding a negative narrative that that the Liberal Party developed in Opposition and became trapped by in government.\nTony Abbott had plenty of raw material to work with in Opposition as he told told Australians again and again that the Rudd and Gillard governments were profligate and inept.\nHis arguments were underpinned by an over-egged claim that structural spending by Labor and once-off spending during the 2008-2009 global crisis had created a Budget emergency, however, and after the Coalition's election victory in September 2013 he and Treasurer Joe Hockey doubled down. They announced that the Budget Crisis was worse than they had feared, crafted a Crisis Budget, and then told a Senate that they did not control to take it or leave it.\nThe real problem, created as much by the Howard government as by Labor, was that structural spending added during the resources boom was not sustainable over the long term.\nAdvertisement Tony Abbott had often remarked in Opposition that households wouldn't tolerate Labor's balance sheet management, but it is in households where the biggest debt load in Australia resides. Australia's government debt load is still low by world standards. Longer-term budget restructuring can ensure that it stays that way, and the first Abbott-Hockey Budget actually did begin the repair work by loading in longer term measures.\nThe pyschological hit from the earlier crisis rhetoric has lingered, however. A burst of business and consumer optimism after the government's election was swamped by the first Budget and remains fragile. Business borrowing and investment is weak despite record low interest rates and willingness on the part of the banks to lend, and economic growth is sub-par.\nReserve Bank governor Glenn Stevens has been arguing for some time that a revival in business \"animal spirits\" – that is, the willingness to take on risk – is needed to get businesses investing more strongly, and it appears that Turnbull agrees.\nTony Abbott had proven incapable of providing the economic confidence that businesses needed, he said ahead of the party room vote on Monday: after being anointed, he declared that he would lead a government that discussed problems and issues, and then presented \"a path forward.\"\nThis is obviously easier said than done. Turnbull's first task as a political centrist is probably to secure the support or at least acquiescence of those in the Coalition to his right.\nHe at least brings a useful curriculum vitae to the job however, as a former lawyer (the usual path to the top in the Liberal Party) and a former investment banker.\nOpposition leader Bill Shorten's quip that \"The thing about Malcolm is it's always about Malcolm\" misses the point.\nPersonal success is obviously going to matter to the new PM. His key performance indicators will however be the ones that have been keeping the Abbott government consistently behind in the polls, and he can hit them if he builds consensus on key issues including tax and superannuation reform, infrastructure renewal and long term Budget repair by negotiating more actively and adroitly, both inside and outside parliament.\nFormer union boss Bob Hawke drew on his understanding of the conciliation and arbitration system to get things done that way in the first term of his Labor government. Three legs of Turnbull's career – the law, politics and investment banking – might enable him to do something similar – \"achieve very significant economic reforms by explaining complex issues and then making the case for them,\" as he put it on Monday night.\nInvestment bankers are prepared to go to the mat for their clients. When they do it they keep the goal – the deal – in sight, however, and they are expected to creatively search for terms that both sides of the negotiation can accept.\nAs part of that, they are expected to know when compromise is needed. A government led by Malcolm Turnbull might for example have also handed down a tough maiden Budget, but it negotiated more actively to try and get more of it up.\nMalcolm Turnbull is no angel. The circumstances of his coup make that clear. His CV and the ministerial overhaul he will preside over including the almost certain replacement of Joe Hockey give him a fighting chance of making this disappointingly inactive government more outcome-focused, however. If he can, he will move quickly, to capitalise on a lift in consumer sentiment and business confidence that should accompany his arrival at The Lodge.\n​", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-15T19:41:07.505+03:00", "highlightTitle": ""}