{"organizations": [], "uuid": "817f4d50f4f3d2c4c11ec77618d200c83662861a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.equipmentfa.com", "main_image": "", "site_section": "http://www.equipmentfa.com/rss/feeds/latestnews.xml", "section_title": "Equipment Finance Advisor", "url": "http://www.equipmentfa.com/news/4675/beacon-funding-launches-new-responsive-website", "country": "US", "title": "Beacon Funding Launches New Responsive Website", "performance_score": 0, "site": "equipmentfa.com", "participants_count": 0, "title_full": "Beacon Funding Launches New Responsive Website", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T13:53:00.000+03:00", "replies_count": 0, "uuid": "817f4d50f4f3d2c4c11ec77618d200c83662861a"}, "author": "", "url": "http://www.equipmentfa.com/news/4675/beacon-funding-launches-new-responsive-website", "ord_in_thread": 0, "title": "Beacon Funding Launches New Responsive Website", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Beacon Funding Launches New Responsive Website September 10, 2015, 06:53 AM Related: Beacon Funding \nBeacon Funding announced the launch of their brand new, fully responsive website, BeaconFunding.com. With an intuitive user interface and features designed to give visitors instant access to a plethora of equipment financing information, this world-class website expands the reach of Beacon Funding's industry leading financing tools and programs to any device from anywhere. \"Applying for equipment financing has never been easier,\" said Toby McDonough, Vice President, Sales & Marketing. \"We've worked hard to streamline users' access not only to our equipment financing programs, but also to the many services Beacon Funding offers so users can get the information they need to make informed equipment financing decisions.\" The new \"2-minute equipment financing application\" at BeaconFunding.com has been optimized to only ask the questions necessary to get clients approved quickly and securely. The application, just like the website, is responsively designed to enable users to apply from desktop computers, tablets, and cell phones. The design concept is a direct result of Beacon Funding's continuing, mobile-first technology approach. In addition, BeaconFunding.com's new online calculator empowers users to instantly know as-low-as monthly payments, calculate break-even estimates, and discover tax-savings projections. Users can also explore the different types of equipment financing plans offered by Beacon, learn about what it takes to qualify for equipment financing, and watch or read hundreds of testimonials from the thousands of satisfied and successful Beacon Funding clients. White papers are also available for download on a variety of equipment and financing topics. \"Our new website is a one-stop shop for anyone with equipment financing needs or questions,\" explained Steve Harnden, Marketing Director. \"From the experienced borrower to someone who's never financed anything before, we are determined to make the BeaconFunding.com experience as enjoyable and informative as it is fruitful.\" Built with state of the art content management infrastructure by Beacon Funding's internal development and design teams, the new Beacon Funding website is primed to grow with the company it represents. It is now available online at www.BeaconFunding.com. Today's Other News", "external_links": [], "published": "2015-09-10T13:53:00.000+03:00", "crawled": "2015-09-11T06:25:08.671+03:00", "highlightTitle": ""}