{"organizations": [], "uuid": "2c49605849f17dc8d301d794efc97f09400cb221", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://g.foolcdn.com/editorial/images/178876/debt-to-capital.png", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13aci6dpr/*http://www.fool.com/investing/general/2015/09/11/5-key-metrics-you-can-calculate-from-a-balance-she.aspx?source=eogyholnk0000001", "country": "GB", "title": "5 Key Metrics You Can Calculate From a Balance Sheet and Income Statement", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "5 Key Metrics You Can Calculate From a Balance Sheet and Income Statement", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T17:20:00.000+03:00", "replies_count": 0, "uuid": "2c49605849f17dc8d301d794efc97f09400cb221"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13aci6dpr/*http://www.fool.com/investing/general/2015/09/11/5-key-metrics-you-can-calculate-from-a-balance-she.aspx?source=eogyholnk0000001", "ord_in_thread": 0, "title": "5 Key Metrics You Can Calculate From a Balance Sheet and Income Statement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matthew Frankel"], "text": "Fool Podcasts 5 Key Metrics You Can Calculate From a Balance Sheet and Income Statement There are many pieces of information you can use to evaluate a stock, and here are five you can easily calculate on your own. Matthew Frankel ( TMFMathGuy ) Sep 11, 2015 at 10:20AM \nThere are many different metrics you can use to evaluate a stock as a potential investment, and you can calculate some of the most important ones using the information found on a company's balance sheet and income statement. Here are five of the most important ones to know, as well as how to use each one. To illustrate each one, we'll use as an example information from the 2015 year-end financial statements of one of my favorite stocks in the market right now, Wal-Mart ( NYSE:WMT ) . (Note: Wal-Mart's 2015 fiscal year ended on Jan. 31) \n1. Return on equity (ROE) : Calculated by dividing the income available to common shareholders by common equity. Return on equity shows us how much profit is generated from the money a company's shareholders invest and can be useful for comparing the profitability of companies in the same industry. \nIn Wal-Mart's case, the company's financial statements show income of $16.08 billion for 2015 and common shareholders' equity of $81.4 billion, making its return on equity 19.8%. The industry's average ROE is 17.6%, so it's fair to say that Wal-Mart generates profits more efficiently than its peers. \n2. Gross profit margin/operating margin : These two profitability metrics show how efficiently a company generates its profits and along with ROE can provide a good picture of how well managed and profitable a company is. The two metrics are calculated like this: \nGross margins show the profits a company makes from its products before factoring in any costs not directly related to production and indicated how much money a company has available for activities such as research and development, marketing, and investing back into the business. Operating margin can show how well a company controls its costs. Using our Wal-Mart example, we can calculate a 24.8% gross margin and a 5.4% operating margin, both of which are better than the industry averages of 22.2% and 4.9%, respectively. \n3. Price-to-earnings (P/E) : This is probably the most oft-quoted valuation metric in investing, and for good reason. The P/E is a relative valuation metric, meaning it's useful for comparing a company's valuation relative to its peers as well as to its own history, since it's based on the current stock price. Keeping with our Wal-Mart example, the company currently has a P/E (based on TTM earnings) of 13.4. In January of this year, the ratio was 17.5. In other words, this lets us see how much cheaper Wal-Mart is now than it was just a few months ago thanks to the market correction and the company's disappointing earnings report this past quarter. \n4. Debt-to-capital : A higher debt-to-capital ratio could signal that the company has overextended itself. If earnings drop, a company that's too debt-reliant is more likely to default. This is generally less of an issue for large, stable companies. Wal-Mart, for example, has a debt-to-capital ratio of 38.1%. Generally, I look for ratios under 40%, but different investors have different thresholds. The takeaway is that lower is usually better, but some debt can be a smart way to maximize profitability. \n5. Interest coverage : Another debt metric, interest coverage tells us how much \"breathing room\" a company has when it comes to repaying its debt. For example, if a certain company earns $5 million per year and the interest payments on its debt are $1 million, it has interest coverage of 5-to-1. \nWal-Mart has interest coverage of just over 11-to-1 as of its end-of-year financial statements. In other words, Wal-Mart's operating income could fall by almost 91% and the company could still make the payments on its debt. That kind of a collapse is unlikely to happen, but it shows how recession-resistant the company is. \nOther things to consider While these are important metrics to consider when evaluating a stock, this is by no means an exhaustive list. For example, a stock's dividend history, recent growth trends, and payout ratio should also be considered -- just to name a few things. For more information on Wal-Mart as a long-term investment -- both pros and cons -- check out these great Fool articles here and here . \nThe point is that there's a lot that goes into a thorough evaluation of a stock, and the more you understand, the better equipped you'll be to make wise decisions with your own portfolio. \nHow one Seattle couple secured a $60K Social Security bonus -- and you can too A Seattle couple recently discovered some little-known Social Security secrets that can boost many retirees' income by as much as $60,000. They were shocked by how easy it was to actually take advantage of these loopholes. And although it may seem too good to be true, it's 100% real. In fact, one MarketWatch reporter argues that if more Americans used them, the government would have to shell out an extra $10 billion... every year! So once you learn how to take advantage of these loopholes, you could retire confidently with the peace of mind we're all after, even if you're woefully unprepared. Simply click here to receive your free copy of our new report that details how you can take advantage of these strategies. \nMatthew Frankel has no position in any stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. Try any of our Foolish newsletter services free for 30 days . We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . Compare Brokers Matthew Frankel Fool Contributor Matt brought his love of teaching and investing to the Fool in order to help people invest better, after several years as a math teacher. Matt specializes in writing about the best opportunities in bank stocks, real estate, and personal finance, but loves any investment at the right price. Follow me on Twitter to keep up with all of the best financial coverage! Follow @TMFMathGuy Article Info Sep 11, 2015 at 10:20AM Investment Planning", "external_links": [], "published": "2015-09-11T17:20:00.000+03:00", "crawled": "2015-09-12T08:30:54.625+03:00", "highlightTitle": ""}