{"organizations": [], "uuid": "4c487c5d0a275c62471a8e1766dc105b03f1aaad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/w/o/h/c/image.related.afrArticleLead.620x365.gjy7wi.png/1443605789372.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/retail/david-joness-chief-executive-iain-nairn-resigns-20150930-gjy7wi", "country": "AU", "title": "David Jones's chief executive Iain Nairn resigns", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "David Jones's chief executive Iain Nairn resigns | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T15:31:00.000+03:00", "replies_count": 0, "uuid": "4c487c5d0a275c62471a8e1766dc105b03f1aaad"}, "author": "Matthew Drummond", "url": "http://www.afr.com/business/retail/david-joness-chief-executive-iain-nairn-resigns-20150930-gjy7wi", "ord_in_thread": 0, "title": "David Jones's chief executive Iain Nairn resigns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Outgoing David Jones CEO Iain Nairn (left) and Woolworths CEO Ian Moir. Louise Kennerley Share on twitter by Matthew Drummond John Dixon, an executive from UK retailer Marks & Spencer, will become the new chief executive of David Jones after Iain Nairn abruptly resigned citing personal reasons.\nA dramatic two days at the iconic retailer began on Tuesday morning when Ian Moir, the head of South Africa's Woolworths Holdings which bought David Jones last year, flew in to Sydney to meet Mr Nairn.\nOn Wednesday morning Mr Nairn told key reports he was unwell and that he would not be in for the rest of this week. Following inquiries from The Australian Financial Review a spokesman for the company confirmed Mr Nairn's sudden departure and senior staff were called to a hastily called briefing on the seventh floor of the company's Sydney headquarters on Wednesday afternoon.\nA spokeswoman for Woolworths flatly rejected rumours that Mr Nairn's departure followed an investigation into his expense accounts. She said Mr Nairn had agreed to stay at the business for three months to ensure a smooth transition to the new CEO. Senior executives at DJs were paid their bonuses on Tuesday.\nOutgoing David Jones CEO Iain Nairn (left) and Woolworths CEO Ian Moir. Louise Kennerley \"There was a Woolworths audit covering everyone's expenses who reports to Ian Moir as Woolworths group CEO. That audit was broad-based and it was not specific to any one executive,\" she said. Mr Nairn received the full bonus that he was entitled to, she said.\n'I'd rather not talk about this' Contacted on Wednesday afternoon, Mr Nairn declined to comment. \"I'd rather not talk about this,\" he said. News of both Mr Nairn's resignation and Mr Dixon's appointment was first revealed on afr.com.\nMr Nairn, 53, spent just under two years as chief of Country Road, majority owned by Woolworths Holdings, and took the helm of DJs in August 2014 after Woolworths outlaid $2.1 billion for the department store chain. In a statement Mr Moir thanked Mr Nairn for his \"significant contribution\" to the business.\n Mr Nairn's brief stint as the head of David Jones follows a period of extraordinary sales and profit growth at the department store.\nSales rose 6.4 per cent to $1.89 billion in the year ended June – the strongest rate of growth for David Jones in eight years.\nThe second half of financial 2015 saw sales soar by an extraordinary 10.7 per cent. Earnings rose for the first time in four years – up 29 per cent to $161 million.\n'You can't dispute the numbers' \"You can't dispute the numbers,\" Mr Nairn said earlier this year of the impressive sales and profit figures.\nHowever analysts have raised doubts about the strength of David Jones profit given $65 million of provisions for markdowns on prices were booked to the Woolworths parent's accounts as acquisition costs rather than David Jones's own accounts. David's Jones's profit margin was 5.8 per cent under the old management and soared to 7.6 per cent under Mr Nairn's management.\nCiti analyst Craig Woolford estimates that if the write downs had have been booked to David Jones' accounts the profit margin would have been just 4.2 per cent.\nThe announcement that Mr Dixon would replace Mr Nairn as DJs chief suggests his pending resignation for personal reasons had been known about for some time.\nMr Dixon has been on the board of Marks & Spencer since 2009 as director of foods and led the turnaround of the £5 billion food business before his appointment as director of general merchandise clothing and home.\n\"John's appointment reflects our long term strategy to take the David Jones business to the next level,\" said Mr Moir in his statement.\nReplacement ready to go \"John is a world class retailer who brings with him a powerful combination of international food and fashion expertise. We have known John for many years through our close relationship with M&S and know him to be an inspiring and resilient leader,\" said Mr Moir.\nIn an interview in August last year Mr Moir gave Mr Nairn his full backing and dismissed the suggestion that, given he had never run a department store, he lacked experience.\n\"It's the same challenge I faced when I went to Woolworths – I'd never run a department store either. But if you understand retail and you understand brands, there is no reason you can't be successful regardless of the format,\" Mr Moir told The Australian Financial Review in August .\n\"We wouldn't have put him into the position if we thought there was any risk involved.\"", "external_links": ["https://twitter.com/http://twitter.com/mattdrummondAFR"], "published": "2015-09-30T15:31:00.000+03:00", "crawled": "2015-09-30T12:48:50.308+03:00", "highlightTitle": ""}