{"organizations": [], "uuid": "76876e314b6b7870e9257f562a87a43b91d39002", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-reuters/?format=rss", "section_title": "Finance News | Reuters - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/qualcomm-president-says-splitting-company-224023822.html", "country": "GB", "title": "Qualcomm president says splitting company may not create value", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Qualcomm president says splitting company may not create value", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T01:40:00.000+03:00", "replies_count": 0, "uuid": "76876e314b6b7870e9257f562a87a43b91d39002"}, "author": "", "url": "https://uk.finance.yahoo.com/news/qualcomm-president-says-splitting-company-224023822.html", "ord_in_thread": 0, "title": "Qualcomm president says splitting company may not create value", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 4, 2015, 00:09 BST - UK Markets open in 7 hrs 51 mins Qualcomm president says splitting company may not create value Reuters – 29 minutes ago -0.31 \nBy Liana B. Baker \nNEW YORK (Reuters) - Qualcomm Inc's (QCOM.O) President Derek Aberle, under pressure from activist hedge fund Jana Partners to improve the licensing and chip design firm's stock performance, on Thursday sounded a cautionary note about a potential breakup of the company. \nStressing that the board and management do not expect to complete a review of a possible split until the end of the year, Aberle told Reuters that Qualcomm agrees with Jana that its stock is undervalued. Shares have fallen 25 percent over the past 12 months, whereas the S&P 500 is down 2.25 percent. \nAberle said that investors calling for a split are taking a \"sum of the parts\" analysis and believe that Qualcomm's two divisions - its highly profitable licensing arm and its chips unit - would be valued more highly as independent companies. \n\"You have to step back and say why is that and would a separation actually solve whatever the underlying issues are that are creating the current valuation?,\" he said. \"You have to be careful that it's not too simplistic an analysis.\" \nThe company's current structure, Aberle said, also allows Qualcomm to leverage relationships with Chinese customers, since the chipmaker is well-positioned to help them expand to other countries. \nAt the same time, Aberle acknowledged that having both a chips and licensing division has at times created conflicts with customers, \"but we manage it pretty well.\" \nDEALING WITH JANA \nJana in April unleashed a public campaign to reform Qualcomm, calling its chip business \"essentially worthless\" at current valuations and pressing the company to spin it off or pursue strategic mergers or acquisitions. \nAberle said that when Qualcomm was approached by Jana, the hedge fund which owned $2 billion in stock did not pressure it to pursue a breakup but rather wanted them to review a split as one option to unlock value. \nIt is also working on adding a third independent board member, whom Aberle declined to name. Qualcomm has already added two new board members in cooperation with Jana. \n\"A lot of the things (Jana) put on the table were very consistent with things we’d already been talking to our shareholders about and already been planning for a long time,\" Aberle said. \nQualcomm said in July it would reduce costs by about $1.4 billion, cut about 4,500 full-time staff, or 15 percent of its workforce, and boost capital returns to shareholders. \n(Reporting by Liana B. Baker in New York; Editing by Eric Effron and Andrew Hay)", "external_links": [], "published": "2015-09-04T01:40:00.000+03:00", "crawled": "2015-09-04T02:11:37.471+03:00", "highlightTitle": ""}