{"organizations": [], "uuid": "0e0702a9fa46da4b98edc0a6bc4b2bb4b4bade1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509280870.html", "country": "US", "title": "Ethiopia: Joint Efforts in Fighting Collusive Practices in Construction Industry", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Ethiopia: Joint Efforts in Fighting Collusive Practices in Construction Industry", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T12:24:00.000+03:00", "replies_count": 0, "uuid": "0e0702a9fa46da4b98edc0a6bc4b2bb4b4bade1c"}, "author": "", "url": "http://allafrica.com/stories/201509280870.html", "ord_in_thread": 0, "title": "Ethiopia: Joint Efforts in Fighting Collusive Practices in Construction Industry", "locations": ["Ethiopia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alazar Shiferaw"], "text": "By Alazar Shiferaw \nThis is the high time to bring the stakeholders of the construction industry under the same roof \nRecently, the 12th International Ethio- Con Construction Exhibition aimed at bringing together business societies of different countries for exchanging views on how to share technology, experiences among the business community at Addis Ababa Exhibition Center. \nOpening the 12th International Ethio-Con Exhibition, Urban Development, Housing Construction State Minister Engineer Haile-Meskel Tefera said that some 120 local and 60 foreign companies drawn from 17 countries were exhibiting their products and services at the Exhibition Center for five days. The construction sector has shown a rapid development. Local contractors have reached over three thousand in 2006 E.C., he added. \nHaile-Meskel further said that Construction Contractors Association of Ethiopia, apart from all rounded government's support, it has highly engaged in sector members capacity building activities by organizing such annual exhibition. \nThe association has done commendable achievements by promoting the country's current construction industry development stages. Besides, the annual Ethio- Con exhibition has a paramount importance in promoting and creating actors market linkages locally and internationally. \nHaile-Meskel further said that during second Growth and Transformation Period (GTP II) the government will be highly engaged in challenging construction sector obstacles faced and to ensure the registered achievements sustainability in the sector. \nHaile Meskel urged that actors in the sector to discharge their responsibilities and contribute their share for the nation's sustainable construction industry development. \nThe construction contractors association of Ethiopia has to discharge its responsibility by nurturing an efficient construction contracting market fueled and governed by professional ethics and focused on sustainable national construction development, the state minister said. \nFollowing the international exhibition a panel discussion was organized with theme \" Construction Path to Better future,\" by Fana Broad Casting Corporate jointly Construction Contractors Association of Ethiopia held at Addis Ababa Exhibition Center. Haile Meskel said that collusive practice is unethical practice which is manifested during some bid activities in the construction sector. \nHe further said that collusive practice hinders the normal competitive market prices and slims the competitive atmosphere. \" We can say that collusive is manifested by some unethical consultative organizations, contractors , purchasers and contractors. Apart from creating market price disorders, it will aggravate bad governance in the sector. We have to fight together it in cooperation with all stakeholders,\" he added. \nConstruction Contractors Association of Ethiopia Board Chairperson Engineer Abera Bekele on his part said, \" Our annual construction industry exhibition has completed all the due preparation and ready to well come you. We are on the the 12th episode with motto 'Path to better future'.\" \nHe further said, \"This is the high time to bring the stakeholders of the construction industry under the same roof.The participants are manufactures of construction materials, contractors, consultants architects, engineers, real state among others. Hopefully we all benefit from this exhibition and develop sustainable market chain with all your current and potential customers .\" \n\"Our 12th Ethio- Con exhibition takes places at the verge of commencement of the 2nd five years Growth and Transformation Plan that Ethiopia has devised to eradicate poverty and advance the nation to middle income country by 20 25.\" \nConstruction Contractors Association of Ethiopia Board Chairperson Eng.Abera Bekele said the panel discussion is aimed at consulting on the country's construction industry development and its challenges with stakeholders. Carrying out continuous platform discussions will enable the sector to run duties smoothly. Presently, The construction industry has created job opportunities for millions, he said. \n\"We have to discharge our responsibility to reduce foreign contractor companies' influence step by step,\" he said. \nEthiopian Construction Project Management Institute Director General Dr. Yosef Biru in his presentation entitled \"Public procurement,\" said that major objective of public-procurement is to maximize the value of public money. Dr. Yosef added that economy, efficiency, fairness and transparency are the basic principles of public procurement. \nFana Broadcasting Corporate Marketing Directorate Director Ashenafi Jimma said the construction industry is the main input for the development of the country. Its share in the country's overall economic development has grown from time to time. The industry is among one of government's priority given sectors. \nAccording to some sources, the construction industry in Ethiopia is a sector that opens the door for the growth of many additional industries. Building works require high input. For instance, they require different metal products, clay works, and cement and cement products, etc. As such, the growth of these industries will surely follow the growth of the construction industry. Similarly, when the construction and renovation of housing increase, the demand for household furniture increased; thereby, indirectly, opening the door for the growth of the furniture industry. All in all, the construction industry is a sector that can entertain big micro companies, that is widely labor based. All these being taken into consideration, the industry policy of the Federal Democratic Republic of Ethiopia has sought to pay special attention to the construction industry of the country. Ethiopia \nThis week, Fana Corporate signed an agreement with office of National Council for the Coordination of Public … see more » Copyright © 2015 The Ethiopian Herald. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-28T12:24:00.000+03:00", "crawled": "2015-09-28T13:06:25.217+03:00", "highlightTitle": ""}