{"organizations": [], "uuid": "d2747d06799dbb81c5ebb2bdd4981e6e88edc73a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/082ff782-48e2-417f-b978-36f02184bbc7.img", "site_section": "http://www.ft.com/rss/world/mideast/finance", "section_title": "Middle East & North Africa Finance News - FT.com", "url": "http://www.ft.com/cms/s/0/4e63263e-56cf-11e5-97e9-7f0bf5e7177b.html?ftcamp=published_links%2Frss%2Fworld_mideast_finance%2Ffeed%2F%2Fproduct", "country": "US", "title": "Abu Dhabi hunts $1.4bn Malaysia payment", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Abu Dhabi hunts $1.4bn Malaysia payment", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T22:11:00.000+03:00", "replies_count": 0, "uuid": "d2747d06799dbb81c5ebb2bdd4981e6e88edc73a"}, "author": "", "url": "http://www.ft.com/cms/s/0/4e63263e-56cf-11e5-97e9-7f0bf5e7177b.html?ftcamp=published_links%2Frss%2Fworld_mideast_finance%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Abu Dhabi hunts $1.4bn Malaysia payment", "locations": ["Malaysia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Abu Dhabi", "Simeon Kerr", "Michael Peel"], "text": "Abu Dhabi hunts for $1.4bn payment in Malaysia scandal fallout Michael Peel and Simeon Kerr ©AFP \nA corruption scandal that is engulfing Malaysia’s government and prime minister has pulled in a high-profile Abu Dhabi investment fund over more than a billion dollars that appears to have vanished. \nThe Gulf emirate’s International Petroleum Investment Company (Ipic) is trying to get to the bottom of an apparent $1.4bn mismatch in its dealings with 1Malaysia Development Berhad. More Contenders line up to succeed Aquino \nIpic is seeking clarification about the fate of the money, which 1MDB said it paid out but was never recorded as received in Ipic’s own financial statements, people familiar with the matter say. \nIpic’s probe is part of a wider Abu Dhabi audit of the institution’s long entanglement with 1MDB, which has come under growing scrutiny since corruption allegations engulfed both the Malaysian fund and Najib Razak , the country’s embattled prime minister. \nTwo of the main Ipic officials responsible for the Malaysian relationship have left their posts without explanation — the second of them just last month. There is no evidence the $1.4bn is suspected as having been taken by either man or any Malaysia party. Both Mr Najib and 1MDB have denied any wrongdoing. \nThe focus on the Ipic-1MDB links comes amid separate investigations in Malaysia into mysterious payments totalling more than $675m made in March 2013 to a bank account in Mr Najib’s name. Malaysia’s anti-corruption commission said last month that the funds came from a Middle Eastern donor, which it did not name. Mr Najib has said the payments were not linked to 1MDB and were not for his personal gain. \nThe 1MDB affair has rocked the once-predictable politics of southeast Asia’s third-largest economy, intensifying efforts by Mr Najib’s opponents to force him to step down over his stewardship of the fund, whose advisory board he chairs. ©AFP Najib Razak: says payments to bank account not linked to 1MDB and not for his personal gain \nThe business of 1MDB has been built in good part on close relations with institutions in fellow Muslim-majority countries, notably Saudi Arabia and the United Arab Emirates. Ipic is Abu Dhabi’s second largest wealth fund and is chaired by Sheikh Mansour bin Zayed Al Nahyan, the Manchester City owner and the brother of Sheikh Khalifa bin Zayed Al Nahyan, the Abu Dhabi ruler and United Arab Emirates president. \nThe alleged $1.4bn Malaysia payment being examined as part of Ipic’s audit is linked to a pair of 2012 bond issues totalling $3.5bn by 1MDB, which now has debts of more than $11bn. \nIn exchange for Ipic guaranteeing the issue, 1MDB said it paid a deposit of almost 4.4bn ringgit (about $1.44bn in late 2012) as collateral, according to notes to the Malaysian fund’s accounts for the year to March 2013. A record of the money appears again in last year’s accounts, with the amount adjusted to almost 4.6bn ringgit, apparently to reflect the weakening of the ringgit against the dollar. \nBut there does not appear to be an obvious corresponding entry in Ipic’s published accounts for either year. \nThe $70bn Ipic sovereign fund is confident in its own financial statements, which form part of its regulatory disclosure requirements to the London Stock Exchange, said people aware of the matter. 1MDB said it stood by its audited accounts. \n1MDB said it had kept proper records of the transaction and could not speak on behalf of Ipic or “comment on the accounting arrangements of third parties”. \nThe Malaysia fund said its auditor, Deloitte, had made “specific and detailed inquiries” about the $1.4bn payment before signing off the relevant financial statements. It said Deloitte had “strongly defended its methodology and audit process” at a private meeting of the Malaysian parliament’s public accounts committee, which is investigating 1MDB. \nBoth Deloitte and Ipic declined to comment. \nIn June, Ipic announced a $1bn bailout of 1MDB, in which the Abu Dhabi fund pledged to settle the fund’s debts and assume responsibility on an interim basis for the interest on a further $3.5bn of loans. 1MDB committed to repay by transferring assets back to Ipic by next June. ©Bloomberg Khadem al-Qubaisi: stepped down as Ipic chief in April \nThe bailout deal with scandal-plagued 1MDB raised eyebrows in the Gulf. Some observers feared the Abu Dhabi government might struggle to secure 1MDB assets to cover its investment. But the restructuring agreement is now the focus of Ipic’s relationship with 1MDB, said people aware of the matter. \nOfficials say the institution has now launched a review that is steadily “getting to the bottom” of its 1MDB dealings, which were done mainly through its Aabar subsidiary. Financiers who do business with Ipic say they have been told deals are on hold until the results of various investigations and reports are finalised. \nIpic announced in April that Khadem al-Qubaisi, its chief executive, had left office. No explanation was given. Mr Qubaisi could not be reached for comment. ©AFP Mohamed al-Husseiny left Aabar last month \nMr Qubaisi is a longstanding business lieutenant of Sheikh Mansour. It appears that Abu Dhabi officials are now trying to distance Mr Qubaisi from Sheikh Mansour. \nMohamed al-Husseiny, Aabar’s chief executive, stepped down last month. Again, Ipic gave no reasons, other than to say he was “moving on to pursue new opportunities in the UAE financial services sector”. Mr Husseiny declined to comment. Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-09-09T22:11:00.000+03:00", "crawled": "2015-09-10T07:02:20.805+03:00", "highlightTitle": ""}