{"organizations": [], "uuid": "a2b6479eacac31ff4fdaac9b3257b6ef60e0bc48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/c1cfbe14-2acb-4347-a038-0a2d527fdc32.img", "site_section": "http://www.ft.com/rss/personal-finance", "section_title": "Personal Finance", "url": "http://www.ft.com/cms/s/0/440a7c7e-50ac-11e5-8642-453585f2cfcd.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "country": "US", "title": "Playing dice with your money", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Playing dice with your money", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T20:07:00.000+03:00", "replies_count": 0, "uuid": "a2b6479eacac31ff4fdaac9b3257b6ef60e0bc48"}, "author": "", "url": "http://www.ft.com/cms/s/0/440a7c7e-50ac-11e5-8642-453585f2cfcd.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Playing dice with your money", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Playing dice with your money By John Kay How the overcomplexity of modern finance led to the system’s collapse ©Daniel Haskett \nThe year is 1995, and I am sitting at a massive octagonal table on the top floor of the large modern building that dominates the town of Halifax, West Yorkshire. \nThe location is the boardroom of the Halifax building society. The Halifax had travelled far in size, though not in distance. The world’s largest mortgage lender traced its origins to a self-help group which first met 150 years earlier in a much smaller room above a pub just opposite. More Miracles of productivity \nThe proposal before the board was that group treasury, which managed the cash held by the society from day to day, should no longer simply serve the needs of the business — taking deposits from savers and making loans to homebuyers. Treasury should take active positions in money markets, and become another profit centre. Abbey — the Halifax’s principal UK competitor — had ceased to be a mutual some years earlier and was reporting large profits from its treasury activities. \nWhy shouldn’t Halifax do the same? The plan was to trade debt instruments: usually either government stock or the liabilities of other financial institutions. Nick Carraway, the colourless bond trader and narrator of The Great Gatsby , had given way to Sherman McCoy, anti-hero of The Bonfire of the Vanities , baying for money on the bond market and the Halifax was lusting after its share of the action. \nIn the years that followed, many financial institutions continued (and still continue) to report profits from their trading activities. The mainspring of investment banking profits in recent years has been trading in fixed income, currency and commodities (FICC). But the aggregate value of debt securities and currencies is fixed, and although commodity prices fluctuate, the long-run trend has been downward. Individual businesses and traders can make profits at the expense of each other, but this cannot be true for the activity taken as a whole. \nThat raised a question in my mind. Where would treasury profits come from? Who would lose the money we expected to make? The reaction to my question was not polite. I was sent for re-education so that the traders could resolve my confusion. I did not find this experience enlightening. We would make money, I was told, because our traders were smarter. But the people I met did not seem particularly smart. And not everyone could be smarter than everyone else. Audio John Kay on why it could take another crisis to reform the finance sector Leading economist and finance industry insider John Kay talks exclusively to the FT about his new book 'Other People's Money' on why today's banks need to be boring, and why the brightest graduates should not apply for a job at Goldman Sachs. \nDownload \nThe events that followed provide a clue to the answer. Soon after that debate, the board took what was seen (perhaps wrongly) as an even more momentous decision. The society would end 150 years of mutuality and become a public company. Four years later (and, for the record, after I had left the board), Halifax plc took over the Bank of Scotland. In 2008 HBOS, as the new organisation was called, failed and was rescued by the UK government. I’ll be gone, you’ll be gone \nPart of the explanation of the profitability of FICC is that the activity is not as profitable as it seems. In the first decade of the 21st century, banks announced that they had made large profits and paid a substantial fraction of those large profits to their senior employees. But the profits had been imaginary. Their shareholders were more or less wiped out, and the banks looked to governments to support their creditors and restore their capital. \nIn the words of Nassim Taleb, the author and risk analyst, “their profits were simply cash borrowed from destiny with some random payback time”. But by the time payback time arrived, many of the principals had departed. “I’ll be gone, you’ll be gone”, as they say in the trading room. \nThis disjunction of timeframe is challenging for accountants. Once upon a time, values were based on cost, unless assets were no longer worth their cost, in which case they had to be written down. Banks were encouraged to understate their profits and create hidden reserves. A bird in the hand was worth more than any number in the bush: only when the bird emerged from the bush were you permitted to count it at all. \nLike finance, however, accounting became cleverer, and worse. By the 1980s accounting had become the principal means by which UK graduates prepared for business. Many of these trainees found jobs in the finance sector; others took jobs in non-financial business — and, since they were smart, many rose to senior positions. Young accountants were smarter, greedier, less schooled in prudence and better schooled in economics. “Fair value” increasingly replaced conservatism as a guiding principle. But this route to the “true and fair view” — the traditional holy grail of the accountant — often led to an outcome that was just the opposite of fair. \nMore than half a century ago, J.K. Galbraith presented a definitive depiction of the Wall Street Crash of 1929 in a slim, elegantly written volume. Embezzlement, Galbraith observed, has the property that “weeks, months, or years elapse between the commission of the crime and its discovery. This is the period, incidentally, when the embezzler has his gain and the man who has been embezzled feels no loss. There is a net increase in psychic wealth.” Galbraith described that increase in wealth as “the bezzle”. \nYour questions for John Kay — online or in person \nDo you think the world of high finance has become disconnected from the real economy? \nJohn Kay will take questions on this and other themes in his new book in a live FT Facebook chat at 4pm BST on Tuesday September 15. To ask him a question, email money@ft.com or follow us at facebook.com/financialtimes for more details. \nFT Money will also host anevening with John Kay at the FT’s London office at 6pm on Tuesday November 3, where he will speak and take questions about Other People’s Money . Tickets cost £25, including a signed copy of his book. To register your interest, email money@ft.com . \nIn a delightful essay, Warren Buffett’s business partner Charlie Munger pointed out that the concept can be extended much more widely. No illegality need be involved to create this psychic wealth: mistake or self-delusion is enough. Munger coined the term “febezzle”, or “functionally equivalent bezzle”, to describe the wealth that exists in the interval between creation and destruction of the illusion. \nThe joy of the bezzle is that two people each ignorant of the existence and role of the other can enjoy the same wealth. Households in US cities received money in 2006 that they could never hope to repay, while taxpayers had never dreamt that they would be called on to foot the bill. Shareholders in banks — including the hapless recipients of the ultimately worthless windfall shares from the Halifax, and the Bank of Scotland shareholders who exchanged their holdings for Halifax paper — could not have understood that the dividends they received were money they had borrowed from themselves. The impact of marking to market \nA long-term contract should yield a steady stream of profits over the life of the contract. Just as a sound loan from a bank will yield a steady stream of profits over the life of the loan. Traditional accounting procedures would report these profits year by year. But if the contract or loan is tradable, the transaction might be treated differently. If you were to sell the contract, the price the buyer would pay would reflect all the profits that might be expected to accrue in future. Marking to market enables you to credit the entire value of these profits immediately to your profit-and-loss account. \nEstimates of future gains are registered as current trading gains. But what if there is no market? You might estimate what the price would have been if there had been a market — “mark to model”. Suppose there is a 1 per cent probability that a loan of £100 will not be repaid. A ”mark-to-market” or ”mark-to-model” approach might value the loan at £99. But the loan is not worth £99. Like Schrödinger’s cat, which is either dead or alive, the loan is either good or bad; it is either worth £100 or nothing. “God does not play dice with the universe,” Einstein said of problems like Schrödinger’s, but bankers do play dice with the financial universe. \nThe shift from a conservative regime to its opposite created a transitional era in which reported earnings were higher than they had been in the past, or were likely to be in future: a transition much to the benefit of those who happened to be around at the time. If you measure profit by marking to market, then profit is what the market thinks it will be. The information contained in the accounts of the business — the information that should illuminate the views of the market — is derived from the market itself. And the market is prone to temporary fits of shared enthusiasm — for emerging market debt, for internet stocks, for residential mortgage-backed securities, for Greek government debt. Traders need not wait to see when or whether the profits materialise. I’ll be gone, you’ll be gone. \nThe persistence of bezzle and febezzle is the product of a casual lack of concern for truth. When I naively asked the Halifax question, ‘Where do the profits come from?’ a striking feature of the response was that most people within the finance sector did not think the question either interesting or important. Their attitude was not the comprehensive immorality of the overt fraudster but the wilful blindness of those who do not ask questions when it would be embarrassing, or at least inconvenient, to know the answer. Upton Sinclair’s remark is relevant. “It is difficult to get a man to understand something, when his salary depends on his not understanding it.” Robust systems and complex structures \nThe complexity of modern finance has been designed, and has operated, principally to benefit financial intermediaries rather than the users of financial services. The claims of Alan Greenspan, Tim Geithner and others, that the innovative use of new instruments made the financial system more robust, were false. Interdependencies between financial institutions have increased to a point at which the system as a whole displays fragility born of complexity. \nThe phrase “too big to fail” came into wide use in the global financial crisis to describe the dilemma that policymakers faced in resolving the affairs of systemically important financial institutions. The phrase provoked the justified rejoinder that “too big to fail is too big”. But “too big to fail” misses the key point. Britain avoided significant bank failures in the 20th century precisely because its banks were big, in contrast to the collapse of the fragmented US banking industry in 1933. The failure of the UK banking sector in 2008 occurred, and was traumatic, not because the sector had become more concentrated, but because it had become more complex. \nConsider the case of Lehman Brothers. It was not, in any ordinary sense of the phrase, a business of economic importance. The business provided no services to the real economy that were not available elsewhere, and few services to the real economy at all. \nBut Lehman was massively interconnected. At the time of its bankruptcy in 2008 the company had over 200 subsidiaries around the world, and approaching 1m outstanding transactions, almost entirely with other financial institutions. The narrow consequence of this interdependence was that the winding down of the company’s convoluted structure will employ lawyers and accountants for a decade. The broader consequence was that financial institutions with exposure to Lehman were uncertain of the value of their claims. \nBecause so many institutions had dealings with Lehman, uncertainty was contagious. Even businesses with little direct engagement with the failed bank were uncertain about the value of their claims against institutions that had such engagement. The collapse of confidence spread throughout the financial system, with adverse effects on the non-financial economy that persist to the present day. Lehman was not too big to fail, but it was too complex to fail. \nThe historian Joseph Tainter has studied a wide variety of civilisation collapses — the many sophisticated societies that once thrived but exist no longer. The flood plains of the Tigris and Euphrates in Mesopotamia were the site of the first urban civilisation and of the development of modern agriculture. Ancient Rome finally succumbed to the barbarians at the gate. The Mayan and Chacoan civilisations of North America were highly sophisticated societies that we know today only as archaeological sites. The growth of complexity in social and economic interaction is the distinctive mark of civilisation, but complexity, and the inequality and specialisation that go with it, entails diminishing returns. Eventually the social and political costs of managing that complexity become overwhelming and promote internal decomposition. \nParallels between the progress of “financialisation” and the decline and fall of the Roman empire may seem at first sight far-fetched. Yet there are lessons. That society failed because of the ultimately counterproductive consequences of the growth of complexity, its inability to manage the scale of the organisational problems raised by its growth, its increasing attention to ritual disconnected from an external world and its incapacity to effect substantive self-criticism or self-repair. \nEngineers responsible for interactively complex systems have learnt that stability and resilience requires conscious and systematic simplification, modularity, which enables failures to be contained, and redundancy, which allows failed elements to be bypassed. None of these features — simplification, modularity, redundancy — characterised the financial system as it had developed in 2008. On the contrary, financialisation had greatly increased complexity, interaction and interdependence. Redundancy — as, for example, in holding capital above the regulatory minimum — was everywhere regarded as an indicator of inefficiency, not of strength. \nMore articles for the FT by our columnist \nThe collapse of the new economy bubble in 2000 proved much less severe and enduring in its consequences than the global financial crisis of 2008. The scale of the bezzle — the imaginary wealth first created, then destroyed — was not necessarily greater in that phase of equity market mispricing than in the later episode of credit market mispricing. \nBut the rise and fall of technology stocks did not involve the complex interdependencies between financial institutions of the kind that marked the credit boom: there was little interactive complexity, and coupling was fairly loose. On the other hand, the Japanese stock market and property bubble — in which Japanese banks were heavily implicated — did lasting damage to the country’s economy, because the rise and subsequent fall of asset prices had multiple consequences for other parts of the financial sector and for the balance sheets of industrial companies. \nAs a result of complex interactions created by the growth of high-frequency trading and the wide use of exchange traded funds (packages of existing securities which are themselves bought and sold like other securities), it is far from certain that an equity market meltdown today could be accommodated with the same equanimity as in 2000. Reform of structure \nThe progressive relaxation of restrictions on the formation of integrated financial institutions in Britain and the US in the last two decades of the 20th century can be seen, with hindsight, to have been a major policy error. \nThere are some advantages to customers from a one-stop shop, where they can buy all the goods and services they need under a single roof. But such advantages are insignificant when compared with the costs imposed on the world economy by the global financial crisis — costs that were a direct result of interactive complexity within and between these conglomerates, and which continue to be imposed on households and businesses outside the financial system. \nThe key to a financial system that is resilient and directed to the needs of users of financial services is to return to a structure characterised by specialist institutions. The overriding objectives of structural reform of the finance industry are to reduce complexity, lower costs, enhance stability and facilitate the flow of information between savers and borrowers. These outcomes should be achieved through a mixture of regulatory action and market forces. \nRegulation should be focused on structural remedies whose implementation requires only limited use of judgment — rules that can be monitored by box-tickers. The elimination of cross-subsidies across activities and of government subsidies and guarantees would allow the market to drive further reform. \nThe proper economic role of banks is to operate the deposit channel, directing short-term balances towards borrowers — principally homeowners — and managing liquidity provision to reconcile safety of deposits with the long-term needs of users of capital. The policy objective should be to restore a linear framework of intermediation between depositors and borrowers. That simplification is key to the achievement of security for savers, economic and financial stability, effective control of the costs of intermediation, and transmission of the information needed to make good decisions on capital allocation. \nThe first step in implementing structural reform is to ringfence the deposit channel to ensure that the operation of the payments system cannot be jeopardised by the failure of financial conglomerates. The subsidy to trading activities arising from the availability of the deposit base as collateral should be removed; the likelihood that the taxpayers’ guarantee of routine deposits will be called will therefore be limited, if not altogether eliminated. \nFinancial intermediaries can act as custodians of other people’s money, or they can trade with their own money, but they must not do both at the same time. The effective application of principles of loyalty and prudence towards clients, and insistence that conflicts of interest be avoided, puts an end to the current business model of the investment bank, which relies on its multiplicity of activities to provide “the edge”. \nThe culture of retail banks must also change. Branch banks that collect deposits are intended to be rather dull institutions, in which Captain Mainwaring, the rule-bound bank manager of Dad’s Army, would again feel at home. \nThe clever financial marketeers who crashed the economy \nWhen I was a schoolboy in Edinburgh in the 1960s, the head office of the Bank of Scotland was an imposing building on the Mound, the street that leads from Princes Street to Edinburgh Castle and the Royal Mile. The Royal Bank of Scotland, its arch-rival, occupied Dundas House, the finest property in the city’s Georgian New Town. Banking was then a career for those who did not quite make the grades required by the good universities. If they joined either of these two institutions, they might with diligence become branch managers after 20 years. \nContinue reading \nWell, perhaps I exaggerate a little. But not much. The natural vehicles for the savings of depositors are government borrowings and good-quality housing loans. It is impossible to restore the mutual structure of the thrifts and building societies that once dominated housing finance. Their capital, built up over decades, was dissipated in the windfalls paid to depositors and their unwise diversifications, and there is no source from which reserves on the scale necessary for a large mutual sector could now be obtained in sufficient quantity. New housing institutions will have to raise equity capital, and enough of it, from investors. But it should be possible to restore the local focus appropriate to lending on residential property. \nSuch institutions should mix knowledge of the relevant property market and judgment of character with automatic credit-scoring, and manage the loans through to repayment. Although institutions that take deposits should be limited in their choice of assets to government bonds and residential mortgages, there is no reason why other financial institutions should not also own government bonds and make housing loans. Indeed the scale of demand for government funding and higher loan-to-value mortgages requires such funding. \nAsset managers should occupy the same central role in the investment channel that banks enjoy in the deposit channel. The goals are similar. Good and stable returns for savers, economic and financial stability. Control of costs. Flows of information about physical and intangible assets and their management, which promote economic efficiency for the benefit of savers, consumers, employees and taxpayers. \nManaged intermediation by asset managers, which has no need of daily valuation and redemption, potentially offers greater flexibility and the opportunity for asset managers and their customers to escape the tyranny of public markets and the predation of the high-frequency trader. Asset managers can differentiate themselves by style and by expertise in the sectors to which capital is allocated, rather than the tracking errors of closet indexation. This requires specialist intermediary providers of capital for consumer credit, small business and perhaps non-residential property. Advice worth the name \nConsumers suffered even before financialisation from “financial advisers” who were in fact sales people, although they have perhaps suffered more now that such people dominate the staff of bank branches. \nCommission generates a bias to action — and even when, as now in Britain, commissions are largely banned, it is hard to persuade people to pay much for the good advice to do nothing. Regulatory policy still clings to the illusion that it is possible to provide individually tailored financial advice to a mass market. But these levels of personal service disappeared from most areas of retailing decades ago: personalised advice of quality is simply too expensive to be provided except at the very top end of the market. \nThe computer has two potential advantages over the financial adviser: the computer is as honest as its programmer, and the processes and conclusions of the computer can be monitored and reviewed. A deposit channel directed by retail banks and an asset management sector populated by asset managers who can be trusted to be managed intermediaries and have a long-term horizon for investment: that is how we recreate a finance sector aimed at meeting the needs of the real economy. \nPersonal responsibility is also vital to reform. But this should not lead anyone to think that the only, or principal, issue is one of picking the rotten apples from the barrel. It is too easy to blame bad outcomes on bad people, whether by vilifying individuals or through blanket condemnation of “bankers”. In finance, as in every walk of life, there are people with high ethical standards and people with none; people who stand up for what they believe is right and people who find it easier, or more rewarding, to conform to prevailing norms. \nBut we are social animals, and we tend to behave in the ways expected of us in the environment in which we find ourselves. In talking to the financial community, I have been struck by the number of people who want to do a better job, but who find themselves frustrated by the system within which they work, the values and business imperatives of their employers, the unrealistic and inappropriate demands of their clients, and the regulatory framework imposed on them. Only by addressing all these issues together can we re-establish a financial system designed for the needs of the real economy. The parable of the ox ©Dreamstime \nIn 1906 the great statistician Francis Galton observed a competition to guess the weight of an ox at a country fair in which 800 people entered. Galton, being the kind of man he was, ran statistical tests on the numbers. He discovered that the average guess was extremely close to the weight of the ox. This story was told by James Surowiecki, in his entertaining book, The Wisdom of Crowds . \nNot many people know the events that followed. A few years later, the scales seemed to become less reliable. Repairs would be expensive, but the fair organiser had a brilliant idea. Since attendees were so good at guessing the weight of an ox, it was unnecessary to repair the scales. The organiser would simply ask everyone to guess the weight, and take the average of their estimates. \nA new problem emerged, however. Once weight-guessing competitions became the rage, some participants tried to cheat. They even tried to get privileged information from the farmer who bred the ox. But there was fear that, if some people had an edge, others would be reluctant to enter the weight-guessing competition. With few entrants, you could not rely on the wisdom of crowds. The process of weight discovery would be damaged. \nSo strict regulatory rules were introduced. The farmer was asked to prepare three-monthly bulletins on the development of his ox. These bulletins were posted on the door of the market for everyone to read. If the farmer gave his friends any other information about the beast, that information was also to be posted on the market door. And anyone who entered the competition who had knowledge about the ox that was not available to the world at large would be expelled from the market. In this way the integrity of the weight-guessing process would be maintained. \nProfessional analysts scrutinised the contents of these regulatory announcements and advised their clients on their implications. They wined and dined farmers; but once the farmers were required to be careful about the information they disclosed, these lunches became less useful. Some smarter analysts realised that understanding the nutrition and health of the ox wasn’t that useful anyway. Since the ox was no longer being weighed — what mattered were the guesses of the bystanders — the key to success lay not in correctly assessing the weight of the ox but in correctly assessing what others would guess. Or what other people would guess others would guess. And so on. \nSome people — such as old Farmer Buffett — claimed that the results of this process were more and more divorced from the realities of oxrearing. But he was ignored. True, Farmer Buffett’s beasts did appear healthy and well fed, and his finances ever more prosperous; but he was a countryman who didn’t really understand how markets work. \nInternational bodies were established to define the rules for assessing the weight of the ox. There were two competing standards — generally accepted ox-weighing principles, and international ox-weighing standards. But both agreed on one fundamental principle, which followed from the need to eliminate the role of subjective assessment by any individual. The weight of the ox was officially defined as the average of everyone’s guesses. \nOne difficulty was that sometimes there were few or even no guesses of the weight of the ox. But that problem was soon overcome. Mathematicians from the University of Chicago developed models from which it was possible to estimate what, if there had actually been many guesses as to the weight of the ox, the average of these guesses would have been. No knowledge of animal husbandry was required, only a powerful computer. \nBy this time, there was a large industry of professional weight-guessers, organisers of weight-guessing competitions and advisers helping people to refine their guesses. Some people suggested that it might be cheaper to repair the scales, but they were derided: why go back to relying on the judgment of a single auctioneer when you could benefit from the aggregated wisdom of so many clever people? \nAnd then the ox died. Amid all this activity, no one had remembered to feed it. \nExtracted from Other People’s Money — Masters of the Universe or Servants of the People? by John Kay, Profile Books, RRP £16.99 Related Topics", "external_links": [], "published": "2015-09-04T20:07:00.000+03:00", "crawled": "2015-09-05T05:57:07.604+03:00", "highlightTitle": ""}