{"organizations": ["Design Hornall Anderson Hires Rahmin Eslami", "Hornall Anderson Hires Rahmin Eslami", "Design Eslami"], "uuid": "75853a74a44adbc113161bd5ac05bfe95d5fc132", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l1.yimg.com/bt/api/res/1.2/6S.cNvWGpZTXBe8N22V1YQ--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://globalfinance.zenfs.com/en_us/Finance/BUSINESSWIRE/ea73577ca1271e7f9640365ef5d16d0a.cf.png", "site_section": "http://finance.yahoo.com/rss/AdvertisingAgencies", "section_title": "Yahoo! Finance: Advertising Agencies Industry News", "url": "http://finance.yahoo.com/news/hornall-anderson-hires-rahmin-eslami-120000689.html", "country": "US", "title": "Hornall Anderson Hires Rahmin Eslami as VP of Design", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Hornall Anderson Hires Rahmin Eslami as VP of Design", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T15:00:00.000+03:00", "replies_count": 0, "uuid": "75853a74a44adbc113161bd5ac05bfe95d5fc132"}, "author": "", "url": "http://finance.yahoo.com/news/hornall-anderson-hires-rahmin-eslami-120000689.html", "ord_in_thread": 0, "title": "Hornall Anderson Hires Rahmin Eslami as VP of Design", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rahmin Eslami", "Hornall Anderson"], "text": "Hornall Anderson Hires Rahmin Eslami as VP of Design Eslami joins the firm to co-lead its creative vision for brilliant impact Hornall Anderson 6 minutes ago  . View photo Hornall Anderson hires Rahmin Eslami as a VP of Design (Photo: Business Wire) Multimedia Gallery UR … \nSEATTLE--(BUSINESS WIRE)-- \nGlobal branding and design firm Hornall Anderson has recently hired Rahmin Eslami as a VP of Design—partnering with current VP of Design, Michael Connors—to help lead the agency’s innovative design efforts and push its creative vision for brilliant impact forward. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150914005038/en/ \nRahmin is charged with overseeing an inter-disciplinary design team working on national and global branding for clients. Duties will include mentoring and inspiring staff, and promoting a culture of creative excellence. He will be tasked with growing lasting relationships with diverse clients by leading teams inspired to do emotionally compelling work that resonates with audiences and motivates action. \nAs capable of bringing ideas to life as he is bringing life to ideas, Rahmin has made an impact on a number of global brands, including previous projects for Abbott, Bank of Nova Scotia, Ethicon Endo-Surgery, GE, Johnson & Johnson, Michelin brands, PepsiCo, Kraft Foods, and Procter & Gamble. \n“My goal is to make people feel things through branding,” said Rahmin. “I believe conceptual ideas drive better design and that emotion is a powerful vehicle for impact. To me, true communication comes about at a deeper level than what is sometimes readily seen or heard—and I’ve been known to keep digging until that level is reached.” \n“We are excited to have Rahmin’s expertise, knowledge and passion on our leadership team,” said John Anicker, Hornall Anderson’s CEO and President. “His deep commitment to helping translate business objectives into insightful and strategic creative will help us continue to provide our clients with the high quality of design work and innovative experiences they expect and deserve from us.” \nPrior to joining Hornall Anderson, Rahmin was a Creative Director with Landor Associates in Chicago, IL. His work has been recognized by the Business Marketing Association, American Advertising Federation, AIGA, PRINT magazine and Graphis . \nAbout Hornall Anderson \nFor more than 33 years, Hornall Anderson ( www.hornallanderson.com ) has specialized in the ideation and creation of brands, products and experiences that ignite our universal desire to play, learn and share. From strategy & insights to innovation, design, environments and interactive, we seek to uncover the truth of a brand and then do it justice through beautiful expression. And when done right, something brilliant happens—we make real impact. Hornall Anderson is a part of the DAS Group of Companies. \nAbout The DAS Group of Companies \nThe DAS Group of Companies, a division of Omnicom Group Inc. ( OMC ) ( www.omnicomgroup.com ), is a global group of marketing services companies. DAS includes over 200 companies in the following marketing disciplines: specialty, PR, healthcare, CRM, events, promotional marketing, branding and research. Operating through a combination of networks and regional organizations, DAS serves international, national and regional clients through more than 700 offices in 71 countries. View source version on businesswire.com: http://www.businesswire.com/news/home/20150914005038/en/", "external_links": [], "published": "2015-09-14T15:00:00.000+03:00", "crawled": "2015-09-14T15:07:16.492+03:00", "highlightTitle": ""}