{"organizations": [], "uuid": "dbdf4b8b16c63cfdf23afb307a7e9a921ed3e198", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509211982.html", "country": "US", "title": "Ethiopia: Risk to Public Safety Looms Large", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Ethiopia: Risk to Public Safety Looms Large", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T14:34:00.000+03:00", "replies_count": 0, "uuid": "dbdf4b8b16c63cfdf23afb307a7e9a921ed3e198"}, "author": "", "url": "http://allafrica.com/stories/201509211982.html", "ord_in_thread": 0, "title": "Ethiopia: Risk to Public Safety Looms Large", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rwanda: 18 Die in Road Accident By Mikyas Tesfaye \nThree years and nine months after the survey design of the project was conducted in January 2012, Getachew Betru (PhD), CEO of the Ethiopian Railway Corporation (ERC), announced last week that the north-south route of the light rail would begin operations today, September 20, 2015. \nWith public transportation problems in the city reaching a breaking point, the authorities at the Corporation felt pressured to commence operations as soon as possible. Yet, several tasks still remain to be done and credible safety concerns to pedestrians, vehicles and the light rail itself remain high. \nSnaking its way through some of the most congested avenues in Addis Abeba, sub Saharan Africa's maiden light rail - the Addis Abeba Light Rail Transit (AALRT) - is set to partially commence operations almost nine months behind the original schedule. \nFrom the actual design of the railway, sandwiched between major highways with sharp-edged platforms and curves that hinder drivers' visibility, to the challenge of integrating the train tracks with the city's pedestrian traffic, it is feared that the much anticipated service could worsen the city's already dark traffic accident record. \nLast year alone, traffic accidents in the city led to the tragic deaths of 22 passengers, 19 drivers and a staggering 407 pedestrians. Close to 569 road properties, estimated to be worth more than five million Birr, were damaged as a result of such accidents, according to a report by the Addis Abeba City Roads Authority. \nAsmelash Kidanemariam, head of the Road Rights Protection Administration at the Authority, disclosed that the number of accidents have increased from the previous year, with sizeable damage on the ring road and other major streets. \nThe light rail service comes into operation in the context of grave road insecurity in a city that prides itself as a political and diplomatic capital of Africa. \nRunning 17.84km east to west and 16.635km north to south, the light rail network covers a total length of 34.475km. It involved the construction of tunnels, bridges and overpasses, according to a presentation prepared by the Ethiopian Railways Corporation (ERC), the custodians of the project, on September 15, 2015. \nAccordingly, 46.31km of rail has been laid on regular ground, while 14.34km and 1.32km of rail has been laid on overpasses and in tunnels, respectively. Access points to the two depots at Kality and Ayat also involved the laying of 1.09km of rails. \nThis was all carried out after a contractual agreement was introduced in September 2009 between the Corporation and the CREC to build a light rail project at a total price of 475 million dollars - a little over half of which was paid from proceedings from the sales of the state owned breweries, according to some involved in financing. A Swedish company, Sweroad National Road Consultancy (SWEROAD), has been serving as the consulting firm for the project. \nThough the main light rail project involves these parties, major roads accompanying the rail track have been commissioned to several other contractors with varying stages of progress. The most visible and daunting is the 17km road stretching from Megenagna to Tor Hailoch, with a series of potholes and unfinished bridges, forcing the Corporation to delay operations on this route by a month. \nThe route that opens for traffic this week is compounded with inconsistent and haphazard signs, warning motorists driving along both sides of the track. They do rather expose the little attention and regard officials of the Corporation have given to mitigate the risk to public safety. \nDereje Teffera, public relations chief of the Corporation, called on the public to make full use of the light rail, without any fear or concern for safety. \nThe Tianjin Urban Light Rail Transit Association - an international certifying agency, which charged 300,000 dollars to issue certification - had set a deadline for September 18, 2015, for the Corporation to meet 40 remaining prerequisites, necessary in order to start operations, on September 20. Three thousand checklists - categorised under human resources, condition of trains, power supply, signalling capability and control centre - had already been met by the project, leaving just these 40 factors. \nA Professor at the Addis Abeba University, lecturing on railway engineering, who opted to remain anonymous, believes the signalling capability of the AALRT is dependable. He argues that, since the trains would travel at an average speed of 20km an hour, most of the signals would be conducted by the train operators and ground crew. He also holds that a sufficient amount of electrical power is supplied to the railway. \n\"The project is working hard to fulfil international standards of safety, security and emergency planning,\" said Dereje, adding that the Corporation has been exerting efforts to create awareness among residents of the city on safe commuting. \nIronically, the signs put on some of the stations are confusing and ambiguous at best, and experts agree that serious safety concerns emanating from faulty design integration remain at large. \n\"There is a wide gap in integrating existing structures with the railway,\" an urban planning expert, who requested to remain anonymous, told Fortune. \nThe apparent lack of integration, the urban planning expert argues, puts commuters at great risk of being hit by oncoming traffic while boarding and disembarking trains. The pattern appears to put priority on providing access to train stations, without due consideration to the harmonious interaction with pedestrians and vehicles alike. \n\"It didn't seem that there was a plan for building a railroad,\" Fekade Haile (Eng.), general manager of the Addis Abeba City Roads Authority (AACRA), who is also a member of the board of the Corporation, told the state Amharic daily, Addis Zemen, last week. \nFekade sees that most of the features along the railway have been, \"added as developments on the project progressed\", and expressed that more modifications should come in the future. It is indeed unprecedented to see a senior official from the city administration expressing his frustration in public. \nHe is not a solitary voice in the city administration calling for caution over the risk to public safety. \nTilahun Sarka, operations division deputy executive officer at the AALRT, pointed out that the rail project was not part of the Addis Abeba Master Plan, and contended that any integration into existing structures by the railroad line had proved a major challenge. \nBezawit Meshsha, a 33-year-old pedestrian in her sixth month of pregnancy, shares this problem while crossing the railway at Gurdshola 1. She found the crossings to be very dangerous, even without the trains. \n\"The crossings are too narrow to accommodate the great number of people passing by,\" Bezawit told Fortune. \"There are times when some people actually push and shove in order to cut across to the other side of the street. Once on the streets, you find yourself in the middle of very fast moving traffic, with a real chance of getting hit by a car.\" \nSuch grave concerns have prompted the Addis Abeba Police Commission to conduct a study to list the source of risks and suggest solutions to the Corporation. As such, the work demonstrates that serious traffic safety concerns remain, particularly near the train stations where a great number of commuters will attempt to make their way across the rail. \n\"We've identified 'hot-spots' at the Merkato and Saris markets, where traffic safety will be gravely compromised due to the sheer size of traffic involved,\" Fasika Fanta, commander and public relations head at the Addis Abeba Police Commission, told Fortune. \nThe Commission has made repeated recommendations to the ERC to modify its design of train stations, so that commuters could access the rail service through overpasses and underpasses, avoiding oncoming traffic, but to no avail. \nThe response from the Corporation shows only the insensitivity to the urgency of the risk. Dereje, the Corporation's public relations chief, says that the corporation will include such structures to its platforms in the future. \nGetachew, the Corporation's CEO, addressed members of the media last week, where he claimed that the ill-integrated rail station platforms were the result of \"a need for more space for the platforms, which required going into the principal roads\". \n\"We'll make road markings along the streets once the secondary layer of asphalt is put along the roads, in order to make them visible to cars,\" Getachew pledged. \nIn the meantime, many continue to remain anxious over the risk to their safety. \nDaniel Kinfe, 29, has been a cab driver for more than five years now. He was driving on the CMC road on Thursday. From an everyday driver's point of view, he is sharp in his criticisms of the design of the train station platforms. \n\"They've been posting reflective traffic signs over the past two weeks,\" Daniel told Fortune. \"But most of the signs are very hard to see because they are too close to the ground.\" \nThe shortcomings, according to the urban planning expert, relate to some of the acute curves of the track. Weighing 44 tonnes, and with a length of 29.5m and a width of 2.6m, each tram is a large machine on its own, which has to operate at very low speeds to avoid derailing at some of the acute curves along the way. \nDaniel is not alone in complaining that the crossings create longstanding traffic jams, with a great number of walkers trying to cross through very narrow paths. \n\"Some of the curves on the railway hinder drivers' visibility, which results in the increased risk of traffic accidents,\" noted Solomon Admasu, a middle aged commuter driving a small sedan along Sierra Leone Street. \"The issue is intensified by a lack of sufficient traffic signs and road markings, acutely extended train stations and a great number of pedestrians.\" \nThe ERC's public relations chief admits that most of the roads on the railroad are not finished and still lack standardised traffic signs and road markings. \nDespite Dereje's admission, it is not only a few in the city administration's different departments that concur with the anxiety of members of the public. \nA traffic officer, whose name has not been disclosed, was at a service near Meskel Square on Saturday. He realises that \"with the train service starting to provide services, traffic accidents could escalate at crossings and train stations.\" \nHis concern was echoed by Sime Belay, acting director for Road Traffic Safety Enhancement Directorate at the Federal Transport Authority. He thinks that the new light rail service is both a welcome development and a possible risk to public safety. He emphasised that traffic safety involves everyone and not just a single public entity, and underscored that joint actions to promote traffic safety should not be pursued only \"after lives have been lost.\" \n\"To date, we haven't coordinated our efforts with the Corporation in enhancing traffic safety for commuters, though the service is set to take off soon,\" Sime told Fortune. \nDereje, however, insists that starting the rail service now is meant to ease the paralysing transportation problem in the city. He adamantly argues that the public should be very alert on the streets and abide by the rules to remain safe from accident. He followed the suit of his boss in pledging that remaining works on the roads will ne completed as the service continues to be provided. \nThe job of making necessary preparations for all eventualities appears to have been left to the Ethiopian Red Cross Society and the Addis Abeba Administration Fire, Emergency Accidents Prevention and Control Authority, whose officials are equally worried over potential risks. \nThe railway network falls under the sphere of influence of five of their seven fire stations across the city, according to Adane Abraha, a public relations expert at the city's fire department. In addition to setting up fire hydrants across the rail, the fire department has identified the usage of 22 elevators and 12 escalators as potential causes for emergencies. \nPersonnel and machinery, 30 ambulances, 33 fire trucks and three cranes are being deployed to respond to emergency calls on Sunday and the subsequent days. So are ambulances and first aid volunteers to remain on standby to respond to any calls, according to Kasahun Habtemariam, coordinator for the Disaster Preparedness & Response Department at the Ethiopian Red Cross Society. \nDespite a National Emergency Command Post involving 18 relevant agencies under the Ministry of Transport, designed to deal with any eventualities after the commencement of the Addis Abeba Light Rail Transit, it is clear that priority has not been given to public safety, but rather to realising one of the flagship projects of the government. With nearly all roads along the railway struggling to cope with the great number of commuters, and while most remain incomplete with traffic signals and road signs, it is inevitable that the trains will add to an already congested traffic flow, increasing hazards to public safety. Ethiopia \nI would like to pay tribute and express my deepest condolences to the members of the families, colleagues and all fans … see more » Copyright © 2015 Addis Fortune. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-21T14:34:00.000+03:00", "crawled": "2015-09-21T17:21:54.801+03:00", "highlightTitle": ""}