{"organizations": [], "uuid": "601297b8879c574e557455f091bc8cc8070f3a67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneyweb.co.za", "main_image": "http://www.moneyweb.co.za/wp-content/uploads/2015/04/50177901_H1488033-500x326.jpg", "site_section": "http://www.moneyweb.co.za/category/mymoney/moneyweb-personal-finance/page/2/", "section_title": "Personal Finance articles on Moneyweb", "url": "http://www.moneyweb.co.za/news-fast-news/free-trade-can-save-the-rhino/", "country": "ZA", "title": "Free trade can save the Rhino", "performance_score": 0, "site": "moneyweb.co.za", "participants_count": 1, "title_full": "Free trade can save the Rhino - Moneyweb", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T08:08:00.000+03:00", "replies_count": 0, "uuid": "601297b8879c574e557455f091bc8cc8070f3a67"}, "author": "Editorial Board, Bloomberg", "url": "http://www.moneyweb.co.za/news-fast-news/free-trade-can-save-the-rhino/", "ord_in_thread": 0, "title": "Free trade can save the Rhino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is it possible that Michael Froman can succeed where both Leonardo DiCaprio and David Beckham have not? Maybe — if the job is saving the rhino, whose population has dwindled to about 29,000 as poaching reaches record highs in countries such as South Africa.\nAs US trade representative, Froman is the chief negotiator of the Trans-Pacific Partnership, a wide-ranging trade deal among the US and 11 other nations that’s expected to be completed this year. The benefits of the agreement will redound to the global economy, but they also extend to the rhino, the elephant and other species vulnerable to poaching.\nTrade in endangered species is already heavily restricted by the US The deal would make it far more difficult for other countries to trade in trafficked items such as elephant tusks and rhino horns. The pact would, for the first time, integrate species conservation with trade access by requiring the 12 countries that sign it to adopt conservation laws, or live up to commitments they’ve already made yet routinely ignore.\nMuch of the demand for poached wildlife comes from the same countries negotiating the TPP. Vietnam, for example, is the main source of demand for rhino horn. Malaysia is an important shipping port with a low rate of wildlife-trafficking detection. Under the trade deal, both would have to change their see-no-evil attitude or risk trade sanctions. China is also the source of much demand, and while it won’t be a TPP signer, it could join later.\nThe TPP would also require international law enforcement agencies, customs and border patrol officials, and wildlife inspectors to coordinate more effectively. If an African country informs Vietnam that one of its citizens has paid a poacher for rhino horns, for example, the Vietnamese can’t ignore the tip-off.\nThe trade deal may be the only way to prevent some species from extinction. Last year, poachers killed 1,215 rhinos in South Africa, home to most rhinos, whose horns are pulverised to make dubious hangover, headache and cancer cures. That’s a 9,000% increase since 2007. Deaths could exceed births as early as next year; extinction will soon follow. Already, three of the remaining five rhino species are critically endangered.\nElephants could be next. More than 20,000 African elephants were killed last year, exceeding the growth rate of the population, according to the Convention on International Trade in Endangered Species. A dead elephant sells for about $18,000, mostly for its tusks, which are used to make buttons, chopsticks, piano keys, jewellery, billiard balls and dozens of other items.\nThe rhino and elephant can keep their celebrity friends, of course. But their relationship with free trade may turn out to be more meaningful.\n©2015 Bloomberg News", "external_links": [], "published": "2015-09-01T08:08:00.000+03:00", "crawled": "2015-09-01T02:04:02.424+03:00", "highlightTitle": ""}