{"organizations": ["Glencore"], "uuid": "655928481227742870c7b4fffd0d2c37c72a0a6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/time-low-glencore-drags-uk-094239630.html", "country": "US", "title": "New all-time low for Glencore drags UK stocks lower", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "New all-time low for Glencore drags UK stocks lower", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T14:32:00.000+03:00", "replies_count": 0, "uuid": "655928481227742870c7b4fffd0d2c37c72a0a6d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/time-low-glencore-drags-uk-094239630.html", "ord_in_thread": 0, "title": "New all-time low for Glencore drags UK stocks lower", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \nA man shelters under an umbrella as he walks past the London Stock Exchange in London, Britain August … \nLONDON (Reuters) - British shares fell on Monday, slightly underperforming the broader European market, hit by fresh fears over miner Glencore's (GLEN.L) ability to withstand a metals price slump and an end to deal talks at Vodafone. (VOD.L) \nThe UK market is relatively exposed to mining and commodities stocks, which have been in the firing line amid an emerging-markets slowdown. \nGlencore (GLEN.L) slumped more than 15 percent to a new all-time low after a bearish note from broker Investec that raised doubts over the mining and commodities company's valuation and high debt levels. The stock was set for its worst one-day drop ever. \nThe broader FTSE 350 mining index fell almost 5 percent to its lowest level since Dec. 2008. \nThe outlook for China's economy was also a drag, with forecasts pointing to a likely shrinking of the country's giant factory sector for the second month in a row. Profits earned by Chinese industrial companies declined at the sharpest rate in four years in August, according to official data. \n\"It may be too soon to believe a bottom is in (for commodity prices),\" said Brenda Kelly, analyst at London Capital Group. \nThe FTSE 100 index (.FTSE) was down 1.2 percent, worse than a 0.8 percent drop for the pan-European FTSEurofirst 300 index (.FTEU3). \nOn the deal-making front, Vodafone (VOD.L) took a hit from news that tie-up talks between the network operator and Liberty Global (LBTYA.O) had collapsed because they could not agree on the value of their businesses. Vodafone shares were down 3.8 percent. \nHowever, brewer SABMiller (SAB.L) fared better, with shares up at fresh six-month highs after a report in the Sunday Times that Anheuser-Busch (ABI.BR) could bid about $106 billion for the company. \n\"News of the proposed takeover of SABMiller...has put M&A (mergers and acquisitions) firmly in the spotlight,\" HSBC strategists wrote in a note to clients. \"We believe (companies) will increasingly choose to buy (rivals) because the macro is so uncertain.\" \n(Reporting by Lionel Laurent; Editing by Toby Chopra)", "external_links": [], "published": "2015-09-28T14:32:00.000+03:00", "crawled": "2015-09-28T14:55:49.177+03:00", "highlightTitle": ""}