{"organizations": ["Host Top Renewable Energy Conference"], "uuid": "ff70643408f0c829d38f7b26f0aa55f77de9b4fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509270193.html", "country": "US", "title": "South Africa: SA to Host Top Renewable Energy Conference", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: SA to Host Top Renewable Energy Conference", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T17:05:00.000+03:00", "replies_count": 0, "uuid": "ff70643408f0c829d38f7b26f0aa55f77de9b4fb"}, "author": "", "url": "http://allafrica.com/stories/201509270193.html", "ord_in_thread": 0, "title": "South Africa: SA to Host Top Renewable Energy Conference", "locations": ["Malawi", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mutharika"], "text": "Malawi: Conversation with President Mutharika \nPretoria — South Africa will for the first time host the South African International Renewable Energy Conference from 4 to 7 October in Cape Town. \nThe conference will be held under the theme: \"Re-energizing Africa\". Addressing the media in Pretoria on Saturday after the Cabinet meeting held this week, Minister in the Presidency Jeff Radebe said the conference will profile renewable energy opportunities available in South Africa and Africa to producers of renewable power as their next investment destination. \n\"South Africa, through its Renewable Energy Independent Power Producers Procurement Programme, is becoming one of the biggest markets for renewable energy,\" he said. According to Minister Radebe, in future biomass, wind power, solar power and hydropower will contribute 11.4 gigawatts of renewable energy to the grid. \nThe Department of Science and Technology is supporting the country's energy policies through research and technology development in low and carbon-free technologies that can be commercialized and rolled out to increase energy security and access to all South Africans. \n\"We are now capable of manufacturing and integrating various components into a whole range of energy generating devices for these applications that are currently undergoing testing. \"The benefit of our hydrogen and fuel cell technologies Programme is the use of platinum which will also open opportunities into the automotive catalytic converter market and promote beneficiation of one of our most abundant minerals. In this regard, we have established and are strengthening our partnership with the private sector to do final tests and commercialize various components and full energy solutions,\" he said. South Africa \nThe Springboks took on Samoa at their own physical game - and emerged well-deserved winners at the Rugby World Cup at … see more » Copyright © 2015 SAnews.gov.za. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-27T17:05:00.000+03:00", "crawled": "2015-09-27T18:25:50.633+03:00", "highlightTitle": ""}