{"organizations": ["Bernama"], "uuid": "e8e3e84b2ee3665048eee1f53af694884d5b56d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eco-business.com", "main_image": "http://www.eco-business.com/static/img/logo/og_facebook.png", "site_section": "http://www.eco-business.com/feeds/category/8/", "section_title": "Eco-Business: News, Opinion, Jobs, Events, Press Releases and Research for topic Policy & Finance", "url": "http://www.eco-business.com/news/malaysia-optimistic-of-signing-mou-on-haze-with-indonesia-by-year-end/", "country": "SG", "title": "Malaysia optimistic of signing MoU on haze with Indonesia by year end", "performance_score": 0, "site": "eco-business.com", "participants_count": 0, "title_full": "Malaysia optimistic of signing MoU on haze with Indonesia by year end", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T05:56:00.000+03:00", "replies_count": 0, "uuid": "e8e3e84b2ee3665048eee1f53af694884d5b56d9"}, "author": "", "url": "http://www.eco-business.com/news/malaysia-optimistic-of-signing-mou-on-haze-with-indonesia-by-year-end/", "ord_in_thread": 0, "title": "Malaysia optimistic of signing MoU on haze with Indonesia by year end", "locations": ["Malaysia", "Indonesia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bernama Wednesday 23 September 2015 \nMalaysia is optimistic it will ink the long overdue agreement on addressing transboundary haze problems with Indonesia by end of the year. \nNatural Resources and Environment Minister Datuk Seri Dr Wan Junaidi Tuanku Jaafar said, the bilateral Memorandum of Understanding (MoU) on Transboundary Haze Pollution, once it comes into effect, will pave the way for wider cooperation between both countries to tackle the annual smog. \nHe said the draft of the MoU had been completed and he was scheduling for another meeting with his Indonesian counterpart to formalise the agreement. \n“The draft is done. I am confident we can sign it this year,” he told reporters after visiting the Panda Conservation Centre at Zoo Negara, here, Sunday. \nThe meeting between Junaidi and his Indonesian counterpart had been postponed twice, once on last Friday as the Indonesian Minister was unavailable in the country. \nThe meeting on Sept 25 was also postponed due to the deteriorating haze situation in Indonesia. \nWan Junaidi added that Malaysia-Indonesia MoU would consist of four main components, namely law enforcement in tackling haze pollution, implementing the practice of zero burning, management of the peat soil and collaboration between countries to tackle haze fire. \nThe bilateral agreement was the result of the 17th Meeting of the Sub-Regional Ministerial Steering Committee on Transboundary Haze Pollution, held in Jakarta, last July 28. \nBesides Malaysia, Indonesia will also sign a similar pact with Singapore, Thailand and Brunei. \nIn January this year, Indonesia also ratified the ASEAN Agreement on Transboundary Haze Pollution, a significant multilateral agreement among ASEAN member states to tackle haze. \nOn another development, Wan Junaidi said the RM70 million upgrading works on Zoo Negara was expected to be completed by end of 2016. \nHe said the upgrading works were carried out by various agencies such as the Drainage and Irrigation Department, National Hydraulic Research Institute (NAHRIM) and the Forest Research Institute. \n“The upgrading works which had been carried out since 2013 aimed to improve condition of the zoo and making it on par with the international standard,” he added.  ", "external_links": [], "published": "2015-09-23T05:56:00.000+03:00", "crawled": "2015-09-23T07:22:43.591+03:00", "highlightTitle": ""}