{"organizations": [], "uuid": "d29fbc37ad87c381a84818bb9fac201466a17f32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business2community.com", "main_image": "http://cdn.business2community.com/B2C_FB.png", "site_section": "http://feeds.feedburner.com/B2C_Business", "section_title": "Business & Finance Articles on Business 2 Community", "url": "http://www.business2community.com/human-resources/importance-employee-attitude-surveys-01336200", "country": "US", "title": "The Importance of Employee Attitude Surveys", "performance_score": 0, "site": "business2community.com", "participants_count": 1, "title_full": "The Importance of Employee Attitude Surveys", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T04:54:00.000+03:00", "replies_count": 0, "uuid": "d29fbc37ad87c381a84818bb9fac201466a17f32"}, "author": "Victoria Heckstall", "url": "http://www.business2community.com/human-resources/importance-employee-attitude-surveys-01336200", "ord_in_thread": 0, "title": "The Importance of Employee Attitude Surveys", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Importance of Employee Attitude Surveys 0 SHARES September 24, 2015 Human Resources 0 \nAn employee attitude survey is the one chance employees have to provide feedback to the company in a confidential manner. There is no backlash because the feedback is confidential and it gives the company a chance to drive change. \nThe reality is employees won’t speak out for fear of losing their jobs or putting themselves under pressure. With no repercussions, they are able to speak freely. \nEmployers can benefit from these surveys because they now know where to improve. Let’s go into a few of the other reasons why they’re so important. \nThe Catalyst for Change \nMaking positive change is essential if you’re going to keep your company on the cutting edge. The only way you’re going to spot problems from the employee point of view is if you ask them. A company that doesn’t take the opinions of employees into account is putting themselves in a miserable position indeed. Recommended for You \nThese surveys could lead to important developments and organizational revolutions. \nEngage Employees \nThe best companies are all driving in the same direction. Yet Dale Carnegie conducted a study that revealed only 29% of the average workforce is engaged with the company and what it’s doing. 26% are even disengaging actively. \nThese statistics are startling because it represents so much lost potential. Employee attitude surveys can encourage wavering people to engage with the company and its processes. \nIf they believe they’re being listened to then they’re more likely going to want to improve the company. \nLearning About Change \nWe know that things can be learned from past employee attitude surveys . If you build a library of past studies, you can track how your employees are changing over time. This can tell you a lot about the alterations you have made to the company. \nFor example, if you have recently implemented a series of new employee conduct policies, a survey will tell you how employees really feel. \nThey could stop you from pushing damaging policies before it’s too late. These are opinions you’re never going to receive without strong confidentiality protections in place. \nEmployee Retention \nTalent is in short supply. Companies are not. It’s why there’s such a battle to both attract and hold the best of the bunch. \nOne study states that 87% of engaged employees were less likely to leave the company than colleagues in the same industry who were disengaged. Employees don’t necessarily leave because of greed they leave because they feel they’re not wanted. Don’t give them the impression that they aren’t being listened to. \nNew Training Opportunities \nEmployee attitude surveys don’t just ask for opinions of the brand. They go more in-depth than that by asking about things like training, skills, and development. All these are important for ambitious employees who want to get the most from their jobs. \nA survey could identify areas where you are missing out. The survey could also reveal how you should address issues regarding your current training and development programs. \nYou may that find that you’re wasting money, wasting time, or addressing the wrong areas. \nTips for Conducting an Employee Attitude Survey Leave some general questions. You need to give employees the chance to give the answers they want. Don’t make it too long. Disengaged employees won’t be interested in spending too much time on it. Give them as much time as they need to answer. \nConclusion \nEmployee attitude surveys are a vital tool in your arsenal to get some answers on all areas of your company. Your employees are the most important people in the company. You should treat their opinions with the highest respect. \nAn employee attitude survey is just one of the many ways in which you can manage this.", "external_links": [], "published": "2015-09-25T04:54:00.000+03:00", "crawled": "2015-09-25T05:59:48.518+03:00", "highlightTitle": ""}