{"organizations": [], "uuid": "6575c19a18b27fcfaf1b9ff5d176060d83dc412c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/5/h/r/q/image.related.afrArticleLead.620x365.gjy4eu.png/1443609294435.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/gambling/afp-to-investigate-bookmakers-on-test-cricket-golf-betting-20150930-gjy4eu", "country": "AU", "title": "AFP to investigate bookmakers on test cricket, golf betting", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "AFP to investigate bookmakers on test cricket, golf betting | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T15:10:00.000+03:00", "replies_count": 0, "uuid": "6575c19a18b27fcfaf1b9ff5d176060d83dc412c"}, "author": "John Stensholt", "url": "http://www.afr.com/business/gambling/afp-to-investigate-bookmakers-on-test-cricket-golf-betting-20150930-gjy4eu", "ord_in_thread": 0, "title": "AFP to investigate bookmakers on test cricket, golf betting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Betting on cricket test matches may be banned after the first ball on day one. Tim Ireland Share on twitter by John Stensholt Bookmakers could face a federal police investigation and heavy fines for allowing betting on cricket test matches and golf tournaments after the first day's play.\nThe Australian Communication and Media Authority has recently written to the bookmakers, including big names such as William Hill, Crownbet and Sportsbet, demanding wagering firms show how they have not breached the Interactive Gambling Act by allowing betting after the end of a day's play during test matches or golf events.\nA breach of the act attracts fines of $1.2 million per day, with ACMA to refer the issue to the Australian Federal Police for investigation should the bookmakers be unable to show cause as to why the matter should not be investigated. The move is understood to have come after complaints to ACMA from a member of the public or a company.\nIt also follows a similar referral to the AFP by ACMA of William Hill's controversial \"click to call\" service that its customers use to make voice calls over the internet to operators to take bets during live play of sports events.\nSo-called \"in-play betting\" is allowed via the telephone or in person at retail wagering outlets, but is banned over the internet. William Hill CEO Tom Waterhouse has insisted his company's service does not breach the IGA.\nThe complaint to ACMA about betting after the first ball of a test match or the opening tee shot of a golf tournament alleges betting at the close of day's play during those events should be banned as the match or tournament is \"in-play\" once it commences on the day.\nBookmakers argue if the principle is applied to competitions such as the AFL or NRL, betting on grand final winners would not be allowed after round one. A breach could mean the bookmakers racking up tens and potentially millions of dollars of fines.\nA spokesperson from the Australian Wagering Council, the industry body representing the bookmakers and wagering companies, said the issue showed the need for the IGA, set to be reviewed by former NSW premier Barry O'Farrell for the federal government, and a report handed down by Christmas, to be modernised to keep up with changes in technology.\n \"Like many others, the Australian Wagering Council has long highlighted the need for the Interactive Gambling Act to reflect technological advances and changes in consumer preferences and online behaviour,\" the spokesperson said. \"Licensed Australian wagering service providers and their customers need and deserve a clear and contemporary legislative framework\".", "external_links": ["https://twitter.com/JohnStensholt"], "published": "2015-09-30T15:10:00.000+03:00", "crawled": "2015-09-30T22:04:32.587+03:00", "highlightTitle": ""}