{"organizations": [], "uuid": "3c474e063e2f7721d3eb5b74bc61d42fb0bac3a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/cryptocurrency/wp-content/uploads/sites/7/2015/07/Hacking.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/cryptocurrency/news/the-latest-victims-of-ddos-attacks-banks-and-bitcoin-xt/", "country": "US", "title": "The Latest Victims of DDoS Attacks: Banks and Bitcoin XT", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "The Latest Victims of DDoS Attacks: Banks and Bitcoin XT", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T01:26:00.000+03:00", "replies_count": 0, "uuid": "3c474e063e2f7721d3eb5b74bc61d42fb0bac3a7"}, "author": "", "url": "http://www.financemagnates.com/cryptocurrency/news/the-latest-victims-of-ddos-attacks-banks-and-bitcoin-xt/", "ord_in_thread": 0, "title": "The Latest Victims of DDoS Attacks: Banks and Bitcoin XT", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print This Post \nWhile banks are increasingly evaluating the merits of blockchain technology, they are typically not mentioned in the same sentence as Bitcoin XT, the controversial proposal to increase Bitcoin’s block size. \nToday, however, they have the unfortunate privilege of sharing at least one thing in common: both have reportedly become targets of DDoS (distributed denial of service) attacks. These involve an attacker, from distributed points of origin, attempting to overwhelm a central server with enough requests to knock it out of service. \nIn the wilder days of 2013 -14, and to an extent, even today, such attacks were a common problem faced by bitcoin exchanges and other services. In those cases, the strategy was to overwhelm the system so as to break down its defenses that protect precious assets, such as bitcoin wallets. \nThe elementary damage is simply the downtime experienced by the website. According to Neustar, cited by Bloomberg in a piece on the latest wave of attacks hitting banks, large enterprises stand to lose as much as $100,000 per hour. There is also reputational damage inflicted when customers begin to question the service’s reliability. \nIndeed, at least two companies- a bitcoin gambling business and an unnamed bank- have caved in during the latest ‘DD4BC’ attacks. An acronym for “DDoS for Bitcoin”, the gang threatens to take down websites if a bitcoin ransom isn’t paid by a certain time. Demands range from 25 BTC ($6,150) to 100 BTC ($25,000). \nAnd the attackers are not forgiving. After an initial attack to prove their capabilities, the victim is warned that a full-scale version will be unleashed if payment is not received within 24 hours. “But if you ignore us, and don’t pay within 24 hours, long term attack will start, price to stop will go to 100 BTC and will keep increasing for every hour of attack,” say the attackers, via e-mail. \nOnce payment is made, the victim is ostensibly off the hook. “Remember this: It’s a one-time payment. Pay and you will not hear from us ever again! We do bad things, but we keep our word.” \nDD4BC is one of the latest weapons in an arms race between cybercriminals and cybersecurity. A popular iteration reported earlier this year was ransomware such as CryptoLocker that locks a victim’s files, threatening to render them permanently encrypted if a bitcoin ransom isn’t paid. \nIn all cases, Bitcoin is the trusted agent for payment, leaving the attackers practically anonymous and not apprehendable, and the payment irreversible. \nBitcoin XT Gets Its Turn \nThe heated, at times ugly issue of Bitcoin’s block size may have stooped even lower. MIT Technology Review reports that several supporters of Bitcoin XT were DDoS’ed. Satoshilabs, which operates Slush Pool, was reportedly hit. It received a message that the attack would only end once it turns off its support for Bitcoin XT. Support for the implementation is expressed by miners, but it is believed that the number has dwindled lower due to such attacks. \nChunkHost, a web hosting company, reportedly had a client who was attacked for switching Bitcoin ATM software to Bitcoin XT. Several others reportedly complained online after experiencing such attacks. \nBitcoin XT supporters have alleged censorship on forums such as reddit, and have proposed various measures to get around it. They may now have further grievances, as censorship may fail to silence them, but DDoS might. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-09-10T01:26:00.000+03:00", "crawled": "2015-09-09T22:29:26.807+03:00", "highlightTitle": ""}