{"organizations": [], "uuid": "6633bbf53f23a1caee7c9abf768b3a2556fec742", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509280805.html", "country": "US", "title": "Africa: #demoafica2015 - Energy Storage Technologies Have the Potential to Support Our Energy System's Evolution", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: #demoafica2015 - Energy Storage Technologies Have the Potential to Support Our Energy System's Evolution", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T12:20:00.000+03:00", "replies_count": 0, "uuid": "6633bbf53f23a1caee7c9abf768b3a2556fec742"}, "author": "", "url": "http://allafrica.com/stories/201509280805.html", "ord_in_thread": 0, "title": "Africa: #demoafica2015 - Energy Storage Technologies Have the Potential to Support Our Energy System's Evolution", "locations": ["Tanzania", "Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tanzania: #demoafrica2015 - Tango TV Aspires to Become the Leading Provider of On-Demand Internet Streaming Media By Staff Writer \nRealizing this potential will require government, industry, academia and financial stakeholders to work together to help overcome the existing barriers, and can play a crucial role in energy system decarburization. \nEco-mc2 is an alternative solution to conventional battery storage and can store energy that has been harnessed from renewable sources. This new stride in both technology and energy landed the local electrical storage solutions provider Leaper Innovate Green Energies (LIGE) an award, the 2015 World Wildlife Federation Climate Solver award for its Eco-mc2 compressed air energy storage technology. \nPatents in South Africa and off and running with a 5 year contract for 90 storage systems per month - LiGE is now ready for substantial investment into manufacturing the Eco-mc2 Storage Systems from 40KWh to many MWh Systems. This contract translates to more than US $200 million. LiGE eco-mc² has been successful in securing US $1 million recently. Africa \nAfrican Union chairman Robert Mugabe is Monday expected to push for the inclusion of the push to defer the case facing … see more » Copyright © 2015 CIO East Africa. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-28T12:20:00.000+03:00", "crawled": "2015-09-28T13:06:09.483+03:00", "highlightTitle": ""}