{"organizations": ["Digital Marketing Strategy for Local Businesses Co-Hosted Google", "Digital Marketing Strategy for Local Businesses ReachLocal Hosts Seminars", "Inc."], "uuid": "331e5999f7038bd3f808fd99b4bb8cf89bb963d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/AdvertisingAgencies", "section_title": "Yahoo! Finance: Advertising Agencies Industry News", "url": "http://finance.yahoo.com/news/reachlocal-hosts-seminars-canada-digital-180000478.html", "country": "US", "title": "ReachLocal Hosts Seminars in Canada on Digital Marketing Strategy for Local Businesses", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "ReachLocal Hosts Seminars in Canada on Digital Marketing Strategy for Local Businesses", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T21:00:00.000+03:00", "replies_count": 0, "uuid": "331e5999f7038bd3f808fd99b4bb8cf89bb963d4"}, "author": "", "url": "http://finance.yahoo.com/news/reachlocal-hosts-seminars-canada-digital-180000478.html", "ord_in_thread": 0, "title": "ReachLocal Hosts Seminars in Canada on Digital Marketing Strategy for Local Businesses", "locations": ["Calgary", "Canada", "Toronto"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ReachLocal Hosts Seminars in Canada on Digital Marketing Strategy for Local Businesses Co-Hosted Google Events in Toronto and Calgary Will Cover Trends and Growth Opportunities in Search Engine Marketing ReachLocal, Inc. 4 hours ago Content preferences Done \nWOODLAND HILLS, Calif., Sept. 14, 2015 (GLOBE NEWSWIRE) -- ReachLocal Inc . ( RLOC ), a leader in powering online marketing for local businesses, announced today that it will host two free locally-hosted seminars in Canada to help companies get the most from their digital marketing dollars. The events, to be held in Toronto and Calgary on September 18 and 22, feature digital marketing experts from Google and ReachLocal, and will cover the latest trends in search engine marketing (SEM), provide tips on how to implement and improve a digital marketing plan, and offer one-on-one digital marketing consultations. \n\"Locally Crafted Marketing\" Toronto Who: Alec Humes, Strategic Partner Manager, Channel Partnerships, Google; Peter Aragon, Director and Country Manager of Sales, ReachLocal, Canada. What: Attendees will learn about the latest SEM trends and developments in the Canadian market, the key metrics that should be monitored and why they are integral to online marketing success. Each attendee will receive a free digital marketing analysis report, lunch and the opportunity for individual consulting. When and Where: Friday, September 18, 9:15 a.m. - 1:30 p.m. ET at Google, 111 Richmond Street West, 12th Floor, Toronto, Ontario M5H 2G4. Click here for more information and to register for the seminar. \n\"Google Partners Digital Breakfast\" Calgary Who: Peter Aragon, Director and Country Manager of Sales, ReachLocal, Canada; Anthony Gallace, Regional Sales Manager, ReachLocal, Canada; Fab Dolan, Head of Large Advertiser and Agency Marketing, Google, Canada. What: This seminar is for local business owners currently investing in marketing who want to move from offline advertising to online or want to improve their online marketing efforts to grow their business. ReachLocal will provide useful tips and advice to help local businesses understand what digital marketing can do, and how to best implement it to support their goals. When and Where: Tuesday, September 22, 9:00 a.m. - 11:30 a.m. ET at Charbar, Simmons Building, 618 Confluence Way SE, Calgary, AB T2G 0G1. Click here for more information and to register for the seminar. \nLearn more local online marketing tips during a free ReachLocal webinar titled \" 10 Website Mistakes and How to Avoid Them .\" What: See 10 real examples of website makeovers and learn best practices for creating a website that converts visitors into leads. When: Wednesday, September 16, 2 p.m. ET. Click here for more information and to register for the webinar. \nAbout ReachLocal \nReachLocal, Inc. ( RLOC ) helps local businesses grow and operate their business better with leading technology and expert service for our clients' lead generation and conversion. ReachLocal is headquartered in Woodland Hills, Calif. and operates in four regions: Asia-Pacific, Europe, Latin America and North America. Singapore International News", "external_links": [], "published": "2015-09-14T21:00:00.000+03:00", "crawled": "2015-09-15T01:19:10.760+03:00", "highlightTitle": ""}