{"organizations": [], "uuid": "53a0dcc446050de9416dc8a9cbe594e9ba54277c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/u/o/w/l/image.related.afrArticleLead.620x365.gjuoxq.png/1443176205486.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/kelly-odwyer-finally-joins-the-gang-20150925-gjuoxq", "country": "AU", "title": "How Kelly O'Dwyer defied her doubters", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How Kelly O'Dwyer defied her doubters | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T22:15:00.000+03:00", "replies_count": 0, "uuid": "53a0dcc446050de9416dc8a9cbe594e9ba54277c"}, "author": "Fleur Anderson", "url": "http://www.afr.com/news/politics/kelly-odwyer-finally-joins-the-gang-20150925-gjuoxq", "ord_in_thread": 0, "title": "How Kelly O'Dwyer defied her doubters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cabinet minister Kelly O'Dwyer will, no doubt, successfully juggle her mothering and working, it's not a unique position. Alex Ellinghausen Share on twitter by Fleur Anderson It's Day 5 of the Age of Malcolm and one of the faces of his new 21st century cabinet is busy hitting the phones between briefings from senior bureaucrats and, of course, feeding a four-month-old baby.\nBut it's not been an altogether smooth or swift ascension for the member for Higgins from backbencher, to parliamentary secretary to the treasurer early this year, to her new role in cabinet as Assistant Treasurer and Minister for Small Business a week ago.\nDespite high expectations of early promotion for Kelly O'Dwyer, a former policy adviser to treasurer Peter Costello, she was repeatedly overlooked for promotion under Tony Abbott and subject to anonymous sniping in The Australian Financial Review 's own Rear Window\n\"Fact: As long as Tony Abbott remains Prime Minister, Victorian backbencher Kelly O'Dwyer's chances of being a senior government figure are non-existent. Parliamentary secretary? Maybe. Cabinet minister? No way Jose,\" Rear Window prophesised back in October 2014.\nO'Dwyer, who Abbott once described as one of the Coalition women who was \"knocking on cabinet's door\", has finally burst through the cabinet's doors albeit wrenched open by a new Prime Minister.\nSo how tempting is it to give a big \"up yours\" to those sniping elements within her own party who complained she was too \"lippy\" and would never make it to cabinet?\n\"I don't know how to respond to that,\" O'Dwyer laughs in an interview with AFR Weekend.\n\"I'll be judged on my performance in the local community and people will also judge my performance in the Parliament.\n \"And I don't mind being judged on my performance.\"\nAs former treasurer Joe Hockey would attest, any successes – or failure – will inevitably invite comparisons to Australia's longest-serving treasurer, Peter Costello.\nIndeed the House of Costello is in the ascendancy in Turnbull's pick of the treasury ministers, despite Turnbull's early tussles with Costello over the then-backbencher's ambitious approach to tax reform.\nO'Dwyer counts Costello as a mentor and \"the best Treasurer Australia ever had\". Scott Morrison consulted Costello for advice on the night of the leadership when Abbott offered him the deputy leadership and the Treasury. Morrison has now appointed Costello's well-regarded former chief-of-staff Phil Gaetjens to come on board.\nNevertheless, Turnbull is keen to portray his new ministry as one for the 21st century, albeit guided by a few familiar faces in the background.\nNowhere was the symbolism of the new blood more evident than at the ministry's swearing-in ceremony at Government House where O'Dwyer's young baby, Olivia, in a knitted cap and a pram, stole the show.\nIn a photo session of the women in the ministry, Olivia was in O'Dwyer's arms being tickled by a laughing Foreign Minister Julie Bishop which, of course, drew the jokes about whether the youngest member of the ministry was 25-year-old Queenslander, Wyatt Roy or baby Olivia.\n\"She hasn't yet got to the stage of having a high chair at the cabinet table, but the serious point is she represents a whole generation of Australians and we've got to think about how we create more prosperity and more opportunities for all Australians,\" O'Dwyer says.\n\"It's no secret I'm a new mum so when I think about the future, I think about my daughter's future and the sort of Australia I want her to inherit.\"\nHer husband, UBS investment banker Jon Mant, has taken time off to look after Olivia and when he returns to work O'Dwyer will – like many other cabinet ministers – follow cabinet protocols to avoid any real or perceived conflict of interest with their spouses' interests.\nShe won't be drawn on the details of cabinet practices except to note it's not as ifshe's unique in having a spouse who also works.\nDivision of Treasury portfolio still be nutted out. O'Dwyer will spend more of her time overseas representing Australia as Morrison assumes the role of \"stay-at-home Treasurer\" in order to push the case for tax reform. Australia's first overseas commitment is the World Bank and International Monetary Fund in Peru on October 9-11 and it is not clear yet whether O'Dwyer will get the gig or Morrison or Finance Minister Mathias Cormann while Turnbull and his ministers nut out the final division of labour in the Treasury portfolio.\nWhile the elevation of more women to positions of political power has been generally applauded, O'Dwyer's promotion has not been met with all roses and accolades.\nThe small business lobby and its most high-profile advocate, Peter Strong, has been effusive in its praise of the enthusiast and evangelical former small business minister Bruce Billson, describing his dumping as a victory of big business over the little guy.\n\"Bruce Billson was a fantastic minister for small business and he did a tremendous amount of work in this portfolio and his great energy and enthusiasm was widely appreciated,\" O'Dwyer says.\n\"I'm looking forward to building on his great work in this regard.\"\nIt has also put pressure on O'Dwyer, a former NAB investment banker with a blue-ribbon Liberal pedigree, to prove her small business credentials as well as her grasp of technical business and investment issues that dog the Assistant Treasurer portfolio, which looks after the day-to-day operation of the tax and superannuation systems.\nShe says she's spent most of her first week in the job setting up meetings with all the major stakeholders, including small business, the superannuation and wealth management industry and the tax industry.\nIt is a portfolio that attracts some of the longest and wealthiest queues of lobbyists pleading their cases. With such diverse and competing interests, past assistant treasurers have found themselves lost in the arguments and counter-arguments over the most technical, and obscure of tax changes. It can prove difficult to remain certain your own side's position is on the side of the angels.\nA year or so ago as she started making a name for herself agitating for greater scrutiny of the flood of Chinese money coming into Australian existing residential property in breach of our rarely enforced foreign investment laws, O'Dywer began musing about the nature of fairness.\nFairness is not black and white Fairness, she argued, was not some black and white measure associated with the distribution of wealth from richer to poor. It's an altogether more complex and subjective creature that is necessary to understand in order to argue for difficult reforms for the good of the nation.\nNow that argument will be her guiding principle in making the case for small business owners and more challengingly, the case for broader economic reforms.\n\"The idea perpetuated by Labor and the Greens that fairness is a very narrow construct, that it's simply about distribution from those who have more to those who have less doesn't really take into account the very dynamic nature of our economy and doesn't take into account the fact that people can make sacrifices,\" she says.\n\"People in small businesses take huge risks into order to create their businesses and employ people. So 'fairness', in rewarding them for their efforts, their sacrifices and their innovation, quite possibly looks very different to somebody else who hasn't taken those same risks.\n\"We need to be very alive to the fact that this is very complicated, it's not a black and white issue.\"\nIt's going to be a tough balancing act as the new Treasury team begin preparations for next year's budget, which will have to both repair the budget bottom line at the same time as leaving some powder dry to provide a little bang as Turnbull faces his first federal election as Prime Minister.\nO'Dwyer notes that Turnbull himself says politicians need to have a much more intelligent conversation with voters.\n\"The Australian people are very intelligent people, they can follow a debate, they can follow an argument and it is our job to be persuasive when we talk about the need for change – if there is need for change,\" she says.", "external_links": ["https://twitter.com/@fleur_anderson"], "published": "2015-09-25T22:15:00.000+03:00", "crawled": "2015-09-26T00:11:38.948+03:00", "highlightTitle": ""}