{"organizations": [], "uuid": "247f768ddbed9170cd6aa7905bb434c5a9c23137", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/h/f/i/u/image.related.afrArticleLead.620x365.gjx2aa.png/1443525367728.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/metcash-ceo-ian-morrice-says-aldi-not-a-threat-in-sa-wa-20150929-gjx2aa", "country": "AU", "title": "Metcash plays down threat of expanding Aldi in south and west", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Metcash plays down threat of expanding Aldi in south and west | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T15:20:00.000+03:00", "replies_count": 0, "uuid": "247f768ddbed9170cd6aa7905bb434c5a9c23137"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/metcash-ceo-ian-morrice-says-aldi-not-a-threat-in-sa-wa-20150929-gjx2aa", "ord_in_thread": 0, "title": "Metcash plays down threat of expanding Aldi in south and west", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Metcash chief executive Ian Morrice says some of the best supermarkets in the nation are trading under the IGA and Foodland banner. Bloomberg by Simon Evans Metcash chief executive Ian Morrice says investors are over-simplifying the problems facing the company in South Australia and Western Australia when German discounter Aldi starts in 2016, by automatically assuming the eastern states' experience will be repeated.\nMr Morrice said some of the best supermarkets in the nation were trading under the IGA and Foodland banner supplied by Metcash in those states, and they were primed and ready to do battle on price, convenience and quality, and were better-positioned than independent stores were in Victoria and NSW for the entry of Aldi with its low-cost model.\n\"In essence, the argument to me has been somewhat over-simplified,\" Mr Morrice said on Tuesday after a full-day investor briefing outlining the Metcash strategy, which revolves heavily around becoming more competitive on prices under a Price Match program to try to shift perceptions that IGA stores are too expensive.\nAn advertising blitz has been rolled out, headed by Australian actor Shane Jacobson, best known for his role in the 2006 movie Kenny , about a knockabout plumber in the port-a-loo business.\nAustralian actor Shane Jacobson is the front man for the IGA stores Price Match advertising blitz. Mr Morrice said he didn't think there would be an all-out price war between the large chains Coles and Woolworths, but he conceded there was a \"lot of noise\" in the industry about the size of investment in prices by the big chains.\n\"We're not concerned that we're going to have to chase everything down to theoretical bottom,\" he said.\nInvesting heavily Woolworths is investing heavily in lowering prices as it attempts to reinvigorate its supermarkets business, after losing its way and falling behind market leader Coles.\n Metcash supplies 1455 independent supermarkets and operates a liquor business that supplies outlets trading under the Cellarbrations, IGA Liquor and The Bottle-O brands.\nThe new head of supermarkets at Metcash is Steven Cain, who ran Coles supermarkets for 14 months from 2003, until he departed because he upset too many of the \"old guard\" with an aggressive approach to change.\nMr Cain was brought to run Coles from Britain, where he had worked for supermarket chain Asda.\nMr Morrice said Mr Cain had been very impressive in his first eight weeks at Metcash.\n\"He's a good listener and he's incredibly quick on the uptake,\" Mr Morrice said.\nStrong trade component Metcash also operates a hardware business under the Mitre 10 and True Value Hardware brands. Mr Morrice said the Mitre 10 business had a strong trade component of about 50 per cent of sales, with the other half from retail customers.\nHe won't comment specifically on whether he thinks Woolworths might shut down its loss-making Masters hardware chain.\n\"We're not speculating. It's not our role to do that,\" he said.\nBut he agreed that Mitre 10 would be a \"beneficiary\" if Woolworths did choose that path.\nAldi is preparing to open 50 stores in South Australia and 70 in Western Australia over the next few years to complete a national network.\nInvestors are worried about that foray because it is a traditional heartland of IGA and those two states generate higher profit margins than the IGA stores on the eastern states.\nMetcash's share price has plunged from $2.90 in November 2014 to $1.05.", "external_links": [], "published": "2015-09-29T15:20:00.000+03:00", "crawled": "2015-09-29T17:10:13.267+03:00", "highlightTitle": ""}