{"organizations": [], "uuid": "c72f605bbc8770cb9f104dc079230e113cc0b952", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/t/5/g/4/image.related.articleLeadwide.620x349.gjt8kj.png/1442989706079.png", "site_section": "http://www.smh.com.au/business/planners-go-rogue", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/urgent-clarification-australia-demands-answers-from-vw-as-scandal-grows-20150923-gjt8kj.html", "country": "AU", "title": "'Urgent clarification': Australia demands answers from VW as scandal grows", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "'Urgent clarification': Australia demands answers from VW as scandal grows", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "c72f605bbc8770cb9f104dc079230e113cc0b952"}, "author": "Jared Lynch", "url": "http://www.smh.com.au/business/urgent-clarification-australia-demands-answers-from-vw-as-scandal-grows-20150923-gjt8kj.html", "ord_in_thread": 0, "title": "'Urgent clarification': Australia demands answers from VW as scandal grows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Volkswagen CEO still in driver's seat\nTax reform stalled by inaction of leaders\nDoctor shares concerns over drug's price hike\nRugby cashing in on world cup wins\nVW shares plunge on emissions scandal\nReplay video Return to video Video settings Please Log in to update your video settings\nVW shares plunge on emissions scandal Shares in Volkswagen suffer their biggest ever one-day fall after US authorities accused the German car maker of falsifying emissions data. VW could face penalties of up to $US18 billion.\nPT1M42S 620 349 Autoplay On Off Video feedback Video settings VW's 'dirty diesel' cover-up taints Germany and its car industry Volkswagen says 11 million cars hit by emissions scandal 'We have totally screwed up' Volkswagen shares plunge 20% The world's largest carmaker, Volkswagen, is yet to tell the Australian government if it cheated pollution tests for cars sold locally as it scrambles to minimise the fallout of the biggest scandal in its 78-year history.\nGerman engineering so good, they don't need to cook the books in this way.\nSenator Kim Carr The German carmaker has admitted that is used \"defeat device\" software to beat emission tests in labs. It is facing fines of up to $US18 billion ($25.6 billion) from the US Environmental Protection Agency, which alleges the affected diesel engines spewed as much as 40 times the legal limit of pollutants when the were on the road.\nThe company's shares dived as much as 21.9 per cent on Tuesday.\nVolkswagen says the false tests could have been used on about 11 million of cars sold around the world, and the Australian Department of Infrastructure and Regional Development is demanding the company come clean on its local operations.\nAdvertisement \"The department is seeking urgent clarification from Volkswagen Group Australia, as to whether vehicles supplied to the Australian market use similar software to that used in the US,\" a government spokesman said.\nVolkswagen's Australian subsidiary was not able to confirm if the company had used the \"defeat device\" software for cars sold locally.\nMartin Winterkorn, chief executive officer of Volkswagen AG. Photo: Bloomberg\n\"We are still seeking clarification on this topic from our head office in Germany, and we will be providing further information once we have more details,\" the VW Australia spokesman said.\nSenator Kim Carr, former industry and manufacturing minister in the Rudd and Gillard Labor governments, said \"there was no excuse\" for Volkswagen's behaviour.\n\"It's a tragic short-sighted and management failure. German engineering so good, they don't need to cook the books in this way,\" Senator Carr said.\nThe matter may cost Volkswagen $US18 billion in penalties from the EPA, based on a maximum $37,500 violation. Photo: Sean Gallup\nBut he said he was yet to see any evidence of wrongdoing at its Australian operations.\n\"The obviously tried to cook the books in America, they have acknowledged that, but I've seen no evidence that they have done the same in Australia.\n\"The fact is we have different regulatory environments [to the US].\"\nAustralian petrol and diesel passenger vehicles must currently comply with the Euro 5 emission standard.\nAustralia first adopted the standard in 2013, and it is not due to be implemented in full until next November.\nEuropean nations introduced the Euro 5 standard in 2009 and moved to more stringent Euro 6 rules in 2014. Australia will move to Euro 6 across 2017 and 2018.\nThe Australian government joins a growing list of countries, which are seeking answers from VW.\nVolkswagen has insisted that all its new European cars comply with Euro 6 rules, but officials in the UK, Germany and Italy have nevertheless called for the company's vehicles to be investigated by the EU.\nItaly has asked the company to prove the cars sold in that country do not contain the 'defeat devices', while Switzerland also said it would investigate Volkswagen's diesel vehicle emissions tests.\nIn Asia, South Korea's environment ministry said it would investigate 4000 to 5000 of Volkswagen's Jetta, Golf and Audi A3 vehicles produced in 2014 and 2015, and it could expand its probe to all German diesel cars if it found problems.\nGermany's Transport Ministry said it would send an investigative commission to study whether cars built at Volkswagen's headquarters complied with German and European emissions guidelines. The European Commission said it was in contact with Volkswagen and US authorities, and it was premature to say whether specific checks on the carmaker's vehicles were needed.\nVW admitted to having used a sophisticated software algorithm that detected when a vehicle was undergoing emission testing, according to the US Environmental Protection Agency (EPA), after regulators indicated the automaker's 2016 models wouldn't be certified unless the questions about real-world tailpipe pollution were resolved.\nThe matter may cost Volkswagen $US18 billion in penalties from the EPA, based on a maximum $37,500 violation for each of almost half-a-million diesel versions of the VW Jetta, Golf, Beetle and Passat and the Audi A3.\nThe company's shares dived as much as 21.9 per cent on Tuesday to €105 ($166.16), after slumping 16.6 per cent on Monday.\nIt would set aside ‎€6.5 billion euros in its third-quarter accounts to help cover the costs of the scandal, blowing a hole in analysts' profit forecasts.\nWith Reuters, Bloomberg", "external_links": [], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-23T16:47:45.477+03:00", "highlightTitle": ""}