{"organizations": ["CSRC", "About International PartnersInternational Partners", "Shanghai Composite", "Caijing Magazine", "Citic Securities", "International Partners", "China Securities Regulation Committee"], "uuid": "ff40d09fa3dd69baa1e3d50828e8fceb4d8a88ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/73", "section_title": "Artipot: Finance > Stock Market Articles", "url": "http://www.artipot.com/articles/1937954/international-partners-reports-mass-arrests-in-china-over-stock-rout.htm", "country": "US", "title": "International Partners Reports Mass Arrests In China Over Stock Rout (Benji Marks)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "International Partners Reports Mass Arrests In China Over Stock Rout (Benji Marks)", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T10:03:00.000+03:00", "replies_count": 0, "uuid": "ff40d09fa3dd69baa1e3d50828e8fceb4d8a88ba"}, "author": "", "url": "http://www.artipot.com/articles/1937954/international-partners-reports-mass-arrests-in-china-over-stock-rout.htm", "ord_in_thread": 0, "title": "International Partners Reports Mass Arrests In China Over Stock Rout (Benji Marks)", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Benji Marks Sep 26, 2015 International Partners: Close to 200 people - ranging from journalists to brokers - have been rounded up, arrested and put on public display by authorities in China for their alleged role in the so-called \"Black Monday\" stock market crash on the country's mainland indices last week. They have - to varying degrees - been charged with using rumor and illegal activity to undermine faith and confidence in the markets. The key benchmark index, the Shanghai Composite, has fallen by close to 40% from its peak in June 2015 and, in the process, wiped trillions of yuan-worth of value from the country's public companies resulting in huge losses for ordinary investors.One journalist at Caijing Magazine was made to appear on state TV where he \"confessed\" to effectively undermining confidence in the securities and futures markets by using hearsay and wild conjecture without taking steps to verify the content of his submissions. \"This is highly irregular\" said Mayumi Sheppers, Asian Capital Markets strategist at International Partners. \"The authorities are effectively saying that the stock rout was either down to or made worse by rumor and speculation but that's at the very heart of contemporary markets,\" she added.Officials have been urging companies to do more to help their stock prices by encouraging them to introduce higher dividends or cash buybacks to stockholders which could potentially put a floor under further falls. Among the arrests were brokers at Citic Securities who admitted to insider dealing and an official at the China Securities Regulation Committee (CSRC) who had used his position to expedite a company's application through approval processes in return for bribes.International Partners says the arrests set a dangerous precedent and warn that such witch hunts are typically counterproductive in what is touted as a free market. About International PartnersInternational Partners understands that only a plan that's personally focused can help you navigate an investment environment that's become increasingly complex and volatile.Their investment plans are designed to consider - among other matters - your short-term cash-flow requirements, time horizons, your retirement plans and any gifting or legacy aspirations you may have. Planning of this precision can only be effected by a personalized approach and this means that yours will be a tailor-made, bespoke plan that will be of no use to anybody else. About the Author", "external_links": [], "published": "2015-09-26T10:03:00.000+03:00", "crawled": "2015-09-27T01:15:29.620+03:00", "highlightTitle": ""}