{"organizations": [], "uuid": "8e314c613874234554e0517a9d90b3ca69b32907", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/0/q/q/5/w/image.related.socialLead.620x349.gjup3e.png/1443207314007.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/accel-partners-rich-wong-australian-startup-sector-now-a-global-player-20150925-gjup3e.html", "country": "AU", "title": "Accel Partners' Rich Wong: Australian start-up sector now a global player", "performance_score": 2, "site": "smh.com.au", "participants_count": 1, "title_full": "Accel Partners' Rich Wong: Australian start-up sector now a global player", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "8e314c613874234554e0517a9d90b3ca69b32907"}, "author": "", "url": "http://www.smh.com.au/business/accel-partners-rich-wong-australian-startup-sector-now-a-global-player-20150925-gjup3e.html", "ord_in_thread": 0, "title": "Accel Partners' Rich Wong: Australian start-up sector now a global player", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Accel Partners' Rich Wong says Australia is now on the radar of tech investors globally. Photo: Tony Avelar\nThe local start-up sector is increasingly being recognised as a player in the global technology arena as competition for Australian companies heats up among international venture capital funds.\nAccel Partners' Rich Wong has backed more local technology companies than any other US fund and has wryly welcomed the growing interest from fellow Silicon Valley-based funds.\n\"Australia is now on the radar of tech investors globally,\" Mr Wong told Fairfax Media in San Francisco. \"It creates more competition for us and we'd like to keep it all to ourselves, but of course that's not realistic.\"\nMr Wong has led several of the deals that saw more than $200 million go towards adding Australian companies Atlassian, OzForex, 99designs, CampaignMonitor and Invoice2go to a portfolio that includes Facebook, Dropbox and Spotify.\nAdvertisement \"It's been really exciting to see this part of your economy evolve. In some ways it's been a long six years [since Accel's first local investment] but in some ways it's a very short six years to see the tech scene get to this point.\"\nThe burgeoning technology industry has also captured the attention of Australia's politicians this year. Community leaders are hoping the era of eight-year battles to have overturned unworkable changes to employee share scheme taxation are over.\nThey could be in luck. This week alone has seen more new targeted policies launched about technology than the previous decade.\nFreshly minted Assistant Minister for Innovation Wyatt Roy suggested a proactive strategy to lure back established companies in the United States founded by Australians, and continues to lobby internally for the creation of a cross-portfolio innovation commissioner.\nIn June, Mr Wyatt told Fairfax Media of his plans for such a role , after the May budget's series of tax cuts missed the mark for technology start-ups, which tend to run at a deficit for years and are therefore unmoved by tax cuts.\n\"I'm optimistic that we can launch something spot on for start-ups by the end of year. There are lots of ideas going on in conversations with the Prime Minister, the Treasurer, the ministers for communication and small business,\" Mr Roy said.\nWith every single one of the roles mentioned now held by a new officer, the start-up sector is hoping change can occur more swiftly, especially as Labor ups its pitch to aspiring entrepreneurs this week by releasing a raft of policies to boost the technology sector.\nThese include visas to attract young entrepreneurs to our shores and an extra HECs-funded year for selected aspiring young entrepreneurs, as well as a previously announced and well-received policy to make computer coding education a mandatory part of primary education.\nTech entrepreneurs have suggested the government should focus on finally delivering on long-promised changes to crowdsourced equity regulations or explore ways for local venture funds to access superannuation investments.\nManaging partner at Blackbird Ventures Niki Scevak is one of the only local venture capital investors who has been able to coax capital from local superannuation funds . He launched the group's latest fund this month to provide a local competitor to the big US funds gunning for Australia's most promising companies.\n\"We wanted to help keep the good companies here; sometimes they have to move but we don't want limited access to capital to be the reason any more,\" Mr Scevak said.\nThe fund is the largest to date exclusively focused on backing Australian founders. It combines $145 million from First State Super and HostPlus Superannuation with $65 million raised from 96 local entrepreneurs, including the Atlassian founders Mike Cannon-Brookes and Scott Farquhar.\nAccessing the trillions managed by Australia's superannuation fund has long been a goal of the technology sector. However, local venture capital has far from a stellar reputation and funds have traditionally preferred US venture funds with successful track records such as Accel.\nWhile barely more than three years old, Blackbird's record is promising. Its first fund has invested in 13 companies with two successful exits, and only one of its start-ups failed and shut down completely in its two years.\nIts existing investments include design software Canva, cryptocurrency platform CoinJar, human resources insights software CultureAmp and education software Edrolo.\nIt also co-ordinates an accelerator program that has backed companies ranging from enterprise software to drone start-ups.\nAustralian technology entrepreneurs have welcomed the sudden burst of enthusiasm by political leaders but Mr Scevak told Fairfax Media it shouldn't distract anyone from the main factor in start-up success.\n\"It's important to recognise that investors and governments can help as enablers to great companies, but neither will dramatically change the odds of success. Ultimately it comes down to the entrepreneurs and teams creating large, sustainable global companies.\"\nBoard member at community group Startup Victoria and tech start-up founder Scott Handsaker said the rush of political promises was exciting but real action was needed.\n\"We're super optimistic but know start-ups are just a small part of the economy right now. But we do need our political leaders to see how fast the world is changing.\"\nA comprehensive report into the local technology start-up sector was published by Pricewaterhouse Coopers in 2013.\nWhile the sector has grown considerably since, the report identified 1500 technology start-ups and forecast a properly supported ecosystem would add $109 billion to the economy and 540,000 jobs by 2033.", "external_links": ["http://www.afr.com/technology/super-funds-back-biggestever-australian-tech-venture-fund-worth-200-million-20150826-gj8qlj"], "published": "2015-09-26T03:00:00.000+03:00", "crawled": "2015-09-26T14:20:11.845+03:00", "highlightTitle": ""}