{"organizations": [], "uuid": "76b74123a342f6f24e549c6096b6c4e24b1564f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/c/g/4/5/image.related.articleLeadwide.620x349.gjgt8s.png/1441668225862.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/55/utilities", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/world-business/toshiba-books-2014-loss-on-charges-restates-previous-profit-20150907-gjgt8s.html", "country": "AU", "title": "Toshiba books 2014 loss on charges, restates previous profit", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Toshiba books 2014 loss on charges, restates previous profit", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "76b74123a342f6f24e549c6096b6c4e24b1564f0"}, "author": "Takashi Amano and Grace Huang", "url": "http://www.smh.com.au/business/world-business/toshiba-books-2014-loss-on-charges-restates-previous-profit-20150907-gjgt8s.html", "ord_in_thread": 0, "title": "Toshiba books 2014 loss on charges, restates previous profit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shares of Toshiba rose 5.1 per cent to 364.2 yen in early afternoon trade in Tokyo. Photo: Fairfax\nToshiba Corporation posted an annual loss and restated earnings for the previous six years as it tries to recover from an accounting scandal that led to the ouster of its president and two predecessors.\nThe net loss was 37.8 billion yen ($US318 million) in the 12 months ended March, compared with revised net income of 60.2 billion yen a year earlier. The Tokyo-based company didn't issue dividend or earnings forecasts for the current year.\nAdjustments wiped out net income from businesses that span nuclear reactors, computer memory chips and laptop computers. The company has revamped its board, apologised to investors and appointed a special committee to try to win back trust and prevent further irregularities.\nAdvertisement \"The announced fiscal year loss is within the range of what investors have been expecting, so investors are buying back the shares,\" said Mitsushige Akino, an executive officer at Ichiyoshi Asset Management in Tokyo. \"But in the long run, it is unclear how Toshiba will change.\"\nShares of Toshiba rose 5.1 per cent to 364.2 yen in early afternoon trade in Tokyo. The company will hold a extraordinary general meeting on September 30, it said.\nWritedowns to net income from the years ending March 2009 to March 2014, plus the first three quarters of the next year, totalled 155.2 billion yen, according to the statement. The biggest was a 64 billion yen reduction in profit for the year to March 2013 to 13.4 billion yen.\nThe results for fiscal 2014 were posted months later than initially scheduled after Toshiba scrapped forecasts in May and repeatedly widened an investigation of accounting irregularities.\nThe company said last month it expected a net loss for the past year without providing a specific number.\nThe restatements follow a third-party report released on July 21 describing practices that led to overstatement of profits, linking them to former presidents Hisao Tanaka, Norio Sasaki and Atsutoshi Nishida.\nThe executives were linked to the irregularities because they pressured underlings to reach unrealistic performance targets, according to the third-party panel report. The corporate culture was such that employees felt they couldn't resist orders they perceived as including steps to make results appear better than they actually were.\nFollowing the resignations of Tanaka, Sasaki and Nishida, Masashi Muromachi was named president. No charges have been filed against Toshiba or its executives.\nThe industrial group has said it will sell some assets to raise money.\nToshiba, a pillar of Japan Inc, has built up holdings in more than 300 affiliates, partners and customers.\nThe company last month said it's selling its shares in Topcon Corporation, a maker of measuring and medical equipment. That follows July's sale of its stake in Finnish elevator maker Kone Oyj.\nBloomberg", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T08:59:02.163+03:00", "highlightTitle": ""}