{"organizations": [], "uuid": "bfb479b834eb146b716fd415c00f46e7700edb3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/microsoft300.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/tech/microsoft-launches-services-from-3-data-centres-in-india/143308", "country": "IE", "title": "Microsoft launches services from 3 data centres in India", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Microsoft launches services from 3 data centres in India | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T00:22:00.000+03:00", "replies_count": 0, "uuid": "bfb479b834eb146b716fd415c00f46e7700edb3b"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/tech/microsoft-launches-services-from-3-data-centres-in-india/143308", "ord_in_thread": 0, "title": "Microsoft launches services from 3 data centres in India", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Supreme Court to hear Castleton MAT dispute on Wednesday NMDC expects demand for iron-ore to increase in second-half of this fiscal Renault Kwid: At a price of Rs 2.57 lakh, the standout small car eyes Indian hearts and homes Tech giant Microsoft today launched commercial cloud services from its three data centres in India, giving companies an option to store their data locally.\nThe data centres are located in Mumbai, Pune and Chennai.\nThe company, however, did not share the investment details about the centres.\nA couple of days ago, during Prime Minister Narendra Modi ’s visit to Silicon Valley, Microsoft CEO Satya Nadella had announced availability of its cloud services operating out of India’s data centres.\nMicrosoft said it has invested over USD 15 billion so far in building a cloud infrastructure and cloud services globally. The company has more than 100 data centres located in over 40 countries.\nMicrosoft India General Manager (Marketing and Operations) Tyler Bryson said Indian companies can now have option to store data locally with the launch of data centres.\nMulti-national firms which have operations in India can also store their data in the three data centres, he added.\nBryson said the company launched cloud services in India about four years back and its business is growing by more than 100 per cent year-on-year over the past two years.\n“With the local cloud services, regulated industries such as BFSI, government departments and state-owned enterprises will now be able to leverage public cloud services and be able to take advantage of local data residency,” he said.\nMicrosoft said its cloud services are well-suited for governments and businesses that already have significant investments in owned IT infrastructure.\n“They will now be able to extend their existing IT infrastructure and private clouds to Microsoft local (public) cloud, thereby creating compelling hybrid cloud scenarios and reducing their cost of IT operations significantly,” the company added.\nIt said the impact on citizens is expected to be more significant as it will accelerate e-governance and roll-out of citizen services by governments, thereby accelerating the government’s Digital India and Smart Cities programs.\n 29, 2015 4:22 pm", "external_links": [], "published": "2015-09-30T00:22:00.000+03:00", "crawled": "2015-09-29T16:30:31.309+03:00", "highlightTitle": ""}