{"organizations": [], "uuid": "5942b8c6ae52ccb821f0e7c58ae91f29606a8fab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/s/u/7/a/image.related.afrArticleLead.620x365.gjsu49.png/1442972066850.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/transport/aviation/virgin-australia-ceo-john-borghetti-now-lags-qantas-ceo-alan-joyce-in-pay-stakes-20150923-gjsu49", "country": "AU", "title": "Virgin Australia CEO John Borghetti now lags Qantas CEO Alan Joyce in pay stakes", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Virgin Australia CEO John Borghetti now lags Qantas CEO Alan Joyce in pay stakes | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T08:52:00.000+03:00", "replies_count": 0, "uuid": "5942b8c6ae52ccb821f0e7c58ae91f29606a8fab"}, "author": "Jamie Freed", "url": "http://www.afr.com/business/transport/aviation/virgin-australia-ceo-john-borghetti-now-lags-qantas-ceo-alan-joyce-in-pay-stakes-20150923-gjsu49", "ord_in_thread": 0, "title": "Virgin Australia CEO John Borghetti now lags Qantas CEO Alan Joyce in pay stakes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Virgin Australia chief executive John Borghetti's take-home pay rose 2.3 per cent to $2.84 million in the last financial year. Ben Rushton Share on twitter by Jamie Freed Virgin Australia chief executive John Borghetti no longer makes a similar amount of money to his long-time rival, Qantas Airways boss Alan Joyce.\nBoth had received total pay packages of around $4 million in the 2013-14 financial year, but in the latest financial year, Mr Borghetti's remuneration fell by 10.5 per cent to $3.64 million while Mr Joyce's nearly trebled to $12 million .\nThe difference in fortunes can be linked to the share price and financial performance of the respective airlines. In the year ended June 30, Virgin's share price fell by 1.2 per cent, while Qantas's rose by 151 per cent. Virgin reported a full-year underlying loss before tax of $49 million , whereas Qantas reported an underlying profit before tax of $975 million .\nVirgin's annual report, released on Wednesday, showed Mr Borghetti's take-home pay, excluding unvested long-term incentives, rose by 2.3 per cent to $2.84 million in the last financial year. That compared with a more than tripling in Mr Joyce's take home pay to $6.7 million, from $2 million the prior year.\nVirgin's board had frozen fixed remuneration for its chief executive and other senior executives in the last financial year as a result of the overall performance of the business.\nVirgin expects to return to profitability this year, with analysts forecasting underlying earnings before tax of $147 million. That compares with consensus expectations of a record $1.62 billion pretax underlying profit at Qantas. Qantas is more than triple the size of Virgin in revenue terms, but on a proportional basis, it is more profitable than Virgin.\nVirgin has a very different shareholder mix than Qantas. More than 80 per cent of its shares are held by strategic investors Air New Zealand, Etihad Airways, Singapore Airlines and Sir Richard Branson's Virgin Group, which all have board representatives. In contrast, Qantas shares are held by a more typical mix of large institutions and smaller retail shareholders.\nVirgin on Tuesday disclosed Virgin Group's representative on its board, its chief executive Josh Bayliss, had stepped down as a non-executive director. He will be replaced by Virgin Group chief financial officer John Patrick Moorhead, who had previously served as an alternate director for Mr Bayliss on the airline's board.\n ", "external_links": ["http://www.smh.com.au/business/aviation/virgin-australia-narrows-annual-loss-after-cost-cutting-20150728-gim1n2.html", "https://twitter.com/Jamie_Freed", "http://www.smh.com.au/business/aviation/qantas-boss-alan-joyce-triples-pay-to-12m-as-airlines-profit-recovers-20150828-gj9xbv.html"], "published": "2015-09-23T08:52:00.000+03:00", "crawled": "2015-09-23T06:11:14.386+03:00", "highlightTitle": ""}