{"organizations": [], "uuid": "8fc19346fe701987e355271bf0017df58d7f0fd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/caterpillar-p-500-etf-yahoo-050000998.html", "country": "GB", "title": "Caterpillar, S&P 500 ETF, Yahoo! : Doug Kass' Views - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Caterpillar, S&P 500 ETF, Yahoo! : Doug Kass' Views - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "8fc19346fe701987e355271bf0017df58d7f0fd4"}, "author": "Doug Kass", "url": "http://finance.yahoo.com/news/caterpillar-p-500-etf-yahoo-050000998.html", "ord_in_thread": 0, "title": "Caterpillar, S&P 500 ETF, Yahoo! : Doug Kass' Views - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK ( Real Money Pro ) -- Doug Kass shares his views every day on RealMoneyPro. Click here for a real-time look at his insights and musings. \n\n\nLooking for Sales in All the Wrong Places \nOriginally published at 2:00 PM EDT on September 24, 2015 I'm bidding to cover some more my short of Caterpillar at under $66 now. It's true that CAT is sitting in the crosshairs of a global transfer of deflationary forces from the BRICs (Brazil, Russia, India and China) to developed markets.\nIt's also fair to say that over the last three years, the company has been looking for sales and profits in all the wrong places .\nStill, CAT's risk-reward ratio is changing to be what I'd call \"less unfavorable\" now.\nThat said, I'm nonetheless maintaining a short of the stock on my Best Ideas list.\nPosition: Short CAT (small) \n\n\nSelectively Adding to Longs Originally published at 2:28 PM EDT on September 24, 2015 I have added a bit to my small long exposure into the last dip, mostly by adding selectively to individual stocks.\nWhether right or wrong (we will soon find out!), I am interpreting this action as constructive, and in line with my view that the market will successfully defend the August lows in a backdrop of horrific sentiment (a plus).\nI recognize I am in the minority and that my view is not popular.\nPosition: Long SPY (small) \n\n\nTakeaways Aplenty Today \nOriginally published at 3:02 PM EDT on September 24, 2015 Here are my observations so far today: Who's more scared? The bulls, in all likelihood. Sentiment, coincident with the market's schmeissing, has built up in recent days. That's a potential plus, but sentiment is not a terrific timing tool. Just turn on CNBC and watch the preponderance of Debbie Downers, some of whom were optimistic a week ago and 100 S&P handles higher. Too many sell weakness and buy strength -- not my game, as I will leave that to the machines. A flight to quality today, with the yield on the 10-year U.S. note under 2.1%. Though still up smartly, iShares 20+ Year Treasury Bond is at the low of the day now (another signpost of a possible stock market turn higher). In light of yield drop, the weak action in closed-end municipal bond funds is conspicuous. I like the idea of shorting bonds against muni funds now. And I continue to look for the ratio of muni bond yields to taxables to contract in a rising rate setting. Gold stronger... again. Crude closes up 1%. I have been active trading today. I give it a reasonable chance of a \"Ludicrous Forecast\" -- though there is still 60 minutes to go! Apple just turned green. Netflix is extending gains. My Gnome hears that Warren Buffett is sniffing around the bad acting autos. I like my SPDR S&P 500 ETF (SPY) purchase and I didn't go long on the expectation of a $1 move higher. I am now net long (small but expanding), my highest long exposure since the August lows. I have added to SPY, Radian , Bank of America , JPMorgan Chase , Citigroup , SunEdison speculative, Yahoo and ProShares Short 20+ Year Treasury today. To this observer, a number of stocks are now moving into attractive risk/reward levels.\nA heads up, I have an unexpected meeting tomorrow and will not be writing -- but you will be in the capable hands of Chris \"Not the Designer\" Versace.\nPosition: Long SPY (small), GM, F, YHOO, SUNE, RDN, BAC, JPM, C, TBF (large); short AAPL, TLT EXCLUSIVE OFFER: See inside Jim Cramer’s multi-million dollar charitable trust portfolio to see the stocks he thinks could be potentially HUGE winners. Click here to see his holdings for FREE.", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T15:49:06.855+03:00", "highlightTitle": ""}