{"organizations": [], "uuid": "348a2b0325525eba7c7bf61db76763c9c21a5f1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/j/e/4/6/image.related.articleLeadwide.620x349.gjjnd3.png/1441917001798.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/retail/masters-is-a-home-improvement-hemorrhage-20150910-gjjnd3.html", "country": "AU", "title": "Masters is a home improvement haemorrhage", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Masters is a home improvement haemorrhage", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "348a2b0325525eba7c7bf61db76763c9c21a5f1f"}, "author": "", "url": "http://www.smh.com.au/business/retail/masters-is-a-home-improvement-hemorrhage-20150910-gjjnd3.html", "ord_in_thread": 0, "title": "Masters is a home improvement haemorrhage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Masters is proving to be a major drain on both Woolworths and Lowe's.\nWoolworths told to dump Masters Accounts lodged by the joint venture company that owns home improvement chain Masters show a clear and more frightening picture of the extent it is haemorrhaging – it lost $227.4 million in 2015.\nThe notice also said Woolworths and its partner Lowe's will now together pump in another $90 million in capital into the business – suggesting it needs the cash to pay operating costs and fund the store rollout.\nMeanwhile, separate Woolworths accounts released a few weeks ago show that it carries a liability of $886.5 million associated with the Masters business – a figure that has ballooned by $115.3 million over the past year.\nAdvertisement Next month Lowe's has the right to give Woolworths notice that it will exercise the put option and after another 13 months the option can actually be exercised.\nLowe's, which is a large operator in the US market, has been generally supportive of its investment in the home improvement joint venture in Australia and on several occasions has agreed to extend the date of the exercise of its put.\nBetween them Woolworths and Lowe's have now pumped $3.2 billion into the Australian hardware experiment, and the latest injection suggests the pump has not yet been turned off. This is despite the fact that the the joint venture has already received additional capital several times this year.\nSuch is the size and timeframe of the dilemma that will be facing the new chief executive of Woolworths when he or she puts their feet under the desk on day one.\nThere have been howls from many sections of the market for Woolworths to deal with Masters whose losses are growing – most opinion is focused on some attempt at selling the business, if that can be achieved, or liquidating the assets.\nWoolworths has been desperately attempting to improve Masters' performance introducing new formats and working on the product range – and arguably this redesign may have not had enough time to fairly withstand judgement.\nIt would be very convenient and logical for a new boss with no attachment to the poor decisions that led to the creation of Masters, to simply pay off Lowe's, sell what sites and assets they can, write down the billions in equity and hightail it out of Dodge.\nIndeed, it is so compelling that one has to wonder whether any other option could even compete.\nIt stands to reason that the last thing a new chief executive would want is to pump even more of Woolworths' precious equity into Masters.\nAnd unless the owner is prepared to hand over more to restore the business, there would be little point in keeping it.\nThere is also plenty of execution risk associated with a new boss deciding to hold onto it.\nIt is only the executives that created Masters that have the professional responsibility to patch up. The last of those men will be vacating the management posts as soon as the new chief executive starts.\nThe new boss will need to redirect as much capital as possible towards Woolworths' supermarket assets – the growth from which has stalled – whose potential for impressive returns provides management with powerful incentives to take most of the focus.\nThe accounts of the Woolworths/Lowe's joint venture company, Hydrox Holdings, show assets of $3.19 billion and accumulated losses of $461.1 million. The accumulated losses from the Masters chain have been offset by some smaller profitable hardware and building products companies that are also owned by the joint venture.\nFor instance, losses at Masters blew out from $176 million to $245.6 million on sales of $930 million in 2015 while profits at Home Timber and Hardware grew 198 per cent to $20.9 million, boosted by recent acquisitions.\nHow much stamina either joint venture partner has is anyone's guess. At last month's US investor call, the Lowe's management said it was pleased with how the Australian business was progressing in changing the formats.\nBut the put option that Lowe's holds as part of its joint venture agreement with Woolworths means that the latter has underwritten its partner's losses. Just how immune Lowe's is from the losses is not especially clear.\nWhile the put option is treated in Woolworths accounts as a $886.5 million liability this is not necessarily how much Lowe's would receive. Indeed, when Lowe's ultimately exercises the put option the price paid by Woolworths will be one negotiated and agreed by both parties. If agreement can't be reached, an independent valuer will decide.", "external_links": [], "published": "2015-09-11T03:00:00.000+03:00", "crawled": "2015-09-10T23:51:19.829+03:00", "highlightTitle": ""}