{"organizations": [], "uuid": "601704cd4de70961a04587468d0496852dbe6846", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.globalbankingandfinance.com", "main_image": "http://www.globalbankingandfinance.com/wp-content/uploads/2015/09/bmpadscc.jpg", "site_section": "http://www.globalbankingandfinance.com/feed/", "section_title": "Business, Financial, Trading News Articles Global Banking and Finance Review", "url": "http://www.globalbankingandfinance.com/the-only-regulated-market-exchange-for-paper-and-forestry-financial-derivatives/", "country": "US", "title": "THE ONLY REGULATED MARKET EXCHANGE FOR PAPER AND FORESTRY FINANCIAL DERIVATIVES", "performance_score": 0, "site": "globalbankingandfinance.com", "participants_count": 1, "title_full": "THE ONLY REGULATED MARKET EXCHANGE FOR PAPER AND FORESTRY FINANCIAL DERIVATIVES", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T18:16:00.000+03:00", "replies_count": 0, "uuid": "601704cd4de70961a04587468d0496852dbe6846"}, "author": "GBAF Mag", "url": "http://www.globalbankingandfinance.com/the-only-regulated-market-exchange-for-paper-and-forestry-financial-derivatives/", "ord_in_thread": 0, "title": "THE ONLY REGULATED MARKET EXCHANGE FOR PAPER AND FORESTRY FINANCIAL DERIVATIVES", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE ONLY REGULATED MARKET EXCHANGE FOR PAPER AND FORESTRY FINANCIAL DERIVATIVES Sep 21, 2015 By Stein Ole Larsen, CEO, NOREXECO The global aluminium and the global pulp market are approximately the same size. Commodities of this size, such as aluminium, can have several exchanges. Yet, for paper and forestry financial derivatives there has not been an established and regulated market exchange. In today’s world with great challenges, the market needs stabilizing factors. Historically the international pulp market has been volatile and very difficult to take a position on. If you wanted to buy financial contracts in the pulp and forestry market you had to do it through direct agreements between the buyer and the seller, or so called over the counter (OTC) through an independent agreement with a brokerage house or bank that is willing to enter into such an agreement. It is about time that the forestry and paper industry gets the same opportunity for risk management as other mature industries.The market needs an exchange to transparently set the prices, stabilize the market and offer equal risk management opportunities for all participants. In short, the industry and the financial sector need a regulated exchange for financial contracts to work better. We established NOREXECO ASA in Kongsvinger, Norway in 2012, and set out to create the world’s only dedicated derivatives exchange for pulp and recycled paper. Recently, on15 September 2015 NOREXECO opened up for exchange members to trade and for trades to be cleared by European Commodity Clearing AG in Germany. Stein Ole Larsen, CEO, NOREXECO From launch date on NOREXECO set closing prices and offered the registration of block trades for clearing.We are very optimistic about the opportunity to supplement and to move a share of the trading from the bilateral OTC market to a fully regulated and secure marketplace. The first products listed on NOREXECO are two financially settled pulp contracts (NBSK Softwood Kraft Pulp and BHKP Hardwood Kraft Pulp); the commodities required to produce paper. Over time new products such as recycled paper, pellets and other relevant products will be introduced on the exchange. The products that are traded are financial contracts with no delivery of the physical product. In other words, the contract will be released in cash, in the same way that among others oil contracts can be traded. We have received great interest from participants around the world and we are now working hard to make this a lively market place with a lot of liquidity. NOREXECO is trying initially to attract to the exchange producers and users of pulp that need to hedge positions, as well as financial firms. This includes producers and buyers of paper products that wish to take a financial position in the market, buy and hedge. It is also for companies who wish to take pure financial positions in the increase or decrease of the pulp market. Transactions on NOREXECO are only open for exchange members. The membership on the exchange itself is free. Regulatory initiatives following the 2008 financial crisis promoted the use of regulated exchanges and clearing houses to trade commodities derivatives.The Norwegian Ministry of Finance granted NOREXECO the license,which covers financial derivatives within forestry and paper, in 2014. Trading on the NOREXECO exchange is compliant with national regulations, EMIR (Europe) and the Dodd Frank Act (USA). There are several examples of how exchanges have helped commodity markets grow. In 2009 regulated trade of financial contracts of iron ore started. Today this market is about 50% of the physical ironore market while the trade in financial contracts of aluminium is more than 30 times as big as the physical market. The estimated market size on pulp in the open market is approximately 60 million tons with a market value exceeding 50 billion USD. How big share the financial contracts on NOREXECO will take of the physical market is hard to estimate, but to achieve 5-10% the first year should be realistic. In some years there shouldn’t be any reason why pulp is not traded at the same levels as other commodities. Related Posts", "external_links": [], "published": "2015-09-21T18:16:00.000+03:00", "crawled": "2015-09-21T23:28:18.443+03:00", "highlightTitle": ""}