{"organizations": [], "uuid": "7e0629633dfa46c405096d25815b70bb2045f4ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/d/n/m/y/image.related.articleLeadwide.620x349.gjdnij.png/1441236776234.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/selling-skirt-that-tastes-as-good-as-sirloin-to-chinas-middle-class-20150902-gjdnij.html", "country": "AU", "title": "Selling skirt that tastes as good as sirloin to China's middle class", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Selling skirt that tastes as good as sirloin to China's middle class", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "7e0629633dfa46c405096d25815b70bb2045f4ad"}, "author": "", "url": "http://www.smh.com.au/business/selling-skirt-that-tastes-as-good-as-sirloin-to-chinas-middle-class-20150902-gjdnij.html", "ord_in_thread": 0, "title": "Selling skirt that tastes as good as sirloin to China's middle class", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Traditionally cheaper cuts of beef from Bindaree Beef's abattoir will be sold at a premium in China. Photo: Michele Jedlicka\nAustralian beef usually destined for cheap hamburgers will instead be sold at a premium in China after a NSW cattle company struck a deal with JD.com, an online retailer headed by Chinese billionaire Richard Liu.\nSanger Australia, a division of Bindaree Beef Group, will gain exposure to almost half of China's 600 million internet users under the agreement.\nBut chief executive James Campbell said the company would initially export a \"modest amount\" of product.\nJD.com founder and chief executive Richard Liu is taking on bigger rival Alibaba. Photo: Darrian Traynor\n\"The partnership with JD is to develop the brand exclusively online and broaden that range over time,\" Mr Campbell said.\nAdvertisement \"Online retailing is quite something in China. And although food at the moment accounts for a relative small amount of online product, it is the fastest growing component of online retail.\"\nThe beef will be processed at Bindaree's abattoir in Inverell in northern NSW before being put into consumer ready packs, chilled, and sent to JD's cold storage warehouses in China.\nMr Campbell said the Sanger would export cheaper cuts of beef that normally would be made into mince meat and fast food hamburgers.\n\"This is all about upgrading and attributing value to traditionally lower value cuts.\n\"We are talking about rib fingers, intercostals - those sorts of cuts that tend to how a non-traditional value on a Western diet.\n\"But we like to think of it as being a product that will resonate because of its great taste and being part of a well produced animal. You hear the non-loin cut, but we have managed to create a product that's appealing, and frankly tastes like a loin cut.\"\nLoin cuts are the most tender and expensive cuts of beef, but are not a flavoursome as non-loin cuts, which are gaining popularity in Western cooking, particularly as beef prices rise.\nChinese customers will be able to access Sanger beef on the same day they order it, if they make the purchase before 11am. After 11am delivery will be the next day.\nMr Campbell said JD.com, which is China's second biggest e-commerce company, had invested heavily in its distribution infrastructure, employing about 30,000 people across its warehouses.\n\"It gives you an idea of their scale and their ability to achieve that prompt delivery.\"\nHe said Sanger partnered with JD because it had a \"closed loop\" supply channel, dealing directly with suppliers and therefore ensuring product integrity.\n\"Protection against imitation is really key in our decision to partner with that business.\"\nJD.com founder and chief executive Richard Liu visited Melbourne earlier this year to launch 'Australian Mall'. This involved partnering with several Australian-listed companies, including Treasury Wine Estates and a2 Milk, to help sell their products in China.\nJD also spent about $20 million a 4.6 per cent stake in Murray Goulburn's non-voting unit trust, which listed on the ASX in July.\nThe interest in Australia forms part of JD's plans to take on bigger rival Alibaba. As well as focusing on Australia, JD has also started a Russian-language website to fuel growth beyond its home market.\n\"Our aim is to make [China's] wealthy middle class fall in love with JD and to buy products through JD worldwide,\" Mr Liu told Fairfax Media in June.\nSanger will start selling products on JD from mid-September.", "external_links": [], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-03T05:20:34.125+03:00", "highlightTitle": ""}