{"organizations": [], "uuid": "e52a9575f3cec919b93b7222bfe18698de700907", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/traders/SpeedDesk-16-front-lead.jpg", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=WFT", "section_title": "Yahoo! Finance: WFT News", "url": "http://www.thestreet.com/story/13305863/1/weatherford-wft-stock-up-as-oil-prices-jump.html?puc=yahoo&cm_ven=YAHOO", "country": "US", "title": "Weatherford (WFT) Stock Up As Oil Prices Jump", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Weatherford (WFT) Stock Up As Oil Prices Jump", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T22:28:00.000+03:00", "replies_count": 0, "uuid": "e52a9575f3cec919b93b7222bfe18698de700907"}, "author": "", "url": "http://www.thestreet.com/story/13305863/1/weatherford-wft-stock-up-as-oil-prices-jump.html?puc=yahoo&cm_ven=YAHOO", "ord_in_thread": 0, "title": "Weatherford (WFT) Stock Up As Oil Prices Jump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint \nNEW YORK ( TheStreet ) -- Shares of Weatherford ( WFT - Get Report ) are gaining by 1.84% to $ 8.32 in late afternoon trading on Tuesday, as oil prices jump on expected draws in U.S. inventories. \nAnalysts are expecting that American Petroleum Institute's weekly report, due out this afternoon, will show a third straight week of declines in U.S. inventories for last week, by 500,000 barrels, Reuters reports. \nAdditionally, market intelligence firm Genscape has indicated that stockpiles were lower by about 1 million barrels last week at the Cushing, Okla. delivery point, according to Reuters. \nOfficial weekly data for U.S. inventories will be released on Wednesday by the Energy Information Administration. \nWTI crude is up 1.91% to $45.28 per barrel, while Brent crude is increasing 2.03% to $48.30 per barrel this afternoon, according to the CNBC.com index. \nSeparately, TheStreet Ratings team rates WEATHERFORD INTL PLC as a Sell with a ratings score of D+. TheStreet Ratings Team has this to say about their recommendation: \nWe rate WEATHERFORD INTL PLC (WFT) a SELL. This is driven by a number of negative factors, which we believe should have a greater impact than any strengths, and could make it more difficult for investors to achieve positive results compared to most of the stocks we cover. The company's weaknesses can be seen in multiple areas, such as its deteriorating net income, disappointing return on equity, poor profit margins, weak operating cash flow and generally high debt management risk. \nHighlights from the analysis by TheStreet Ratings Team goes as follows: The company, on the basis of change in net income from the same quarter one year ago, has significantly underperformed when compared to that of the S&P 500 and the Energy Equipment & Services industry. The net income has significantly decreased by 237.2% when compared to the same quarter one year ago, falling from -$145.00 million to -$489.00 million. Return on equity has greatly decreased when compared to its ROE from the same quarter one year prior. This is a signal of major weakness within the corporation. Compared to other companies in the Energy Equipment & Services industry and the overall market, WEATHERFORD INTL PLC's return on equity significantly trails that of both the industry average and the S&P 500. The gross profit margin for WEATHERFORD INTL PLC is currently lower than what is desirable, coming in at 28.66%. It has decreased from the same quarter the previous year. Along with this, the net profit margin of -20.46% is significantly below that of the industry average. Net operating cash flow has decreased to $291.00 million or 33.10% when compared to the same quarter last year. In addition, when comparing the cash generation rate to the industry average, the firm's growth is significantly lower. Even though the current debt-to-equity ratio is 1.27, it is still below the industry average, suggesting that this level of debt is acceptable within the Energy Equipment & Services industry. Despite the fact that WFT's debt-to-equity ratio is mixed in its results, the company's quick ratio of 0.69 is low and demonstrates weak liquidity. You can view the full analysis from the report here: WFT Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-09-29T22:28:00.000+03:00", "crawled": "2015-09-29T22:56:11.563+03:00", "highlightTitle": ""}