{"organizations": [], "uuid": "780d3f1a343ac6f16bf7273dddf90bbce0598384", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8904447_G.jpg", "site_section": "http://www.cbs8.com/category/120652/money", "section_title": "Money: Personal Finance, Business, Small Business news features - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30142915/vw-just-the-latest-in-long-history-of-cheating-car-companies", "country": "US", "title": "VW just the latest in long history of cheating car companies", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "VW just the latest in long history of cheating car companies - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "780d3f1a343ac6f16bf7273dddf90bbce0598384"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30142915/vw-just-the-latest-in-long-history-of-cheating-car-companies", "ord_in_thread": 0, "title": "VW just the latest in long history of cheating car companies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MICHAEL BIESECKER\nAssociated Press WASHINGTON (AP) - In stock car racing, there's an old adage: If you ain't cheatin', you ain't tryin'. You could say the same sometimes for auto makers up against stricter environmental rules.\nVolkswagen is far from the first company to stand accused of trying to game required emissions tests. Almost since the passage of the Clean Air Act in 1970, major manufacturers of cars, trucks and heavy equipment have been busted for using what regulators call \"defeat devices\" - typically programing a vehicle's on-board computer to boost horsepower or fuel mileage by belching out dirtier exhaust than allowed.\nCritics blame a federal regulatory system that largely relies on manufacturers to \"self-certify\" that their vehicles meet required fuel economy and emissions standards. The Environmental Protection Agency spot-checks only a low percentage of the vehicles made in the U.S. or imported to test the accuracy of the data reported by manufacturers.\nDonald Stedman, a University of Denver chemistry professor who specializes in testing the real-world emissions of cars and trucks, said the economics of the auto industry can make it profitable to cheat. Complying with clean air regulations can add thousands of dollars to a vehicle's sticker price while diminishing the driving performance that customers demand.\n\"Every car company has an incentive to do this,\" Stedman said. \"Some of them get caught.\"\nRevelations this month that Volkswagen used sophisticated software on its \"Clean Diesel\" models to beat emissions tests has rattled the auto industry and angered hundreds of thousands of customers who thought they bought environmentally friendly vehicles. Both state and federal investigations are under way and congressional hearings are planned.\nOver the years, several major auto manufacturers - including GM, Ford, Honda and, yes, Volkswagen - have been forced to pay hefty fines and recall vehicles after getting caught using defeat devices.\nGeneral Motors agreed to spend $45 million as part of a settlement with government regulators over defeat devices installed in Cadillacs sold between 1991 and 1995. According to EPA, the cars' computers were programed to enrich the vehicle's fuel mixture when the climate control system was turned on, increasing carbon monoxide emissions to as much as three times the legal limit.\nGM agreed to a $25 million recall program to fix the emissions and agreed to pay $11 million in civil fines.\nIn 1998, Ford agreed to spend $7.8 million on fines and fixes after defeat devices were installed in about 60,000 of the company's Econoline vans. What EPA described as Ford's \"sophisticated electronic control strategy\" was designed to improve the thirsty van's fuel economy at highway speeds, but also increased smog-causing nitrogen oxide emissions to well beyond the law's limits. Ford agreed to voluntarily stop the sale of the vans and implemented a recall.\nDuring the same period, Honda agreed to $267 million in recall costs and fines to settle allegations it disabled a misfire monitoring device on 1.6 million Accords, Civics, Preludes, Odysseys and Acuras built between 1995 and 1997. Because of the disabled device, malfunction indicator lights intended to indicate poor engine performance wouldn't come on.\nUnaware their cars needed to be serviced, vehicle owners continued driving, damaging their exhaust systems and releasing more pollution. As part of its settlement with federal officials, Honda agreed to extend warranties for all the affected models, as well as provide free oil changes and tuneups.\nAlso in 1998, EPA referred cases to the U.S. Justice Department against seven major manufacturers of heavy-duty diesel engines used in big trucks and earth-moving equipment after testing showed they used computer programing to pass emissions tests, then shift in actual use to reduce fuel consumption while pumping out prohibited levels of nitrogen oxide.\nIn what was then the largest environmental enforcement case in U.S. history, companies including industry leaders Caterpillar Inc., Cummins Engine Co., Mack Trucks and Volvo Truck Corp. agreed to pay $83.4 million in fines and reprogram the computers.\nEven before cars and trucks began to rely on computer software to run their engines and exhaust systems in the 1980s, there were analog defeat devices.\nIn 1973, VW was dinged by the EPA after it was discovered the company had installed temperature-sensitive switches that turned off emissions controls on about 25,000 Fastback, Squareback and bus models. The company agreed to remove the devices and eventually settled with the Justice Department, paying a $120,000 penalty.\nThat's pocket change compared to what the company could be facing this time. The Clean Air Act allows for fines of up to $37,500 for each of the 482,000 suspect VWs sold in the United States, potentially totaling more than $18 billion.\n___\nScience Writer Seth Borenstein in Washington contributed to this report.\n___\nFollow Michael Biesecker at http://Twitter.com/mbieseck\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": ["http://Twitter.com/mbieseck"], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T00:08:24.523+03:00", "highlightTitle": ""}