{"organizations": [], "uuid": "613be2fbd5477461daf971c671b577a149a8ee1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/most-expensive-student-digs-world-050040319.html", "country": "US", "title": "Are these the most expensive student digs in the world?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Are these the most expensive student digs in the world?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T08:00:00.000+03:00", "replies_count": 0, "uuid": "613be2fbd5477461daf971c671b577a149a8ee1b"}, "author": "", "url": "https://uk.finance.yahoo.com/news/most-expensive-student-digs-world-050040319.html", "ord_in_thread": 0, "title": "Are these the most expensive student digs in the world?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Sep 28, 2015, 06:22 BST - UK Markets open in 1 hr 38 mins Are these the most expensive student digs in the world? By Anna White | Telegraph – 21 minutes ago 0.0039 +0.0007 \nExclusive: One 17-year-old snaps up a super luxury flat in a new student block on Park Lane for £21,000 per month with bidet and mood lighting \nForget damp walls, lumpy mattresses (that have seen better days and a lot of bodies), and eating cold baked beans out of can. One undergraduate in London has rented a student flat for £21,000 a month. \nThe lavish apartment on Park Lane is one of six luxury apartments in the Fountain Block overlooking Hyde Park. \nPrices range from £9,000 a month to £21,000 in the super-posh block which is thought to be one of the most expensive student digs in the world. \nWith a 24 hour concierge service and kitchens fitted with Miele appliances (not a dodgy gas oven in sight), the building, developed by Criterion Capital (Other OTC: CGHC - news ) , been marketed exclusively to students by the Mayfair estate agent, Peter Wetherell, and plays to international parents who want to send their children to British universities. \nIn fact, new figures from the Government’s Higher Education Statistics Agency show that there are some 107,000 overseas students studying in London. With 40,000 from continental Europe and 67,000 from the rest of the world. \nThe homes range from 1,600 sqft to over 2,000 sqft with interiors designed by Alexander James whose portfolio includes Sunseeker yachts, country houses and luxury London homes. \nThis nine-floor building with views over Hyde Park is at the very top end of student accommodation, and of course, non-students (should they dare) can also rent an apartment there. \nEach of the two bedroom apartments has a spacious living / dining area with woodstrip flooring and mood lighting. \nBut even accommodation deemed more affordable, and outside the capital, is more sushi than baked beans. \nStep (Shenzhen: 002527.SZ - news ) inside the brand new, 10-storey Vita Building, in central Manchester, and you’ll be greeted by building manager, Claire Sherlock, whose background is in retail and customer service. \nRather than viewing each student through a filter of suspicion, she greets them all by name. Instead of regarding them as potential Blu-tak bandits and room-wreckers, the policy here is to treat them as paying customers. \nStudents living in this newly-built and elegant high-rise, right in the centre of the city, don’t just rent their rooms in term time, but for 51 weeks of the year. As a hedge against rent rises. \nWhat’s more, the students don’t just pay peanuts. A single room here costs anything from £725 to £1,000 per month. \nWhich means that far from being issued with a battered microwave and a limited supply of hot water, they get a lot more for their money than did their forbears. \nWalk in the front door, and you could be arriving at a smart block of private apartments. The floor is smart parquet, and there are a large number of comfortable chairs and sofas. Plus each morning a large, free breakfast is laid out on the central counter, from 7am to 10am. \nThere are study rooms you can book, laundry rooms in which you can wash your clothes, a gym to exercise in, and TV lounges in which you can watch everything from football to films. \nAnd that’s before you’ve even set foot in your room. Here you have not just the standard desk, bed and bathroom set-up, but a TV, internet, wi-fi, fridge, kettle, toaster, cutlery and a daily cleaner whose efforts you are invited to judge, in the form of marks out of 10. \nPlus when you’ve written up your essay, you can go downstairs and join in movie nights, pool tournaments and karaoke contests. \nThe company that provides this accommodation, Select Property Group (offices in UK, Canada, Pakistan and United Arab Emirates), runs similar operations in other student cities: Liverpool, Exeter, Sheffield, Southampton, and Bristol, with York and Glasgow to come. \nInstead of arriving in Manchester and trying to find a bedsit through an ad in the Manchester Evening News, science student Amit Varu, from Barbados, has opted to live in the Vita Building. \nAnd he hasn’t regretted it. “I chose this place because I wanted to have my own kitchen”, he says. “At the same time, living here has meant I have been able to make lots of friends.” \nBut forget the niceties, it’s big business. This year alone, some £4.2 billion has been invested in new student accommodation. \nCampbell Property is another developer delivering accommodation for students, but with a difference. Rather than the modern look of the Vita block, this company renovates lovely old buildings into digs, such as the Hoisery Factory in Leicester once a red brick, Victorian industrial site mass producing out tights. \nWhat has happened, then, is that rather than being left out in the cold, on the fringe of society, students are being welcomed into the warm at a cost.", "external_links": [], "published": "2015-09-28T08:00:00.000+03:00", "crawled": "2015-09-28T08:23:04.079+03:00", "highlightTitle": ""}