{"organizations": [], "uuid": "f08cedd0e44b15f08d13b48d8b2769f7bcbe490f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/v/0/1/m/image.related.afrArticleLead.620x365.gjttup.png/1443174003654.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/rosegrowing-senator-says-thorns-removed-and-mr-x-faces-harder-task-20150924-gjttup", "country": "AU", "title": "Rose-growing senator says thorns removed and Mr X faces harder task", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Rose-growing senator says thorns removed and Mr X faces harder task | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T12:09:00.000+03:00", "replies_count": 0, "uuid": "f08cedd0e44b15f08d13b48d8b2769f7bcbe490f"}, "author": "Simon Evans", "url": "http://www.afr.com/news/rosegrowing-senator-says-thorns-removed-and-mr-x-faces-harder-task-20150924-gjttup", "ord_in_thread": 0, "title": "Rose-growing senator says thorns removed and Mr X faces harder task", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Australian Senator Anne Ruston says South Australians have been \"screaming out\" for some optimism and strong leadership. David Mariuz by Simon Evans Liberal Senator Anne Ruston ran one of Australia's biggest rose-growing businesses for a decade before heading to Canberra in 2012.\nShe has always been a glass-half-full person, and is convinced the renewed sense of optimism being projected by Prime Minister Malcolm Turnbull will largely remove some potentially thorny problems for her fellow South Australian federal Liberals – one of which is the so-called X-factor of Nick Xenophon's new party.\n\"I think it will make it better for us,\" she says.\nRuston, who is still a co-owner of the family business Ruston's Roses, which has 40,000 rose bushes near Renmark in South Australia's Riverland, was elevated to the role of Assistant Minister to Agriculture and Water Minister Barnaby Joyce in the new Turnbull government as part of an overhaul by the new Prime Minister.\nShe says South Australians have been \"screaming out\" for some optimism and strong leadership and the new approach by Turnbull is already resonating. It is infectious and is in step with her views. \"Instead of looking at what the problem is, let's look at what the opportunities are,\" she tells AFR Weekend .\nThe Abbott government had been seriously offside with the South Australian electorate because of big-picture policy decisions around the car industry and the defence sector. Many people were convinced Abbott favoured a deal where Japan would build the next generation of submarines for the Royal Australian Navy offshore, instead of them being built in Adelaide at the ASC site in Osborne, as he had promised before the 2013 federal election.\nThis discontent had been accelerating in the first part of 2015 and allowed maverick independent Senator Nick Xenophon, who has a huge following in his home state as a passionate fighter for the interests of South Australia, to hatch plans to run his own candidates under the Nick Xenophon team banner in key federal electorates in Adelaide.\nSwitched his support Those seats include that of prominent frontbencher Christopher Pyne, who switched his support from Abbott to Turnbull in the latest leadership ballot. The chances of the submarines being built in Adelaide are much higher now, with France, Japan and Germany all vying for the work.\nXenophon acknowledges the national political dynamics have changed with the ascension of Turnbull, but says the basic thrust of his campaign to ensure that a promise made by the federal Coalition to build 12 submarines in Adelaide was adhered to is intact.\n\"I've got to do my job as a watchdog,\" he says.\nHe is preparing to unveil some of his candidates in November and says the public still wants a \"commonsense approach\" and an alternative to the large parties on a range of issues, including food labelling, online betting and poker machines.\n\"The submarine question hasn't changed,\" he says.\nRuston, who was born and bred in Renmark, is a big believer in small government and referenced Sir Robert Menzies and former United States president Ronald Reagan in her maiden speech in the Senate in October 2012. Ruston's Roses was set up by her uncle David, who sold it to Ruston and her husband Richard in 2003.\nShe is still a co-owner but was hands-on operator from 2003 to 2012 at a company that also invested heavily in expanding as a tourist centre, alongside its core operations of producing up to 2000 dozen roses a week in busy times, such as the lead-up to Valentine's Day and Mother's Day.\n\"I believe that government should only do what the private sector can't do,\" she says.", "external_links": [], "published": "2015-09-25T12:09:00.000+03:00", "crawled": "2015-09-25T15:09:07.804+03:00", "highlightTitle": ""}