{"organizations": [], "uuid": "c76dcc74dd706464c2346ec0996fe6dcdf1ecaae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/g/i/r/l/image.related.afrArticleLead.620x365.gjpyy5.png/1442790787360.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/nsw-power-sale-not-viable-if-aer-decision-stands-20150918-gjpyy5", "country": "AU", "title": "NSW power sale 'not viable' if AER decision stands", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "NSW power sale 'not viable' if AER decision stands | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T07:13:00.000+03:00", "replies_count": 0, "uuid": "c76dcc74dd706464c2346ec0996fe6dcdf1ecaae"}, "author": "Geoff Winestock", "url": "http://www.afr.com/news/nsw-power-sale-not-viable-if-aer-decision-stands-20150918-gjpyy5", "ord_in_thread": 0, "title": "NSW power sale 'not viable' if AER decision stands", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NSW warns that unless the court overturns a pricing decision by the Australian Energy Regulator it will be almost impossible for the NSW government to carry out its key election pledge to sell long-term leases in the power networks. Jessica Shapiro Share on twitter Share on Google Plus by Geoff Winestock NSW electricity networks have accused the pricing regulator of taking a \"glib and superficial\" approach to a landmark case that could determine the success of NSW Premier Mike Baird's $20 billion power privatisation.\nNetworks NSW, the holding company for the state's three electricity distribution network companies, told the Australian Competition Tribunal that unless the court overturns a pricing decision by the Australian Energy Regulator it will be almost impossible for the NSW government to carry out its key election pledge to sell long-term leases in the power networks.\n\"This would not be a viable proposition for investors who would be asked to commit new funds to an operation generating low or negative equity returns.\n\"Procuring equity for an organisation where equity has little or no prospect of a return on investment for some years would be extremely challenging.\"\nSYDNEY, AUSTRALIA - MARCH 12: L-R, Ausgrid workers holding scare campaign signs at the Princess Highway, Blakehurst on March 12, 2015 in Sydney, Australia. (Photo by Fiona Morris/Fairfax Media) Fiona Morris Networks NSW issued the warning in a final submission ahead of four weeks of hearings that will start on Monday in a precedent-setting case that pits all the nation's power networks against the AER and consumer group, the Public Interest Advocacy Centre.\n'Glib and superficial' In extraordinary language for a regulatory pricing case, Networks NSW slammed the AER's decision as \"glib and superficial.\"\nIt warned of \"potentially catastrophic\" consequences such as bushfires if the networks ran short of money.\n \"The likely operational outcome for the business would be severe with debt and equity capital providers requiring significant cutbacks to operating and capital programs in order to generate positive returns at some point in the future. This would in turn compromise the safety, security and reliability of the network service.\"\nIt said that the state-owned networks face a credit rating downgrade and will require a \"significant equity injection\" of more than $3.2 billion from the state government to keep paying their debts.\nNetworks NSW is fighting an AER decision in April which set their revenue at $5.7 billion, or about 25 percent, below what the networks requested for the period 2014 to 2019.\nBut consumer groups are celebrating because the AER's decision cut the average customer's bill by about $560 a year.\nA study by St Vincent de Paul in July found that average household electricity bills in NSW had already fallen by $190 to $400, just a month after the cuts started to take effect.\nAt a directions hearing last week, Networks NSW admitted customers could face \"bill shock\" if Networks NSW wins the case and prices jump back up.\nThe AER says that NSW state-owned networks can afford the price cuts because in the past they were allowed to spend inefficiently on unnecessary \"gold plated\" investment and employed far more unionised full-time workers than their more equivalent private networks in other states and overseas.\nNSW networks have already announced plans to sack thousands of workers in response to the AER decision. PIAC says the state-owned networks are so fat that the cuts should be even deeper.\nThe case is a lawyers picnic.\nPower network firms from Queensland, Victoria and South Australia have been allowed to speak at the hearings because the case will be the first time the tribunal has been asked to interpret new electricity pricing rules passed by the Gillard government in 2012.\nJemena Gas Networks and ActeAGL, the Canberra distributor, are running challenges in their own right and the federal Energy Minister will have a say.\nNSW wants to sell long term leases in 50.4 percent of Ausgrid and Endeavour Energy, which are the two biggest of the three firms that make up Networks NSW.\nIt is also planning to sell 100 percent of Transgrid, a high voltage transmission firm, but Transgrid chose not to appeal the AERs decision.\nCountry distributor Essential Energy is not slated for sale but it is part of the Networks NSW appeal.\n﻿", "external_links": ["https://twitter.com/https://twitter.com/GeoffWinestock", "https://plus.google.com/https://plus.google.com/108137886892627412852"], "published": "2015-09-21T07:13:00.000+03:00", "crawled": "2015-09-21T04:09:46.675+03:00", "highlightTitle": ""}