{"organizations": ["Navy"], "uuid": "5ca0395541bcf51633a416e1f3e77d122e637b15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.just-style.com", "main_image": "http://i3.aroq.com/3/999896_167364896771621_1294761661_n.jpg", "site_section": "http://www.just-style.com/alerts/rsssectornews.aspx?id=4", "section_title": "Latest Finance industry news - from just-style.com", "url": "http://www.just-style.com/news/old-navys-larsson-to-replace-ralph-lauren-as-ceo_id126284.aspx", "country": "GB", "title": "Old Navy's Larsson to replace Ralph Lauren as CEO", "performance_score": 0, "site": "just-style.com", "participants_count": 0, "title_full": "Old Navy's Larsson to replace Ralph Lauren as CEO", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T13:13:00.000+03:00", "replies_count": 0, "uuid": "5ca0395541bcf51633a416e1f3e77d122e637b15"}, "author": "", "url": "http://www.just-style.com/news/old-navys-larsson-to-replace-ralph-lauren-as-ceo_id126284.aspx", "ord_in_thread": 0, "title": "Old Navy's Larsson to replace Ralph Lauren as CEO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ralph Lauren", "Larsson"], "text": "  \nLauren will be succeeded by Old Navy's Stefan Larsson \nRalph Lauren is to step down as CEO of the eponymous firm he founded nearly 50 years ago, with Stefan Larsson, president of Gap Inc 's Old Navy division, taking the helm. \nLauren will step down in November, but will stay on to help “drive the company’s vision and strategy” as executive chairman and chief creative officer. \n“My job is to think always about the future of our company and how to move it forward,” he said of his decision. “Stefan Larsson is exceptionally talented, and he will bring our company a fresh and exciting global perspective.” \nThe changeover comes as the company battles falling profits, with earnings dropping 41% in its latest quarter . Gross margin was down 120 bps, and sales slipped 5% due to currency fluctuations. \nThe group has been implementing a new global brand management organisational structure - the company's brands include Polo Ralph Lauren, Denim & Supply Ralph Lauren, Chaps and Club Monaco - and has expanded its omni-channel presence to reach new consumers. Investments have also been made in online, mobile and e-commerce. \nLarsson is expected to bring “a fresh and exciting global perspective” to the company. During his time heading up Old Navy, the division enjoyed three consecutive years of profitable growth, adding US$1bn in sales. Prior to this, he spent 15 years at Swedish retail giant Hennes & Mauritz (H&M). \nHe will be succeeded at Old Navy by Jill Stanton on an interim basis, who has been responsible for design and product functions for the last four years. She previously spent almost 14 years at sportswear group Nike as vice president and general manager of global apparel. \nStifel analyst Richard Jaffe believes the news is \"disappointing\" given Larsson’s leadership at Old Navy has helped the division grow rapidly \n\"Larsson was responsible for the improved merchandise assortment at Old Navy and the highly effective sourcing model utilised by the division, which is currently being implemented at other divisions. Near term his absence will likely have little impact as holiday and early spring merchandise decisions have been made. Longer term we believe that this team can continue to flourish without Larsson.\" \nFBR & Co analyst Susan Anderson, noted: “A search for a new Old Navy global brand president is already underway. We do not expect a quick replacement as Gap will review a comprehensive list of both internal and external candidates. We think the ultimate successor will be an individual who is more operationally focused and less transformational (a leader who does not have a desire to overhaul Old Navy's existing processes).”", "external_links": [], "published": "2015-09-30T13:13:00.000+03:00", "crawled": "2015-09-30T17:39:13.948+03:00", "highlightTitle": ""}