{"organizations": ["Commercial Bank of Dubai", "Reuters"], "uuid": "71912e0dbbddaecea2f1dd04d8066035cd848946", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arabianbusiness.com", "main_image": "http://www.arabianbusiness.com/incoming/article487448.ece/BINARY/Commercial+Bank+of+Dubai.jpg", "site_section": "http://www.arabianbusiness.com//industries/banking-finance/?service=rss", "section_title": "Arabian Business - Banking & Finance", "url": "http://www.arabianbusiness.com/commercial-bank-of-dubai-shareholders-reject-750m-tier-1-bond-plan-606117.html", "country": "US", "title": "Commercial Bank of Dubai shareholders reject $750m Tier 1 bond plan", "performance_score": 0, "site": "arabianbusiness.com", "participants_count": 0, "title_full": "Commercial Bank of Dubai shareholders reject $750m Tier 1 bond plan", "spam_score": 0.0, "site_type": "news", "published": "2015-09-13T17:13:00.000+03:00", "replies_count": 0, "uuid": "71912e0dbbddaecea2f1dd04d8066035cd848946"}, "author": "", "url": "http://www.arabianbusiness.com/commercial-bank-of-dubai-shareholders-reject-750m-tier-1-bond-plan-606117.html", "ord_in_thread": 0, "title": "Commercial Bank of Dubai shareholders reject $750m Tier 1 bond plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Commercial Bank of Dubai shareholders reject $750m Tier 1 bond plan Article By Reuters Sunday, 13 September 2015 6:13 PM \nPlans by Commercial Bank of Dubai (CBD) to raise a $750 million bond to boost the lender's core capital reserves are off the table for the immediate future after shareholders rejected the proposal, a bank official said on Sunday. \nThe rejection is a rare case of shareholder rebellion in the Gulf, where votes usually rubber-stamp decisions made by the board of directors and executive management. \nLast month, the bank said that its board had proposed the Basel III-compliant bond, subject to shareholder and regulatory approval. \n\"Some of the shareholders felt that more capital wasn't as necessary at this stage,\" John Tuke, head of treasury and asset and liability management at CBD, told Reuters by phone. \nShareholders representing 39.24 percent of those present at a meeting to discuss the proposal voted against it, with 75 percent assent needed under the bank's articles of association for the motion to pass. \nTuke declined to name which shareholders voted against the plan, but said that given around 80 percent of shareholders were present in the meeting, some of the bank's core constituents were dissenters. \nAbdullah Hamad al-Futtaim and sovereign fund Investment Corporation of Dubai are the bank's largest shareholders with 26.3 percent and 20 percent respectively, with two other local businessmen also above the five percent threshold, according to Thomson Reuters data. \nCBD's Tier 1 ratio, an indicator of a bank's health, stood at 16.67 percent at the end of June. That is well above the minimum regulatory requirements in the United Arab Emirates and marginally ahead of the sector average of 16.5 percent according to central bank data. \n\"It (the proposal) was put forward as we thought it was an opportunistic time to raise capital, with rates cheap and investors hungry for yield,\" said Tuke. \n\"If the bank grows quickly, then it (raising capital) will be one of the things which may be revisited in the future.\"", "external_links": [], "published": "2015-09-13T17:13:00.000+03:00", "crawled": "2015-09-14T00:03:07.505+03:00", "highlightTitle": ""}