{"organizations": [], "uuid": "7c0e241e2a5da8a0c499fcf15e68e9129d4e9c53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/04/general-electric-re-T.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/companies/general-electric-keen-to-strengthen-partnership-with-india/130561", "country": "IE", "title": "India is Asia’s growth engine, says General Electric chief Immelt", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "India is Asia’s growth engine, says General Electric chief Immelt | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T01:07:00.000+03:00", "replies_count": 0, "uuid": "7c0e241e2a5da8a0c499fcf15e68e9129d4e9c53"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/companies/general-electric-keen-to-strengthen-partnership-with-india/130561", "ord_in_thread": 0, "title": "India is Asia’s growth engine, says General Electric chief Immelt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Free ambulance service: AAP govt signs deals with Wipro Telephonics to hike stake in defence JV with Mahindra to 49% Aurobindo gets USFDA nod for generic hypertension tablets With plans for more investments in line with the ‘ Make In India ’ initiative, US conglomerate General Electric’s Chairman Jeff Immelt is headed for India later this month.\nDescribing India as a “growth engine for Asia”, Immelt said there is huge manufacturing potential in the country.\nGE, which has diverse business interests spanning from manufacturing to healthcare, is keen to bolster its partnership with India and wants to be part of efforts to make the country a global manufacturing destination.\n“India is a growth engine for Asia, and we see huge potential for the country in the manufacturing space,” Immelt, the Chairman and CEO, said in a statement.\n“Infrastructure is a key driver of India’s growth. We are keen to invest much more in India and in projects to boost its infrastructure in sectors such as rail, power and healthcare. These efforts will have a ripple effect on the overall economic growth in India and beyond,” he noted.\nGE has doubled its investment in the country over the last five years and the group is ensuring that investments and jobs created in India support the ‘Make in India’ initiative, the statement said.\n“Over the last five years, GE has doubled its investment in India and delivered approximately USD 3 billion in economic value. The investments have ranged from supplier development programmes to new, large infrastructure projects and manufacturing facilities,” it added.\nIt is also partnering with various Indian states for public-private partnerships and in the healthcare segment, GE already has PPPs with seven states.\n“GE is further exploring a similar partnership with Bihar where GE feels that it can make a substantial difference,” the statement said.\nEarlier this year, GE announced a USD 200 million investment in the multi-modal manufacturing facility in Pune, Maharashtra.\nThe facility delivers localised products and solutions for Indian customers while also feeding GE’s global supply chain. These investments supported the growth and development of over 1,000 suppliers in India, the statement read.\nGE’s Indian manufacturing facilities as well as the multi modal manufacturing facility in Pune are being leveraged as the global supply source for many of the group’s businesses such as aviation, turbo machinery, wind turbines and diesel locomotives.\n 04, 2015 5:07 pm", "external_links": [], "published": "2015-09-05T01:07:00.000+03:00", "crawled": "2015-09-04T18:43:39.763+03:00", "highlightTitle": ""}