{"organizations": [], "uuid": "36d0157730afc672e21c686ca8ff65f0819fc746", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "articles.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/48987848.cms", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358311.cms", "section_title": "Finance-Banking/Finance-Industry-The Economic Times", "url": "http://articles.economictimes.indiatimes.com/2015-09-16/news/66604597_1_mobile-wallet-spice-digital-remittances", "country": "IL", "title": "Spice Digital launches m-wallet SpiceMudra, focus on remittances", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Spice Digital launches m-wallet SpiceMudra, focus on remittances - timesofindia-economictimes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "36d0157730afc672e21c686ca8ff65f0819fc746"}, "author": "timesofindia.indiatimes.com", "url": "http://articles.economictimes.indiatimes.com/2015-09-16/news/66604597_1_mobile-wallet-spice-digital-remittances", "ord_in_thread": 0, "title": "Spice Digital launches m-wallet SpiceMudra, focus on remittances", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI: Spice Digital, a subsidiary of Spice Connect, has launched mobile wallet 'SpiceMudra' which will focus on domestic remittances. The launch of wallet comes after the company received licence from the Reserve Bank of India to operate semi-closed pre-paid payment instruments (PPI) in May.\nSpeaking to ET, Sakat Agarwal, Global CEO of Spice Connect said \"Spice Digital has 3000 retail outlets across India that facilitate remittance service using Spice Mudra. Eventually we plan to scale up the business to facilitate bill payments, mobile recharge and ticket booking.\"\nHe said that there will be great synergy between Spice Connect and Spice Digital since the parent company also manufactures handsets. \"Soon the mobile wallet will be integrated with the handset enabling easy payment for their customers.\" He said that volumes in remittance business is growing rapidly. \"We are seeing an average ticket size of Rs 3500 per person and remittances of Rs 1 crore in a day. Customers can deposit cash at any of these outlets, which will then be remitted to their family or friend's bank accounts instantly.\nIn a statement issued to media, Sakat said, \"We will also focus on collaborating with state governments and private enterprises for paperless money transfers and reimbursements.\"\nIn the last quarter, several banks and e-commerce companies have launched mobile wallets such as Freecharge wallet from Snapdeal and Lime wallet from Axis Bank . \n ", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-22T10:43:45.832+03:00", "highlightTitle": ""}