{"organizations": [], "uuid": "16fac83ec2f910f640db9ac69c30f0662d634d03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/us-finds-no-visa-violations-by-infosys-tcs/43323.html", "country": "IN", "title": "US finds no visa violations by Infosys, TCS", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "US finds no visa violations by Infosys, TCS", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T17:29:00.000+03:00", "replies_count": 0, "uuid": "16fac83ec2f910f640db9ac69c30f0662d634d03"}, "author": "IANS", "url": "http://www.moneylife.in/article/us-finds-no-visa-violations-by-infosys-tcs/43323.html", "ord_in_thread": 0, "title": "US finds no visa violations by Infosys, TCS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » US finds no visa violations by Infosys, TCS 43323 US finds no visa violations by Infosys, TCS 0 Comments, Be the first to comment + COMMENT IANS | 08/09/2015 07:59 PM | Indian software majors Infosys Ltd and Tata Consultancy Services Ltd (TCS) on Tuesday said that the US labour department did not find any violation of visa rules by them. \"The US department of labor concluded its investigation, with no violations of compliance found in the applications filed in the Southern California Edison project,\" the $8.7-billion Infosys firm said in a statement here. Similarly, TCS said audits by the US labor department from time to time found it had always been compliant. \"We attach highest importance to a strict compliance programme and abides by all regulatory requirements and visa laws,\" a TCS spokesperson said from Mumbai. In all, the department reviewed 145 files and found no violations by Infosys or TCS. \"We are a responsible participant in the H-1B programme and do not practice or condone unfair and unethical visa practices, as our priority is to operate fairly, ethically and with integrity,\" nfosys' Americas head Sandeep Dadlani said in the statement. The city-based IT outsourcing major also said that it was recruiting and hiring in the US, which was facing shortage of technology skills. Offering to cooperate with any future government agency inquiries to demonstrate its commitment to compliance, company's chief compliance officer David Kennedy said its immigration compliance programme was robust, as evident from positive verification from the state department. The labour department in June opened the investigation against TCS and Infosys for possible violations of visa rules for foreign technology workers under contracts they held with electric utility Southern California Edison. The power utility had laid-off about 500 tech workers amid claims that many of them were made to train their replacements who were immigrants on temporary work visas brought in by the Indian IT firms. H1-B visas, which permit foreign nationals to work in the US for a maximum of six years, are granted to overseas firms for sending their skilled employees to work on onsite projects of their clients across North America. Both the IT bellwethers have hundreds of their techies working in the US firms on H-1B or L-1 (temporary) visas, generating over 60 of their export revenues. \"The labor department regularly selects a percentage of visa and labour condition applications for extra scrutiny in this (IT) industry. We work closely with the department to assist it in this activity in the ordinary course of our business,\" said Infosys. Echoing the stand of Infosys and TCS, a top official of the IT industry representative body Nasscom said a deliberate attempt was being made to project the Indian IT sector wrongly without considering their commitment to compliances and contribution to the US enterprises. \"Indian software firms have been complying with the US visa regulations and cooperating with the US labor department in responding to any query on judicious use of its visas,\" Nasscom president R. Chandrashekhar told IANS from New Delhi.", "external_links": [], "published": "2015-09-08T17:29:00.000+03:00", "crawled": "2015-09-08T18:13:58.050+03:00", "highlightTitle": ""}