{"organizations": [], "uuid": "c2178f090ae2ad4b206592d886160f587e627dc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiplinger.com", "main_image": "http://www.kiplinger.com/kipimages/pages/13913.jpg", "site_section": "http://www.kiplinger.com//about/rss/kiplinger.rss", "section_title": "Kiplinger's Personal Finance", "url": "http://www.kiplinger.com/article/taxes/T065-C000-S002-same-sex-marriage-affects-taxes-social-security.html?rss_source=rss", "country": "US", "title": "How Same-Sex Marriage Affects Taxes, Social Security Benefits", "performance_score": 0, "site": "kiplinger.com", "participants_count": 0, "title_full": "How Same-Sex Marriage Affects Taxes, Social Security Benefits", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T07:00:00.000+03:00", "replies_count": 0, "uuid": "c2178f090ae2ad4b206592d886160f587e627dc8"}, "author": "", "url": "http://www.kiplinger.com/article/taxes/T065-C000-S002-same-sex-marriage-affects-taxes-social-security.html?rss_source=rss", "ord_in_thread": 0, "title": "How Same-Sex Marriage Affects Taxes, Social Security Benefits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How Same-Sex Marriage Affects Taxes, Social Security Benefits What you gain in Social Security benefits, you may lose in taxes. Follow @sandyblock Thinkstock \nKathryn Hamm and Amy Walter of Arlington, Va., have been married twice—both times to each other. In 1999, they exchanged vows at a ceremony on Maryland’s Eastern Shore, even though same-sex marriage was not yet legally recognized in Maryland. See Also: What the Marriage Equality Decision Means for Social Security Benefits \nIn 2013, after the Supreme Court overturned the federal Defense of Marriage Act, they repeated their vows in a Washington, D.C., courtroom, with their son, Caleb, now 8, as the best man. “We’ve considered ourselves married for a long time, but we needed to take care of the legal business,” says Hamm. \nSince the Supreme Court ruled this year that same-sex couples have a consti­tutional right to marry in every state, many other couples are expected to follow Hamm and Walter’s example. Whether you plan to make your union legal or choose to remain unmarried, here are some financial issues to consider. \nTaxes. Since 2013, the IRS has considered same-sex couples who were legally married in any state to be married—even if they lived in a state that didn’t recognize gay marriage. For the latter group, that required some tax-filing jujitsu. Because states typically base their tax returns on federal tax returns, those couples had to create “dummy” federal returns as single filers before they could complete their state returns. Advertisement \nFrom now on, same-sex married couples will be able to file jointly at the federal and state level. That should save money on tax-preparation costs, but it’s not much solace if you end up with a higher tax bill because of the so-called marriage penalty. The penalty kicks in when a couple filing a joint return pay a higher tax bill than they would have filing as two singles. It typically affects spouses who are both in the 28% tax bracket or higher. \nIf you’re planning to get married before year-end, you may need to adjust your withholding to avoid underpayment penalties, says Scott Grenier, vice president of Baird’s private wealth management group. Your combined income could also make you ineligible to contribute to a Roth IRA or to deduct contributions to a traditional IRA. \nSocial Security. Before the Supreme Court’s ruling this year, it was unclear whether married couples who lived in the 13 states that pro­hibited same-sex marriage were eligible for Social Security spousal and sur­vivor benefits, says Colleen Carcone, wealth planning director for TIAA-CREF. Now, all married same-sex couples can take advantage of strategies that could increase their overall benefits, such as file-and-suspend (see Strategies to Boost Social Security Benefits ). Same-sex spouses are also eligible for a share of a spouse’s veterans’ and pension benefits. \nEstate planning. A surviving spouse of a same-sex marriage can inherit an un­limited amount of assets without paying federal estate taxes. Spouses can also combine their estate-tax exemption, shielding more than $10.8 million from federal estate taxes. The marital exemption is even more valuable in states that have lower estate or inheritance tax thresholds. For example, Nebraska (one of the states that prohibited same-sex marriage before the Supreme Court ruling) imposes an 18% inheritance tax on nonrelatives who receive bequests valued at more than $10,000. But surviving spouses can inherit an unlimited amount of assets tax-free.", "external_links": [], "published": "2015-09-09T07:00:00.000+03:00", "crawled": "2015-09-09T15:19:34.970+03:00", "highlightTitle": ""}