{"organizations": [], "uuid": "52cd0177ba451a451380805f34ff0e488d5d5d90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/09/09/12949239/petfirst-logo-150x75.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12949239.htm", "country": "US", "title": "PetFirst Pet Insurance Offers Savings to NPP Members", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "PetFirst Pet Insurance Offers Savings to NPP Members", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "52cd0177ba451a451380805f34ff0e488d5d5d90"}, "author": "Sara McClenathan", "url": "http://www.prweb.com/releases/2015/09/prweb12949239.htm", "ord_in_thread": 0, "title": "PetFirst Pet Insurance Offers Savings to NPP Members", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "National Purchasing Partners (NPP) and PetFirst Pet Insurance are now working together to offer an even broader array of benefits to NPP member companies and their employees. This highly competitive agreement will provide members discounts on pet insurance, a rapidly expanding area of the insurance industry. As veterinary bills continue to rise, more pet owners are relying on insurance to help cover the cost of caring for their dogs and cats. In the business since 2004, PetFirst is the fastest-growing pet health insurance company in the country, and has helped thousands of families pay for their pets’ veterinary care. The 10 percent discount offered through NPP makes pet insurance even more affordable.\n“This agreement reflects our desire to offer valuable discounts to our members and their employees,” says NPP Director of Business Development, Lindsey Neste. “We have many pet owners in the office who are excited to protect their pets like they would any other member of their family.”\nNPP helps thousands of companies and associations save time and money through its portfolio of discount pricing contracts. The partnership with PetFirst adds to NPP’s employee discount program, which allows member companies to pass savings opportunities to their employees.\n“We are proud to partner with NPP and offer its pet parents comprehensive pet insurance coverage to help with rising veterinary costs,” said Clint Lawrence, vice president of sales and marketing at PetFirst. “NPP is a pioneer in the space and this partnership shows they are committed to offering benefits for their members' entire family— including beloved pets.”\nTo learn more about this new contract, visit the NPP website. If your organization is not already an NPP member, you can join at no cost and there is no obligation to purchase. For more information visit: http://www.mynpp.com or call 800.810.3909.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5teW5wcC5jb20="], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-10T10:42:23.086+03:00", "highlightTitle": ""}