{"organizations": [], "uuid": "d4aea3ce8274cd68668d4ac0c0dc561babc69b6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509260282.html", "country": "US", "title": "Kenya: Brookside to Slash Prices Paid to Milk Producers", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Brookside to Slash Prices Paid to Milk Producers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T22:51:00.000+03:00", "replies_count": 0, "uuid": "d4aea3ce8274cd68668d4ac0c0dc561babc69b6a"}, "author": "", "url": "http://allafrica.com/stories/201509260282.html", "ord_in_thread": 0, "title": "Kenya: Brookside to Slash Prices Paid to Milk Producers", "locations": ["Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Kariuki"], "text": "By James Kariuki \nBrookside Dairy will reduce its milk producer prices by Sh4 from next month. \nIn a message sent to all farmers, Brookside which controls about 44 per cent market share, attributed the drop to prevailing market conditions. \nBrookside Dairy has been paying Sh35, Sh33, and Sh31 per kilo to Murang'a, Nyandarua and Nakuru farmers respectively. \nDairy farmers are paid according to the composition of the raw milk components (butterfat, protein and other solids) of their milk. \nAdditionally, farmers also pay transport charges with those in Nyandarua parting with Sh3 per kilo and double that in Nyandarua. \nThe move by Brookside Dairy could trigger a fall in milk producer prices. \nBrookside has in the past pushed up producer prices forcing other processors to increase prices to retain their markets. \n\"The price slash is punitive. Transporters charge up to Sh6 per kilo in Nakuru and we're left with a paltry Sh25 for every kilo sold,\" said Esther Kamuiru, a Nakuru dairy farmer. Kenya \nThe Employment and Labour Relations Court Friday broke the stalemate over teachers' pay by directing them to return to … see more » Copyright © 2015 The Nation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-26T22:51:00.000+03:00", "crawled": "2015-09-27T05:36:51.361+03:00", "highlightTitle": ""}