{"organizations": [], "uuid": "362ec3d3c4e21041a446747d44bed7dd2db2deac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/09/16/12966052/TopEntrepreneurs.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12966052.htm", "country": "US", "title": "Invoiceware International Honored with Three Awards Recognizing Entrepreneurial Leadership and Company Culture", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Invoiceware International Honored with Three Awards Recognizing Entrepreneurial Leadership and Company Culture", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "362ec3d3c4e21041a446747d44bed7dd2db2deac"}, "author": "Jennifer Blackburn", "url": "http://www.prweb.com/releases/2015/09/prweb12966052.htm", "ord_in_thread": 0, "title": "Invoiceware International Honored with Three Awards Recognizing Entrepreneurial Leadership and Company Culture", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Invoiceware International , the leader in Latin American electronic invoicing and fiscal reporting, was honored with three awards in September for exceptional leadership and company culture. On September 10, the Atlanta Business Chronicle recognized the company as a Best Place to Work based on its high level of employee engagement. Following this recognition, Scott Lewin, CEO at Invoiceware International, was named a Stevie® Award winner at the American Business Awards’ new product and technology awards banquet on September 11, and a top entrepreneur at TiECON Southeast 2015 on September 12. “It is a great honor to be recognized at both the national and local levels for the entrepreneurial spirit that has driven our outstanding culture and growth at Invoiceware International,” said Lewin. “Collectively, these awards highlight the value of our company beyond our technology solution. It’s our team and our shared focus that have allowed us to achieve tremendous success in just a few short years.”\nAtlanta Business Chronicle – Best Places to Work 2015\nThe annual Best Places to Work award is determined by the Atlanta Business Chronicle in partnership with Quantum Workplace, and is based on anonymous surveys completed by company employees. Invoiceware was recognized for its internal company culture, commitment to employee growth as well as its unique approach to fostering professional development.\nThis is the second time the Atlanta Business Chronicle has honored Invoiceware this year. In April, the company was named one of Atlanta’s fastest-growing companies at the Pacesetter Awards .\nThe American Business Awards – Executive of the Year\nThe American Business Awards are the nation’s premier business awards program. All organizations operating in the United States are eligible to submit nominations – public and private, for-profit and non-profit, large and small.\nAt the first annual new product and technology awards banquet, Lewin received a Stevie for Executive of the Year in the computer software and solutions category. This is Invoiceware’s third American Business Award in 2015. In July, the company received recognition in the Financial Services Company of the Year and IT Professional of the Year categories.\nTiE Atlanta – Top Entrepreneur Award 2015\nTiE Atlanta, an organization fostering entrepreneurship globally, named Lewin a top entrepreneur at TiECON Southeast 2015 on September 12. The inaugural award program recognizes entrepreneurial successes based on company growth, profitability, sustainability, strategy, management style, innovation and culture.\n\"Scott Lewin is a forward-thinking entrepreneur with a talent for developing a company culture that fosters growth and innovation,\" says TiE Atlanta President Karen Robinson. “Invoiceware made the commitment do delve into the complexities of compliance when doing business with Latin America and Scott has ensured that they are now experts in compliance best practices. His insights have resulted in tremendous cost savings for their clients. The judges at TiE were impressed with Scott's focus on customer need, the attention to quality and the impressive results Invoiceware International, one of Atlanta's fastest-growing FinTech companies, has achieved under his leadership.\"\n“Our unique approach to developing a team of talented, dedicated professionals is certainly a force to be reckoned with,” Lewin concluded. “I am very proud to share these awards with the entire Invoiceware team – both in the U.S. and abroad – and look forward to our continued expansion.”\n###\nAbout Invoiceware International\nInvoiceware International standardizes complex compliance regulations in Latin America for the world’s largest companies, including The Coca-Cola Company, Philips, Kellogg, DuPont and Siemens. As the largest regional business network, Invoiceware reduces the risk and cost of maintaining compliance, empowering its clients to capitalize on government standardized e-invoicing to improve supply chain efficiency and optimize cash flow. Invoiceware International is based in Atlanta with operations covering Brazil, Mexico, Chile, Peru, Colombia, Ecuador, Uruguay and Argentina. For more information, visit invoicewareint.com and follow @InvoicewareInt on Twitter.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5pbnZvaWNld2FyZWludC5jb20=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5pbnZvaWNld2FyZWludC5jb20vbmV3cy1ldmVudHMvaW52b2ljZXdhcmUtaW50ZXJuYXRpb25hbC1lYXJucy1hdGxhbnRhLWJ1c2luZXNzLWNocm9uaWNsZS1wYWNlc2V0dGVyLWF3YXJkLWZvci1yZWNvcmQtZ3Jvd3Ro", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly90d2l0dGVyLmNvbS9JbnZvaWNld2FyZUludA=="], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T17:33:20.761+03:00", "highlightTitle": ""}