{"organizations": ["Inc."], "uuid": "48402dac3d7edf2e9821731cbb4117ce8541a546", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l1.yimg.com/bt/api/res/1.2/UM6oLA7i4iwjB4eh8Hnwgg--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://globalfinance.zenfs.com/en_us/Finance/BUSINESSWIRE/ab4703902d6dbc353cc851f64bbb3812.cf.png", "site_section": "http://finance.yahoo.com/rss/EducationTrainingServices", "section_title": "Yahoo! Finance: Education & Training Services Industry News", "url": "http://finance.yahoo.com/news/ryder-steps-close-diesel-technical-210500453.html", "country": "GB", "title": "Ryder Steps Up to Close Diesel Technical Skills Gap by Underwriting Scholarships", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Ryder Steps Up to Close Diesel Technical Skills Gap by Underwriting Scholarships", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T00:05:00.000+03:00", "replies_count": 0, "uuid": "48402dac3d7edf2e9821731cbb4117ce8541a546"}, "author": "", "url": "http://finance.yahoo.com/news/ryder-steps-close-diesel-technical-210500453.html", "ord_in_thread": 0, "title": "Ryder Steps Up to Close Diesel Technical Skills Gap by Underwriting Scholarships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Liberty Coleman"], "text": "Ryder Steps Up to Close Diesel Technical Skills Gap by Underwriting Scholarships Company Donates $20,000 to Promote Careers as Skilled Technicians Ryder System, Inc. 5 minutes ago  . View photo (From left to right): Next Top Tech Challenge third place winner Liberty Coleman; second place winner … \nMIAMI--(BUSINESS WIRE)-- \nRyder System, Inc. (NYSE: R ), a leader in commercial fleet management , dedicated transportation , and supply chain solutions, has donated $20,000 to the Universal Technical Institute Foundation to help meet the urgent and growing demand for trained diesel technicians. The funds will support students who attend the Universal Technical Institute (UTI) campus in Lisle, Illinois. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150917006504/en/ \nTWEET THIS: Ryder donates $20K to @UTITweet Foundation to help meet growing demand for diesel techs \n“As companies continue to outsource their fleet management and supply chain services to Ryder, demand for expert maintenance technicians will only increase,” said Dennis Cooke, President of Global Fleet Management Solutions, Ryder. “This donation demonstrates to our customers that we are actively working to support one of the nation’s leading providers of highly trained transportation service technicians in their efforts to develop future talent.” \nAs part of its relationship with UTI, Ryder held a “Next Top Tech Challenge” at the UTI-Lisle campus. Nine UTI students worked alongside Ryder technicians to participate in three technical challenge stations and took a written exam to test their knowledge and skills based on various mechanical failures and solutions. Warren Hindriks was named the first place winner, and was awarded an internship at Ryder. The second place winner was Wilmer Leon, and Liberty Coleman was the third place winner. As winners of the Next Top Tech Challenge, all three students earned tuition scholarship awards ranging from $2,500 to $1,000. Funding for the scholarships came from Ryder’s $20,000 donation to the school. \n“The automotive and diesel technicians we train can diagnose, repair, and maintain the complex, high-tech systems that power today’s vehicles and play a critical role in helping companies manage the costs of their fleet and transportation systems,” said Ian Hardie, Employment Services Director, UTI-Lisle. “Organic growth in the industry and the looming retirement of Baby Boomer employees means the demand for these highly skilled employees has never been stronger.” \nAccording to the U.S. Bureau of Labor Statistics, individuals with specialized skills are in high demand. The nation will need 1.2 million automotive, diesel, collision repair, motorcycle, and marine service technicians by 2022. According to government projections, this will mean an average of 37,000 job openings annually. \nIn Illinois specifically, the Department of Employment Security projects a nine percent growth in the need for vehicle and mobile equipment technicians by 2022, with an average of 2,200 annual statewide job openings every year. \nAt the same time, the increasing complexity of modern vehicles, rising compliance costs, and the move toward green technology mean many companies are outsourcing their fleet management and supply chain services to third-party companies with specific expertise, like Ryder. \n“Companies turn to Ryder to solve their transportation and logistics challenges and because they can count on us to deliver strong, reliable service,” said Mr. Cooke. “Technicians are on the front lines of our commitment to our customers, and we rely on schools like UTI to train them. Contributing scholarship funds to the UTI Foundation is an investment that makes sense for our business.” \nRyder employs 5,400 trained technicians. To search for available technician positions in your area, visit http://www.ryder.com/en/career/opportunities/technicians/technicians-info.aspx . About Ryder \nRyder is a FORTUNE 500® commercial fleet management, dedicated transportation, and supply chain solutions company. Ryder’s stock (NYSE:R) is a component of the Dow Jones Transportation Average and the Standard & Poor’s 500 Index. Ryder has been named among FORTUNE ’s World’s Most Admired Companies, and has been recognized for its industry-leading practices in third-party logistics, environmentally-friendly fleet and supply chain solutions, and world-class safety and security programs. The Company is a proud member of the American Red Cross Disaster Responder Program, supporting national and local disaster preparedness and response efforts. For more information, visit www.ryder.com , and follow us on our Online Newsroom , Facebook , LinkedIn , Twitter , and YouTube . About Universal Technical Institute Foundation \nA 501(c)(3) nonprofit, the Universal Technical Institute Foundation encourages and supports students pursuing post-secondary technical education and careers in the transportation industry. The Foundation distributes more than $1 million in scholarships and grants annually, thanks to its generous corporate sponsors and donors. For more information visit www.utifoundation.net . About Universal Technical Institute, Inc. \nHeadquartered in Scottsdale, Arizona, Universal Technical Institute, Inc. ( UTI ) is the leading provider of post-secondary education for students seeking careers as professional automotive, diesel, collision repair, motorcycle and marine technicians. With more than 190,000 graduates in its 50-year history, UTI offers undergraduate degree and diploma programs at 12 campuses across the United States, as well as manufacturer-specific training programs at dedicated training centers. Through its campus-based school system, UTI provides specialized post-secondary education programs under the banner of several well-known brands, including Universal Technical Institute (UTI), Motorcycle Mechanics Institute and Marine Mechanics Institute (MMI) and NASCAR Technical Institute (NASCAR Tech). For more information visit www.uti.edu . Like UTI on www.facebook.com/UTI or follow UTI on Twitter @UTITweet , @MMITweet , and @NASCARTechUTI . \nUTI has operated a campus in Illinois for 26 years, and relocated to a new state-of-the-industry facility in Lisle in 2013. The campus offers a variety of program configurations in the automotive and diesel fields. \nNote Regarding Forward-Looking Statements: Certain statements and information included in this news release are \"forward-looking statements\" within the meaning of the Federal Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on our current plans and expectations and are subject to risks, uncertainties and assumptions. Accordingly, these forward-looking statements should be evaluated with consideration given to the many risks and uncertainties that could cause actual results and events to differ materially from those in the forward-looking statements including those risks set forth in our periodic filings with the Securities and Exchange Commission. New risks emerge from time to time. It is not possible for management to predict all such risk factors or to assess the impact of such risks on our business. Accordingly, we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. View source version on businesswire.com: http://www.businesswire.com/news/home/20150917006504/en/", "external_links": [], "published": "2015-09-18T00:05:00.000+03:00", "crawled": "2015-09-18T00:13:57.424+03:00", "highlightTitle": ""}