{"organizations": [], "uuid": "6459824e82ecbab95bcd7e85d8f158f687510f0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-mortgages/?format=rss", "section_title": "Mortgages News | Headlines - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/barclays-talks-sell-italian-network-170937910.html", "country": "GB", "title": "Barclays in talks to sell Italian network and mortgages -sources", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Barclays in talks to sell Italian network and mortgages -sources", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T20:09:00.000+03:00", "replies_count": 0, "uuid": "6459824e82ecbab95bcd7e85d8f158f687510f0b"}, "author": "", "url": "https://uk.finance.yahoo.com/news/barclays-talks-sell-italian-network-170937910.html", "ord_in_thread": 0, "title": "Barclays in talks to sell Italian network and mortgages -sources", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds sale of Barclays Italian retail network, names of bidders for Italian mortgage portfolio) \nBy Massimo Gaia and Pamela Barbaglia \nMILAN/LONDON, Sept 10 (Reuters) - Barclays (LSE: BARC.L - news ) is in advanced talks to sell its Italian retail network and a portfolio of Italian mortgages worth 4 billion euros ($4.46 billion) in two separate auctions, people familiar with the process said. \nThe British bank, which is shrinking its continental Europe business, aims to enter exclusive talks with prospective bidders in the coming weeks, one of the sources said. \nThe decision to sell the Italian retail unit and the mortgage portfolio to separate buyers is to maximise value, after strong interest from U.S (Other OTC: UBGXF - news ) . asset managers and hedge funds for the mortgages, which are all performing, one of the sources said. \nU.S. asset manager Fortress, which bought UniCredit (EUREX: DE000A163206.EX - news ) 's non-performing loans management firm and a parcel of its distressed loans in February, is one of the interested buyers, as is U.S. private equity firm Cerberus Capital Management, the source told Reuters on condition of anonymity. \nAnother source had said on Wednesday that U.S. money manager Christofferson, Robb & Company, as well as a duo comprising U.S. hedge fund Elliot Management and Italian credit firm Fonspa, and a bidding group made up of private equity firm Oaktree and Italian bank Creval were also looking to buy the mortgages. \nA spokeswoman for Barclays in Italy and representatives for all the potential bidders declined to comment. \nBarclays has also shortlisted two undisclosed banking institutions, one of which is Italian, to buy its local retail banking network, the first source said. Barclays aims to recapitalize the unit before selling it, he said. \nBarclays has reduced its Italian network to about 90 branches, from 200 in 2010. It (Other OTC: ITGL - news ) had 11.9 billion pounds ($18.3 billion) of residential mortgage exposure in Italy at the end of June, down from 13.5 billion pounds at the start of the year. \nThe bank said last year it planned to sell its continental European retail banking operations and had put them in a non-core unit with other assets it intended to sell or run down. \nBarclays has sold its retail banking operations in Spain and Portugal - but kept some activities, such as investment banking and credit cards - and is still looking to sell assets in France. ($1 = 0.6513 pounds) (Additional reporting by Luca Trogni in Milan and Steve Slater in London; Editing by Susan Fenton)", "external_links": [], "published": "2015-09-10T20:09:00.000+03:00", "crawled": "2015-09-10T20:41:41.770+03:00", "highlightTitle": ""}