{"organizations": [], "uuid": "cd54036d4a9f1d7257e11fe4853237e2d944e003", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KF120_0908un_G_20150908205953.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/ceos-ouster-unlikely-to-ease-uniteds-woes-at-newark-airport-1441931434", "country": "US", "title": "CEO’s Ouster Unlikely to Ease United’s Woes at Newark Airport", "performance_score": 0, "site": "wsj.com", "participants_count": 2, "title_full": "CEO’s Ouster Unlikely to Ease United’s Woes at Newark Airport - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T05:17:00.000+03:00", "replies_count": 1, "uuid": "bf4eb3f6c722f603c04f7a583d3c35936ed3e9f1"}, "author": "Susan Carey", "url": "http://www.wsj.com/articles/ceos-ouster-unlikely-to-ease-uniteds-woes-at-newark-airport-1441931434#post-0", "ord_in_thread": 0, "title": "CEO’s Ouster Unlikely to Ease United’s Woes at Newark Airport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS United Continental Holdings Inc. UAL -1.34 % ’s former chief executive, Jeff Smisek , pressed for years to improve conditions at its hub at Newark Liberty International Airport. His ouster may not make the airline’s struggle any easier.\nUnder Mr. Smisek, the world’s No. 2 airline by traffic pushed the Port Authority of New York and New Jersey for lower rent and enhanced facilities, including a new maintenance hangar at Newark. It also wanted the authority to build an extension of its PATH rail line to the airport to make it easier for travelers from lower Manhattan to get there.\nThose efforts were already faltering before United said on Tuesday that Mr. Smisek had been replaced as the result of an internal investigation prompted by a federal corruption probe of the Port Authority and its former chairman, David Samson.\nHis ouster is prompting more public scrutiny of United’s dealings with the authority. Three New Jersey state senators on Thursday called on the authority to halt all spending on the PATH extension project, citing federal prosecutors’ investigation into Mr. Samson and United.\nThe authority’s most recent capital-spending plan includes some money for the extension, but the project isn’t fully funded, and some observers already were skeptical about further allocations as the Port Authority tries to cover other pressing investment priorities.\nRelated\nUnited Continental\nUnravels Image From Former CEO Jeff Smisek United declined to comment on its dealings with the Port Authority or its plans for Newark. Nor has the company provided any details on the board deliberations that led to Mr. Smisek’s departure.\nPeople familiar with the situation said Thursday that the board decided to replace Mr. Smisek several weeks ago. The airline didn’t announce the move until Tuesday, however, partly because it needed time to negotiate his exit package, one of the people said.\nNewark is the most-profitable of United’s seven major hubs, but it is facing growing competition from major rivals in the critical New York market, which also has two other major airports run by the Port Authority. United offers 385 daily flights from Newark and handles about 12.4 million passengers there a year, or about 68% of the total.\nDelta Air Lines Inc., DAL 1.04 % the nation’s No. 3 carrier, handles 24 million passengers annually and offers more than 500 flights a day across New York’s John F. Kennedy International and La Guardia airports, having vastly expanded at both in the past few years. It also is gearing up for a major renovation at aging La Guardia.\nAmerican Airlines Group Inc., AAL 0.51 % the biggest U.S. carrier, has bulked up in New York through its merger in late 2013 with US Airways. And JetBlue Airways Corp. JBLU 2.01 % , a discounter that took wing at JFK in 2000, has grown substantially.\nUnited inherited Newark in its 2010 merger with Continental Airlines, which Mr. Smisek led before the combination. Continental, a longtime player there, was for years the top airline in the New York area.\nBut a person familiar with United’s discussions with the Port Authority said the airline is feeling squeezed in New York. They had “Delta bracketing one side and American on the other, and United in the middle, just rolling around,” this person said.\nUnited did make some headway. In addition to the partial funding for the PATH extension, the hangar was later approved. But other efforts to press its case on its Newark lease to Mr. Samson and Bill Baroni, another former Port Authority official, came to naught as both men were eventually consumed in the widening federal investigation. The probe was triggered by a political scandal over lane closures two years ago on the George Washington Bridge, which connects New York and New Jersey.\nAfter years of discussions with Port Authority executives about the high cost of operating out of Newark, United filed a protest with the Federal Aviation Administration last December that accused the authority of charging airlines excess fees at the airport and of improperly redirecting airport revenues to other uses.\nThe Port Authority said the complaint, which is pending before the FAA, has no merit.\nBolstering Newark is one of many big challenges facing Mr. Smisek’s replacement as CEO, Oscar Munoz, former president of railroad operator CSX Corp. CSX 0.76 % and a longtime United board member.\nMr. Munoz “can’t take his eye off the New York market because it’s critical for any national player,” said John Thomas, head of the global aviation practice at L.E.K. Consulting. “That is clearly demonstrated by the level of investment Delta is putting into New York.” But getting its wish list at Newark may not be easy for United because of the Port Authority’s dysfunction, Mr. Thomas said.\nMeanwhile, Newark is only getting more important for United. Next month it plans to shift its small fleet of luxury planes serving Los Angeles and San Francisco to Newark from JFK. The move is aimed at making the planes more easily available to its best Newark customers and pulling out of what had been a money-losing business at JFK for the past seven years.\n— Joann S. Lublin contributed to this article.\nWrite to Susan Carey at susan.carey@wsj.com and Ted Mann at ted.mann@wsj.com", "external_links": [], "published": "2015-09-11T05:17:00.000+03:00", "crawled": "2015-09-11T06:17:08.414+03:00", "highlightTitle": ""}