{"organizations": [], "uuid": "41f28b0972b613ad283e74bf160fa9503e025167", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trump_1.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/254379-trump-bush-attack-tax-break-but-not-gop-lawmakers", "country": "US", "title": "Trump, Bush attack tax break, but not GOP lawmakers", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trump, Bush attack tax break, but not GOP lawmakers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T13:00:00.000+03:00", "replies_count": 0, "uuid": "41f28b0972b613ad283e74bf160fa9503e025167"}, "author": "iswanson@thehill.com (Bernie Becker)", "url": "http://thehill.com/policy/finance/254379-trump-bush-attack-tax-break-but-not-gop-lawmakers", "ord_in_thread": 0, "title": "Trump, Bush attack tax break, but not GOP lawmakers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump, Bush attack tax break, but not GOP lawmakers By Bernie Becker - 09/22/15 06:00 AM EDT \nDonald Trump and Jeb Bush might be against them, but advocates of the so-called carried interest tax break believe they’re safe — for now. \nGOP lawmakers are currently showing no interest in including one of Wall Street’s favorite tax breaks in looming budget negotiations, despite new pleas from Democrats and the opposition from perhaps the two most prominent Republican presidential candidates. ADVERTISEMENT But top Republicans have been clear that they’re willing to discuss getting rid of the preference in broader tax reform, if and when that ever happens. And with Trump and Bush on their side, Democrats are more convinced than ever that they’ve got the political upper hand on an issue that illustrates the populist mood of the day.\nThe tax break’s supporters acknowledge those long-term concerns. But they’re also seeking to tamp down any idea that there’s widespread bipartisan support for raising taxes on private equity, venture capital, real estate and some hedge fund managers, instead suggesting that support among Republicans was only among presidential candidates seeking to distinguish themselves from the pack. \nJames Maloney, a spokesman for the Private Equity Growth Capital Council, noted that at least for now the group has important figures like Senate Finance Committee Chairman Orrin Hatch (R-Utah) and House Ways and Means Committee Chairman Paul Ryan (R-Wis.) on their side. \n“Calling this bipartisan — that begins and ends with a few candidates on the campaign trail,” said Maloney. “An overwhelming majority of Senate and House Republicans, and some Democrats, support the current tax treatment of carried interest.” SPONSORED CONTENT By Intuit \nMeaningful tax reform starts with tax simplification. Read More \nAt its core, the questions surrounding carried interest center on whether to tax certain investments held longer than a year at the lower capital gains rate, which tops out at 23.8 percent, or at an individual rate in the neighborhood of 40 percent. \nDemocrats and other opponents of the current setup argue that, in many cases, the money managers in question are handling other people’s money — and thus should get hit with the higher tax rate. \nPrivate equity executives, for instance, usually get 20 percent of the profits from companies they take over. The sector’s lobbyists say changing the way those profits are taxed undercuts the longstanding American tradition of entrepreneurs taking risks. Conservative economists in particular generally object to raising taxes on investment income, arguing that the tax code should incentivize saving. \nFormer House Ways and Means Committee Chairman Dave Camp (R-Mich.) — much to private equity and venture capital’s chagrin — did tax carried interest as ordinary income in his 2014 tax reform plan, though he also exempted real estate. \nRepublican tax writers on Capitol Hill say they’d be willing to consider changes to carried interest, to ensure that only investors risking their own money get the lower capital gains rate, as part of a comprehensive plan that also lowered individual tax rates. \n“I think we have to be wise and not just jump on things just because it sounds good at the time,” said Hatch. \nBut that sort of tax reform plan also won’t come together until 2017, at the earliest, and Republicans say they won’t be swayed by Democrats like Sen. Charles Schumer (N.Y.) to use carried interest to help bust the spending caps enacted in the 2011 debt limit deal. \n“I don’t think that kind of thing happens in a vacuum. I think it happens in the context of overall tax reform,” said Sen. John Thune (S.D.), the number three Republican in the Senate, before adding of Schumer: “I think he wants more money to spend.” \nEven if Democrats face long odds in changing carried interest rules in the next few months, they also believe that an issue they used to great effect against 2012 GOP nominee Mitt Romney — a former private equity executive — is only becoming more potent politically. \nWith concerns about income inequality rising, they’re also betting that, as voters start to tune in more to the presidential campaign, Republicans on Capitol Hill will look silly for not striking a deal on carried interest. \n“The politics around taxes are shifting beneath the Republicans’ feet,” Schumer said at a news conference on Thursday, before adding, “If prominent Republican candidates for president can embrace these plans, Republican leaders here in Washington ought to embrace them as well.” \nSchumer, himself no enemy of Wall Street, has only sharpened his stance on carried interest, after previously opposing efforts to only end the tax treatment for financial executives. \nRepublicans like Trump, and Democrats, often invoke wealthy hedge fund managers when calling to end the tax treatment of carried interest, with Obama previously saying that the 25 leading hedge fund executives earned more than all American kindergarten teachers. \nBut because hedge fund managers often sell their holdings within a year, and thus don’t get the carried interest benefits, they rely on the provision less than private equity and real estate executives. \nStill, the invoking of hedge funds also illustrates the political challenge that those groups face, as Trump’s populist message continues to resonate. Bush’s proposal on carried interest was one of the few nods toward populism in his tax plan, underscoring the bull’s-eye on the provision. And now other GOP candidates are joining the chorus as well, adding to industry concerns. \n“Increasing the tax on carried interest capital gain — as is popular with some politicians these days — would have far-reaching consequences for nearly every real estate partnership in the country,” Jeffrey DeBoer of The Real Estate Roundtable said last week. \nBut Republicans on Capitol Hill say they won’t be convinced, even by their own potential standard-bearers. \n“Every presidential candidate’s floating their ideas. Doesn’t always mean those are the right ideas,” said Rep. Kevin Brady (Texas), a senior Republican on the House Ways and Means Committee. \nBrady said he was especially concerned that rolling back the carried interest preference could hurt the real estate sector, but acknowledged that the rhetoric about hedge funds was having an impact. \n“They’re counting on the American public not knowing. As long as you’re counting on an uninformed public, it’s a pretty powerful talking point,” Brady added. “But it doesn’t make it accurate or right.”", "external_links": [], "published": "2015-09-22T13:00:00.000+03:00", "crawled": "2015-09-22T18:45:37.494+03:00", "highlightTitle": ""}