{"organizations": [], "uuid": "0ddbde8c5a50df95d27f05361846d3d04681e5c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/22/selectcomfort-sleepys-idUSL1N11S2U520150922", "country": "US", "title": "Select Comfort puts Sleepy's defamation lawsuit to rest", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Select Comfort puts Sleepy's defamation lawsuit to rest | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T02:45:00.000+03:00", "replies_count": 0, "uuid": "0ddbde8c5a50df95d27f05361846d3d04681e5c5"}, "author": "Jonathan Stempel", "url": "http://www.reuters.com/article/2015/09/22/selectcomfort-sleepys-idUSL1N11S2U520150922", "ord_in_thread": 0, "title": "Select Comfort puts Sleepy's defamation lawsuit to rest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Sept 22 A federal judge in Long Island, New York on Tuesday dismissed bedding retailer Sleepy's LLC's eight-year-old defamation and breach of contract lawsuit against rival Select Comfort Corp, which makes \"Sleep Number\" adjustable beds.\nU.S. District Judge Joanna Seybert in Central Islip, New York, said Select Comfort did not violate a 2005 contract that let Sleepy's sell Select Comfort's \"Personal Preference\" line of beds, while Select Comfort sold its \"Core\" line in its own stores.\nSleepy's sued after hiring undercover \"secret\" shoppers to visit Select Comfort stores to help determine why sales of Personal Preference beds were proving disappointing.\nIt said the shoppers reported how Select Comfort salespeople would make disparaging remarks about the beds, and that Sleepy's offered inferior sales terms and would not honor warranties.\nBut the judge said Sleepy's read the contract's non-disparagement clause too broadly, and that the record was \"devoid of evidence suggesting that Select Comfort, as a whole, acted in bad faith.\"\nShe also said Hicksville, New York-based Sleepy's was \"substantially motivated\" by the desire to bolster a possible lawsuit against Minneapolis-based Select Comfort in eliciting negative comments, and therefore \"consented\" to them.\nSleepy's and its lawyers did not immediately respond to requests for comment. Select Comfort and its lawyers did not immediately respond to similar requests.\nSeybert ruled seven months after the federal appeals court in New York revived the lawsuit, which a different judge had dismissed in 2012 following a non-jury trial.\nThe case is Sleepy's LLC v. Select Comfort Wholesale Corp et al, U.S. District Court, Eastern District of New York, No. 07-04018. (Reporting by Jonathan Stempel in New York)", "external_links": [], "published": "2015-09-23T02:45:00.000+03:00", "crawled": "2015-09-23T02:04:32.624+03:00", "highlightTitle": ""}