{"organizations": [], "uuid": "ff72565eedf0d615ae466025065c1c8d999d17c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/YhAam9O2iqIr3E3M1S32FQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-09-09T002044Z_1_LYNXNPEB8800B_RTROPTP_3_MARKETS-JAPAN-STOCKS_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/asian-stocks-catch-lift-wall-002044459.html?l=1", "country": "GB", "title": "Global stocks rally as investors scent fresh stimulus", "performance_score": 1, "site": "yahoo.com", "participants_count": 0, "title_full": "Global stocks rally as investors scent fresh stimulus", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T11:45:00.000+03:00", "replies_count": 0, "uuid": "ff72565eedf0d615ae466025065c1c8d999d17c5"}, "author": "", "url": "http://finance.yahoo.com/news/asian-stocks-catch-lift-wall-002044459.html?l=1", "ord_in_thread": 0, "title": "Global stocks rally as investors scent fresh stimulus", "locations": ["Tokyo", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Shino"], "text": "Global stocks rally as investors scent fresh stimulus 17 minutes ago . View photo A pedestrian holding her umbrella is reflected on an electronic board showing the Japan's Nikkei average outside a brokerage in Tokyo, Japan, September 4, 2015. REUTERS/Yuya Shino \nBy Nigel Stephenson \nLONDON (Reuters) - Global shares surged on Wednesday, led by the biggest daily gains in Japan for seven years, helping lift the dollar and oil prices as the prospect of more stimulus from China soothed investors rattled by recent market turmoil. \nThe charge into stocks pushed yields on low-risk government bonds higher, with the rise exacerbated by the anticipation of auctions of German and U.S. 10-year debt later in the day. \nEuropean shares rose, with the pan-European FTSEurofirst 300 index (.FTEU3) up more than 2 percent in early trade. \nThe stock market gains were sparked by a rally in Chinese shares on Tuesday, when weaker-than-expected August trade reinforced investors' expectations that Beijing would act to bolster slowing growth in the world's second-largest economy. \nChina's Finance Ministry said on Wednesday it would strengthen fiscal policy, boost infrastructure spending and speed up tax reform, helping lift Chinese shares for a second day. The Shanghai Composite (.SSEC) closed 2.3 percent higher and the CSI 300 index rose 1.96 percent while Hong Kong's Hang Seng (.HSI) was up 4.5 percent. \nAngus Gluskie, managing director of White Funds Management in Sydney, described Wednesday's stock rally as a \"speculative bounce\". \n\"The market will remain susceptible to a return of negativity until we see signs of some improvement in the original causes of weakness, which were predominantly Chinese growth concerns,\" he said. \nSignals from Prime Minister Shinzo Abe that Japan will cut corporate taxes pushed the Nikkei 225 (.N225) stock index up 7.7 percent, the most it has risen in a day since the depths of the global financial crisis in October 2008. \nMSCI's broadest index of Asia-Pacific shares outside Japan also rallied hard, rising 3.3 percent, with gains across all the major indices. \nEarly indications from U.S. stock index futures (ESc1) were that Wall Street would rally further later in the day. \nInvestors' increased appetite for risk saw the dollar firm against the safe-haven yen and the euro. The single European currency (EUR=) was down 0.2 percent at $1.1182 while the yen was 0.7 percent weaker at 120.66 per dollar. \nNotable gainers in the currency markets were the Australian (AUD=) and New Zealand dollars (NZD=). Both countries are exposed to Chinese growth. \nRISK SENTIMENT \n\"I don't see an end to risk sentiment driving currencies any time soon,\" said Shusuke Yamada, chief Japan FX strategist at Bank of America Merrill Lynch in Tokyo. \n\"It all goes back to China, where opaqueness remains over its currency market, monetary policy and capital controls. The forex market is most on edge about a further possible devaluation of the yuan.\" \nCrude oil prices edged higher. Brent, the global benchmark (LCOc1), was trading 20 cents a barrel higher at $49.72. \n\"Stabilization in Chinese equity markets has ... played an important role,\" ABN Amro analysts said. \nGerman 10-year bond yields rose 3 basis points to 0.71 percent. German is due to sell 4 billion euros of the paper at around 0930 GMT. \nU.S. 10-year Treasury yields , which rose in New York on Tuesday with shares, headed higher still and were last up 3 bps at 2.22 percent. The Treasury Department will sell $21 billion of the notes on Wednesday. \n\"The environment for the auctions seems tricky amid the ongoing concerns about Chinese selling (of Treasuries). No one really knows how Chinese demand is going to behave and that's creating uncertainty here,\" said Commerzbank strategist Michael Leister. \nGold (XAU=) held above a three-week low, last trading at $1,120 an ounce, having fallen as low at $1,116.20 earlier this week. \n(Additional reporting by Nichola Saminather in Singapore, Lisa Twaronite in Tokyo, Emelia Sithole-Matarise; Editing by Alison Williams) Currency", "external_links": [], "published": "2015-09-09T11:45:00.000+03:00", "crawled": "2015-09-09T11:50:54.831+03:00", "highlightTitle": ""}