{"organizations": [], "uuid": "1cac8d265fba965d19f25970aee36d495d7b31db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2014/10/14/12952152/Confirmit_logo.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12952152.htm", "country": "US", "title": "Financial Services and Insurance Companies Reach Significant ROI with Confirmit Horizons", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Financial Services and Insurance Companies Reach Significant ROI with Confirmit Horizons", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "1cac8d265fba965d19f25970aee36d495d7b31db"}, "author": "Chuck Tanowitz or Molly Delaney", "url": "http://www.prweb.com/releases/2015/09/prweb12952152.htm", "ord_in_thread": 0, "title": "Financial Services and Insurance Companies Reach Significant ROI with Confirmit Horizons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Creating an impactful customer experience is a challenge that all businesses encounter, but it’s especially prevalent in financial services and insurance organizations today. A Total Economic Impact™ (TEI) study conducted by Forrester Consulting and commissioned by Confirmit , the leading global solutions provider for Customer Experience , Voice of the Employee , and Market Research , uncovered a 322 percent potential Return on Investment for financial services and insurance organizations using Confirmit HorizonsTM over a three-year risk-adjusted period.\n“A positive customer experience can improve future revenue opportunities, ensure your customers stay loyal to your company, and increase the likelihood they recommend your organization to their friends and colleagues,” the study states. “Financial services and insurance companies need a customer experience strategy to ensure a positive, consistent experience for every interaction a customer has with their organization.”\nThe study provides financial services and insurance organizations with a framework to evaluate the potential financial impact of the Confirmit Horizons platform and services. More specifically, the study focused on improvements in complaint management, noting a 50 percent time saving with Confirmit’s alert management functionality that allows organizations to more efficiently identify and resolve issues.\nInterviews for this study also uncovered several drivers behind the need for a VoC solution, including the desire from financial services and insurance organizations to use data to create a more cohesive experience across a variety of channels.\n“Companies need a reliable, flexible solution to manage VoC and ultimately improve their customer experience,” said Henning Hansen, Confirmit president and CEO. “By using Confirmit Horizons, financial services and insurance organizations have improved visibility into data to build successful multi-channel customer experiences and create stronger relationships with their customers.”\nTo request a copy of the study or to learn more about how Confirmit can deliver Return on Investment from a VoC program for financial services or insurance organizations, please visit Confirmit.com .\n###\nAbout Confirmit\nConfirmit is the world’s leading SaaS vendor for multi-channel Voice of the Customer, Voice of the Employee, and Market Research solutions. The company has offices in Oslo (headquarters), Chengdu, Cologne, Grimstad, London, Moscow, New York, San Francisco, Sydney, Vancouver, and Yaroslavl. Confirmit’s software is also distributed through partner resellers in Madrid, Milan, Salvador, and Tokyo.\nConfirmit powers Global 5000 companies and Market Research agencies worldwide with a wide range of software products for feedback / data collection, panel management, data processing, analysis, and reporting. Customers include Aurora, British Airways, Cross-Tab, Dow Chemical, GfK, GlaxoSmithKline, GMO Research, JTN Research, Keep Factor, Morehead Associates, Nielsen, Research Now, RONIN, Sony Mobile Communications, Swisscom and The Wellcome Trust. Visit http://www.confirmit.com for more information.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2JpdC5seS8xTnA0V1pN", "http://bit.ly/1EU0tvk", "http://bit.ly/1Np4WZM", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2JpdC5seS8xRVUwdHZr", "http://bit.ly/1FxjpLm", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2JpdC5seS8xT3laYkc2", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2JpdC5seS8xRnhqcExt", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5jb25maXJtaXQuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2JpdC5seS8xTGp2M0xN", "http://bit.ly/1Ljv3LM", "http://bit.ly/1OyZbG6"], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-10T16:07:35.058+03:00", "highlightTitle": ""}