{"organizations": [], "uuid": "07e0f791460c41c58a8317e03ec7aea8f4c34a2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-22/france-s-tepid-recovery-hits-crossroads-after-summer-soft-patch", "country": "US", "title": "France's Tepid Recovery Hits Crossroads After Summer Soft Patch", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "France's Tepid Recovery Hits Crossroads After Summer Soft Patch - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T17:04:00.000+03:00", "replies_count": 0, "uuid": "07e0f791460c41c58a8317e03ec7aea8f4c34a2e"}, "author": "Mark Deen", "url": "http://www.bloomberg.com/news/articles/2015-09-22/france-s-tepid-recovery-hits-crossroads-after-summer-soft-patch", "ord_in_thread": 0, "title": "France's Tepid Recovery Hits Crossroads After Summer Soft Patch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "France’s economic recovery has shown signs of fading and data this week will provide the latest clues as to whether a summer soft patch risks becoming more ominous.\nSurveys of purchasing managers show the French manufacturing and services industries are barely expanding, lagging activity in Germany and the euro area. Growth stalled in the second quarter after averaging less than half a percent annually in the past three years, and unemployment is only slowly falling from a peak of 10.5 percent reached at the end of 2014.\nThe lackluster performance has prompted calls from the European Commission in Brussels and the International Monetary Fund in Washington for President Francois Hollande’s government to accelerate the modernization of the nation’s economy. For now, both those organizations see growth accelerating to about 1 percent in all of 2015, and economists say data from August and early September don’t suggest differently.\n“I’m not nervous yet,” said Gilles Moec, chief European economist at Bank of America Merrill Lynch in London. “Yes, the structural issues are there but there is also something called the cycle. Commentators in general are losing sight of that a bit.”\nThe yield on French 10-year bonds was down six basis points at 1 percent at 1:42 p.m. Paris time as a slide in equities boosted demand for fixed-income assets. The CAC 40 Index fell 3.2 percent.\nA measure of French business confidence by the National statistics office Insee has climbed steadily this year and currently stands at 100, up from 94 last December. That has brought the reading above the index’s five-year average of 95 for the first time since 2011. A reading for September will be published on Thursday.\nOn Wednesday, Insee will release its second estimate of last quarter’s gross domestic product. The initial reading showed no growth in the period, compared with a 0.7 percent expansion in the previous three months.\nA gauge of manufacturing and services output is set to rise to 50.4 from 50.2, barely above the 50 mark that divides expansion from contraction, according to a Bloomberg survey of economists. Measures for the euro area and Germany are forecast to register 54 and 54.6, respectively.\nSimilarly, French industrial production unexpectedly dropped in July, while output improved in Germany, Italy and Spain.\n“It’s true that we have kind of hit a soft spot,” said Bruno Cavalier, chief economist at Oddo & Cie in Paris. “My reflex is to smooth the month on month changes and look at 2015 as a whole. And on average, the situation is a bit better than recent years. France is participating in the European recovery, even if it is a bit behind.”", "external_links": [], "published": "2015-09-22T17:04:00.000+03:00", "crawled": "2015-09-22T14:57:00.574+03:00", "highlightTitle": ""}