{"organizations": [], "uuid": "c8bc0f8cc598349348556820f159af1efc1dac5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/PropertyManagement", "section_title": "Yahoo! Finance: Property Management Industry News", "url": "http://finance.yahoo.com/news/better-homes-gardens-real-estate-132000490.html", "country": "GB", "title": "Better Homes and Gardens Real Estate and NAHREP Survey Finds That Hispanic Women Are Taking Charge Among the Fastest-Growing Homebuying Demographic", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Better Homes and Gardens Real Estate and NAHREP Survey Finds That Hispanic Women Are Taking Charge Among the Fastest-Growing Homebuying Demographic - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "c8bc0f8cc598349348556820f159af1efc1dac5f"}, "author": "Better Homes and Gardens Real Estate LLC", "url": "http://finance.yahoo.com/news/better-homes-gardens-real-estate-132000490.html", "ord_in_thread": 0, "title": "Better Homes and Gardens Real Estate and NAHREP Survey Finds That Hispanic Women Are Taking Charge Among the Fastest-Growing Homebuying Demographic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MADISON, N.J. and SAN DIEGO, Calif., Sept. 21, 2015 /PRNewswire/ -- The Hispanic population has become a catalyst for the U.S. housing market, and new data released today by Better Homes and Gardens® Real Estate and the National Association of Hispanic Real Estate Professionals® (NAHREP) shows that Hispanic women, in particular, are essential to unlocking this buying power, based on their perceived roles within the household. The national study of more than 1,000 Latin American/Hispanic women ages 25 to 60 reveals that 91 percent of respondents think buying a home is the best financial investment they can make – and they are taking charge of this commitment.\nView photo\n. Sixty-one percent of Hispanic women surveyed believe they will play a larger role than their partner in their next home purchase, specifically when it comes to: researching homes to visit (59%), researching communities or neighborhoods (58%), deciding which home to eventually purchase (54%) and researching the finances, such as mortgage options (43%). The concept of Latina women being primary decision makers translates into the home as well. On average, those surveyed believe that they are responsible for 69 percent of household purchase decisions over $100, and one-third believe they are in charge of all such decisions.\n\"Historically, we've been able to broadly project the influence the Hispanic demographic would have on our industry by the sheer population growth alone,\" said Sherry Chris, president and CEO, Better Homes and Gardens Real Estate LLC. \"However, it's vital to understand that Latina women in particular are a driving force behind decisions related not only to the home, but the actual home-buying transaction process. It's our responsibility to educate the industry on the primary roles these women have taken on as primary decision makers. There is no better partner than NAHREP to help us discover and share this important information.\"\nAccording to the survey results, the Hispanic population will be driving a significant amount of real estate activity in the near future. Nearly half believe they will live in their current home for only 5 years or less. Of significant interest, they view their next move as an investment opportunity. More than half would look to rent out their former home as an additional source of income versus selling. The majority (66%) of those surveyed who have never owned a home, as well as 84 percent of non-homeowner millennial respondents, are confident they will be able to buy one at some point in their lifetime – and, on average, believe this will be within the next 3 years.\n\"Our organization is committed to helping the Hispanic population achieve homeownership and educating real estate influencers on how to help them at every juncture,\" said Teresa Palacios Smith, 2015 NAHREP National President. \"Thanks to Better Homes and Gardens Real Estate's continuous support, we've been able to focus on the Latina demographic and help the industry better understand the nuances surrounding the modern Hispanic woman as a consumer and how she's impacting her family's lifestyle within the home.\"\nWhile Hispanic women are increasingly bilingual and value the Spanish language as part of their culture, tradition and identity, survey findings on the importance of the Spanish language when it comes to participating in a home transaction may surprise real estate professionals and marketers. Sixty-one percent (61%) of respondents do not think it's important that their real estate professional speaks Spanish. However, not to discount the desire of the remaining 39 percent who value this attribute, they are overall evenly split in their reasoning: a Spanish-speaking sales associate would make them feel more at ease with the steps of the transaction process (26%), would make them feel the sales associate understands their culture and lifestyle (26%) and would help them better connect with extended family members who play an active role in the transaction process (22%). Focusing specifically on the group of Latinas who are currently looking to purchase a home, 48% feel it's important for an agent to speak Spanish, which highlights the need for recruiting strategies that target Hispanic agents. The study showed a more resounding preference than language: the agent's gender. 73 percent of Latina respondents prefer to work with a female agent in lieu of a male.\nAdditional insights include:\nHome Is Where the Heart Is: Hispanic women want to see and host their loved ones often. 87 percent would like their home to be the main gathering place for family celebrations. Respondents also claim the top reason for purchasing a home today would be to provide an ideal environment for their family.\nAffinity for Multi-Generational Living: 62 percent would buy a home with room for more people than currently live with them. This is in line with the Better Homes and Gardens Real Estate 2013 survey results , which found that 63 percent of Hispanics would likely have their parents, grandparents or other extended family members living with them at some point.\nFamily Ties: 34 percent of those surveyed would prefer a less desirable home closer to their family than their dream home, no matter the location.\nPuttin' on the Ritz: Hispanic women value certain luxury amenities to help their families live their best lives in their home. The top desires are an in-ground pool (50%), a gourmet chef's kitchen (50%), a spa-like bathroom (47%), a \"smart\" home (31%), an outdoor kitchen (29%) and a built-in home theater system (29%).\nAbout the Survey\nThe Better Homes and Gardens Real Estate & NAHREP Hispanic Women Survey was conducted by Wakefield Research among 1,002 U.S. Latin American and Hispanic women ages 25 – 60, between August 4 and August 17, 2015, using an email invitation and an online survey. Quotas have been set to ensure reliable and accurate representation of the U.S. female Latin American and Hispanic population ages 25 – 60.\nResults of any sample are subject to sampling variation. The magnitude of the variation is measurable and is affected by the number of interviews and the level of the percentages expressing the results. For the interviews conducted in this particular study, the chances are 95 in 100 that a survey result does not vary, plus or minus, by more than 3.1 percentage points from the result that would be obtained if interviews had been conducted with all persons in the universe represented by the sample.\nAbout the National Association of Hispanic Real Estate Professionals (NAHREP)\nThe National Association of Hispanic Real Estate Professionals, a nonprofit 501(c) 6 trade association, is dedicated to advancing sustainable homeownership among Latinos by educating and empowering the real estate professionals that serve them. Based in San Diego, NAHREP is the premier trade organization for Hispanics and has more than 20,000 members in 48 states and 35 affiliate chapters.\nAbout Better Homes and Gardens Real Estate LLC\nBetter Homes and Gardens Real Estate LLC is a dynamic real estate brand that offers a full range of services to brokers, sales associates and home buyers and sellers. Using innovative technology, sophisticated business systems and the broad appeal of a lifestyle brand, Better Homes and Gardens Estate LLC embodies the future of the real estate industry while remaining grounded in the tradition of home. Better Homes and Gardens Real Estate LLC is a subsidiary of Realogy Holdings Corp. ( RLGY ), a global leader in real estate franchising and provider of real estate brokerage, relocation and settlement services.\nThe growing Better Homes and Gardens Real Estate network includes more than 9,500 affiliated sales associates and approximately 290 offices serving home buyers and sellers across the United States and Canada.\nBetter Homes and Gardens® is a registered trademark of Meredith Corporation licensed to Better Homes and Gardens Real Estate LLC and used with permission. An Equal Opportunity Company. Equal Housing Opportunity. Each Better Homes and Gardens Real Estate Franchise is independently owned and operated.\nMedia Contacts\nPaul Pettas\nKwittken\n646-747-7164\nppettas@kwittken.com \nKristin Degnan\nBetter Homes and Gardens Real Estate LLC\n973-407-2408\nkristin.degnan@bhgrealestate.com \nLogo - http://photos.prnewswire.com/prnh/20150324/184038LOGO \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/better-homes-and-gardens-real-estate-and-nahrep-survey-finds-that-hispanic-women-are-taking-charge-among-the-fastest-growing-homebuying-demographic-300145895.html \nBetter Homes Real Estate Hispanic population", "external_links": [], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T18:14:48.051+03:00", "highlightTitle": ""}