{"organizations": [], "uuid": "b17da4632e464fdd735e9e4cebf91593d361a707", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03443/credit-cardsxxx_3443076k.jpg", "site_section": "http://www.telegraph.co.uk/finance/personalfinance/", "section_title": "Personal finance - How to grow your wealth and spend less money - Telegraph - Telegraph", "url": "http://www.telegraph.co.uk/finance/personalfinance/money-saving-tips/jessicainvestigates/11871322/How-to-exploit-credit-card-protection.html", "country": "GB", "title": "How to exploit credit card protection", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "How to exploit credit card protection - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T17:04:00.000+03:00", "replies_count": 0, "uuid": "b17da4632e464fdd735e9e4cebf91593d361a707"}, "author": "Jessica Gorst-Williams", "url": "http://www.telegraph.co.uk/finance/personalfinance/money-saving-tips/jessicainvestigates/11871322/How-to-exploit-credit-card-protection.html", "ord_in_thread": 0, "title": "How to exploit credit card protection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thank you for advising me to ask for a chargeback. This has resulted in the reimbursement of the £178 I wrote to you about. RR, Suffolk I refer to my previous letter about my problems with a window replacement company. I contacted my bank as you suggested, mentioning Section 75 of the Consumer Credit Act 1974. The bank has now liaised with the company and I have been advised that corrective work will begin in six weeks’. Thank you for your help. NB, Pembrokeshire An online purchase is turning into a nightmare. Have you any suggestions? SI, London Using a credit card or, to a lesser extent, a debit card for a transaction can provide a lifeline if something goes wrong. In the case of a debit card or indeed a credit card the card provider may be prepared to initiate a “chargeback” to reverse a transaction where there is a problem. However, the merchant can still dispute the bank’s action and have the money returned. In RR’s case the bank did not hear back from the merchant. Therefore the money, having been retrieved after I suggested that RR requested this option over a transaction that did not live up to expectations, stayed in RR’s account. Deadlines for chargebacks are tight; for details check the card’s terms and conditions. • 'I'm still waiting for my refund from Barclaycard' A credit card has an extra string to its bow in that for a transaction worth between £100 and £30,000 the card issuer shares liability with the merchant where there is of breach of contract or misrepresentation. The provisions are complex and do not meet every need. NB had been unaware that his bank might step in for him when work and materials he had paid for with his credit card proved substandard. When he explained the problem to his bank it negotiated the resolution he describes. • If you want to contact Jessica, click here Home Insurance Get a Quote: » Up to 25% discount for over 50's", "external_links": [], "published": "2015-09-21T17:04:00.000+03:00", "crawled": "2015-09-22T10:03:39.013+03:00", "highlightTitle": ""}