{"organizations": [], "uuid": "6b8645192a7e183538cd3eaed8192ae39b8a3270", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/i/f/w/r/image.related.articleLeadwide.620x349.gjic8q.png/1441849792607.jpg", "site_section": "http://www.smh.com.au/business/planners-go-rogue", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/money/saving/nonbanks-give-best-deals-on-international-money-transfers-20150909-gjic8q.html", "country": "AU", "title": "Non-banks give best deals on international money transfers", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Non-banks give best deals on international money transfers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "6b8645192a7e183538cd3eaed8192ae39b8a3270"}, "author": "", "url": "http://www.smh.com.au/money/saving/nonbanks-give-best-deals-on-international-money-transfers-20150909-gjic8q.html", "ord_in_thread": 0, "title": "Non-banks give best deals on international money transfers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "John Brown, from Dulwich in Sydney and his sister each inherited the same amount from Britain but after the transfers he received $5000 less. Photo: Jessica Hromas\nConsumers transferring money in and out of Australia could be doing themselves out of hundreds, or even thousands, of dollars using their big bank to make the transfers.\nTo get more Money more often, why not follow us on Twitter? We’re @FairfaxMoney\nBig banks have much lower exchange rates on international transfers than non-bank currency transfer services.\nBig bank exchange rates are generally about 2 to 3 per cent worse for the consumer than the rates Quote: d by the Reserve Bank. Photo: Sean Davey\nThe banks have higher overheads than the online-only currency transfer services, but there is a feeling that the banks could be taking advantage of their loyal customers.\nAdvertisement John Brown received more than $5000 less than his twin sister who also lives in Australia after each received exactly the same inheritance from Britain.\nThe retiree and former wine merchant said if his sister had not received exactly the same inheritance, he would have not been any the wiser and have just accepted it.\nYou'll get a bigger bundle if you pick the smartest way to transfer money. Photo: Simon Dawson\nEach is with a different big bank with different exchange rates.\n\"The moral seems to be that if you are expecting money from overseas, park it without changing it into Australian dollars and shop around for the best rate,\" John says.\nJohn's bank gave him a \"goodwill\" payment of $4000 after he complained.\nBy taking a few simple steps, consumers can save themselves a lot of money on international transfers.\nMost foreign currencies are buying more Australian dollars now than they have for a long time. That makes it a good time to transfer money to Australia from overseas.\nOn the day Money checked the big banks' websites, a transfer of £100,000 resulted in a difference of $2200 between the best and the worst bank rate. The average exchange rate of the big four works out at about $211,000.\nBut the really big difference is between the big banks and the major non-bank money transfer services such as OzForex, Western Union and AFEX.\nFor example, transferring the £100,000 using OzForex resulted in $220,000 going into the Australian account, or $9000 more than using the average exchange rate of the big banks.\nOne problem consumers making a transfer have is that they cannot control exactly when the transfer takes place and what exchange rate they will receive.\nThat is even a bigger problem now than normally. Currency markets have been particularly volatile for the past month with some big swings day to day.\nOne of the benefits of a service such as OzForex is that the transfer can be made to OzForex in pounds first. Then the money can be converted into Australian dollars at a known exchange rate.\nThat gives the consumer control over the timing of the transfer into Australian dollars.\nMost of the services charge no fees above certain minimum amounts being transferred. With OzForex, for example, there is no fee as long as at least £3000 is transferred.\nAs a starting point, consumers can check with the Reserve Bank's website, which gives current exchange rates, known as the inter-bank or wholesale rates.\nThe rates shown and updated daily are the mid-point between the buying and selling rates.\nOf course, consumers transferring small amounts could never hope to get these rates. But it is a useful starting point by which consumers can compare rates before committing to a transfer.\nVery roughly, big bank exchange rates are generally about 2 to 3 per cent worse for the consumer than the rates Quote: d by the Reserve Bank.\nThe rates of the non-bank transfer services are generally well below 1 per cent worse for the consumer than the rates Quote: d by the Reserve Bank.\nConsumer group Choice reviewed money transfers last year. It said that though non-bank services are \"better by a long shot\" than big banks, some of the services are more transparent than others.\nFor example, it is not always clear if the consumer is seeing the inter-bank rate or the actual customer exchange rate that applies to the transfer.\nThe customer exchange rate will be there, but usually a click or two from the home page.\nChoice also pointed out that PayPal can be an expensive way to transfer money for amounts of more than about $200.\nThat is because it charges a percentage of the amount sent.\nThe fee can be between 2.5 per cent and 4 per cent on top of the inter-bank exchange rate depending on the currency. It can be even more if sending money overseas using a credit card.\nAlso be aware that banks usually charge fees that are out of the control of the non-bank transfer services.\nUsually the big banks charge a flat fee whether sending and receiving transfers.\nOn a transfer from Britain, for example, the British institution sending the money will likely charge a fee and the Australian bank receiving the money will also charge a fee. It is usually a flat fee of between $10 and $50.\nOne strategy for those who are concerned about the volatility in exchange rates for those transferring large amounts is use one of the non-bank transfer services and to stagger the transfers over several weeks.\n @jcollett_money", "external_links": ["http://twitter.com/@FairfaxMoney", "http://twitter.com/@jcollett_money"], "published": "2015-09-11T03:00:00.000+03:00", "crawled": "2015-09-12T06:09:27.305+03:00", "highlightTitle": ""}