{"organizations": [], "uuid": "da77209942d776a214c20feac1456251269c20b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/bankdeposit030915.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/impact-of-rate-cut-on-savers-interests/43540.html", "country": "IN", "title": "Impact of ‘rate cut’ on savers’ interests", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Impact of ‘rate cut’ on savers’ interests", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T16:45:00.000+03:00", "replies_count": 0, "uuid": "da77209942d776a214c20feac1456251269c20b8"}, "author": "MG Warrier", "url": "http://www.moneylife.in/article/impact-of-rate-cut-on-savers-interests/43540.html", "ord_in_thread": 0, "title": "Impact of ‘rate cut’ on savers’ interests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Impact of ‘rate cut’ on savers’ interests 43540 Impact of ‘rate cut’ on savers’ interests 0 Comments, Be the first to comment MG Warrier | 30/09/2015 07:15 PM | Those who have invested their savings with a long term perspective considering the security and liquidity concerns, should not be given a shock The major monetary policy announcement made by Reserve Bank of India (RBI) on 29 September 2015 is a reduction in the policy repo rate under the liquidity adjustment facility (LAF) by 50 basis points (bps) to 6.75% from 7.25% with immediate effect. The measure is widely welcomed by finance ministry, banks and industrial circles, among others who include economists of a different school who have all along been criticising RBI Governor Dr Raghuram Rajan for his stance on inflation. The impact of the rate cut on economic growth and the mood of international rating agencies and other stakeholders including foreign institutional investors (FIIs) will be analysed and researched by economists and media in the coming days. This article attempts to caution savers that their interests are at stake and perhaps, time has come when they have to be vigilant about the drain on their resources, which get invested in various financial instruments brought out by government, banks and corporates. This caution comes from a second reading of the announcement made by finance ministry on the same day RBI held the bi-monthly monetary policy review to the effect that government will review the interest rates on small savings, which ‘banks say, come in the way of lowering interest rates.’ Those who are responsible to pay interest have every right to review the rates and bring it down to their advantage. But, those who have invested their savings with a long term perspective considering the security and liquidity concerns, should not be given a shock, just because there is a temporary change in the movement of prices (let us not get into the controversy about wholesale and consumer price index -WPI or CPI here). Some analysts console savers that return on investments have become ‘positive’ these days with inflation getting tamed. May be true. However, I am unaware of a single household budget, which has come down because prices have come down. Interest rates At present, interest paid by bigger banks on long term fixed deposits (FDs) is less than 8% per annum, post office term deposits earn between 8.40% (3-year term deposits) and 8.80% (10 year National Savings Certificates-NSC) and public provident fund (PPF) scheme fetches 8.70% per annum. A revision of these rates downward will move savers from safe and secure investments to other riskier avenues, which again will involve a social cost to the nation in the long run. Deposit insurance Here, a word about deposit insurance. The present ceiling of Rs1 lakh for deposit insurance coverage was fixed ages back. As there will definitely be migration of savers to smaller banks, there is a strong case for a review of deposit insurance to increase the amount covered and, if possible bringing more institutions which accept deposits from public, under the umbrella of deposit insurance. Government borrowings Even at this stage, when Centre is seriously thinking in terms of managing government borrowings (public debt) by themselves, one doubts whether those who argue for and against are aware that government borrowings (both central and state governments) are dependent on a captive source? It includes, investment by banks (statutory liquidity ratio -SLR), organisations like Life Insurance Corp of India (LIC), Employees’ Provident Fund Organisation (EPFO) and other public sector undertakings which are guided by several legal obligations and ‘moral suasion’. The Centre will do well to have a look at the possibility of leaving the interest rates on government borrowings to market forces, by increasing the retail investment component in government securities. Passing on the benefits of rate cut The present monetary policy review makes the following observation: “In the bi-monthly policy statement of August, the Reserve Bank indicated that further monetary policy accommodation will be conditioned by the abating of recent inflationary pressures, the full monsoon outturn, possible Federal Reserve actions and greater transmission of its front-loaded past actions. Since then, inflation has dropped to a nine-month low, as projected. Despite the monsoon deficiency and its uneven spatial and temporal distribution, food inflation pressures have been contained by resolute actions by the government to manage supply. The disinflation has been broad-based and inflation excluding food and fuel has also come off its recent peak in June. The Federal Reserve has postponed policy normalisation. Markets have transmitted the Reserve Bank’s past policy actions via commercial paper and corporate bonds, but banks have done so only to a limited extent. The median base lending rates of banks have fallen by only about 30 basis points despite extremely easy liquidity conditions. This is a fraction of the 75 basis points of the policy rate reduction during January-June, even after a passage of eight months since the first rate action by the Reserve Bank. Bank deposit rates have, however, been reduced significantly, suggesting that further transmission is possible.” Some banks, of course, reduced their cost on resources by reducing deposit rates. Let us not assume that Dr Rajan conceded a 50bps cut, perceiving that anyway, this cut may not have much impact on any of the economic indicators including inflation till end FY2016. The gesture may put himself in a better position to bargain with FM on several other issues at a better comfort level and also silence the economists who accuse him for going slow on ‘cuts’ for the time being. Longer intervals for review At least from Calendar Year 2016, RBI should consider reverting to quarterly schedule for Monetary Policy Review. There are enough fora for RBI to share its mind on policy issues between such reviews and technically, monetary policy measures including revision of base rates need not always coincide with such reviews. Lesser frequency of reviews may reduce scope for external pressures and lobbying also to that extent. (The writer is a former General Manager, Reserve Bank of India and author of the 2014 book “Banking, Reforms & Corruption: Development Issues in 21st Century India\".) More in Moneylife", "external_links": [], "published": "2015-09-30T16:45:00.000+03:00", "crawled": "2015-09-30T17:38:44.365+03:00", "highlightTitle": ""}