{"organizations": [], "uuid": "2184133685020ec07f1abecb7e6c871de3a4963e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/11/markets-stocks-europe-idUSL5N11H3DL20150911", "country": "US", "title": "European shares end lower, but weekly gain biggest in 2 months", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "European shares end lower, but weekly gain biggest in 2 months | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T20:30:00.000+03:00", "replies_count": 0, "uuid": "2184133685020ec07f1abecb7e6c871de3a4963e"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/11/markets-stocks-europe-idUSL5N11H3DL20150911", "ord_in_thread": 0, "title": "European shares end lower, but weekly gain biggest in 2 months", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Pan-European FTSEurofirst 300 ends 1 pct lower\n* Actelion drops after discussions with ZS Pharma\n* E.ON falls after dropping plans for nuclear spin-off\nBy Atul Prakash\nLONDON, Sept 11 (Reuters) - European shares fell for a second straight day on Friday, led lower by Swiss drugmaker Actelion, but the FTSEurofirst 300 index still recorded its biggest weekly rise since July.\nActelion shares slid 5.4 percent, the biggest decline in the index. HSBC analysts said a bid by Actelion for ZS Pharma might destroy value for its shareholders, after Bloomberg reported that Actelion had made an offer worth $2.5 billion. The companies confirmed they had held talks but not whether they were related to a acquisition.\nThe FTSEurofirst 300 ended 1 percent lower at 1,401.07 points, but rose 0.7 percent on the week.\nEquities had been under pressure from concern that China's growth is faltering. They have stabilised since Chinese regulators intervened in the stock market, with some investors also betting the recent uncertainty would dissuade the U.S. Federal Reserve from raising rates next week.\n\"If the Fed doesn't raise rates this month, we might see a bounce. But investors will start thinking that a hike is coming in October. This overhang is not good for the markets,\" Manish Singh, head of investment services at Crossbridge Capital, said.\nAfter a rally in the past two weeks, some were cautious heading into the new week, even if many investors believed the August sell-off had been overdone.\n\"We've had a bounce, and after a correction as steep as the one we've had, the rally needs testing,\" said Veronika Pechlaner, European equity fund manager at Asburton. \"This is not the time to make huge bets either way, but longer term we remain constructive on equities.\"\nShares in Germany's biggest utility, E.ON, fell 4.4 percent, extending the previous session's decline. The stock had dropped 5 percent to a 20-year low on Thursday after the company abandoned plans to spin off its German nuclear power plants, leaving it with liability for billions of euros of costs when they are shut down.\n\"We see this as a clear negative to our previously positive investment case ... it appears the politicians have got the better of E.ON,\" analysts at RBC said in a note, adding that the future E.ON \"will not be the company that many investors were hoping for\". They downgraded the stock to \"sector perform\" from \"outperform\".\nEurope bourses in 2015: link.reuters.com/pap87v\nAsset performance in 2015: link.reuters.com/gap87v\nToday's European research round-up (Additional reporting by Alistair Smout ; Editing by Mark Trevelyan)", "external_links": [], "published": "2015-09-11T20:30:00.000+03:00", "crawled": "2015-09-11T19:41:22.771+03:00", "highlightTitle": ""}