{"organizations": [], "uuid": "cbed848c5ad4a67687008a52938d896b51df5986", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/gujarat-anandiben-patel-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/companies/gujarat-goes-the-e-way/138740", "country": "IE", "title": "eGov: Gujarat goes the e-way, makes system transparent", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "eGov: Gujarat goes the e-way, makes system transparent | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T08:14:00.000+03:00", "replies_count": 0, "uuid": "cbed848c5ad4a67687008a52938d896b51df5986"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/companies/gujarat-goes-the-e-way/138740", "ord_in_thread": 0, "title": "eGov: Gujarat goes the e-way, makes system transparent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles With 23.85 lakh flyers, Indigo stays No 1 in India Sebi fines PACL Rs 7,269 crore for illegal raising of funds BHEL bullish on acquiring defence orders From a laggard in the IT arena, if late bloomer Gujarat has today donned the much-deserved mantle of Smart State, the credit goes largely to the fact that Gujarat chief minister Anandiben Patel has not only nurtured the legacy of her predecessor Narendra Modi but has taken proactive steps to ensure that the e-governance infrastructure in the state continues to build on its impressive foundations. It is not surprising therefore that India’s first Wi-Fi enabled tribal taluka Khedbrahma, India’s first Wi-Fi enabled urban centre Modasa and India’s first digital village Akodara can all be red flagged on Gujarat’s map. These path-breaking accomplishments are testimony to the Gujarat government’s commitment towards achieving inclusive growth through effective use of modern technology.\nGujarat’s e-governance story stands out as distinctive from most other state governments on account of the focused approach adopted by the state government towards bridging the urban-rural divide through e-connectivity. Towards this goal, CM Anandiben Patel has also recently announced a slew of e-governance initiatives including Wi-Fi Sachivalaya, state-wide rollout of Wi-Fi, setting up of IT cadre and e-waste management system. The CM said, “The state government has been increasingly using information and communication technology for making the system more transparent and ensure speedy redressal of people’s grievances. Gujarat government also has one of the most citizen-friendly and comprehensive policies of e-governance, IT and electronic, that enables the rise of Digital Gujarat.”\nJust a few days ago, a game changing decision has been taken to provide wireless internet services at the level of district collector, DDO, municipal commissioner, police commissioner and other nodal government offices. Not only that, even visitors to these offices will have access to these wireless services. To achieve this, plans are afoot to increase the speed of GSWAN (Gujarat State Wide Area Network) from the existing 34 Mbps to 500 Mbps which would give a quantum boost to the e-governance initiative. The aim is to convert GSWAN from a predominant G2G (government-to-government) interface to a G2C (government-to-citizen) interface as well. The key applications being envisaged for this are network broadcast, video conferencing, voice and data communication, intranet and internet access.\nA comprehensive e-governance policy for 2014-2019 unveiled in November 2014 focusses on providing cost-effective and efficient services through digital inclusion. The key features of this policy include: setting up e-governance campus and IT centres, promoting digital literacy and provision of last mile connectivity, broadening government network scope by implementing state data centres and Wi-Fi campuses, e-connectivity of all government institutions via cloud computing and virtualisation.\nKeeping in mind PM Modi’s concept of Digital India , Patel’s vision document on Digital Gujarat envisages generation of over 10 lakh job opportunities as well as encourages digital literacy in the state. By 2020 the state aims to attract $15 billion into the IT sector. Incentives including 100% relief in stamp duty and registration fee to all IT units in first transaction of sale, lease and transfer and 25% subsidy to new units for lease/rental in IT parks. Additionally, the IT policy also offers 100% relief for women employees in Employment Provident Fund (EPF), 75% for other employees as well as 30% subsidy in bandwidth charges and simplified labour laws.\nIt also gives thrust to reaching out to people through social media and encourages research.\nGujarat has been pioneering in implementation of e-governance applications and has stayed committed to setting up of key infrastructure for this including the Gujarat State Wide Network (GSWAN), Satellite Communication (SATCOM) and Gujarat State Data Centre (GSDC).\nFostering the true spirit of ‘Good governance through E-governance’ and ‘Minimum government, Maximum governance’, the state government has been increasingly using information and communication technologies (ICT) for making the system more transparent and ensure speedy redressal of people’s grievances.\nThe success of Gujarat’s SWAGAT Online programme has been phenomenal. The online grievance redressal system has been instrumental in helping common people to seek speedy redressal of their pending issues. SWAGAT relies on ICT infrastructure, particularly GSWAN. Taluka, district and state level are linked on a single platform through simple intranet-based application that helps to administer and manage people’s grievances. These grievances are then reviewed by the CM herself.\nIn addition, the state has adopted a policy-driven framework in implementing e-governance projects across the state.\nThe state has made a mark in connecting IT with agriculture through various projects such as i-Kisan portal and soil health cards. The state tops in facilitating internet connections to all the villages under ‘e-Gram Vishwagram’ project.\nAmong the notable successes in Gujarat’s impressive list of e-governance projects are e-Procurement, Targeted Public Distribution System (TPDS), e-Dhara, e-Jameen, Apno Taluka Vibrant Taluka (ATVT), Online Job Application System (OJAS), e-GujCop and e-Nagar.\nThat Gujarat has covered much lost ground compared to states which reaped the early bird advantage is evident from the fact that in the last 13 years, the state has bagged as many as 174 national awards in e-governance in sectors including public services, hospital management, Sarvashiksha Abhiyaan, Gram Vikas. The state has also emerged as a leading state across India in reflecting e-transactions. In less than two years, the state has crossed 100 crore e-transactions for public services—a first for the country insofar as use of technology for registration of births and deaths, land, and other such activities are concerned.\nAccording to ‘eTaal’—electronic transaction aggregation and analysis layer—a Central government portal that disseminates e-transaction statistics, Gujarat accounts for 27% of the total 373 crore e-transactions recorded in the services provided by all state government services in the past two years. From land record registration to registering a new birth to getting an affidavit for income, Gujaratis do it all the e-way. According to eTaal, public distribution system, land revenue and utility and bill payments are the top three services which record the maximum use, comprising of more than 63% of e-transactions in Gujarat.\nGujarat is next to only the Central government in terms of use of e-services for governance. Over 500 services are available through e-governance in Gujarat. The government has also begun implementing ‘mobile governance’ across the state as an extended arm of e-governance. Clearly, for Gujaratis, the e-way is the road to development.\n 21, 2015 12:14 am", "external_links": [], "published": "2015-09-21T08:14:00.000+03:00", "crawled": "2015-09-22T18:37:22.815+03:00", "highlightTitle": ""}