{"organizations": [], "uuid": "0ed9d8624cd0643b188dabf0f93607afa5834801", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/09/17/12968928/ipartners logo.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12968928.htm", "country": "US", "title": "Bear River Mutual Insurance Selects iPartners’ Data Model & Business Intelligence (BI) Solution", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Bear River Mutual Insurance Selects SNL iPartners’ Data Model & Business Intelligence (BI) Solution", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "0ed9d8624cd0643b188dabf0f93607afa5834801"}, "author": "Christina Twomey", "url": "http://www.prweb.com/releases/2015/09/prweb12968928.htm", "ord_in_thread": 0, "title": "Bear River Mutual Insurance Selects iPartners’ Data Model & Business Intelligence (BI) Solution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SNL iPartners , a division of SNL Financial providing on-demand business analytics tools to P&C insurers, announced today that Bear River Mutual Insurance Company , Utah’s oldest mutual property and casualty insurance company, has selected SNL iPartners’ business intelligence (BI) solution. Through SNL iPartners, Bear River Mutual will be able to take advantage of SNL’s unique P&C insurance data model which allows information to be intelligently loaded, stored and organized for fast and efficient retrieval. SNL also provides data integration expertise & a business intelligence front-end reporting solution that seamlessly connects to the data model to best support P&C insurers evolving business needs.\nBrian Long, VP IT at Bear River stated the following, ”We started this evaluation to solve a few key business challenges; first, we needed a P&C focused data model, properly structured and designed as our foundation for reporting. Second, we needed a data warehouse to combine data from multiple disparate sources. Finally, we needed best practice business content and analytics focused on our lines of business. We selected SNL iPartners after a thorough evaluation of many vendors. Their P&C insurance expertise & ability to collaborate with us became apparent after they successfully delivered on a proof of concept. Flexibility and customization of the model will help us to proactively manage our business now and support our reporting & analysis requirements in the future.”\n\"We are really excited to have Bear River Mutual join our client family,” remarked Tom DiMarco, Senior Director of Technology at SNL iPartners. “The challenges they are facing with regards to integrating disparate application source data is a common scenario today with many carriers moving from old legacy systems. We appreciate the team at Bear River Mutual selecting us and recognizing that we have the expertise in our team to deliver a successful customized P&C data model and BI reporting solution.\"\nSNL iPartners’ solution is designed specifically for the P&C industry. The suite is built around an insurance-specific data model and offers a complete analytics solution, including a data warehouse, performance management dashboards and scorecards, ad-hoc detailed analysis, production reporting, and drill to detail. The suite can be deployed either on premise or via the SNL cloud solution.\nAbout SNL iPartners\nSNL iPartners, a division of SNL Financial, provides P&C insurance data warehouse and business analytics solutions, enabling insurance executives to make higher quality and more timely decisions by delivering accurate, easy-to-use and relevant data through a suite of customized dashboards, scorecards, and a library of P&C specific key performance indicators delivered via Software as a Service (SaaS) or on premise. SNL iPartners clients now have the ability to combine their company's internal data with excellent SNL industry benchmarking and peer analytics data to create new business insights and more actionable information. For more information on SNL iPartners, please call toll free: 888.618.8360.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuYmVhcnJpdmVybXV0dWFsLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2lwYXJ0bmVycy5uZXQv"], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T07:59:30.516+03:00", "highlightTitle": ""}