{"organizations": ["Cerner", "McKesson", "KLAS", "CPSI", "Siemens", "KLAS Strategic Operations"], "uuid": "8dfcd6ba7047a11e38ad830bc98a7d82fcc29d9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.24-7pressrelease.com", "main_image": "http://www.24-7pressrelease.com/images/icon-247pressrelease.jpg", "site_section": "http://rss.24-7pressrelease.com/rss/business_finance.xml", "section_title": "Press Release and Top Business   Finance News From 24-7 Press Release Newswire", "url": "http://www.24-7pressrelease.com/press-release/athenahealth-and-epic-are-only-vendors-with-growth-and-no-losses-in-acute-care-emr-market-share-412121.php", "country": "US", "title": "athenahealth and Epic Are Only Vendors with Growth and No Losses in Acute Care EMR Market Share", "performance_score": 0, "site": "24-7pressrelease.com", "participants_count": 0, "title_full": "athenahealth and Epic Are Only Vendors with Growth and No Losses in Acute Care EMR Market Share", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T10:00:00.000+03:00", "replies_count": 0, "uuid": "8dfcd6ba7047a11e38ad830bc98a7d82fcc29d9e"}, "author": "", "url": "http://www.24-7pressrelease.com/press-release/athenahealth-and-epic-are-only-vendors-with-growth-and-no-losses-in-acute-care-emr-market-share-412121.php", "ord_in_thread": 0, "title": "athenahealth and Epic Are Only Vendors with Growth and No Losses in Acute Care EMR Market Share", "locations": ["UT", "Healthland", "OREM"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["KLAS KLAS", "Jon Christensen"], "text": "athenahealth and Epic Are Only Vendors with Growth and No Losses in Acute Care EMR Market Share KLAS Report \"Acute EMR Market Share: How Did My Vendor Fare?\" released today. \"There are a lot of interesting market dynamics that have made this year's market share report one of the most unique in recent years.\" OREM, UT, September 02,   In the report \" Acute EMR Market Share: How Did My Vendor Fare? \", which was recently released, KLAS reviewed nine vendors in the competitive EMR market. Although the number of acute care hospitals making a decision about an EMR dipped in 2014, 240 organizations still selected an EMR. According to the report, only three vendors--Epic, Cerner and athenahealth--posted a gain in market share in 2014. Of the nine vendors reviewed by KLAS, only two--athenahealth (formerly RazorInsights) and Epic--recorded zero clients moving away from their existing acute care EMR platforms in 2014. Epic led the list of vendors, posting the largest net increase of new hospitals. Cerner, who has the largest overall market share, due in large part to its acquisition of Siemens, was second in net new increases, followed by athenahealth. athenahealth nearly doubled its market share in 2014. \"There are a lot of interesting market dynamics that have made this year's market share report one of the most unique in recent years,\" said report author and KLAS Strategic Operations Director Jon Christensen. \"Some of these factors include vendor acquisitions, the overall number of hospital wins Epic had compared to the rest of the market, and the trend among legacy EMR hospital customers selecting competitive EMR products.\" As part of this study, KLAS interviewed large and small health systems and hospitals across the country about their EMR decisions. The vendors reviewed in this report are: Allscripts, athenahealth (RazorInsights), Cerner (Siemens), Epic, Evident (CPSI), Healthland, McKesson, MEDHOST (HMS) and MEDITECH. To access the \" Acute EMR Market Share: How did My Vendor Fare in 2014? \" report, visit www.klasresearch.com . About KLAS KLAS is a research and insights firm on a global mission to improve healthcare delivery by amplifying the provider's voice. Working with thousands of healthcare professionals and clinicians, KLAS gathers data and insights on software, services and medical equipment to deliver timely reports, trends and statistical overviews. The research directly represents the provider voice and acts as a catalyst for improving vendor performance. Follow KLAS on Twitter at www.twitter.com/KLASresearch . # # #", "external_links": [], "published": "2015-09-02T10:00:00.000+03:00", "crawled": "2015-09-02T13:08:09.202+03:00", "highlightTitle": ""}