{"organizations": [], "uuid": "df3cd5379d3f0e2641b3474699f1f484078e70e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/news-herald/rss/627", "section_title": "The News Herald    : Personal Finance", "url": "http://business-news.thestreet.com/news-herald/story/6-money-tips-for-new-parents/13305252", "country": "US", "title": "6 Money Tips for New Parents", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "6 Money Tips for New Parents", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T17:18:00.000+03:00", "replies_count": 0, "uuid": "df3cd5379d3f0e2641b3474699f1f484078e70e5"}, "author": "", "url": "http://business-news.thestreet.com/news-herald/story/6-money-tips-for-new-parents/13305252", "ord_in_thread": 0, "title": "6 Money Tips for New Parents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kristin Colella"], "text": "6 Money Tips for New Parents Written by: Kristin Colella 09/29/15 - 10:18 AM EDT \nNEW YORK ( MainStreet ) — Having your first child can be a joyful but overwhelming experience. Besides dealing with sleep deprivation, crying outbursts and diaper duty, moms and dads also have to navigate a completely new financial reality. \n\"Becoming a new parent is an exciting time, but it also brings to light the financial challenges you may face when you start a family,\" says Laura Knolle, a certified financial planner for Ballou Plum Wealth Advisors in Lafayette, Calif. \"Now in addition to saving for retirement, home projects and vacations, you have new expenses for your little bundle of joy.\" \nAlthough financial planning is probably the last thing you feel like thinking about when caring for an infant, money experts say it's best to get your ducks in a row as soon as possible to help manage costs and prepare for your child's future. In fact, new parents should start discussing and evaluating their finances as soon as they find out they're expecting (or better yet, before they even begin trying to get pregnant). More Headlines \nFrom understanding which doctor's visits will be covered to taking advantage of generous tax breaks, here are six essential money tips for new parents. \n1. Review Your Health Coverage \nIt might not be as exciting as picking out baby names and shopping for onesies, but expectant parents should take a close look at their health insurance plan. \n\"Review your health insurance benefits to understand what is covered and what may not be covered,\" says chartered financial analyst Marina Hayes, an investment advisor for PNC Wealth Management in Orlando. \"You'll want to go ahead and prepare yourself for the cost of your prenatal visits, childbirth and hospital stay.\" \nIt's a good idea to check whether your plan requires a copay for doctor's visits or if you're expected to pay 100% of each visit until you reach your deductible. If you do have a deductible, you should also check whether you're still required to pay a percentage of your bills after the deductible is met (called \"co-insurance\"). \n\"A great way to save for those expenses is through a health savings account (HSA) , which is tax-free savings that you can put toward medical expenses,\" says Hayes. \"If you have an HSA account, you can choose to save up to $3,350 for an individual and $6,650 for a family in 2015.\" \nAnother reason to review your plan carefully: \"Big-ticket items like breast pumps and even some baby formulas may be covered under your health insurance,\" says Lisa Hutter, a regional wealth planning manager for Wells Fargo Private Bank. \nAs soon as your baby is born, contact your insurance company to enroll him or her in your health insurance plan. If you're on an employer-sponsored plan, you may be required to contact your employer to add your baby to your insurance. \n\"Most plans allow 30 to 60 days from the birth of the child for this addition, but you don't want to forget,\" says David Henderson, a certified financial planner with Client One Securities in Greenwood Village, Colo. \"Nobody wants a surprise doctor bill for a 90-day checkup when you thought it was covered by insurance.\" 1", "external_links": [], "published": "2015-09-29T17:18:00.000+03:00", "crawled": "2015-09-29T17:53:16.896+03:00", "highlightTitle": ""}