{"organizations": [], "uuid": "ae0e5b427a0308e28c8fc7c9fe9eb37754c5f97f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12972915.htm", "country": "US", "title": "Building Materials Corporation of America Announces Cash Tender Offer", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Building Materials Corporation of America Announces Cash Tender Offer", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "ae0e5b427a0308e28c8fc7c9fe9eb37754c5f97f"}, "author": "David Silverman", "url": "http://www.prweb.com/releases/2015/09/prweb12972915.htm", "ord_in_thread": 0, "title": "Building Materials Corporation of America Announces Cash Tender Offer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Building Materials Corporation of America (the “Company” or “BMCA”) today announced the commencement of a cash tender offer for any and all of its outstanding 6¾% Senior Notes due 2021. The tender offer is being made pursuant to an Offer to Purchase, dated September 21, 2015, and a related Letter of Transmittal, dated September 21, 2015, which set forth a more detailed description of the tender offer.\nUpon the terms and subject to the conditions described in the Offer to Purchase, the Letter of Transmittal and any amendments or supplements to the foregoing, BMCA is offering to purchase, for cash, any and all $1,010 million outstanding principal amount of its 6¾% Senior Notes due 2021 (the “Notes”). The Company refers to its offer to purchase the Notes as the “Tender Offer.”\nHolders must validly tender their Notes at or prior to 5:00 p.m., New York City time, on October 2, 2015 (such date and time, as they may be extended, the “Early Tender Date”) to be eligible to receive the Total Consideration (as set forth in the table below). The Tender Offer will expire at 11:59 p.m., New York City time, on October 19, 2015, unless extended or earlier terminated (such date and time, as they may be extended, the “Expiration Date”).\nTitle of Security CUSIP No.: 6¾% Senior Notes due 2021; 120111 BL2 / U09005AM8\nPrincipal Amount Outstanding: $1,010,000,000\nTender Offer Consideration (1): $1,056.94\nEarly Tender Premium (1): $10.00\nTotal Consideration (1)(2): $1,066.94\n1Per $1,000 principal amount of Notes accepted for purchase.\n2The Total Consideration includes the Early Tender Premium and is payable only in respect to Notes which are validly tendered (and not validly withdrawn) at or prior to the Early Tender Premium Deadline and which are accepted for payment.\nBMCA’s obligation to accept for payment and to pay for any of the Notes in the Tender Offer is subject to the satisfaction or waiver of a number of conditions including the completion by BMCA of a public offering of not less than $1.1 billion in aggregate principal amount of Notes due 2025 no later than the Early Settlement Date on terms reasonably satisfactory to the Company. The Tender Offer is not contingent upon the tender of any minimum principal amount of Notes. BMCA reserves the right to waive any one or more of the conditions at any time.\nThe tender offer consideration for each $1,000 principal amount of the Notes validly tendered and accepted for purchase pursuant to the Tender Offer will be the tender offer consideration for the Notes set forth in the table above (the “Tender Offer Consideration”). If applicable, Notes that are validly tendered and not validly withdrawn at or prior to the Early Tender Date and accepted for purchase by BMCA will receive the Total Consideration, which is equal to the Tender Offer Consideration plus the Early Tender Premium, payable on the Early Settlement Date, all set forth in the table above. Notes validly tendered after the Early Tender Date but before the Expiration Date and accepted for purchase by BMCA will receive the Tender Offer Consideration, payable on the Final Settlement Date, but will not receive the Early Tender Premium.\nNotes that are tendered and accepted for purchase at or prior to the Early Tender Date will be settled only on the date that BMCA refers to as the “Early Settlement Date,” which will promptly follow the Early Tender Date. BMCA anticipates that the Early Settlement Date for the Notes will be the first business day after the Early Tender Date. Notes that are tendered and accepted for purchase after the Early Tender Date but before the Expiration Date, will be settled only on the date that BMCA refers to as the “Final Settlement Date,” which will promptly follow the Expiration Date. BMCA anticipates that the Final Settlement Date for the Notes will be the first business day after the Expiration Date.\nIn addition to the Tender Offer Consideration or the Total Consideration, as the case may be, all Notes accepted for purchase will also receive accrued and unpaid interest on those Notes from the last interest payment date to, but not including, the Early Settlement Date or the Final Settlement Date, as applicable.\nBMCA has retained Deutsche Bank Securities Inc. to serve as dealer manager for the Tender Offer. D. F. King & Co., Inc. has been retained to serve as the depositary and information agent for the Tender Offer.\nFor additional information regarding the terms of the Tender Offer, please contact Deutsche Bank Securities Inc. at (855) 250-7527 (toll free) or (212) 250-7527 (collect). Requests for documents and questions regarding the tender of securities may be directed to D. F. King & Co., Inc. at the telephone numbers set forth in the Offer to Purchase.\nThe Offer to Purchase and the related Letter of Transmittal are expected to be distributed to holders of Notes beginning today. Copies of the Offer to Purchase and the Letter of Transmittal related to the Tender Offer may also be obtained at no charge from D. F. King & Co., Inc\n.\nNeither BMCA, its board of directors, the information agent and depositary, nor the dealer manager make any recommendation as to whether holders of the Notes should tender or refrain from tendering the Notes.\nThis announcement does not constitute an offer to purchase or a solicitation of an offer to sell securities. The Tender Offer is being made solely by means of the Offer to Purchase and the related Letter of Transmittal. In any jurisdiction where the laws require a tender offer to be made by a licensed broker or dealer, the Tender Offer will be deemed to be made on behalf of BMCA by the dealer manager, or one or more registered brokers or dealers under the laws of such jurisdiction.\nAbout BMCA\nFounded in 1886, BMCA has become the largest roofing manufacturer in North America. The Company’s products include a comprehensive portfolio of steep-slope and commercial roofing systems, which are supported by an extensive national network of factory-certified contractors. BMCA’s success is driven by a commitment to provide property owners and specifiers with the best and safest choice in roofing and by helping supportive contractors and distributors to build their businesses and avoid hassles.\nUse of Forward-Looking Statements\nThis news release may contain “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and in the Private Securities Litigation Reform Act of 1995. Readers are cautioned not to place undue reliance on these forward-looking statements and any such forward-looking statements are qualified in their entirety by reference to the following cautionary statements. All forward-looking statements speak only as of the date of this news release and are based on current expectations and involve a number of assumptions, risks and uncertainties that could cause the actual results to differ materially from such forward-looking statements. BMCA disclaims any obligation to update or revise any forward-looking statements.\nBMCA Investor Contact:\nJohn Maitner, Senior Vice President, Treasurer & Chief Compliance Officer\n973-872-4324\njmaitner(at)gaf(dot)com\nBMCA Media Contact:\nDavid Silverman, Manager, Business Communication & Policy\n973-531-2869\ndsilverman(at)gaf(dot)com", "external_links": [], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T16:31:33.939+03:00", "highlightTitle": ""}