{"organizations": [], "uuid": "8cb91e7b2a85de4958696d19a99921f2d9944241", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/q/6/k/i/image.related.afrArticleLead.620x365.gjwx61.png/1443493412966.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/tony-abbott-urges-liberals-to-vote-for-turnbull-though-gritted-teeth-20150928-gjwx61", "country": "AU", "title": "Tony Abbott urges Liberals to vote for Turnbull 'though gritted teeth'", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Tony Abbott urges Liberals to vote for Turnbull 'though gritted teeth' | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T08:23:00.000+03:00", "replies_count": 0, "uuid": "8cb91e7b2a85de4958696d19a99921f2d9944241"}, "author": "Phillip Coorey", "url": "http://www.afr.com/news/politics/tony-abbott-urges-liberals-to-vote-for-turnbull-though-gritted-teeth-20150928-gjwx61", "ord_in_thread": 0, "title": "Tony Abbott urges Liberals to vote for Turnbull 'though gritted teeth'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony and Margie Abbott pack their cars before leaving Kirribilli House for the last time. Janie Barrett The Liberals won Canning by 55 per cent to 45 per cent. Mr Abbott said he would have led the government to a \"convincing victory\" at the next federal election.\nMr Abbott also shot down theories that he would have survived had he moved earlier to dump Joe Hockey as Treasurer and removed his chief of staff Peta Credlin, claiming those out to get him would have stopped at nothing.\n\"The idea that people who were hungry for advancement would somehow be mollified if Joe went or if my chief of staff went is just nonsense,\" he said.\n\"When someone is absolutely focussed on a particular objective, they're not going to be put off if they're thrown a few human sacrifices as it were and frankly, it's wrong to feed this particular beast.\"\n Appealing to Liberal voters dismayed with his dumping, Mr Abbott said Australia did not need a sixth prime minister in six years.\n\"It would be even worse if we were to end up with a CFMEU-dominated government, which we could well do at the next election,\" he said.\n\"Even if they have to do it through gritted teeth, support the Coalition, support the Prime Minister, support the government.\"\nMr Abbott also disputed a claim by Scott Morrison that the now-Treasurer tried to warn Mr Abbott of the brewing leadership coup three days before it was sprung on Monday, September 14.\n\"Certainly, there was a conversation as I understand it between Scott and Peta Credlin. He's obviously put one construction on the conversation, my office put a different construction on the conversation,\" he said.\n\"It's probably a bit counterproductive to revisit all of this now, the last thing I want Ray, to come out of this interview is a headline 'Abbott slams Morrison'.\n\"In the end, I suppose all of us have got to answer to our God and our consciences, I'm just not going\nto get into who might have said what, who should have said what, to whom and when.\"\nMr Abbott declined to be drawn on the actions of Julie Bishop or Mr Morrison, both of whom were critical to his ousting.\nHe said they were \"extremely effective ministers in my government\" and \"I'd expect them to continue to be very effective ministers in the new government\".\nMr Abbott called for an end to what he called \"the revolving door prime ministership\".\n\"This is a real problem for our country because the last four changes of prime minister, only one has been at the hands of the people, the other three have been at the hands of what the public would think is a backroom cabal,\" he said.\n\"The difficulty with the revolving door prime ministership is that Government can't do what is necessary for the long-term good of our country if you're subject to death by polls and then ultimately a partyroom coup.\n\"It's very difficult to do the right thing by our country if this kind of thing happens. My hope is that what happened a fortnight ago finishes all of this stuff.\"\nHe urged Liberal MPs to \"stick with the leader\" through ups and downs because \"people of character and steadiness don't panic at the polls, they stick with good policy\".\nHe repeated his claim that there was nothing untoward about his leadership because Mr Turnbull had adopted the same policies and language.\n\"The interesting thing is that no policy has changed since the change of prime minister,\" he said.\nHe listed same-sex marriage, climate change, border protection policy, and national security, policy.\nAnd both Mr Turnbull and Mr Morrison were \"even using exactly the same phrases that Joe Hockey and I were using\" such as Australia has a spending problem, not a revenue problem.\n\"We do want lower simpler fairer taxes, we are building for the future, these were things that I said that Joe said and now of course Malcolm and Scott are saying because they're right, they're absolutely right,\" he said.\nMr Abbott thanked Hadley for campaigning for him in Opposition and government.\n\"Thank you for six good years and I really am very, very grateful,\" he said.\nHadley asked if Mr Abbott was okay in terms of his mental health.\nMr Abbott said he was fine and he had no immediate plans to quit politics.\n\"I always knew that politics was a pretty brutal business. It's a game of snakes and ladders and yes I've hit a snake,\" he said.\nHe listed his achievements as stopping the boats, abolishing the mining and carbon taxes, starting the task of budget repair, sealing three free trade agreements, moving ahead with the second Sydney airport at Badgery's Creek, ending business welfare, starting the Royal Commission into Trade Union Governance and Corruption, and \"ending the , green veto on big projects\".\nMr Abbott was ousted in a coup on September 14. He lost to Mr Turnbull by 54 votes to 44 votes. The next day, he promised not to destabilise his successor.\n\"Leadership changes are never easy for our country,\" Mr Abbott said on September 15.\n\"My pledge today is to make this change as easy as I can. There will be no wrecking, no undermining, and no sniping.\"\nPrior to the Hadley interview, he has given The Daily Telegraph two interviews and one to The Australian.\nAgriculture Minister Barnaby Joyce, a Nationals MP, said on Monday night he believed Mr Abbott would have stepped aside before the election had it become apparent to him he could ot have won.\n\"I think that what would have been better, to be honest, is if Tony had stepped down,\" he told the ABC's Q&A program.\n\"It was becoming quite clear that the polls were saying it was unlikely he would be able to win, I don't think Tony would have taken us over a cliff.\"\nFormer Queensland Premier Campbell Newman, whose government was booted out after one term, told the ABC's 7.30 program on Monday night that the changed media environment and tougher community attitudes made it harder to govern.\n\"The more you try and do, the more controversy, you'll be ripped apart in this black and white environment of reporting and what masquerades as debate,\" Mr Newman said.\n\"The message is the less you do, the less you take on vested interests, the less you want to undertake reform, the more you'll be rewarded in the polls.\n\"And that's a sad state of affairs.\"", "external_links": [], "published": "2015-09-29T08:23:00.000+03:00", "crawled": "2015-09-29T08:09:26.299+03:00", "highlightTitle": ""}