{"organizations": [], "uuid": "66bd6c8f0c99d4a3553e288266c33de42e73cee5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources.news.com.au/cs/newscomau/images/placeholders/story-thumb-large.jpg", "site_section": "http://www.news.com.au/finance/business/breaking-news", "section_title": "Business Breaking News | Finance &amp; Business News | News.com.au", "url": "http://www.news.com.au/finance/business/harvard-starts-virtual-classroom/story-e6frfkur-1227510618827", "country": "AU", "title": "Harvard starts 'virtual classroom'", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Harvard starts 'virtual classroom'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "66bd6c8f0c99d4a3553e288266c33de42e73cee5"}, "author": "Collin Binkley", "url": "http://www.news.com.au/finance/business/harvard-starts-virtual-classroom/story-e6frfkur-1227510618827", "ord_in_thread": 0, "title": "Harvard starts 'virtual classroom'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE newest classroom at Harvard University's business school has no desks or chairs. Instead, the professor teaches facing a towering digital screen that stretches from wall to wall, filled with the live video feeds of up to 60 students tuned in from their computers.\nIN the futuristic classroom, housed in a television studio three kilometres from campus, class plays out like a giant video conference.\nStudents can jump in to ask questions or respond to their classmates. The professor can stop a lecture to quiz individual students, or send the group a quick online poll. The project, called HBX Live, is a departure from the genre of online courses that are recorded in advance to be taken later. Here, Harvard sought to create a live, online replica of its campus classrooms. \"With one difference, of course, which is we collapse geography,\" said Bharat Anand, a business professor and faculty chairman of HBX, a digital initiative at the school. At a recent test of the technology, alumni connected to the room from Thailand, New Zealand and the Philippines. \"That's something we've never, ever done before,\" Anand said. This school year, Harvard will use HBX Live to teach its business students when they disperse on global study trips in January, and to host virtual research presentations. Eventually, the school will consider creating new online programs taught primarily through the room, Anand said. Although the technology isn't widespread, experts said, some other schools have experimented with the concept of a live web-based classroom. At Yale University's business school, students around the world can take online courses taught through video conferences. The University of California San Diego created a computer program that puts students in a virtual world, like a video game, where they can take seminars and interact. \"People have been trying to do video conferencing in education for a long time, going back to the '80s,\" said Frank Vahid, a professor of computer science at the University of California, Riverside, and co-founder of the online-education company zyBooks. Technology improvements have boosted that pursuit in recent years, Vahid said, both in the classroom and in the business world. \"Certainly in the corporate world, the quality of web conferencing has become very advanced,\" he said. Although the idea isn't entirely new, Harvard put a twist on it by approaching the project like a live television production. To learn the trade, school officials visited NBC Sports studios in Connecticut and studied reality TV shows. The school hired a production crew that sits in a control room above the studio, broadcasting the class to students with the cinematic polish of a cable news show. Crew members toggle between dozens of cameras trained at the professor, lingering only a few seconds on each angle. One worker roams around the professor with a hand-held camera, aiming to give students a sense of movement. Harvard hasn't disclosed how much it spent on the classroom and its crew. ", "external_links": ["http://www.myspace.com/index.cfm?fuseaction=postto&t=Harvard+starts+%27virtual+classroom%27&c=HARVARD+University%27s+business+school+starts+a+virtual+classroom+in+which+students+can+ask+the+lecturer+questions+and+interact+with+other+students.&u=http://www.news.com.au/finance/business/harvard-starts-virtual-classroom/story-e6frfkur-1227510618827?sv=824d61e47309b9abf7c5c4d356f0bee0", "http://www.kwoff.com/submit.php?url=http://www.news.com.au/finance/business/harvard-starts-virtual-classroom/story-e6frfkur-1227510618827?sv=824d61e47309b9abf7c5c4d356f0bee0", "http://www.newsvine.com/_wine/save?popoff=0&u=http://www.news.com.au/finance/business/harvard-starts-virtual-classroom/story-e6frfkur-1227510618827?sv=824d61e47309b9abf7c5c4d356f0bee0&h=Harvard+starts+%27virtual+classroom%27", "http://digg.com/submit?phase=2&url=http://www.news.com.au/finance/business/harvard-starts-virtual-classroom/story-e6frfkur-1227510618827?sv=824d61e47309b9abf7c5c4d356f0bee0&title=Harvard+starts+%27virtual+classroom%27", "http://del.icio.us/post?url=http://www.news.com.au/finance/business/harvard-starts-virtual-classroom/story-e6frfkur-1227510618827?sv=824d61e47309b9abf7c5c4d356f0bee0&title=Harvard+starts+%27virtual+classroom%27", "http://www.facebook.com/share.php?u=http://www.news.com.au/finance/business/harvard-starts-virtual-classroom/story-e6frfkur-1227510618827?sv=824d61e47309b9abf7c5c4d356f0bee0"], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-04T16:22:09.974+03:00", "highlightTitle": ""}