{"organizations": ["International Energy", "International Energy Team", "AGM Energy"], "uuid": "da0fea589d0cd785dbf2435fcc432d5e5e2c45ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-businesswire/?format=rss", "section_title": "Finance News | Business Wire - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/ace-announces-six-appointments-international-095400979.html", "country": "GB", "title": "ACE Announces Six Appointments in International Energy Team; Promotes Matthew Hardy to the Role of Head AGM Energy and Head of International Energy, AOG", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "ACE Announces Six Appointments in International Energy Team; Promotes Matthew Hardy to the Role of Head AGM Energy and Head of International Energy, AOG", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T12:54:00.000+03:00", "replies_count": 0, "uuid": "da0fea589d0cd785dbf2435fcc432d5e5e2c45ad"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ace-announces-six-appointments-international-095400979.html", "ord_in_thread": 0, "title": "ACE Announces Six Appointments in International Energy Team; Promotes Matthew Hardy to the Role of Head AGM Energy and Head of International Energy, AOG", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matthew Hardy"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 1, 2015, 11:07 BST - UK Markets close in 5 hrs 23 mins ACE Announces Six Appointments in International Energy Team; Promotes Matthew Hardy to the Role of Head AGM Energy and Head of International Energy, AOG Press Release : ACE Group – 13 minutes ago -0.55 \nLONDON--(BUSINESSWIRE)-- \nACE Group today announced six appointments to its ACE Global Markets (AGM) and ACE Overseas General (AOG) energy teams, as the company continues to build its presence across the world’s energy insurance markets. All appointments are based in London and are effective immediately. \nMatthew Hardy has been appointed Product Head AGM Energy and Head of International Energy, AOG. In his new role, Matt will head ACE’s efforts to develop and deliver innovative solutions for AGM energy clients’ complex international operations and risk management needs. \nMatt joined ACE 19 years ago and has steadily progressed from Assistant Underwriter to Head of Onshore Energy to Chief Underwriting Officer, ACE Overseas General Energy and most recently Head of International Energy Division. In his new role he will report to Matthew Shaw, Divisional President, ACE Global Markets and Roger Giddings, EVP, Global Energy, AOG. \nAndy Brown has been promoted within the AOG Energy team to Global Head of Downstream Energy from his previous position of Senior Underwriting Officer. In his new role, Andy will lead the efforts to increase ACE’s global presence and enhance local access to ACE’s energy capabilities internationally in the downstream energy sector. \nAndy joined ACE nine years ago as an Underwriting Assistant, and has held a number of roles within energy since, including Senior Underwriter and Senior Underwriting Officer, AOG Energy. In his new role he will report to Matt Hardy. \nFurther to these two appointments, the following promotions in AGM Energy have been made, also reporting into Matt Hardy. \nRiaz Thanduparakkal has been promoted from his previous position of Energy Underwriter to Senior Underwriter. Riaz has 13 years of experience in the industry. He began his career as a Client Manager at Oman Insurance Co in Dubai. He moved to London in 2006, where he worked at Marsh as a Client Manager in the Energy Practice. He joined ACE in 2011 as an underwriter in the upstream team. \nGeorge Foxall and Chris Fagan are both promoted from Assistant Underwriter to Underwriter. George joined the London energy team five years ago as Trainee Underwriter working across both the upstream and downstream units, receiving his authority to underwrite both product lines in June 2013. Chris joined ACE in May 2008 as an Underwriting Assistant for upstream and downstream and promoted to Assistant Underwriter working across both units in 2012. \nMatt Bilbey has been promoted to Assistant Underwriter. Matt began his career in insurance in September 2013 with ACE, as Trainee Underwriter in the Energy team. \nMatthew Shaw, Divisional President, ACE Global Markets, said: \n“The world-wide energy sector continues to face a series of challenges and the energy insurance markets remain highly competitive. These promotions enhance our AGM and AOG energy underwriting capabilities and underline our commitment to further support our clients through the current uncertain global environment. I am looking forward to working with them in their new roles as we work to further position ACE for continued success as a leading player in energy insurance.” ENDS \nAbout ACE: \nACE Group is one of the world’s largest multiline property and casualty insurers. With operations in 54 countries, ACE provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance and life insurance to a diverse group of clients. ACE Limited, the parent company of the ACE Group, is listed on the New York Stock Exchange (NYSE: ACE) and is a component of the S&P 500 index. Visit www.acegroup.com/eu View source version on businesswire.com: http://www.businesswire.com/news/home/20150901005722/en/ Contact", "external_links": [], "published": "2015-09-01T12:54:00.000+03:00", "crawled": "2015-09-01T13:08:10.160+03:00", "highlightTitle": ""}