{"organizations": ["CFTC"], "uuid": "0325c95077d2a7d53663c4feab6db52a9677259b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/forex/wp-content/uploads/sites/8/2015/05/Warning.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/forex/regulation/cftc-cracks-down-on-forex-and-binary-options-brokers-with-new-red-list/", "country": "US", "title": "CFTC Cracks Down on Forex and Binary Options Brokers with New RED List", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "CFTC Cracks Down on Forex and Binary Options Brokers with New RED List", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T23:59:00.000+03:00", "replies_count": 0, "uuid": "0325c95077d2a7d53663c4feab6db52a9677259b"}, "author": "", "url": "http://www.financemagnates.com/forex/regulation/cftc-cracks-down-on-forex-and-binary-options-brokers-with-new-red-list/", "ord_in_thread": 0, "title": "CFTC Cracks Down on Forex and Binary Options Brokers with New RED List", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CFTC Cracks Down on Forex and Binary Options Brokers with New RED List CFTC Cracks Down on Forex and Binary Options Brokers with New RED List The list is the latest tool to snuff out illegal practices, helping investors identify unregistered foreign entities. Advertising Print This Post \nThe U.S. Commodity Futures Trading Commission (CFTC), the independent agency that regulates futures and option markets, today launched a new website on which it warns U.S. retail traders of foreign companies that are operating in the country without formal permission. \nShort for “Registration Deficient List”, the RED list follows other examples from regulators abroad, such as the AMF (Autorité des marchés financiers) in France, which allow investors to identify unregistered foreign entities that may be engaged in illegal practices. \nIndeed, those foreign exchange (forex) and binary options brokers that appear to be soliciting and/or accepting funds from U.S. residents without having obtained CFTC registration are published on the new site , providing transparency for investors. \nAccording to the CFTC, many of these foreign entities are acting in a capacity that requires them to be registered with the CFTC. Registration allows the agency to provide greater security and oversight of the industry by examining whether firms meet minimum financial standards as well as disclosure, reporting, and recordkeeping requirements, for example. \nThe RED List is an important new tool that will further protect customers from bad actors. \nCommenting on the launch, Tim Massad, CFTC Chairman, said: “Today, I’m pleased we are launching the RED List, an important new tool that will further protect customers from bad actors. This initiative will allow people to make more informed decisions about investing.” \nThe RED list is part of a broader drive by the agency to help investors identify and protect themselves against financial fraud. \nGot a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-09-09T23:59:00.000+03:00", "crawled": "2015-09-09T21:26:46.728+03:00", "highlightTitle": ""}