{"organizations": [], "uuid": "e93f0cfb224d23025e717457fccb0999b10ea292", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/o/k/e/7/image.related.afrArticleLead.620x365.gjt5n9.png/1443005230144.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/private-equity/whats-an-analyst-report-worth-wall-street-is-about-to-find-out-20150923-gjt5n9", "country": "AU", "title": "What's an analyst report worth? Wall Street is about to find out", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "What's an analyst report worth? Wall Street is about to find out | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T16:04:00.000+03:00", "replies_count": 0, "uuid": "e93f0cfb224d23025e717457fccb0999b10ea292"}, "author": "Dakin Campbell", "url": "http://www.afr.com/business/banking-and-finance/private-equity/whats-an-analyst-report-worth-wall-street-is-about-to-find-out-20150923-gjt5n9", "ord_in_thread": 0, "title": "What's an analyst report worth? Wall Street is about to find out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For many traders corporate research has been essentially free. Now analytics companies are finding ways to restrict their output, putting a real price on it for the first time. MARCUS YAM by Dakin Campbell Wall Street banks may have finally hit on a way to pinpoint the value of analysts and squeeze more money from their research: Stop making it so easy to share.\nBank of America has started embedding analysts' reports into web pages, so it can more easily restrict access than with PDF files that are widely shared with people who aren't paying clients, said Candace Browning, the firm's head of research. It's joining rivals Morgan Stanley and Citigroup in limiting access, and more plan to follow. The approach also makes it easier to track analysts' readership and customize products for specific types of clients, according to bank executives and consultants.\n\"The sell side for years has had a model where it blasts out everything it produces,\" said Michael Mayhew, founder of Integrity Research Associates, which helps investors find the research they need. \"This is an absolutely necessary next step because they have to understand what their customers are consuming.\"\nThe main goal is to restore profitability to Wall Street research following a slew of new regulations in the past 15 years, including rules spurred by allegations that analysts touted stocks under pressure from investment bankers. But it also may provide key data in a debate that erupts every bonus season and job cull: How important, really, is analyst research to winning trades and other deals?\nAnother chapter \"This is simply another chapter in the unending quest for revenue clarity in institutional equity trading,\" said Brad Hintz, a former chief financial officer of Lehman Brothers Holdings Inc. who last year ended a 14-year career as an analyst. Traders often win the credit for generating commissions on transactions that analysts feel they deserve, he said. \"Maybe this time, technology will finally provide the answer to that age-old question: 'Whose commission dollar is this?'\"\nThe first big hit to modern stock research came in a 2000 rule requiring companies to disclose material information to all investors at once, making it harder for analysts to break market-moving news. Then a scandal led to the 2003 walling off of analysts from investment bankers, who sometimes pressed them to tout clients' stocks. A third obstacle is unfolding, as regulators in Europe are considering ending the commission-based model, the industry standard which compensates banks for research with a share of an investment firm's trading revenue.\nThe developments have prompted many firms to eliminate analysts. Also frustrating for executives is that a lot of research ends up in some form on Internet platforms such as Twitter minutes after release.\n Banks and brokerages will spend $US3.4 billion on their research analysts around the world in 2017, down by more than half from $US8.2 billion in 2008, according to Neil Scarth, a principal at Frost Consulting in London. That doesn't include costs for technology, sales and other methods of distribution.\nMoney managers cut the amount they spend on commissions by about 26 percent after the 2008 financial crisis to $US22.7 billion last year, according to Greenwich Associates, a Stamford, Connecticut-based consulting firm. Between 55 percent and 60 percent of those fees typically go to research each year.\nBloomberg News parent Bloomberg LP also offers research products through its Bloomberg Intelligence division.\nOld habits Investors consume almost two-thirds of research via e-mail, according to a bank executive who studies readership patterns and asked not to be identified talking about proprietary data. Most others get it from platforms such as those run by Bloomberg or Thomson Reuters that provide access to reports from multiple brokers. Bank websites account for less than 10 percent of consumption.\nWhile the web technology is hardly new, banks have been slow to take full advantage of it for analysts' notes. Investors will still access research the same way -- through an e-mailed link or a company website -- but what they see will change. Instead of a PDF that could be viewed, downloaded or shared with others, they'll be directed to a secure Web page.\nBank of America has been tracking clients' habits for years through e-mails and a website where customers can see and download reports. But it doesn't know what happens after they save them. Under the new system, clients must access a site to view material that stays there, much as they would peruse a favourite newspaper behind a paywall, according to Daire Browne, Bank of America's chief operating officer for global research. The pages are more dynamic than a PDF and will have more security, making them harder to recirculate, he said.\n\"You're not accessing a static PDF, you're going into a website and you are authenticating,\" Browne said. \"That's the whole premise here, that you have a greater ability to control the access coming in when it's a living, breathing environment that we control.\"\nAt Citigroup, clients receive an e-mail with just a few sentences about a report. Clicking a link takes them to a website where they can sign in to read the rest. This lets the firm track how many times a report has been viewed, how often clients access the system and which analysts are most popular. The system was put in place within the past year.\nGuessing trades At least one money manager who asked not to be identified said he isn't thrilled about being monitored. He said he's concerned that banks might figure out his trades based on what he's reading. Bank of America doesn't zero in on what individuals view and looks only at aggregate data, according to Browne. Spokeswomen for Citigroup and Morgan Stanley declined to comment.\nBanks also are fighting internal resistance. Analysts and sales staff have for years made it as easy as possible for clients to get reports, according to Mayhew. Until firms can persuade employees to change behaviour, or prohibit PDF attachments, it will be difficult to prevent sharing, he said.\nThe next step, still to come for most banks, is to customize offerings to specific clients. Citigroup, Morgan Stanley and others are part of a group that has come up with a coding language intended to make it easier to search reports. Banks also may tailor the reports to, say, macro traders or stock buyers by adding or subtracting components they find most valuable such as charts or models, according to a bank executive.\n\"Over time, there is a prospect of premium prices,\" Frost's Scarth said.\nFirms also are rethinking long-accepted practices of tracking client conversations with analysts, as well as attendance at bank-sponsored conferences and meetings with management. UBS Group AG, for example, is considering the amount of time spent with analysts in a model that assigns a higher value to a 30-minute phone call than one lasting 10 minutes, according to a person familiar with the Zurich-based bank's policies.\n\"The fact is there is a lot of stuff produced by Wall Street that probably nobody would pay for,\" Scarth said. \"This should, in theory, force all research producers to specialize in areas where they really do have a competitive advantage.\"", "external_links": [], "published": "2015-09-23T16:04:00.000+03:00", "crawled": "2015-09-23T16:12:24.041+03:00", "highlightTitle": ""}