{"organizations": [], "uuid": "65527183bed8a81ec34be13622ef9abef9bbfee6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/uk-may-not-manufacturing-powerhouse-182848112.html", "country": "US", "title": "The UK may not be a manufacturing powerhouse anymore, but here's why our economy can still thrive", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "The UK may not be a manufacturing powerhouse anymore, but here's why our economy can still thrive", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T21:28:00.000+03:00", "replies_count": 0, "uuid": "65527183bed8a81ec34be13622ef9abef9bbfee6"}, "author": "", "url": "https://uk.finance.yahoo.com/news/uk-may-not-manufacturing-powerhouse-182848112.html", "ord_in_thread": 0, "title": "The UK may not be a manufacturing powerhouse anymore, but here's why our economy can still thrive", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 25, 2015, 19:46 BST - UK Markets closed The UK may not be a manufacturing powerhouse anymore, but here's why our economy can still thrive By Andrew Sentance | Telegraph – 18 minutes ago 93.31 -1.10 \nWe need nvestment in a highly skilled and educated workforce, a flexible labour market that supports job creation, and a business-friendly economic climate which encourages investment and growth \nRecently, we have seen some negative news about the British manufacturing industry. Last week, the CBI reported that manufacturing growth had stalled after two-and-a-half years of consistent rises. \nThis is in line with the picture portrayed by official industrial production figures which show a significant slowdown in output growth since last summer. In the north-east of England, production has been paused at the Redcar steel plant , creating worries about potential job losses. \nThe manufacturing industry in the UK is feeling the cold wind from the East and the difficulties in the Chinese economy. China produces about half of the world’s steel, whereas the UK produces less than 1pc. The difficulties in the Chinese economy are depressing the price of steel and other manufactured products, and the UK is inevitably affected by these global trends. \nBritain is no longer the “workshop of the world”. Redcar is one of only seven large integrated steel plants left in the UK. But just because we do not manufacture products on the scale we once did, that does not mean the outlook for British manufacturing is poor. \nOne of the success stories for UK manufacturing is the car industry, where production in August was 40pc up on a year ago. In the eight months of this year so far, the UK has produced more than 1m cars for the first time since 2008 . Hi-tech UK companies like Cambridge-based ARM Holdings (LSE: ARM.L - news ) are also doing well. British manufacturing success these days is less about churning out large volumes of metal. It (Other OTC: ITGL - news ) is more about how we use our brains, skills and technology to make the more sophisticated products the world is demanding. \nThat inevitably means that manufacturing in the UK employs fewer people. Technology, machines and high-skilled workers not manual labour - are at the centre of the industries where we can now prosper and succeed in world markets. The share of the workforce employed by British manufacturers was around 30pc-35pc throughout the 19th century and continued around the same level until the 1960s. But from then on, there has been a steady decline. About 8pc of UK jobs are now in the manufacturing industry but we are now much more productive and efficient. UK manufacturing exports last year totalled £224bn about £8,400 for every household in the country. \nCan the UK economy prosper with such a small share of employment in manufacturing? I believe we can, for four main reasons. \nFirst (Other OTC: FSTC - news ) , the manufacturing businesses which remain in the UK are highly successful, innovative and productive. Inevitably, problems like the Chinese slowdown will create difficulties in some sectors of the economy; and the UK no longer holds the commanding heights in sectors like steel, shipbuilding, chemicals and other bulk manufacturing activities. But we still have world-leading companies in sectors like aerospace, pharmaceuticals and advanced engineering. \nThe backbone of British manufacturing these days is provided by medium-sized companies employing between 200 and 1,000 workers, which have very well established positions in their markets and are investing and innovating continually to sustain their success. I visited many of these companies when I was a member of the Monetary Policy Committee between 2006 and 2011, and was highly impressed by their resilience in the very testing times of the global financial crisis. The profitability of UK companies bears this out. In 2014, the net rate of return in British manufacturing was 10.8pc, the highest since 1999. \nSecond, the UK provides a very attractive climate for investment and jobs in a wide range of sectors, not just manufacturing. Compared with other European countries we have very flexible labour markets, relatively low tax rates on profits and labour income, and a business-friendly approach to regulation. Our transport infrastructure needs to be improved and in some areas skills are lacking. \nBut the UK continues to be an attractive location for business within the EU, attracting recent strategic investments by Hitachi (Other OTC: HTHIF - news ) and other foreign multinationals. \nThird, we are a very successful services exporter. We have the highest ratio of services exports to GDP in the G7 economies by a long way 12pc, compared with around 8pc in France and Germany, 4pc in the US and 3pc in Japan. Our trade surplus on services in 2014 was £86bn, with financial services, business and professional services, IT industries and creative activities like design, fashion and the media all contributing. This services surplus more than covered the £82bn deficit in manufactured trade last year. \nFinally, the UK has many of the ingredients needed to support the growth of new companies, either in manufacturing or services, which will drive success in the 21st century economy. Many ideas that lead to new businesses being set up and succeeding come out of university research programmes. \nWe have seen this happening on the West Coast of the US, which has spawned successful hi-tech businesses like Microsoft (NasdaqGS: MSFT - news ) , Google (Xetra: A0B7FY - news ) and Facebook (NasdaqGS: FB - news ) . \nThe top UK universities are very successful with Oxford, Cambridge, University College London and Imperial College taking up four of the top 10 university rankings ( compiled by QS ). London School of Economics, Kings College London, Edinburgh and Warwick also feature in the top 50 world-ranked universities. The UK needs to work harder at converting this academic prowess into business success and making sure that more of our universities and colleges are featuring in the higher levels of the world league tables. \nManufacturing in the UK may not be the dominant force in the economy that it was between the Industrial Revolution and the 1960s, but it is still a vital contributor to the way we pay our way in the world, sustain our standard of living and generate new jobs. \nIn his 2011 Budget, George Osborne talked about how he wanted to encourage a “march of the makers”. That is not what has happened manufacturing success cannot be turned on and off like a tap by a few government policy announcements. British manufacturing will succeed on the basis of the fundamentals that support the rest of our economy investment in a highly skilled and educated workforce, a flexible labour market that supports job creation and a business-friendly economic climate which encourages investment and growth. \nBritain can still make competitive and attractive manufactured products but we need a successful services industry, too. Both are needed if the UK economy is to continue to prosper in the 21st century.", "external_links": [], "published": "2015-09-25T21:28:00.000+03:00", "crawled": "2015-09-25T21:47:04.184+03:00", "highlightTitle": ""}