{"organizations": ["Volkswagen"], "uuid": "30fbf2851b3ebbd1835e27f56fcc9e6766378aac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/22/590x/volkswagen-germany-607355.jpg", "site_section": "http://express.co.uk//posts/rss/21/finance", "section_title": "Daily Express :: Finance Feed", "url": "http://www.express.co.uk/finance/city/607355/Volkswagen-scandal-hit-eurozone-Germany-economy-car-industry-experts", "country": "", "title": "Volkswagen scandal could hit the eurozone's economy, say experts", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Volkswagen scandal could hit the eurozone's economy, say experts", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T13:51:00.000+03:00", "replies_count": 0, "uuid": "30fbf2851b3ebbd1835e27f56fcc9e6766378aac"}, "author": "", "url": "http://www.express.co.uk/finance/city/607355/Volkswagen-scandal-hit-eurozone-Germany-economy-car-industry-experts", "ord_in_thread": 0, "title": "Volkswagen scandal could hit the eurozone's economy, say experts", "locations": ["Germany", "Wolfsburg"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Volkswagen scandal could hit the eurozone's economy, say experts Volkswagen scandal could hit the eurozone's economy, say experts THE Volkswagen scandal could make a huge dent in Germany's economy and drag down the eurozone as the fallout from the threatens to boil over, experts have warned. PUBLISHED: 11:51, Wed, Sep 23, 2015 | UPDATED: 12:02, Wed, Sep 23, 2015 REUTERS The Volkswagen power plant in Wolfsburg, Germany \nEurope's largest car maker is facing up to £11.6billion in fines and billions more in costs and lost profits after 11million cars are thought to have cheated their way through pollution tests . Critics have already started to questioned whether Volkswagen acted as a lone wolf - or whether the deception has been an industry-wide practice. If it's a case of the latter, the German economy and financial powerhouse of Europe looks extremely vulnerable. Germany has the largest euro economy but is hugely dependent upon the car industry. It's estimated that one in six German jobs depends on the car industry, as well as 17.9 per cent of the country's exports. Michael Hewson, chief maker analyst at CMC Markets, said: \"A particular worry is the spill over effects this drama surrounding Volkswagen will have on the wider German economy in the weeks and months ahead at a time when there appears to be some evidence that growth may well be slowing in the euro area.\"This week’s events have put a huge dent in the panel work of how the German automotive industry is perceived by its customers globally.\"The implications for German GDP growth could well be significant in the coming months, if global trust is lost, not only for VW but also the rest of the European car industry, if evidence is uncovered that we aren’t seeing an isolated case.\"Germany underpins the eurozone with many of the single currency countries, including Spain, Greece, Italy - and France - battling huge debts and stagnant economies. Mr Hewson added: \"With Europe’s second biggest economy in France already struggling, with GDP expected to be confirmed at 0 per cent, Europe can ill afford a setback to its main growth engine of Germany.\" Related articles Volkswagen recall: British cars to be called back as boss admits... \nVolkswagen shares dropped by almost 20 per cent Monday, a further 18 per cent on Tuesday and looks set for further losses in today's trading. Amid concern over what the cries means for the rest of the car industry Daimler, Mercedes, BMW and Porsche have also seen their share price take a hit. Since the scandal broke on Friday, Germany's top share index the DAX has shed almost six per cent of its value. Financial Express research analyst Charles Younes, said: \"What has happened has the potential to really affect VW long-term, and in turn the wider German and European auto sector. \"Especially as the American consumer-base has traditionally viewed European cars as cleaner than their US counterparts.“This news will have huge reputational and financial implications – and when you consider that Germans are viewed as above board and there is a level of trust readily given manufactures from that country – the ramifications can continue for years.\" Related articles", "external_links": [], "published": "2015-09-23T13:51:00.000+03:00", "crawled": "2015-09-23T16:31:45.392+03:00", "highlightTitle": ""}