{"organizations": [], "uuid": "a56033ef8108c73d85744c1be56e61f3f25a9296", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/stocks-ap-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/indian-markets/emerging-markets-catch-yellen-fever/136381", "country": "IE", "title": "Emerging markets catch Yellen fever", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Emerging markets catch Yellen fever | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T09:04:00.000+03:00", "replies_count": 0, "uuid": "a56033ef8108c73d85744c1be56e61f3f25a9296"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/indian-markets/emerging-markets-catch-yellen-fever/136381", "ord_in_thread": 0, "title": "Emerging markets catch Yellen fever", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Maintain buy on Federal Bank, target Rs 82: Edelweiss Maintain buy on Tata Motors, target Rs 488: Motilal Oswal 'Fed hike unlikely to spook Indian markets' As the world waits for the US Federal Reserve to take a call on raising interest rates, foreign investors continue to pull out money from the Indian stock markets with close to $1 billion of sales in September so far on the back of $2.6 billion in August. Since July, most emerging markets have seen money move out: While markets like Taiwan and Thailand saw outflows of more than $2billion, South Korea led the liquidation with an outflow of $6.6 billion.\nThe slowdown in the Chinese economy and the turmoil in its stock markets have spooked investors — while $8.5 trillion billion of market wealth has been wiped out globally, in India the damage has been $132 billion.\nThe weakness in Chinese markets — the Shanghai Composite has lost more than 40% of its value since its peak in June 2015 — and the likelihood of a further devaluation of the yuan remain risks. For economies like India, a cheaper yuan hurts exports though softer commodity prices are a boon since the country is a net importer of oil. Exports fell for the ninth straight month in August to $21.3 billion.\nAccording to a survey by Bank of America Merrill Lynch in August, 48% of 162 fund managers expect the Fed to hike the interest rate in the third quarter of 2015, up from 40% in July. If the Fed does increase interest rates, it would be the first hike since June 2006, when the US benchmark rate was raised to its five-year peak of 5.25%.\nWhile the end of the third round of quantitative easing (QE3) announced in October 2014 has prepared investors for this reversal, the token increase from the current level of 0.25% could intensify the liquidation in emerging market equities, market watchers believe.\nGiven its relatively better economic fundamentals, including a less volatile domestic currency and better GDP growth momentum compared with its emerging market peers, India may withstand a hike better. However, India has commanded an overweight rating since the BJP government came to power, so it is possible money could move out.\nMarket watchers say the US rate hike apart investors are also taking some risk off the table since corporate earnings aren’t picking up as anticipated and valuations remain steep. “Equity valuations have moderated but are still above average,” Bank of America Merrill Lynch wrote recently, adding that the BSE Sensex one-year forward PE (adjusted for earnings downgrades) has slipped to 15.8 but still remains above the long-term average of 14.5 times.\nWithin the EM universe, India has been more resilient than other nations. While the MSCI Emerging Market Index has lost more than 15% in 2015, MSCI India has only come off by 3%. This relative outperformance could yet weigh on the Indian market’s performance going ahead.\nIndia is also expensive when viewed from the point of a trailing multiple. At 25,706 levels, the 30-share Sensex trades at a trailing price to earnings multiple of 20.3 times, among the highest commanded by global benchmark indices. Compared to that, the Dow Jones Industrial average of the US is trading at just 14.3 times.\nThe combination of global and domestic problems have prompted brokerages to trim their year-end forecasts. At least four leading brokerages have lowered their Sensex and Nifty targets, citing slack earnings recovery, risk of continuous yuan devaluation and the chance of a US interest rate hike. Barclay’s, Macquarie and UBS now see the Sensex at 28,000 by March 2016 and the Nifty near 8,200-9,642 by end 2015.\n 16, 2015 1:04 am", "external_links": [], "published": "2015-09-16T09:04:00.000+03:00", "crawled": "2015-09-16T02:40:15.205+03:00", "highlightTitle": ""}