{"organizations": ["UCT", "Lonmin"], "uuid": "d90bde4c070ed30299b1567f3cdafae7dcbad038", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509010962.html", "country": "US", "title": "South Africa: Rhodes Must Fall, UCT, Lonmin and Pension Funds", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Rhodes Must Fall, UCT, Lonmin and Pension Funds", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T13:41:00.000+03:00", "replies_count": 0, "uuid": "d90bde4c070ed30299b1567f3cdafae7dcbad038"}, "author": "", "url": "http://allafrica.com/stories/201509010962.html", "ord_in_thread": 0, "title": "South Africa: Rhodes Must Fall, UCT, Lonmin and Pension Funds", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa: First African Woman Banished in Apartheid Honoured \nThe board of a pension fund comprises trustees, half of whom are nominated by the employer and half by fund members. In this case, the members would be UCT employees. They're entitled and encouraged to vote for trustees who, in their view, will best serve their interests. The board as a whole informs the fund's investment strategy which is obliged (under Regulation 28 of the Pension Funds Act) to include environmental, social and governance (ESG) criteria in making investment decisions; \nIf the trustee board fails to consider ESG criteria, it fails in its fiduciary and legal duties. But trustees can hardly be expected to have anticipated a Marikana outcome any more than they could be expected to anticipate the movement in a share price; \nLonmin has been punished by a fall of over 80% in its share price since Marikana. Thus the members of pension funds invested in Lonmin have been punished accordingly. Arguably, it would be counter-productive to disinvest from Lonmin at the share's bottom price (and so to converting a paper loss to a capital loss, also denying the receipt of dividends likely to improve as the commodities cycle improves). Moreover, unless noise is a factor for consideration, it would be inconsistent to single out Lonmin as the sole company for disinvestment on grounds of relative ESG non-compliance; \nA fund is obliged to formulate an investment-policy statement. It is entitled to set out standards for \"ethical\" investment. For instance, it can adopt a policy of \"negative screening\" so that its asset manager may not invest in say tobacco. But here too lies a problem. One of the best performers on the JSE, and invariably included in prudent portfolios by virtue of its large market capitalisation, is British American Tobacco. To have excluded it (impossible anyway where a fund partially uses passive-investment strategies) would have been ultimately to the detriment of fund members' retirement benefits. Members can vote, if they want, for trustees who stand for a reduction in ultimate benefits; \nA rough-and-ready way for trustees to check on ESG compliance is through the JSE's Socially Responsible Investment index. As at end-November 2014, when it was last updated, Lonmin was on this SRI index. Further, at the time of assessing Lonmin, trustees might have been further comforted by assuming that Cyril Ramaphosa (then a director on Lonmin's main board) was promoting ESG issues; \nShould a fund adopt \"negative screening\", it might not be left with an abundance of investment choices. There are 82 constituents of the JSE SRI index, most of them companies with large market capitalisations and thus appropriate for pension funds. It's possible to pick ESG holes in probably all of them, such as a bank which grants loans to a company using fossil fuels; \nOnce on the road to ESG purity, there's no end in sight. Commonly employed as the practical alternative to disinvestment is for pension funds (usually through their asset managers) to engage with investee companies so that they're brought to higher standards of ESG compliance. They also have the sanction of voting at shareholder meetings, oversight of executive remuneration being a case in point; \nAny pension fund invested in Lonmin is in persuasive company. The Government Employees Pension Fund, perhaps the most prominent of active shareholders through the Public Investment Corporation as its asset manager, holds Lonmin shares. Similarly, at last count an array of trade unions' funds (the Mineworkers Provident Fund being one) held stakes in various gold, coal and platinum miners including Lonmin; \nBecause pension funds are long-term investors, and particularly given the JSE's relatively small universe of investable shares, an activist approach is preferable to jumping from one share to another on short-term disapproval of company behaviour. \nThat said, the pension-fund system as it functions has glaring defects. Amongst them: \nIt's been almost two decades since, at the behest of Cosatu, the Pension Funds Act was amended to allow for 50/50 employer/member representation on funds' boards. Since then, there's been a paucity of members to stand for election as trustees and turnouts at elections are usually pitiful. Worse, surveys reveal that most members don't even know or care to know who are the trustees of their funds; \nThe competence of trustees is often patchy. They're commonly elected on grounds of popularity, not skill, and are none-the-wiser in the formulation of investment mandates; \nThere is no requirement that members be informed, or even be made aware, of the companies in which their pension funds are invested. Were it otherwise, they might be less inclined to go on strike against these companies and rather to take their disputes as shareholders into company boardrooms. It's paradoxical that trade unions rarely walk through the door that they themselves have opened. \nThe residue of campaigners for Rhodes Must Fall are preening themselves on hindsight being a perfect science, notably when they focus on one shareholding in one fund at one time. If trustees of the UCT fund have \"blood on their hands\" because of the investment in Lonmin, then so too must all trustees of all pension funds similarly invested. \nAnd so also must the fund members who, having neither stood for election as trustees nor voted in trustee elections, now shout from the sidelines at those with lesser inertia. To be a trustee requires sacrifices in time and dedication in effort, with minimal or no financial recompense, but facing personal liability nonetheless. \nAt present, there are over 3,500 active funds with each having a minimum of four trustees representing a total of more than eight million members. Pension funds are the largest single category of investors in JSE-listed companies. The scope for fund members to instigate programmes of shareholder activism is therefore formidable. \nIf only the remaining Rhodes Must Fall campaigners realised it, they wouldn't be barking up the wrong tree. Presuming that they are indeed members of the UCT fund, not exclusively students purportedly concerned for the reputation of UCT but whose publicity quest damages it, they should rather be looking to themselves at rights they've neglected to exercise. \nLet them explain why. \nAllan Greenblo is editorial director of Today's Trustee, a quarterly magazine mainly for trustees of retirement funds. Views expressed are not necessarily GroundUp's. South Africa \nThe promise by Home Affairs minister Malusi Gigaba that rejected applications for Zimbabwean Special Permits are to be … see more » Copyright © 2015 GroundUp. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-01T13:41:00.000+03:00", "crawled": "2015-09-01T14:21:41.605+03:00", "highlightTitle": ""}