{"organizations": [], "uuid": "ac825e8fd184f3e9b4c0d0f0ee56cf6fbdb081a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/income-tax-t.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/income-tax-department-to-use-email-for-issuing-notices/138574", "country": "IE", "title": "Income Tax department to use email for issuing notices", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Income Tax department to use email for issuing notices | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T21:26:00.000+03:00", "replies_count": 0, "uuid": "ac825e8fd184f3e9b4c0d0f0ee56cf6fbdb081a7"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/income-tax-department-to-use-email-for-issuing-notices/138574", "ord_in_thread": 0, "title": "Income Tax department to use email for issuing notices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Monsoon deficit comes down to 14% Delhi gencos supply power to discom at Rs 7.12 per unit US Federal Reserve's John Williams says decision not to raise rates was a 'close call' In welcome news for taxpayers, the IT department has decided to launch a new system of issuing email notices to which an assessee can respond electronically, obviating the need for a physical interface with the taxman which often led to complaints about harassment.\nThe Central Board of Direct Taxes, the apex policy-making body of the IT department, is working on a strategy to create the required processes and capacity in this regard.\n“We have been thinking how can we make life easier for taxpayers especially for those who are in the middle and the slightly higher tax bracket. So, now we are thinking of allowing that when a notice is issued in an assessment or scrutiny case, the taxpayer can send the department an e-response.\n“We are trying to resolve some security issues in this regard now after which it could be implemented,” CBDT Chairperson Anita Kapur told PTI in an interview.\nExplaining the procedure, Kapur said if a taxpayer provides the department with a bonafide email address in his Income Tax Return (ITR), the Board will be able to send him an e-notice and not a paper document dispatched through post for which he usually has to travel and meet the Assessing Officer (AO).\n“The taxpayer can respond through the email and if we have some more queries we give you another notice by the electronic medium so that both the AO and the taxpayer remain in an e-environment and, may be, during the final hearing when the AO wants to close the matter, the taxpayer can come once to the tax office,” the CBDT chief said.\nShe said the purpose of introducing the system was to reduce the interface between the taxpayer and the AO.\n“The taxpayer can send documents over email, scan them, upload them and it’s over,” she added.\n“It (scrutiny session) should be over and should not go beyond that. This is the way we are trying to address the issues of compliance and limiting the interface between the taxman and the taxpayer. This will be a sea change in our tax administration,” Kapur said.\nTax experts say the initiative will also ensure privacy of a taxpayers’ communication with his AO and the tax department.\nThe CBDT chief said she was aware of instances where the taxpayers complained about the AO raising numerous queries upon meeting the assessees despite their earlier order sheets having mention of only a few queries.\n“This (sending emails) is one way of giving both the taxpayer and the AO a good opportunity to solve their things without any problem. It has also been mentioned in our earlier instructions to the field that the questionnaire sent to the taxpayer in scrutiny cases should be focused and specific so that the person knows what is he being enquired about.\n“We are trying to do this for a medium-level taxpayer and others,” Kapur said, adding she hopes this would bring down taxpayers’ complaints.\nThe CBDT chief said the number of cases landing for scrutiny had gone down over the years following introduction of technology in the administration of taxes.\n“The overall percentage of cases brought under scrutiny across the country in a financial year is less than one per cent. The entire system is handled electronically and there is no human intervention. I can assure taxpayers that there is no personal role of a tax official in deciding who can be scrutinised or who cannot be,” she said.\nKapur added that as part of measures to further check instances of harassment of taxpayers, the CBDT has recently asked its field offices to not undertake any “fishing or roving inquiries”.\n“We are also saying to our officers that when you select a case for scrutiny you should say that this is the reason that we have selected your case.\n“We are asking our officers that if we are selecting a case for scrutiny on a third-party information (through banks, credit card agencies) just limit your inquiry to those issues which have been flagged and based on which your case have been selected for scrutiny. No fishing inquiries (should be undertaken),” she said.\n 20, 2015 1:26 pm", "external_links": [], "published": "2015-09-20T21:26:00.000+03:00", "crawled": "2015-09-21T02:09:56.493+03:00", "highlightTitle": ""}