{"organizations": ["Econet", "POPCRU"], "uuid": "882c49b9bf9616345ea2e9578d58bd6895baa08e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509190172.html", "country": "US", "title": "South Africa: Econet Extends Its Ecocash Service to South Africa", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Econet Extends Its Ecocash Service to South Africa", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T17:22:00.000+03:00", "replies_count": 0, "uuid": "882c49b9bf9616345ea2e9578d58bd6895baa08e"}, "author": "", "url": "http://allafrica.com/stories/201509190172.html", "ord_in_thread": 0, "title": "South Africa: Econet Extends Its Ecocash Service to South Africa", "locations": ["Pollsmoor", "South Africa South Africa", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa: Conditions At Pollsmoor Disturbing - POPCRU \nECONET Wireless will, beginning October, launch the EcoCash Remittance South Africa, in a development that will see Zimbabweans in the neighbouring country being able to send money home. \n\"We are entering a very exciting count down to the commercial launch of EcoCash Remittance South Africa,\" the mobile giant's Chief Executive Officer Douglas Mboweni has said. \n\"In less than three weeks Zimbabweans right across South Africa will finally be able to send money home to loved ones securely, cheaply, and in a matter of seconds. \n\"This has taken a long time to put in place but we are almost there. It will be the biggest thing that has happened to EcoCash since it was first launched,\" Mboweni said. \nThe service will only be available to Zimbabweans who have an Econet Wireless South Africa SIM card, known as \"Call Home\" and which is powered by Cell C. \nThe company said almost a million Zimbabweans currently use its Call Home service which has been designed to satisfy the telecoms and mobile financial service needs of African immigrants in South Africa. \nEconet and its partners have received all the necessary approvals from the South African authorities and are nearing completion of a \"successful soft launch\". \nMboweni said the company has been working with its South African partners since the beginning of August on a two hundred customer \"soft launch\" of the new direct to EcoCash remittance service; training registration agents, enabling and verifying the interlinked systems and ensuring regulatory compliance of the end to end process. \n\"Econet has partnered its massively popular EcoCash service with a South African company called Flash Mobile Vending, a subsidiary of retail giant Pepkor, whose mobile vending solution is used by more than 60,000 informal sector small business shop owners throughout South Africa,\" he said. \nIn the same way EcoCash has enabled agents in far flung corners of Zimbabwe, Flash shop owners are spread throughout South Africa; operating from locations convenient to the vast majority of the Zimbabwean Diaspora who are the source of vital remittances supporting loved ones in Zimbabwe. \n\"Flash's vast footprint of shop owners, easily spotted by virtue of their distinctive \"green cow\" logo, will effectively act as EcoCash agents for remittance \"cash-in\" transactions,\" Mboweni added. \nIn addition, Flash plans to mobilize all PEP and PEP cell stores across South Africa to perform registrations and accept remittance \"cash-in\". \nIn essence, the partnership with Flash extends EcoCash Zimbabwe's agent footprint from Beitbridge to Cape Town and all parts in between. \nThe CEO said EcoCash remittances have so many unique advantages to any other form of remittance. \n\"Money goes from shop to phone in a matter of seconds and one can send as little as R50. It will also be very cheap compared to other forms of remittance because Econet and Flash are volume players,\" said Mboweni. \n\"Until now people have to wait until pay day to send money home, now they can send money any time and in very small amounts. This will boost the flow of money from remittances.\" \nOver the last 12 months, Econet has created partnerships with Money transfer agencies such as Money Gram, Western Union, World Remit, and Chitoro. \nThe roping in of international banks has made EcoCash the preferred way to send any amount of money to Zimbabwe. \nInternational remittances are extremely important to the Zimbabwean economy as it helps to ease the liquidity problems gripping the country. South Africa \nThirty million rand, that's the estimate of damages caused by University of KwaZulu-Natal students, many of whom were … see more » Copyright © 2015 New Zimbabwe. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-19T17:22:00.000+03:00", "crawled": "2015-09-20T08:13:50.394+03:00", "highlightTitle": ""}