{"organizations": [], "uuid": "0883d99c4bd432561faf1a44c2265602476e6d71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/images/print-edition/20150905_FNP001_0.jpg", "site_section": "http://www.economist.com/rss/finance_and_economics_rss.xml", "section_title": "The Economist: Finance and economics", "url": "http://www.economist.com/news/finance-and-economics/21663241-growth-has-proved-resistant-external-shocks-not-local-politics-still", "country": "US", "title": "Still in business", "performance_score": 1, "site": "economist.com", "participants_count": 1, "title_full": "Still in business | The Economist", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "0883d99c4bd432561faf1a44c2265602476e6d71"}, "author": "From the print edition", "url": "http://www.economist.com/news/finance-and-economics/21663241-growth-has-proved-resistant-external-shocks-not-local-politics-still", "ord_in_thread": 0, "title": "Still in business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FINANCIAL markets started September as they ended August, with share prices falling and investors fretting about China’s cooling economy. The latest sell-off was triggered by a survey of Chinese purchasing managers which suggested that manufacturing had contracted in August. Nerves were further pinched by grim data on exports from South Korea, on manufacturing from Taiwan and on growth from Brazil. Rich countries are also affected: GDP in Australia, a big exporter of raw materials to China, slowed almost to a standstill.\nAmid the misery in emerging markets, one economy stands out for its comparative resilience. Figures released at the end of August showed that GDP rose by 7% in the second quarter, year on year. India’s official growth rate is thus on a par with China’s and much stronger than that of trouble spots such as Brazil, Russia and South Africa (see chart).\nIn this section Still in business With great power Emerging troubles Like manna from heaven A tax on the poor Inflated claims Trade Imports and exports Reserve Bank of India Asia China\nAs in China, the GDP figures probably overstate how well the economy is doing (in India’s case, thanks to a change in the calculations that may exaggerate the growth of small firms). Yet it still looks in decent shape. Indicators such as car sales and imports of capital goods suggest it is gathering steam. This is partly down to luck: India is hurt far less than other emerging markets by what is happening in China. Manufacturing supply chains tie Singapore, South Korea and Taiwan to the Chinese economy; India exports little there, by comparison. Oil exporters, such as Nigeria, Russia and Venezuela, have been hurt by the collapse in crude prices. But India imports 70-80% of the oil it uses so benefits greatly from cheap energy. India’s current-account deficit has narrowed to 0.2% of GDP, thanks in part to a cheaper bill for oil and other raw-material imports. In contrast Brazil, Colombia, South Africa and other commodity exporters need jittery foreigners to fund ever-bigger current-account deficits, since their foreign earnings have slumped. And downward pressure on prices is more welcome in inflation-prone India than in most places. Consumer-price inflation fell to just 3.8% in July; in 2013 it was in double digits.\nIndia is not immune to all emerging-market afflictions, however. Exports have been shrinking for eight months. Falling factory-gate prices across Asia (see Free exchange ) have placed additional pressure on firms in heavy industry that are already struggling to service their debts. Imports of cheap steel from China have more than doubled in the past year.\nIndia’s economy also suffers from a few locally incubated ailments. Its public-sector banks, which account for 70% of outstanding loans, are weighed down with bad debts accumulated in an investment boom in 2008-12. Overall stressed assets, including loans whose terms have been softened to make repayment easier, have risen to 11.1% of total bank loans, according to the Reserve Bank of India (RBI). Credit growth is feeble. The RBI’s governor, Raghuram Rajan, has grumbled that recent cuts in the central bank’s main interest rate, from 8% to 7.25%, have not been fully passed on in lower bank-lending rates.\nCheaper money is nevertheless finding its way to borrowers. Indian firms typically turn to banks for 80% of their borrowing and to bond markets for the rest. In the past year, the split has been roughly 50-50, says Rashesh Shah of Edelweiss, a finance company. Bond yields have fallen by more than the RBI’s benchmark, in part because more rate cuts are expected. Insurance firms are keen buyers. Until recently, at least, so were foreigners in search of higher yields than they could find at home. Money has also flowed into bond funds as local investors turn away from property and gold. The growing use of bond-market funding helps to explain why investment is perking up despite India’s crippled banks.\nIndia’s economy is doing well enough to prompt officials to speak of taking on China’s mantle. That is overly optimistic. India is a long way from having the sort of muscle to add much to global growth. Its population of 1.25 billion is similar in size to China’s and is much younger (the median age is 27). But it is also much poorer. At current prices and exchange rates, India’s economy is worth around $2 trillion, whereas China’s is worth $11 trillion.\nIf India is to follow China’s path, more of its people need to escape a hardscrabble life in farming for better-paid work in factories and offices. That, in turn, requires reforms to make it easier to buy land and to employ workers. Yet in recent weeks the government of Narendra Modi, who won an election last year on a pledge to pep up the economy, backtracked on efforts to make compulsory land purchases easier. He seems to be worried that the change would dim his party’s prospects in elections in Bihar, a largely rural state of 100m where it has been depicted as anti-farmer. On September 2nd ten of India’s 12 biggest trade-union alliances joined a nationwide strike. They hope to force a similar climbdown on proposals to tidy up India’s Byzantine labour laws and to make it slightly easier for smallish firms to lay off workers. A bill to establish a nationwide goods-and-services tax, to replace myriad federal, state and city taxes, is stuck between parliament’s two houses. Even modest changes, such as the privatisation of some airports, have been put on ice.\nMr Modi controls parliament’s lower house, but his legislative plans have been thwarted because his party and its allies are a minority in the upper chamber. India’s 29 states may advance some reforms; Arun Jaitley, the finance minister, has said the federal government will bless any softening of state-level land laws, allowing them to supersede national law. Rajasthan, a northern state, has already liberalised its labour laws by this route. But that is far short of the expectations generated by Mr Modi’s election.\n ", "external_links": ["http://cdn.static-economist.com/sites/default/files/imagecache/original-size/images/print-edition/20150905_FNC614.png", "http://cdn.static-economist.com/sites/default/files/imagecache/full-width/images/print-edition/20150905_FNP001_0.jpg"], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-04T05:49:33.619+03:00", "highlightTitle": ""}