{"organizations": ["M/V Garnet Diana Containerships Inc", "Diana Containerships Inc"], "uuid": "d0099507999b223ad7f6d7e41d724befa937a060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "", "site_section": "http://globenewswire.com//Rss/subjectcode/17/Financing%20Agreements", "section_title": "GlobeNewswire: Financing Agreements", "url": "http://globenewswire.com/news-release/2015/09/21/769735/10149976/en/Diana-Containerships-Inc-Announces-the-Sale-of-a-Panamax-Container-Vessel-the-M-V-Garnet.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "country": "US", "title": "Diana Containerships Inc. Announces the Sale of a Panamax Container Vessel, the M/V Garnet", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Diana Containerships Inc. Announces the Sale of a Panamax Container Vessel, the M/V Garnet", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T16:20:00.000+03:00", "replies_count": 0, "uuid": "d0099507999b223ad7f6d7e41d724befa937a060"}, "author": "", "url": "http://globenewswire.com/news-release/2015/09/21/769735/10149976/en/Diana-Containerships-Inc-Announces-the-Sale-of-a-Panamax-Container-Vessel-the-M-V-Garnet.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "ord_in_thread": 0, "title": "Diana Containerships Inc. Announces the Sale of a Panamax Container Vessel, the M/V Garnet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Diana Containerships Inc. Announces the Sale of a Panamax Container Vessel, the M/V Garnet September 21, 2015 09:20 ET | Source: Diana Containerships Inc. \nATHENS, Greece, Sept. 21,   Diana Containerships Inc. (NASDAQ: DCIX ), (the \"Company\"), a global shipping company specializing in the ownership of containerships, announced that it has signed today, through a separate wholly-owned subsidiary, a Memorandum of Agreement to sell to an unaffiliated third party the 1995-built vessel \"Garnet\" (formerly \"APL Garnet\") for demolition, with delivery due to the buyer by the end of September 2015, for a sale price of approximately US$7.85 million before commissions. \nUpon completion of the aforementioned sale, Diana Containerships Inc.'s fleet will consist of 13 container vessels (5 Post-Panamax and 8 Panamax). The Company also expects to take delivery of one Post-Panamax container vessel by the end of November 2015. A table describing the current Diana Containerships Inc. fleet can be found on the Company's website, www.dcontainerships.com . Information included on the Company's website does not constitute a part of this press release. \nAbout the Company \nDiana Containerships Inc. is a global provider of shipping transportation services through its ownership of containerships. The Company's vessels are employed primarily on time charters with leading liner companies carrying containerized cargo along worldwide shipping routes. \nCautionary Statement Regarding Forward-Looking Statements \nMatters discussed in this press release may constitute forward-looking statements. The Private Securities Litigation Reform Act of 1995 provides safe harbor protections for forward-looking statements in order to encourage companies to provide prospective information about their business. Forward-looking statements include statements concerning plans, objectives, goals, strategies, future events or performance, and underlying assumptions and other statements, which are other than statements of historical facts. \nThe Company desires to take advantage of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and is including this cautionary statement in connection with this safe harbor legislation. The words \"believe,\" \"anticipate,\" \"intends,\" \"estimate,\" \"forecast,\" \"project,\" \"plan,\" \"potential,\" \"may,\" \"should,\" \"expect,\" \"pending\" and similar expressions identify forward-looking statements. \nThe forward-looking statements in this press release are based upon various assumptions, many of which are based, in turn, upon further assumptions, including without limitation, our management's examination of historical operating trends, data contained in our records and other data available from third parties. Although we believe that these assumptions were reasonable when made, because these assumptions are inherently subject to significant uncertainties and contingencies which are difficult or impossible to predict and are beyond our control, we cannot assure you that we will achieve or accomplish these expectations, beliefs or projections. \nIn addition to these important factors, other important factors that, in our view, could cause actual results to differ materially from those discussed in the forward-looking statements include the strength of world economies and currencies, general market conditions, including fluctuations in charter rates and vessel values, changes in demand for containership capacity, changes in our operating expenses, including bunker prices, drydocking and insurance costs, the market for our vessels, availability of financing and refinancing, changes in governmental rules and regulations or actions taken by regulatory authorities, potential liability from pending or future litigation, general domestic and international political conditions, potential disruption of shipping routes due to accidents or political events, vessel breakdowns and instances of off-hires and other factors. Please see our filings with the Securities and Exchange Commission for a more complete discussion of these and other risks and uncertainties. Corporate Contact: Ioannis Zafirakis Director, Chief Operating Officer and Secretary Telephone: +30-216-600-2400 Email: Website: www.dcontainerships.com Investor and Media Relations: Edward Nebb Comm-Counsellors, LLC Telephone: +1-203-972-8350 Email: Related Articles other press releases by Diana Containerships Inc.", "external_links": [], "published": "2015-09-21T16:20:00.000+03:00", "crawled": "2015-09-21T18:39:37.612+03:00", "highlightTitle": ""}