{"organizations": [], "uuid": "a19ac16fc8ad6de9f71659e82ac9c0e71c58b9a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/morgan-stanley-issues-full-house-200228720.html", "country": "GB", "title": "Morgan Stanley issues 'full house' buy alert for stocks", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Morgan Stanley issues 'full house' buy alert for stocks", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T23:02:00.000+03:00", "replies_count": 0, "uuid": "a19ac16fc8ad6de9f71659e82ac9c0e71c58b9a8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/morgan-stanley-issues-full-house-200228720.html", "ord_in_thread": 0, "title": "Morgan Stanley issues 'full house' buy alert for stocks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Morgan Stanley"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 1, 2015, 21:50 BST - UK Markets closed Morgan Stanley issues 'full house' buy alert for stocks By Ambrose Evans-Pritchard | Telegraph – 47 minutes ago 159.10 -0.60 \nAll five of the bank's key timing indicators are flashing a green light for the first time since early 2009, suggesting the worst may be over for global equities \nMorgan Stanley (Xetra: 885836 - news ) has issued a \"full house\" buy alert on international stock markets for the first time since early 2009, effectively calling the bottom of this summer’s equity slump. \nThe US investment bank said that all five of its market-timing signals are now flashing a buy signal as selling-fever reaches capitulation levels. \nThis is a rare occurrence, typically leading to a V-shaped recovery that delivers a 23pc gain in stock prices over the following 12 months. \nGraham Secker, the bank’s chief European equity strategist, said the sell-off over recent weeks is largely driven by emotion and has little to do with the underlying outlook for the world economy. \n“Equities remain very cheap relative to government bonds and there remains a lot of liquidity around that is looking for a home,” he said. \nThe trailing dividend yield on stocks measured by the MSCI Europe index is currently 240 basis points above the yield on a mix of European government bonds, near its all time-highs over the past century. Such levels usually precede powerful equity rallies. \nMorgan Stanley’s bold call has raised eyebrows since the bank caught the exact top of the European equity market in June 2007 using the same timing indicators, on that occasion issuing a \" full house\" sell alert . \nIt (Other OTC: ITGL - news ) comes at a treacherous time for global investors as they try to fathom what is really happening in China and brace for the first rate rise in nine years by the US Federal Reserve, a move akin to a margin call for debtors in emerging markets with $4.5 trillion of US dollar liabilities. \n“Our indicator is not the Holy Grail of investing. We think that on the balance of probabilities, the risk-reward ratio looks pretty good right now, but it is not a very good week-to-week timing signal,” said Mr Secker. \nHe said the current mood has echoes of 1998 during the East Asia crisis and the Russian default, when there was a nasty squall in the markets but it proved to be a false alarm for the global economy, thanks to three back-to-back rate cuts by the Fed \nIt is the only time the \"full house\" buying signal has been triggered without a recession happening first in the developed countries, but that time it was six weeks premature. \nThe five timing tools are: valuation, fundamentals, risk, capitulation, and a combined market indicator. Between them they capture mutual fund flows, market breadth and technical momentum measures such as the rate of change, as well as price-to-earnings (P/E) ratios, dividend yields and their relationship to bonds. \nMr Secker said P/E ratios in Europe are likely to be flat this year, but this is distorted by a collapse in mining, energy and commodity revenues. Median earnings are growing at almost 10pc. “Europe is now discounting no growth over the next 12 months, which looks too bearish,” he said. \nMorgan Stanley said the best way to invest for the rebound is through eurozone bank stocks, beneficiaries of quantitative easing and ultra-loose money. The star country over the next two years may be Italy surprisingly as it begins to reap the rewards of deep reform. \nThe FTSE 100 in Britain is likely to lag badly yet again next year, thanks to an over-valued pound and the heavy weighting of UK equities towards oil, gas and mining companies. \nHowever, there is plenty of scope for well-aimed rifle shots. Mr Secker likes Burberry, Next (Other OTC: NXGPF - news ) , Pearson (Xetra: 858266 - news ) , Hays (LSE: HAS.L - news ) , Vodafone, Michael Page, Schroders (LSE: SDR.L - news ) , Imperial Tobacco and utilities such as Centrica (LSE: CNA.L - news ) and National Grid (LSE: NG.L - news ) , as well as TUI (LSE: TUI.L - news ) , with a high exposure to Europe. \nHe recommended “mega-cap” stocks that on average generate 42pc of their earnings from emerging markets (EM), compared with 23pc for small companies. These have been punished over the past year. “We think it's still a little early to buy EM exposure, although that moment is getting closer,” he said. \nThe great worry is that China may be in deeper trouble than the authorities have let on after their failed attempts to prop up the Shanghai stock market and their ill-explained decision to ditch the country’s dollar-peg. \nThe heavy-handed arrest of 200 journalists, brokers and regulators for allegedly spreading false rumours and undermining public trust has further entrenched the view that Beijing is losing control. \nThe decision to force a respected journalist from Caijing Magazine to issue a grovelling confession on state television smacks of Maoist practices in the Cultural Revolution and amounts to crude repression of news reporting. \nHowever, the economic picture may not be as bad as it looks, at least over coming months. While the latest data confirm that China is struggling to shake off what amounted to a recession earlier this year, it fails to clarify whether or not growth is picking up again. \nThe Caixin PMI index for manufacturing fell to a six-year low of 47.3 in August, but this was badly distorted by the fallout from the Tianjin chemical explosion and the closure of 12,000 factories to clear the air in Beijing before this week’s Victory Parade. \nCapital Economics said the PMI index issued a false reading after the air purification campaign before the APEC summit in Beijing last year. \nThe Chinese property market is picking up after a deep slump, with house prices up for four months in a row. The fiscal crunch earlier this year is fading as a new bond market for local governments gets off the ground, issuing $100bn a month. \nMorgan Stanley said it remains wary of China in the “short-run” but is waiting to jump back in if there is a fresh blast of fiscal stimulus. \nThat may be exactly what is now happening. Lou Jiwei, the finance minister, said last week that Beijing will pull forward a raft of infrastructure projects planned for next year, launching them later this year instead. \nBoth credit growth and the money supply are accelerating. Draconian curbs have been imposed on foreign exchange transactions to stop capital flight, easing the way for the central bank to cut lending rates further and inject liquidity by lowering the reserve requirement ratio. \nA combined shot of fiscal and monetary stimulus is already in the Chinese pipeline. Yet China has lost so much credibility over the past year that the world may not believe the promise of largesse until the evidence is irrefutable.", "external_links": [], "published": "2015-09-01T23:02:00.000+03:00", "crawled": "2015-09-01T23:51:13.045+03:00", "highlightTitle": ""}