{"organizations": [], "uuid": "be491b47c874443ea034176c2fc922a8612e59b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30051292/following-successful-theranos-research-report-firm-takes-aim-at-healthcare-blind-spot-with-new-website-and-product-set", "country": "US", "title": "Following Successful Theranos Research Report, Firm Takes Aim at Healthcare Blind Spot With New Website and Product Set", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Following Successful Theranos Research Report, Firm Takes Aim at Healthcare Blind Spot With New Website and Product Set - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T11:31:00.000+03:00", "replies_count": 0, "uuid": "be491b47c874443ea034176c2fc922a8612e59b0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30051292/following-successful-theranos-research-report-firm-takes-aim-at-healthcare-blind-spot-with-new-website-and-product-set", "ord_in_thread": 0, "title": "Following Successful Theranos Research Report, Firm Takes Aim at Healthcare Blind Spot With New Website and Product Set", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After the successful launch of their first report (Will Theranos Turn the Lab Industry Upside Down?) earlier this year, Disruptive Insights Group (Di) is pleased to announce a new web-based healthcare research platform and Payer Insights - the newest addition to their product suite.\nMemphis, TN (PRWEB) September 17, 2015\nBoth the site and the new products have been “engineered to resolve the payer blind spot problem,” according to managing editor, Richard Sims. (More on our unique take on Theranos can be found below or on Di’s website— http://www.DisruptiveInsightsGroup.com .\nNot understanding payer management dynamics would be like investing in indices without understanding the Fed’s perspective on the economy. Investing in healthcare without insight into the payer perspective can add drag to returns because payers are, in large part, a primary force in healthcare pricing. Reimbursement trends directly reflect (and in some cases portend) costs trends. Payers are constantly managing the tension between their limited resources (money) and the pricing and volume dynamics at play.\nAccording to CMS, U.S. healthcare payments will top an estimated $5 trillion per year by 2022. At such a growth rate, the importance of the payer perspective is increasing with every diagnosis. However, healthcare stakeholders (e.g., investors and industry participants) continue to have blind spots regarding key aspects of payer dynamics like current and expected future management practices, therapy-specific risks and outlooks, and strategies for managing costs (prior authorization, limiting provider influence, raising co-payments, delaying reimbursements, negotiating discounts, etc.). Industry stakeholders are looking for real-world insights into these blind spots.\nMore and more, payers are using information from quality of care outcomes to guide their decision-making processes. A general understanding of payer perspectives on alternative reimbursement models is necessary. Meaningful insight into payer strategies for managing specific therapeutic categories is foundational. Analysts and fellow-researchers need targeted insights that track payers’ targeted interventions.\nInfluxes of unexpected costs will put health plans at risk, and could restrict access to other life-saving therapies. The “blank-check pricing” (lack of cost controls) stakeholders have long observed speaks to the importance of understanding the payer perspective. Payers are at the greatest risk for these escalating costs. Turning these blind spots into meaningful insights in the decision making process is Di’s mission.\nIn exchange for customer engagement, Di is offering up to investors and decision makers its network— a diverse group of medical directors for leading health plans, PBMs, ACOs, integrated networks and employer coalitions in the form of Payer Insights.\nThe first two reports are available now and they clarify these blind spots in Spinal Surgery and Hip/Knee Surgery.\nSims called the launch of the new site “a big step forward.” Prior to the launch of the new website, distribution of Di’s products was limited to 3rd party resellers. The website opens up completely new relationship possibilities. “The feedback from and interaction with our customers on our Theranos report has been fantastic,” said Sims, “We are continuing to expand our network of healthcare influencers and stakeholders. The launch of our website and Payer Insights, allows us extend these conversations and products to new customers in new areas of healthcare. We look forward to engaging our customers at every stage of the diligence process.”\nAt http://www.DisruptiveInsightsGroup.com , visitors will be able to explore the current and growing product set, and engage Di through the company’s fresh, value-added content. The company also works with customers directly: creating custom projects and pursuing suggestions for future coverage of therapeutic areas.\n“At its core, Di’s product set is about helping our customers mitigate or eliminate their blind spots,” Sims stated. “We all have blind spots and we expend a great deal of mental energy and resources on them. We are excited about the opportunity to work with our customers, leveraging our robust network to help eliminate uncertainty.”\nPayers are, by themselves, a leading indicator of pricing trends in healthcare. Payer perspectives are not the only variable in healthcare pricing equations, but they are always in the middle of it. Typically, the payer perspective has long been an estimated variable. Payer Insights help convert that variable into a constant, so to speak. The reports provide customers with deep and ongoing insight into management strategies for the specific therapeutic categories you are already watching (and some you may not be).\nSome can’t see the forest for the trees. Others can’t see the trees for the forest. Disruptive Insights seeks to play an active role in resolving this dilemma.\nWill Theranos Turn the Lab Industry Upside Down – A Di Deep Dive\nWe believe Theranos poses a significant threat to the lab industry. Their technology, company mission, partnerships and impressive resume of stakeholders have – and probably rightfully so – garnered a great deal of attention. This report explores the disruptive potential that Theranos presents to the lab industry and key topics like:\nScaling microfluidic technology\nThe impact of a real POC or “near-POC” solution\nTheranos’ current and future go-to-market strategy and impact on pricing\nWalgreens’ aspirations in the total healthcare delivery market (and how Theranos might enable that!)\nWhat the emergence of Theranos is really telling us about the direction of the lab industry.\nInterested parties can obtain a preview of this report on Di’s website as well as check our latest blog entries on this topic.\nAs value-based models become increasingly prevalent in the U.S., Di’s Payer Insights offer a highly-coveted view into the current and expected trends in payer management and reimbursements. These reports detail the impacts payer management has on particular therapeutic categories, and explain, contextualize and track payer behavior.\nBy leveraging Di’s network of medical directors at major health plans across the US, the company is bringing together in one report primary sources on the current and expected reimbursement outcomes in these therapeutic categories.\nA few questions Di’s Payer Insights answer:\nAre payers looking to increase management focus in a given therapy?\nWhat are payer expectations for overall surgery costs for a therapy in the near future?\nWill alternative reimbursements come to a therapy? How soon? To what degree?\nand more.\nVisit Di’s website— http://www.DisruptiveInsightsGroup.com —to download a Payer Insights preview, or to start a conversation with the team.\n //www.prweb.com/releases/2015/09/prweb12966352.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/09/prweb12966352.htm"], "published": "2015-09-17T11:31:00.000+03:00", "crawled": "2015-09-18T08:24:39.188+03:00", "highlightTitle": ""}