{"organizations": [], "uuid": "07b63ec0a92fb8237a8ab78e63ab1ebfb5a50bec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.couriermail.com.au", "main_image": "http://resources2.news.com.au/images/2015/09/04/1227513/122502-42ff5442-52bb-11e5-9feb-d976cea92fcd.jpg", "site_section": "http://www.couriermail.com.au/business/small-business", "section_title": "Small Business | Finance News for Small Businesses | The Courier-Mail", "url": "http://www.couriermail.com.au/lifestyle/vogue-fashions-night-out-bigger-than-the-boxing-day-sales/story-fniho6st-1227513122420", "country": "US", "title": "Vogue Fashion’s Night Out: Sydney event bigger than Boxing Day sales |", "performance_score": 0, "site": "couriermail.com.au", "participants_count": 1, "title_full": "Vogue Fashion’s Night Out: Sydney event bigger than Boxing Day sales | The Courier-Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "07b63ec0a92fb8237a8ab78e63ab1ebfb5a50bec"}, "author": "couriermail.com.au", "url": "http://www.couriermail.com.au/lifestyle/vogue-fashions-night-out-bigger-than-the-boxing-day-sales/story-fniho6st-1227513122420", "ord_in_thread": 0, "title": "Vogue Fashion’s Night Out: Sydney event bigger than Boxing Day sales |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vogue Fashion’s Night Out was officially opened by the Lord Mayor of Sydney Clover Moore and Vogue Editor-in-chief Edwina McCann, who were joined by a swarm of celebrities, designers and fashion bloggers.\nThe event was bigger than the boxing day sales — with shoppers spending an average of $300 each.\nThe rain held out for the VIP launch celebration in Hyde Park that kicked off with an acoustic performance by Emma Louise.\nThe Slap actor Sophie Lowe took to the stage to perform her track Understand and was joined by 12 models for the official ‘launch moment’ which culminated in a blast of black and gold streamers.\nNow in its sixth year, the event has grown from a small shopping seed to a huge extravaganza that involves a broad audience rather than just a favoured few fashion VIPs.\nThis year both the City of Sydney and City of Melbourne embraced the event by allowing hundreds of flag banners to fly around the city. A good sign that the city, as a business, are behind the mammoth activation.\nStores like Louis Vuitton, Bally, Swarovski, Burberry, Sambag, Leona Edmiston, Tiffany & Co, Zara and Topshop all got their style on while the entire Westfield centre and David Jones was buzzing with glasses of champagne and goodie bags.\nShoppers visit Harrolds during Vogue Fashion's Night Out. Source: Getty Images\n“Every year Fashion’s Night Out grows in both size and success and 2015 is the best yet with unprecedented support from the City of Sydney and more retailers than ever before,” said Edwina McCann.\n“Fashion is an inseparable part of Sydney’s economy,” followed Lord Mayor Clover Moore.\n“We are committed to supporting important events like Vogue Fashion’s Night Out as they give a huge boost to our retail sector and creative industries.”\nA DJ in Martin Place during Vogue Fashion's Night Out. Source: Getty Images\nSome of the highlights of Vogue Fashion’s Night Out\n*Olympus hosted a live ‘cover shoot’ activation in Pitt Street Mall where you could be ‘shot’ like a Vogue cover model.\n*Live runways with models showcasing the best of David Jones’ Australian designers.\n*David Jones was packed on all levels with designer panels, style workshops, champagne, DJs and the 30th anniversary David Jones Flower Show — this year called ‘ Luminescent’.\n*The Vogue VIP bar and the JT One ‘ultimate slumber’ party, hosted by singer Alli Simpson, took over On Seven at David Jones with guests staying well into the night. Sans pyjamas.\n*Men weren’t forgot about with the Market Street store bustling with style workshops with the GQ team, runways, live tattooing, wet shaves, shoe shines and whiskey tasting at the Gentlemen’s Lounge and Man Cave.\n*An Yves Saint Laurent pop up in Pitt Street Mall was full all night with shoppers enjoying VIP beauty experiences with some of the country’s top makeup artists, including Linda Jeffreys and Noni Smith doing lip, nail and make-up touch ups to ensure everyone looked their glossiest.\nShoppers visit the YSL Studio Lumiere Pop-Up store during Vogue Fashion's Night Out. Source: Getty Images\n*The Body Shop was offering hand massages and mini spa treatments for weary shoppers, and Austral Bricks hosted the The Fashion Haus pop-up bar with the team from Vogue Living.\n*In Martin Place, DJs spun tunes well into the night as shoppers stopped for a spot to eat from a plethora of food trucks, sampled from the Rachel’s yoghurt stand and snapped up the Vogue show bags.\nVFNO guests included Jessica Gomes, Montana Cox, Jesinta Campbell, Bridget Malcolm, Cheyenne Tozzi, Carla Zampatti, Bianca Spender, Luke Sales, Anna Plunket, Camilla Franks, Christine Centenera, Terry Biviano, Nick Smith, James Tobin, Richard Wilkins and Donna Player.\nWith VFNO in its 7th year globally, the event now happens in 27 cities around the world and will include Berlin, Lisbon, Moscow, Madrid, Florence and London this year.\n“We call this Boxing Day with alcohol,” a David Jones sales associate told industry publication Mediaweek.\nAnd that, pretty much summed the whole night up.\nFollow Melissa on Instagram and Twitter @melissahoyer\n Bigger than the Boxing Day sales", "external_links": ["http://resources0.news.com.au/images/2015/09/04/1227513/122344-8bd7e2d8-52bb-11e5-9feb-d976cea92fcd.jpg", "http://resources0.news.com.au/images/2015/09/04/1227513/122372-7ba48952-52bb-11e5-9feb-d976cea92fcd.jpg", "http://www.news.com.au/lifestyle/fashion/vogue-fashions-night-out-bigger-than-the-boxing-day-sales/story-fnks7u94-1227513122420", "http://resources0.news.com.au/images/2015/09/04/1227513/122608-8278a592-52bb-11e5-9feb-d976cea92fcd.jpg"], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-05T06:18:58.335+03:00", "highlightTitle": ""}