{"organizations": [], "uuid": "e893bed3ce12328e66fa5642a1f75afc1845614a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/06/fe-santoshtiwari3.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/india-world-number-one-in-fdi-a-big-boost-for-pm-narendra-modi/143744", "country": "IE", "title": "At $30 bn, India world number one in FDI, a big boost for Narendra Modi", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "At $30 bn, India world number one in FDI, a big boost for Narendra Modi | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T18:32:00.000+03:00", "replies_count": 0, "uuid": "e893bed3ce12328e66fa5642a1f75afc1845614a"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/india-world-number-one-in-fdi-a-big-boost-for-pm-narendra-modi/143744", "ord_in_thread": 0, "title": "At $30 bn, India world number one in FDI, a big boost for Narendra Modi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Editorial: Diwali before Dussehra Editorial: The future’s an option India’s Space Stardom PM Narendra Modi must capitalise on the good news on the FDI and the competitiveness fronts to strengthen the India story by finding ways to facilitate reforms in areas like taxation and labour quickly.\nAfter a successful visit to the US which witnessed heightened expectations from India in the Silicon Valley in terms of growth in the digital technology and the startups domain, Prime Minister Narendra Modi has been showered now with good news on the FDI and the business confidence index fronts, and RBI Governor Raghuram Rajan ’s surprise cut in the repo rate by 50 basis points could be just the perfect icing on the cake for the India story.\nAccording to a Financial Times report, “A ranking of the top destinations for greenfield investments (measured by estimated capital expenditure) in the first half of 2015 shows India at number one, having attracted roughly $3 bn more than China and $4 bn more than the US”.\nIn fact, the signs of an uptick are visible from last year as the country ranked fifth after China, the US, the UK and Mexico — in 2014 for capital investment.\nBy the end of June 2015, India has attracted $30 bn as against $12 billion in the first half of last year.\nAnother piece of good news is that India has climbed 16 places to the 55th position among 140 economies in this year’s World Economic Forum (WEF) Global Competitiveness Index, after five years of decline.\nThe normal reaction from the government obviously would be to take credit and rejoice, but instead of getting euphoric, it is time for both PM Modi and Finance Minister Arun Jaitley to understand that India is looking attractive not because the country has improved its business environment significantly, but mostly because China is down and the overall global situation too, is hardly encouraging.\nIn this backdrop, if investors are looking towards India, it needs to be taken as an opportunity to be capitalised on to the fullest by finding ways to enhance ease of doing business – FM Jaitley’s efforts to resolve tax cases, supporting states to relax their land acquisition and labour laws, and also changes proposed in the central labour laws, are steps in the right direction.\nIf PM Modi’s charms are attracting foreign investors in India, it has to be supported by changes on the ground also, and he will do well by finding ways to convince other political parties, that obstructions to the necessary reforms like the goods and services tax (GST) and hamper this process.\nWhile he has managed to attract foreign investors to a great extent, PM Modi has failed in managing Parliamentary logjam successfully, and he needs to better his track record quickly here if the success of his foreign visits has to translate into good results on the ground in India.\nThe NDA government would surely hope now that the critical Bihar assembly election results in November are also as supportive as the FDI and WEF boosters.\nWhile that may or may not be according to the expectations, but it is a fact that the Modi dispensation has a golden opportunity at hand to capitalise on the India growth story.\n 30, 2015 10:32 am", "external_links": [], "published": "2015-09-30T18:32:00.000+03:00", "crawled": "2015-09-30T11:45:13.895+03:00", "highlightTitle": ""}