{"organizations": ["Court of Appeal Fletcher"], "uuid": "68ce3000702aab987fc65bdb5e945b6550326f39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.3news.co.nz", "main_image": "http://cdn.3news.co.nz/3news/AM/2015/9/29/cd3a7b4a-aaa7-45db-9a90-6a5e72c77494/court1.jpg", "site_section": "http://feeds.feedburner.com/co/hYAN", "section_title": "Business / Finance news", "url": "http://www.3news.co.nz/business/fletcher-knauf-battle-batts-in-court-of-appeal-2015092914", "country": "NZ", "title": "Fletcher, Knauf battle batts in Court of Appeal", "performance_score": 0, "site": "3news.co.nz", "participants_count": 0, "title_full": "Fletcher, Knauf battle batts in Court of Appeal", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T16:44:00.000+03:00", "replies_count": 0, "uuid": "68ce3000702aab987fc65bdb5e945b6550326f39"}, "author": "", "url": "http://www.3news.co.nz/business/fletcher-knauf-battle-batts-in-court-of-appeal-2015092914", "ord_in_thread": 0, "title": "Fletcher, Knauf battle batts in Court of Appeal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Fletcher", "Knauf"], "text": "Fletcher, Knauf battle batts in Court of Appeal \nTuesday 29 Sep 2015 2:44 p.m. \nBy Suze Metherell \nFletcher Building and German rival Knauf have returned to court in their long-running dispute over the use of the word \"batts\" to describe insulation. \nAppearing in the Court of Appeal before Justices Tony Randerson, Christine French and Mark Cooper, the legal counsel for Fletcher's Tasman Insulation subsidiary, Julian Miles QC argued that Knauf's use of \"batt\" or \"batts\" on the packaging of insulation infringed the \"Batts\" trademark it has held since 1973. \nThe two building supplies companies are both appealing aspects of Justice Brendan Brown's May 2014 judgment, which refused a request from Knauf to revoke the trademark. \nIn the same judgment, Justice Brown also limited Fletcher's claim of infringement of the trademark to the use of \"batt\" in the HTML code on the www.earthwool.co.nz website, which sold Knauf insulation, and said the use of the word in the installation instructions on the packaging didn't infringe trademark. \nDwarfed by 11-plus boxes of files and three large rolls of Knauf insulation, Mr Miles said the rival company first started importing its insulation into New Zealand in December 2010, originally in clear packaging labelled \"loft roll\". \nHowever, during 2011 Knauf began to bring in \"what we understand was the same product with different packaging\" which included instructions which referred to the product as \"batts\". \nMr Miles pointed out the difference using the three insulation rolls in the court room. \nHe argued that Knauf's use of \"batts\" on its packaging was a \"deliberate\" attempt to use Fletcher's trademarked term. \nHe said the change from the original non-offending packaging to the inclusion of the term came after market research showed the widespread use of the term over the past four decades. \nKnauf \"knew [Batts] had a trademark, the only inference that you can draw from that is that they intended to undermine a trademark,\" he said. \nKnauf, represented by Clive Elliott QC, is appealing Justice Brown's ruling that the \"Batts\" trademarked term for insulation is not generic. \nThe hearing is set down for three days. \nNZN", "external_links": [], "published": "2015-09-28T16:44:00.000+03:00", "crawled": "2015-09-29T05:43:34.174+03:00", "highlightTitle": ""}