{"organizations": ["Gilat", "Gilat Satellite Networks Ltd"], "uuid": "dd8aa2aaa1465e4c2201c11540ea4a35bd3c2a5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/213747?filename=213747.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/17/Financing%20Agreements", "section_title": "GlobeNewswire: Financing Agreements", "url": "http://globenewswire.com/news-release/2015/09/24/770737/10150456/en/Gilat-Signed-Agreement-With-Major-Satellite-Broadband-Provider-to-Deliver-High-Performance-Dual-Ku-Ka-Band-Terminal-for-the-High-Growth-In-Flight-Connectivity-Market.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "country": "US", "title": "Gilat Signed Agreement With Major Satellite Broadband Provider to Deliver High-Performance Dual Ku/Ka-Band Terminal for the High Growth In-Flight Connectivity Market", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Gilat Signed Agreement With Major Satellite Broadband Provider to Deliver High-Performance Dual Ku/Ka-Band Terminal for the High Growth In-Flight Connectivity Market", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T16:06:00.000+03:00", "replies_count": 0, "uuid": "dd8aa2aaa1465e4c2201c11540ea4a35bd3c2a5c"}, "author": "", "url": "http://globenewswire.com/news-release/2015/09/24/770737/10150456/en/Gilat-Signed-Agreement-With-Major-Satellite-Broadband-Provider-to-Deliver-High-Performance-Dual-Ku-Ka-Band-Terminal-for-the-High-Growth-In-Flight-Connectivity-Market.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "ord_in_thread": 0, "title": "Gilat Signed Agreement With Major Satellite Broadband Provider to Deliver High-Performance Dual Ku/Ka-Band Terminal for the High Growth In-Flight Connectivity Market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gilat Signed Agreement With Major Satellite Broadband Provider to Deliver High-Performance Dual Ku/Ka-Band Terminal for the High Growth In-Flight Connectivity Market Revolutionary Terminal Will Enable Aircraft Passengers to Enjoy Constant Broadband Connectivity With Unprecedented Performance September 24, 2015 09:06 ET | Source: Gilat Satellite Networks Ltd. \nPETAH TIKVA, Israel, Sept. 24,   Gilat Satellite Networks Ltd. (NASDAQ: GILT ) (TASE: GILT ), a worldwide leader in satellite networking technology, solutions and services announced today that it has signed a long-term agreement to develop and supply high-performance dual Ku/Ka-band terminals for in-flight connectivity (IFC) on commercial aircraft. \nBenefitting from Gilat's longstanding expertise in high-performance and low-profile antenna design, the new Ku/Ka-band in-flight connectivity solution will enable IFC service providers to deliver global and continuous broadband coverage on commercial aircraft. \nGilat will develop and provide a dual Ku/Ka-band antenna with its proprietary power amplifiers (KRFU and KANDU). The antenna is also intended to meet the requirements for future line fit installations. \nThis unique competitive configuration offers a scalable, cost-effective global bandwidth solution to meet growing broadband requirements, to optimize bandwidth allocation and to ensure continuous coverage on more airline routes. Rollout is expected in 2017. \n\"The new terminal leverages our proven technological capabilities in both industry-leading Wavestream airborne transceivers and advanced UAV terminals,\" said Moshe (Chico) Tamir, Corporate Vice President and President of Gilat's Mobility Division. \"We are excited to expand our offering and to put the best terminal for high-speed Internet access on board commercial flights.\" \nAbout Gilat \nGilat Satellite Networks Ltd (NASDAQ: GILT ) (TASE: GILT ), is a leading provider of products and services for satellite-based broadband communications. Gilat develops and markets a wide range of high-performance satellite ground segment equipment and VSATs, with an increasing focus on the consumer and Ka-band market. In addition, Gilat enables mobile SOTM (Satellite-on-the-Move) solutions providing low-profile antennas, next generation solid-state power amplifiers and modems. Gilat also provides managed network and satellite-based services for rural telephony and Internet access via its subsidiaries in Peru and Colombia. \nWith over 25 years of experience, and over a million products shipped to more than 90 countries, Gilat has provided enterprises, service providers and operators with efficient and reliable satellite-based connectivity solutions, including cellular backhaul, banking, retail, e-government and rural communication networks. Gilat also enables leading defense, public security and news organizations to implement advanced, on-the-move tactical communications on board their land, air and sea fleets using Gilat's high-performance SOTM solutions. Gilat's controlling shareholders are the FIMI Private Equity Funds. For more information, please visit us at www.gilat.com \nCertain statements made herein that are not historical are forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. The words \"estimate\", \"project\", \"intend\", \"expect\", \"believe\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties. Many factors could cause the actual results, performance or achievements of Gilat to be materially different from any future results, performance or achievements that may be expressed or implied by such forward-looking statements, including, among others, changes in general economic and business conditions, inability to maintain market acceptance to Gilat's products, inability to timely develop and introduce new technologies, products and applications, rapid changes in the market for Gilat's products, loss of market share and pressure on prices resulting from competition, introduction of competing products by other companies, inability to manage growth and expansion, loss of key OEM partners, inability to attract and retain qualified personnel, inability to protect the Company's proprietary technology and risks associated with Gilat's international operations and its location in Israel. For additional information regarding these and other risks and uncertainties associated with Gilat's business, reference is made to Gilat's reports filed from time to time with the Securities and Exchange Commission. Gilat Satellite Networks Joelle Inowlocki KCSA Strategic Communications Phil Carlson, Vice President (212) 896-1233 Related Articles", "external_links": [], "published": "2015-09-24T16:06:00.000+03:00", "crawled": "2015-09-24T17:07:56.170+03:00", "highlightTitle": ""}