{"organizations": [], "uuid": "88afd83ce9cbfc71ee7a20e88a8da788a8c4da72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/01/markets-bonds-usa-idUSL1N1171N620150901", "country": "US", "title": "TREASURIES-Prices gain on weak U.S., China manufacturing data", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "TREASURIES-Prices gain on weak U.S., China manufacturing data | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T23:45:00.000+03:00", "replies_count": 0, "uuid": "88afd83ce9cbfc71ee7a20e88a8da788a8c4da72"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/01/markets-bonds-usa-idUSL1N1171N620150901", "ord_in_thread": 0, "title": "TREASURIES-Prices gain on weak U.S., China manufacturing data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* China manufacturing contracts at fastest pace in 3 years in Aug\n* U.S. manufacturing sector growth weakest in over 2 years in Aug\n* Possible central bank selling caps 30-yr price gains (Updates prices, adds comments)\nBy Sam Forgione\nNEW YORK, Sept 1 (Reuters) - U.S. Treasuries prices rose on Tuesday after data showing weakness in the Chinese and U.S. manufacturing sectors fueled safe-haven bids, while possible selling of long-dated Treasuries by foreign central banks capped those bonds' gains.\nThe Chinese government's measure of manufacturing showed activity contracted at the fastest pace in three years, denting hopes of a second-half pickup as Asia tries to fire up its traditional growth engine of exports.\nIn addition, the Institute for Supply Management said its index of U.S. factory activity fell to 51.1 in August from 52.7 in July, marking the slowest growth in more than two years.\n\"Weakness in China's economy has a cascade effect as it works its way across the globe,\" said Ellis Phifer, market strategist at Raymond James in Memphis, Tennessee. He noted the negative impact of China's slowdown on global trade and said the weak Chinese data caused safe-haven demand for Treasuries.\nAnalysts also said the U.S. data was a concern and spurred safety bids for U.S. government debt.\nBenchmark 10-year yields hit a session low of 2.15 percent after reaching a 1-1/2 week high of 2.22 percent on Monday.\nU.S. 30-year Treasuries prices were slightly higher on the day after falling earlier in the session. Analysts said foreign central banks could be selling the bonds in order to raise money to buy their own currencies.\nAnalysts also said caution ahead of Friday's U.S. non-farm payrolls report for August kept traders from making significant bullish or bearish bets.\nEconomists expect the report to show U.S. employers added 220,000 jobs in August, up from 215,000 in July, according to a Reuters poll. The U.S. Federal Reserve is watching the labor market for guidance on when to raise interest rates.\n\"Friday is going to give you a good indication of whether the Fed will raise rates at the September meeting or not,\" said Charles Comiskey, head of Treasuries trading at Bank of Nova Scotia in New York.\nU.S. 10-year Treasuries were last up 8/32 in price to yield 2.17 percent, from a yield of 2.20 percent late on Monday. The 30-year bond was up 2/32, with the yield little changed from where it stood late Monday, at 2.93 percent. The yield earlier hit a session high of 2.964 percent, just below Monday's one-month high of 2.965 percent.\nTwo-year notes were up 2/32 to yield 0.71 percent, from a yield of 0.74 percent late on Monday. (Reporting by Sam Forgione; Editing by Lisa Von Ahn and Chizu Nomiyama)", "external_links": [], "published": "2015-09-01T23:45:00.000+03:00", "crawled": "2015-09-01T22:51:11.497+03:00", "highlightTitle": ""}