{"organizations": [], "uuid": "7bf1bf3d413213e102bbb8c99d86249d6abbe4e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "america.aljazeera.com", "main_image": "http://america.aljazeera.com/content/dam/ajam/images/articles_2015/09/wagegap_09022015.jpg", "site_section": "http://america.aljazeera.com/topics/topic/issue/finance.html", "section_title": "Finance | Al Jazeera America", "url": "http://america.aljazeera.com/articles/2015/9/2/new-research-dissects-gap-between-wages-and-productivity.html", "country": "US", "title": "New Research Explains Why Wages Aren't Rising", "performance_score": 0, "site": "aljazeera.com", "participants_count": 1, "title_full": "New Research Explains Why Wages Aren't Rising | Al Jazeera America", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T18:15:00.000+03:00", "replies_count": 0, "uuid": "7bf1bf3d413213e102bbb8c99d86249d6abbe4e7"}, "author": "Ned Resnikoff", "url": "http://america.aljazeera.com/articles/2015/9/2/new-research-dissects-gap-between-wages-and-productivity.html", "ord_in_thread": 0, "title": "New Research Explains Why Wages Aren't Rising", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The widening chasm between workers’ pay and productivity since the 1970s is “the central component of the wage stagnation story” in the United States, the Economic Policy Institute (EPI) said in a report issued Wednesday ahead of the Labor Day weekend.\nDrawing on data from the Social Security Administration and the Bureau of Labor Statistics, EPI economists Lawrence Mishel and Josh Bivens found that median hourly compensation, adjusted for inflation, grew by 8.7 percent between 1973 and 2014. Productivity rose 72.2 percent over the same time period, the EPI report said.\n“Productivity and compensation — all wages and benefits for a typical worker — used to grow together from 1948 to 1973, but since 1973 they have diverged,” Mishel said Wednesday in a conference call with reporters. “That’s very important.\"\nThe gap between wages and productivity growth has been thoroughly documented, by economists at EPI, a think tank with connections to organized labor, as well as by other scholars.\nThe paper released Wednesday defends and expands on prior research, arguing that specific policy choices and business practices have fueled the growth of productivity relative to worker compensation — a gap the authors say has been a major driver of inequality.\nThe paper blames “two key dynamics” for the gap: Growing inequality between workers when it comes to wages, and “the shift in the share of overall national income going to owners of capital and away from the pay of employees.\"\nAnalysis of that shift found what the authors called a “surprisingly modest effect of redistribution from labor to capital incomes.” Based on the data available, they calculated that such redistribution “accounts for only 11.5 percent of the gap between pay and net productivity over the 1973 to 2014 period.”\nBut the authors also said the available figures had some limitations. For example, they wrote that the data EPI used to calculate the breakdown between labor and capital incomes included CEO compensation, “including realized stock option gains of executives and bonus pay,” in its estimate of labor compensation — even though such forms of compensation, wrote Bivens and Mishel, have “a strong character of capital income\" because they are tied to stock prices.\nAt the same time that capital’s share of income has grown over the last few decades, the size of the financial sector has exploded, according to recent research from the Roosevelt Institute , a liberal economic think tank.\n“Capital has taken home an increasing share of national income with labor taking home less,” wrote Roosevelt Institute researchers in a July white paper on the “financialization” of the U.S. economy. “This increasing importance of wealth in our economy is an important element of financialization.\" The term refers to the encroachment of the financial sector into public and private life.\nEPI's Bivens and Mishel focused on labor policy in explaining how wages have become uncoupled from productivity growth, citing three broad types of policies that they said had widened the split: Policies that hindered full employment, those that weakened labor standards, and those that undermined collective bargaining.\nBivens said the impact of such decisions is obvious to people in the workplace.\n“Mostly what it means for the typical American worker is they don’t see their hourly pay rise, even as lots of income is being generated around them, even generated by them,” he said.", "external_links": ["http://www.epi.org/publication/understanding-the-historic-divergence-between-productivity-and-a-typical-workers-pay-why-it-matters-and-why-its-real/"], "published": "2015-09-02T18:15:00.000+03:00", "crawled": "2015-09-03T00:03:17.534+03:00", "highlightTitle": ""}