{"organizations": [], "uuid": "0332c74e5e87d41b1b21138d0cf802fb7b1de986", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/u/0/e/j/image.related.afrArticleLead.620x365.gjjnv7.png/1441948054726.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/personal-finance/emerging-markets-pose-risks-for-investors-20150910-gjjnv7", "country": "AU", "title": "Emerging markets pose risks for investors", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Emerging markets pose risks for investors | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T12:45:00.000+03:00", "replies_count": 0, "uuid": "0332c74e5e87d41b1b21138d0cf802fb7b1de986"}, "author": "Karen Maley", "url": "http://www.afr.com/personal-finance/emerging-markets-pose-risks-for-investors-20150910-gjjnv7", "ord_in_thread": 0, "title": "Emerging markets pose risks for investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Investors have been pulling money out of emerging markets. Cultura Travel/Planet Pictures by Karen Maley Citigroup's chief economist Willem Buiter sent a chill down investors' spines this week with his glum warning that there was a 55 per cent chance of a global recession in the next two years.\nThe baleful prediction comes as many are worrying whether the global bull market in equities that started in 2009 has finally run out of steam, particularly as the vicious sell-off in global markets over the past few weeks has caused the US sharemarket to forfeit all its gains for the year.\nThe trigger for the sell-off was China's decision in August to devalue the yuan, a move that caused investors to focus on the slowdown under way now in the world's second-largest economy.\nIn his latest research report, the highly regarded Buiter estimates that Chinese growth has already slowed to about 4 per cent, well below Beijing's target of 7 per cent target for 2015.\n\"The reasons behind China's downturn and likely recession are familiar from the long history of business cycles everywhere: rising excess capacity in a growing number of sectors, excessive leverage in the private sector, and episodes of irrational exuberance in asset markets – in China there were two thus far, for residential real estate and equity – resulting in booms, bubbles and busts\", he says.\nAs a result, Buiter believes China faces a \"high and rapidly rising risk of a cyclical hard landing\", which will reverberate through emerging markets.\n\"Should China enter a recession – and with Russia and Brazil already in recession – we believe that many other emerging markets, already weakened, will follow, driven in part by the effects of China's downturn on the demand for their exports and, for the commodity exporters, on commodity prices.\"\nIncreasing frailty As if to emphasise the increasing frailty of emerging markets, Standard & Poor's moved this week to cut Brazil's sovereign debt rating to junk status, dealing a blow to the Rousseff government's credibility with investors, and threatening to aggravate the country's severe economic downturn.\nBut while many investors are clinging to the hope that Beijing will unveil some big new spending initiatives to boost China's flagging growth, Buiter is sceptical. \"Policy options to prevent a recession exist but are, in our view, unlikely to be exercised in time,\" he says.\nWhat's more, Buiter believes that most developed countries are running out of ammunition to fight this slowdown in growth in China and the emerging markets, either because they have already cut interest rates close to zero, or because they are already saddled with large debt burdens.\n\"Today, the interest rate is out of commission as a policy instrument in most developed markets and fiscal space is more severely constrained than in 2008 almost everywhere,\" he says.\nBuiter's sombre prediction comes at a time when many investors are anxious that a possible US rate hike next week could exacerbate capital outflows from embattled emerging markets.\nThese capital outflows represent a stark contrast from the bountiful inflows of foreign funds that emerging markets enjoyed in the six years following the financial crisis, as investors aggressively hunted down higher-yielding investments.\nDuring those halcyon years, investors were particularly attracted to the five BRICS countries – Brazil, Russia, India, China and South Africa – which were widely touted as the growth leaders of the future. Investors also poured money into assets in other emerging market economies, including Turkey, Indonesia, Mexico and Nigeria.\nCaused price tumbles But China's slowdown has caused price tumbles in commodities such as oil, copper and iron ore, putting pressure on the currencies of big commodity exporters such as Russia, Brazil and Chile.\nSpooked by these sharp declines in commodity prices, and worried about their dimming growth prospects, investors have responded by pulling out hundreds of billions from emerging markets in 2015. These massive capital outflows are pushing down emerging-market currencies, which has the effect of pushing up the value of US-denominated debt when measured in the local currency.\nAt the same time, emerging-market borrowers who have taken out big loans in US dollars are being squeezed by the rising US dollar, which has climbed almost 20 per cent since the middle of 2014, its sharpest jump since the late 1990s. The US dollar could rise even higher if the US central bank decides to raise its key interest rate next week.\nThe big risk for investors is that eventually a high-profile emerging-market borrower will buckle under the pressure of servicing its hefty foreign debt at a time when its export sales are plummeting.\nAnalysts fear that at that point retail investors, who have ploughed about $US1 trillion ($1.41 trillion) of their savings into emerging-market bond funds, are likely to panic and rush for the exits. This will leave the managers of emerging-market bond funds little choice but to dump whatever assets they can as they scramble to cover withdrawals, thereby ensuring that the crisis spreads to other emerging markets.\nThe trouble is that bond markets in most emerging markets are relatively shallow, which means fund managers could find it hard to dispose of quickly enough bonds to repay investors. If they're unable to sell assets quickly enough, some fund managers might decide that the best approach is to temporarily suspend redemptions.\nBut investors could see this as an eerie replay of the market disruption in 2007, which served as a prelude to the financial crisis. In mid-2007, several subprime mortgage funds were frozen as investors tried to withdraw funds at a time when market liquidity had dried up.\nAlthough this time around the problems are likely to erupt in emerging-market bond funds, analysts warn that the prospect of not being able to withdraw their funds on demand could severely erode investor confidence again.", "external_links": [], "published": "2015-09-11T12:45:00.000+03:00", "crawled": "2015-09-11T14:11:18.682+03:00", "highlightTitle": ""}