{"organizations": [], "uuid": "989a9e9ee3b5525c3056ae3f6735094efb67be4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/.0j4Hm3aLxHof7ScXKB.0Q--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/gettyimages-489541676-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-skynews/?format=rss", "section_title": "Finance News | Sky News - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/shocked-vw-boss-quits-over-160749377.html", "country": "GB", "title": "'Shocked' VW Boss Quits Over Emissions Scandal", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "'Shocked' VW Boss Quits Over Emissions Scandal", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T20:09:00.000+03:00", "replies_count": 0, "uuid": "989a9e9ee3b5525c3056ae3f6735094efb67be4e"}, "author": "", "url": "https://uk.finance.yahoo.com/news/shocked-vw-boss-quits-over-160749377.html", "ord_in_thread": 0, "title": "'Shocked' VW Boss Quits Over Emissions Scandal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Sep 23, 2015, 18:23 BST - UK Markets closed 'Shocked' VW Boss Quits Over Emissions Scandal By (c) Sky News 2015 | Sky News – 13 minutes ago View Photo \n\nVolkswagen (Other OTC: VLKAF - news ) 's chief executive has quit following the emissions scandal engulfing the German carmaker. \nMartin Winterkorn said he was shocked and stunned that \"misconduct on such a scale was possible\" at VW, which he said was in the middle of a \"grave crisis\". \nThe controversy is centred on \"defeat devices\" VW used to fool US emissions tests on diesel cars into believing the vehicles met environmental standards. \nThe company admits the software, which switches engines to a cleaner mode during official testing, may have been fitted in 11 million of its vehicles worldwide. \nThe \"defeat devices\" meant true emission levels, as much as 40 times the level legally allowed in the US, were hidden. \nMr Winterkorn said he accepted responsibility for \"irregularities found in diesel engines\" but had not been aware of any wrongdoing. \n:: VW Scandal: Key Questions Answered \nAt least 482,000 cars are to be recalled and the car maker could face penalties of more than $18bn (£11bn) in the US alone. \nIt (Other OTC: ITGL - news ) is not known if the scandal affects cars on Britain's roads, but campaigners want the testing process for vehicles to be made more stringent. \nFollowing a crunch meeting with members of the company's board, Mr Winterkorn announced his resignation to the stock market. \nHe said in a statement: \"I am shocked by the events of the past few days. Above all, I am stunned that misconduct on such a scale was possible in the Volkswagen Group.\" \nHe said he decided to quit for the good of the firm, adding: \"Volkswagen needs a fresh start - also in terms of personnel. I am clearing the way for this fresh start with my resignation. \n\"I am convinced that the Volkswagen Group and its team will overcome this grave crisis.” On Tuesday, he apologised for the scandal. \nA US law firm said on Wednesday it was suing Volkswagen in a class action lawsuit. \nChicago lawyer Robert Clifford said the impact was \"massive\" and that car buyers had not got what they paid for. \nHe said people were also affected because their car could now be worth less. \nMr Clifford claimed VW owners could have problems keeping their car on the road as officials might refuse to issue relevant permits. \nNew York Attorney General Eric Schneiderman has also confirmed an investigation. \nVW has set aside an initial £4.7bn to cover the fallout and \"win back the trust\" of customers. \nIt also said this year's profit projections will change, and warned future costs remain undetermined. \nShares (Berlin: DI6.BE - news ) in VW were up 5% on Wednesday, but since the scandal broke at the start of the week the firm has lost around one third of its value, or £19bn.", "external_links": [], "published": "2015-09-23T20:09:00.000+03:00", "crawled": "2015-09-23T20:28:25.590+03:00", "highlightTitle": ""}