{"organizations": [], "uuid": "2d5d7345034b2c53ceeb3f4da4897df3c0abe34e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/o/1/w/1/image.related.afrArticleLead.620x365.gjtdp8.png/1443146208246.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/the-housing-boom-has-not-peaked-20150923-gjtdp8", "country": "AU", "title": "The housing boom has not peaked", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The housing boom has not peaked | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T09:15:00.000+03:00", "replies_count": 0, "uuid": "2d5d7345034b2c53ceeb3f4da4897df3c0abe34e"}, "author": "Christopher Joye", "url": "http://www.afr.com/personal-finance/the-housing-boom-has-not-peaked-20150923-gjtdp8", "ord_in_thread": 0, "title": "The housing boom has not peaked", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fed chairwoman Janet Yellen got the yips on rates because she was worried, ironically, about the signals markets were sending her on global growth. AP Share on twitter by Christopher Joye The same people who failed to predict the great Australian housing boom of 2013 to 2015, who dismissed the possibility of a bubble emerging, and who poured cold water over the idea that regulators would introduce unprecedented controls to cool conditions, are now screaming that the market has \"peaked\". I will explain later why there is absolutely no evidence to support this proposition. For better or worse, this boom has some way to go yet.\nOur new Prime Minister, Malcolm Turnbull, has had an impressive week. Contrary to the preternatural media cynicism that is an echo chamber of the myopia that plagues politics, his first big interview with the ABC's Leigh Sales was not a warm and fuzzy puff piece .\nFaced with a fresh leader who has yet to make fatal mistakes, Sales was appropriately respectful. Carefully controlling the conversation, she expertly drew Turnbull out on his defining philosophical principles, key policy positions and priorities, and learnings from past mistakes. It was encouraging to listen to a confident leader with a command of the economy who could clearly communicate a positive vision of the nation's prospects rather than a tit-for-tat vilification of political opponents.\nTurnbull was right in making the point that, given Australia is experiencing one of the sharpest declines in capital investment (aka the \"capex cliff\") and export prices in history, the economy's performance has been resilient. Care of record low borrowing rates that have fuelled double-digit gains in the value of our bricks and mortar, the growth engine has migrated from mining to much-needed housing construction, which must increase to meet the accommodation demands implied by our population projections.\nIn this context, the new Treasurer, Scott Morrison, who was once shadow housing minister, is correct to focus on liberating stubbornly inert housing supply to address the structural affordability problem that is attributable to artificially expensive urban land values rather than building costs. (I first highlighted this in a 2003 report I wrote for Turnbull and former prime minister John Howard.)\nScare-mongering Despite the scare-mongering surrounding the end of the resources boom, we did manage to expand the real value of Australian output (or gross domestic product by 2 per cent over the year to June 30, which is only about half a percentage point short of recently revised estimates of \"trend\" growth. The jobless rate has likewise stabilised at a historically low 6 per cent, which is not miles above full employment, while the 37 per cent depreciation in the Aussie dollar is furnishing an exceptionally powerful tailwind for import-competing industries, exporters and tourism.\nTurnbull argues that a headwind to unleashing our economic potential is the consumer and business uncertainty induced by petty politics and the leadership lacuna. When the parties responsible for running our $1.5 trillion economy cannot manage their way out of a paper bag, and are more interested in debasing the policy dialogue to the intellectual quotient of a schoolyard bully, the community is bound to become dispirited.\n Of course the media eagerly amplifies this noise. During the week there was a sensational report that Turnbull has suddenly decided to ditch Treasury's tax reform process, to the detriment of our collective welfare. The digitally disposed Prime Minister immediately retorted on Twitter that the \"story is not true\". Thankfully, Fairfax Media's Peter Martin calmly explained that Turnbull was, in fact, revitalising a process \"badly in need of a reset\" after Tony Abbott had taken key reform targets including superannuation, the GST, capital gains tax, and home loans off the table. \"Like the Black Knight in Monty Python and the Holy Grail , the Treasury was continuing to draft the paper after its arms and legs had been chopped off,\" Martin observed.\nTurnbull believes government has become a handbrake on private ingenuity and enterprise – the only way to enhance long-term living standards – through unnecessarily invasive and often irrational decision-making. He's trying, therefore, to recalibrate the public narrative to inspire workers, owners and entrepreneurs to garner the conviction to invest in their futures. The idea is that government seeks to empower markets rather than distorting them and dulling productivity.\nAddictive elixer This is the single most important challenge of the post-global financial crisis era. That is, disentangling governments from markets and weaning investors off the addictive elixir of taxpayer bailouts every time a market signals that bad businesses need to fail to enable better ones to rise in their stead.\nIt's no coincidence that almost every crisis we've experienced in the eight years since the GFC has spawned directly or indirectly from the public sector. Recall the first European sovereign debt crisis that savaged all asset classes in mid 2012. Or the US Federal Reserve's \"taper tantrum\" 12 months later, when then Fed chairman Ben Bernanke canvassed the cessation of its unprecedented purchases of trillions of dollars worth of government bonds.\nThis year we've had huge shocks wrought in June by Greece's unsustainable finances and mooted exit from the euro zone, and then in August by the bursting of the immense asset price bubble in Chinese equities, which are dominated by state-owned enterprises. China's imbalances are the result of a highly opaque and centrally planned economy that pollutes savings and investment decisions. The exemplification of this was President Xi Jinping's crazy June prediction that the Shanghai Composite Index would \"soon hit 10,000 points\". The poor punters who followed their dear leader's prescriptions watched the value of their stocks slump some 40 per cent, with further losses cauterised by the government's preparedness to spend hundreds of billions of dollars of taxpayer mullah buying shares.\nGlobal markets are currently in a fizz because of the Fed's decision not to rais interest rates from their near-zero base in September notwithstanding a US jobless rate of just 5.1 per cent, which is technically below chair Janet Yellen's \"full employment\" range of between 5.2 per cent and 5.6 per cent.\nYellen apparently got the yips because she was worried, ironically, about the signals markets were sending her on global growth. And even though investors only put a 30 per cent probability on a September increase, they are now having conniptions that Yellen knows something they don't. This illogical circularity is precisely what you get when governments interfere in markets for years to create an Alice-in-Wonderland-like alternative reality.\nAnd so Aussie shares are down 3.6 per cent in September after a staggering 8.1 per cent loss in August, which has wiped out the gains in the first quarter of 2015 to bring the year to date drawdown to a painful 6.3 per cent.\nGains wiped out According to Bank of America Merrill Lynch (and the Bank of England), we now have the lowest short- and long-term interest rates in 5000 years! And ANZ reckons the RBA will cut twice more in 2016.\nEnter the mindless media. After missing the arrival of the housing boom-turned-bubble in 2013 and 2014, they are falling over themselves to report the market has \"peaked\", auction clearance rates are plummeting , and prices are dropping . The hard data suggests this is bollocks.\nAussie dwelling values have inflated a healthy 0.5 per cent in the first 24 days of September and by a super-strong 3.7 per cent over the past three months, which is a 15 per cent annual pace. Over the nine months of 2015 capital gains have annualised at an incredible 12.1 per cent, which is faster than the 10.8 per cent year-on-year growth through to end September.\nPity the Reserve Bank of Australia's Glenn Stevens, who in mid-2014 said \"it would in my opinion be good\" if a \"slower pace of growth in dwelling prices … did persist for a while\". Stevens was hoping for \"unremarkable performance on [house] prices\" for the \"next couple of years\". Yet this week the RBA revealed that, relative to household incomes, dwelling prices are now the most expensive on record, surpassing the high watermarks set during the 2003, 2007 and 2010 booms.\nMuch-maligned auction markets also remain in rude health. Last weekend's 70.7 per cent clearance rate was way above the 59.8 per cent average since 2008 and notably identical to the outcome achieved this time last year. With tighter lending rules and a temporarily frozen Chinese bid (their government is trying to thwart capital flight), capital gains will likely decelerate from their current double-digit pace back to around 3 to 4 times wages growth. Property prices will stay well supported by the cheapest home loan costs borrowers have ever seen, a much lower Aussie dollar that stimulates expat and foreign demand, and the illusion that bricks and mortar, which does not get regularly revalued, is safer than the high-frequency and brain damage-inducing volatility of the sharemarket (and super portfolios overexposed to it). With banks needing to maintain asset growth and the RBA dovishly neutral, this boom will continue for some time yet.\nThe author is a director and shareholder in Smarter Money Investments, which manages fixed-income investment portfolios.", "external_links": ["http://www.news.com.au/finance/economy/australias-housing-boom-has-peaked-at-an-awkward-time-morgan-stanley/story-fnu2pwk8-1227539818577", "https://www.menziesrc.org/images/Research/home-ownership/volume_1.pdf", "http://www.smh.com.au/federal-politics/political-news/turnbull-governments-tax-white-paper-why-we-need-a-reset-20150923-gjt4nl.html", "http://www.smh.com.au/entertainment/tv-and-radio/leigh-sales-criticised-for-softtouch-interview-with-malcolm-turnbull-20150921-gjrsmg.html", "https://twitter.com/cjoye", "http://www.domain.com.au/news/sydney-auction-prices-show-signs-of-slipping-in-investor-heartlands-20150918-gjovei/"], "published": "2015-09-25T09:15:00.000+03:00", "crawled": "2015-09-25T05:38:50.113+03:00", "highlightTitle": ""}