{"organizations": [], "uuid": "782c2d5b2dd059698a1bd357cf5204f7c8177979", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-25/stocks-slump-toward-worst-quarter-in-4-years-amid-fed-confusion", "country": "US", "title": "Stocks Slump Toward Worst Quarter in 4 Years Amid Fed Confusion", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Stocks Slump Toward Worst Quarter in 4 Years Amid Fed Confusion - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T05:42:00.000+03:00", "replies_count": 0, "uuid": "782c2d5b2dd059698a1bd357cf5204f7c8177979"}, "author": "Oliver Renick", "url": "http://www.bloomberg.com/news/articles/2015-09-25/stocks-slump-toward-worst-quarter-in-4-years-amid-fed-confusion", "ord_in_thread": 0, "title": "Stocks Slump Toward Worst Quarter in 4 Years Amid Fed Confusion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sneakers or tractors?\nThat choice was emblematic of the conflict stock investors faced this week amid mixed messages on the health of the U.S. economy.\nA sales warning from Caterpillar Inc. showed the risks of slowing global growth, while Nike Inc. provided a more upbeat view of demand overseas. Investors weighed a slip in equipment orders against a pickup in gross domestic product. A tweet by Hillary Clinton roiled the biotechnology industry, highlighting the volatility facing markets.\nAnd above it all loomed the Federal Reserve, whose officials fueled the debate over whether the American economy is robust enough to withstand higher interest rates amid the recent turmoil.\n“There was enough beef on both sides of the plate in the week,” said Jim Paulsen, the Minneapolis-based chief investment strategist at Wells Capital Management Inc., which oversees $351 billion. “It hasn’t clarified a lot. It puts you back to where you were before the Fed announcement.”\nAs the quarter winds down next week, investors will hear separately from six Fed officials, including fresh comments from Chair Janet Yellen. She’ll speak two days before the government’s September payrolls report, the last reading before the central bank convenes on Oct. 27.\nThe Standard & Poor’s 500 Index finished the five days with a loss of 1.4 percent. The gauge has tumbled 6.4 percent in the quarter, headed for its worst slide in four years. A rally Friday, sparked by Yellen’s reassurance that turbulence in emerging markets won’t harm growth in the U.S., was snuffed out by the selloff in biotechnology shares.\nThe Nasdaq Biotechnology Index tumbled into a bear market after falling 13 percent in the week, its worst since 2011. The rout was sparked by a tweet from Democratic presidential hopeful Hillary Clinton suggesting there may be “price gouging” in the market for prescription drugs. Health-care shares in the S&P 500 tumbled 5.8 percent, the most of 10 groups.\nThe selloff refocused attention on the volatility in markets that have been roiled in the six weeks since China’s shock devaluation of its currency. The Chicago Board Options Exchange Volatility Index climbed 6 percent to 23.62 in the week, including a one-day jump Tuesday of 11 percent that was the biggest since last month’s rout. The gauge has closed above 20 for 25 straight days, the longest stretch since January 2012.\nEquities began the week higher after four Fed officials separately said any turmoil would be short-lived, and growth wouldn’t be disrupted by higher interest rates this year. That contradicted the rationale the Fed used when it decided Sept. 17 to keep interest rates pinned near zero. Economists had been evenly split on whether the Fed would judge the economy healthy enough to tighten.\n“If you’ve been in the hospital and the doctor says you can leave tomorrow, but then the doctor says we need to watch you more, it’s a disappointment,” said Doug Sandler, chief equity officer at Riverfront Investment Group LLC, which manages about $5 billion, in Richmond, Virginia. “What the market wants is confidence that the economy is off of life support.”\nThat dose of reassurance arrived later in the week. The final reading on second-quarter gross domestic product came in higher than forecast, while the Fed chair said at a speech in Massachusetts on Sept. 24 that trouble overseas won’t harm growth in America. The comments sent a gauge of global equities higher for the first time since the rate decision.\nUp to that point, investors had been spooked by fresh signs that the slowdown in China -- where reading of manufacturing fell to the lowest level in six years -- was spreading. Bookings for U.S. capital equipment slid, a sign companies are waiting to see how demand in the U.S. is affected by the slowdown abroad. Shares of industrial companies in the S&P 500 tumbled 2 percent in the week, while producers of raw materials plunged 4 percent.\nCaterpillar led losses after the company reduced its sales forecast and cut jobs in response to weakening demand in the mining and energy industries. The world’s biggest maker construction machinery sank 9.6 percent in the period, the most since September 2011.\nNike provided a glimmer of hope for companies that target overseas markets. The world’s largest maker of athletic gear said worldwide futures orders surged in a sign of robust demand from Europe to China and Japan. The company’s stock surged 8.7 percent to an all-time high.\n“To some degree we got some light shed on economic activity at least in the consumer section from China with Nike’s earnings,” Marshall Front, the Chicago-based chief investment officer at Front Barnett Associates, said by phone. “Now we have one bit of anecdotal data that seems to contradict what has been a growing story line of a seriously weakening Chinese economy.”\nWith the S&P 500 ending down for a second straight week, one pattern of back-and-forth was eliminated: a string of 10 weeks of alternating gains and losses. Disparity in trading volume highlights the risk of more losses. Volume on days when the S&P 500 falls has been 27 percent heavier than the up days in September. That’s about eight times the average gap in the past decade.\nNow 9.4 percent below its May high of 2,130.82, the gauge has gone 90 days without setting a new high, the longest stretch since August 2012.", "external_links": [], "published": "2015-09-26T05:42:00.000+03:00", "crawled": "2015-09-26T01:01:29.465+03:00", "highlightTitle": ""}