{"organizations": [], "uuid": "f31a8d353c4217d6e12b681f2da4ff60e3e3c15a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03438/santander_3438678k.jpg", "site_section": "http://www.telegraph.co.uk/finance/", "section_title": "Finance - Business news and market updates - Telegraph - Telegraph", "url": "http://www.telegraph.co.uk/finance/personalfinance/bank-accounts/11862290/Santander-123-current-account-fees-rising-to-5-in-January.html", "country": "GB", "title": "Santander 123 current account fees rising to £5 in January", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Santander 123 current account fees rising to £5 in January - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T06:00:00.000+03:00", "replies_count": 1, "uuid": "22ba7cc2d9e0852eba2eb6559942e420c65f5c59"}, "author": "Dan Hyde , Consumer Affairs Editor", "url": "http://www.telegraph.co.uk/finance/personalfinance/bank-accounts/11862290/Santander-123-current-account-fees-rising-to-5-in-January.html#post-0", "ord_in_thread": 0, "title": "Santander 123 current account fees rising to £5 in January", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One of Britain's biggest banks is almost trebling the charges on its main current account, The Telegraph can disclose, as the regulator prepares to intervene on current account rip-offs. More than three million Santander customers will be charged £60 a year for everyday banking services from January, up from £24 today. Santander is also increasing the fees on its main credit card after EU laws reduced the profits banks could make from each transaction. The price rises are a blow to vast numbers of customers lured to Santander from its \"big four\" rivals – Lloyds, Barclays, HSBC and RBS. Many were taken in by the attractive perks on its \"123\" current account and credit card, and endorsements from experts such as television money guru Martin Lewis. Santander staff are being told the monthly fee on the current account will rise from £2 a month to £5 next year. Customers will receive the news later this week, it is understood. For many, the higher charge will negate the current account's benefits, which include 3 per cent interest and cashback on bills. It may remain attractive only to those with large savings pots. Fees for the credit card, which offers up to 3 per cent cashback on spending, will rise from £24 to £36 a year. The changes may prompt rival firms to act and come just weeks ahead of proposals to stop banks exploiting customers. Critics said the moves \"made a mockery\" of the Santander's advertising strapline: \"simple, personal, fair\". James Daley, founder of bank account analysts Fairer Finance, said: \"Santander had been one of the few to offer a genuine alternative to the traditional banks – and as well as a blow for the millions of customers who were lured in by its attractive offers, this will reduce competition in banking, which is already weak.\" Around 17 million people have banked with the same institution for at least two decades . The Competition and Markets Authority (CMA) watchdog will next month publish a two-year investigation into concerns that the big four banks, which control three-quarters of all current accounts, offer poor deals and service because they are not challenged . Many of those who are switching are choosing the Santander 123 account because it offers up to 3 per cent interest on balances between £3,000 and £20,000 and between 1 per cent and 3 per cent on household bills. Mr Lewis, founder of MoneySavingExpert.com, has advised savers to use the account instead of Isas, where interest rates have fallen to record lows. When the 123 account was created in 2012 the best easy access savings rates was 3.5 per cent; today it is 1.65 per cent. Higher charges on the country's most popular current account could allow other banks to introduce smaller fees. MPs and banking chiefs have already urged the CMA to bring an end to the practice of \"free\" in-credit banking. Andrew Tyrie, chairman of the Treasury committee, said free banking is a \"misnomer\" because \"no one actually knows how much they are getting charged and this helps stifle competition\". Accountants PricewaterhouseCoopers said free banking would disappear \"within a decade\" . The Santander 123 credit card pays between 1 per cent and 3 per cent cashback on spending in supermarkets, department stores and on travel. The bank makes money from customer fees and by charging retailers for each transaction. But from October, the maximum \"interchange\" rate charged to shops will be 0.3pc of the purchase price, down from 0.7pc on average today. Capital One has already scrapped the perks on its cards and Tesco is cutting its own in November. Santander will replace its £24 annual fee with a £3 a month charge, it is understood. dan.hyde@telegraph.co.uk Featured Current Accounts Bank Account Name Reward More details First Direct First Account £125 cashback when you switch Apply Santander 123 Account Up to 3% cashback on household bills Apply Halifax Reward Current Account Earn up to £160 in the first year Apply", "external_links": [], "published": "2015-09-14T06:00:00.000+03:00", "crawled": "2015-09-14T01:15:24.741+03:00", "highlightTitle": ""}