{"organizations": [], "uuid": "23b4a8a9d89bcde32f376bdaaeeb97c2e42ced19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150915092345-ric-fiano-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_pf.rss", "section_title": "Personal finance news - CNNMoney.com", "url": "http://money.cnn.com/2015/09/18/investing/savings-interest-rate-federal-reserve/index.html", "country": "US", "title": "Savers want more than 0% interest. Here's how 18,", "performance_score": 0, "site": "cnn.com", "participants_count": 12, "title_full": "Savers want more than 0% interest. Here's how - Sep. 18, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T18:43:00.000+03:00", "replies_count": 11, "uuid": "05f574368cf381804f5decc50ae9fc190737d3aa"}, "author": "Heather Long", "url": "http://money.cnn.com/2015/09/18/investing/savings-interest-rate-federal-reserve/index.html#post-0", "ord_in_thread": 0, "title": "Savers want more than 0% interest. Here's how 18,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How do 20% interest rates sound? Every time Dennis Johnson checks his bank account statement, he feels like he's been punched. Johnson followed the American Dream playbook: he worked hard and saved, but his money earns nothing in the bank.\n\"When you have a bank account with $10,000 to $15,000 and it gets 0% interest, it rubs you the wrong way,\" says Johnson, who is an accountant living in the Miami-Ft. Lauderdale area.\nAmerica's central bank -- the Federal Reserve -- has basically kept rates at 0% since the depths of the financial crisis in 2008. Hopes that the Fed would raise rates ever so slightly on Thursday were dashed again .\nRelated: The Fed did nothing. Now what?\nIt really upsets savers like Ric Fiano of Savannah, Georgia.\n\"I look at these banks recording record profits -- billions every quarter -- and they are so miserly they can't even pay 0.5% on a high yield account,\" says Fiano, 61, who runs a psychology practice.\nFiano and Johnson think it's time the Fed raised interest rates so people who save can earn some money too.\nThe average return on a savings account in the United States is a mere 0.1%, according to Bankrate.com. That's a big change from 2006 when savers could get up to a 5% return at the bank.\nRelated: What an interest rate increase means for real people\n\"I think that big business -- corporation and Wall Street -- are such a bunch of babies,\" says Fiano. \"Every time there's a hint [the Fed] will raise rates, the market goes crazy.\"\nRic Fiano and his wife.\nEven if the U.S. central bank raises rates later this year, people with money in checking or savings accounts may not be better off immediately.\nAmerica's biggest banks want to earn higher profits, says Greg McBride, chief financial analyst at Bankrate.com. They won't want to pass along higher savings rates to their customers right away.\n\"A rate hike by the Fed isn't going to be a gamer changer by any means for savers. It's still going to be a long, tough slog,\" says McBride.\nThe best bet for people who save like Johnson and Fiano is to shop around for better rates. They are out there.\nWhile some big banks offer a stingy 0.01%, there are online banks like Ally ( ALLY ) and Synchrony ( SYF ) that offer savings accounts with 0.85% interest or better.\nRelated: Meet Janet Yellen: The most powerful woman in the world\n\"This is the only free lunch you're going to find in the investing world where you get additional return without have to take additional risk,\" says McBride.\nThose banks offer competitive rates to lure customers because they don't spend that much money on advertising or maintain a bunch of branches. It's more cost effective for them to get customers by paying higher interest.\nTake advantage of it, advises McBride. Those banks that already offer higher interest are also the ones that are the most likely to give higher interest once the Fed finally takes action.\nThe only catch to watch out for is whether getting a higher rate requires a minimum balance such as $1,000 or $5,000 and how long the bank will lock up your money. What are known as \"CDs\" sometimes have lock up periods of several years.\nThe Fed has indicated that it would raise rates by the end of the year. So it wouldn't be wise to lock in a low rate for too long a time.\n\"There are 4-year CDs paying 1.3%. You're going to hold my money for four years and pay 1.3%? I'd rather sit on cash and wait for opportunities,\" says Fiano.\nYou'd have to agree to a certain timeframe -- just make sure it's not more than a year. So you can re-evaluate next year.\nRelated: Savers rejoice: You're about to earn more interest\nRelated: Americans are savers now. It's a problem for the economy\nRelated: Why the Fed should raise interest rates now\nCNNMoney (New York) September 18, 2015: 10:43 AM ET", "external_links": ["http://i2.cdn.turner.com/money/dam/assets/150915012345-ric-fiano-780x439.jpg", "http://i2.cdn.turner.com/money/dam/assets/150224164255-federal-reserve-1024x576.jpg"], "published": "2015-09-18T18:43:00.000+03:00", "crawled": "2015-09-19T01:08:21.531+03:00", "highlightTitle": ""}