{"organizations": [], "uuid": "89d1ab01e3d32e501002fc9ba8290173206b8a98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Saradha0028915.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/sebi-attaches-saradhas-property-to-recover-over-rs7743-crore/43498.html", "country": "IN", "title": "SEBI attaches Saradha's property to recover over Rs.774.3 crore", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "SEBI attaches Saradha's property to recover over Rs.774.3 crore - Moneylife", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T19:54:00.000+03:00", "replies_count": 0, "uuid": "89d1ab01e3d32e501002fc9ba8290173206b8a98"}, "author": "IANS", "url": "http://www.moneylife.in/article/sebi-attaches-saradhas-property-to-recover-over-rs7743-crore/43498.html", "ord_in_thread": 0, "title": "SEBI attaches Saradha's property to recover over Rs.774.3 crore", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Securities and Exchange Board of India (SEBI) has attached 134 properties of Kolkata-based Saradha Realty India Ltd. and its managing director Sudipta Sen to recover Rs.774.3 crore along with returns due to investors.   The market regulator, on its website, said notice to recover the amount was sent to the company and Sen but it went unanswered and the dues were not paid.   The properties which SEBI has attached mostly include land, buildings, flats and resorts under the immovable assets category while the notice also mentions seizure of movable properties as well to recover the dues.   \"It is also felt they (the defaulters) may dispose or transfer or alienate the assets with a view to obstruct or delay the recovery proceedings, which needs to be prevented immediately by attaching the said assets,\" the SEBI said in a notice on its website.   In June this year, the regulator had attached various bank and demat accounts of the two defaulters for recovery of the dues and investors' money besides others, but these have proved insufficient.   \"The funds available in the bank accounts and the securities available in the demat accounts of the defaulters are not sufficient for recovery of the dues,\" the notice said.   In April 2013, SEBI first passed an order against the company and Sen barring them from the market and asking them to refund the money to the investors. It also ordered the firm to shut down all its monetary schemes.   Most of the property to be attached is spread across widely in West Bengal with a flat in New Delhi.   Disclaimer:  Information, facts or opinions expressed in this news article are presented as sourced from IANS and do not reflect views of Moneylife and hence Moneylife is not responsible or liable for the same. As a source and news provider, IANS is responsible for accuracy, completeness, suitability and validity of any information in this article.", "external_links": [], "published": "2015-09-28T19:54:00.000+03:00", "crawled": "2015-09-28T14:37:28.980+03:00", "highlightTitle": ""}