{"organizations": [], "uuid": "00184a8fbd81a33453ff0a49817aa66c7debbac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/", "section_title": "Forbes - Personal Finance Information and Personal Finance News - Forbes.com", "url": "http://www.forbes.com/sites/navathwal/2015/09/25/the-top-five-fintech-marketplaces/", "country": "US", "title": "The Top Five Fintech Marketplaces", "performance_score": 4, "site": "forbes.com", "participants_count": 1, "title_full": "The Top Five Fintech Marketplaces", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:10:00.000+03:00", "replies_count": 0, "uuid": "00184a8fbd81a33453ff0a49817aa66c7debbac2"}, "author": "Nav Athwal", "url": "http://www.forbes.com/sites/navathwal/2015/09/25/the-top-five-fintech-marketplaces/", "ord_in_thread": 0, "title": "The Top Five Fintech Marketplaces", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The two-sided marketplace has created some of the fastest-growing startups of the last twenty years. Pioneers like eBay, Airbnb and Uber were all created to connect an underutilized supply with an unmet demand for a product or service using a technology platform. Historically, marketplaces are slow to hit critical mass but take off more steeply and reach milestones more quickly than traditional companies. Why? Marketplaces have unlimited scale and aren’t burdened by the same constraints of conventional transactional businesses like inventory supply and balance sheet. Marketplaces also naturally foster community and create network effects, which make them remarkably viable and defensible.Fintech marketplaces are some of the fastest growing businesses in Silicon Valley. The financial sector is a huge opportunity. It represents 7.2% of the U.S. GDP and unlike the established traditional players like banks and brokerages, marketplaces have the ability to be nimble and efficient. Lending, real estate, and investing have all remained under the control of wealthy individuals, large banks and the U.S. Government. But with changing regulations like the JOBS Act, which among other things enables my company, RealtyShares , to crowdfund real estate, fintech companies are able to streamline disjointed financial processes like never before. As such, fintech companies have emerged as some of the most scalable startups. These are the five most scalable marketplace platforms in fintech today:\nOpendoor : The real estate industry involves millions of transactions and a staggering number of players, from homebuyers and renters to sellers and landlords and everyone in between. Started by Silicon Valley legend, Keith Rabois, Opendoor is a platform that syncs all these parties and creates a much more convenient and streamlined marketplace for real estate transactions. Opendoor has succeeded in part because of marketplace network effects in the cities it operates in. It chose Phoenix as its initial test market and only expanded to new cities once that operation reached critical scale. As it eyes the Dallas and Portland market next, it seems that their home selling platform will soon own between 1-5% of the transactional volume in Phoenix. It has focused on building a community in the cities it operates in and rolls out new markets slowly. Rabois believes the business can be $50B+ simply by operating in the residential real estate sales market, which is $25 trillion+ in the U.S. Quite frankly, I don’t doubt it. They’re making the process of home selling streamlined and a little more pleasurable. t LendingClub : Marketplace lenders have made a huge splash in recent years by activating efficiencies in the rapidly growing financial sector. Marketplace lending in the U.S. has doubled every year since 2010. Peer-to-peer lender LendingClub boasts more $11 billion in personal loans funded since inception. Borrowers request personal loans and individuals and institutions can step in and fund them. If traditional banks can’t keep up with the prices and level of service, the more efficient marketplaces will have a chance to really shake up the existing players. After starting in 2006, LendingClub really hit its inflection point in 2011 where it went from less than $500M in loans originated to now over $11B. t Fundbox : Fundbox is a cash flow dream. Business owners and freelancers alike know that outstanding invoices, inventory buys and salaries can constrain their expansion plans by tying up cash. Fundbox advances payments to its users. “Factoring,” the industry that advances cash for accounts receivable, is a $3 trillion business. With backing from venture capital firms like General Catalyst and Spark Capital, there are some people “in the know” who think Fundbox is poised to disrupt this massive industry by providing liquidity to small businesses when they need it most. t CircleUp : Private equity firms like Silver Lake Partners and Tiger Global invested over $200B in private businesses in 2014. Until the JOBS Act, all of that money would be put to work in offline transactions. CircleUp is offering unprecedented liquidity to private consumer companies seeking equity funding. The CircleUp marketplace connects private consumer companies with high net worth individuals looking to diversify their wealth through angel investment. And with backing from reputable Venture Capital investors such as Google Ventures and Union Square Ventures, Circleup is poised to continue to disrupt the capital market for private consumer companies. t Robinhood : When stock trading was brought to the masses in the 1980s, an entire breed of company was born and a huge percentage of people began to participate in public equity buying and selling. However, not much has changed since companies like Scottrade and Etrade took the throne. NEA and Index Ventures-backed, Robinhood is putting the power back in consumers’ hands by offering commission-free trades. By bypassing brick-and-mortar costs and other expenses (and by monetizing through interest earned on their cash holdings) Robinhood is making the $17 trillion stock market even more accessible. While it’s not a marketplace in the conventional sense, Robinhood is transformative in that it brings consumers and equities together on a frictionless and to date, cost free platform. Fintech marketplace companies are crafting an archetype for enduring success by overthrowing stale industries with huge scale. Where the ceiling is for some of these companies, only time will tell, but it’s a safe bet that technology and marketplace dynamics will continue to cut deep into huge industries and established players.", "external_links": [], "published": "2015-09-26T03:10:00.000+03:00", "crawled": "2015-09-26T00:23:09.176+03:00", "highlightTitle": ""}