{"organizations": ["Cracks Awareness of Income Driven Student Loan Repayment Falls Through"], "uuid": "699cbb3d060493ab70820fba7427e98101b08db0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/source-newspapers/rss/627", "section_title": "Source Newspapers : Personal Finance", "url": "http://business-news.thestreet.com/source-newspapers/story/awareness-of-income-driven-student-loan-repayment-falls-through-the-cracks/13299498", "country": "US", "title": "Awareness of Income Driven Student Loan Repayment Falls Through the Cracks", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Awareness of Income Driven Student Loan Repayment Falls Through the Cracks", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T13:32:00.000+03:00", "replies_count": 0, "uuid": "699cbb3d060493ab70820fba7427e98101b08db0"}, "author": "", "url": "http://business-news.thestreet.com/source-newspapers/story/awareness-of-income-driven-student-loan-repayment-falls-through-the-cracks/13299498", "ord_in_thread": 0, "title": "Awareness of Income Driven Student Loan Repayment Falls Through the Cracks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Sandman"], "text": "Awareness of Income Driven Student Loan Repayment Falls Through the Cracks Written by: John Sandman 09/24/15 - 6:32 AM EDT \nNEW YORK ( MainStreet ) — In December the Department of Education (ED) released plans to re-do the way federal student loans are serviced, including a new system for receiving complaints . In March, President Obama directed ED to build a web-based portal for student loan borrowers to manage payments and lodge complaints against servicers as part of his Student Aid Bill of Rights. \nBut these initiatives didn't adequately address problems of borrowers who are in the dark about their options once they find that they can't afford to pay back their loans. People are usually left to their own devices when it comes to understanding repayment solutions. Are Airfares Getting Cheaper? The Deals Are For Reasons You Didn't Expect \nAs recently as last month, ED claimed there was progress on this front. \"We won't stop fighting to help people who are struggling to pay back their student loan debt,\" Department of Education Secretary Arne Duncan said in an August 20 statement. \"But the fact that more borrowers are taking advantage of the opportunity to cap their monthly payments is a good sign.\" \n\"We should be expanding efforts to help borrowers who are struggling under the crushing burden of student debut,\" said Senator Patty Murray (D-Wash.), ranking Democrat on the Senate Health, Education, Labor and Pension committee in a statement following the report's release last week. \nBut the key problem is that not enough people are in the programs. The GAO report found that as of 2012, 51% of borrowers were eligible for income-driven repayment plans, but only one-fifth had signed up. The GAO's study drew on both tax data from the Treasury Department and ED's student loan data. 1", "external_links": [], "published": "2015-09-24T13:32:00.000+03:00", "crawled": "2015-09-24T16:21:34.097+03:00", "highlightTitle": ""}