{"organizations": [], "uuid": "92ccff68873f92a596a092049a0ccbbe27c06580", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-10/china-trainmaker-crrc-plans-to-double-overseas-sales-in-5-years", "country": "US", "title": "China Trainmaker CRRC Plans to Double Overseas Sales in 5 Years", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "China Trainmaker CRRC Plans to Double Overseas Sales in 5 Years - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T06:32:00.000+03:00", "replies_count": 0, "uuid": "92ccff68873f92a596a092049a0ccbbe27c06580"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-09-10/china-trainmaker-crrc-plans-to-double-overseas-sales-in-5-years", "ord_in_thread": 0, "title": "China Trainmaker CRRC Plans to Double Overseas Sales in 5 Years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New York’s aging subway system is an irresistible draw for Yu Weiping, vice president of CRRC Corp., China’s biggest maker of railway equipment, who says he rides it every time he visits.\n“I can’t help thinking about when we can replace all these noisy old subway trains,” Yu said in an interview in New York on Thursday. “After leading the world for 100 years, U.S. subway and train systems need upgrading.”\nCRRC plans to double overseas contracted sales to as much as $15 billion in the next five years, Yu said. He last week attended the ground-breaking ceremony for the company’s planned 150,000-square-foot (13,940-square-meter) plant in Springfield, Mass., that will assemble new cars for Boston’s subway.\nCSR Corp. and China CNR Corp., the nation’s two state-owned trainmakers, combined in May to form CRRC, which competes with Germany’s Siemens AG and France’s Alstom SA for rail contracts worldwide. China’s government in March identified rail as one of 10 focus industries in a blueprint to transform China into an advanced industrialized economy, and has used rail companies to project political influence abroad in addition to winning major orders.\nFast Track China had built more than 17,000 kilometers (10,563 miles) of high speed railway networks by July, according to the official Xinhua News Agency.\nIt also has been targeting emerging markets in Africa, Latin America and Southeast Asia -- often with sales pitches from Premier Li Keqiang-- as it seeks to project influence in developing economies.\nPredominantly focused on the local market, Beijing-based CRRC is beginning to expand overseas. The company generated 88 percent of sales domestically in the first half of the year, according to a statement last month. Its revenue from mainland China increased 0.9 percent, as sales in overseas markets jumped 61 percent.\nYu said he spends two-thirds of his time annually abroad looking for deals, as CRRC seeks to go global, and said the Springfield plant is a showcase for the company’s U.S. expansion. The trainmaker is in touch with additional U.S. cities with subway-building plans, Yu said, declining to elaborate.\n“We believe there is certainly demand for high-speed rail and subways in the U.S.,” Yu said. “As long as they need us, we’ll help build and deliver. This is a huge market.”\nBoston Order The $567 million Boston deal that CNR won before the merger last year was China’s first major rail contract in North America, and was 50 percent cheaper than Bombardier Inc.’s bid.\nCRRC last month reported a profit of 4.7 billion yuan ($737 million) for the six months ended June, its first financial report since the merger. Revenue was 93.2 billion yuan.\nThe company’s shares closed at HK$9.67 in Hong Kong on Thursday, lower than the HK$15 when it began trading in June. That gave the company a market value of HK$407 billion ($53 billion).\nThe U.S. market for high-speed rail seemed primed to grow in 2009 when President Barack Obama unveiled a plan to build 10 high-speed rail corridors financed with stimulus funds. Work slowed when Republicans took control of Congress and blocked further federal financing.\nYu said he’s nonetheless optimistic about the company’s U.S. expansion plans.\n“Each time I hear those noises when taking subway rides in New York, I feel very confident,” Yu said. “I wish we could share our good products with the Americans.”", "external_links": [], "published": "2015-09-11T06:32:00.000+03:00", "crawled": "2015-09-11T02:38:42.898+03:00", "highlightTitle": ""}