{"organizations": [], "uuid": "751d025f69d3286dcd2c3739cbc45113cb56c7ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/news/2015/09/14/egyptian-forces-kill-tourists-after-mistaking-them-for-isis/4483422366001-videoStillImage.jpg", "site_section": "http://www.thestar.com/business/personal_finance.html", "section_title": "Personal Finance | Business | Toronto Star", "url": "http://www.thestar.com/news/world/2015/09/14/egyptian-forces-mistaken-fires-on-mexican-tourist-group-killing-12-people.html", "country": "CA", "title": "Egyptian forces mistakenly fires on Mexican tourist group, killing 12 people", "performance_score": 0, "site": "thestar.com", "participants_count": 0, "title_full": "Egyptian forces mistakenly fires on Mexican tourist group, killing 12 people | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "751d025f69d3286dcd2c3739cbc45113cb56c7ca"}, "author": "", "url": "http://www.thestar.com/news/world/2015/09/14/egyptian-forces-mistaken-fires-on-mexican-tourist-group-killing-12-people.html", "ord_in_thread": 0, "title": "Egyptian forces mistakenly fires on Mexican tourist group, killing 12 people", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos View photos zoom\nCAIRO—At least 12 people were killed and 10 injured in Egypt ’s southwestern desert Sunday when security forces mistakenly fired on a group of Mexican tourists, Egyptian officials said.\nThe Mexican Foreign Ministry confirmed the incident and said at least two of the dead were Mexican nationals. It said in a statement that the victims were still being identified, and Foreign Ministry personnel were working with the families of the victims.\nMexican President Enrique Pena Nieto posted a statement on his Twitter feed Monday morning saying his government “condemns these acts against our citizens” and demanding a thorough investigation.\nA joint military-police force was pursuing “terrorist elements” in the area and fired on four cars that turned out to be carrying tourists, according to Egypt’s Interior Ministry. The ministry said the victims were Egyptian and Mexican.\nEgyptian officials say the safari convoy had wandered into a restricted area of the western desert. The tour company involved “did not have permits and did not inform authorities,” Rasha Azazi, a spokesperson for the Egyptian Ministry of Tourism, told The Associated Press, adding that any trips to that area are required to be cleared by officials.\n“They were not supposed to be there,” she said, but could not provide further information on the circumstances of the shooting.\nMexican Foreign Minister Claudia Ruiz Massieu was in contact with Egypt’s ambassador to Mexico and also demanded an investigation and explanation of what happened, the Mexican statement said. She also demanded the support of Egyptian authorities for Mexican nationals being transported to Cairo.\nJorge Alvarez Fuentes, Mexico’s ambassador to Egypt, and consular representatives visited the wounded at the Dar el-Fouad Hospital in suburban Cairo, and Fuentes had interviewed five survivors, the Foreign Ministry statement said. It did not provide details on the survivors’ accounts of the incident.\nEgypt’s western desert is popular among safari enthusiasts, but has not been known as a hotbed of militant or insurgent activity. Police and military there have primarily been concerned with combatting smuggling along Egypt’s large and porous border with Libya.\nCairo has been battling an Islamic insurgency on its eastern flank in the Sinai peninsula for years; attacks targeting army and police in Sinai escalated and spread to the mainland after the July 2013 military ouster of Islamist President Mohammed Morsi.\nMore on thestar.com\nJapan volcano eruption caught on camera\nWhat will Kim Davis do? Anti-gay Kentucky clerk returning to work", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-14T14:44:43.596+03:00", "highlightTitle": ""}