{"organizations": [], "uuid": "e6522ea96c9959930c27a4cfe2bc12267625a1c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/h/w/4/j/image.related.afrArticleLead.620x365.gji69p.png/1441794687927.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/street-talk/amp-gearing-up-for-hybrid-issue-20150908-gji69p", "country": "AU", "title": "AMP gearing up for hybrid issue", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "AMP gearing up for hybrid issue | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T22:15:00.000+03:00", "replies_count": 0, "uuid": "e6522ea96c9959930c27a4cfe2bc12267625a1c7"}, "author": "afr.com", "url": "http://www.afr.com/street-talk/amp-gearing-up-for-hybrid-issue-20150908-gji69p", "ord_in_thread": 0, "title": "AMP gearing up for hybrid issue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AMP is gearing up to launch an ASX-listed hybrid. by Sarah Thompson Anthony Macdonald Jake Mitchell AMP Limited is understood to be preparing to launch a Tier I hybrid issue as soon as next week.\nIt's understood the advisers working on the hybrid issue, which was revealed by Street Talk , include UBS, ANZ, NAB and Morgans. AMP plans to launch the raising had been hit by market volatility.\nThat will add to the $30 billion of initial public offerings, major bank equity raisings and hybrids sold to investors this year on the stock market this year.\nAMP has already raised Tier I capital this year via a $275 million wholesale issue.\nThe hybrid is expected to be priced around 500 basis points over the bank rate.\nThat would reflect weakness in the ASX listed notes market which has seen decent falls in major bank hybrids. Westpac's $1.25 billion Capital Notes issue, which pays 400 basis points over the bank rate, commenced trading, but the 2.5 per cent price decline, means new buyers can achieve a margin of about 450 basis points.\nSo far in 2015 there has been almost $5 billion of new hybrids issued on the ASX while $13.5 billion of major bank capital has been raised and almost $12 billion in public offerings according to Bell Potter. That might explain at least some of the weakness.\nMeanwhile, Santos is understood to be dusting off its hybrid playbook with a possible return to the European capital markets.\n It's understood a hybrid issue is one of the many options the company is looking at to pay down debt and would likely be launched in conjunction with asset sales.\nSantos pulled a European hybrid back issue in December as it fretted about a falling oil price.\nA European hybrid won't come cheap but margins have declined from a peak of 700 basis points over the risk free rate, in late August to a more palatable 550 basis points as markets settle down.", "external_links": [], "published": "2015-09-09T22:15:00.000+03:00", "crawled": "2015-09-09T19:06:17.354+03:00", "highlightTitle": ""}