{"organizations": [], "uuid": "7021e1d9fb3b30ead7c1fc929fa029831b4285d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/brianportnoy/2015/09/19/why-volatility-can-prompt-bad-investing/", "country": "US", "title": "Why Volatility Leads To Poor Decisions", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "Why Volatility Leads To Poor Decisions", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T03:08:00.000+03:00", "replies_count": 0, "uuid": "7021e1d9fb3b30ead7c1fc929fa029831b4285d0"}, "author": "Brian Portnoy", "url": "http://www.forbes.com/sites/brianportnoy/2015/09/19/why-volatility-can-prompt-bad-investing/", "ord_in_thread": 0, "title": "Why Volatility Leads To Poor Decisions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hello, volatility. It’s been a while.As stock market investors, we should appreciate that we’ve had it relatively easy for years. It’s hard to understate how smoothly the equity markets have climbed since things settled down after the 2007-09 crisis. Since then, returns have been way above average while volatility has been way below average.Profiting from a risky asset always involves a cost – a “price of admission.” That price is not only the uncertainty of whether the asset’s expected returns will be reached in the time frame relevant to us, but also the ride along the way. Contrary to the conventional wisdom of legends like Warren Buffett , Howard Marks , and Gene Fama, volatility is indeed a form of risk because lots of volatility often compels us to make bad decisions. (I’ll offer a full rant on that topic in a subsequent blog.)Volatility’s return is a source of discomfort for all of us as it forces us to pay more attention to near-term market moves, which is mentally tiresome. And it tempts us to make more near-term decisions than we’ve been used to. It’s hard to resist counterpunching. In the moment, a rope-a-dope strategy means you’re getting pummeled.[caption id=\"attachment_242\" align=\"\" width=\"1940\"] (Spencer Platt/Getty Images)[/caption]Some basic tenets of behavioral finance can prove insightful at times like these. The goal is not to change your mental make-up – that’s impossible – but to appreciate that our hardwiring leads to some quirky behavior. Self-awareness can help us hedge bad decisions.It’s the disposition effect that is top of mind for me now as I speak with financial advisors about how they’ve begun to brace themselves and clients’ expectations for choppier times. This effect states that you are wired to invest differently depending on whether you’re winning or losing .We tend be to risk averse when we are sitting on gains and risk seeking when we are sitting on losses.But why? The godfathers of behavioral finance, Amos Tversky and Daniel Kahneman, wrote in a 1979 seminal paper : “Our perceptual apparatus is attuned to the evaluation of changes or differences rather than to the evaluation of absolute magnitudes.”To interpret the academics: It’s the journey that counts, not the destination. Life (and our portfolios) happens incrementally. So you measure progress based on where you now sit relative to your starting reference point.Zero, it turns out, is a powerful reference point. When you’re ahead – great. But then we tend to sell winners quickly because we crave the psychic gratification of being right and the financial joy of booking a real gain. This is sometimes the wrong move, especially as stocks with positive momentum tend to keep going up.On the other side of zero, we tend to feel the pain of losing far more than the joy of winning; this is the powerful notion of “loss aversion.” Thus, we’ll go further out of our way to avoid realizing a loss by holding on to a position in the red. Selling a loser? Boy, can that sting.Realizing a loss renders us “officially” wrong. For advisors, that can prove to be a painful conversation with clients. Overall, advisor and client alike are often desperate to get back to scratch, even when it doesn’t matter much to the bottom line (“absolute magnitudes” to the academics). Sometimes, we’ll even “double down” – add more to a losing position – in the hopes of recovering from losses even more quickly. We look like a hero when we get off the ropes and land a haymaker.With a more-heightened alert to choppier markets and the hard-to-shake feeling that we must “do something” during such times, please be cognizant of this disposition effect. It says nothing about the underlying value or risk in any of your investments. From a purely analytic point of view, there can be both good reasons to sell a loser (e.g., you were in fact wrong on the thesis) or to hold a loser (e.g., the value’s still there, perhaps even more so now).But it does speak volumes when emotions trump analysis. Doubling-down, or any other number of trading strategies, might feel like the right thing to do in the moment. At those times, take a breath and ask whether you are solving for a short-term emotional need or a long-term financial problem.The answer to that question will likely put you in good stead.", "external_links": ["http://www.princeton.edu/~kahneman/docs/Publications/prospect_theory.pdf"], "published": "2015-09-20T03:08:00.000+03:00", "crawled": "2015-09-21T19:27:02.701+03:00", "highlightTitle": ""}