{"organizations": [], "uuid": "0b626160b135bead3868a0284cd0379a87b952aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.investors.com", "main_image": "http://www.investors.com/image/Biz05-VLKAY-0922-newscom.jpg.cms", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://news.investors.com/092115-771992-volkswagen-looking-at-many-consumer-lawsuits.htm?ven=yahoocp&src=aurlled&ven=yahoo", "country": "GB", "title": "VW Dives As Scandal Threatens U.S. Sales, Diesel Strategy VLKAY TM - Investors.com", "performance_score": 0, "site": "investors.com", "participants_count": 1, "title_full": "VW Dives As Scandal Threatens U.S. Sales, Diesel Strategy VLKAY TM - Investors.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "0b626160b135bead3868a0284cd0379a87b952aa"}, "author": "yahoo", "url": "http://news.investors.com/092115-771992-volkswagen-looking-at-many-consumer-lawsuits.htm?ven=yahoocp&src=aurlled&ven=yahoo", "ord_in_thread": 0, "title": "VW Dives As Scandal Threatens U.S. Sales, Diesel Strategy VLKAY TM - Investors.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "V olkswagen (OTCPK: VLKAY ) stock plunged to a three-year low after the German auto giant's admission that it rigged emissions tests jeopardizes its sales push in the U.S. as well as its ability to meet fuel-economy standards. \nThe German automaker has told U.S. dealers to stop selling some of its 2015 model diesel cars, which account for about a fourth of its U.S. sales and underpin its strategy to comply with toughening U.S. fuel regulations. \nOn Monday, the Environmental Protection Agency and California officials said that they would test the software in other manufacturers' diesel vehicles in search of similar violations. Also Monday, the German government said that it will perform its own investigation.   View Enlarged Image \n\nOn Sunday, VW CEO Martin Winterkorn ordered an internal probe and said that he was \"deeply sorry\" for breaking U.S. rules. \nThe company's U.S.-listed shares plummeted 17.2% to 30.07 on the stock market today after falling 4.5% Friday. General Motors (NYSE: GM ) and and Ford (NYSE: F ) edged up 0.4%. \nThe EPA said Friday that Volkswagen deceived regulators by using a type of software in several diesel cars to get around emissions rules. \nThe software uses a \"defeat device\" that is programmed to detect when a car is undergoing emissions testing. The device turns on full emission controls only during tests and not under normal driving conditions, resulting in cars that spew out pollution at levels of 40 times the acceptable standard. \nThe EPA said that the affected cars were four-cylinder Volkswagen and Audi diesel cars from the model years 2009 to 2015. The EPA will require Volkswagen to recall 500,000 vehicles as a result. \nThe affected models are the Jetta (2009-15), Beetle (2009-15), Golf (2009-15), Passat (2012-15) and Audi A3 (2009-15). \nThe news comes as Volkswagen was moving ahead with expanding its presence in the U.S. Earlier this year, Volkswagen announced plans to add 100 dealerships in the U.S. by 2018. It also has planned for expansion and a tech center in Tennessee. \nThe scandal could complicate matters for Winterkorn, who recently won a boardroom battle when chairman Ferdinand Piech's efforts to oust him failed. Piech exited Volkswagen in April. \nVW overtook Toyota Motor (NYSE: TM ) as the world's biggest automaker earlier this year, but it is facing adverse consequences from the economic slowdown in China. \nMeanwhile, VW also faces the prospects of government penalties and myriad lawsuits. If the EPA assesses the maximum penalty of $37,500 per vehicle, the German automaker would have to pay federal fines totaling $18 billion. \nBut VW will also likely face lawsuits filed by consumers alleging that they were deceived into buying VW's so-called \"clean diesel\" cars and that the resale value of their vehicles has been diminished. \nFollow Ciaran McEvoy on Twitter @IBD_CMcEvoy and on Facebook .", "external_links": [], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T23:51:41.384+03:00", "highlightTitle": ""}