{"organizations": ["Reserve Bank of India"], "uuid": "0e9b25902653546ce3d92b9c084583aeb5b2d33d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-08/20/full/1440060698-5683.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/rbi-allows-banks-to-provide-partial-credit-enhancement-to-corporate-bonds-115092400974_1.html", "country": "IN", "title": "RBI allows banks to provide partial credit enhancement to corporate bonds", "performance_score": 0, "site": "business-standard.com", "participants_count": 0, "title_full": "RBI allows banks to provide partial credit enhancement to corporate bonds", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T16:34:00.000+03:00", "replies_count": 0, "uuid": "0e9b25902653546ce3d92b9c084583aeb5b2d33d"}, "author": "", "url": "http://www.business-standard.com/article/finance/rbi-allows-banks-to-provide-partial-credit-enhancement-to-corporate-bonds-115092400974_1.html", "ord_in_thread": 0, "title": "RBI allows banks to provide partial credit enhancement to corporate bonds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RBI allows banks to provide partial credit enhancement to corporate bonds Will enable corporates to access the funds from the bond market on better terms The Reserve Bank of India (RBI) has allowed banks to provide partial credit enhancement (PCE) to bonds issued by corporates and special purpose vehicles (SPV) for funding all types of projects subject to certain riders \nThe Reserve Bank of India (RBI) has allowed banks to provide partial credit enhancement (PCE) to bonds issued by corporates and special purpose vehicles (SPV) for funding all types of projects subject to certain riders. \n\"Banks will be allowed to offer PCE only in the form of a non-funded irrevocable contingent line of credit. A view on allowing the PCE as a funded loan facility will be taken in due course after reviewing the implementation and performance of the contingent PCE offered by banks,\" said RBI. \nAccording to RBI the objective behind allowing banks to extend PCE is to enhance the credit rating of the bonds issued so as to enable corporates to access the funds from the bond market on better terms. \nAs per the riders the aggregate PCE provided by all banks for a given bond issue shall be limited to 20 per cent of the bond issue size. The PCE facility shall be provided at the time of the bond issue and will be irrevocable. The central bank also said that banks may offer PCE only in respect of bonds whose pre-enhanced rating is BBB minus or better. Besides that banks cannot provide PCE by way of guarantee. ALSO READ: RBI eases overseas borrowing rules for domestic companies \nRBI said that banks providing PCE to bonds issued by a corporate or SPV will not be eligible to invest in those bonds. They can, however, provide other need based credit facilities whether funded and/or non-funded to the corporate or SPV. RBI has also urged banks to have a board approved policy on PCE, covering issues such as quantum of PCE, underwriting standards, assessment of risk, pricing, setting limits, etc. \nIn case the PCE facility is partly drawn and interest accrues on the same, the unpaid accrued interest will be excluded from the calculation of the remaining amount available for drawing, said RBI. As per the norms, in the event of the project failure or bankruptcy, in terms of repayment priority, the PCE must rank below the claims of the enhanced bond holders. \nThe norms said that PCE facilities to the extent drawn should be treated as an advance in the balance sheet. Undrawn facilities would be an off-balance sheet item and reported under contingent liability - others, said the regulator. Latest News", "external_links": [], "published": "2015-09-24T16:34:00.000+03:00", "crawled": "2015-09-24T18:04:33.437+03:00", "highlightTitle": ""}