{"organizations": [], "uuid": "0cdef889757b0d0f324137200a093f755664d78d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-reuters/?format=rss", "section_title": "Finance News | Reuters - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/gold-holds-near-2-1-010452140.html", "country": "GB", "title": "Gold edges up after 4-day losing streak as dollar retreats", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Gold edges up after 4-day losing streak as dollar retreats", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T14:16:00.000+03:00", "replies_count": 0, "uuid": "0cdef889757b0d0f324137200a093f755664d78d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/gold-holds-near-2-1-010452140.html", "ord_in_thread": 0, "title": "Gold edges up after 4-day losing streak as dollar retreats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An employee shows gold bangles to a customer at a jewellery showroom on the occasion of Dhanteras, a … \nBy Jan Harvey \nLONDON (Reuters) - Gold firmed on Tuesday as a retreat in the dollar helped the metal snap a four-day losing streak, but remained close to 2-1/2 week lows as uncertainty over a looming U.S interest rate hike persisted. \nSpot gold was up 0.2 percent at $1,121.20 an ounce at 0924 GMT, while U.S. gold futures for December delivery were down $1.10 an ounce at $1,120.30. \nSpot prices hit their lowest since mid-August at $1,116.20 an ounce last week as hotly anticipated U.S. payrolls data gave little direction on the timing of the Federal Reserve's first interest rate hike in nearly a decade. \nExpectations for rising rates, which would lift the opportunity cost of holding non-yielding bullion while boosting the dollar, have knocked the metal 5 percent lower this year and remain gold's biggest driver, analysts said. \nTrade is expected to be rangebound ahead of the Fed's next policy meeting on Sept. 16 and 17. \n\"The markets are split on whether they believe the Fed will hike rates or not, so investors are staying on the sidelines and waiting for price direction,\" Capital Economics analyst Simona Gambarini said. \"That will occur when the Fed decides on the 17th whether it is hiking rates or not.\" \n\"We as a research house are 50:50 on whether it will do so. We were expecting a rate hike in September, but after the latest numbers, we're not as sure as before.\" \nShares rose in Europe and Asia while the dollar lost ground against the euro after trade data from China and Germany highlighted the divergent outlooks of the two heavyweight economies. [MKTS/GLOB] \nGold has failed to find a strong safe-haven bid despite the recent weakness in stocks due to worries over the Chinese economy, showing that the metal is struggling to find direction outside U.S. monetary policy. \nSilver was up 0.7 percent at $14.67 an ounce, while platinum was up 1.3 percent at $996 an ounce and palladium was up 1.7 percent at $585 an ounce. \nThe platinum market deficit shrank in the second quarter, data from the World Platinum Investment Council showed on Tuesday, as rising mine supply and autocatalyst and jewellery recycling outstripped a much smaller increase in demand. \n\"Whilst the estimate for the deficit for full-year 2015 was increased, we note that the price of the metal remains weak, and the weakening (South African rand) is providing producers with relief,\" Investec said in a note. \"We do not see a material recovery in the metal until the industry is able to fundamentally restructure.\" \n(Additional reporting by A. Ananthalakshmi in Singapore; editing by Susan Thomas)", "external_links": [], "published": "2015-09-08T14:16:00.000+03:00", "crawled": "2015-09-08T14:40:43.173+03:00", "highlightTitle": ""}