{"organizations": [], "uuid": "bb2ce388c41ecabb6aab93545c53772ad8d0b431", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509212561.html", "country": "US", "title": "South Africa: SA Could Build Nuclear Without State Funding", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: SA Could Build Nuclear Without State Funding", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T16:17:00.000+03:00", "replies_count": 0, "uuid": "bb2ce388c41ecabb6aab93545c53772ad8d0b431"}, "author": "", "url": "http://allafrica.com/stories/201509212561.html", "ord_in_thread": 0, "title": "South Africa: SA Could Build Nuclear Without State Funding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Africa: Continent's Earliest Known Coelacanth Found By Matthew Le Cordeur \nSouth Africa could look to places like Finland and Turkey when trying to figure out a way to fund its high-cost nuclear build programme. \nNational Treasury is currently exploring funding options for the Department of Energy, which is seeking the procurement of 9 600 MW worth of nuclear energy by March 2016. It could decide to ask the winning bidder to initially own the power plants and sell electricity at a fixed price to Eskom. \nOne of the bidders is Russia's state-owned nuclear corporation Rosatom, which has signed an inter-governmental agreement with South Africa. It has used the \"build and own\" model in Turkey, where it has a 15-year contract to sell electricity at 12.35 US cents (R1.65) per kwh. \nA Rosatom subsidiary has a 97% stake in the Akkuyu Nuclear Power Plant, which has four VVER 1 200 MW reactors. Up to 49% of those shares may be sold to other investors quite soon. \nVVER is the Russian abbreviation of water-water energetic reactor (or pressurised water reactor) and matches the technology that South Africa is interested in procuring. Eight of these reactors would meet that demand. \nIt was at this power station that a Turkish senior manager resigned in September, saying that Rosatom was unprofessional. \"They [the state] should give up this project which is amateur, novice and full of technical faults,\" Faruk Uzel told local media. Rosatom said he was a disgruntled employee who had been accused of sexual harassment and embezzlement. \nPartnering with investors \nAnother funding model could be similar to the one where Rosatom has a 38% share capital in the Hanhikivi Nuclear Power Plant in Finland. Here, it is building a small power station to contain just one of its VVER 1 200 MW reactors. \nDuring a Rosatom-sponsored media trip last week, a Russian source told Fin24 that it would construct the nuclear power plant at a fixed cost and it would be responsible for the risk if it does not meet the budget requirements. \nThe other 62% shareholders include industrial businesses (as well as other investors) that can use the electricity for their own means, as well as being able to sell electricity into the European or Finnish grid. \n\"Each shareholder will receive electricity on costs without any profit, without any margins - after that the shareholder can use electricity for its own means or resell it on the open European market,\" a Russian source explained. \nLike in Finland, Rosatom would be happy to only build one reactor in SA should it downsize the procurement requirement, which many critics believe would lessen the risk in a world where renewables are becoming ever cheaper and efficient. \"One reactor would just be a lot more expensive to build,\" a source said. \nThe rumbling rouble: a gift or a curse? \nOther options to fund the massive nuclear build programme, which could cost the country over R1trn, include South Africa financing it independently or taking advantage of Russia's state export credit. This latter option could be especially interesting, considering the weakening of the Russian currency. \nIf South Africa chooses to use Rosatom as its main supplier, almost 100% of the cost could be funded in the rouble, the source said. \nThe unit has lost 50% of its value since the start of 2014 due to a combination of tumbling oil prices, sanctions over the conflict in Ukraine and risks related to the US Federal Reserve and a slowdown in China, Russia's biggest trading partner, according to Bloomberg. On Monday at 09:30, one rouble was trading at R0.20, compared to $1 costing South Africa R13.33. \nIt is not necessary for Rosatom to supply all aspects of the nuclear power plant and it would work with its customer to meet its requirement, a source said. \nRosatom is currently supplying two VVER 1 000 MW nuclear reactors for Tianwan unit 3 and 4 in China, but local suppliers there are building the turbines and electricity components. \n\"Sometimes from a commercial point of view it is better to take equipment from a non-Russian supplier than to take Russian equipment,\" the source said. \nLocalisation key for Rosatom \nIn terms of localising the construction to enable more jobs for South Africa, the source said Rosatom would ensure up to 30% localisation for the first four units and up to 60% localisation for the last four units, all of which are expected to be built between 2023 and 2030. The source said each unit would take six years to build. \n\"The SA government wants a high level of localisation and we are ready to execute this request and deliver a high level of participation of SA companies on our project,\" the source said. \nSouth Africa has gained valuable experience from its new build programme - in which Medupi and Kusile ran excessively over budget and time. While the failure has hit the country's electricity stability, the lessons learnt could help local companies achieve better results working on the nuclear power plants. \n\"From a managing point of view, to construct nuclear and coal is not very different,\" a Russian source explained. \nTo get more localisation, South African companies making valves and pumps for gas and oil purposes could invest to cater for the nuclear build programme. \nBut local businesses are not interested in participating in the delivery of high technology and equipment, unless they can get a big order and a guarantee, a Russian source said. \n\"If you want to see an increase in the local programme, it's better to give a maximum order in one place,\" the source said. \"The costs for local business would be lower and have a big guaranteed order.\" \nEnergy policy expert Professor Steve Thomas told Fin24 recently there have been hints that South Africa would be able to set up manufacturing facilities for components both for its home market and for exports, a prospect that has been held out to a number of its potential customers, such as India. \nHandling labour unrest \nA lengthy strike at Medupi is one of the reasons why its delivery has been delayed by five years. Rosatom says it is very aware of South Africa's labour unrest issues, but believes it has the right management tools to offset this. \n\"Rosatom understands the situation and is trying to be compliant with requests from the customer to increase the level of participation of local workers,\" a source said. \nAny labour-related delays would not affect Rosatom, which would simply rotate its resources elsewhere to handle its massive backlog of orders, the Russian source said. \nShould a critical delay due to labour unrest occur, the Russians could draw from their own experienced labour force around the world, but this would only be offered as a worst-case scenario. \nThe Russian company has 360 enterprises with over 262 000 people and is currently building nine nuclear power plants in Russia and 29 around the world. \nWhile it remains optimistic on its ability to deliver, critics such as Thomas and Vladimir Slivyak have expressed concern that Rosatom would fail to deliver on its promise. \n\"Russia is experiencing one of the biggest economic troubles in history and cutting down nuclear and other development programmes at home,\" Slivyak told Fin24 recently. \n\"After a period of about 10 years when it averaged one order per year, it is hard to see how Rosatom could manufacture the equipment for five or more reactors per year,\" said Thomas. \nWhy sub-Saharan Africa needs baseload nuclear energy \nAccording to Rosatom regional vice-president of sub-Saharan Africa Viktor Polikarpov, the region is expected to grow at 4.5% in 2015 and in excess of 5% in 2016, driving urbanisation and increasing long-term energy demands. \n\"In order to maintain let alone increase this economic growth potential, it is clear that the region needs to increase its power generation capacity tenfold,\" he said at the Powering Africa conference in Accra last week. \n\"It is projected that sub-Saharan Africa will consume nearly 1 600 terawatt hours by 2040, four times what was used in 2010, this if it is to achieve electrification levels of around 70% to 80%. By 2040, sub-Saharan Africa will consume as much electricity as India and Latin America did combined in 2010,\" said Polikarpov. \nA balanced energy mix is of great importance in any region as one technology alone can't provide the complete solution, he explained. \nRenewables most definitely have their place in the region's energy mix but are unfortunately not able to provide baseload power, said Polikarpov. \n\"Baseload power is often referred to as the essential minimum amount of power needed by the grid to effectively run society. Baseload is required 24 hours a day, 365 days a year to run heavy industry. Disruptions in these operations cause major delays, damage equipment, put lives at risk and ultimately cost economies billions,\" said Polikarpov. \nSource: Fin24", "external_links": [], "published": "2015-09-21T16:17:00.000+03:00", "crawled": "2015-09-21T17:21:52.263+03:00", "highlightTitle": ""}