{"organizations": [], "uuid": "a12f825a044fe6913d294d069405784992d59112", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/olympian-wrestler-sushil-kumar-set-promote-shudhbuycom/45433", "country": "US", "title": "Olympian Wrestler Sushil Kumar Set to Promote Shudhbuy.com", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Olympian Wrestler Sushil Kumar Set to Promote Shudhbuy.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T12:45:00.000+03:00", "replies_count": 0, "uuid": "a12f825a044fe6913d294d069405784992d59112"}, "author": "", "url": "http://businesswireindia.com/news/news-details/olympian-wrestler-sushil-kumar-set-promote-shudhbuycom/45433", "ord_in_thread": 0, "title": "Olympian Wrestler Sushil Kumar Set to Promote Shudhbuy.com", "locations": ["New Delhi", "Delhi", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sushil Kumar Set"], "text": "Monday, September 28, 2015 3:15PM IST (9:45AM GMT) Olympian Wrestler Sushil Kumar Set to Promote Shudhbuy.com New Delhi, Delhi, India \nAfter conquering the world and bringing unmatched glory for the country, only Double Olympic medal winner of India, super-wrestler Sushil Kumar is ready to take on the fight in a new avatar. He is now leading a campaign to promote sale of Pure & Organic Products through Shudhbuy.com Shudhbuy.com - is a Virtual Marketplace for Pure, Organic & Ayurvedic products. It is conceptualized by a group of professionals and environmentalists, devoted to protect and enrich our natural wealth besides promoting good health and lifestyle. To sum it all, Shudhbuy.com is exactly what we need in today's health conscious society - a place where food is what it's supposed to be - Delicious and Healthy. On the occasion of announcing the association with Sushil Kumar, Deepak Choudhary, Head of Operations, for Shudhbuy.com said –“For consumers, our association with Olympic Medallist Sushil Kumar is a reiteration of our belief and vision to make Shudhbuy.com the largest platform of organic and pure products for the ultimate consumer. Being a Vegetarian, he became World champion and the only Double Olympic medallist for India. He is the best known exponent of Pure products.” Sushil Kumar says –“I am a pure vegetarian and have always been very conscious of my Diet and Health. Good Diet consisting of Pure food products is the stepping stone for Good health which in-turn lays the foundation for success in Sports or any other aspect of Life.” He adds “I am very happy to associate with Shudhbuy. Shudhbuy is a vision, it is a belief and above all, the determination of everyone who is presently working with the team. We resonate the idea of working together to pull up the best online marketplace in India for Ayurvedic and organic products.” As a landmark deal, Shudhbuy.com has been officially granted the rights by Patanjali to sell all their product range online. Patanjali is the No. 1 Ayurvedic product manufacturing group of India. Deepak adds –“The consumers will always get the largest collection of organic food products, cosmetics, health & wellness, home necessity products, gardening products, so on and so forth. In short, Shudhbuy.com will have everything that is organic and pure. It will endeavour to never let its dedicated customers down. Instead, we will always source the most credible and trustworthy products from across the country and make it available at the doorsteps of the aware customers of today and tomorrow.” About Shudhbuy \nShudh Buy is one stop shop for all grocery needs and health care products. The online supermarket store contains all household needs starting from grocery & staples, ready food, beverages, personal care, health care, house hold and books & media for yoga and well-being. People can buy from a wide range of options in every category, exclusively handpicked to help them find the best quality available at the lowest prices. The order will be delivered right at their doorstep. Shudh Buy is authorized by Patanjali Ayurved Limited to sell Patanjali products online. \nAbout Sushil Kumar \nThe Number 1 Olympic Athlete of India, he is perhaps the most consistent Sports icon of the country having a tally of 14 Medals from Olympics, Commonwealth and Asian Events. \nHe is the first Indian World Champion wrestler who won the gold medal in freestyle competition at the World Championship 2010. He is the only Indian to have won back to back individual Olympic medals. A silver medal at the 2012 London Olympics and a bronze medal in the 2008 Beijing Olympics. \nTouted as the messiah for Indian Wrestling, he brought back our country on the Wrestling World's map. Awarded Padamshree & Arjuna Award, he later also received the Rajiv Gandhi Khel Ratna - India's highest honour for sportspersons. Sushil won the gold medal in 74 kg Men's freestyle in 2014 Commonwealth Games at Glasgow. He is now preparing for the Rio Olympics 2016. \nWrestling Record \nThe Number 1 Wrestler in the history of Wrestling in India, he has represented our country in 31 international events recognised by UWW. Some other records that Sushil Kumar holds: He has also played the highest number of wrestling bouts representing India. He has played 108 bouts in recognised International events He holds the record for winning highest number of wrestling bouts representing India. He has won 89 bouts in recognised International events He also holds the record for winning highest number of wrestling events representing India. He has won 12 International events besides being a medallion in many others ​", "external_links": [], "published": "2015-09-28T12:45:00.000+03:00", "crawled": "2015-09-28T13:10:59.329+03:00", "highlightTitle": ""}