{"organizations": [], "uuid": "064124d39c70a70d5f99a6e203d078c4dd5e9f21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/taxforms1208_600x400.jpg", "site_section": "http://www.thestreet.com/topic/47761/personal-finance.html?cm_ven_int=navmoney", "section_title": "Personal Finance Education - Tips, Articles and Advice - TheStreet", "url": "http://www.thestreet.com/story/13277369/1/h-r-block-keeps-the-good-news-rolling-for-shareholders.html", "country": "US", "title": "H&R Block (HRB) Keeps the Good News Rolling for Shareholders", "performance_score": 0, "site": "thestreet.com", "participants_count": 2, "title_full": "H&R Block (HRB) Keeps the Good News Rolling for Shareholders - TheStreet", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T00:35:00.000+03:00", "replies_count": 1, "uuid": "57e7bdcb5b343af0ca5de0b4f8911acdf05ea09d"}, "author": "thestreet.com/", "url": "http://www.thestreet.com/story/13277369/1/h-r-block-keeps-the-good-news-rolling-for-shareholders.html#post-0", "ord_in_thread": 0, "title": "H&R Block (HRB) Keeps the Good News Rolling for Shareholders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reddit Email Print Reprint NEW YORK (TheStreet) -- Business is getting better at tax preparation company H&R Block ( HRB - Get Report ) , which might be a disappointment for Republican presidential hopeful Donald Trump.\nA few weeks ago, Trump declared that he dreamed of putting H&R Block out of business by simplifying the tax code. H&R Block, however, is moving forward with a new capital structure plan, a big share buyback, and is posting improved financial results.\nH&R Block shares got a big midweek boost on word of its $3.5 billion share buyback plan, which it announced on the heels of completing the divestiture of its banking business, H&R Block Bank, to BofI Federal Bank ( BOFI - Get Report ) .\n\"What happened was, frankly, the Dodd-Frank regulations drove a lot of extra regulation. And our capital was essentially trapped,\" explained Bill Cobb, H&R Block's president and CEO. Now, that freed up capital will be returned to stockholders through the buyback authorization, which runs through June 2019.\nH&R Block also reported fiscal 2016 first-quarter results that included a 3% increase in the top line, due to higher product revenues. But that was partially offset by the strong dollar.\n\"International for us is a relatively small percentage of our revenue, said Cobb. \"It's less than 10%, so the currency impact isn't as strong as it is on a number of other companies, however we have to watch that.\" H&R Block's international operations are primarily in Canada and Australia.\nCobb said a primary focus for the company now is its growing digital business and its U.S. retail tax customers.\nConcerning Trump's talk of tax code reform, Cobb had this to say. \"With regard to simplicity, tax reform, etc., the fundamental issue is the tax code is used by Congress for all social programs. Take the Affordable Care Act . Why is that going through the IRS?\" asked Cobb. He added that a complex tax code can be burdensome for tax prep companies, too, noting that H&R Block had to spend a lot of money last year to train its tax preparers on tax code changes due to the Affordable Care Act.\n\"'I think an intelligent discussion we can certainly have,\" said Cobb. \"We think we know more about the tax code than anyone. We work with Congress all the time on ways to simplify not only elements of the code but the process.\"", "external_links": ["http://twitter.com/share?url=http://www.thestreet.com/story/13277369/1/h-r-block-keeps-the-good-news-rolling-for-shareholders.html&text=H&R", "http://www.linkedin.com/shareArticle?mini=true&url=http://www.thestreet.com/story/13277369/1/h-r-block-keeps-the-good-news-rolling-for-shareholders.html", "https://plus.google.com/share?url=http://www.thestreet.com/story/13277369/1/h-r-block-keeps-the-good-news-rolling-for-shareholders.html", "http://www.facebook.com/sharer.php?u=http://www.thestreet.com/story/13277369/1/h-r-block-keeps-the-good-news-rolling-for-shareholders.html", "http://www.reddit.com/submit?url=http://www.thestreet.com/story/13277369/1/h-r-block-keeps-the-good-news-rolling-for-shareholders.html&title=H&R"], "published": "2015-09-04T00:35:00.000+03:00", "crawled": "2015-09-26T05:08:49.655+03:00", "highlightTitle": ""}