{"organizations": [], "uuid": "16226b7621961026c1832d2008d0d04c6a83ade5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=3900_4850.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/bridging-the-week-august-2015-5-31659/", "country": "US", "title": "Bridging the Week - August 2015 #5", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Bridging the Week - August 2015 #5", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T23:57:00.000+03:00", "replies_count": 0, "uuid": "16226b7621961026c1832d2008d0d04c6a83ade5"}, "author": "Katten Muchin Rosenman LLP", "url": "http://www.jdsupra.com/legalnews/bridging-the-week-august-2015-5-31659/", "ord_in_thread": 0, "title": "Bridging the Week - August 2015 #5", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=f85b9356-35e2-42f7-82fb-596f8439d946\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> Charles Schwab Fined US $2 Million by FINRA for Net Capital Deficiencies : Charles Schwab & Co. agreed to pay US $2 million to the Financial Industry Regulatory Authority to resolve allegations that it had net capital deficiencies on three days in 2014. According to FINRA, the amounts of Schwab’s deficiencies were US $287 million, US $612 million and $US 775 million, respectively. FINRA claimed that Schwab violated applicable securities law related to minimum net capital requirements for broker-dealers because of unsecured loans of US $1 billion extended to its parent company, Charles Schwab Corporation, on each of the three days. FINRA said Schwab’s Treasury Group made the loans without consulting anyone in the firm’s Regulatory Reporting Group – the unit at Schwab responsible for net capital calculations and regulatory reporting. The Treasury Group only first considered whether the loans might impact the firm’s net capital and consulted the Regulatory Reporting Group after making the third loan, according to FINRA. FINRA acknowledged that Schwab self-reported the net capital deficiencies to the Securities and Exchange Commission on that same day. Schwab was also charged by FINRA with not having a “supervisory system reasonably designed to achieve compliance” with the applicable SEC net capital rule because the firm did not have a supervisory system or written procedures that required its Treasury Group to consult its Regulatory Reporting Group regarding loans made to its parent corporation. IFUS Sanctions West Oaks Energy Over US $415,000 for Position Limit Violations; Other Firms Fined for Pre-Execution Communication, Block Trades and EFRP Rule Infractions : West Oaks Energy agreed to pay a fine of almost US $248,000 and disgorgement of almost $168,000 to resolve allegations by ICE Futures U.S. that it violated spot month position limits for energy contracts on three instances, violated an exemption from a position limit for arbitrage positions on four occasions and failed to supervise an employee. Separately, BNP Paribas Commodity Futures Ltd. and Jason Spaziante, a broker employed by BNP, agreed to settle allegations by IFUS that Mr. Spaziante impermissibly took advantage of information received during pre-execution communications. According to IFUS, on February 13, 2014, after communicating with an unnamed unaffiliated trader regarding the terms of a customer order, Mr. Spaziante gave the trader “the option to take a position that might have been offset against either the customer order, or, alternatively, in the central limit order book” for the relevant sugar futures contract. To resolve this matter, BNP agreed to pay a fine of US $200,000, while Mr. Spaziante agreed to a trading ban for all IFUS contracts for three months. IFUS also resolved a disciplinary action against Noble Americas Resources Corp and Noble Columbia S.A.A. for apparently engaging in exchange for physical transactions against each other when their accounts were not independently controlled, and for not having documentation to support the physical component of EFPs on “multiple occasions.” The companies each agreed to pay a US $62,500 fine to resolve this matter. Finally, Spectron Energy Services Ltd. was charged by IFUS with failing to report one block trade within a required time frame and for misreporting the execution times of “several” block trades. Spectron agreed to pay a fine of $22,000 to settle this action. Compliance Weeds : As at the CME Group and other exchanges, ICE Futures U.S. has strict rules governing the execution and reporting of block trades. These requirements address the qualified participants eligible to execute block trades, minimum thresholds, prices, reporting requirements and other limitations (click here to access IFUS Rule 4.07). Moreover, “parties involved in the solicitation or negotiation of a block trade may not disclose the terms of a block trade to non-involved parties prior to the block trade being publicly reported by the Exchange” or take advantage of non-public information for their own advantage. (Click here to access ICE Futures U.S. Block Trades – FAQs (June 19, 2015).) Block traders must follow precisely these requirements not only to avoid potential violations of IFUS’s requirements, but the CFTC requirement that approved non-competitive transactions (including block trades) must be executed in accordance with exchange rules. (Click here to access background on the CME Group’s block trade rules in the article “CME Group Files Disciplinary Actions for Trading Ahead of Block Trades and Failure to Supervise an Employee Engaging in Disruptive Trading Activities” in the August 23, 2015 edition of Bridging the Week .) Flash Boys -Inspired Litigation Dismissed by Federal Judge : A federal court in New York City dismissed five lawsuits against multiple stock exchanges, Barclays PLC and Barclays Capital Inc., all echoing claims made in Michael Lewis’s 2014 book Flash Boys: A Wall Street Revolt that high-frequency traders have gained an unfair advantage trading stocks. This is because, claimed Lewis, exchanges and so-called “dark pools” have permitted HFTs to trade on market data faster than other investors. The plaintiffs principally charged that co-location services and data feeds provided to HFTs, as well as the creation of “hundreds” of complex order types, unfairly benefited HFTs, including permitting them to trade faster. The court dismissed all charges against the exchanges and the Barclays entities – which maintained a dark pool – claiming that plaintiffs’ complaints failed to state a claim. Although plaintiffs alleged that the exchanges engaged in a manipulative scheme, they failed to allege any manipulative acts by the defendants, said the court. The court also dismissed charges against the exchanges regarding their provision of data feeds and different order types on the grounds that, in connection with Securities and Exchange Commission-regulated exchanges’ discharge of regulatory responsibilities, private actions are barred by the doctrine of absolute immunity. In dismissing all the actions, the court noted that “Lewis and the critics of HFT may be right in arguing that it serves no productive purpose and merely allows certain traders to exploit technological inefficiencies in the market at the expense of other traders … Those, however, are debates and tasks for others. The Court’s narrow task was … to decide whether the Complaints in these cases were legally sufficient … Having concluded they are not, the Complaints must be and are dismissed.” (Click here to read my review of Flash Boys in the article “Flash Boys or Macbeth: Choose Shakespeare” in the April 7, 2014 edition of Bridging the Week .) CFTC Approves NFA Enhanced Customer Protection Rules for FX Retail Clients; Commissioner Bowen Says More Protection Needed : The Commodity Futures Trading Commission approved rules proposed by the National Futures Association to enhance protections for retail customers at Forex Dealer Members. Among other things, FDMs, going forward, will be required to implement and maintain a formal risk program and make certain disclosures on their website regarding their financial condition and the material risks of their business. FDMs will also be required to have an independent risk management unit that reports to the firm’s senior management. Elements of FDMs’ risk management program must include policies and procedures to monitor and manage market, credit, liquidity, foreign currency, legal, operational and counterparty risks; liabilities to retail foreign currency customers risk; and technology, capital and any other applicable risks. FDMs will be required to conduct stress tests on at least a semi-monthly basis of all positions in their proprietary accounts and in each counterparty account. In approving the NFA’s rules, CFTC Commissioner Sharon Bowen nonetheless indicated that “these proposals are not, by themselves, enough to provide retail commodity investors the basic protections they enjoy for every other commodity except foreign exchange.” She said that the CFTC itself “needs to adopt more rigorous regulations on retail foreign exchange dealers,” particularly in the area of reducing currently permitted leverage. The NFA has not yet announced the compliance date for its newly approved FDM rules. (Click here for background on the NFA’s proposal in the article “NFA Proposes Enhanced Capital and Risk Management Requirements for Retail Forex Dealer Members” in the May 31, 2015 edition of Bridging the Week. Click here for another perspective in the article “CFTC Approves NFA’s Enhanced Retail Forex Requirements” in the April 28, 2015 edition of Corporate & Financial Weekly Digest by Katten Muchin Rosenman LLP.) Appellate Court Rules Plaintiff Cannot Challenge SEC Forum Choice in Federal Court at This Time : A federal appellate court in Illinois ruled that Laurie Bebo, who is currently awaiting an initial decision from an administrative law judge in connection with an enforcement action commenced by the Securities and Exchange Commission, may not at this time challenge the legality of her administrative proceeding in a federal court. Ms. Bebo must first raise her challenge in an appeal to the Securities and Exchange Commission, and then to a US appellate court, said the appellate court considering this matter. Ms. Bebo had previously challenged the constitutionality of the SEC’s administrative proceeding in a federal district court on two grounds. She claimed that the law permitting the SEC to choose to bring an enforcement action in an administrative tribunal or federal court violated her equal protection and due process rights under the US Constitution by giving the SEC “unguided” discretion to decide which defendants would or would not receive the heightened protections of a federal district court. She also claimed that SEC administrative proceedings are unconstitutional because commissioners of the SEC themselves do not appoint the ALJs. This too violates the US Constitution, claimed Ms. Bebo. The US district court rejected these challenges as premature, as did the federal appellate court. Among other things, Ms. Bebo claimed that, if she was required to wait to seek judicial review, “she will already have been subject to an unconstitutional proceeding.” The appellate court rejected this argument, claiming that “[e]very person hoping to enjoin an ongoing administrative proceeding could make this argument, yet courts consistently require plaintiffs to use the administrative review schemes established by Congress.” My View : Ms. Bebo is irreparably harmed by being required to go through the expense and ordeal of having to raise before the Securities and Exchange Commission her constitutional objection to having an enforcement action brought against her by the SEC in an administrative tribunal. Ms. Bebo’s action is a collateral action to the administrative enforcement proceeding that is properly heard by a federal court. Such a view is consistent with the better view expressed in two recent federal district court cases in New York and Georgia. It defies common sense to believe that the SEC – a securities regulator – has expertise and the requisite impartiality to determine the constitutionality of a law that gives it the choice to determine whether enforcement actions should be heard in a federal court or an administrative tribunal. (Click here for background about the New York and Georgia court decisions in the article “Federal Judges in NY and Georgia Rule Against SEC for Enforcement Action Forum Choice Because of ALJ Selection Process” in the August 14, 2015 edition of Bridging the Week .) UBS Agrees to Pay US $1.7 Million Penalty for Allegedly Conducting Business With OFAC Banned Person : UBS AG settled potential charges that from January 2008 to January 2013, it processed 222 transactions related to securities held in custody in the United States for an individual customer of UBS in Switzerland that was designated by the US Department of the Treasury’s Office of Foreign Asset Controls in 2001 as a person with whom business must not be conducted because he was associated with terrorism. To settle this matter UBS agreed to pay OFAC a fine of US $1.7 million. According to OFAC, UBS opened accounts for the client in 1993 and 1994. In 2001, the client was included on OFACS’s List of Specially Designated Nationals and Blocked Persons. Other jurisdictions, including Switzerland, the United Kingdom, the European Union and the United Nations, also imposed sanctions against the client at approximately the same time. In response, UBS apparently placed blocks on the client’s accounts to prevent him from withdrawing or transferring any funds or assets outside the bank. However, the bank allegedly continued to engage in investment-related activity for the client. Such activity was not detected by the bank’s OFAC controls because securities-related transactions were regarded as internal transactions and thus did not generate any alerts. The activity was only discovered in 2012, after the client was removed from the Swiss sanctions list. According to OFAC, “[t]his enforcement action highlights the importance of institutions taking appropriate measures to ensure compliance with all applicable sanctions when they have operations or otherwise conduct business in multiple jurisdictions that have implemented sanctions against particular persons (individuals or entities) or countries. This action should also raise awareness regarding the sanctions obligations for foreign financial institutions — including those that purchase, sell, transfer, or otherwise transact in U.S. securities — that process transactions to or through the United States.” FinCEN Proposes AML and SAR Requirements for Investment Advisers : The Financial Crimes Enforcement Network proposed rules requiring Securities and Exchange Commission-registered investment advisers to establish anti - money laundering procedures, report suspicious activities to FinCEN, file reports of certain transactions involving US $10,000 in currency (so-called “Currency Transaction Reports”) and maintain records related to the transmittal of funds in excess of US $3,000. The obligations would also extend to persons required to be registered with the SEC as investment advisers, but who are not. Typically, only investment advisers with US $100 million or more in regulatory assets under management are required to register with the SEC. FinCEN previously had proposed rules to mandate AML programs for registered and unregistered investment advisers in 2002 and 2003, but withdrew them in 2008. Comments to the proposal are due by end of day on October 26, 2015. (Click here for additional information on the proposed rules in an August 31, 2015 Advisory by by Katten Muchin Rosenman LLP.) ESMA Seeks Comments on Appropriate Liquidation Periods for Exchange-Traded Derivatives for CCP Margin Setting : The European Securities and Markets Authority issued a discussion paper seeking views on the time horizon for liquidation and other issues related to the setting of margin for customer accounts by European clearinghouses (CCPs) and brokers. In Europe, clearinghouses are currently required to collect margin from clearing members for their customers on a net basis, assuming a two-day liquidation horizon for financial instruments other than over-the-counter derivatives. The same standard applies to proprietary accounts of clearing members too. However, unlike in the United States, proprietary accounts do not include affiliated entities. Affiliates are considered customers. In the United States, by comparison, clearinghouses collect margin from clearing members for their customers on a gross basis assuming a one-day liquidation horizon. According to ESMA, when it set a two-day liquidation period it presumed “that at a minimum [a] CCP would need two days to either port or liquidate client accounts for instruments other than OTC derivatives, which are generally more liquid and easier to be liquidated than OTC derivatives.” ESMA seeks views on the sufficiency of one-day gross versus two-day net margin, whether affiliates should continue to be considered customers and whether, if it adopts the shorter time threshold, changes should be made to requirements around intraday margins, among other matters. ESMA is not considering changing the time horizon for setting margin for non-customer accounts, however, because “[a] reduction of the liquidation period in the house account would mean allowing a one-day net margin level, which in ESMA’s view would not allow the CCPs to have a sufficient level of margins to manage a default, thus impacting the resources of the non-defaulting clearing members and the stability of the CCP.” Comments will be accepted through September 30, 2015. (Click here for additional information on ESMA’s consultation in the article “ESMA Publishes Discussion Paper on EMIR Standards Relating to CCP Client Accounts” in the August 28, 2015 edition of Corporate & Financial Weekly Digest by Katten Muchin Rosenman LLP.) My View : Although in evaluating minimum margin-collection requirements of clearinghouses and brokers ESMA makes clear that it is not attempting to prejudice deliberations of the European Commission “on the equivalence of the legal and supervisory regimes for CCPs in the USA,” in fact, ESMA is showing its cards. According to ESMA, “a preliminary comparison … has shown that the margins held at the CCP according to the gross margining method in combination with a one-day liquidation period are (typically, but not always) higher than margin requirements calculated according to the net margining method in combination with a two-day liquidation.” Moreover, with gross margining, clearing members post more client assets with a clearinghouse than hold it themselves; this should make porting of client positions easier in case of a clearing member default. In light of this, the European Commission should quickly conclude that oversight by the Commodity Futures Trading Commission over US clearinghouses is equivalent (if not identical) to EC oversight over European CCPs in order to avoid European banks being subject to putative capital requirements for exposure to US clearinghouses. Enough dithering! (Click here for background on the relevant issues in the article “CFTC Chairman Argues for Equivalent Treatment for US CCPs by the European Commission; EC and CFTC Commit to Continue Talking—That’s All for Now” in the May 10, 2015 edition of Bridging the Week .) Helpful to Getting the Business Done : In considering the arguments in the debate regarding sufficient liquidation horizons at the clearinghouse level, exchange-traded and/or centrally-cleared derivatives brokers should not lose sight of the fact that, following a client default, it might take multiple days (far more than one or two), if not weeks, to liquidate a complex client portfolio involving illiquid products, particularly those including some options and swaps. ETD brokers should regularly evaluate the liquidity of their clients' positions and adjust margin requirements or take other precautions accordingly, or at least ensure they are adequately compensated for the risk they incur in holding illiquid products for clients. \nAnd more briefly: Sentinel Principal Ordered to Pay More Than US $2 Million by Federal Court : A federal court in Illinois entered an order of permanent injunction and sanctions of over $2.1 million against Charles Mosley for his role in the collapse of Sentinel Management Group in 2007. Mr. Mosley is a former senior vice president and trader for Sentinel. Mr. Mosley previously pleaded guilty in a related criminal action and was sentenced to eight years in prison – a term he will begin serving on September 9, 2015. He and his co-defendant, Eric Bloom, Sentinel’s former chief executive officer, were also ordered to pay over US $665 million in restitution to effected customers in their criminal action. Sentinel was an investment management firm that claimed it specialized in short-term cash management for hedge funds, individuals, financial institutions and futures commission merchants. The firm filed for bankruptcy in August 2007 after it unlawfully commingled US $460 million of client securities into its house account, and used client collateral to obtain a US $321 million line of credit. (Click here for background on this matter in the article “Sentinel Management Former CEO Sentenced to 14 Years in Prison for Fraud; Former Head Trader Receives Eight-Year Term” in the February 1, 2015 edition of Bridging the Week .) ICE Futures Canada and Montreal Exchange Authorized by CFTC to Provide Direct Access to US Persons : Two Canada-based exchanges have been issued orders of registration by the Commodity Futures Trading Commission permitting them to offer direct access by US persons for certain futures and options contracts. The two exchanges are ICE Futures Canada, Inc. and the Montreal Exchange Inc. Foreign exchanges may apply to the CFTC for such orders provided they can demonstrate, among other requirements, that they are subject to comprehensive and comparable regulation as are US contract markets designated by the CFTC. \nFor more information, see:", "external_links": [], "published": "2015-09-01T23:57:00.000+03:00", "crawled": "2015-09-02T00:15:18.846+03:00", "highlightTitle": ""}