{"organizations": [], "uuid": "d3814dfa7eba41e053c1d91bcd05029fe7ef1c66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KN252_UAWVOT_G_20150928153436.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/fiat-chrysler-labor-contract-in-doubt-1443476110", "country": "US", "title": "Fiat Chrysler Labor Contract in Doubt", "performance_score": 0, "site": "wsj.com", "participants_count": 2, "title_full": "Fiat Chrysler Labor Contract in Doubt - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T01:35:00.000+03:00", "replies_count": 1, "uuid": "e5d7143c5020a6b4cc8dc9f4fd65b741f98bece8"}, "author": "Christina Rogers", "url": "http://www.wsj.com/articles/fiat-chrysler-labor-contract-in-doubt-1443476110#post-0", "ord_in_thread": 0, "title": "Fiat Chrysler Labor Contract in Doubt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Workers at several of Fiat Chrysler Automobiles FCAU -4.85 % NV factories have rejected a proposed labor contract, indicating the Italian-U.S. auto maker is having a tough time selling a four-year deal that raises wages but falls short of expectations.\nUnited Auto Workers members began voting on the new pact last week, and a majority of union locals have turned down the proposal thus far. They are citing concerns about medical benefits, a two-tier wage structure and the auto maker’s plan to move production of key products to Mexico as reasons for disapproval. Voting will continue through Wednesday.\nA UAW spokesman and Fiat Chrysler officials declined to comment on the results.\nWhile many votes are yet to be cast, the lukewarm initial reception raises the possibility that UAW officials may need to revisit the bargaining table with Fiat Chrysler Chief Executive Sergio Marchionne , or move on to Ford Motor F -3.03 % Co. or General Motors Co. GM -2.89 % and return to Fiat Chrysler later. Workers could call a strike, but that appears unlikely given comments UAW President Dennis Williams made suggesting a walkout would be the last resort.\nUAW officials could face tough talks at GM and Ford. Both aim to lower their costs to bring them more in line with Fiat Chrysler, which has hourly labor costs about $10 less than GM and Ford.\nENLARGE Workers at several Fiat Chrysler factories have rejected a proposed labor contract. Pictured, protesters in Detroit last week. Photo: David Coates/Associated Press The union’s president has said he expects more from GM and Ford because they are more profitable.\nMr. Williams presented contract details to 36,000 U.S. Fiat Chrysler workers two weeks ago at a news conference in Detroit, saying entry-level workers and longer-tenured employees would get raises. Many workers expected the eradication of two pay tiers in the near term, but the new contract won’t fully eliminate it during the life of the agreement.\nMr. Williams’s message that his negotiators secured a good deal is having trouble gaining traction.\n“There are a lot of fired-up people,” said Ryan Nearhood, a 30-year-old Fiat Chrysler worker in Toledo, Ohio. “A lot of us members could turn this contract down,” he said, referring to a local vote taking place near a Jeep plant on Tuesday.\nMr. Nearhood said he attended an informational meeting hosted by UAW leadership over the weekend where opposition to the pact was so heated that officials from the Toledo local had to calm members down. “It was very disheartening,” he said.\nWorkers at several major facilities—including the 4,400-worker Jefferson North factory in Detroit and employees at transmission plants in Indiana—have turned down the deal. An engine plant in Dundee, Mich., was one of the few to pledge support.\nWhile the local unions organize the votes at each plant, the end result is tallied based on the entire body of Fiat Chrysler hourly workers. If a majority approve, then the contract passes. Norwood Jewell, the UAW’s lead bargainer for Fiat Chrysler, said the deal could pass because a number of local unions haven’t voted yet, according to comments made to The Detroit News over the weekend.\nIn addition to concerns about pay, a plan to restructure health-care benefits to lower the company’s costs is fueling concerns that benefits will be cut. Workers are also upset about the lack of job commitments amid a wider plan to outsource production work.\n“There are people saying ‘vote no to Sergio,’” said Bill Parker, a 63-year-old worker at the company’s Sterling Heights, Mich., factory. Mr. Parker’s local will vote Tuesday, and he said workers are angry with Mr. Marchionne for not doing more to give back to workers now that the company is healthier.\nFiat Chrysler has committed to rich profit-sharing bonuses that get more lucrative as the company’s margins near 10%. The auto maker’s U.S. division reported a 4% profit margin last year and is paying far less than GM and Ford in bonuses.\nStill, Fiat Chrysler’s new labor pact likely lifts the company’s compensation costs by at least 10%, from $48 an hour to a range of $53 an hour to $54 an hour, labor experts said. That is just short of the rate paid at GM and Ford.\n—Jeff Bennett contributed to this article.\nWrite to Christina Rogers at christina.rogers@wsj.com", "external_links": ["http://si.wsj.net/public/resources/images/BN-KN252_UAWVOT_P_20150928153436.jpg", "http://si.wsj.net/public/resources/images/BN-KN252_UAWVOT_M_20150928153436.jpg"], "published": "2015-09-29T01:35:00.000+03:00", "crawled": "2015-09-29T06:20:27.430+03:00", "highlightTitle": ""}