{"organizations": [], "uuid": "38d21951f5b98398d7641efbff8ba52926f89c06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-09/sunac-shares-drop-after-developer-signs-pact-with-indebted-yurun", "country": "US", "title": "Sunac Shares Drop After Developer Signs Pact With Indebted Yurun", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Sunac Shares Drop After Developer Signs Pact With Indebted Yurun - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T12:23:00.000+03:00", "replies_count": 0, "uuid": "38d21951f5b98398d7641efbff8ba52926f89c06"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-09-09/sunac-shares-drop-after-developer-signs-pact-with-indebted-yurun", "ord_in_thread": 0, "title": "Sunac Shares Drop After Developer Signs Pact With Indebted Yurun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sunac China Holdings Ltd., the Chinese developer that dropped a takeover bid for Kaisa Group Holdings Ltd. earlier this year, headed for the biggest drop in two weeks in Hong Kong trading after announcing a strategic cooperation with an indebted Chinese foodmaker.\nSunac shares slid as much as 6.3 percent and fell 4.9 percent to HK$4.06 at the midday break on Wednesday, headed for the biggest drop since Aug. 26. The benchmark Hang Seng Index gained 3 percent. Sunac said Tuesday that it entered “a series of strategic partnerships” with Yurun Holdings Group Co., a meat producer with diversified businesses including real estate, without providing more details. Sunac will join Yurun’s discussions with creditors on its debt issues and will provide Yurun “with full support,” it said in the statement.\nYurun’s land bank under its property development arm, which is mostly in China’s third- and fourth-tier cities, “does not complement Sunac’s current business strategy,” Jefferies Hong Kong Ltd. said in a note Wednesday.\nSunac has aborted a couple of deals with other developers in the past year. In May, it dropped a proposed acquisition of Shenzhen-based Kaisa after talks with the troubled developer’s offshore bondholders on debt payments stalled and Kaisa founder Kwok Ying Shing unexpectedly returned as chairman. The deal could have given Sunac, based in the northern city of Tianjin, a foothold in southern China, where property prices have been rising faster than anywhere else in the country.\nAn agreement to buy a 24 percent stake in Greentown China Holdings Ltd. collapsed last year, after the Hangzhou-based developer’s chairman said the two firms “don’t blend.”\nSunac founder and Chairman Sun Hongbin resigned Sept. 7 as chief executive officer to focus more on corporate strategy and “significantly important matters,” the company said.\nChina Yurun Food Group Ltd., the Hong Kong-listed unit of the group, slipped into a loss of HK$724 million ($93 million) in the first half, compared with a profit of HK$16.05 million a year earlier, as China’s slowing economy and a sharp decline in the high-end catering industry hurt the company, it said last month.\nYurun expects to continue to face various challenges in the second half of this year, it said in a profit warning in July. As at June 30, the company had outstanding bank loans of HK$8.431 billion and cash, including time deposits and pledged deposits, of HK$1.124 billion.\nShares of Yurun Food surged as much as 27 percent, the most since May 26, and were 9.8 percent higher at HK$2.02.", "external_links": [], "published": "2015-09-09T12:23:00.000+03:00", "crawled": "2015-09-09T07:42:55.385+03:00", "highlightTitle": ""}