{"organizations": [], "uuid": "6642a1b4a8d5e21f1277a3d7daf2ad3a3291ec85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "", "site_section": "http://www.marketwire.com/rss/mwFSPF.xml", "section_title": "Marketwired - Personal Finance", "url": "http://www.marketwired.com/press-release/countdown-to-investorideascom-follow-the-money-contest-for-global-investors-2055172.htm", "country": "CA", "title": "Countdown to Investorideas.com 'Follow the Money Contest' for Global Investors", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "Countdown to Investorideas.com 'Follow the Money Contest' for Global Investors", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T21:59:00.000+03:00", "replies_count": 0, "uuid": "6642a1b4a8d5e21f1277a3d7daf2ad3a3291ec85"}, "author": "", "url": "http://www.marketwired.com/press-release/countdown-to-investorideascom-follow-the-money-contest-for-global-investors-2055172.htm", "ord_in_thread": 0, "title": "Countdown to Investorideas.com 'Follow the Money Contest' for Global Investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 14, 2015 14:59 ET Countdown to Investorideas.com 'Follow the Money Contest' for Global Investors \nNEW YORK, NY AND POINT ROBERTS, WA --(Marketwired - September 14, 2015) - Investorideas.com ( www.investorideas.com ), a global investor news source covering leading sectors, reminds investors and members the 'Follow the Money Contest' for global investors starts on September 15 th . \nThe contest will run from September 15 th to October 31 st , 2015 and is open to Investor Ideas members ( http://www.investorideas.com/membership/ ). Contest entries can take place any time during the contest, with trade entries accepted right up until the closing date. \nPrizes include a Money Suit as seen worn by the Investorideas.com Money Team and also by Will Ferrell at the 2013 MTV Movie Awards Speech, Annual Small Cap Pro Accounts from Investors Hub http://investorshub.advfn.com/ and more prizes to be announced shortly. \nThe contest will consist of investors picking a stock or stocks they wish to buy within sectors they like and within the time frame of the contest. Investors can buy their favorite beverage stock such as Starbucks Corporation (SBUX) from our beverage stock directory, their favorite Yoga Brand like Lululemon Athletica Inc. (LULU) from our LOHAS directory or Ralph Lauren Corporation (RL) from our Luxury Brand stock directory. \nThis contest gives investors a chance to not only invest in their favorite sectors and companies but also test their skills against other global investors. Investorideas.com stock directories feature and include stocks from most global stock exchanges. Key sectors covered include biotech, tech, mining, mobile, energy, water, defense and security, renewable energy, food and beverage stocks including wine stocks, luxury retail brands, sports stocks and others. \nRules and Eligibility: http://www.investorideas.com/membership/contest.asp \nMore Info about Small Cap Pro: Small Cap Pro provides online Level 2 quotes for active stock traders. Users receive live Level 2 data for both OTCBB stocks and Pink Sheets. You will be able to use the Level 2 order book to see the buying support and selling pressure. This info will help determine when is a good time to buy or sell the stock. The Level 2 tool is available on the website or in the mobile apps. \nThis package also provides Level 1 stock quotes for all the web site tools such as monitor watchlists, charts, portfolio, last 100 trades, and toplists. This wide range of access provides live stock quotes everywhere you go. The data is unlimited so you are finally free to explore the world of stocks to your heart's content. Let our tools help you analyze and find the next great stock. Don't miss another great trading opportunity. \nAbout InvestorIdeas.com: InvestorIdeas.com is a global news source for investors following leading business sectors including biotech, tech, mining, mobile, energy, water, defense and security, renewable energy, food and beverage stocks, sports and entertainment and Latin American stocks. Follow Investorideas.com on Twitter http://twitter.com/#!/Investorideas Follow Investorideas.com on Facebook http://www.facebook.com/Investorideas \nSign up for our free news alerts http://www.investorideas.com/Resources/Newsletter.asp \nDisclaimer/ Disclosure: The Investorideas.com newswire is a third party publisher of news and research as well as creates original content as a news source. Original content created by investorideas is protected by copyright laws other than syndication rights. Investorideas is a news source on Google news and syndication partners. Our site does not make recommendations for purchases or sale of stocks or products. Nothing on our sites should be construed as an offer or solicitation to buy or sell products or securities. All investment involves risk and possible loss of investment. This site is currently compensated by featured companies, news submissions, content marketing and online advertising. Contact each company directly for press release questions. Disclosure is posted on each release if required but otherwise the news was not compensated for and is published for the sole interest of our readers. More disclaimer info: http://www.investorideas.com/About/Disclaimer.asp \nBC Residents and Investor Disclaimer: Effective September 15 2008 - all BC investors should review all OTC and Pink sheet listed companies for adherence in new disclosure filings and filing appropriate documents with Sedar. Read for more info: http://www.bcsc.bc.ca/release.aspx?id=6894 . Global investors must adhere to regulations of each country. Contact Information \nTo Sponsor the contest with your brand or service call or email Dawn or Cali", "external_links": [], "published": "2015-09-14T21:59:00.000+03:00", "crawled": "2015-09-14T22:30:46.627+03:00", "highlightTitle": ""}