{"organizations": [], "uuid": "43c415f34a9dcfd52c300a0571bb0f7a0e15c58d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509030050.html", "country": "US", "title": "Zimbabwe: Investors to Lose U.S $10 Million in Tetrad Unit", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Investors to Lose U.S $10 Million in Tetrad Unit", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T07:12:00.000+03:00", "replies_count": 0, "uuid": "43c415f34a9dcfd52c300a0571bb0f7a0e15c58d"}, "author": "", "url": "http://allafrica.com/stories/201509030050.html", "ord_in_thread": 0, "title": "Zimbabwe: Investors to Lose U.S $10 Million in Tetrad Unit", "locations": ["U.S", "Tetrad Unit Zimbabwe", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Zimplats Suffer U.S $74 Million Loss \n\"Concurrent creditors are paid from any proceeds of unencumbered assets that remain after preferrent creditors have been paid in full,\" reads part of the liquidator's report. The liquidator said that subject to placement of TIB under judicial management TFS trustee, Broc Financial Services, filed a claim of $10,8 million, whose recoverability is doubtful. \nThe $10 million that could be lost to the incestuous investment relations between the sister companies constituted about 60 percent of TFS entire clients' investment portfolio. \nThe balance of the asset manager's total portfolio holding of $16,2 million, which was riskily concentrated in the money market, were held in equities and property investments. According to the liquidator, the Securities Exchange Commission of Zimbabwe repeatedly expressed reservations on the concentration of risk relating to money market investment, as well as the impact of the liquidity challenges at the bank but no remedial action were put in place by TFS management, the Broc Financial Services. \nAs at May 8, 2015, outstanding payments to clients who had submitted disposal orders stood at $7,2 million, which raises the spectre of a more substantial loss. The risk that now confronts TFS clients resulted from unethical conduct of directors as they made TFS to mobilise funds for TIB and group before creating unsustainable funding structures. \nThe liquidator said forensic investigations will be intensified to ascertain \"if any directors of TFS could have incurred criminal liability\" while the regulator and clients could consider assessing the suitability of the Trustee in light of significant impairment of investments. TFS is insolvent as its liabilities exceed assets by $1,5 million. Before the liquidation, there was litigation that took place after the company failed to discharge its financial obligation resulting in a number of assets being attached. At group level, its three subsidiaries are under judicial care. Zimbabwe \nCabinet has unanimously endorsed Nigerian billionaire Mr Aliko Dangote's decision to invest in Zimbabwe's critical … see more » Copyright © 2015 The Herald. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-03T07:12:00.000+03:00", "crawled": "2015-09-03T22:15:11.482+03:00", "highlightTitle": ""}