{"organizations": [], "uuid": "77051db450008b261fac3f2859638694e575d3b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/jeremy-corbyn-hurt-portfolio-152913079.html", "country": "GB", "title": "Will Jeremy Corbyn Hurt Your Portfolio?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Will Jeremy Corbyn Hurt Your Portfolio?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T18:29:00.000+03:00", "replies_count": 0, "uuid": "77051db450008b261fac3f2859638694e575d3b1"}, "author": "", "url": "https://uk.finance.yahoo.com/news/jeremy-corbyn-hurt-portfolio-152913079.html", "ord_in_thread": 0, "title": "Will Jeremy Corbyn Hurt Your Portfolio?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Sep 16, 2015, 19:49 BST - UK Markets closed Will Jeremy Corbyn Hurt Your Portfolio? By Owain Bennallack | Fool.co.uk – 3 hours ago 327.70 -1.20 \nSo the impossible has proven not just possible but palatable, with 500-1 outsider and left-winger Jeremy Corbyn elevated from the backbenches to the leadership of Labour party. It's fascinating to ponder what this says about British politics. But the sworn duty of The Collective is to explore the investing perspective, not the political dimension. In short: what does Jeremy Corbyn mean for your ISA? Wrong for right-wing reasons \nTo spoil the suspense, I'll say that in my opinion, paying too much attention to politics - especially which party happens to be in power - can impair your investing judgement. When it comes to the long bull market in US shares over the past six years, for instance, I noticed some US fund managers and pundits were sceptical from the start on ideological grounds. They didn't like what they saw as a leftist and interventionist Democratic administration under President Barack Obama. And they believed near-zero interest rates and quantitative easing (QE) under Federal Reserve Chairman Ben Bernanke was irresponsible, too. Never mind that the Credit Crisis had bubbled up under the Republican's term, or that QE benefits shares and other assets. Nor the old adage that says, \"Never fight the Fed\", on the grounds that cheap money will always be good for markets while it lasts. Fight the Fed is just what such sceptics did. Motivated by their political beliefs, they advocated a reduced exposure to US equities and bonds and favoured gold. Some explicitly said owning the precious metal was a way to bet against the US dollar and protect oneself from the wayward policies of the US government. It was a bad decision. Gold soon slumped while US government bonds and equities went on a tear. Same crash, different politics \nAs if to prove the irrelevance of which party is in power for investors, we saw the flipside in the UK. Our own financial crisis was incubated and unleashed under a Labour government, in contrast to that rightwing US Republican one. And whereas it was the Democratic Party in the US that had to deal with the aftermath, in the UK Labour bailed out the banking system, then passed the reins on to the Conservative/Liberal Democrat Coalition. Yet despite these supposedly more market-friendly parties being in power, our market did worse in the post-crash aftermath than the US under the much-maligned President Obama. Again, politics was a poor guide to investing outcomes. \nIt's the economy, stupid \nNow you might be thinking, \"Hang on, you guys have pointed out many times how the UK market is dominated by energy and mining outfits, and companies with emerging market exposure. And we all know they've done about as well recently as Liz Kendall in a Labour leadership election. Surely that is why the UK is lagging the US?\" To which I say - exactly. At least over the short run, under- or over-valuation of assets, investor confidence, and where we are in the economic cycle are far more consequential to your investment returns than the ballot box. Equities up under all parties \nOf course, specific government edicts can certainly have direct consequences on our portfolios and wealth. To give some recent examples - the punitive changes to dividend taxation announced in the most recent Conservative Budget, the Pension freedoms set in train by the Coalition and the Labour-managed bailout of Lloyds (LSE: LLOY) and RBS (LSE: RBS) have all impacted most UK investors. But when it comes to the stock market itself, statistics show that UK equities have advanced under both Labour and the Conservatives. Data covering the 45 years between 1970 and the General Election this May, for instance, showed the UK stock market rose 16% a year on average under the Conservatives versus 9% a year under Labour. That might seem to give the Tories the lead as the party for investors, but don't forget the global events that partly drove those returns, from the oil crisis in the 1970s and the global market liberalisations of the 1980s to the banking bust of 2008 and 2009. While politicians played a hand in all those events, the ones that had to deal with the consequences, as I've discussed above, were very often not the ones who presided over their genesis. Company concerns \nThe same data shows UK company profits grew 11% a year over the period under the Conservatives versus 6% a year under Labour. That seems more ominous (though still subject to the same caveats) and the thought of Jeremy Corbyn in Number 10 will be a talking point for businesses in the weeks and months ahead. Corbyn has already appointed a left-wing ally John McDonnell as shadow chancellor, for instance. McDonnell says capitalism is \"failing\", and he's called for the banks and railways to be nationalised, for the top rate of income tax to increase to 60%, and for politicians to regain control of interest rates from the Bank of England. This sort of talk is sure to send a collective shiver through the boardrooms of Britain. What about the workers? \nThat is not to say that there are not legitimate questions to ask about the economic machine - even viewed solely through the narrowest lens of our interest as shareholders. Rightly or wrongly, many people were dismayed by the financial crisis, and feel not enough has been done to prevent a recurrence. Others have argued that the record profit margins being reported in many industry sectors is unsustainable - and that the proliferation of share buybacks has benefitted shareholders at the expense of workers on static salaries, as well as underinvestment in the skills and technology that can best grow the economy. That inequality has increased in the UK and US is much discussed, and it partly explains Corbyn's appeal. And arguably, such inequality is not a particularly healthy backdrop for business, either, which after all needs to sell its goods to a wider constituency than London estate agents and oligarchs. Thus more left-wing arguments about business than have been heard in the UK for many decades could well find some support. Manifesto destiny \nWe'll have to wait to see what Mr Corbyn proposes to do about these issues to judge their potential support among the British electorate - and hence their impact on the markets. But it's worth remembering that Corbyn cannot escape the same restraints on radical action faced by any other government, such as the advance of globalisation and automation, and the footloose nature of international capital. A Labour manifesto under Corbyn would likely pledge to raise the minimum wage paid by businesses, tax profits more heavily, and potentially try to encourage investment - perhaps with his controversial People's QE proposal, which would see the UK issue more debt to invest in infrastructure. The latter might hit the value of the pound if international investors felt it put the UK's solvency into doubt, but then a weak pound might help the UK manufacturers and exporters -- the sector of business Corbyn is most likely to favour. His stance on Europe might also influence the appeal of British companies to foreign investors, especially if he campaigns for the UK's withdrawal from the European Union. Taxing questions \nHigher personal rates of taxation would also seem inevitable under a Corbyn government, with perhaps more curbs on the likes of ISA contributions and pension reliefs too. Again, even some Collective readers might argue that with the rich seemingly getting richer and the country still in hock for trillions, such policies make sense. It'll certainly be interesting to hear the debate in the months ahead. But for now, I doubt the electorate is ready to back such an agenda. Thus Corbyn's influence on our finances is most likely to be restricted to whatever pull leftwards his opposition can exert on the elected Government's policy on matters like taxation and regulation. While Jeremy Corbyn's election has enlivened UK politics, I don't think he'll matter to our investments in the foreseeable future. \nElsewhere in the market, the Fool's experts believe sales could treble in just five years at this e-commerce stealth attack whose maverick CEO may have been underestimated by the City. For more free information on this daring buy, click here now .", "external_links": [], "published": "2015-09-16T18:29:00.000+03:00", "crawled": "2015-09-16T21:50:35.786+03:00", "highlightTitle": ""}