{"organizations": [], "uuid": "b8503e58aad30464bd0557b78a06d878fe6e670a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/h/f/1/i/image.related.afrArticleLead.620x365.gjhew8.png/1441962078542.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/media-and-marketing/publishing/how-melbournes-peter-yates-got-to-the-top-at-manhattans-hearst-magazines-20150908-gjhew8", "country": "AU", "title": "How Melbourne's Peter Yates got to the top at Manhattan's Hearst magazines", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How Melbourne's Peter Yates got to the top at Manhattan's Hearst magazines | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T22:15:00.000+03:00", "replies_count": 0, "uuid": "b8503e58aad30464bd0557b78a06d878fe6e670a"}, "author": "George Epaminondas", "url": "http://www.afr.com/business/media-and-marketing/publishing/how-melbournes-peter-yates-got-to-the-top-at-manhattans-hearst-magazines-20150908-gjhew8", "ord_in_thread": 0, "title": "How Melbourne's Peter Yates got to the top at Manhattan's Hearst magazines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Manhattan-based Australian Peter Yates oversees the branding for Hearst Magazines titles and websites around the globe. \"I don't think magazines are going away,\" he says. \"Printed magazines are the incubator of ideas.\" Trevor Collens by George Epaminondas\nPeter Yates is an advocate for creative visualisation. Thirty-five years ago, as a teenager coming of age on Victoria's Mornington Peninsula, he pinned a snapshot of the jagged New York skyline above his desk and beheld it optimistically.\n\"It's kind of unbelievable what you can imagine,\" Yates says, now ensconced in his office on the 37th floor of the glittering Hearst Tower in midtown Manhattan. As executive creative director of international branding for Hearst Magazines International (HMI), Yates acts as the principal conductor for the media juggernaut.\nIt's a plum role, as lofty as the breathtaking vistas from his window.\nA team of three, plus boss Peter Yates, review a staggering 3600 pages each month. \"We don't use the word approve,\" he says. \"We say 'Beautiful, thanks very much' or 'Here are some suggestions...' Supplied HMI, a division of Hearst Corp, publishes 285 magazines and 200 websites in 34 languages across 81 nations. Their sprawling network includes 61 editions of Cosmopolitan , 36 editions of Harper's Bazaar , 28 editions of Esquire and 12 editions of Good Housekeeping , all of which come under Yates' purview. In addition, he masterminds the design of all licensed products for the global group, including fragrance, fashion and restaurant concepts for those magazine brands with three-dimensional aspirations.\nCompared with some of his expatriate peers, from well-known magazine editors to big-name photographers, Yates may be the most low-profile, high-level Australian in the New York media scene. Is that intentional?\n\"Well, I don't know,\" he says, flummoxed by the notion that his own brand could benefit from mindshare. Yates reasons that his position is predicated on toiling behind the scenes; he's the Emerald City's real-life wizard of Oz. \"We're not the superstars in front, the editors of our local editions are.\"\nGlobal style-meister Yates says he learned self-reliance and confidence as an Australian boy who grew up with a father who was a stationmaster in Melbourne. \"I used to work in the summers with him,\" says Yates, who has taken those qualities into the glossy world of magazines. Supplied Nonetheless, he does have old-school presence. At 49, Yates has sandy-coloured hair, steel-grey blue eyes and the blithe comportment of a golden-age Hollywood luminary. On this day, he is dapper in a pale blue jacket, white shirt with French cuffs, olive-brown chinos and Gucci loafers, no visible socks.\nYates defines his role, diplomatically, as providing artistic oversight to the international editions. Considering that his kingdom spans Cosmo Kazakhstan , Harper's Bazaar Turkey and Esquire Taiwan , is anything ever lost in translation? \"Rarely, we've developed a certain way to communicate,\" he says.\nThe creative director has honed an elementary visual strategy that can be applied everywhere from Bulgaria to South Africa. Next to his uncluttered desk, on a pinboard, are postcard-sized versions of myriad magazine covers. \"It's really about defining each brand, what it looks like and feels like,\" Yates continues. \"We create style guides, colour palettes, font lists, and we define what a cover is for each of them.\"\nSo, no matter where you are in the world, a Cosmo cover star will appear \"confident, expressive and have amazing hair\". Posed against a vibrant backdrop, customarily clad in denim, lace or Lycra, Cosmo cover subjects embody a come hither attitude. Local mores do come into play. He says, \"In Malaysia and the Middle East, at certain times of the year like Ramadan, you need to have more skin covered and cap sleeves.\"\n\"We've developed a certain way to communicate,\" says Yates whose division publishes 285 magazines across 81 nations. As the empire looks for revenue-creation ideas, the Harper's Bazaar brand is opening a cafe in the Middle East. Portions will - appropriately - be small. Supplied Yates and his team of three review a staggering 3600 pages a month. Asked if he needs to approve every page, he says, \"We don't use the word approve. We say 'Beautiful, thanks very much' or 'Here are some suggestions on how to improve it'.\"\nTo amplify the Hearst gospel, Yates orchestrates annual bootcamps for its art directors. Recently, he staged two for the Harper's Bazaar team, meeting in Berlin and Hong Kong. Foreign editors and art directors are also summoned to New York for so-called \"brand immersion\".\n\"We pay special attention when we have redesigns or launches,\" Yates says. Right now, Harper's Bazaar Spain , which has a newly appointed editor-in-chief and creative department, is a focus for him. In 2011, Hearst Corp acquired Lagerdere SCA's nearly 100 magazines outside the French market, including Elle . Since then Yates' team has also been responsible for the expansion of those titles, including Elle Australia . \"I love what they're doing, and [art director] Carly Townsend is talented,\" he says.\nSteps to the peak Yates is a kind of Ban Ki-moon of the magazine sphere.\"It's really about defining each brand,\" he says of his job. \"We define what a cover is for each of them.\" Supplied Asked if he has any recognisable Australian traits, Yates says \"Self-reliance, confidence, being able to create your own destiny and goals – that was all instilled in me growing up.\"\nMost likely that emanated from his father, Tom Yates, a former station master at Flinders Street, who wrote about his experiences in a social history entitled, What a Journey: Life in the Victorian Railways 1948-1987 . \"I used to work in the summers with him,\" says Yates, of his only vocational experience in his native land.\nAfter graduating with a degree in advertising design from RMIT University, Yates ventured to Toronto in the late 1980s and remained for three years. He landed his first job at an agency, and was charged with producing ads for the stadium tours of artists such as Madonna and David Bowie. Flitting between New York and London, he designed album artwork for several record labels.\nIn 1993, he was appointed design director at Guitar World magazine in New York. Over the course of four years, he infused the stodgy title with a Euro-pop sensibility and garnered a prestigious design award from the Society of Publication Designers in the process. It was the first of many accolades that Yates would receive.\nIn 1998, he was recruited to be the design director of ESPN's inaugural magazine. \"I didn't know anything about American sports but you put your own spin on it,\" says Yates, who was at the title for six years. More plaudits followed, including one from the American Society of Magazine Editors. Yates was then approached by Conde Nast to work on Cargo , a men's shopping magazine. That groundbreaking title, arguably ahead of its time, existed for only two years. Following its closure, Yates established his own creative agency in SoHo, with clients including Bloomingdale's, Victoria's Secret, Kiehl's and Ritz-Carlton.\nRelentlessly ebullient, Yates clearly relishes the position he's occupied for the past six years. \"What's great about this job is that it's tied together a lot of my personal interests,\" he says. \"I like talking to people, I like sharing my knowledge, and I like travelling. It's a lot of day-to-day interaction with all of our international teams.\"\nYates is the Ban Ki-moon of the magazine sphere. \"It is like working at the United Nations,\" he says, smiling at the analogy. \"That's why this is the most fun job in the business.\"\nPerfume, eyewear and even a cafe But as eyeballs and advertisers shift online and to smartphones, legacy media companies are struggling with their relevance. Lately, glossy magazines have seriously lost their lustre. \"I don't think magazines are going away,\" Yates says, confidently. \"We have a community of readers that rely on them, and we deliver multiple avenues to get the content. Printed magazines are the incubator of ideas, art and quality content. They are the heart of our brands, and they fuel and inspire our extensions.\"\nNot surprisingly though, magazine publishers are actively searching for revenue-creation ideas. For HMI, one lucrative offshoot is licensing, which generates tens of millions of dollars each year.\n\"We're always thinking of ways to extend the brands – it's a natural progression,\" says Yates, wielding a prototype of a new Cosmopolitan fragrance for the British market. As the largest-selling young women's magazine in the world, Cosmopolitan has the most resonance of all the Hearst brands. Already, there is a Cosmo fashion collection (Central America), eyewear (Britain) and a potential beauty line on the horizon.\nOne of the most surprising branding enterprises is the Harper's Bazaar cafe debuting later this year in the Middle East. Fashion magazines, populated with women who adhere to a strict diet of kale, kombucha and cigarettes, are not especially known for promoting healthy eating habits. At the project's inception, Yates presented the Amsterdam-based architect and the local licensee with detailed mood boards of what a Bazaar canteen could be. \"The environment, the textures, the colours and the food. It needs to feel like something appropriate to this brand. It's small portions admittedly.\"\nGiven his globetrotting schedule, Yates will conceivably visit the café soon after it opens.\nYet even the most steadfast New Yorker needs time to unwind. Along with his longtime partner Ashok Sinha, a vice-president of global brand marketing at Starcom MediaVest Group, Yates escapes to Great Barrington, a picturesque town in the Berkshires in Massachusetts, three hours' north of New York.\n\"We renovated our first home there and now we're building a new one,\" Yates says, excitedly. \"Exiting the city is the best thing that ever happened to us. You're gardening, you're back to nature, and we have a whole community of friends.\"\nIn other words, it's the perfect respite from Manhattan's congested concrete canyons.", "external_links": [], "published": "2015-09-11T22:15:00.000+03:00", "crawled": "2015-09-11T23:10:49.197+03:00", "highlightTitle": ""}