{"organizations": ["Volkswagen"], "uuid": "ad8f058ab1cb12892a94e3afc5482635a71883e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/made-germany-lies-gutter-volkswagen-200625319.html", "country": "GB", "title": "'Made in Germany' lies in the 'gutter' after Volkswagen caught cheating", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "'Made in Germany' lies in the 'gutter' after Volkswagen caught cheating", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T23:06:00.000+03:00", "replies_count": 0, "uuid": "ad8f058ab1cb12892a94e3afc5482635a71883e0"}, "author": "", "url": "https://uk.finance.yahoo.com/news/made-germany-lies-gutter-volkswagen-200625319.html", "ord_in_thread": 0, "title": "'Made in Germany' lies in the 'gutter' after Volkswagen caught cheating", "locations": ["Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 22, 2015, 01:08 BST - UK Markets open in 6 hrs 52 mins 'Made in Germany' lies in the 'gutter' after Volkswagen caught cheating By Ambrose Evans-Pritchard | Telegraph – 4 hours ago 92.25 -1.60 \nVW's conspiracy to rig emissions exposes it as the 'Lance Armstrong' of the car industry, once again revealing corrupt reflexes in German boardrooms \nVolkswagen (Other OTC: VLKAF - news ) has suffered a shocking loss of credibility after conspiring to violate US pollution laws and dupe customers on a systemic scale. \nThe scandal has once again exposed a culture of corrupt practices at the top of German export industry. \n“We are facing a blatant abuse of consumer trust and a degradation of the environment,” said Jochen Flasbarth, the German state secretary in charge of pollution enforcement. \nThe scandal is intrinsically worse than the explosion of BP’s Deepwater Horizon drilling rig in the Gulf of Mexico in 2010. While BP and its contractors may have been negligent, VW appears to have engaged in a cynical plan to trick regulators in a wholesale breach of the US Clean Air Act. \n“It (Other OTC: ITGL - news ) is profoundly serious. The accusation is that VW deliberately set out to mislead regulators with a cleverly hidden piece of software,” said Max Warburton from AllianceBernstein. \nIt is of an entirely different character from earlier breaches of US law by Hyundai and Ford, which stemmed mostly from errors. The US Justice Department is weighing serious criminal charges. \n“‘Made (Paris: FR0010328302 - news ) in Germany’ in the gutter,” said German newspaper Bundesdeutsche Zeitung. \nThe financial daily Handelsblatt called the deception a “catastrophe for the whole of German industry”, warning that it had completely undermined a joint campaig n by Audi (Other OTC: AUDVF - news ) , BMW (Swiss: BMW.SW - news ) , Mercedes (Xetra: 710000 - news ) , Bosch (BSE: BOSCHLTD.BO - news ) and VW to convince Americans that diesel is no longer dirty and is the best way to meet tougher US emission standards. \nGermany is the world leader in clean diesel. Its car companies have bet heavily on the technology, hoping to win the strategic prize in the US as new rules come into force imposing fuel efficiency of 54.5 miles per gallon by 2025. \n\"We are worried that the justifiably excellent reputation of the German car industry and in particular that of Volkswagen will suffer,\" said Sigmar Gabriel, the country’s vice-chancellor and economy minister. \nVolkswagen’s own vow to become the “greenest” car producer in the world by 2018 has been exposed a hollow publicity stunt. \nTheoretically, the company could face fines of $18bn in the US, based on a standard penalty of $37,500 for each of the 482,000 cars fitted with \"defeat devices\", which allowed them to mask exhaust emissions of nitrogen oxide (NOx) in pollution control tests. \nThe actual release of these toxic particles blamed for emphysema and respiratory diseases is in reality 40 times above the acceptable levels imposed by the US Environmental Protection Agency. The cars will be recalled and modified, greatly reducing their fuel efficiency. \nThe US press is already calling VW the “Lance Armstrong” of the car market, an apt allusion to drug cheating in sport, and a deadly epithet in an industry where brand image and goodwill are the lifeblood of sales. \nVW’s share price crashed 19pc in Frankfurt . The company’s strategic ambition to dominate clean diesel sales in the US lies in ruins. \n“There is no way to put an optimistic spin on this. The best case for VW is probably still a multi-billion dollar fine, pariah status in the US, and damage to its leading position in diesel,” said Mr Warburton. \nThe suspicion is that other car companies with diesel models may also be cutting corners, much as the Libor scandal in the City of London (LSE: CIN.L - news ) revealed common practices by other parts of the banking industry. The US authorities said they would widen the probe to other manufacturers. \nMartin Winterkorn, VW’s chief executive, said he was “very sorry” and ordered an internal investigation but it is hard to see how he can survive. \nFerdinand Dudenhoeffer, from Germany’s Centre for Automotive Research, said Mr Winterkorn is either complicit or has failed to establish control over the corporation. “Either way, he is no longer viable. No politician could remain in his post in such circumstances. It is an unimaginable disaster,” he said. \nIt is barely a decade since it came to light that VW still 20pc owned by the state of Lower Saxony - had set up front companies in India and Czech Republic to win contracts. \nVolkswagen touched a raw nerve on the German Left by using slush funds to compromise union members on the works council with extravagant trips abroad and visits to brothels, at a time when the company was pushing through a wage freeze. That scandal led to a purge of senior management and a prison sentence for one member of the board. \nTransparency International in Berlin said VW scores a middling grade of 5.5 out of 10 for corporate purity, but refuses to offer any breakdown of its activities in each country where it operates. This can be a warning flag. “VW provides zero information on a country-by-country basis. We find this very important,” it said. \nVolkswagen is not the only German group that has lurched from scandal to scandal. The chairman of the engineering giant Siemens (BSE: SIEMENS4.BO - news ) was forced to resign in 2007 following the exposure of bribery on an epic scale, though the company has since sought to clean out the Augean Stables. \nA Siemens official revealed that he had run a bribery budget of €40m a year through a network of secret accounts from Venezuela, to Israel, Italy and Vietnam. He described overseas pay-offs as the company’s “business model”. \nSiemens was later fined $1.6bn in the US after pleading guilty to running slush funds. It then had to settle with the Greek authorities for bribing officials on a raft on contracts for the Athens Olympics in 2004. \nBribes were tax-deductible in Germany until 1997, reflecting the general attitude that whatever went on in foreign markets was fair game. The country has since tightened standards and scores relatively well in global corruption league tables. \nThe problem for Germany is that its global market niche is for expensive cars and machines, charging a premium for what is supposed to be the most reliable technology in the world. \nGermany’s other problem is that Berlin has been lecturing the rest of the eurozone for five years that the root cause of the continent's crisis is the failure of some countries in the monetary union to abide by the law. Southern Europeans might feel entitled to a moment of Schadenfreude.", "external_links": [], "published": "2015-09-21T23:06:00.000+03:00", "crawled": "2015-09-22T03:08:54.128+03:00", "highlightTitle": ""}