{"organizations": [], "uuid": "0d9117c8528393be42a853047cc13da3fb543e98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources1.news.com.au/images/2015/09/01/1227507/856153-e8d2188c-5045-11e5-8ffe-a0d4079a7abb.jpg", "site_section": "http://www.adelaidenow.com.au//business", "section_title": "Business News | Business and Finance News | The Advertiser", "url": "http://www.adelaidenow.com.au/business/reserve-bank-keeps-interest-rates-on-hold-at-2-per-cent-unmoved-by-global-share-market-upheaval/story-fnmxznqb-1227507856179", "country": "US", "title": "Reserve Bank keeps interest rates on hold at 2 per cent, unmoved by global share market upheaval", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Reserve Bank keeps interest rates on hold at 2 per cent, unmoved by global share market upheaval | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T23:28:00.000+03:00", "replies_count": 0, "uuid": "0d9117c8528393be42a853047cc13da3fb543e98"}, "author": "Paul Gilder", "url": "http://www.adelaidenow.com.au/business/reserve-bank-keeps-interest-rates-on-hold-at-2-per-cent-unmoved-by-global-share-market-upheaval/story-fnmxznqb-1227507856179", "ord_in_thread": 0, "title": "Reserve Bank keeps interest rates on hold at 2 per cent, unmoved by global share market upheaval", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE Reserve Bank has kept Australia’s cash rate on hold at 2 per cent, maintaining its wait-and-watch stance from the sidelines following a month of international sharemarket upheaval.\nRBA governor Glenn Stevens said the now four-month long pause on rates was “appropriate” given the state of play for Australia — a moderately growing economy and a broadly balanced growth outlook among its major trading partners.\nMr Stevens said the global economy was “expanding at a moderate pace”, with “further softening of conditions in China and east Asia” but “stronger US growth”.\nChanges from the RBA’s July statement were nuanced, with the US Federal Reserve now expected to raise its cash rate “over the period ahead” rather than “later this year”.\nAt home, the economy was experiencing “moderate” expansion as opposed to one that “has continued to grow”.\nThe decision came after Australian shares in August notched up their worst monthly performance since the global financial crisis. The benchmark ASX 200 index tumbled 8.6 per cent for the month as low oil prices, concerns about America’s impending rate rise and China’s unstable share markets put investors on edge.\nMr Stevens mentioned the market upheaval in passing, noting that “equity prices have moved lower and been more volatile recently, in parallel with developments in global markets”.\nHe also left out any overt reference to the need for a lower Australian dollar, with the currency having depreciated gradually against the US dollar throughout the course of the year.\nThe RBA governor has softened his tone on the currency in recent months, with today’s statement only reiterating its mantra from a month earlier that the dollar was “adjusting to the significant declines in key commodity prices”.\nThe Aussie, which drifted to US70.83c earlier in the morning, was fetching US71.34c shortly after the central bank’s 2.30pm announcement.\nA shift in the cash rate today was given virtually no chance by economists, with cash rate futures rating the probability of a 25 basis point cut at 6 per cent. History also shows that the RBA rarely moves in September, having last done so in 2008 in the early days of the global financial crisis and in 2001 prior to that.\nThe news came on a day packed with economic updates.\nApprovals for residential construction across the nation — a key measure of economic vitality — rebounded in July following a disappointing 5.2 per cent slide in June.\nApprovals for the construction of new homes rose 4.2 per cent in July, although the story was mixed among the subsectors.\nPrivate sector house approvals fell 3 per cent, while the ‘other dwellings’ category, which includes apartment blocks and townhouses, was up 6.1 per cent.\n“I think what’s surprising is the weakness in houses,” ANZ senior economist Felicity Emmett said.\n“It’s a little bit hard to get a feel for what’s driving that but, overall, the main driver of approvals recently has been that multi section, in particular the high rise, and that does look to be levelling off.”\nIn the 12 months to July, building approvals have risen a healthy 13.4 per cent, a positive sign according to economists.\nSeparately, the latest update on Australia’s balance of payments revealed the current account deficit had expanded to $19 billion in the three months to June, seasonally adjusted, from $13.5 billion a quarter earlier.\nThe nation’s surplus on goods and services fell 28 per cent to $6 billion in the June quarter from a quarter earlier, which was expected to shave 0.6 percentage points from growth in the quarter’s measure of gross domestic product, according to the Australian Bureau of Statistics.\nIt came as a growing number of economists warned that the nation was facing its first negative quarter of growth when June’s GDP figures are unveiled on Wednesday as a commodity price crunch softens the returns on Australia’s major exports such as iron ore.\nThat would open the door for the nation to slip into a recession, which is technically regarded as two consecutive quarters of negative growth.\nIn China, official figures revealed the pace of manufacturing activity in the world’s second biggest economy slumped to a three-year low in August, prompting a plunge in shares on the nation’s primary mainland exchange, the Shanghai Composite, and on Australia’s ASX 200.\n RBA waiting, watching, unmoved", "external_links": ["http://www.heraldsun.com.au/business/reserve-bank-keeps-interest-rates-on-hold-at-2-per-cent-unmoved-by-global-share-market-upheaval/story-fni0dcne-1227507856179"], "published": "2015-09-01T23:28:00.000+03:00", "crawled": "2015-09-01T09:42:38.837+03:00", "highlightTitle": ""}