{"organizations": [], "uuid": "cd31a819a9165fb89149a80f84b25aa53172082d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/14/canada-election-idUSL1N11K1EY20150914", "country": "US", "title": "Balanced budget for Canada's Harper overshadows corruption trial", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Balanced budget for Canada's Harper overshadows corruption trial | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T22:41:00.000+03:00", "replies_count": 0, "uuid": "cd31a819a9165fb89149a80f84b25aa53172082d"}, "author": "Julie Gordon", "url": "http://www.reuters.com/article/2015/09/14/canada-election-idUSL1N11K1EY20150914", "ord_in_thread": 0, "title": "Balanced budget for Canada's Harper overshadows corruption trial", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KAMLOOPS, British Columbia, Sept 14 Good news about the economy propelled Canadian Prime Minister Stephen Harper on the campaign trail on Monday, with an earlier-than-expected budget surplus overshadowing the trial of a former aide for influence peddling.\nTrumpeting a C$1.9 billion ($1.4 billion) budget surplus for the year just passed - the first surplus in seven years for Harper's nine-year-old Conservative government - the prime minister said his opponents in the race to the Oct. 19 election will turn the good news into bad if they topple him from office.\n\"The Liberals and the NDP are making spending promises, tens of billions of dollars of spending promises, with money they do not have, and money they can only get through running ongoing multi-billion dollar deficits and raising your taxes,\" Harper told supporters during a campaign stop in British Columbia.\n\"Make no mistake. That will hurt our fragile economy, that will cost you money, and that will put jobs at risk.\"\nLiberal leader Justin Trudeau, who has said he would run deficits if elected to help spur Canada's sluggish economy, accused Harper of playing a shell game of covert cuts and underspending in some areas to produce a surplus on paper.\nWhile economists said the early surplus, one year ahead of promised, was meaningless to financial markets, it allowed Harper to switch gears after a stream of bad news in the first half of the tight three-way election campaign.\nMost polls show his right-leaning Conservative government locked in a three-way race against the center-left Liberals and New Democrats in a campaign that has focused on the nation's tepid economy, the global refugee crisis, and the high-profile corruption and fraud trials of Harper's former allies.\nA former Harper aide went on trial for influence-peddling on Monday in Ottawa, adding to the scandal that has helped undermine the Conservatives. They have already weathered the high-profile bribery and fraud trial of a Conservative senator in August.\nBruce Carson, who worked as a policy advisor to Harper from 2006 to 2008, is charged with improperly lobbying the federal Indian Affairs ministry in 2010 and 2011 over the proposed sale of a water filtration system to an aboriginal group.\nCarson, who pleaded not guilty, says he was not acting for any one company in particular but was interested in improving the poor conditions that many aboriginals have to endure.\n($1 = 1.3262 Canadian dollars) (Additional reporting by Randall Palmer , David Ljunggren and Leah Schnurr in Ottawa; Writing by Andrea Hopkins ; Editing by Christian Plumb )", "external_links": [], "published": "2015-09-14T22:41:00.000+03:00", "crawled": "2015-09-14T22:02:43.961+03:00", "highlightTitle": ""}