{"organizations": [], "uuid": "bc5032043a549e455b49d11cf0004af6f9aff83b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/stocks-300.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/blogs/is-it-wise-to-invest-during-a-stock-market-crash/142629", "country": "IE", "title": "Is it wise to invest during a stock market crash?", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Is it wise to invest during a stock market crash? | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T22:41:00.000+03:00", "replies_count": 0, "uuid": "bc5032043a549e455b49d11cf0004af6f9aff83b"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/blogs/is-it-wise-to-invest-during-a-stock-market-crash/142629", "ord_in_thread": 0, "title": "Is it wise to invest during a stock market crash?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Japan is a safe country, a myth and reality: Different faces of crimes in Japan Individual Accountability in the Financial Industry – Should we take the plunge? FOMC preview: Keep calm and trust Janet Yellen Before I answer the question I have posed, let’s look at what has been plaguing the global markets and impacting the Indian market. The devaluation of the Chinese yuan has left the world markets jittery, wiping off the gains made by many world markets in the last one year. With the slowing of China’s economy and the possibility of interest rate hikes by the US Federal Reserve, foreign institutional investors are selling off their positions in emerging markets, such as India, to take refuge in safer havens in the United States. Moreover, the high valuations of Indian stocks and slow pace of economic reforms have made matters worse.\nSo, how should you, an Indian investor, behave in such a shaky scenario?\nAvoid panic selling\nMarkets fluctuate, but over the long run, markets only rise in line with the economy. From a long-term perspective, a market crash can be a good opportunity for buying good quality stocks at cheap prices. It is also a certainty that stocks with strong fundamentals will rebound faster than others after the panic subsides. Experiences of previous market downturns have shown that most of the stocks with strong fundamentals regained their losses much faster than the market indices.\nHowever, most of the investors end up doing the exact opposite of what is required. Driven by continuous flow of scary information from financial media and securities industry, investors panic and sell instead of buy. When you sell during a market crash, you sell low, leading to a significant impact on your ability to create wealth over the long run.\nLook for good deals\nWhen a market is undergoing correction or even when it crashes, the first thing that an investor should do is look for good deals. This is the time when share prices of a lot of strong companies fall down for no apparent reason other than the over-all market sell-off. So, if you are an agile investor, divert some money from your fixed-income instruments to stocks. However, tread carefully, keeping sufficient reserves of cash or other liquid instruments to take care of further falls. If one has money to put away for five years, such market crashes provide a good opportunity to make money.\nStay put with mutual funds\nMutual fund investors should continue with their existing systematic investment plans (SIPs) during the market crash. With every purchase made during the market dip, the average cost of units goes down which would ultimately increase the longer-term profitability of your investments. Note that the average cost of units for an SIP investor can be lower that of a lump-sum mutual fund investor.\nLet us look at how two SIPs performed during the two biggest crashes that took place in the history of BSE Sensex . First, on 4 April 2000, the Sensex dropped by 361 points and second, on 21 January 2008, when it lost 1744 points.\nAvoid timing the market\nWhile it may seem simple to time the market, it is easier said than done. If you miss the crash, you also miss the recovery that follows the crash. To make market timing successful, you need to successfully predict when to get into the market and when to get out. If you are a novice at investing, I would suggest that you stay clear of this guesstimate as even professionals have a tough time getting the timing right. As legendary investor Peter Lynch said, “More money has been lost trying to anticipate and protect from crashes than actually in them.”\nKnow your investments\nYou should only invest in quality stocks with good balance sheets or growth history. You can go for a professional financial advisor who can help you manage the portfolio. An alternative would be to invest in mutual funds as they have professional fund managers supported by dedicated research teams, who decide on your behalf which stocks to invest in and which to avoid. Mutual funds would also provide you the benefit of diversification at a much lower cost. Investing in mutual funds requires less effort and time, experience and specialized knowledge to get good returns than what is required in case of directly trading in equities.\nNow, to answer the question I began with, India is still a growth story with stronger macro-economic fundamentals than many emerging markets. With a growing middle-class, improving governance and decreasing commodity and oil prices, India story is here to stay, and the present turmoil can only be a good opportunity for investors who missed out on the previous market rallies.\nDisclaimer: Naveen Kukreja is Managing Director at Paisabazaar.com. The views expressed here are personal.\n 28, 2015 2:41 pm © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-09-28T22:41:00.000+03:00", "crawled": "2015-09-28T20:26:44.776+03:00", "highlightTitle": ""}