{"organizations": ["Loan Retail Opportunity Investments Corp", "Retail Opportunity Investments Corp"], "uuid": "53b3dd5d293b8d6ffa38b12e43c1a539a9a330fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/213562?filename=213562.gif&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/17/Financing%20Agreements", "section_title": "GlobeNewswire: Financing Agreements", "url": "http://globenewswire.com/news-release/2015/09/30/772115/10151105/en/Retail-Opportunity-Investments-Corp-Closes-on-300MM-Unsecured-Term-Loan.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "country": "US", "title": "Retail Opportunity Investments Corp. Closes on $300MM Unsecured Term Loan", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Retail Opportunity Investments Corp. Closes on $300MM Unsecured Term Loan", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T12:00:00.000+03:00", "replies_count": 0, "uuid": "53b3dd5d293b8d6ffa38b12e43c1a539a9a330fb"}, "author": "", "url": "http://globenewswire.com/news-release/2015/09/30/772115/10151105/en/Retail-Opportunity-Investments-Corp-Closes-on-300MM-Unsecured-Term-Loan.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "ord_in_thread": 0, "title": "Retail Opportunity Investments Corp. Closes on $300MM Unsecured Term Loan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Retail Opportunity Investments Corp. Closes on $300MM Unsecured Term Loan September 30, 2015 05:00 ET | Source: Retail Opportunity Investments Corp. \nSAN DIEGO, Sept. 30,   Retail Opportunity Investments Corp. (NASDAQ: ROIC ) announced today that it has closed on a new, $300 million unsecured term loan. The new loan has an initial maturity date of January 31, 2019, with two one-year extension options, and bears interest at a rate of LIBOR plus 110 basis points. Additionally, the new loan has an accordion feature, allowing the company to increase the loan amount to $500 million, subject to commitments and other customary conditions. ROIC utilized the proceeds from the new loan to reduce borrowings outstanding under its unsecured revolving credit facility. \nMichael B. Haines, Chief Financial Officer of Retail Opportunity Investments Corp. stated, \"We continue to fund our portfolio growth through a balance of equity and debt capital raising initiatives. Year-to-date, we have raised over $400 million of capital, including $101.3 million of equity proceeds through a combination of our ATM program and our recent public stock offering. In terms of debt, this new $300 million loan serves to term-out and reload our credit facility. In addition to paying down our credit line, we have also retired $29.0 million of secured debt, year-to-date, and all of our shopping center acquisitions this year have been unencumbered. As a result, today approximately 95% of our portfolio's gross leasable area is unencumbered. Going forward, we believe that with our strong balance sheet and investment-grade profile we are well-positioned to continue prudently funding our growth objectives.\" \nKeyBanc Capital Markets Inc. and U.S. Bank National Association were lead arrangers for the new term loan. Other participants included Bank of America, N.A., Bank of Montreal, Capital One, National Association, Citibank, N.A., Citizens Bank, National Association, JPMorgan Chase Bank, N.A, PNC Bank, National Association, Regions Bank, Royal Bank of Canada and Wells Fargo Bank, National Association. ABOUT RETAIL OPPORTUNITY INVESTMENTS CORP. \nRetail Opportunity Investments Corp. (NASDAQ: ROIC ), is a fully-integrated, self-managed real estate investment trust (REIT) that specializes in the acquisition, ownership and management of grocery-anchored shopping centers located in densely-populated, metropolitan markets across the West Coast. As of June 30, 2015, ROIC owned 64 shopping centers encompassing approximately 7.7 million square feet. ROIC is the largest publicly-traded, grocery-anchored shopping center REIT focused exclusively on the West Coast. ROIC is a member of the S&P SmallCap 600 Index and has investment-grade corporate debt ratings from Moody's Investor Services and Standard & Poor's. Additional information is available at: www.roireit.net . \nWhen used herein, the words \"believes,\" \"anticipates,\" \"projects,\" \"should,\" \"estimates,\" \"expects,\" \"guidance\" and similar expressions are intended to identify forward-looking statements with the meaning of that term in Section 27A of the Securities Act of 1933, as amended, and in Section 21F of the Securities and Exchange Act of 1934, as amended. Certain statements contained herein may constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results of ROIC to differ materially from future results expressed or implied by such forward-looking statements. Information regarding such risks and factors is described in ROIC's filings with the SEC, including its most recent Annual Report on Form 10-K, which is available at: www.roireit.net . Ashley Bulot, Investor Relations 858-255-4913 Related Articles", "external_links": [], "published": "2015-09-30T12:00:00.000+03:00", "crawled": "2015-09-30T14:59:01.596+03:00", "highlightTitle": ""}