{"organizations": [], "uuid": "9ec86915ed9c2e8a5b6728585089b6f89fa0ded8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/n/m/0/7/image.related.afrArticleLead.620x365.gjrvv7.png/1442903835364.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/world/why-so-gloomy-on-china-hotels-wine-and-ikea-all-doing-great-20150921-gjrvv7", "country": "AU", "title": "Why so gloomy on China? Hotels, wine and IKEA all doing great", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why so gloomy on China? Hotels, wine and IKEA all doing great | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T08:34:00.000+03:00", "replies_count": 0, "uuid": "9ec86915ed9c2e8a5b6728585089b6f89fa0ded8"}, "author": "Angus Grigg", "url": "http://www.afr.com/news/world/why-so-gloomy-on-china-hotels-wine-and-ikea-all-doing-great-20150921-gjrvv7", "ord_in_thread": 0, "title": "Why so gloomy on China? Hotels, wine and IKEA all doing great", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "While consumption was once skewed towards the luxury end, these days it's happening firmly in the middle market. Bloomberg Share on twitter by Angus Grigg Nobel laureate Paul Krugman says the Chinese government has \"no idea\" about economic policy and Citigroup is forecasting Beijing will push the world into recession, yet for those of us living on the mainland it's hard to be so gloomy.\nOn a recent afternoon in Shanghai after watching a Porsche and two Audi's jostle for right of way, a hotel manager told me business had rarely been better.\n\"We're having our best year since 2010,\" he said.\nThat's pretty surprising given hotel occupancy rates are often seen as a barometer for economic activity and according to the \"experts\" China is melting down.\nSo I checked for a wider measure and sure enough STR Global , which compiles data for the hotel industry, said occupancy rates were approaching 70 per cent in Shanghai.\nThat's the best performance since World Expo was in town five years ago. STR recorded similarly strong performances in 11 of the 14 other Chinese cities it monitors.\nSo what's going on? Is China booming or going bust?\nWell that's the thing, neither actually.\n It's just that analysts have rarely been more divided on the prospects for the Chinese economy.\nAs a general rule, economists outside China or those who have not spent long periods of their career in the country, see dark shadows everywhere.\n\"We consider China to be at high and rapidly rising risk of a cyclical hard landing,\" said Citigroup's chief economist Willem Buiter .\nBuiter, whose resume makes no mention of China, sites the usual problems of debt, over-capacity and an asset price bubble as the main factors which will bring down China and the wider-world over the next two years.\nBy contrast the likes of Andy Rothman from fund manager Matthews Asia, believe these problems can be managed and China is making a successful transition to a consumer led-economy.\n\"China's remains the world's best consumption story,\" says Rothman, who has spent 20 years in an around China.\n\"In the first half of this year consumption accounted for 60 per cent of China's growth.\"\nThe Rothman view of China, which this column sympathises with, believes Beijing can muddle through.\nIt won't be pretty, there will be plenty of false starts and mixed messages from the leadership, but ultimately the Communist Party will do enough on reform to keep the place afloat.\nIt's a view which also believes the private sector has been given enough room to innovate and grow and more room will gradually be made available over the coming years.\nIn addition to this longer term view, it's also hard to forecast China's demise when there's such strong evidence of buoyant consumer activity on the ground.\nIt's not just the proliferation of espresso bars and yoga studios in my Shanghai neighbourhood, but the changing face of consumerism in China.\nWhile consumption was once skewed towards the luxury end, as business greased the wheels of government with lavish gifts, these days it's happening firmly in the middle market.\nExamples abound. Earlier this month IKEA said China was its fastest growing market with sales up 18 per cent.\nIt's the same for vitamin maker Blackmores, which saw profits climb 83 per cent last year mainly due to booming shipments to China.\nThe list goes on to include Treasury Wine Estates (its China sales volumes were up 36 per cent in the year to June) to Apple and Nike who are also enjoying a bump from the strength of China's consumers.\nAnd that's even before you consider the foreign hotels, restaurants and tour operators which have benefited from the 100 million Chinese tourists who travelled overseas last year.\n\"Chinese tourists are not just travellers but also shoppers. This shows people are optimistic on the outlook for the economy,\" said Premier Li Keqiang while noting the number of outbound tourists rose 10 per cent in the first half of this year.\n\"Without a stable income Chinese people dare not to spend money.\"\nThis is not to say China does not have a difficult transition to make, but it is hard to account for such strong spending if the economy was locked in a downward spiral.\nThe publishers of the China Beige Book, which surveys 2,000 firms in China each quarter, hold a similar view.\n\"Perceptions of China may be more thoroughly divorced from facts on the ground than at any time in our nearly five years of surveying the economy,\" CBB President Leland Miller wrote in a report on Monday.\n\"Global sentiment on China has veered sharply bearish - too bearish.\"\nZhang Xin the co-founder and chief executive of property group Soho is in furious agreement.\n\"Sentiment is always exaggerated whether it's positive or negative. Right now it's negative,\" she said at a press conference on Monday.\nZhang said the stock market was pricing in a collapse of Hong Kong listed property developers, which were trading at half their underlying asset value.\n\"I don't believe … we are facing a collapse we are facing a slow down.\"\n\"The market has way way exaggerated on the negative side.\"", "external_links": ["https://www.strglobal.com/", "https://twitter.com/https://twitter.com/AngusGrigg"], "published": "2015-09-22T08:34:00.000+03:00", "crawled": "2015-09-22T20:43:21.476+03:00", "highlightTitle": ""}