{"organizations": ["The Economic Times App", "Reserve Bank of India", "TNN"], "uuid": "800f3fde8f8965c418bfcde1b85a9f9c33cd91ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48768744,width-600,resizemode-4/new-rs-1000-notes-with-more-security-features-coming-soon.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/1286551815.cms", "section_title": "Finance-Economy-News-The Economic Times", "url": "http://economictimes.indiatimes.com/news/economy/finance/new-rs-1000-notes-with-more-security-features-coming-soon/articleshow/48768709.cms", "country": "IL", "title": "New Rs 1,000 notes with more security features coming soon", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "New Rs 1,000 notes with more security features coming soon", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T07:54:00.000+03:00", "replies_count": 0, "uuid": "800f3fde8f8965c418bfcde1b85a9f9c33cd91ba"}, "author": "", "url": "http://economictimes.indiatimes.com/news/economy/finance/new-rs-1000-notes-with-more-security-features-coming-soon/articleshow/48768709.cms", "ord_in_thread": 0, "title": "New Rs 1,000 notes with more security features coming soon", "locations": ["Singapore", "CHENNAI"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Rs 1,000 notes with more security features coming soon By TNN | 2 Sep, 2015, 10.24AM IST \"We have already issued Rs 500 notes with such security features in limited quantities from our currency chests,\" a senior RBI official said. () ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! CHENNAI: The Reserve Bank of India would soon start issuing Rs 1,000 notes with enhanced security features. These notes would come with the rupee symbol and inset letter 'L' with numerals in ascending size in number panels. Officials from RBI said the objective is to increase security features for such legal tender. \"We have already issued Rs 500 notes with such security features in limited quantities from our currency chests,\" a senior RBI official said. \"The idea of incorporating numerals in ascending size in numeral panels is to prevent forgery or counterfeit and public should not get confused if they see numerals in ascending size in the number panel,\" the official said. The practice of incorporating numerals in ascending size in currency note is an important security feature that is adopted in countries like Singapore . \"Such features will also help detect the genuine notes from fake ones,\" the official said. As per the RBI annual report for 2014-15, notes of denominations of Rs 500 and Rs 1,000 together accounted for approximately 85% of the total value of banknotes in circulation at the end of March 2015. In volume terms, notes of 10 and 100 together accounted for 54% during the period ending March 2015. During 2013-14, notes of Rs 500 and Rs 1,000 together accounted for 84% of the total value of banknotes in circulation while in volume terms, legal tender of 10 and 100 together accounted for 53.6% of total currency in circulation. The new 1,000 notes that will be issued are in the Mahatma Gandhi Series- 2005. Such currency with numerals in ascending size in numbering panels have already been put in circulation for 100 notes earlier. Stay on top of business news with The Economic Times App. Download it Now!", "external_links": [], "published": "2015-09-02T07:54:00.000+03:00", "crawled": "2015-09-02T09:59:08.956+03:00", "highlightTitle": ""}