{"organizations": ["Suraj Prakash", "Health Insurance Company", "Suraj Prakash Sep"], "uuid": "54e3c57b90f5473340f931e0d9814f2806fc88e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/71", "section_title": "Artipot: Finance > Insurance Articles", "url": "http://www.artipot.com/articles/1929702/do-child-plans-provide-health-coverage-too.htm", "country": "US", "title": "Do Child Plans Provide Health Coverage Too? (Suraj Prakash)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Do Child Plans Provide Health Coverage Too? (Suraj Prakash)", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T10:03:00.000+03:00", "replies_count": 0, "uuid": "54e3c57b90f5473340f931e0d9814f2806fc88e2"}, "author": "", "url": "http://www.artipot.com/articles/1929702/do-child-plans-provide-health-coverage-too.htm", "ord_in_thread": 0, "title": "Do Child Plans Provide Health Coverage Too? (Suraj Prakash)", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Suraj Prakash Sep 3, 2015 No doubt you have planned a secured future for your child. You have invested funds in real estate, have bought mutual funds and even bought an insurance plan to make sure his needs are fulfilled when you are unable to do. But have you considered the health aspect of your child's life? Probably not.When you are looking for a child plan do not just consider the events like higher education, marriage and a commercial venture instead look for the other side of the coin too. Do look for the options that can provide protection if in case the child needs medical attention.What are the options?Health insurance policy: You would have definitely thought about covering your child in a policy when you had bought Best Health Insurance Policy in India for yourself. There is option to either buy individual health coverage for your child or to buy a family floater plan in which not just your child would get coverage but your spouse would be eligible too.Child plans with critical illness rider: Another best way to acquire financial protection for medical exigencies in case of your child is to buy child plan that has critical illness benefit as rider attached to it. It does not cover anything else but specifically expenses made on treatment of critical illnesses.The illness can be one of the listed critical illnesses with the insurance company you have bought your child plan from.In case there is presence of any serious illness in one's family history, it would be wise to get coverage against it.The savings you are putting in the plan turn out to be helpful when you have to pay hefty amount for the treatment and in turn it can help you save more for the child and the family.The sum insured amount under critical illness rider is different from the basic sum insured of the Child Insurance Plan.It is disbursed over and above the sum insured of the policy by some of the insurance companies. While some of the insurance companies after disbursing the sum insured under critical illness rider, revise the sum insured to be paid on the policy. Also, once critical illness is diagnosed, the insurance company pays the entire critical illness sum insured amount within a specified time period whether or not it equals to the cost of medical treatment.Hospital cash benefit rider: This rider becomes active when the insured is hospitalized for more than 2-3 days. It pays daily hospital cash amount to the insured. There are conditions attached to the rider by insurance companies in their own ways. For example, the amount paid can be a proportion of the room rent or the actual amount described in the policy or whichever is lower. About the Author Author is wants to explain about the importance of health insurance. What is the main benefits of health insurance the author wants to share her thought.Bima Zones is leading Health Insurance Company in India offers health insurance. Secure your Child with Best Child Plan Policy Rating:", "external_links": [], "published": "2015-09-03T10:03:00.000+03:00", "crawled": "2015-09-04T08:50:30.326+03:00", "highlightTitle": ""}