{"organizations": [], "uuid": "b2362fd35013a8e19ba9fc9a06c8bd755ec33c94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/commodities-gold-falls-metals-endure-165300717.html", "country": "GB", "title": "Commodities: Gold falls, base metals endure further punishment", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Commodities: Gold falls, base metals endure further punishment", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T19:53:00.000+03:00", "replies_count": 0, "uuid": "b2362fd35013a8e19ba9fc9a06c8bd755ec33c94"}, "author": "", "url": "https://uk.finance.yahoo.com/news/commodities-gold-falls-metals-endure-165300717.html", "ord_in_thread": 0, "title": "Commodities: Gold falls, base metals endure further punishment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "11.25 0.00 \nLONDON (ShareCast) - (ShareCast News) - Gold (Other OTC: GDCWF - news ) declined while base metals faced another European session in negative territory on Wednesday, as nagging doubts over China's economic prospects continued to weigh on trading sentiment. Positive US jobs and mortgage data bolstered confidence in the dollar which rose against a basket of currencies , sending safe haven demand for gold into reverse gear. At 1501 BST, COMEX gold for December delivery was down 0.15% or $1.50 at $1,138.30 an ounce, while spot gold was down 0.20% or $2.10 at $1,138.17 an ounce. \nHowever, COMEX silver was up 1.06% or 16 cents at $14.78 an ounce, while perception of supply-side correction sent spot platinum higher by 1.00% or $10.07 to $1,012.60 an ounce. \nMeanwhile, base metals continued to flag up wider market volatility caused by China's correction. The country still consumes approximately half of the world's iron ore , 48% of aluminium , 46% of zinc and 45% of copper . \nPast the midway point of trading on the London Metal Exchange, all major futures contracts, except tin (up 5.4%), were trading lower. Three-month delivery contracts of primary aluminium (down 0.2%), copper (down 0.3%), lead (down 0.4%), nickel (down 1.8%) and zinc (down 1.8%) saw moderate to sharp declines. \nCopper was flagged up as major concern by analysts at Deutsche Bank (Other OTC: DBAGF - news ) . \"China's copper demand grew at a compound annual growth rate (CAGR) of 7.5% in the period 2010 - 2014. We estimate the CAGR between 2014 to 2020 to be lower at 3%, with slowing demand growth across all sectors, chiefly construction and electrical,\" they said in a note to clients. \nSucden Financial analysts also saw \"more angst over China\" weighing on sentiment. \nLiz Grant, a senior account executive, said: \"Despite opening higher on Tuesday; it was not long before the markets started to drift into negative territory. The exception is tin, which has motored higher, as positive fundamentals together with a 250mt drop in LME stocks continue to be supportive.\" Oil benchmarks continued to grapple with exceptional volatility. Both Brent and WTI rose 8% on Monday, only to plummet by over 10% and 7% on Tuesday, and saw wild swings for much of the Asian and European session on Wednesday. \nAt 1539 BST, the Brent front month futures contract was down 0.81% or 40 cents to $49.16 per barrel, while the WTI was down 1.85% or 84 cents at $44.57 per barrel, in constant intraday fluctuation mode. \nKevin Norrish, senior analyst at Barclays (LSE: BARC.L - news ) , said surplus in the petroleum market was becoming increasingly evident in refined products. \"The upcoming autumn refinery maintenance season could help slow the refined product builds, given that underlying oil demand growth remains strong. However, this should cause crude inventories to swell again, unless non-OPEC supply cuts are swift enough.\" For the moment, Barclays is maintaining its expectation for continued price appreciation in the balance of the year, but the bank acknowledged several downside risks related to OPEC and non-OPEC supplies, as well as China's growth pattern. \nFinally, major agricultural commodities futures mirrored wider market trends. CBOT corn (down 0.34%), wheat (down 1.18%), ICE cocoa (down 0.22%), cotton (down 0.91%) and CME live cattle (down 0.60%) contracts were firmly in negative territory.", "external_links": [], "published": "2015-09-02T19:53:00.000+03:00", "crawled": "2015-09-02T20:26:50.023+03:00", "highlightTitle": ""}