{"organizations": [], "uuid": "cec498140ba469d2cf23ba1483f8a442fde7c373", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/pension-isas-encourage-pensioners-buy-220046513.html", "country": "US", "title": "'Pension Isas' will encourage pensioners to buy Lamborghinis", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "'Pension Isas' will encourage pensioners to buy Lamborghinis", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T01:00:00.000+03:00", "replies_count": 0, "uuid": "cec498140ba469d2cf23ba1483f8a442fde7c373"}, "author": "", "url": "https://uk.finance.yahoo.com/news/pension-isas-encourage-pensioners-buy-220046513.html", "ord_in_thread": 0, "title": "'Pension Isas' will encourage pensioners to buy Lamborghinis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 29, 2015, 23:58 BST - UK Markets closed 'Pension Isas' will encourage pensioners to buy Lamborghinis By Katie Morley | Telegraph – 58 minutes ago 1,179.00 -21.00 \nSteve Webb, a former pensions minister, has warned the Chancellor not to introduce new \"Pension Isas\" \nThe architect of the new pension freedoms has warned the Chancellor not to introduce \"pension Isas\", amid fears the move will encourage savers to empty their pension pots. \nThe prediction by Steve Webb, a former Pensions Minister who first acknowledged that pensioners could spend their pots on Lamborghinis, comes on the final day of a major Treasury inquiry into whether the British pension tax system needs drastically modernising. \nPensions Isas, which could be introduced as early as next year if they are approved, would make pensions more like Isas by scrapping tax relief on pension contributions and letting over-55s withdraw money without paying income tax. \nThey are among a number of new, radical options being considered by the Government. \nIn April, the Government introduced new freedoms to allow older savers to take up to 100pc of their pension as cash, a move in which Mr Webb said affluent retirees would be free to blow their pension pot on a big purchase such as a sports car, even if they end up relying on the state for support. \nHowever, because in practice they face eye-watering tax bills on large withdrawals, the vast majority of savers have refrained from spending their nest eggs on luxuries. \nWriting for the Telegraph online today, Mr Webb said: \"The taxation of pension incomes provides a 'brake' on the Lamborghini. Having to pay tax makes you think twice about withdrawing the lot in one go; if pensions are tax free, what would hold you back?\" \nSharing his response to the Government consultation, Mr Webb warned that a move to so-called “pension Isas” could undermine long-term saving and cost the UK years of progress towards savers achieving a comfortable retirement. \nInstead Mr Webb has asked the Government to introduce a new 33pc tax relief on pensions for every saver - a move which favours modest earners who currently get 20pc tax relief and penalises higher rate taxpayers who currently enjoy 40pc tax relief on pension contributions. \nFrank Field, Chairman of the DWP Select Committee suggested the consultation could result in \"the biggest tax cutting strategy ever conceived\" in which pension tax relief could be scrapped all together to save £30bn. This, he said, could would save enough to lower the basic rate of income tax from 20pc to 13pc. \nHe said: \"The current system is massively expensive to the taxpayer and mainly benefits a small minority of wealthy savers. Scrapping pension tax relief could also be a very effective way of cutting the UK’s deficit.\" \nTomorrow the Government will begin pouring over a number of new options which will see savers taxed very differently. \n• Pension freedoms: 2.2m face charges to access money • The pension freedom mistake that will halve your pension pot \nTom McPhail, head of policy at Hargreaves Lansdown (LSE: HL.L - news ) , a pension firm, said: “I am very confident that a massive change is on the horizon because the current system is very expensive - and complicated.\" \nThe findings of the consultation are expected to be revealed in George Osborne's Autumn Statement, which will be delivered later this year. \nMeanwhile Prudential, one of Britain’s biggest pension firms, announced that it had granted millions of customers the ability to use their pensions like a bank account without paying for expensive financial advice. Those wishing to spend their funds freely would previously have needed to pay for financial advice, which can cost up to £3,000. \nkatie.morley@telegraph.co.uk", "external_links": [], "published": "2015-09-30T01:00:00.000+03:00", "crawled": "2015-09-30T01:59:09.003+03:00", "highlightTitle": ""}