{"organizations": [], "uuid": "d2300a75737eaa83c8134d88f784110a46949c2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/w/4/u/u/image.related.afrArticleLead.620x365.gjw4we.png/1443413876893.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/personal-finance/why-its-too-late-to-sell-mining-stocks-but-not-too-early-to-buy-20150927-gjw4we", "country": "AU", "title": "Why it's too late to sell mining stocks but not too early to buy", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why it's too late to sell mining stocks but not too early to buy | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T12:00:00.000+03:00", "replies_count": 0, "uuid": "d2300a75737eaa83c8134d88f784110a46949c2a"}, "author": "Steve Johnson", "url": "http://www.afr.com/personal-finance/why-its-too-late-to-sell-mining-stocks-but-not-too-early-to-buy-20150927-gjw4we", "ord_in_thread": 0, "title": "Why it's too late to sell mining stocks but not too early to buy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An elderly investor takes notes on a stock trading floor in a Shanghai. by Steve Johnson China's economy had me puzzled back in 2011. My understanding was that the country's growth miracle was founded on exporting cheap goods and labour to the rest of the world. That, presumably, would make it highly dependent on global GDP growth.\nYet as the United States and Europe – which combined, make up some 50 per cent of global GDP – were muddling their way through the worst recession since the 1930s, China was reporting economic growth of well in excess of 10 per cent per annum. How is it possible for an export-driven economy to grow at double-digit rates when its main trading partners are shrinking?\nAs an Australian fund manager, I needed to answer that question. China's hectic growth was driving voracious demand for Australian resources. That, in turn, was propping up our economy and sending resources stocks (we didn't have one in the portfolio) to stratospheric heights.\nMy research uncovered all the usual bull and bear arguments. The bulls argued that China's migration of its population from unproductive peasants to educated city-dwellers had many decades to run, and that China's GDP per head was still a small fraction of that in the US or Japan. The most common bear argument seemed to be that a communist government could never create a first-world economy.\nNone of this made much sense to me. If all you needed was hundreds of millions of rural workers and a large gap between your GDP and America's, then India and Indonesia should also be growing as fast as China. And, as for the Communist Party, they made a decent fist of it over the prior 30 years. In fact, the ability to build decent roads and airports seemed something of an advantage when compared with the dysfunctional political system in the US (or Australia, for that matter).\nThen I stumbled across research by Michael Pettis, a professor at Peking University in Beijing.\nIt's the investment, stupid First, Pettis outlined what was happening in China's economy. Net exports had indeed fallen, from 8 per cent of GDP in 2008 to 4 per cent in 2009, but even the 8 per cent was much smaller than I had expected for an \"export-driven\" economy. That went some way to explaining why the global recession wasn't pounding China's economy. It turns out China's economy was (and is) investment-driven, with half of its GDP comprised of spending on roads, buildings, airports and the like. The fall in net exports was more than offset by an increase in construction, fired by government stimulus and associated debt.\n That gave me a much better understanding of China's growth model. What he explained next, however, was the crucial part. Pettis said there was nothing unique about China's \"miracle economy\". And that every other economy that had grown in a similar fashion had eventually come unstuck.\n\"In all previous cases of countries following similar growth models, the dangerous combination of repressed pricing signals, distorted investment incentives and excessive reliance on accelerating investment to generate growth has always eventually pushed growth past the point where it is sustainable, leading always to capital misallocation and waste. At this point – which China may have reached a decade ago – debt begins to rise unsustainably,\" he said.\n\"China's problem now is that the authorities can continue to get rapid growth only at the expense of ever-riskier increases in debt. Eventually either they will choose sharply to curtail investment, or excessive debt will force them to do so. Either way we should expect many years of growth well below even the most pessimistic current forecasts. But not yet. High, investment-driven growth is likely to continue for at least another two years.\"\nYou may have read or seen some of the exposés of China's ghost cities. I didn't have any resources stocks to sell but, after deeper digging into the topic, I started preparing for the tsunami to come. We bought ASX-listed stocks with exposure to foreign currencies. We avoided anything with exposure to the wider mining sector. And we sought new ways to invest offshore.\nIf you are going to panic, panic early Today China's economic problems are on the front page of newspapers around the world. Every week we see a new factory output statistic or Purchasing Managers Index that tells us the slowdown might be more of the hard variety than the soft. That wouldn't surprise me one iota. But today's investors face a dilemma.\nSure, you can sell your Rio Tinto shares because the China dream is over. But you will be selling them for $40 each, not the $85 they were changing hands for in 2011. You can sell your BHP Billiton shares, but you'll be banking $24 a pop instead of the $45 you could have received four years ago.\nThe sharemarket looks through the front windscreen, not the rear view mirror. Stock prices don't wait for current data, they move as soon as expectations change about the future. Yes, China's economy is deteriorating, but I can assure you today's buyer of Rio Tinto is already aware of the fact.\nSouth 32 Forager has added the first-ever mining stock to its portfolios in the past few months. BHP Billiton spin-off South 32 owns a world-class collection of assets, mining alumina, manganese, coal, silver, nickel and lead.\nIt is among the world's most efficient producers in each commodity class, which means that most competing mines will be bleeding red ink while South 32 remains profitable. The balance sheet is robust, and the early indications are that the managers are top notch (and have been buying shares with their own money).\nToday's share price suggests the company is only worth half the replacement cost of its assets. We expect things to remain ugly for a few years yet, but I find it hard to envisage a world where these assets produce such lowly returns over the long term.\nI remain bearish on China's prospects and the impact on the Australian economy. Domestic interest rates will fall further and could get down to zero. But it's too late to sell your mining stocks now. The time to panic was four years ago.\nSteve Johnson is chief investment officer of Forager Funds Management.", "external_links": [], "published": "2015-09-28T12:00:00.000+03:00", "crawled": "2015-09-28T12:06:00.584+03:00", "highlightTitle": ""}