{"organizations": [], "uuid": "f5c562f2467b593ef51ea0d439b6cafcdd7aa19b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509200132.html", "country": "US", "title": "Zambia: Kagem in K3.4 Million Scholarships", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zambia: Kagem in K3.4 Million Scholarships", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T14:51:00.000+03:00", "replies_count": 0, "uuid": "f5c562f2467b593ef51ea0d439b6cafcdd7aa19b"}, "author": "", "url": "http://allafrica.com/stories/201509200132.html", "ord_in_thread": 0, "title": "Zambia: Kagem in K3.4 Million Scholarships", "locations": ["Zambia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Phiri"], "text": "Zambia: Kalu Targets World Cup By Sam Phiri \nKAGEM Mine has set aside US$345,000 for student scholarships to study mining at the University of Zambia (UNZA) and the Copperbelt University (CBU). \nEducation Minister Michael Kaingu, Mines Minister Christopher Yaluma and Labour Minister Fackson Shamenda witnessed the signing of the Memorandum of Understanding (MoU) in Lusaka on Friday night. \nDr Kaingu praised Kagem Mine for the initiative and said it was a practical approach to supplementing Government's efforts in developing human resource. \nHe observed that training for a career in the mining sector could be a challenge for most students owing to cost implications and thus thanked the mine for lessening the students' burden through its gesture. \nKagem Mine director Sixtus Mulenga said the mine had developed a framework for sustainability that would drive long-term development in partnership with the Government and society as a whole. \n\"Under the terms of the scholarship, 12 students - six from each university - from the Geological and Mining Engineering departments in their second and third years of study will be selected to receive a comprehensive scholarship for the rest of the duration of their course over a period of eight years. \n\"The scholarships will cover the full cost of education including tuition fees, boarding fees, upkeep, clothing and book allowances as well as a medical scheme with Kagem,\" he said. \nDr Mulenga said students under the scheme would be accorded internship opportunities at Kagem Mine during their recess as well as an apprenticeship upon completion and further training in areas deemed necessary by the company. \nHe said the agreements were part of the mine's efforts in helping Government develop more coloured gemstone industry-oriented graduates that were up-to-date with current technical and theoretical knowledge and mining requirements of the day. \nUNZA acting deputy vice-Chancellor Mick Mwala said, on behalf of both universities, that the partnership would not only create graduates, but also scientists, leaders and innovators. \nKagem Mine also signed another MoU for the staff pension scheme with Saturnia Regna under the African Life Assurance management. \nThe mine enlisted its employees to the Saturnia Regna pension scheme in addition to the current NAPSA plan as part of its long-term staff development strategy. \nMr Shamenda commended Kagem Mine on the step as it would help motivate employees, who were on permanent and pensionable terms and help foster skill retention at the mine. \nKagem currently employs more than 600 employees all of whom are permanent and pensionable. \nMr Yaluma congratulated the mine and its employees on achieving more than 3.5 million injury-free shifts, and emphasised the need to remain alert on safety in the workplace at all times. Zambia \nLUSAKA Mayor George Nyendwa has cautioned councillors in district councils to adhere to Local Government and Housing … see more » Copyright © 2015 The Times of Zambia. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-20T14:51:00.000+03:00", "crawled": "2015-09-20T16:21:16.820+03:00", "highlightTitle": ""}