{"organizations": [], "uuid": "572b239df974ed9579758f4fecb03eb60cb71f6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DQ494_walker_ZG_20150721094200.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/heres-who-forked-over-millions-to-the-groups-backing-scott-walker-and-rick-perry-2015-09-22", "country": "US", "title": "Here’s who forked over millions to the groups backing Scott Walker and Rick Perry", "performance_score": 0, "site": "marketwatch.com", "participants_count": 3, "title_full": "Here’s who forked over millions to the groups backing Scott Walker and Rick Perry - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 2, "uuid": "2721c7cb94ee2e70dace126a247c07f56dff3519"}, "author": "Robert Schroeder", "url": "http://www.marketwatch.com/story/heres-who-forked-over-millions-to-the-groups-backing-scott-walker-and-rick-perry-2015-09-22#post-0", "ord_in_thread": 0, "title": "Here’s who forked over millions to the groups backing Scott Walker and Rick Perry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For donors, Scott Walker and Rick Perry didn’t make for much of a return on investment.\nWalker, the Wisconsin governor, and Perry, the former governor of Texas, were the first two big Republican names to drop out of the presidential race. There were various reasons each quit, but neither candidate lacked backers willing to send big sums of cash to super PACs supporting them. Those organizations cannot coordinate with candidates’ campaigns, but can accept unlimited contributions.\nIn Walker’s case, roofing billionaire Diane Hendricks gave the Unintimidated super PAC $5 million, according to the group’s July report to the Federal Election Commission . Marlene Ricketts and her husband Joe — who founded TD Ameritrade AMTD, -1.53% — gave the same amount.\nA group of super PACs backing Perry, meanwhile, has returned most of the millions of dollars they collected, according to the Center for Public Integrity . The groups — Opportunity and Freedom PAC and two similarly named others — raised nearly $17 million. Dallas billionaires Darwin Deason and Kelcy Warren were major contributors. Warren, Perry’s campaign finance chairman, contributed $6 million, while Deason gave $5 million.\nSuper PACs are not required to return money to donors, says Paul Ryan, senior counsel of the Campaign Legal Center. “There are no rules on this,” he told MarketWatch.\nBut Ryan added: “It would be wise to give money back to wealthy donors who ask for it because serious political professionals want to maintain relationships, not waste [donors’] money.”\nA message to the Unintimidated super PAC inquiring about refunds to donors was not immediately returned.\nOther campaigns are now courting Walker’s biggest donors, The Wall Street Journal writes. Texas Sen. Ted Cruz planned to meet with one top Walker donor Monday night in New York and former Florida Gov. Jeb Bush has scheduled a phone call with another, according to the Journal.\nAlso read: Republican Scott Walker drops out of White House run .\nMore from MarketWatch", "external_links": ["http://docquery.fec.gov/pdf/010/201507319000485010/201507319000485010.pdf#navpanes=0", "http://www.publicintegrity.org/2015/09/17/18005/pro-rick-perry-super-pacs-give-back-millions"], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-23T01:13:21.946+03:00", "highlightTitle": ""}