{"organizations": [], "uuid": "3958bcef9e1b6b3214612e4e22ae0b4647473531", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/6/g/f/4/image.related.afrArticleLead.620x365.gjibjv.png/1441782652624.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/regional-broadcasters-on-brink-over-archaic-media-rules-exdeputy-pm-tim-fischer-20150909-gjibjv", "country": "AU", "title": "Regional broadcasters on brink over 'archaic' media rules: ex-deputy PM Tim Fischer", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Regional broadcasters on brink over 'archaic' media rules: ex-deputy PM Tim Fischer | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T15:10:00.000+03:00", "replies_count": 0, "uuid": "3958bcef9e1b6b3214612e4e22ae0b4647473531"}, "author": "Phillip Coorey", "url": "http://www.afr.com/news/politics/regional-broadcasters-on-brink-over-archaic-media-rules-exdeputy-pm-tim-fischer-20150909-gjibjv", "ord_in_thread": 0, "title": "Regional broadcasters on brink over 'archaic' media rules: ex-deputy PM Tim Fischer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Nationals leader and deputy PM Tim Fischer: \"If they don't remove this barbed-wire fence from 1992, then you've got four broadcasters with their hands tied behind their back.\" Marina Neil Share on twitter by Phillip Coorey Former Nationals leader and deputy prime minister Tim Fischer has urged Tony Abbott to rethink his opposition to media law reform, saying he is being inconsistent with his government's pledge to cut red tape.\nMr Fischer, who has become a spokesman for battling regional television networks, told The Australian Financial Review that four regional broadcasters – Prime Media, WIN Corp, Southern Cross and Imparja​ – were at risk of disappearing unless the government abolished the obsolete reach rule and the two-thirds ownership rule.\n\"If they don't remove this barbed-wire fence from 1992, then you've got four broadcasters with their hands tied behind their back,\" he said.\n\"The favourite topic of this government is deregulation. Well, here's a perfect example of where two clunky, archaic regulations can be removed.\n\"It's not a backflip; it's a question of adjusting to the new technology.\"\nCommunications Minister Malcolm Turnbull and a large contingent of regional and rural Coalition MPs want the rules revoked, but Mr Abbott has refused, saying he will not act unless there is a consensus in the industry.\nLocal content suffering Fairfax Media, publisher of the Financial Review , and the Nine Network back the abolition of the rules, while Rupert Murdoch's News Corp and Kerry Stokes' Seven West Media are opposed.\n The regional networks say they cannot compete in the digital age as streaming by the networks cuts into their markets. The only way they can slash costs to try to survive is to keep cutting news and other local content.\nThey argue that an exemption from the rules would allow them to consider mergers and acquisitions with bigger metropolitan broadcasters.\nThe audience reach rule prevents TV licence-holders broadcasting to more than 75 per cent of the population, and the two-out-of-three rule supposedly limits the number of media platforms a company can own in a single market.\nBoth are considered obsolete in the internet and pay-TV era.\nMr Fischer said if the rules were removed and the regional networks allowed to merge or be bought out, they would give an undertaking to ensure a minimum of local content.\nMr Abbott has argued previously that he is being asked to essentially intervene in a commercial dispute.\n\"The trouble with media reform is that all too often there's a question of picking one business interest against another business interest,\" he said in August.\n\"That's why I would urge all of those who would like to see change here to sit down and hammer out something which is good for everyone … and once that's done obviously the government is prepared to look at it.\"\nBut Mr Fischer said there would never be an industry consensus and Mr Abbott had to lead.", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-09-09T15:10:00.000+03:00", "crawled": "2015-09-09T10:19:26.663+03:00", "highlightTitle": ""}