{"organizations": [], "uuid": "a27bcbde37c90a93f16823560023fb78e2fb6ca9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.gov.ie", "main_image": "", "site_section": "http://finance.gov.ie/rss.xml", "section_title": "An Roinn Airgeadais, Department of Finance", "url": "http://finance.gov.ie/news-centre/ministerial-interviews/pat-kenny-show-23rd-spetember-2015-national-ploughing", "country": "IE", "title": "Pat Kenny Show 23rd Spetember 2015 - National Ploughing Champioships", "performance_score": 0, "site": "finance.gov.ie", "participants_count": 1, "title_full": "Pat Kenny Show 23rd Spetember 2015 - National Ploughing Champioships", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T17:21:00.000+03:00", "replies_count": 0, "uuid": "a27bcbde37c90a93f16823560023fb78e2fb6ca9"}, "author": "editorfinance", "url": "http://finance.gov.ie/news-centre/ministerial-interviews/pat-kenny-show-23rd-spetember-2015-national-ploughing", "ord_in_thread": 0, "title": "Pat Kenny Show 23rd Spetember 2015 - National Ploughing Champioships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pat Kenny Show 23rd Spetember 2015 - National Ploughing Champioships 24.09.15 \nLive From the Ploughing Championships and With Budget 2016 Just Weeks Away Pat Kenny Talks to Minister for Finance, Michael Noonan \n\nBut first Minister Noonan good morning. – Good morning Pat. – You're up bright and early. – Well I was on early this morning to avoid the traffic jams. So great to be here. – Yes, it's very very busy here, very very busy. – It is indeed, indeed. – A couple of things, just straight away out of the news headlines. Paddy Cosgrave, the founder of the Web Summit has announced that it's going to depart Dublin and decamp to Lisbon, what's your reaction to that? \n\nPat Kenny: But first Minister Noonan good morning. \n\nMichael Noonan (Minister for Finance): Good morning Pat. \n\nPat Kenny: You're up bright and early. \n\nMichael Noonan (Minister for Finance): Well I was on early this morning to avoid the traffic jams. So great to be here. \n\nPat Kenny: Yes, it's very very busy here, very very busy. \n\nMichael Noonan (Minister for Finance): It is, it is indeed. \n\nPat Kenny: A couple of things, just straight away out of the news headlines. Paddy Cosgrave, the founder of the Web Summit has announced that it's going to depart Dublin and decamp to Lisbon, what's your reaction to that? \n\nMichael Noonan (Minister for Finance): It's a pity. I didn't know about it till the announcement was made. Dublin has been chock-a-block with people all year. Hotels have been full all the time. There's very little spare capacity in Dublin now until new hotels are built. So that might have been a factor. But I hope it's just a temporary move, and that he'll be back again next year. \n\nPat Kenny: Yeah, he said you know a lot of Start Ups in Lisbon, but you know, Dublin was iconic almost as a Mini Silicon Valley, and you know it's not a good omen if you like for Dublin. \n\nMichael Noonan (Minister for Finance): Well it's a pity to lose it, you know, but as I say, there's a lot of business in Dublin now, and there's a lot of pressure on hotel space in particular. \n\nPat Kenny: Now let's talk about farming. You are formulating a budget at the moment. The discussions are ongoing. The lobbying is persistent. What have you got for the Farmers? \n\nMichael Noonan (Minister for Finance): Well I met the IFA and I met the ICMSA. So I know what they're asks are. They're asks with me are usually around the area of Tax. We did something list year which was quite helpful for them. We averaged income over five years. You know the way Farming is cyclical? \n\nPat Kenny: Yeah. \n\nMichael Noonan (Minister for Finance): Good year is matched by bad years. So by having averaging of income for tax purposes over five years, you know, they can accrue their losses in the strong year, and so on. \n\nPat Kenny: Yeah. \n\nMichael Noonan (Minister for Finance): So that's very helpful. Now I suppose the big thing they're looking forward to this year, and I'll be able to move in their direction, is you know the differential between the way in which PAYE people are taxed and Self-Employed people are taxed? \n\nPat Kenny: Hmm, hmm. \n\nMichael Noonan (Minister for Finance): I suppose the biggest difference is the PAYE Allowance. So I'll be able to narrow that gap somewhat. I won't be able to eliminate it completely. But the Farmers and Self Employed people and people in Small Business, they're very interested in that. And when you think about . . . \n\nPat Kenny: Will it amount to much though? \n\nMichael Noonan (Minister for Finance): Yeah, it will be significant, yeah, it will be significant. \n\nPat Kenny: Significant, but not an entire elimination? \n\nMichael Noonan (Minister for Finance): No but I'll be making a commitment that it will be the first step in a three year programme, you know, to get it equalised. You see when you . . . \n\nPat Kenny: The Self Employed, I mean Farmers are Self Employed, but the other people who are Self Employed, Small Builders and so on, they are knocking on your door, but they don't have the clout of an IFA? \n\nMichael Noonan (Minister for Finance): No but what applies to Farming as Self Employed people will apply across the board. If you look at Rural Ireland, you know the people who work in Rural Ireland, the bulk of them in the Private Sector are Self Employed. And then there are a lot of Public Servants, Teachers and Guards and Nurses and so on. So that's the kind of mix that drives Country Parishes. So it will be a very significant initiative for Rural Ireland, to give a tax break to so many Self Employed people. \n\nPat Kenny: Moving onto the Ploughing here, and so many Stands. I mean there are people with replacement windows, and offering all sorts of services. And one of the things that you had was giving people the ability to get a rebate on small construction, like extensions and refitting of windows, and so on. Em that's about to expire? \n\nMichael Noonan (Minister for Finance): Yes, it's about to expire at the end of this year. But I'm announcing now that I'm extending it for another twelve months. It has been a very successful scheme. It's all in the regular economy, there's no black economy. Both the contractors and the person applying has to register online with the Revenue. So we have a very strong indicator of what's happening. And there's a half a billion worth of work has come through that already. And by extending it for another year, I think it will continue to help the Construction Industry, create jobs, and help the supply of accommodation as well. People might build on that extension with an extra room, and so on. \n\nPat Kenny: That brings me nicely, I didn't intend to come to it this early, to Airbnb. And the notion that they were being taxed by the Taxman. Now in, for example Dublin City, where there's a shortage of Hotel space, and you have people who offer the room, the spare room, for this kind of overnight accommodation, two or three days at most, and the Taxman is taking a deep interest in them. Now it doesn't seem to me that that was the intent of the whole Airbnb thing. And in addition you have the Rent a Room Scheme, whereby if you rent it for a year, or a protracted period, you get a tax break? \n\nMichael Noonan (Minister for Finance): That's right. They're two different schemes. The Rent a Room Scheme, you can get €12,000 of a tax break. But that's residential. That's for people who come and stay in the spare room in your house. And particularly useful for Students. The Student Union of Ireland promoted it very strongly at the start of the University year, and it's taken an awful lot of pressure off student accommodation. Airbnb is in direct competition with Bed & Breakfast places, and with Small Hotels. And it's what they call now a Disruptive Technology. And there should be tax, because that's the business they're in. \n\nPat Kenny: So no relief there? \n\nMichael Noonan (Minister for Finance): No, it's a matter for Revenue. Revenue ruled on it, that's taxable income. And I'm not going to change that in the Finance Bill. \n\nPat Kenny: Brendan Howlin said yesterday that the whole idea of whatever budget strategy you have in a couple of weeks time, is going to reward people who get up early and work hard all week. Which suggest some sort of tax breaks. But as it stands, if someone puts in the extra hour of overtime, for every Euro that parson earns, they're giving half of it to you. That doesn't seem fair? \n\nMichael Noonan (Minister for Finance): That's right. We acknowledge that. But because of the bad times we came through, and to get the country out of insolvency, you know, taxes went high. And there was a lot of cutbacks in expenditure as well. And we're the first to acknowledge that. But now that we're coming out the other side, we're looking at tax. But we're looking at it, not so much as kind of giveaways. We're looking at it as an instrument of policy. And personal taxes now, they're so high they're costing jobs. And if we can reduce personal taxes, well you'll get bigger participation in the workforce, especially women going back to work. We'll get some of our immigrants to come home. Because tax is an issue when they're making up their minds. \n\nPat Kenny: Is tax a driver of the Black Economy to which we refereed earlier? Because you know if you're going to be fleeced by the Taxman, for working a little bit harder, the temptation is going to be there, as it was way back in the seventies, I mean the Taxman was referred to as Dick Turpin, he took so much out of people's pockets? \n\nMichael Noonan (Minister for Finance): Well the Revenue are very good now, and the Black Economy isn't as significant as it was in the seventies. And that scheme we referred to earlier, the Home Improvement Scheme, you know, that doesn't apply to anyone in the Black Economy. And actually a lot of of Small Contractors moved into the legitimate economy, because of that tax break. But in general terms, there's income tax, there's the various other personal taxes, like PRSI and USC. \n\nPat Kenny: PRSI and then the USC. \n\nMichael Noonan (Minister for Finance): And to reach different levels of income, you have to look at each of them. But in this budget, we will be reducing personal taxes. We did a bit last year, we'll do a bit extra this year. And I agree with your analysis, you know, personal taxes in Ireland, are too high, they're too high in real terms, they're too high in comparative terms. And apart from giving money back to individuals, there's an economic advantage in terms of job creation. Like anything you tax too highly, you get less of. And anything that you reduce tax on, you'll get more of. And the same applies to jobs. If you tax jobs, which is what personal income tax is, you'll get less of it. So you need to come to a kind of sweet point, where you maximising your job creation. And as we can afford it, we'll do that. \n\nPat Kenny: The USC though was seen as a tax that would bring more people into the net. People even at relatively low incomes, because in comparison to other countries, if you go straight to our neighbour next door, people come into the tax net at relatively low incomes. They pay very little, but they do pay a tax on their incomes. And we weren't in that situation. The USC brought people into the tax net. And now we see a push to get rid of people out of the USC net? \n\nMichael Noonan (Minister for Finance): Well people on very low incomes are caught, and there's an argument that people on very low incomes, part time works, people who work the summer and so on, shouldn't be penalised with tax. But again, there's a point where you can maximise the advantage, and that's what we're looking at. But it's a very important issue, and I want to stress again it's not a question of you know, kind of favouring one group of individuals above another. It's part of the economic management to bed down the recovery, to make the economy grow stronger. And certainly personal taxes has a big impact on that. \n\nPat Kenny: One of the things that will impact on Budget 2016 is whatever demands will be made by our agreement to take in Refugees, that will be a cost on the Exchequer. What have you budgeted for? \n\nMichael Noonan (Minister for Finance): Well it would be on Brendan Howlin's side of the Budget, the Expenditure Side. \n\nPat Kenny: But you've got to look at what you take in and give him the cash? \n\nMichael Noonan (Minister for Finance): Yeah, the four thousand that we have committed to, Refugees, there'd be a cost, I suppose of around €30 million, that's our first short at costing. But there's a European Fund being put together as well, which would pay for part of that. So within the context of a Budget . . . \n\nPat Kenny: It's not significant. \n\nMichael Noonan (Minister for Finance): Within a context of a budget, it's over €50 billion, you know it's not that significant. \n\nPat Kenny: And yet people will be pointing to things that could be done for housing, for example, for Irish people with that €30 million. \n\nMichael Noonan (Minister for Finance): Yeah, but sure we have to do that as well, you know. \n\nPat Kenny: Em some of the other things that are still after almost five years of Government, still there. The Banks' are in, those that have survived, are in recovery. You talked about AIB, that the proceeds of whatever sale happens, will be used to pay down debt. What are the equations there? I mean how much have the Banks' cost us, and how much are we going to raise? \n\nMichael Noonan (Minister for Finance): Well we own 99% plus of AIB. And money was put in to recapitalise them in different ways. The State got, bought Preference Shares, for example. And then there was Contingent Capital put in, which effectively means after the recapitalisation an extra amount was put in, in case it was needed. \n\nPat Kenny: Yeah. \n\nMichael Noonan (Minister for Finance): Now we'll be able to get that out in the next twelve months. So between the Preference Shares and the CoCo's as they're called, the Contingent Capital and Dividends being paid next year, the Taxpayer will get back about nearly €4 billion, and that's without selling any of the shares in AIB. After that then, the plan is to put 25% on the market, on the London Stock Exchange principally, with an IPO. Now I don't want to do that while an election is imminent, because I don't want it to become a matter of controversy, where value would be reduced, because of the controversy. So there'll be no sale of shares in AIB until the earliest, May or June of next year. \n\nPat Kenny: What's your estimate though, what would AIB finally get for us in a couple of years time, if the State was to divest itself entirely? \n\nMichael Noonan (Minister for Finance): Yeah, we know now that all the money that was put into AIB, Bank of Ireland and PTSB, we'll get it all back at a minimum. So the Taxpayer won't be at any loss there. Anglo a write off, we'll lose about €30 billion in Anglo. Even though we did a very good deal on the Promissory Note and made it less expensive. So that's where the big loss is. Not it depends on when we sell. I was friendly with the former Swedish Finance Minister. They had a banking crisis in the early nineties. And they only sold the last of the shares they held in the Nationalised Bank, the year before last. And they recovered two and a half times what they had invested, in nominal terms. So you know, my successors will have to look at what's the right time in the market. But I'd be very confident now, that everything will come back, that the Taxpayer has put in, into the three Banks' that are still in operation. \n\nPat Kenny: Now the whole Anglo mess, and the write off of €30 billion. Mr Chopra, formally of the IMF has been very vocal in recent times, about how they tried to stop the ECB being as draconian with us, you know, the threat from Mr Trichet that a bomb would go off, not in Frankfurt or not in Brussels, it would go off in Dublin. He was being metaphorical, I presume. Have we written off that cash, in spite of, you know, the evidence being offered by Mr Chopra? \n\nMichael Noonan (Minister for Finance): Well first of all Mr Chopra was very helpful to Ireland, when he was heading the IMF Delegation in the Troika. But the people he reported back home weren't as helpful. Because there was never a decision taken by the IMF Executive, to enable us to write off Bondholders. Tim Geithner was the Secretary to the Treasury in Washington. He didn't believe in burning Bondholders, and made his position very clear. And IMF are headquartered in Washington. The US Treasury is their main funder. And they have a very big influence over their policy. So while Mr Chopra was sympathetic towards Ireland, the sympathy didn't reach to the point where he would take executive action, because his superiors wouldn't allow him. Now you know, my view has been consistent, that a mistake was made at that stage, by the European Authorities, particularly by the European Central Bank. \n\nPat Kenny: But do they not have to pay for that mistake? \n\nMichael Noonan (Minister for Finance): Well they would claim that they've done so. Because they gave us a very good deal on the Promissory Note afterwards. That was a very very benign . . . \n\nPat Kenny: But it's money that we should not have had to pay out. \n\nMichael Noonan (Minister for Finance): Very benign deal. \n\nPat Kenny: Benign deal, but a deal nonetheless that requires ultimately to be paid back? \n\nMichael Noonan (Minister for Finance): Not but you see, the amount of Senior Bondholders in Anglo, at the time I came to recapitalise, it was down to about €5.5 billion. So the rest of the, the rest of the losses in Anglo, are not due to Bondholders. You could burn all the Bondholders in Anglo, and you'd only get back, you know about one seventh of what was put in by the Taxpayer, through the Promissory Note mechanism. \n\nPat Kenny: We're talking billions here, and one of the Departments that spends billions every year is Health. And we saw recently from Tony O'Brien, they reckon that they need €2 billion more. Brendan Howlin was with me on the programme some time ago, and he said there's no way they're getting anything approaching that. They might get a couple of hundred million more, that's about the height of it. But at the heart of this is a row as to how the money is being spent. The OECD Say we spend more on average than other people do on a Health Service, and we have a much poorer result. So what's wrong? You were a Minister for Health for some time? \n\nMichael Noonan (Minister for Finance): I was. First of all I was very surprised at the statement from the HSE, that they wanted €1.9 billion next year. \n\nPat Kenny: It sounded like cheek? \n\nMichael Noonan (Minister for Finance): Well we brought in the new budgetary process. We had a Spring Statement published in April, where we said the total space for all Departments was between €1.2 and €1.5 billion. And then we had a dialogue in Dublin Castle, where we had all the Interest Groups present for two days. And almost every group subscribed to the idea that it was a proper way to manage our finances, to identify the fiscal space that everyone had to live within. And then the HSE, not only decide they're going to grab it all, but €400 million on top of that. I mean it's incredible that such Senior people in such a key area, would have gone public, as if they didn't live in the country at all, and they didn't understand what the new budgetary rules were. \n\nPat Kenny: So what's your verdict on them, are they clueless? \n\nMichael Noonan (Minister for Finance): No I presume they were saying that, don't blame us if there's a problem in the future. I think that's what they were doing. \n\nPat Kenny: But what does it tell you? I mean you did have the stewardship of the Health Service for a while. What does it tell you though if we're spending enough money to get a good Health Service, and yet we don't have that result? \n\nMichael Noonan (Minister for Finance): It tells me that the budget controls in the Health System are inadequate. The manner in which resources are allocated, aren't done in the most efficient way. And I would like to see tighter management. \n\nPat Kenny: Sometimes there are issues that just crop out of the blue. And I don't know what your view is on this, I've heard other Ministers expressing views. A drink driving case, where a Romanian wants a document `As Gaeilge'. I mean I laughed when I heard it first. I said it could not possibly be true. And then it turns out that according to the High Court, at any rate, it should have been the case that every Romanian, Latvian, Lithuanian, Norwegian, Icelander, has to get a document `As Gaeilge' if they so desire? \n\nMichael Noonan (Minister for Finance): Well I think the Minister Paschal Donohoe has come up with a solution now, and he's changing the statutory instrument, and there won't be an awful lot of these cancelled out, maybe a handful, but not hundreds or not thousands. \n\nPat Kenny: No, but do you think there's room for a common sense element to interpretation by Judges of the Law? That the overriding thing should be common sense, rather than every full stop, comma and semi-colon? \n\nMichael Noonan (Minister for Finance): Yeah well the Judges would argue that they're obliged to take the law as it's written. Not on its intent. And if there's a mistake in the way it's drafted, it's not their job, it's a job for the Houses of the Oireachtas. And you know, that's the other way of looking at it. More scrutiny in Committee, more detail. If some of my colleagues in the Dáil spent more time scrutinising the detail of legislation, rather than grandstanding, you might get, you mightn't get these things happening with such frequency. \n\nPat Kenny: Just a few months to go, whether there's a snap election in the wake of a budget, or whether it's in February, or whether you go all the way to just after Easter 2016. There's not a lot of time for legislation. What are your priorities to get through before the next election? \n\nMichael Noonan (Minister for Finance): Well I'm, next week in the Dáil, putting through the Reform of Income Tax Appeal, the Income Tax Appeal Commissioners. We'll be appointing an extra Appeals Commissioner. And that will free up the Appeals System. It will collect more tax as well, because there's a lot of stuff stuck in the appeals system at the moment. So that's priority number one Second priority is the Finance Bill, to implement the Budget measures. And that will be between the Budget and December. \n\nPat Kenny: Right, you mentioned your successors. Now the last time you were on with us, you told us, some months ago now, that you were going to run again, all going well in Limerick, that is still your intent I know. Do you expect to be returned to power? \n\nMichael Noonan (Minister for Finance): Yeah we've had our convention in Limerick. So I'm selected, I'm a candidate, together with my colleague Kieran O'Donnell. And we expect to be, without being presumptuous about it, I think we're well positioned now to be returned to power. And we'll campaign very strongly. I see the next Budget, not as the end of the last Budget of a political cycle. I see it as the first Budget of the next cycle. And a lot of what I'll be saying on Budget Day, will be indicating the way we'll go if we are back in power, over the next five years. \n\nPat Kenny: Em a couple of questions coming in. The USC was supposed to be temporary, who are the codding, it will never be gone? \n\nMichael Noonan (Minister for Finance): Well that's a very pessimistic view. First of all it replaced the Health Levy and the Employment Levy. So it wasn't totally new. Although there was an add on. And secondly wait till Budget Day and you'll see what my intent is. \n\nPat Kenny: Em how about getting rid of the Pension Levy. On a retired person's pension of about €20,000. That's from Annette. \n\nMichael Noonan (Minister for Finance): The Pension Levy finished, the bulk of it finished last year. The residual bit . . . \n\nPat Kenny: Will be gone. \n\nMichael Noonan (Minister for Finance): It ends at the end of this year. I have no intention of renewing it. \n\nPat Kenny: What about ARFs where it's presumed that a certain amount is taken out of an ARF, and then it's taxed? \n\nMichael Noonan (Minister for Finance): Yeah we're looking at this. And there's a number of things which were changed by George Osborne in the UK, and we're looking at the possibilities there. But we haven't made decisions yet. \n\nPat Kenny: Why is being a Landlord not being treated as being a business for tax purposes? \n\n\nMichael Noonan (Minister for Finance): Because we couldn't afford it at the time, to restore, I mean the issue there is that 100% of interest would be written off, if it was treated fully for business purposes. It's 75% is the right off, and there's an argument from Landlords to put that up to 100%. \n\nPat Kenny: Em you may have heard Minister Kelly on Breakfast, just before you came on here, talking about the Mortgage Cap and the rules that the Central Bank brought in, and how it's impossible, in his view, for many young people to save the deposit. And yet at the same time they're paying rents far higher than the mortgage they would achieve, if they were able to get one, say a 90% mortgage? \n\nMichael Noonan (Minister for Finance): I think the prudential rules are good. And the Property Market in Dublin was overheating. And certainly it controlled prices, and it stopped that. But I think it needs to be reviewed now again. And I know the Bank, the Central Bank is collecting data on how it operates. And I'm meeting Patrick Honohan this week, on Thursday, and I'll be asking him to commence a review process. \n\nPat Kenny: The Minister wants to reward people who get up early. I'm burgeoned with debt. I'm suffocating, and the Minister wants me to suffer for a three year Bankruptcy. Why can't he allow me to get rid of my debt in one year, instead of going to the UK. Help those of us in debt to get back into working with some normality? \n\nMichael Noonan (Minister for Finance): Yeah, that's been considered. We brought it down from twelve years to three years now. So we didn't stand idly by and not treat Bankruptcy. It was a huge reform. It used to be twelve. This Government brought it down to three. Now there's an argument that it would be feasible to bring it down to one year. That's the position in the UK. And the Minister for Justice is looking at that at the moment. \n\nPat Kenny: Ursula wants to know, what happens to those of us who had shares in AIB, and have held onto them? Are they worth anything? \n\nMichael Noonan (Minister for Finance): They're worth very little. And they're going to be restructured. So they'll actually be worth less than they're quoted at the minute.", "external_links": [], "published": "2015-09-24T17:21:00.000+03:00", "crawled": "2015-09-24T20:12:04.112+03:00", "highlightTitle": ""}