{"organizations": ["Better Business Bureau"], "uuid": "b0d39d5f207ab836b40cbeb994645c26cb4cbab5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.24-7pressrelease.com", "main_image": "http://www.24-7pressrelease.com/images/icon-247pressrelease.jpg", "site_section": "http://rss.24-7pressrelease.com/rss/home_and_family_personal_finance.xml", "section_title": "Press Release and Top HomeFamily   Personal Finance News From 24-7 Press Release Newswire", "url": "http://www.24-7pressrelease.com/press-release/pawnscom-a-free-platform-released-to-match-consumers-with-local-pawnbrokers-412457.php", "country": "US", "title": "Pawns.com - A Free Platform Released to Match Consumers with Local Pawnbrokers", "performance_score": 0, "site": "24-7pressrelease.com", "participants_count": 0, "title_full": "Pawns.com - A Free Platform Released to Match Consumers with Local Pawnbrokers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T10:00:00.000+03:00", "replies_count": 0, "uuid": "b0d39d5f207ab836b40cbeb994645c26cb4cbab5"}, "author": "", "url": "http://www.24-7pressrelease.com/press-release/pawnscom-a-free-platform-released-to-match-consumers-with-local-pawnbrokers-412457.php", "ord_in_thread": 0, "title": "Pawns.com - A Free Platform Released to Match Consumers with Local Pawnbrokers", "locations": ["U.S.", "CHICAGO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barry Epstein", "Epstein"], "text": "Pawns.com - A Free Platform Released to Match Consumers with Local Pawnbrokers Pawns.com announces system to allow customers to search for quality pawn shops \"Panws.com takes the guesswork out of the pawning equation ... By working with our partners you eliminate the risk of being taken advantage of. We protect the needs of the consumer in this way\" CHICAGO, IL, September 09,   Pawns.com, a Chicago-based tech start-up, has announced today the development of a free online system that matches consumers seeking to pawn an item to reputable pawnbrokers in their area. Over two years in development, the technology behind Pawns.com connects its consumers with quality local pawnbrokers who will offer the most favorable deal, and to thereby avoid the need for searching on their own to find a competitive price. The platform works by gathering users' basic information about the item they would like to pawn and then searches an extensive directory of pawnbrokers within the Pawns.com partner network and efficiently identifies the local pawnbroker that offers the best price for the item. The cloud-based technology can be used by anyone who has access to the Internet. When a user submits the information to the Pawns.com database, the item is viewed by nearby pawnbrokers that then compete to provide an offer. From there, the user is able to select the best offer made in order to maximize the cash they will receive. In addition to acquiring critical information about pawnbrokers' offers, users of the service can read and leave reviews of the pawn shop. \"We take the guesswork out of the pawning equation,\" explained PR Director Barry Epstein. \"Through us, individuals are given the freedom to choose the most convenient pawn shop offering the most money,\" he explained. \"By informing the consumer, it is a foolproof process.\" Moreover, Pawns.com pre-screens all the pawnbrokers within their network, and works only with those that meet specific criteria. Qualified pawnbrokers must not be negatively rated by the Better Business Bureau, among other criteria. By taking these quality assurance measures, Pawns.com can make customers certain that they are working only with the most reputable pawn shops in the industry. The pawn shops in the Pawns.com directory specifically specialize in assessing the value of a variety of goods and providing fair deals. Research shows that over 30 million Americans use pawn shops when they need emergency funds. With an estimated 10,000 pawn stores in the U.S., it can be difficult for consumers to shop around and get the best price for their personal property. \"What is unique about our matching system is that by working with our partners you eliminate the risk of being taken advantage of. We protect the needs of the consumer in this way\" said Epstein. \"We pride ourselves on being a convenient and transparent company.\" To try the free service, simply search among a database of over 10,000 quality pawnbrokers now through the Pawns.com application system.Pawns.com uses an online system to efficiently match consumers wishing to pawn an item to an extensive database of reputable pawnbrokers in their area. The pawnbrokers compete to offer the best value for the item to the consumer. The cloud-based technology can be used by anyone who has access to the Internet. # # #", "external_links": [], "published": "2015-09-09T10:00:00.000+03:00", "crawled": "2015-09-09T10:08:36.266+03:00", "highlightTitle": ""}