{"organizations": [], "uuid": "793e1a2db79896fc37ddca074852c208b3212695", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30078357/baslerco-inc-has-added-new-lanyards-to-their-tradeshowhandoutscom-division", "country": "US", "title": "BaslerCo Inc Has Added New Lanyards to Their TradeshowHandouts.com Division", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "BaslerCo Inc Has Added New Lanyards to Their TradeshowHandouts.com Division - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T19:00:00.000+03:00", "replies_count": 0, "uuid": "793e1a2db79896fc37ddca074852c208b3212695"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30078357/baslerco-inc-has-added-new-lanyards-to-their-tradeshowhandoutscom-division", "ord_in_thread": 0, "title": "BaslerCo Inc Has Added New Lanyards to Their TradeshowHandouts.com Division", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BaslerCo Inc, a leading distributor of custom imprinted promotional products, has added some new items to their product line including lanyards. These new lanyards are available through the TradeshowHandouts.com division.\nRapid City, SD\nCompanies looking for something to give employees as a token of appreciation for the work they do or to hand out at an upcoming tradeshow might consider ordering custom imprinted lanyards through the TradeshowHandouts.com division at BaslerCo Inc.\nThe newly added custom imprinted lanyards from BaslerCo Inc.’s TradeshowHandouts.com division are a great way to say “thank you” to employees for all of their hard work, or to repeat customers for their continued business. They are gifts that will be seen and used virtually every day, conveying the “thank you” message and promoting the company name with each use.\nAll custom imprinted products on http://www.tradeshowhandouts.com , including the recently added line of customizable lanyards, are offered at end quantity pricing with a 1 standard color/1 location imprint, but other options are also available. These options include imprinting in multiple colors or locations. BaslerCo Inc. also has the capability of producing large quantity orders that go well beyond the listed catalog quantities. The custom imprinted lanyards will be used on a regular basis, making them an effective tool for brand marketing and generating new business. Standard turnaround times are seven to ten business days after the final proof approval.\nFor more information about custom imprinted lanyards and other quality promotional products, please visit http://www.tradeshowhandouts.com or call (800) 888-8309 to speak to a customer service representative.\nTradeshowHandouts.com products include tote bags, mint tins, coolers, lanyards, keychains, coasters, drink ware, healthcare items, household items, and travel accessories. BaslerCo Inc. products include regular and die-cut Post-it® Note pads, cubes, flags, pens, highlighters, organizers and dispensers. BaslerCo Inc. also provides a variety of unique options such as custom top sheet printing, alternating copy (rotating throughout the pad), second side printing, quick response on large quantity orders and custom sizes. To review additional products, visit us at http://www.baslercoinc.com or http://www.tradeshowhandouts.com\n //www.prweb.com/releases/2015/09/prweb12968502.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/09/prweb12968502.htm"], "published": "2015-09-21T19:00:00.000+03:00", "crawled": "2015-09-21T18:03:08.400+03:00", "highlightTitle": ""}