{"organizations": ["Fed"], "uuid": "db5b63c92b7bb46601bd94f2871ae85807097078", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-banks/?format=rss", "section_title": "Banking News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/morning-bid-europe-routes-migrants-070428311.html", "country": "US", "title": "MORNING BID EUROPE-New routes for migrants; market focus narrows on Fed", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "MORNING BID EUROPE-New routes for migrants; market focus narrows on Fed", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T10:04:00.000+03:00", "replies_count": 0, "uuid": "db5b63c92b7bb46601bd94f2871ae85807097078"}, "author": "", "url": "https://uk.finance.yahoo.com/news/morning-bid-europe-routes-migrants-070428311.html", "ord_in_thread": 0, "title": "MORNING BID EUROPE-New routes for migrants; market focus narrows on Fed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "5,150.00 -80.00 \n* A look at the day ahead from European Economics and Politics Editor Mark John and Chief EMEA Markets Correspondent Nigel Stephenson. The views expressed are their own. \nLONDON, Sept 16 (Reuters) - With its new razor-wire-topped fence in place, Hungary rounded up just 366 migrants on its side of the Serbian border on Tuesday after Monday's record 9,380. A success for Fortress Europe? Hardly. A Reuters cameraman on Wednesday morning saw dozens of people walking through cornfields towards Serbia's border with Croatia as the quest for new routes in continued. With the bloc still in disarray about how to respond to this crisis, an emergency summit of EU leaders now looks almost inevitable. \nQuite where Britain's Labour now stands on issues ranging from EU membership to Syria is not clear following the naming of new leader Jeremy Corbyn. His backers call this a new, more democratic leadership style in which internal policy differences can be freely aired in public; the local media and his rivals are pretty much united in calling it chaos. His first performance up against David Cameron in prime minister's question time today will be closely watched. \nOn the economy, euro zone inflation, labour costs and wages data out at 0900 gmt could feed in to ECB thinking on whether to extend QE. UK wage and employment data due at 0830 will likewise give pointers on inflationary pressures or the lack of them there. Sweden's central bank publishes minutes from its last meeting when it held rates at -0.35 percent. Expectations are for a further cut when the Riksbank meets in late October. \nFrance will publish details of the economic underpinnings for its 2016 budget bill at a 0630 gmt news conference with Finance Minister Michel Sapin. We're looking for any revisions in the main numbers or fresh insight into the inflation outlook. \nMARKETS \nAll the focus was on rising U.S (Other OTC: UBGXF - news ) . Treasury yields overnight, with 2-year notes pushing to their highest in more than 4 years at more than 81 bps as the Fed starts its two-day meeting. Ten-year yields also spiked and tested 2.30 percent for the first time since July. The dollar firmed too and even Brent oil popped back up close to $48. While some hung the move on a decent core US retail sales data for August and upward revisions for July, that sounds a real stretch given much of the data sweep stateside yesterday was pretty underwhelming, with industrial output and manufacturing sentiment below forecast. If the Fed is truly \"data dependent\", then there was no smoking gun here. Much more likely is that this is just position adjustment and getting ducks in a row ahead of the decision. Market pricing continues to see less than a 1-in-3 chance of a move and forecasters are split. Perhaps the former means the market risk is that a hike on Thursday has an outsize immediate impact and this has led to a rethinking of positioning. Stocks markets seemed relatively comfortable either way. Wall St added more than 1 percent, with Shanghai rebounding up to 6 percent, Tokyo up almost 1 percent and Seoul up 2 percent earlier. Eurostocks futures are marked up to 1 percent higher, German bund yields are up in sympathy with Treasuries and Wall St futures are flat so far. BoE chief Mark Carney's parliamentary testimony today may give a glimpse of how a central bank argues for rising rates when inflation is zero. US CPI inflation numbers later will also speak to that. Our interview with ECB's Constancio, meantime, shows Frankfurt again signaling scope for more QE if anything. The bigger picture of spluttering world growth will be spotlighted by the OECD update later. \nOther stock movers: Glencore (Xetra: A1JAGV - news ) launched a $2.5 billion share placement. Royal Bank of Scotland (LSE: RBS.L - news ) agreed to pay $130 million to resolve mortgage-backed securities sales issue with U.S. regulator. Richemont and Inditex (Amsterdam: IT6.AS - news ) have reported higher sales, while French newspaper Les Echos has reported that Vivendi (Swiss: VIV.SW - news ) could raise its stake in Telecom Italia (Other OTC: TIAJF - news ) from 15.5 percent to about 20 percent. Portugal fails to sell Novo Banco, to relaunch sale later. Roche warns of biotech sector \"bubble\". \nEmerging market stocks hit a two-week high after China mainland shares snap their two-day losing streak with a 6 percent rise that wipes out the week's losses so far. \nOther EM movers: Currencies more mixed, with Chinese yuan weakening a little while safe haven bid Singapore dollar at its strongest in almost three-weeks ahead of Fed decision on Thursday, and Russian rouble and Turkish lira strengthening a touch. Thai baht weakening a little though rangebound ahead of interest rate decision (0730 GMT) where no change is expected. \nEVENTS \nFRANKFURT - Bundesbank board member Dombret speaks at EBS Symposium PRAGUE - Czech Producer Prices 08/15 BRATISLAVA - Slovakia inflation 08/15 STOCKHOLM - Swedish cbank publishes minutes of last meeting. VIENNA - Austria-CPI COPENHAGEN - Danish central bank quarterly economic review LONDON - Unemployment rate and wage data PARIS - OECD updates key macroeconomic forecasts for major economies AMSTERDAM - Dutch supreme court holds hearings on \"bed, bath and bread\" facilities for failed asylum seekers BRUSSELS - Euro Zone-Labour costs, wages and inflation ZURICH - Switzerland-ZEW WARSAW - Poland wages, unemployment and inflation LONDON - Parliament treasury committee to question BoE's Carney and other MPC (KOSDAQ: 050540.KQ - news ) members PARIS - OECD update on global economic forecasts (Editing by Ralph Boulton)", "external_links": [], "published": "2015-09-16T10:04:00.000+03:00", "crawled": "2015-09-16T10:33:19.095+03:00", "highlightTitle": ""}