{"organizations": [], "uuid": "302116c76c75564e5c07a7cd84040e2b2a451d4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/b/n/2/0/image.related.articleLeadwide.620x349.gjbmf3.png/1441005875290.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/25/consumer-discretionary", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/property/all-roads-lead-west-20150831-gjbmf3.html", "country": "AU", "title": "All roads lead west in Sydney to industry", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "All roads lead west in Sydney to industry", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "302116c76c75564e5c07a7cd84040e2b2a451d4d"}, "author": "", "url": "http://www.smh.com.au/business/property/all-roads-lead-west-20150831-gjbmf3.html", "ord_in_thread": 0, "title": "All roads lead west in Sydney to industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stockland's Willowdale development in Leppington. Photo: Paul Gosney\nThe $20 billion of infrastructure work being undertaken by the NSW government has opened up the south-west of Sydney, leading to high demand for industrial assets, agents say.\nThere has seen a rise in rents as supply remains tight because of the juggernaut residential developments where land and older warehouses are being snapped up for apartment projects.\nThe newly minted Frasers Property Australia, formerly Australand, has invested in the area with its new site at the Edmondson Park town centre, which will be eventually rezoned and developed into a mixed-use retail and residential site.\nStockland has also identified the region as having significant growth potential with its Willowdale development.\nAdvertisement CBRE's research shows that up to 850,000 square metres – more than double the space of Sydney's central business district – are earmarked for development from 2017 to 2027.\nCBRE senior research analyst Alexander Tan said shrinking stock levels in south Sydney and the central west markets made the south-west an increasingly attractive alternative for industrial operators.\n\"The gentrification of industrial estates such as south Sydney and the central west is an inevitable evolution for major cities, and one which Sydney is currently experiencing,\" Mr Tan said.\n\"Improvements of transportation networks such as WestConnex, combined with major developments including the Moorebank intermodal terminal, have put the south-west in the spotlight.\"\nCBRE research shows about 210,000 square metres of industrial stock in south Sydney could be converted over the next five years.\n\"Taking into account the limited supply pipeline for warehouse stock in south Sydney over the next five years, being 200,000 square metres of which 127,000 square metres is uncommitted, vacancy is expected to tighten further,\" Mr Tan said.\n\"As industrial vacancy gets tighter in south Sydney, the central west and south-west precincts emerge as clear alternatives in terms of proximity.\n\"The south-west is positioned to benefit from this migration wave, absorbing tenants relocating from south Sydney and the central west, while also remaining attractive in its own right.\"\nCBRE NSW industrial director Michael O'Neill said the south-west's accessibility combined with major developments earmarked for the area would lead to the area becoming Sydney's industrial centre of the future.\n\"As the traditional industrial precincts circling the city continue to be absorbed by Sydney's booming residential market, the south-west will evolve into one of the city's largest industrial markets,\" Mr O'Neill said.\nDespite a substantial amount of western Sydney land being available for development over the medium and long term, there is a lack of serviced land for immediate development because of servicing costs, rezoning and acquisition lead times.\nKnight Frank's director of NSW research, Nick Hoskins, said land owners with appropriately zoned land could be active players in the pre-commitment cycle, with competition limited to some institutional developers and larger private developers.\nMr Hoskins said while most development within the Western Sydney Employment Area had been undertaken by the major institutions over the last 12 years, the private sector was showing a greater propensity to push new projects.", "external_links": [], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-05T03:00:46.460+03:00", "highlightTitle": ""}