{"organizations": [], "uuid": "f485b9714245004941250507473162d6f487708e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-sharecast/?format=rss", "section_title": "Finance News | Sharecast - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/tuesday-newspaper-round-eu-referendum-071800971.html", "country": "GB", "title": "Tuesday newspaper round-up: EU referendum, Amlin, Sports Direct", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Tuesday newspaper round-up: EU referendum, Amlin, Sports Direct", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T10:43:00.000+03:00", "replies_count": 0, "uuid": "f485b9714245004941250507473162d6f487708e"}, "author": "", "url": "https://uk.finance.yahoo.com/news/tuesday-newspaper-round-eu-referendum-071800971.html", "ord_in_thread": 0, "title": "Tuesday newspaper round-up: EU referendum, Amlin, Sports Direct", "locations": ["Amlin", "EU"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "14.47 -0.31 \nLONDON (ShareCast) - (ShareCast News) - David Cameron's government suffered its first defeat in the House of Commons on Monday night after eurosceptic Tories joined forces with opposition MPs to defy the prime minister on the rules surrounding an EU referendum. Thirty-seven Conservatives voted with the SNP and Labour to defeat Mr Cameron's four-month-old government by 27 votes over his proposed changes to the rules covering government activity during the final phase of the EU referendum campaign. - Financial Times Amlin (LSE: AML.L - news ) shares are set to jump on Tuesday morning after Japan's Mitsui Sumitomo Insurance admitted that it is considering buying the Lloyd's of London insurer. A deal could cost Mitsui more than 500bn yen (£2.75bn), the Nikkei newspaper had claimed earlier on Monday. A spokesman for the Japanese firm said the matter will be discussed at a board meeting on Tuesday and details will be released when a decision has been reached. - Telegraph Justin King, the former chief executive of J Sainsbury (Other OTC: JSAIY - news ) , has taken on his first major role after leaving the supermarket giant. The 54-year-old retail veteran, who has also held senior positions at Marks & Spencer (Other OTC: MAKSF - news ) and Asda, has agreed to join UK private equity firm Terra Firma Capital Partners as vice-chairman, according to reports. - Telegraph A City investment firm is to vote against the re-election of Sports Direct's non-executive directors and executive deputy chairman, Mike Ashley, at the retailer's annual shareholder meeting on Wednesday. Ashley Hamilton Claxton, corporate governance manager at Royal London Asset Management (RLAM), which owns about £8.3m of Sports Direct shares, said: \"We have lost confidence in the board and are very concerned about the long list of corporate governance failings that have not been addressed.\" - Guardian More than 2,000 City financiers took home more than £730,000 (€1m) in 2013, according to the EU banking regulator. One was handed more than £13m. The European Banking Authority said more bankers in the UK received at least €1m than in the rest of the EU combined. - Guardian Companies are planning to put the brakes on hiring before the introduction of the new living wage, even in the run-up to the traditionally frantic Christmas trading season. Manpower, the recruitment firm, warned that job prospects for the rest of the year were dwindling and had reached their weakest for three years. - The Times Ministers are to examine a deal that hands Russia's Gazprom interests in the UK North Sea, amid calls for Britain to send \"a clear message\" to Vladimir Putin over Ukraine. The state-backed energy group's purchase of a 50 per cent stake in BASF subsidiary Wintershall's North Sea business, which includes the Wingate gas platform and several offshore UK exploration licences, will be an early test for energy secretary Amber Rudd. - Financial Times", "external_links": [], "published": "2015-09-08T10:43:00.000+03:00", "crawled": "2015-09-08T10:48:52.963+03:00", "highlightTitle": ""}