{"organizations": [], "uuid": "a106a846aff615799fefae7e8feaf3874323f99e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/strike-S.jpg", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/banks-strike-against-modi-likely-today-financial-services-to-be-hit-by-nationwide-protest/129046", "country": "IE", "title": "Bharat bandh: Normal life hit as day-long nationwide strike begins", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Bharat bandh: Normal life hit as day-long nationwide strike begins | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T16:36:00.000+03:00", "replies_count": 0, "uuid": "a106a846aff615799fefae7e8feaf3874323f99e"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/banks-strike-against-modi-likely-today-financial-services-to-be-hit-by-nationwide-protest/129046", "ord_in_thread": 0, "title": "Bharat bandh: Normal life hit as day-long nationwide strike begins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Normal life was affected in various parts of the country, including in West Bengal and Kerala, as 10 central trade unions today went on a day-long nationwide strike to protest against changes in labour laws and privatisation of PSUs.\nBJP -backed BMS and NFITU however stayed away from the strike.\nTrade union leaders claimed that around 15 crore formal sector workers are on strike in support of their 12-point charter of demands.\nThe day long strike was seen affecting transport and banking operations among other services.\nIn Kolkata, partial impact was seen on suburban trains while shops, markets and business establishments in most areas remained closed.\nState administration was plying a large fleet of public buses while partial impact was seen on operations of private buses and taxis.\nIn the National Capital, commuters faced problems as a large number of autos and taxis remained off the roads.\nIn Kerala, public and private bus services, taxis and autorickshaws were off the roads. Only few private cars and two wheelers were seen on the roads.\nShops, hotels and even small tea stalls were closed in the state.\nThe government had yesterday appealed trade unions call off the agitation in the interest of workers and nation.\nThe unions however decided to go ahead with strike as their talks with a ministerial panel headed by Finance Minister Arun Jaitley last month did not make any headway on their 12-point charter of demands.\nTrade unions’ 12-point charter of demands includes urgent measures to contain price rise, contain unemployment, strict enforcement of basic labour laws, universal social security cover for all workers and minimum wage of Rs 15,000 per month.\nThey are also demanding enhanced pension for workers, stoppage of disinvestment in PSUs, stoppage of contractorisation, removal of ceiling on bonus and provident fund, compulsory registration of trade unions within 45 days, no amendment to labour laws unilaterally, stopping of FDI in Railways, Defence etc.\n 02, 2015 8:36 am", "external_links": [], "published": "2015-09-02T16:36:00.000+03:00", "crawled": "2015-09-03T22:58:19.046+03:00", "highlightTitle": ""}