{"organizations": ["Peterson Institute", "World Bank", "IPR", "ET Bureau", "Asia-Pacific Economic Cooperation and Trans Pacific Partnership", "Peterson Institute for International Economics"], "uuid": "b526618e2638e43c4f727b72c97d1ede36e28c09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-49019701,width-600,resizemode-4/us-calls-for-smother-tax-regime-ease-of-doing-business-in-india.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358311.cms", "section_title": "Finance-Banking/Finance-Industry-The Economic Times", "url": "http://economictimes.indiatimes.com/industry/banking/finance/us-calls-for-smother-tax-regime-ease-of-doing-business-in-india/articleshow/49019685.cms", "country": "IL", "title": "US calls for smother tax regime, ease of doing business in India", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "US calls for smother tax regime, ease of doing business in India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T01:30:00.000+03:00", "replies_count": 0, "uuid": "b526618e2638e43c4f727b72c97d1ede36e28c09"}, "author": "", "url": "http://economictimes.indiatimes.com/industry/banking/finance/us-calls-for-smother-tax-regime-ease-of-doing-business-in-india/articleshow/49019685.cms", "ord_in_thread": 0, "title": "US calls for smother tax regime, ease of doing business in India", "locations": ["New York", "US", "Washington", "Silicon Valley", "India US", "Delhi", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Sushma Swaraj", "Nisha Desai Biswal", "Dipanjan Roy Chaudhury", "Nirmala Sitharaman", "Modi", "Biswal", "Fred Bergsten", "Bergsten", "Obama", "Narendra Modi"], "text": "US calls for smother tax regime, ease of doing business in India By Dipanjan Roy Chaudhury , ET Bureau | 19 Sep, 2015, 04.00AM IST   NEW DELHI: For the first time since the Modi government came to power, the Obama administration has openly called for a simplified tax regime and ease of doing business in India to attract global investments, including from the US. \"For India to achieve its goal of sustainable growth and development, it must assure global markets and international investors that it is open for business,\" Nisha Desai Biswal , US Assistant Secretary of State for South Asian Affairs, said ahead of the maiden bilateral Strategic and Commercial Dialogue (SCD) in Washington on September 22. \"Efforts to simplify its tax code and increase the ease of doing business will pay huge dividends.\" Biswal spoke at the launch of a report, 'India's Rise: A Strategy for Trade-Led Growth'by Fred Bergsten, senior fellow and director emeritus and the founding director of the Peterson Institute for International Economics. External affairs minister Sushma Swaraj and commerce minister Nirmala Sitharaman will represent India at the SCD. Prime Minister Narendra Modi will visit the US from September 23 to 28, when he will seek investments in New York and Silicon Valley. Key foreign investors, including the US, have started expressing concern over the slow pace of reforms even while they understand more time may be needed to implement some of the proposed changes. India is ranked 142 out of 189 countries in the World Bank's ease of doing business index. Acknowledging that \"some progress has been made,\" Biswal noted, \"Anyone familiar with our legislative process knows sometimes getting big things done is more difficult in vibrant democracies.\" However, she said the Modi government can send signals to show its commitment to reforms, such as the strengthening of Intellectual Property Rights (IPR). \"We know that a strong IPR regime is absolutely critical to a competitive economy - it's what underpins our economic success and, while our system isn't perfect, it does attract some of the best companies from all over the world.\" She add that India will soon transition from a net user of technology to a net producer. \"To innovate, attract investment and compete, the Indian firms creating those new technologies will need strong IPR protection,\" she said. Biswal said if the two countries can complete a bilateral investment treaty, it would become India's highest-standard investment agreement. According to the US official, such an agreement would attract much-needed capital for a variety of sectors, including infrastructure, energy, health and education. India and the US last discussed this treaty in April. Ease of doing business, IPR, proposed bilateral investment treaty and India's entry into groupings such as Asia-Pacific Economic Cooperation and Trans Pacific Partnership are expected to dominate the maiden SCD. The two countries used to hold an annual Strategic Dialogue until it was upgraded when Barack Obama visited Delhi this January. Biswal said the government's 'Make in India' initiative, aimed at creating millions of jobs in the manufacturing sector, would require the Indian economy to be better integrated with global supply chains, markets and trade. The study by Bergsten of the Peterson Institute shows that India could increase exports by $500 billion a year by joining the next stage of the Trans-Pacific Partnership.  ", "external_links": [], "published": "2015-09-19T01:30:00.000+03:00", "crawled": "2015-09-19T02:03:42.344+03:00", "highlightTitle": ""}