{"organizations": ["Worldpay", "London Stock Exchange Payment", "London Stock Exchange Worldpay Shuns Offers", "Bloomberg"], "uuid": "8cbcd1d086ff49d2a1d576e26e08506ba631ccd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/institutional-forex/wp-content/uploads/sites/9/2015/04/IPO_01_880-400.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/institutional-forex/technology/worldpay-shuns-offers-opting-to-list-on-the-london-stock-exchange/", "country": "US", "title": "Worldpay Shuns Offers, Opting to List on the London Stock Exchange", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Worldpay Shuns Offers, Opting to List on the London Stock Exchange", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T17:13:00.000+03:00", "replies_count": 0, "uuid": "8cbcd1d086ff49d2a1d576e26e08506ba631ccd9"}, "author": "", "url": "http://www.financemagnates.com/institutional-forex/technology/worldpay-shuns-offers-opting-to-list-on-the-london-stock-exchange/", "ord_in_thread": 0, "title": "Worldpay Shuns Offers, Opting to List on the London Stock Exchange", "locations": ["London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Worldpay Shuns Offers, Opting to List on the London Stock Exchange Worldpay Shuns Offers, Opting to List on the London Stock Exchange Payment processing firm Worldpay looks to raise £890 million via an IPO in London, despite a £6.6 billion offer from French rival. Advertising Print This Post photo: Bloomberg \nWorldpay Group, a British payment processor, has announced today that it plans to proceed with an IPO (initial public offering) on the London Stock Exchange (LSE), expected to take place in October. The company hopes the listing will generate £890 million ($1.4 billion), in a bid to reduce its debt and grow its already sizable business. \nThe payment giant, which is owned by the private equity firms Advent International and Bain Capital, will offer a 25% stake in the company. If the target is reached, the listing would value the company at £3.56 billion. \nCarved out of the Royal Bank of Scotland to become a stand-alone business in 2010, Worldpay provides payment services to a variety of merchants around the world, enabling them to accept 326 alternative payment methods, across multiple payment channels, nearly anywhere in the world. It processes about 31 million mobile, online and in-store transactions a day. \nIn the six months ended 30 June 2015, the company posted net revenue of £465.7 million, on track to top 2014’s figure of £863.4 million. \nThe IPO will be led by Bank of America Merrill Lynch, Goldman Sachs International and Morgan Stanley, with Barclays, Credit Suisse and UBS acting as joint bookrunners. Offers Shunned \nThe decision to list settles speculation as to whether the firm would instead accept an acquisition offer by French rival, Ingenico, of £6.6 billion. \nThe offer came after Worldpay attracted interest from a consortium of private equity bidders, including Blackstone, whose offer fell shy of £6 billion, according to the FT. \nThe IPO will enable us to access new capital for growth, augment our global proposition and enhance our ability to serve customers. \nCommenting on the announcement, Philip Jansen, Chief Executive Officer of Worldpay, said: “The IPO is an exciting and logical next step as we seek to continue this momentum. It will enable us to access new capital for growth, augment our global proposition and further enhance our ability to serve customers across the world.” \nAdding to Mr Jansen’s sentiments, Sir Michael Rake, Chairman of Worldpay, said: “Worldpay is led by an experienced management team with a clear understanding of the market and its trajectory and has demonstrated an impressive track record of sustained growth … I believe Worldpay is very well positioned to continue its leadership in the ever-evolving global payments landscape.” Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-09-18T17:13:00.000+03:00", "crawled": "2015-09-18T14:22:50.526+03:00", "highlightTitle": ""}