{"organizations": ["Deutsche Boerse"], "uuid": "a0316ae2cb29a5c3151f9fb33e57c7318b8e2b09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-reuters/?format=rss", "section_title": "Finance News | Reuters - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/exclusive-deutsche-boerse-delays-asia-120727678.html", "country": "GB", "title": "Exclusive - Deutsche Boerse delays Asia plans due to turbulence, tech woes", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Exclusive - Deutsche Boerse delays Asia plans due to turbulence, tech woes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T15:07:00.000+03:00", "replies_count": 0, "uuid": "a0316ae2cb29a5c3151f9fb33e57c7318b8e2b09"}, "author": "", "url": "https://uk.finance.yahoo.com/news/exclusive-deutsche-boerse-delays-asia-120727678.html", "ord_in_thread": 0, "title": "Exclusive - Deutsche Boerse delays Asia plans due to turbulence, tech woes", "locations": ["Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print \nBy Andreas Kröner \nFRANKFURT (Reuters) - Financial market turbulence in China and software problems have prompted Deutsche Boerse to delay its planned Asian derivatives exchange and clearing house by about 18 months, three people familiar with the plans said on Wednesday. \nThe German exchange operator had said in June the Singapore-based Eurex Asia derivatives exchange and clearing house would begin operations in the second quarter of 2016. \nProblems with the exchange's C7 clearing software were one reason for the delay, one of the people said. \"It's still not working smoothly in some tests,\" the person said. \nDeutsche Boerse Chief Executive Carsten Kengeter has been reviewing growth priorities since taking the helm in June. His predecessor, Reto Francioni, set the course firmly for expansion in Asia as crucial to the exchange operator's success in the coming years. \nWhile Kengeter, who has worked in Asia and speaks some Chinese, is still committed to the region, his most significant moves so far have been in Europe, with the takeover of foreign exchange trading platform 360T and buyouts of equity index joint ventures Stoxx and Indexium from Switzerland's Six Group. \nA Deutsche Boerse spokesman broadly confirmed the delay to Eurex Asia to 2017 due to \"internal and external\" reasons but declined to give details. \n\"The scope and objective of the project remain unchanged; the significant expansion of the Asia business is an important element of our corporate strategy,\" the spokesman said. \nBeside its plans for Eurex Asia, Deutsche Boerse announced earlier this year that it had agreed to set up a joint venture with Shanghai Stock Exchange and China Financial Future Exchange to develop and market Chinese shares, bonds and ETFs for investors outside mainland China. \n(Reporting by Andreas Kroener; Writing by Jonathan Gould; Editing by Thomas Atkins; Editing by Thomas Atkins)", "external_links": [], "published": "2015-09-09T15:07:00.000+03:00", "crawled": "2015-09-09T15:27:30.683+03:00", "highlightTitle": ""}