{"organizations": [], "uuid": "54738fe0b5d90ba21afc0b089c1d91fe6cabec12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-asia/?format=rss", "section_title": "Asian Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/forex-dollar-firm-traders-see-185803121.html", "country": "US", "title": "FOREX -Dollar firm as traders see low chance of U.S. rate hike", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "FOREX -Dollar firm as traders see low chance of U.S. rate hike", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T21:58:00.000+03:00", "replies_count": 0, "uuid": "54738fe0b5d90ba21afc0b089c1d91fe6cabec12"}, "author": "", "url": "https://uk.finance.yahoo.com/news/forex-dollar-firm-traders-see-185803121.html", "ord_in_thread": 0, "title": "FOREX -Dollar firm as traders see low chance of U.S. rate hike", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar index touches weakest level in almost 3 weeks \n* Traders focus on Fed meeting on Wednesday and Thursday \n* Disappointing Chinese data adds to global growth worries \n* Futures suggest traders see 25 pct chance of U.S (Other OTC: UBGXF - news ) . rate hike (Updates market action) \nBy Richard Leong \nNEW YORK, Sept 14 (Reuters) - The dollar held close to a three-week low against a basket of major currencies on Monday in advance of this week's Federal Reserve meeting, as investors bet interest rates would be kept at their record lows until at least December. \nThe greenback has retreated from 12-year highs set in March, as rate hike expectations have been pushed back on uneven domestic data and turbulent market conditions due to worries about China, the world's No. 2 economy. \nThough some in the market still think the Fed could act this week, the view that faltering global growth could push a move to the end of the year or even into 2016 is gathering steam. \n\"Of course China is important, but the Fed has to worry about the U.S. economy,\" said Ron Simpson, director of currency research at Action Economics in Tampa, Florida. \nAhead of the start of the Fed's two-day meeting on Wednesday, the dollar edged up 0.1 percent at 95.249 after hitting a low of 94.913, its weakest since Aug. 26. \nThe dollar was down 0.4 percent against the yen at 120.04 yen, while the euro fell 0.3 percent against the greenback at $1.1313 on light trading volume. \nU.S. interest rates futures suggest traders see about a 1-in-4 chance the Fed would raise interest rates for the first time since 2006 on Thursday. \nMore disappointing numbers from China added to worries about a slowdown in the world's second-biggest economy. Growth in investment and factory output missed forecasts, raising the risk that Chinese growth may slow to below 7 percent in the third quarter for the first time since the global financial crisis. \n\"If there is an uncertain world, if China is slowing aggressively, then you have a situation where the Fed may well reconsider raising interest rates,\" said Bank of New York Mellon FX strategist Neil Mellor in London. \nCurrency speculators in the week ended Sept. 8 raised bullish bets on the greenback for the first time in about a month, the latest figures showed, suggesting that some in the market are betting on a move. \nEven (Taiwan OTC: 6436.TWO - news ) if there were to be a rate hike this week, the dollar could come under pressure if Fed policymakers downgrade their views on the appropriate path for interest rates in 2016, said Masashi Murata, currency strategist for Brown Brothers Harriman in Tokyo. (Additional reporting by Jemima Kelly in London, Ian Chua in Sydney and Masayuki Kitano in Singapore; Editing by Dan Grebler and Meredith Mazzilli)", "external_links": [], "published": "2015-09-14T21:58:00.000+03:00", "crawled": "2015-09-15T03:24:02.524+03:00", "highlightTitle": ""}