{"organizations": [], "uuid": "184bf7a20d6bc77ae09adfc75a3915ebbb2f8a92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/25/refinery-aruba-citgo-pete-idUSL1N11V1F320150925", "country": "US", "title": "UPDATE 1-Aruba signs agreement with Citgo Petroleum to operate idled refinery", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Aruba signs agreement with Citgo Petroleum to operate idled refinery | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T21:36:00.000+03:00", "replies_count": 0, "uuid": "184bf7a20d6bc77ae09adfc75a3915ebbb2f8a92"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/25/refinery-aruba-citgo-pete-idUSL1N11V1F320150925", "ord_in_thread": 0, "title": "UPDATE 1-Aruba signs agreement with Citgo Petroleum to operate idled refinery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Updates with context, details on agreement)\nORANJESTAD, Sept 25 (Reuters) - Aruba's Energy Ministry said on Friday it has signed a memorandum of understanding with PDVSA's U.S. unit Citgo Petroleum to explore reopening and operating the island's refinery, idled since 2012.\nThe 235,000-barrel-per-day refinery, which was operated by U.S. firm Valero Energy Corp., closed because of high operating costs and low margins. Attempts to reopen some of its processing units or sell it to firms including Venezuela's PDVSA and PetroChina have been unsuccessful.\n\"Citgo will send a group to evaluate the refinery technically and financially,\" Aruba's government said in a statement.\nThe facility is currently used as an oil storage terminal, with state-run oil company PDVSA among its main clients.\nValero's CEO said last year that the firm was not interested in reopening it, but PDVSA and Citgo could use the nearby refinery to produce much needed heavy naphtha, used as diluent to make oil more marketable.\nBut lack of enough deep conversion capacity to transform heavy crudes into light products has been one of the main obstacles to any sale.\nPDVSA and Valero were not immediately available to comment.\nNegotiations with Aruba would involve Valero and the Netherland's government in a later feasibility stage, the memorandum signed in Houston said.\n\"Citgo would guarantee crude supply (for the refinery) and experience,\" the statement said, adding that the contract could cover at least 20 years of operations. (Reporting by Sailu Urribarri, with additional reporting by Alexandra Ulmer in Caracas. Written by Marianna Parraga; Editing by David Gregorio)", "external_links": [], "published": "2015-09-25T21:36:00.000+03:00", "crawled": "2015-09-25T20:55:57.952+03:00", "highlightTitle": ""}