{"organizations": [], "uuid": "95a64968b1243156acfa375746235235fdf617eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/national-cancer-institute-at-jhajjar-pmo-pushes-but-ministry-delays/43495.html", "country": "IN", "title": "National Cancer Institute at Jhajjar: PMO pushes but ministry delays?", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "National Cancer Institute at Jhajjar: PMO pushes but ministry delays? - Moneylife", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T19:24:00.000+03:00", "replies_count": 0, "uuid": "95a64968b1243156acfa375746235235fdf617eb"}, "author": "IANS", "url": "http://www.moneylife.in/article/national-cancer-institute-at-jhajjar-pmo-pushes-but-ministry-delays/43495.html", "ord_in_thread": 0, "title": "National Cancer Institute at Jhajjar: PMO pushes but ministry delays?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The institute is slated to come up at the Jhajjar, Haryana campus of the All India Institute of Medical Sciences (AIIMS), about 60 km from Delhi, and will offer tertiary care facilities other than those meant for cancer \n \nThe Rs2,035-crore National Cancer Institute (NCI) - touted as one of the biggest government-run health projects in the country - has got a nudge from the Prime Minister's Office (PMO). The project was delayed by almost a year, but the PMO has directed that it should be completed before the September 2017 deadline. And there lies the catch - a key minister doesn't have the time for it.   The institute is slated to come up at the Jhajjar, Haryana campus of the All India Institute of Medical Sciences (AIIMS), about 60 km from Delhi, and will offer tertiary care facilities other than those meant for cancer.   AIIMS sources, however, say the delays have mainly been because of the inability to hold a meeting of the Institute Body headed by Health Minister J.P. Nadda to award the tender for the construction work. Such important decisions are taken by the Institute Body that is the apex decision-making panel for AIIMS. The Institute Body also chooses the governing body members. However, after the Narendra Modi government assumed power last May, the new Institute Body has not even been appointed.   After a meeting chaired by principal secretary to the prime minister Nripendra Misra, on July 11, 2015, a decision was taken that: \"The project of NCI should be viewed as a flagship health institute project and the construction should be completed six months before the targeted date of completion.\" IANS has seen the document.   The meeting was attended by secretary of the union health ministry, the chief secretary of the Haryana government, the AIIMS director, the joint secretary in charge of AIIMS in the health ministry, the AIIMS deputy director (Administration), the chief of the Institute Rotary Cancer Hospital (IRCH) at AIIMS; the chirmen of NBCC and HSCC chairman and the head of the AIIMS gastroenterology department.   A senior health ministry official, however, told IANS: \"The ministry had taken a decision to grant total autonomy to the new AIIMS. Greater powers in terms of administration and financial decisions should be given to the institute bodies. That is why a decision has been taken that the contract for the campus in Jhajjar should be granted by the institute body and not the ministry. This will give them a sense of empowerment, responsibility and help in expediting the decision making in the long run. The AIIMS Institute Body is all set to be constituted within a fortnight and the contract for the construction will be granted immediately after that by the newly appointed body.   \"This would help to make the AIIMS project run more efficiently in a time-bound manner,\" the official added.   The parliamentary standing committee on health and family welfare, on August 11, had also observed that the development of AIIMS campus-II in Jhajjar, Haryana was an ambitious project and would require not only massive allocation of funds but also sustained monitoring.   The committee wanted health ministry to ensure that development of the project was executed within the initial estimated project costs and time-frame to avoid any time-overruns and cost escalation.   The cabinet approved the project on December 26, 2013. About 300 acres has been earmarked, out of which 32 acre has been allotted for the National Cancer Institute (NCI), which has been assigned more than 700 beds.   But the question remains whether the project will be accomplished within the targeted date. The proposed date of the start of the project was January 1, 2014 and the duration of the project was 45 months. The target date of completion is September 2017.   \"The award of work for the institute block at NCI should have been completed within nine months (September, 2014) of the start of the project (January 1, 2014) and the construction should have started in the tenth month (October, 2014). It's been more than year-and-a-half now, but still the award of work has not been done. How is it possible to complete the work within the stipulated time-frame,\" asked an AIIMS source, not wishing to be identified.   The decision to award the tender to Shapoorji Pallonji & Company Ltd. was taken in the standing finance committee (SFC) meeting of AIIMS on May 26, but the approval had to come from the highest decision-making bodies of AIIMS. The Institute Body has to convene to constitute the Governing Body of AIIMS. The Institute Body meeting is now likely to take place in October.   \"The award of work has been stalled for four months, even if it was decided in the last SFC meeting. The Institute Body meeting which was scheduled on August 6 was cancelled by Health Minister J P Nadda. By doing so, the project is getting delayed further,\" the source added.   Reacting to this, the AIIMS deputy director (Administration), V. Srinivas said: \"Statutory clearances from the Ministry of Environment & Forests, National Board of Wildlife, State Board of Wildlife, Haryana, and the Departments of Town & Country Planning, Fire, Irrigation, Electricity Board, PHED and Labour in the government of Haryana for the National Cancer Institute have been received. All efforts are being made to ensure timely commencement of works and adherence to prescribed timelines.\"   The other institutes proposed for the Jhajjar campus are National Cardiovascular Centre, General Purpose Hospital, National Transaction and Training Centre, National Centre for Child Health, Digestive Diseases Centre, National Institute of Geriatrics, Comprehensive Rehabilitation Centre and National Institute of Nursing Research.   * Project cost Rs 2,035 crore    * Building Services: Rs 933 crore   * Special works (furniture, IT, infrastructure): Rs. 136 crore   * Medical equipment: Rs.713 crore   * Project consultancy fee: Rs.100 crore   * Recurring cost for first year of operation: Rs.153 crore   Manpower requirements   * Administrative staff: 61   * Clinical staff: 1,080   * Research staff: 88   * Nursing staff: 498   * Engineering staff: 55   * Staff outsourced: 923   * Total staff: 2,705   Number of beds required at NCI: 710", "external_links": [], "published": "2015-09-28T19:24:00.000+03:00", "crawled": "2015-09-28T14:09:34.536+03:00", "highlightTitle": ""}