{"organizations": [], "uuid": "13319f8ca251bd8bee8e0ee60d484857265213b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-11/as-charter-school-bond-sales-rise-pennsylvania-fight-shows-risk", "country": "US", "title": "As Charter School Bond Sales Rise, Pennsylvania Fight Shows Risk", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "As Charter School Bond Sales Rise, Pennsylvania Fight Shows Risk - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T12:01:00.000+03:00", "replies_count": 0, "uuid": "13319f8ca251bd8bee8e0ee60d484857265213b1"}, "author": "Romy Varghese", "url": "http://www.bloomberg.com/news/articles/2015-09-11/as-charter-school-bond-sales-rise-pennsylvania-fight-shows-risk", "ord_in_thread": 0, "title": "As Charter School Bond Sales Rise, Pennsylvania Fight Shows Risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At Chester Upland School District, one of Pennsylvania’s poorest, the receiver appointed by Governor Tom Wolf to oversee its finances moved to cut $25 million from the charter schools that teach more than half of its 7,200 students outside of Philadelphia.\nThe effort was blocked by a judge last month, giving a reprieve to the privately-run schools -- and the bondholders repaid with taxpayer funds. \"Those schools would have been forced to close,” said Bob Fayfich, executive director of the Pennsylvania Coalition of Public Charter Schools.\nThe skirmish in Pennsylvania underscores the pitfalls for investors following a surge in bond sales by charter schools, which receive funding based on how many students enroll. The independently operated institutions provide parents an alternative to poorly performing neighborhood schools.\nIn cities including New York, Chicago and Detroit, teachers’ unions are fighting the expansion of charters, saying they siphon money from traditional schools. Last week, the Washington State Supreme Court deemed them unconstitutional because they’re not accountable to voters, jeopardizing funding for the schools in that state.\nSecurities sold by the upstarts are among the riskiest in the $3.6 trillion municipal market because the schools fail if students don’t sign up or they’re shut down because of poor results. Forty-one, or 5 percent, of the 818 charter-school bond deals sold since 1998 have defaulted, according to a survey released in July by the New York-based Local Initiatives Support Corp., which assists the institutions. That compares with a default rate of 0.02 percent for municipal issues rated by Moody’s Investors Service since 1970.\nStandard & Poor’s said in an August report that it expects more downgrades than upgrades this year to the charter schools it rates because of their small size and limited financial flexibility.\n“Political risk is part of the equation,” said John Miller, co-head of fixed income in Chicago at Nuveen Asset Management, which oversees about $100 billion of municipal debt including securities from Pennsylvania charter schools. “It’s not a risk-free credit category.”\nWith municipal-market yields holding near a half-century low, investors have snapped up charter-school bonds, which offer higher payouts than debt sold by states or cities because of the risk. About $1.4 billion of the securities have been sold this year, following a record $1.9 billion in 2014, according to data compiled by Bloomberg.\nChester Upland School District, in an impoverished stretch of the suburbs southwest of Philadelphia, had 3,890 enrolled in charter schools in the past year, according to state figures. The Chester Community Charter School, which educates about 3,000 of them, sold $57 million of bonds in 2010 to buy buildings it uses.\nThe district has contended with chronic deficits despite being under state control since 1994. Wolf tried to close the $23 million shortfall in its $139 million budget this year by cutting special-education payments to charter schools to $16,000 per student from $40,000 and capping the tuition the state will pay for online instruction.\nThe governor, who took office in January, said that Chester was sending more special-education funding to charter schools than other districts. Its payments were the biggest in the state and $9,000 more than the district with the next highest in the region.\nJeffrey Sheridan, a spokesman for the governor, said the administration is “committed to drastic, but necessary” actions to stabilize the Chester school system.\nThe potential funding loss had led investors to demand higher yields on bonds sold by the Chester Community school compared with top-rated securities. A tax-exempt security due August 2030 traded Sept. 4 at an average yield of 5.9 percent, or 3.23 percentage points over benchmark munis, Bloomberg data show. The difference was as little as 2.7 percent in March.\nMax Tribble, a spokesman for CSMI LLC, the company that manages the community school, and David E. Clark Jr, the school’s chief executive officer, didn’t return calls for comment.\nAkosua Watts, who runs the Chester Charter School for the Arts, which has 490 students, said the school is already owed $1.8 million from the state, and the cuts first proposed by Wolf could have forced it to close. \"We’re in a tight situation,\" she said. \"We’re doing the best we can to manage.\"\nShe and other school officials received a break on Aug. 25, when Delaware County Judge Chad Kenney, who must approve the district’s financial plans, rejected the governor’s cutbacks. Sheridan said the receiver will propose another blueprint this month and that he disagrees with those who said the previous one would have shuttered schools.\n“Governor Wolf believes charter schools can be an innovative approach to public education and should be part of our public education system, but charter schools must be held to the same standards to which public schools are held,” Sheridan said.\nThe fight in Chester may not be the last in Pennsylvania. In the proposed budget for the year that began in July, which has yet to be approved by the Republican-controlled legislature, Wolf wanted to cap the tuition payments for online charter schools.\nThere will probably be more efforts to reduce payments or curb enrollment in the state’s charters, said Thomas Stoeckmann, a senior research analyst in Menomonee Falls, Wisconsin, for Wells Capital Management, which oversees $38 billion of municipal bonds, including those from charter schools.\nSuch risk “definitely has increased and has probably been more pronounced since the recent election,” he said.", "external_links": ["http://www.media.pa.gov/Pages/education-Details.aspx?newsid=175\\"], "published": "2015-09-11T12:01:00.000+03:00", "crawled": "2015-09-11T16:59:37.072+03:00", "highlightTitle": ""}