{"organizations": [], "uuid": "ab294bf0833bbad21e9472532ace76a167f685f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-targetukfocus/?format=rss", "section_title": "Finance News | Reuters - UK Focus - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/european-repo-market-growth-stalls-040000276.html", "country": "US", "title": "European repo market growth stalls on regulatory pressures", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "European repo market growth stalls on regulatory pressures", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T07:00:00.000+03:00", "replies_count": 0, "uuid": "ab294bf0833bbad21e9472532ace76a167f685f2"}, "author": "", "url": "https://uk.finance.yahoo.com/news/european-repo-market-growth-stalls-040000276.html", "ord_in_thread": 0, "title": "European repo market growth stalls on regulatory pressures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 29, 2015, 06:24 BST - UK Markets open in 1 hr 36 mins European repo market growth stalls on regulatory pressures Reuters - UK Focus – 1 hour 24 minutes ago \n* European repo activity down 2.9 pct y/y -ICMA \n* European repo activity up 2 pct in last six months -ICMA \n* Regulatory plans hurt repo market outlook \nLONDON, Sept 29 (Reuters) - European repo market growth has stalled as regulatory changes introduced to prevent a repeat of the global financial crisis constrain this wholesale lending market. \nAlthough some very large banks increased business ahead of implementation of new regulations, the overall market grew by just 2 percent in the last six months - compared to rates ten times bigger in the years before the crisis. \nIn repos, or repurchase agreements, short-term loans are offered in return for collateral such as government or corporate bonds. Repos are a crucial source of secured short-term funding in the economy and the market is regarded as a bellwether for the health of the financial system. \nA twice-yearly survey by the European Repo Council of the International Capital Market Association (ICMA) showed the market grew to 5.61 trillion euros at close of business on June 10 compared with 5.50 trillion six months earlier. \nBut year-on-year activity in the market contracted by 2.9 percent, the snapshot of the value of outstanding repo contracts showed. \n\"If you look at the trend over the last few years, the market is flatlining, it is going sideways,\" the report's author, Richard Comotto, said. \nPUSH AND PULL \nThe European repo market is balanced between bearish and bullish factors. \n\"Earlier in the year the fixed income market was quite buoyant. But at the same time we have the increasing weight of regulation coming down on us,\" Comotto said. \nBanks are adjusting the post-crisis regulatory framework, including tighter leverage and funding ratios. \nThe small reported growth rate over the last six months was attributable to higher business activity often seen mid-year and to increased activity from some large banks. \nAlthough most respondents' repo books contracted again, this was more than offset by \"very significant increases\" from a few of the very largest banks, the report said. \n\"The banks that increased activity have been able to do so because new regulations that will constrain their balance sheets have yet to be finalised and/or fully implemented,\" ICMA said. \nThis gives banks the opportunity to take up a bit of extra business if they see it, Comotto said. \nIt (Other OTC: ITGL - news ) is unlikely we will see the 20 percent annual growth rates common before the financial crisis again, Comotto said. \n\"Other things being equal, we are likely to see a shallow downward trend, possibly with a significant dip at some point in the next couple of years as all the regulation comes into play,\" he said. \nDIRECT NEGOTIATIONS UP \nThe semi-annual survey also showed that directly-negotiated repo transactions increased, continuing a trend since 2012 away from electronically-traded business and towards higher-margin business. \nThis drop in electronic trading may be related to an increase in non-government collateral used to secure repo lending, ICMA said \nNon-government bonds have to be traded through direct or voice-brokered repo. \nThe share of government bonds within the pool of EU-originated fixed-income collateral fell to 77 percent, from 81.5 percent. \nNon-government bond and equity collateral rose to 16.5 percent from 13.1 percent of the overall survey. (Reporting by Lisa Barrington; Editing by Toby Chopra)", "external_links": [], "published": "2015-09-29T07:00:00.000+03:00", "crawled": "2015-09-29T08:27:35.114+03:00", "highlightTitle": ""}