{"organizations": ["Business & Finance"], "uuid": "6cb6d8bbd7446756f0d852acfe58197d68b58c7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/qvm8pcb55j_wcs1vih77o_ruralbanks.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/642939/1/five-rural-banks-face-liquidity-challenges.html", "country": "US", "title": "Five rural banks face liquidity challenges", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Five rural banks face liquidity challenges", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T01:00:00.000+03:00", "replies_count": 0, "uuid": "6cb6d8bbd7446756f0d852acfe58197d68b58c7d"}, "author": "", "url": "http://www.modernghana.com/news/642939/1/five-rural-banks-face-liquidity-challenges.html", "ord_in_thread": 0, "title": "Five rural banks face liquidity challenges", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business & Finance | 15 September 2015 23:00 CET Five rural banks face liquidity challenges By GNA \nAwutu Bawjiase (C/R) Sept 15, GNA - Five Rural Banks in the Central Region are facing eminent liquidity challenges as a result of bad management and improper internal control by their various managements and Board of Directors. \nMr. Acquah Arhin, President of the Central Regional Chapter of the Association of Rural Banks made this known when he addressed the 25th Annual General Meeting (AGM) of the Bawjiase Area Rural Bank at Awutu Bawjiase. \nThe President disclosed that as at the end of July this year, eight rural banks were in a serious distressed situation, and their top managers had been ordered to proceed on leave pending investigations. \nHe said the Boards of Directors of the banks facing eminent distress had also been dissolved and replaced with interim boards to run the affairs of the banks until substantive boards were appointed. \nMr. Arhin said out of the eight distressed banks, five are in the Central Region facing liquidity challenges in their various operations \nThe President of the Chapter, however, did not mention the affected rural banks. \nThe Central Regional Chapter President asked managers of rural and community banks to live within their means, rather than indulge in affluent lives which could contribute to the collapse of their various banks. \nMr. Arhin commended the Management and Board of Directors of the Bawjiase Area Rural Bank for their splendid performance in previous years. \nMr Arhin who is also the Board Chairman of the Awutu Emasa Rural Bank, urged shareholders of the bank to purchase more shares to increase the share capital of the bank. \nMr. Emmanuel Osei, Chairman of the Board of Directors of the Bawjiase Area Rural Bank, said the bank posted operating income of 5,339,382 million Ghana Cedis in 2014, as against 4, 454,631 million Ghana Cedis in 2013. \nHe said the total assets of the bank improved significantly,when it increased from 18,120,757 million Ghana Cedis in 2013, to 21, 237,233 million Ghana Cedis in 2014. \nMr. Osei said total loans disbursed grew from 22, 857,178 million Ghana Cedis to 29,199,330 million Ghana Cedis. \nHe said investments in a short-term security, such as treasury bills, increased from 5,898,566 Ghana Cedis in 2013, to 7,273,298 million Ghana Cedis in 2014, representing 23.31 percent increase over the figures for the previous year. \nMr. Osei disclosed that the board had proposed a dividend of 230,000 Ghana Cedis, which represent 0.0277 Cedis per share. \nThe Chairman announced that the bank had a stated capital of 1,876,620 Million Ghana Cedis, which was far above the regulatory minimum of 1,000,000 Ghana Cedis required by the Bank of Ghana (BoG). \nMr. Osei said the bank's board had set aside an amount of 21,346 Ghana Cedis, representing two percent of the total profit for the year under review, as a scholarship fund to cater for brilliant but needy students in the bank's catchment area. \nMr. Benjamin Chemeh, Deputy Head Finance, on behalf of Mr. Kwadwo A. Kusi, Managing Director (MD) of the ARB Apex Bank congratulated the shareholders, the board of directors, management and staff of the Bawjiase Area Rural Bank, for the consistent improvement in its performances over the years. \nHe said banking business had become very competitive and risky, and advised boards of rural and community banks to institute risk management policies to identify, assess, monitor and control the risks. \nMr Kusi said the ARB Apex was established to support the rural and community banks to realize their full potentials by contributing to the socio-economic development of their catchment areas. \nGNA", "external_links": [], "published": "2015-09-16T01:00:00.000+03:00", "crawled": "2015-09-16T00:27:19.105+03:00", "highlightTitle": ""}