{"organizations": ["IPR", "Sisvel UK", "Sisvel S.p.A.", "Sisvel Group", "Philips", "Sisvel Wireless", "Philips Intellectual Property", "Royal Philips N.V. Legal Department", "ATSS", "Luxembourg Sisvelis", "Sisvel"], "uuid": "a2b3895359d7a88d61df8b0928ab2abf90cc5ed7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/ben-g-j-beune-joins-sisvel-head-licensing-operations-group/45279", "country": "US", "title": "Ben G. J. Beune Joins Sisvel to Head the Licensing Operations of the Group", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Ben G. J. Beune Joins Sisvel to Head the Licensing Operations of the Group", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T10:50:00.000+03:00", "replies_count": 0, "uuid": "a2b3895359d7a88d61df8b0928ab2abf90cc5ed7"}, "author": "", "url": "http://businesswireindia.com/news/news-details/ben-g-j-beune-joins-sisvel-head-licensing-operations-group/45279", "ord_in_thread": 0, "title": "Ben G. J. Beune Joins Sisvel to Head the Licensing Operations of the Group", "locations": ["United States", "Hong Kong", "Tokyo", "DC", "Sisvel Germany", "Luxembourg", "United Kingdom", "Italy", "Metropolitan Washington", "Stuttgart", "Sisvel US", "Germany", "China", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ben G. J. Beune", "Ben", "Blu Ray", "Beune", "Karel van Lelyveld", "Sisvel"], "text": "Wednesday, September 16, 2015 1:20PM IST (7:50AM GMT) Ben G. J. Beune Joins Sisvel to Head the Licensing Operations of the Group Luxembourg, Luxembourg Sisvelis pleased to announce today the appointment of Ben G. J. Beune as the new Executive Vice President and Chief Licensing Officer (CLO) of the Group. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150916005033/en/ (Photo: Business Wire) Mr. Beune, has an extensive expertise in managing Intellectual Property. He worked many years for Royal Philips N.V. Legal Department and later on as Senior Vice President and License Director for Philips Intellectual Property and Standards (Philips IP&S). In recent years, he was Executive Vice President and Chief Operating Officer of One-Red, LLC. In both Philips IP&S and One-Red Mr. Beune was responsible for the global implementation of CD, DVD and Blu Ray patent licensing programs. “I am glad to welcome Mr. Beune into the Sisvel Group,” said Karel van Lelyveld, CEO of Sisvel International. “I have known Ben for a long time, he shares our values and our focus in fostering a fair environment for innovation. His career has been marked by outstanding performance and he has demonstrated remarkable talent and knowledge of this business. For Sisvel Mr. Beune is the right person to lead the licensing activities of the company, he will be the driving force of the Group in its further development and growth as the guardian of Intellectual Property.” “I am delighted with the opportunity to join Sisvel Group,” said Mr. Beune. “I believe Sisvel has a set of assets which make them unique in this business. The company is one of the few true independent licensing entities, with over 30 years of experience in managing Intellectual Property. Further, it has its own department of technical experts, which provide 360-degree IPR assistance and a significant worldwide presence. I am looking forward to contributing to the company’s continued success and leadership in the protection and licensing of Intellectual Property.” Among other licensing programs, Sisvel is currently managing patents in key technological fields, such as LTE and LTE-Advance, Wireless (mobile communications devices and services) and Wi-Fi. About Sisvel Started in 1982 when Sisvel S.p.A. was founded in Italy, the Sisvel Group has become a world leader in managing intellectual property and maximizing the value of patent rights. The Sisvel Group is global in scope and reach, with companies in Italy (Sisvel and Sisvel Technology in None Torinese), the United States (Sisvel US and Audio MPEG in Metropolitan Washington, DC), China (Sisvel Hong Kong), Japan (Sisvel Japan in Tokyo), Germany (Sisvel Germany in Stuttgart), Luxembourg (Sisvel International), and the United Kingdom (Sisvel UK), with over one hundred professionals worldwide with engineers, legal, and licensing expertise. Sisvel has a long history of managing successful patent portfolios including those related to the audio compression standards known as MP3 and MPEG Audio, and widespread technologies such as OSD (On Screen Display), ATSS (Automatic Tuning & Sorting System), and WSS (Wide Screen Signalling - for automatic switching of television image formats). Sisvel currently operates patent pools and joint licensing programs for the DVB-T, DVB-T2, LTE/LTE-A and Wi-Fi standards, together with its Sisvel Wireless licensing program and is in the process of creating a new licensing program for DVB-C2. For additional information, please visit: www.sisvel.com", "external_links": [], "published": "2015-09-16T10:50:00.000+03:00", "crawled": "2015-09-16T11:19:01.732+03:00", "highlightTitle": ""}