{"organizations": [], "uuid": "b4f3ac8258090f7830378f042fe466abf9f1e478", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8902021_G.jpg", "site_section": "http://www.cbs8.com/category/120652/money", "section_title": "Money: Personal Finance, Business, Small Business news features - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30138193/vw-18m-commercial-vehicles-700000-seat-cars-affected", "country": "US", "title": "VW: 1.8M commercial vehicles, 700,000 SEAT cars affected", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "VW: 1.8M commercial vehicles, 700,000 SEAT cars affected - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "b4f3ac8258090f7830378f042fe466abf9f1e478"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30138193/vw-18m-commercial-vehicles-700000-seat-cars-affected", "ord_in_thread": 0, "title": "VW: 1.8M commercial vehicles, 700,000 SEAT cars affected", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (AP) - Volkswagen said Tuesday that 1.8 million commercial vehicles are among those affected by the emissions-rigging scandal, while Spanish unit SEAT said 700,000 of its cars were fitted with the diesel engine in question.\nVolkswagen AG has admitted using a piece of engine software to cheat on diesel car emissions tests in the U.S. It said last week the engines concerned are in some 11 million vehicles worldwide, far more than the 482,000 originally identified by U.S. authorities.\nDetails have emerged gradually of how many were made by which VW division. Guenther Scherelis, a spokesman for the commercial vehicles unit - which makes vans and pickups - on Tuesday confirmed a report in the daily Hannoversche Allgemeine Zeitung that 1.8 million of its vehicles were affected. He didn't give further details.\nSpanish subsidiary SEAT said it fitted 700,000 vehicles with the EA 189 diesel engines in which Volkswagen has said there are \"discrepancies.\"\nSEAT said the cars were sold worldwide and it was seeking to determine how many were sold in each market.\nAlso fitted with the suspect software were 5 million VW brand cars, 2.1 million Audis and 1.2 million Skodas.\nSEAT and Volkswagen-Audi Spain on Tuesday ordered a suspension of sales of all SEAT, Volkswagen, Audi, Skoda and Volkswagen commercial vehicles with the EA 189 diesel engine. It said this decision would affect 3,320 vehicles currently in stock.\nIn Brussels, European Union Industry Commissioner Elzbieta Bienkowska was scheduled to meet Tuesday with Volkswagen brand chief Herbert Diess.\n\"We expect Volkswagen to explain the situation,\" said EU spokesman Ricardo Cardoso. \"The Commission wants facts and wants to get to the bottom of this.\"\nThe German government last week set up a commission of inquiry on the scandal. Transport Ministry spokesman Martin Susteck said that the panel is in contact with the U.S. Environmental Protection Agency.\n ", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T15:51:35.300+03:00", "highlightTitle": ""}