{"organizations": [], "uuid": "ec8fa0ac3f9b498c7eb87a33cf27474940d0ad7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/s/f/i/a/image.related.afrArticleLead.620x365.gjs11d.png/1442914620927.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/industrial-relations/mua-wanted-insurance-deal-with-800000-commission-20150922-gjs11d", "country": "AU", "title": "MUA wanted insurance deal with $800,000 commission", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "MUA wanted insurance deal with $800,000 commission | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T16:19:00.000+03:00", "replies_count": 0, "uuid": "ec8fa0ac3f9b498c7eb87a33cf27474940d0ad7d"}, "author": "Matthew Stevens and Lucille Keen", "url": "http://www.afr.com/news/policy/industrial-relations/mua-wanted-insurance-deal-with-800000-commission-20150922-gjs11d", "ord_in_thread": 0, "title": "MUA wanted insurance deal with $800,000 commission", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The maritime union has backed down on an income protection insurance deal that would have meant it received $800,000 in commission. Dallas Kilponen by Matthew Stevens and Lucille Keen The maritime union pressured shipping company DP World to pay income insurance for its employees using a scheme that would have paid the union a $800,000 commission.\nMaritime Union of Australia members in Melbourne and Brisbane voted against a workplace agreement because DP World would not agree to paying Protect Income Protection, which is owned by the Electrical Trades Union, to provide the insurance cover. The MUA would have received $200,000 a year in commission from the four-year deal.\nOn Tuesday, MUA assistant national secretary Warren Smith said the union had since decided it would not take commission. He said MUA members were in favour of the arrangement because it was a \"gift horse\" that could help them with union campaigns and services to members.\n\"We're prepared to not do it for political reasons,\" Mr Smith said. \"Absolutely MUA will not take commissions off Protect.\"\nDP World, which refused to agree to the deal, took the $14 million contract to an open tender and found QBE would provide the insurance cheaper. The difference between what the company had agreed to spend and will pay, estimated at up to $5.7 million, will be distributed back to the employees.\nMr Smith said the decision was made after questions were raised over the deal and he expected the commission to end up in the \"clutches of some unprincipled insurance agent\".\n\"That's the contradiction of it all,\" he said.\nMr Smith denied the union backed away from accepting commission because of the Royal Commission into Trade Union Governance and Corruption. He said it was the company's resistance to agree to a scheme with such an arrangement.\n \"No, because we were taking commissions from income protection in other policies,\" he said.\nProtect, which is chaired by former Electrical Trades Union Victorian state secretary and the former president of the Victorian Trades Hall Council, Dean Mighell, was criticised in the commission last year when it was revealed that the ETU received $3.7 million in what it labelled as a \"management fee\".\nThe Construction, Forestry, Mining and Energy Union came under fire in the commission after it was revealed the union received several millions of dollars in commission from insurance provider U-Plus after it insisted employers agree to include the deal in workplace agreements.\nMr Smith said the deal was not voted down in the two states because of the insurance protection scheme rather because of local rostering and staff number problems.\nDP World chief executive Paul Scurrah said there was not a circumstance where he thought it was acceptable to allow the union to earn commissions or any other payments for the provision by the company of income protection to DP World employees.\n\"We will not do it and we have made that clear to the union,\" Mr Scurrah said.\nDP World disagrees with the union that any policy held with Protect should be in the name of the MUA and not inindividual employees' names.\nMr Smith said Protect was a preferred provider not because of the potential commission, rather it was tested in the field and wouldn't \"stand in their way\", like QBE had, when claims were being made by employees.\nHe said a \"whole range of unions, five or six at least\" use Protect, including some members in Western Australia.\nIt is expected a deal would be reached between the two parties in the coming weeks.", "external_links": [], "published": "2015-09-22T16:19:00.000+03:00", "crawled": "2015-09-22T20:57:33.592+03:00", "highlightTitle": ""}