{"organizations": [], "uuid": "adddb84182cf9e3004359172a7dd1d496b328551", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/Narendra-Modi-s.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/tech/narendra-modi-continues-rock-star-us-tour-with-facebook-townhall/142247", "country": "IE", "title": "Facebook Townhall: India is heaven for investors; want to make it $20 trillion economy, says PM", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Facebook Townhall: India is heaven for investors; want to make it $20 trillion economy, says PM | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T05:32:00.000+03:00", "replies_count": 0, "uuid": "adddb84182cf9e3004359172a7dd1d496b328551"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/tech/narendra-modi-continues-rock-star-us-tour-with-facebook-townhall/142247", "ord_in_thread": 0, "title": "Facebook Townhall: India is heaven for investors; want to make it $20 trillion economy, says PM", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Google to provide wi-fi at 500 Indian railway stations ICDS may lead to extra tax burden for banks in FY16 NMDC margins shrink as ore prices hit 5-year low Projecting India as a “heaven” for investors, Prime Minister Narendra Modi today said his government is working on deregulation and ensuring ‘ease of doing business’ as he aims to convert the country’s economy from 8 trillion dollars to 20 trillion dollars.\nIn a Townhall Q&A at the Facebook Headquarters here along with its CEO Mark Zuckerberg, Modi spoke about efforts to revive the faith among foreign investors, saying reforms are taking place speedily and the government had managed to “restore the lost confidence” during the last 15 months as he appeared to take a dig at the previous UPA dispensation.\nHe said his government was laying thrust on three sectors particularly — agriculture, services and manufacturing — along with building the physical and digital infrastructure simultaneously.\nDuring the 45-minute session, he also spoke in detail about the benefits of social media, particularly how it has been useful to him to connect with the people within the country and abroad, and how it can help take corrective steps if some government steps go wrong.\nHe became emotional while answering a question from Zuckerberg on his over 90-year-old mother as he highlighted how she had raised him by going through difficulties like washing utencils of others and working as a labourer.\n“It is my dream to convert Indian economy into USD 20 trillion from the present USD 8 trillion,” Modi said in presence of the audience, which mostly constituted of Indians.\nNoting that India is a “heaven” for investors, he said, “I do not believe that there is dearth of money. Countries have money but do not know where to invest. I am giving them the address. Here is the place (India).\n“We are bringing technology, transparency, efficiency, ease and effectiveness in governance,” Modi said.\nThe Prime Minister asserted that during his 15-month tenure, the “scale and speed” of reforms has improved significantly and even the global bodies like World Bank and IMF have forecast a high growth for India.\nAt the same time, he said India is a huge country and it will take time for the changes to become visible, as he answered a question about the slow pace of reforms.\n“It is not a scooter whose direction you can see changing easily. A 40-compartment train takes time… India is such a huge country,” he said.\nWhile talking about the speed of reforms, Modi appeared to take a dig at the previous governments as he said that nationalisation of banks was undertaken 40 years back but 60 per cent of the population was without a bank account till his dispensation introduced the Jandhan scheme last year.\n“180 million accounts were opened within 100 days of our government. This is the speed and scale of change,” he said.\nThe nationalisation of banks was undertaken by Indira Gandhi.\nFacebook townhall: As it happened\n11: 16 pm: Sudeep Padiyar who works for a high-tech firm in Santa Clara was impressed by the speech but said he was expecting more questions. Padiyar, whose wife works in Facebook, says the fact that so many people turned up for a private event shows how popular PM Modi is and how much hope there is among Indians. However, he added that people in the Silicon Valley were used to things happening quickly and would love to see more things happening on the ground in India.\n11:01 pm: Zuckerberg has a personal question, says both his parents are in the crowd. “Tell us a bit about your mother,” he asks.\nPM Modi congratulates Zuckerberg’s parents and asks them to stand up so that everyone can see them. PM Modi struggles for words as he speaks of his late father and his old mother. Some tears in the crowd too. PM Modi breaks into tears as he recalls the contributions of his parents. He says there are millions of such parents across India who sacrifice everything for their children.\n10:54 pm: Next question is from Dr Ranjana Kumari of Centre for Social Research. What are your plans for empowerment of women, she asks?\n“In all cultures, the God is in male form. It is only Indian civilisations that have so many goddesses. It is true that there has been diversion in this thought over the years. If our country has to reach its economic goals, it cannot happen with half its population shut behind doors. There has to be 100 per cent partnership and the government has to play a proactive role. In India, the situation is that men need reservations in academics as the women dominant here, like in the health sector too. Now we have reserved 30 percent jobs in police service for women. They will also need a big role in the decision-making process as well,” says PM Modi.\n10:45 pm: TS Khurrana, a Facebook employee, asks if it has become easier in the last 15 months to do business in India. Do you think ‘ Make in India ’ will become successful, he asks. “It is easy to turn a scooter, but not a train with 40 bogeys. This is such a big country, changes are constant and widespread. You will see the cumulative effect. Banks were nationalized 40 years ago so that poor can benefit. But most of India still did not have an account. My government created 180 million bank accounts in 100 days. This is the speed of change, says PM Modi. He adds that states are now competing for achieving the ease of doing business. I am sure our rating will improve this time. India is heaven for all manufacturers around the world. “India is heaven for all manufacturers around the world. We offer demographic dividend, democracy and demand…3D. I have added a new D. De-regulation. My policy is that the government has no business to be in business,” says PM Modi.\n10: 38 pm: Vir Kashyap of Babajob.com asks next question: “What investments are your government going to make to get the rest of India connected? “Vir, I am thankful that you shifted back to India. I am hosting other Indian youth, he will want to come back home. We will need to stress on two things – physical Infrastructure and digital infrastructure. We will need to do all tags simultaneously. It is my conviction that highways and I-ways have similar importance these days. My effort is to connect all 600,000 villages with optical fiber networks in the next five years.\n10:36 pm: Now countries are connecting on social media. In China, the social network is a bit different. But I am active there too, says PM Modi.\n10:32 pm: Social media means daily voting, there is no scope for a gap in communication with the government like before. The governments now get an opportunity to correct themselves every five minutes and not every five years like before. A good government is one with many information channels, those that give real time information: PM Modi.\n10: 28 pm: Zuckerberg says they got over 40,000 questions and comments. But he asks the first one. You were one of the early adopters of social media. Did you then think this would become a tool for governance? Modi says when he adopted social media, he did not think he would become CM or PM. “I took to it for my curiosity for technology. But then we love guides more than full text books. Social media did that for me. I got what I needed in a short concise way. Social media filled my lack of education. It changed my thought process and connected me to the rest of the world. And as I started connecting, the world started accepting me as I was. Nothing could be more satisfying,” says PM Modi.\n10: 27 pm: “I dream of making India a $20 trillion economy. For that, I am pushing for agriculture, manufacturing and service sectors. I see the power of the service sector. In tourism alone we have so much potential, for job creation,” says PM Modi.\nAlso read: Live Coverage\n10: 22 pm: PM Modi says he never expected science and spirituality to have such a connect if Mark hadn’t given his example. A youth from the US, comes to an Indian temple to find his path on his advice of his guru. This is a wonder. I hope the vision you got will help you become the voice of millions of people and a voice of their aspirations. See where India has got you. India has the power to fulfil your aspirations, says PM Modi.\n10: 19 pm: Personally excited about India for a number of reasons. For every 10 people who get access to the Internet, one gets a jobs and gets lifted out of poverty. Deeply appreciative of Modi’s commitment for digital India : Zuckerberg.\n10:18 pm: Early on in Facebook’s history, Steve Jobs told me to visit this temple in India. I traveled for almost a month. Seeing how the people connected reinforced for me how Facebook worked: Zuckerberg.\n10: 14 pm: PM Modi, along with Zuckerberg, has arrived at the Townhall event.\n10:12 pm: Audience questions are ‘predetermined’, announces Facebook Emcee.\n10:10 pm: Ambassador Arun Singh, Amitabh Kant and Rakesh Doval walk in at the event.\n10:08 pm: Here is a picture of PM Modi at the Facebook headquarters.\n10:03 pm: PM Modi seems to be inside the Facebook campus. He will spend a few minutes with Zuckerberg before the public event.\n9:59 pm (IST): Here’s PM Modi and Zuckerberg deliberating on key global issues ahead of the Townhall.\n9: 56 pm: (IST): Except for the media, the crowd is almost completely Indian. All languages being heard despite the loud Bollywood numbers.\n9:40 pm (IST): Anurag a Verizon employee said he was expecting the conversation to be centred around technology. “After all, Facebook is one of the pioneering tech companies of our times,” he added.\n9:35 pm (IST): In the crowd are spiritual guru Jaggi Vasudev and Snapdeal COO Rohit Bansal.\nA number of people from all walks of life are likely to be present at the Menlo Park headquarters of online social networking website Facebook.\nThe event is being projected as one of the more exciting events in PM Modi’s five-day visit to the United States.\nMeanwhile, Zuckerberg has voiced a strong support for the Digital India initiated by Prime Minister Modi’s government in his Facebook post.\nWatch live streaming of event here:\n“Looking forward to discussing this with Prime Minister Narendra Modi at Facebook today,” Zuckerberg had earlier said in a Facebook post.\n“I’ll host Indian Prime Minister Narendra Modi for a Townhall Q&A at Facebook HQ, where I’m looking forward to having a conversation about what connectivity means for India’s future,” Zuckerberg wrote in a post on Facebook.\n 27, 2015 9:32 pm", "external_links": ["http://indianexpress.com/article/technology/tech-news-technology/live-pm-narendra-modi-mark-zuckerberg-at-facebook-headquarters/", "http://www.youtube.com/embed/1-OFfyf7aoA"], "published": "2015-09-28T05:32:00.000+03:00", "crawled": "2015-09-28T00:11:36.433+03:00", "highlightTitle": ""}