{"organizations": [], "uuid": "31abe68358f8618519d2ded0f01dc25da718cb46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/l/9/k/h/image.related.afrArticleLead.620x365.gjlb9c.png/1442122489374.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/world/europe/rise-of-authentic-jeremy-corbyn-in-uk-has-warning-for-bill-shorten-and-labor-20150913-gjlb9c", "country": "AU", "title": "Rise of 'authentic' Jeremy Corbyn in UK has warning for Bill Shorten and Labor", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Rise of 'authentic' Jeremy Corbyn in UK has warning for Bill Shorten and Labor | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-13T12:32:00.000+03:00", "replies_count": 0, "uuid": "31abe68358f8618519d2ded0f01dc25da718cb46"}, "author": "Share via Email", "url": "http://www.afr.com/news/world/europe/rise-of-authentic-jeremy-corbyn-in-uk-has-warning-for-bill-shorten-and-labor-20150913-gjlb9c", "ord_in_thread": 0, "title": "Rise of 'authentic' Jeremy Corbyn in UK has warning for Bill Shorten and Labor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For all his perceived faults Jeremy Corbyn has one outstanding virtue: he comes across as real and unaffected. Getty Images by James Chessell Jeremy Corbyn's remarkable victory in the UK Labour leadership race should be a cause for concern for Bill Shorten.\nCorbyn's rise from a 100:1 longshot who barely scraped together the necessary 35 votes to register as a candidate to the head of Britain's main opposition party says plenty about how left-leaning voters view politics nowadays.\nThanks to changes to leadership election rules introduced by Corbyn's hapless predecessor, Ed Miliband, the job of choosing the new boss was taken away from MPs and given to some 422,664 eligible members, union affiliates and registered supporters who paid £3 ($6.52) a head for the privilege of voting.\nThe decision to create a rank and file \"selectorate\" backed by the unions allowed a hard-left grassroots movement to flourish. Its backing of Corbyn against his three centrist alternatives gathered so much momentum at packed public appearance and on social media that it became known as \"Corbynmania\".\nFor Labor leader Bill Shorten there is a message. Authenticity is what party members are looking for. Alex Ellinghausen Mr Corbyn opposes the spending cuts introduced by the Cameron government since the global financial crisis and wants to pay for increased spending by hiking taxes on business and the rich. At the heart of his economic policy is a promise to return large chunks of UK industry – the railways, British Post and big energy companies – to public ownership.\nThe son of two peace campaigners, Mr Corbyn would also take Britain out of NATO and scrap its nuclear weapons regardless of whether there was an agreement for other countries to do the same. He is opposed to the monarchy and once described Osama bin Laden's extrajudicial killing as a \"tragedy\".\nCorbyn had spent 32 years on the backbench agitating against his party's policies. But when it came down to a vote, party members showed how strongly they have shifted away from Tony Blair's New Labour. Corbyn wiped the floor with the more established candidates with almost 60 per cent of voters backing his egalitarian, anti-austerity platform.\nAuthenticity Jeremy Corbyn says he'll take a strong stand on issues such as treatment of refugees. Getty But it is not the mechanics of Corbyn's victory that should worry Shorten. Even though Kevin Rudd changed the selection process in Australia in 2013 to give party members a 50 per cent weighting in leadership contests, the established power structures are still largely in control of the outcome.\n\"This could not happen in Oz,\" says John McTernan, a former senior adviser to Tony Blair and Julia Gillard. \"The factions would stop it. And the caucus votes are heavily weighted.\"\nWhat should be of concern for Shorten is the way Corbyn conducted himself during the three-month campaign.\nAt a time when authenticity is in short supply on all side of politics, he came across as a genuine candidate far removed from the poll-driven \"messaging\" of the Westminster establishment. This rejection of mainstream, small target candidates mean Corbyn's apparent shortcomings – his age, his unabashed enthusiasm for socialism, his beard, his lack of rhetorical flair – ended up working in his favour.\nCorbyn is everything Shorten is not. People know what the UK Opposition Leader stands for. Even his rivals admit he is an uncompromising politician who has stuck to the same set of principles for three decades regardless of their popularity.\nShorten is far harder to pin down. He is a former union leader like Corbyn yet he has been dogged by reports he sold out workers. His vast network that stretches from the boardrooms of Australia's largest companies to the backrooms of the labour movement make him a deeply complicated figure.\nThere is currently a groundswell in support for unapologetic leftist figures around the world, whether it be the Scottish National Party's Nicola Sturgeon or Podemos leader Pablo Iglesias in Spain or US Democratic presidential candidate Bernie Sanders, who have won over left-leaning voters angry at perceived rises in inequality.\nIt remains to be seen whether these sort of politicians can govern effectively if given the chance. Indeed, there is a good case to be made that Corbyn's policies will consign Labour to electoral oblivion when they are put to the general population rather than a few hundred thousand activists. Many observers believe UK Labour has given up the political centre once occupied so effectively by Tony Blair. At the very least Corbyn's stunning victory has opened up a huge gulf between the rank and file members and Labour's MPs in Westminster.\nBut the likes of Corbyn and Sanders do serve as a reminder that the left-wing base is shifting and voters require their leaders to actually stand for something. Shorten has his work cut out for him if he is to negotiate these changing – and often contradictory – political forces before the next election.", "external_links": [], "published": "2015-09-13T12:32:00.000+03:00", "crawled": "2015-09-13T09:48:23.944+03:00", "highlightTitle": ""}