{"organizations": [], "uuid": "ecb9d0c9f3a590b6c6dbdce4a796950c659329ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/b/e/g/g/image.related.afrArticleLead.620x365.gjbccd.png/1441147983577.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/personal-finance/the-best-travel-money-cards-to-use-this-holiday-20150830-gjbccd", "country": "AU", "title": "The best travel money cards to use this holiday", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The best travel money cards to use this holiday | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T06:35:00.000+03:00", "replies_count": 0, "uuid": "ecb9d0c9f3a590b6c6dbdce4a796950c659329ca"}, "author": "Misa Han", "url": "http://www.afr.com/personal-finance/the-best-travel-money-cards-to-use-this-holiday-20150830-gjbccd", "ord_in_thread": 0, "title": "The best travel money cards to use this holiday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ratings agency Canstar has awarded five stars to Qantas, Velocity and OzForex travel cards in May this year. Laurent Delhourme Share on twitter by Misa Han With the exchange rate tipped to fall even more, travellers are flocking to buy travel money cards so they can lock in the Australian dollar at the current exchange rate.\nSo what are travel cards, which cards offer the best deal, and what are the hidden costs?\nTravel money cards allow customers to prepay money on to the card and lock in the money at the current exchange rate. They essentially work as debit cards with different currencies.\nRatings agency Canstar's Mitchell Watson said as a customer he would pick Qantas and Velocity travel cards, rather than the cards offered by the big four banks.\nIn May Canstar picked OzForex, Qantas and Velocity as the best products based on their pricing and features. But the two airline travel cards are now the only available options in the market, after OzForex recently announced it will close down its travel money card from November 30 .\nHe said while the main number to consider is the exchange rate, travellers should also think about other fees which can easily add up.\n\"You should think about the fees associated with loading money on to the card, fees associated with taking money out of the ATM. Remember, it's just the fee that the travel card charges, so there could be an additional fee charged by the ATM provider.\"\nQantas and Velocity travel cards do not charge an initial card fee or reload fee. By contrast ANZ, Westpac and NAB charge a one per cent reload fee every time a traveller puts money on the travel card. ANZ also charges customers an $11 fee when they sign up.\n The airline travel cards also offer a more competitive ATM withdrawal fee at $US1.95 and frequent flyer points for the airlines' cardholders.\nThen there's also the \"monthly inactive fee\" of $1 for Velocity and $4 for NAB, which can be a problem for frequent travellers who want to buy and keep their travel card rather than closing and opening another one every time they travel.\n'The market's a beast on its own' Mr Watson said getting a travel card offers the certainty of being able to lock the currency at a particular rate, unlike a credit card.\n\"It can be a way to overcome fluctuations. If the outlook is the [exchange] rate is going to go down, I would lock in at least some of my travel money.\n\"But it can also have an adverse impact [if the exchange rate goes up], the market's a beast on its own.\"\nMr Watson added depending on the card, it could be cheaper to use a travel card rather than relying on the credit card alone. \"When you consider the currency conversion fees that you may incur on your credit card and debit card, the numbers are compelling,\" he said.\nLast week, ANZ, Westpac card issuer Cuscal and the Bank of China also changed their terms and conditions following an ASIC review , which means customers no longer forfeit the money they load on to the travel cards when the cards expire.\nRateCity's Jeremy Willink said many travellers were buying travel money cards due to the exchange rate falling.\n\"With the rate going from 95 [US cents] to 72 [US cents] there are a lot more people locking in their travel plans and locking in their travel cards.\"\nThe Australian dollar is tipped to fall as low as US70¢ by December , when many travellers go overseas for the summer break.\nHe said customers may face higher fees on their travel card after the exit of OzForex from the market.\n\"If people like OzForex pull out, which has good fees on top of everything else, banks would be able to charge higher fees,\" Mr Willink said.\nOzForex told The Australian Financial Review it was \"looking at opportunities to provide a different product in the future but there is nothing on the table at the moment\".", "external_links": ["https://twitter.com/misahan", "http://asic.gov.au/about-asic/media-centre/find-a-media-release/2015-releases/15-229mr-consumers-can-reclaim-funds-on-expired-travel-money-cards-following-asic-action/", "https://sasha-project.s3.amazonaws.com/afr-prod/archive/responsiveJSV2/pym.min.js", "http://www.ozforex.com.au/personal/travel-card", "https://s3-ap-southeast-2.amazonaws.com/sasha-project/afr-prod/2015/08aug/travelcards_hype/index.html"], "published": "2015-09-02T06:35:00.000+03:00", "crawled": "2015-09-02T03:04:36.240+03:00", "highlightTitle": ""}