{"organizations": ["Volkswagen", "Volkswagen Group", "Hindustan Times"], "uuid": "c8dc9ecc29d9842aee8079222ba7d9bbfcad6559", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/9/a87a4ade-aabf-42d5-a69c-207a0e057e4cMediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Business\r", "section_title": "Business News, Personal Finance, Financial News, India Stock Market Investing", "url": "http://www.hindustantimes.com/business-news/volkswagen-impact-govt-may-broaden-emissions-probe-to-all-firms/article1-1392496.aspx", "country": "IN", "title": "Volkswagen impact: Govt may broaden emissions probe to all firms", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Volkswagen impact: Govt may broaden emissions probe to all firms", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T19:55:00.000+03:00", "replies_count": 0, "uuid": "c8dc9ecc29d9842aee8079222ba7d9bbfcad6559"}, "author": "", "url": "http://www.hindustantimes.com/business-news/volkswagen-impact-govt-may-broaden-emissions-probe-to-all-firms/article1-1392496.aspx", "ord_in_thread": 0, "title": "Volkswagen impact: Govt may broaden emissions probe to all firms", "locations": ["United States", "New Delhi", "South Korea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HT Correspondent, Hindustan Times , New Delhi | Updated: Sep 22, 2015 22:43 IST File photo of the Volkswagen Group logo. The scandal engulfing Volkswagen, which has admitted cheating diesel vehicle emissions tests in the United States, spread on Tuesday as South Korea said it would conduct its own investigation and a French minister called for an EU-wide probe. (REUTERS) \nThere could be more trouble in store for European auto giant Volkswagen, which just recently became the world's largest car maker, as the US emission norms fudging scandal spread to Europe and Asia on Tuesday. \nA number of countries including France, Germany and Korea said they would test whether some of the company's vehicles adhere to emission standards. India is likely to join the fray as well. A government official told HT that compliance norms were tightened after a similar scandal two years ago, in which General Motors India was found to be tinkering with engine specifications to circumvent pollution norms. He felt there may be a need to strengthen the regulations further. \nGM India was forced to recall 114,000 units of its utility vehicle Tavera to fix the problem. The subsequent government probe had termed it a corporate fraud. \nRead: Volkswagen admits 11 mn cars have pollution cheating device \n\"Prima facie, the issue seems to be a market specific instance but if regulators can be cheated in the US, they can be in India as well,\" said a senior ministry of heavy industries official. \"It is too early to say what we can do here. Volkswagen is a big company and it was not expected of them. It is a reminder that you cannot take a company on face value.\" \nOfficials at Pune-based Automotive Research Association of India (ARAI), which conducts homologation and compliance tests on cars in India, were also tighlipped on the matter. However, one official said they may conduct random tests on some of the company's cars in India. \n\"Just because they have behaved illegally in US does not mean they are doing so in India but we have to be watchful,\" the official said. \"Emission norms for diesel cars are the most stringent in US. In India, norms are much more relaxed so there is no reason for them to fudge here. I cannot tell you what we can do but we can conduct an independent investigation if needed or required (by the government).\" Tags", "external_links": [], "published": "2015-09-22T19:55:00.000+03:00", "crawled": "2015-09-22T22:17:06.774+03:00", "highlightTitle": ""}