{"organizations": [], "uuid": "8738995fccabaaca41ca17905afc051e25b7cf08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509200029.html", "country": "US", "title": "Kenya: Kenyan Teachers Are 'Overworked but Not That Badly Paid'", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Kenyan Teachers Are 'Overworked but Not That Badly Paid'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T14:11:00.000+03:00", "replies_count": 0, "uuid": "8738995fccabaaca41ca17905afc051e25b7cf08"}, "author": "", "url": "http://allafrica.com/stories/201509200029.html", "ord_in_thread": 0, "title": "Kenya: Kenyan Teachers Are 'Overworked but Not That Badly Paid'", "locations": ["Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dorothy Otieno"], "text": "Kenyan Teachers Are 'Overworked but Not That Badly Paid' Tagged: opinion By Dorothy Otieno \nKenyan teachers are not only the best paid in East Africa, but also receive almost 12 times more than the country's average pay, a comparative study by Nation Newsplex and the Institute of Economic Affairs reveals. \nAccording to the survey, Kenyan teachers are the most overworked in Sub-Saharan Africa, handling very large classes. \nBesides remuneration, the other major grievance by teachers in their ongoing strike is that they are overworked. \nA comparison between the pupil-to-teacher ratios of schools in Kenya since 2010 and those of some countries in Africa and the rest of the world confirms that on this issue teachers have a point. \nThe worst shortage is in primary schools, where Kenya's pupil-teacher ratio has been above the sub-Saharan average of 40:1. \nAt 50:1, it is more than double the United Nations Educational, Scientific and Cultural Organisation (Unesco) benchmark of 24:1. \nBased on this benchmark, it is clear that there is a serious shortage of teachers at the public primary school level in Kenya. \nUNESCO BENCHMARK \nData also shows that considering the number of pupils in secondary schools, Kenya has fewer teachers when compared to its peers in Sub-Saharan Africa. \nThroughout the five years, Kenya was above the Sub-Saharan Africa average of 25 pupils per teacher. \nLast year, Kenya's ratio of 29:1 was also way above the Unesco benchmark of 17:1. \nThe growth rate for teacher numbers in 2014 went below that of pupils. \nThis means the ratio may become progressively worse. \nThe situation is much different in secondary schools, where the growth rate for teachers for the five years was two per cent faster than that of pupils. \nIf this trend continues, the situation will get better and narrow down the pupil-teacher gap. \nKenya's pupil-teacher ratio at the public primary school level was high compared to that of Senegal, Cameroon, Djibouti and Ghana. \nOf the selected countries, Kenya has the highest ratio, at 50:1, while Ghana has the lowest, at 30:1. \nCompared to some European countries -- the United Kingdom (18:1), France (18:1), Germany (12:1) and Belgium (11:1) -- Kenya once again has the highest ratio. \nIt is important to consider that high-income countries tend to have a lower pupil-teacher ratio compared to low-income nations, because they have the ability to employ more tutors. \nBut the salary analysis that compares Kenyan teachers with their peers in selected countries in Africa shows that the lowest-paid teacher in Kenya earns more than the highest-paid tutor in Uganda. \nMOST UP-TO-DATE DATA \nUganda and South Africa were chosen as countries against which to compare teachers' salaries because they have the most up-to-date data that can be used. \nWhile Tanzania was not included in the comparison, because only the average pay for 2011 was available, even that figure gave an indication that Kenyan teachers earn more than their counterparts in the neighbouring country. \nThe highest-paid Kenyan teacher earns almost 12 times more than the average pay in Kenya. \nAt the same time, the highest-paid teacher in Uganda receives double the average income of a Ugandan. \nEven at the lowest income level, Kenyan teachers receive pay that is at least 44 per cent above the average wage. Their Ugandan peers earn 35 per cent more. \nSouth Africa is different because the lowest-paid teacher earns a mere two per cent above the average income. \nThe highest-paid teacher earns eight times more than the average income. \nThe highest-paid teachers are in South Africa, with a maximum annual salary of Sh5,591,500, but the country's per capita income is four times more than Kenya's. \nKenya's highest- paid teachers earn a maximum annual salary of Sh1,672,200. \nUganda has the lowest maximum annual salary of Sh146,900. \nKenya's per capita income is almost double that of Uganda. \nThis means the highest-paid Kenyan teacher earns less than their South African counterpart but more than the best-paid Ugandan tutor. \nThe average teacher pay in Tanzania was Sh190,000 per year in 2011. \nFor the lowest paid, the teacher in South Africa has the highest minimum annual salary of Sh663,100, followed by the Kenyan tutor, with a minimum annual salary of Sh192,600. \nThe teacher in Uganda has the lowest annual minimum salary of Sh91,100. \nA look at the pay scale in the three countries suggests that while experience in teaching leads to better pay in Kenya and South Africa, it does not in Uganda. \nKenya has the largest difference in income level among teachers. \nChief principals, who are the highest-paid teachers, earn almost nine times as much as entry-level primary school tutors, who are the lowest paid. \nIt is followed by South Africa, with the maximum teacher pay being eight times as much as the minimum. \nThe pay gap between teachers in Uganda is lower because the maximum salary in this country is almost double the minimum wage. \nBIGGER DIFFERENCES \nThe analysis shows that there are bigger differences in the income levels of teachers in South Africa and Kenya than is the case in Uganda. \nTeacher pay in the three countries correlates with the sizes of the economy. Last year, the per capita income for South Africa was Sh6,44,790, while Kenya's was Sh1,33,790 and Uganda's was Sh67,740. \nThe analysis also looked at the relative value of the incomes to get an understanding of the quantity of goods and services that could be purchased for the amount of money that teachers earn. \nThe cost of living differs between countries and, therefore, it is necessary to consider the difference in the purchasing power of a US dollar in every country. The US dollar is the de facto standard currency in the international markets. \nSouth African teachers earn salaries that would be equivalent to US$109,662 annually in the United States because of the differences in price levels in the two countries. \nOn the other hand, the maximum pay for Kenyan teachers would be equivalent to US$36,122 and for Ugandan tutors US$3,666 per annum. \nFigures for the US show that the entry-level public school teacher's pay ranged from US$39,580 in South Dakota to a maximum of US$75,279 in New York in the year 2013. \nIncome for US teachers at the entry level gives them higher purchasing power, at US$39,580. However, South African tutors have a huge lead in terms of purchasing power for those with the highest incomes. \nThe figures also show that the purchasing power of the highest- paid teacher in Kenya is almost the same as that of the lowest- paid tutor in the US. Kenya \nStudents, teachers and parents will wake up tomorrow to one of the most dramatic disruptions of the school system in … see more » Copyright © 2015 The Nation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-20T14:11:00.000+03:00", "crawled": "2015-09-20T16:21:31.707+03:00", "highlightTitle": ""}