{"organizations": [], "uuid": "57507c87f7e61e402ad486ec0656a2606a8896b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/u/r/v/b/image.related.afrArticleLead.620x365.gjumvu.png/1443165344409.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/real-estate/gold-coast-jewel-apartments-match-boomtime-prices-20150924-gjumvu", "country": "AU", "title": "Gold Coast Jewel apartments match boom-time prices", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Gold Coast Jewel apartments match boom-time prices | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T15:14:00.000+03:00", "replies_count": 0, "uuid": "57507c87f7e61e402ad486ec0656a2606a8896b7"}, "author": "Matthew Cranston", "url": "http://www.afr.com/real-estate/gold-coast-jewel-apartments-match-boomtime-prices-20150924-gjumvu", "ord_in_thread": 0, "title": "Gold Coast Jewel apartments match boom-time prices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apartments in the Jewel development on the Gold Coast have reach prices similar to the last boom. Share on twitter Share on Google Plus by Matthew Cranston Chinese developers Dalian Wanda and Ridong Group have sold $55 million worth of apartments in the first stage of their $1 billion Jewel project on Queensland's Gold Coast and at prices which match those of the the last boom.\nWanda's decision to invest up to $900 million in the project last year has since created major international awareness of the Gold Coast and sparked an Asian backed development surge\nAt the same time, the broader property market has started to recover with apartment sales at five-year highs .\nAbout 50 per cent of the buyers for the first 38 apartments in the Jewel's north tower at Broadbeach were from Hong Kong or China. Prices reached as high as $18,656 a square metre for a three-bedroomed apartment which is just under the $19,700 a square metre achieved in 2007 for the Gold Coast's last major high-rise tower Soul at Surfers Paradise.\nJewel apartment prices ranged from a 76-sq-m, one bedroom unit at $675,000, to a three-bedroomed, 268-sq-m apartment at $5 million.\nInvestors keen Jewel director of sales and marketing Andrew Bampton said about 65 per cent of the buyers were investors.\n\"They see this as a development that stands apart from everything else at the Gold Coast and something that will hold its value.\"\n The project has a total of 512 apartments and CBRE has been appointed to manage sales.\nWanda, which is owned by China's richest man Wang Jianlin, is developing the project without any domestic bank debt and has no presale requirements. A shortlist of builders has been devised for the construction of the three-tower project.\nHerron Todd White valuer Luke Nicholls said the latest sales result was evidence of a rapidly recovering Gold Coast property market.\n\"The significance of such sales is that you have prices being achieved at the same level of what was being achieved during the boom. That shows a lot of confidence.\"\nHe said prices achieved far exceeded the resale prices of apartments in the Gold Coast's last major high-rise tower Soul. Resales in that tower had been between $8000 and $10,000 a square metre.\nCompletion of the Jewel project is targeted for 2018, in time for the Commonwealth Games.", "external_links": ["https://plus.google.com/https://plus.google.com/u/0/102874628957085545973", "https://twitter.com/https://twitter.com/mcranston1"], "published": "2015-09-25T15:14:00.000+03:00", "crawled": "2015-09-25T14:13:50.261+03:00", "highlightTitle": ""}