{"organizations": [], "uuid": "4ece2539a97408255d9a11eabe6000a37dd88e55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/22/usa-china-jacklew-idUSL1N11S00P20150922", "country": "US", "title": "U.S. Treasury secretary urges China to keep economic commitments", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "U.S. Treasury secretary urges China to keep economic commitments | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T04:53:00.000+03:00", "replies_count": 0, "uuid": "4ece2539a97408255d9a11eabe6000a37dd88e55"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/22/usa-china-jacklew-idUSL1N11S00P20150922", "ord_in_thread": 0, "title": "U.S. Treasury secretary urges China to keep economic commitments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Sept 21 China should reaffirm its commitment to moving toward a market-oriented, consumer-driven economy, which is in the best interests of the Chinese and world economies, U.S. Treasury Secretary Jack Lew wrote in the Wall Street Journal on Monday.\nLew's opinion column comes ahead of Chinese President Xi Jinping's state visit to Washington on Friday and amid concerns about how a slowdown in China's economy could spill over to other economies, particularly in emerging countries.\nLew said questions remain about the business climate in China because of Beijing's restrictions on the purchase of foreign technology and its review process for foreign investment.\nHe also cited concerns about China's currency valuation policies. The yuan recently slid after a period of appreciation.\n\"We have made clear to China's officials that they need to keep the commitments they have made to the U.S. and the international community,\" Lew said.\n\"We welcome China's commitment to increase the transparency of its foreign-exchange reserves and exchange rate by fully subscribing to the International Monetary Fund's Special Data Dissemination Standard by the end of the year.\"\nLew said the Washington-Beijing talks on a bilateral investment treaty provide \"a tangible way for China to signal to businesses in America and the world that it is serious about welcoming and protecting foreign investment.\"\nU.S. business officials want to see a quicker pace in the talks, which reportedly cover between 35 and 40 sectors.\n\"In short, it is important for China to embrace responsibility commensurate with its size,\" Lew wrote. (Writing by Bill Trott ; Editing by Peter Cooney )", "external_links": [], "published": "2015-09-22T04:53:00.000+03:00", "crawled": "2015-09-22T04:14:30.047+03:00", "highlightTitle": ""}