{"organizations": [], "uuid": "3531b3214f76ed63bae420a661144cab9b672e00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30045047/american-bullions-second-annual-scholarship-program-underway", "country": "US", "title": "American Bullions Second Annual Scholarship Program Underway", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "American Bullions Second Annual Scholarship Program Underway - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T19:31:00.000+03:00", "replies_count": 0, "uuid": "3531b3214f76ed63bae420a661144cab9b672e00"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30045047/american-bullions-second-annual-scholarship-program-underway", "ord_in_thread": 0, "title": "American Bullions Second Annual Scholarship Program Underway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "American Bullion’s Scholarship Program, the first national award competition offered by a precious metals brokerage firm, is now in its second year.\nLos Angeles, CA (PRWEB) September 16, 2015\nAmerican Bullion, Inc., a precious metals brokerage firm with expertise in converting traditional retirement plans to gold IRAs, is excited to announce that its annual National Scholarship Program essay contest is currently underway. Open to full-time undergraduate students enrolled in an accredited college or university in the US, the essay contest asks applicants to formulate a 500-word response to the question, Why should you trust gold to protect your retirement? Five winners will be selected from eligible entries and each winner will be awarded a scholarship worth $500. Essays may be submitted at the American Bullion website until October 31, 2015.\nAmerican Bullion’s Scholarship Program, the first national award competition offered by a precious metals brokerage firm, is now in its second year. According to American Bullion CEO Orkan Ozkan, the decision to keep the program going was due in large part to the enormous success of last year’s essay contest.\n“We received more than 900 submissions for our inaugural competition and were thrilled at the level of financial knowledge demonstrated by the entrants in their essays,” Ozkan states. “The response truly exceeded all expectations.”\nOzkan further cites his firm’s desire to spread financial literacy among the nation’s young men and women as an additional reason to renew the American Bullion Scholarship Program.\n“Last year’s applicants learned important lessons, such as the fact that it’s never too early to start planning for retirement and that in these uncertain times, few investments are as sound as gold, silver, and other precious metals,” Ozkan says. “By continuing our Scholarship Program this year and beyond, we at American Bullion hope to encourage more and more students to give serious thought to the safety of tangible assets compared to speculative investments so they can make smarter decisions with their money and secure their financial future.”\nWinners of the 2015 essay contest will be contacted in the first week of December, and may be announced on American Bullion’s official Facebook page, Twitter feed, or website.\nFor further information about the Scholarship Program, including rules, eligibility requirements, and winning submissions from previous contests, please visit https://www.americanbullion.com/scholarship .\nAbout American Bullion:\nAmerican Bullion, Inc. specializes in converting existing IRAs or former 401(k)s to a self-directed IRA capable of holding physical gold, known as a Gold IRA. Call 1-800-326-9598 or visit http://www.americanbullion.com for more information.\n //www.prweb.com/releases/2015/09/prweb12960211.htm\n ", "external_links": ["https://www.americanbullion.com/scholarship", "http://www.prweb.com/releases/2015/09/prweb12960211.htm"], "published": "2015-09-16T19:31:00.000+03:00", "crawled": "2015-09-18T08:23:56.446+03:00", "highlightTitle": ""}