{"organizations": [], "uuid": "95250dac6b7345fef23270cfb31a5f1bc32dba4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/g30nfr5edx_drkofiwampah.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/642857/1/bog-increases-monetary-policy-rate.html", "country": "US", "title": "BoG increases monetary policy rate", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "BoG increases monetary policy rate", "spam_score": 0.0, "site_type": "news", "published": "2015-09-15T19:00:00.000+03:00", "replies_count": 0, "uuid": "95250dac6b7345fef23270cfb31a5f1bc32dba4d"}, "author": "", "url": "http://www.modernghana.com/news/642857/1/bog-increases-monetary-policy-rate.html", "ord_in_thread": 0, "title": "BoG increases monetary policy rate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business & Finance | 15 September 2015 17:00 CET BoG increases monetary policy rate By GNA \nAccra, Sept. 15, GNA - Bank of Ghana (BoG) on Monday increased the Monetary Policy Rate from 24 per cent to 25 per cent, following the 66th Monetary Policy Committee (MPC) meeting on September 11, 2015. \nThe policy rate is the rate at which the Central Bank lends to commercial banks and informs the banks' base rates as well as interest rates on loans. \nDr Henry Kofi Wampah, Governor of the Central Bank, speaking at a news conference in Accra, said the increase in the monetary Policy rate is necessary as the Bank's forecasts showed a need for further tightening in order to bring back inflation within the target band by end of 2016. \nAlthough external sector developments such as the adverse effects of elevated volatility in financial markets, declining commodity prices and uncertainty as to the timing and impact of the expected tightening in the Fed's monetary policy, informed the increase. \nHe said persistent inflation pressures due mainly to the uncertainties in the foreign exchange market is a major one, as it remains elevated, outside the medium term target band of eight (plus or minus) two per cent. \nDr Wampah noted that readings from the Ghana Statistical Service indicated that Consumer Price Index inflation increased from 16.9 per cent in May to 17.9 per cent in July, mainly reflecting the upward adjustments in petroleum and transport prices. \nSome moderation occurred in August with inflation declining to 17.3 per cent, still higher than the June reading of 17.1 per cent. \nCore Inflation excluding energy and utilities) also continued to rise, suggesting persistent underlying inflation pressures. \n'The current forecasts suggest that attainment of the medium term inflation target by the end of 2016 would require further tightening in the Monetary policy stance else the target horizon will shift into 2017,' he stated. \nDr Wampah said the MPC is determined to prevent first round effects of the likely significant increases in utility prices and the higher cedi liquidity during the fourth quarter from being entrenched into elevated inflation expectations. \nThe volatility in exchange rates saw the Ghana cedi appreciate against the US dollar by 25.5 per cent in July and depreciated by 14.8 per cent in August, heightening inflation expectations. \nDr Wampah maintained however that 'the currency volatility is expected to moderate due to the tight monetary policy stance and the anticipated inflows from the $1.5 billion Eurobond issue and the syndicated pre-export finance facility for cocoa. \nThe bank also projected a rebound in growth in the medium term as the economy rebalances, supported by increased production of oil and gas, in spite of the current indication of a slower pace of growth in the provisional updates of the Bank's real composite index of economic activity. \nHe said the process of fiscal consolidation had so far been successful, as revenues in the first seven months of the year exceeded target while expenditure remained within target, resulting in a fiscal deficit of three per cent of GDP; within the target of four per cent. \n'Maintaining the pace of fiscal consolidation over the medium term is necessary to complement the tight monetary stance for the attainment of the medium term inflation target,' he said. \nHe noted that 'the Committee will continue to monitor developments and take appropriate action if necessary.' \nGNA", "external_links": [], "published": "2015-09-15T19:00:00.000+03:00", "crawled": "2015-09-16T00:28:20.925+03:00", "highlightTitle": ""}