{"organizations": [], "uuid": "2072dd3883096e0e1e6b5d322e95cfb31cbd449f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/16/autos-uaw-idUSL1N11M1DA20150916", "country": "US", "title": "U.S. union, Fiat Chrysler pact ties worker bonus to long-term goals", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "U.S. union, Fiat Chrysler pact ties worker bonus to long-term goals | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T22:21:00.000+03:00", "replies_count": 0, "uuid": "2072dd3883096e0e1e6b5d322e95cfb31cbd449f"}, "author": "Bernie Woodall", "url": "http://www.reuters.com/article/2015/09/16/autos-uaw-idUSL1N11M1DA20150916", "ord_in_thread": 0, "title": "U.S. union, Fiat Chrysler pact ties worker bonus to long-term goals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT, Sept 16 The proposed labor pact for Fiat Chrysler Automobiles ties U.S. union worker pay to meeting long-term company goals including productivity gains, according to a memo sent to the company's employees on Wednesday from Chief Executive Sergio Marchionne.\nThe memo says, as Marchionne did on Tuesday night, that the new pact would lead to the eventual elimination of a two-tier wage structure.\nFiat Chrysler and the United Auto Workers union on Tuesday reached a tentative deal on a new four-year contract. If it is ratified, the UAW will use the pact as a framework for contracts at Ford Motor Co and General Motors Co.\nIt also includes an agreement to work to pool active UAW workers at Detroit's three automakers to save on healthcare.\n\"If the final plan targets are met, and I am confident they will be, workers will receive significant economic benefits tied directly to their commitment,\" Marchionne wrote.\nIn May 2014, Marchionne set broad company targets through 2018 including a 25 percent rise in North American Jeep brand production from 2013 and a 46 percent gain in North American revenue.\nWhile details of the bonus plan were not released, a person familiar with the proposed labor deal said bonuses would be given annually.\nA UAW spokesman declined to comment on Marchionne's memo to U.S. Fiat Chrysler workers.\nUAW workers at Fiat Chrysler, GM and Ford have long received annual bonuses tied to the companies' U.S. profit. Those profit sharing payments vary widely depending on auto industry ups and downs.\nMarchionne also wrote that the proposed contract establishes \"a pathway to higher wages for workers hired under the two-tier pay structure, helping ensure that all those who work hard will be rewarded commensurate with others doing the same or similar jobs.\"\nMarchionne's letter does not say how long it will take to close the pay gap, and people familiar with the agreement said the process will likely extend beyond the term of that pact.\nUnder the old contract, workers hired before the recession earn $28 an hour, while wages for those hired more recently top out at $19.28. UAW leaders made narrowing or eliminating that gap a top priority in bargaining.\nMarchionne also wrote that Fiat Chrysler will work with a new \"UAW Health Care Development Co-op\" to try to reduce healthcare costs. UAW President Dennis Williams has proposed that the Detroit Three automakers pool their health plans for active UAW workers to create a single entity with greater clout in negotiating with hospitals and drugmakers.\n(Editing by Joseph White and Matthew Lewis )", "external_links": [], "published": "2015-09-16T22:21:00.000+03:00", "crawled": "2015-09-16T21:32:53.205+03:00", "highlightTitle": ""}