{"organizations": [], "uuid": "5811559c7e7d569b7f8676597a062b46871c4086", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/29/markets-japan-stocks-idUSL3N11Z1CR20150929", "country": "US", "title": "Nikkei tumbles to 8-month low on fresh China worries, falling commodities", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Nikkei tumbles to 8-month low on fresh China worries, falling commodities | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T06:57:00.000+03:00", "replies_count": 0, "uuid": "5811559c7e7d569b7f8676597a062b46871c4086"}, "author": "Joshua Hunt", "url": "http://www.reuters.com/article/2015/09/29/markets-japan-stocks-idUSL3N11Z1CR20150929", "ord_in_thread": 0, "title": "Nikkei tumbles to 8-month low on fresh China worries, falling commodities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sept 29 Japan's Nikkei share average tumbled more than 2 percent to an 8-month low on Tuesday as fears about China's cooling economy pummelled shares of commodity and machinery firms.\nThe benchmark Nikkei index shed 2.8 percent by late morning to 17,155.85 points.\n\"There is a lot of red in Asian equity markets at the moment,\" said Martin King, co-managing director at Tyton Capital Advisors.\n\"Disappointing industrial profits in China continue to bolster concerns about growth and many investors are taking profits from the Nikkei and sitting in cash and alternatives, or repatriating capital to western markets in a perceived flight to quality.\"\nJapan's shipping sector was hit hardest after the Nikkei business daily reported Daiichi Chuo Kisen, a mid-tier shipping company, was expected to apply for bankruptcy protection as early as Tuesday.\nThe news hurt shares of other shippers that suffer from weak demand, with the Topix sea transport subindex falling 6.2 percent.\nMitsui OSK Lines lost 7.7 percent and Kawasaki Kisen Kaisha fell 4.1 percent.\nThe news came as data showed on Monday that profits earned by Chinese industrial companies declined 8.8 percent, the biggest on-year fall since China began monitoring such data in 2011.\nSteel companies, another sector that has been heavily leveraged to demand in China, were also hit hard.\nThe Topix iron and steel subindex shed 5.2 percent, with Kobe Steel slumping 11.1 percent after it cut its earnings outlook.\nJFE Holdings lost 5.3 percent and Nippon Steel and Sumitomo Metal slipped 4.7 percent.\n\"The steel sector has been heavily impacted by China's slowdown because more than 50 percent of the demand is there,\" said Takashi Enomoto, an analyst at Bank of America Merrill Lynch.\n\"But Japanese steel companies will be hurt a little less than others by the shrinking demand because of the domestic demand from automotive players.\"\nChemical companies also underperformed because of ties to China, but falling crude oil prices helped buffer the impact, analysts said.\nThe broader Topix fell 3.1 percent to an 8-month low of 1,393.82, with each of its 33 subindexes in the negative. The JPX-Nikkei Index 400 lost 3.2 percent to 12,480.09. (Reporting by Joshua Hunt; Editing by Kim Coghill)", "external_links": [], "published": "2015-09-29T06:57:00.000+03:00", "crawled": "2015-09-29T06:05:19.026+03:00", "highlightTitle": ""}