{"organizations": ["Soco International plc"], "uuid": "563dd30190972a33f79489952fd7c8a41cfff341", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/gulf-keystone-petroleum-limited-now-062251573.html", "country": "GB", "title": "Is Gulf Keystone Petroleum Limited Now A Better Bet Than Soco International plc?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is Gulf Keystone Petroleum Limited Now A Better Bet Than Soco International plc?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T09:22:00.000+03:00", "replies_count": 0, "uuid": "563dd30190972a33f79489952fd7c8a41cfff341"}, "author": "", "url": "https://uk.finance.yahoo.com/news/gulf-keystone-petroleum-limited-now-062251573.html", "ord_in_thread": 0, "title": "Is Gulf Keystone Petroleum Limited Now A Better Bet Than Soco International plc?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Sep 16, 2015, 07:45 BST - UK Markets open in 15 mins. Is Gulf Keystone Petroleum Limited Now A Better Bet Than Soco International plc? By Harvey Jones | Fool.co.uk – 22 minutes ago 153.75 +5.75 \nLast time I looked at Gulf Keystone Petroleum (LSE: GKP) it was burning through its dwindling cash reserves while wondering whether it would ever get paid by the semi-autonomous Kurdish Regional Government (KRG). The money is coming now -- at least some of it is. A handy $15m gross should be wired to the company's account over the next few days, with further payments in the pipeline. All being well, it should soon move towards regular monthly payouts. \nShipping Out \nThis is great news for a company whose prime revenue lifeline has come from the tiresome task of trucking oil shipments via Turkey. The last KRG payment was in December last year, also for $15m. But there is still a long way to go. Management reckons it is owed $283m, and still cannot be sure it will ever be paid. Meanwhile, GKP will continue to burn through cash while it waits to see if the KRG makes good on its pledge to pump out additional revenues as shipments rise in the first half of next year. \nWe know the oil is there. GKP's Shaikan field can produce up to 70,000 barrels per day, but continuing payment worries may explain why the share price rallied just 5% after the recent announcement. The KRG has been in dispute with the Iraqi government over oil revenues and has a rather pressing need for the cash itself, which it needs to finance the war against Islamic State. Throw in the crash in the oil price, and you have trouble upon trouble. No wonder the share price is still down more than 60% this year, despite recent good news. \nSoco To Go \nThe problems afflicting Soco International (LSE: SIA) look relatively manageable by comparison. Yes, it's had a rough year, the share price down an equally painful 65%, but few oil stocks have come through 2015 unscathed. While GKN has been scratching around for $15m from its paymasters, Soco was strong enough to dish up $51m of first-half dividends, which suggests a strong financial position. \nNevertheless, Soco has been drilling through its cash pile. Cash flow was negative in the first half, on lower prices and production, with revenues falling to $117m, down from $246m in the first half of 2014. Operating profits fell to $28.7m, down from $174m. Investors were alarmed by the plunge in free cash from £64.8m to a negative $19.9m, but that was largely due to development project expenditure on its H5 wellhead platform in Vietnam. \nAnd The Winner Is... \nSoco's management remains confident, however, stating that future cash flow projections should secure its operational existence \"for the foreseeable future\". Production has now started at its H5, nicely ahead of schedule, and management remains committed to rewarding shareholders and pursuing further growth. No debt on the balance sheet, low operating costs and attractive Vietnam production economics continue to makes Soco a more solid proposition than GKP. Risk-takers may disagree. \nThe oil sector is in troubled waters but there may be safer opportunities elsewhere. Opportunities like this one. \nThe Motley Fool's Head of UK Investing has pinpointed the 1 'under-the-radar' pharmaceutical stock with blockbuster potential . \nThe stock has already delivered a strong return and our top expert believes there could be more to come. In fact, he reckons it offers investors potential upside which may be as high as 45%! \nTo find out which stock we consider one of the best small caps in the country, simply download our brand-new wealth report. It is free and without obligation, so click here now . \nHarvey Jones has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-09-16T09:22:00.000+03:00", "crawled": "2015-09-16T09:45:34.655+03:00", "highlightTitle": ""}