{"organizations": [], "uuid": "dc3ac9372d2234a234997b99ae7cc62530732e65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/02/usa-obama-alaska-idUSL1N1181LC20150902", "country": "US", "title": "UPDATE 1-Obama heads to Arctic community on last day of Alaska tour", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Obama heads to Arctic community on last day of Alaska tour | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T22:08:00.000+03:00", "replies_count": 0, "uuid": "dc3ac9372d2234a234997b99ae7cc62530732e65"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/02/usa-obama-alaska-idUSL1N1181LC20150902", "ord_in_thread": 0, "title": "UPDATE 1-Obama heads to Arctic community on last day of Alaska tour", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Pebble Partnership comment)\nBy Roberta Rampton and Steve Quinn\nANCHORAGE/JUNEAU Alaska, Sept 2 (Reuters) - President Barack Obama on Wednesday will become the first sitting U.S. president to visit a community north of the Arctic Circle, a trek the White House hopes will bring into focus how climate change is affecting Americans.\nAfter meeting tribal leaders and fishermen in Dillingham, home to the world's largest sockeye salmon fishery, Obama will fly into Kotzebue, an Arctic town of about 3,000 that is battling coastal erosion caused by rising seas.\nIn Kotzebue, Williie Goodwin, 71, said he hoped Obama would see the effect climate change has had on migration patterns of animals. But he said he does not want the federal government to restrict mining and energy production because jobs in those sectors would keep the North going.\n\"That is going to be sustaining our communities,\" he said. \"I can't shut the door on them and say, 'No offshore and no mining'.\"\nIn Dillingham, some residents are fighting the Pebble Mine copper and gold project that has been proposed by Northern Dynasty Minerals Ltd, which they say could hurt their salmon fishery.\n\"We're not opposed to mineral extraction, but salmon must always come first,\" said Jason Metrokin, president of the Bristol Bay Native Corporation.\nThe Environmental Protection Agency has placed restrictions on the proposed mine, which the company is fighting in court.\n\"Our view is that if the president is interested in the issue he should try to hear from all perspectives about it including those closest to Pebble who would like the jobs Pebble may provide,\" said Mike Heatwole, a spokesman for Pebble Limited Partnership.\nThe stops, at the end of a three-day tour of Alaska, are also aimed at cementing Obama's legacy on improving ties with Native Americans. He has also traveled by foot and boat to see glaciers that are quickly receding due to climate change.\nObama made a huge symbolic gesture to Native American communities at the start of his trip by renaming Mount McKinley, the highest mountain in North America, with its traditional Athabascan name, Denali.\nThe White House also announced dozens of fixes to existing programs and modest projects that it said had high potential and small price tags.\nObama boasted this week that he will have visited more tribal communities than any previous sitting president by the time he leaves office. He has said he wanted to hear concerns from \"everyday Alaskans\" on this tour. (Reporting by Roberta Rampton and Steve Quinn; Editing by Louise Ireland , Toni Reinhold )", "external_links": [], "published": "2015-09-02T22:08:00.000+03:00", "crawled": "2015-09-02T21:21:17.616+03:00", "highlightTitle": ""}