{"organizations": [], "uuid": "ab207e65b21c196c9e6109cf0dae858ab66b2208", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/money_getty_1.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/regulation/finance/252343-senate-dems-shine-light-on-corporate-political-spending", "country": "US", "title": "Senate Dems shine light on corporate political spending", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate Dems shine light on corporate political spending", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T22:09:00.000+03:00", "replies_count": 0, "uuid": "ab207e65b21c196c9e6109cf0dae858ab66b2208"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/finance/252343-senate-dems-shine-light-on-corporate-political-spending", "ord_in_thread": 0, "title": "Senate Dems shine light on corporate political spending", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate Dems shine light on corporate political spending By Tim Devaney - 08/31/15 03:09 PM EDT Senate Democrats are looking to rein in corporate political spending during the 2016 presidential campaigns. In a letter to the Securities and Exchange Commission (SEC) sent on Monday, a group of 44 Senate Democrats demand public companies be required to disclose their political spending to shareholders. The Supreme Court protects the right of corporations to spend unlimited amounts of money on presidential and congressional campaigns, but the senators are looking to bring more transparency to the process. Currently, companies spend millions of dollars in so-called “dark money” political advertisements. In fact, only 2.2 percent of public companies reveal their identities, according to the senators. \"Because shareholders are the true owners of a corporation, a public company should be required to disclose to its owners how their money is being spent,” the senators wrote to SEC Chairwoman Mary Jo White. The Supreme Court’s controversial Citizens United decision in 2010 paved the way for unlimited political spending by corporations. Critics of the decision are pushing to identify where the money is coming from. The SEC began work on such a rule in 2013, but later put it on the back burner. The senators hope the SEC will complete the rule ahead of the 2016 elections. Past: 1 day Trump: I’m winning because... \"There is a ... growing-by-leaps-and-bounds silent majority out there,\" he... O’Malley challenges DNC over '... “One debate in Iowa. That’s it. One debate in New Hampshire. That’s all we... Trump, Carson in close fight in... The two are tied when voters' first and second choices are combined. Wasserman Schultz blocked Iran... The resolution would have praised Obama and backed his nuclear deal with... Republicans plot counterattack to... Republicans intend to hammer Senate Dems if they don't allow an up-or-down... Trump rips Clinton aide Abedin and... Trump called Weiner \"one of the great sleazebags of our time.\" Sanders: ‘I can get beyond the... “I do not accept the fact that I have been weak on this issue,\" he said. Netanyahu OK with ‘civilian’ Iran... “We are opposed to a militarized nuclear program in Iran,” Netanyahu said. Sanders: DNC using debates to rig... Bernie Sanders said he agreed with Martin O'Malley's assertion. On Palin’s show, Trump defends... “That’s a very personal thing. I don’t like giving that out to people that... Greens: Obama climate legacy at... One green group warns Obama could have his \"Mission Accomplished\" moment. Barkley: Voting for Dems hasn’t... Barkley also says his favorite candidate is John Kasich. Jindal: Clinton one email away... \"It just seems to be one scandal after another,” he said. Warren turned down on invite to... Sen. Elizabeth Warren's granddaughter is in school and couldn't come, she... Larry Kudlow threatens Senate run... “I may lose,” Kudlow acknowledged. “It’s a long-shot. I’m not a politician... Christie: Clinton caught ‘disease... “The worst part about this is her arrogance,” Christie said. Kimmel spoofs Trump’s plan Kimmel spoofed Trump’s vague policy positions on Thursday with a parody ad. 3 reasons Bernie Sanders is now... With Hillary Clinton's growing email scandal, Sanders is now the Democrats... Trump ‘may have power’ in... “Donald Trump talks about things in ways that some Republicans really like... Poll: Sanders surges to within... Clinton leads with 37 percent support. But Sanders is close behind at 30...", "external_links": [], "published": "2015-08-31T22:09:00.000+03:00", "crawled": "2015-09-01T00:16:38.199+03:00", "highlightTitle": ""}