{"organizations": [], "uuid": "7b9d6b546ade68f0c98a08bec488e3f71c338ef5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509260277.html", "country": "US", "title": "Zambia: Beating the Power Challenge", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zambia: Beating the Power Challenge", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T22:50:00.000+03:00", "replies_count": 0, "uuid": "7b9d6b546ade68f0c98a08bec488e3f71c338ef5"}, "author": "", "url": "http://allafrica.com/stories/201509260277.html", "ord_in_thread": 0, "title": "Zambia: Beating the Power Challenge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zambia: Solar Panels Improve Health Care in Rural Zambia opinion \n\"I am very much aware of the trials and troubles that beset us; but we will face them with courage and determination not only to conquer them, but also to profit by our experience. For we do not shout from the rooftops that we are great. Rather we realise that now we must work to prove our right to greatness,\" (from Kenneth Kaunda's Inaugural Speech when he was being sworn in as the first President of the new Republic of Zambia on October 24, 1964). \nMany of the issues which Zambia faced for the first nine years between 1964 and 1973 already existed in embryo before 1964. The geopolitical environment for the new Republic looked extremely challenging. Zambia had just completed a little over one year after gaining her Independence, when the white settler minority and racialist government in Southern Rhodesia, now Zimbabwe, established their Unilateral Declaration of Independence (UDI) on November 11, 1965. \nThis minority regime led by Ian Smith used financial squeeze, economic blackmail and sabotage to punish Zambia for its support to the freedom fighters for Independence in Angola, Mozambique, Southern Rhodesia itself, South West Africa (now Namibia) and South Africa. \nAt the time of UDI, over 90 per cent of Zambia's imports and exports were carried by the Rhodesian railways from the Copperbelt to the ports of Beira and Lourenzo Marques, now Maputo, in Mozambique. \nThis was made possible by Zambia's strong, imaginative and visionary leadership; strong support for that national leadership by the population; strong national unity; calculated risk-taking; and a strong economy from 1964 to 1970, helped by the Vietnam War and a long strike by copper industry workers in the USA between 1967 and 1968, which made the market price of copper to rise. \nZambia's current electricity challenge is the first and the most serious challenge to the country's national economy and survival since the Rhodesian UDI. There are many parallels between these two national challenges. \nTherefore, Zambia's successful response to UDI can provide some useful lessons that can be learned and applied to overcome the current national electricity challenge and develop the country. \na. Main Challenges of UDI and Zambia's Positive Response \n1965 \nSoon after UDI, Rhodesia prohibited the conveyance of petroleum products through her territory to Zambia, imposed export tax on coal and threatened Zambia by many hostile acts ranging from psychological warfare to actual sabotage. \nIn June, South Africa started to build a large air and military base in the Caprivi Strip of South West Africa, just across the border from Zambia's Barotseland province (now Western province as of 1969). \nIn the same month, South Africa and Portugal stopped transshipping arms for the Zambia Defense Force. In October, Rhodesia seized a military consignment bound for Zambia and in December it imposed an export tax on coal from Wankie Colliery, of which 60 per cent and 30 per cent were used by the mines and the railway in Zambia, respectively. \nAt this time, the stockpile of coal on the Copperbelt could only last for 30 days. Zambia was faced with the challenge of how to quickly find alternative routes to the sea to carry its imports and exports. \nIt also had to figure out what to do with the common services of railways, airways and electricity which had remained in joint ownership after the dissolution of the Federation of Rhodesia and Nyasaland (1953-1963). The country's survival was at stake. \nZambia responded by a number of measures such as taking over radio; buying the Central African Mail and renamed it the Zambia Mail which later became the Zambia Daily Mail; the 'copper air bridge' an air lift of copper from Ndola to Dar es Salaam (December 1965 until May 1966); importation of petrol, oil and lubricants by a mud track road nicknamed 'hell-run', due to its high rate of accidents especially in the rainy season, from Tanzania; and creation of the National Coal Supply Commission, which led to the opening of a low-grade coal mine at Nkandabwe and later a high-grade coal mine at Maamba in the Gwembe Valley. \nPresident Kaunda declared that he would regard Rhodesian interference with the jointly owned common services, providing electrical power and transport as an act of war and would respond in kind. \n1966 \nThis was an extremely challenging and busy year for Zambia because the full economic consequences of UDI had started to be felt. Zambia was faced with the total paralysis of the economy. \nThere were shortages of petrol, oil, and lubricants and inflation and the cost of imports rose dramatically. The situation was made even worse when Rhodesian Railways quietly accumulated more than 70 per cent of the jointly owned rolling stock inside Rhodesia leaving Zambia seriously deficient in railway cars to carry copper. \nRhodesia also refused to accept any Zambian traffic passing through the country without prior payment. Furthermore, a large number of white senior expatriate Special Branch officers were alleged to pass State secrets to the Rhodesian regime. \nZambia rose to the challenge. A large amount of resources was allocated to build a new copper-mining and export oriented infrastructure independent of that of Rhodesia. \nSeveral measures were implemented to keep the country afloat. First, 17 white police officers, including the Inspector General, his deputy and 15 officers of the Special Branch were suddenly retired on grounds of security. \nSecond, studies were commissioned (1966-1967), to look into major improvements in road transport between Zambia and Tanzania and also to examine the capacity of Dar es Salaam and other East African ports such as Mtwara (Zambia financed the improvements of the harbor and airport at Mtwara) and Tanga in Tanzania, Mombasa in Kenya and Malawi outlet at Nacala in Mozambique to accommodate land-locked Zambia's transport needs. \nThird, Zambia took over television. Fourth, the Zambian and Tanzanian governments joined with the Italian Fiat organisation to create the Zambia-Tanzania Road Services (ZAMTAN) that used the Great North Road. \nThis was supplemented by private and mixed enterprises on the Great North Road and Great East Road, to get to Salima in Malawi and from there goods were railed to the Mozambican port of Beira. \nFifth, Zambia used the two subsidiary road (and road-rail-barge) routes that branched from the Great North Road to the southern Tanzanian port of Mtwara and another one that branched from the Great North Road in Zambia via Abercorn now (Mbala) to the railhead at Mpanda in Tanzania. \nFrom there, the railway linked to both Dar es Salaam and the port of Mwanza on Lake Victoria, where ferry boats provided a link to the Kenya railways. Sixth, the country used the road link that branched from Mbala to Mpulungu on Lake Tanganyika where barges connected with the Tanzania railways at Kigoma. \nSeventh, Zambia used the Congo-Katanga railway system (BCK, or Chemin de Fer du Bas-Congo au Katanga), where one branch of the BCK connected with the Benguela Railway (CFB or Caminho de Ferro de Benguela) of Angola, ending at the Atlantic Angolan port of Lobito. \nSmall quantities of coal were even brought from Germany through the Angola-Congo rail route. In the same year, a much better and larger coalfield at Maamba in the Gwembe Valley was discovered which was even comparable to Wankie Colliery in Rhodesia. Zambia also started to build an oil pipeline to carry crude oil from Dar es Salaam to Ndola. \n1967 \nIn 1967, the Rhodesian forces clashed with freedom fighters for the first time and Rhodesia invited in South African troops to be stationed in Rhodesia. Zambia was swift in its response. \nIt split from the two jointly owned common services with Rhodesia to set up Zambia Railways and Zambia Airways (a management contract to run Zambia Airways was given to the Italian State airline, Alitalia). \nThe capacity of the Victoria Falls power station was increased and negotiations began of a new agreement by BCK, Zambia and Bengwela railways to supplement the Kinshasa decisions of 1956 and 1960. William Tordoff writes that, 'In October 1967, when Balthazar Vorster, the Prime Minister of South Africa warned Zambia bluntly, \"If you want to try violence, as you have advised other States in Africa, we will hit you so hard that you will never forget it.\" \nKaunda replied that, \"Zambia could defend herself.\" Vorster then said that, \"South Africa desired peaceful relations with Zambia,\" and the exchange ceased' (Tordoff, 1974, p. 359). \nWhen President Kaunda took this calculated risk, Zambia had no military force to match that of South Africa and also it did not even have local commanding officers for the Zambia Army and Zambia Air force, they were both appointed in 1970 and 1971, respectively. \n1968 \nPortuguese bombing of Eastern and Barotseland provinces became more frequent with many Zambian casualties. The vital Luangwa Bridge, the gateway to the Eastern province, was blown up and South Africa threatened retaliation against Zambia because of freedom fighter activities in Rhodesia. \nZambia responded by making Mulungushi economic reforms; arming herself; producing more coal at Maamba Colliery; acquiring 26 diesel locomotives and 1,300 wagons; improving relations with Malawi; opening negotiations to join the East African Community; beginning the feasibility study by China on TAZARA; completing the new oil pipeline (TAZAMA), financed by the Italian banking group and constructed by the Italian State Petroleum Company (ENI), ending (32) months of petrol rationing in the country; and becoming a member of the United Nations Security Council. \nOn the eighth anniversary of the South African Sharpeville massacre of 1960 and also the eve of the International Day for the Elimination of Racial Discrimination in 1968, President Kaunda declared, 'Zambia has done what it can to fight injustice. \nThe hardships which we have undergone since UDI will not deter us from making further sacrifices if justice is assured.' Tordoff, p. 362). \n1969 \nPortuguese land and air violations into Zambia continued and more refugees arrived in Zambia from Mozambique. Douglas Anglin in Hall, The High Price of Principles (1969) estimates that between 1966 and 1969, there were no fewer than 65 armed intrusions across Zambia's borders by Portuguese air and land forces and at least 13 of the incidents involved loss of Zambian life. \nZambia responded by tightening internal security. It passed the State Security Act and arranged with Italy to replace the British Royal Air Force to accelerate training of the Zambia Air Force. \nIt also began the construction of the Kafue hydro-electric power station. \n1970 \nThis was the last year of Zambia's great cooper boom and the situation was exacerbated by the Mufulira mine cave-in disaster, which affected a quarter of copper production. \nRhodesia introduced a surcharge on Zambia's maize imports like it had done before with coal and in November, at the start of the farming season, it held up urgently needed fertiliser supplies. \nZambia responded by installing a coal washing plant at Maamba Colliery; beginning the construction of the Kariba North Bank Power Station and TAZARA; hosting the prestigious third Non-Aligned Conference; and President Kaunda published Take up the Challenge. \n1971 \nIn addition to the continuing Portuguese aggression, Portugal imposed a partial blockade on Zambia-bound cargo at the Ports of Beira and Lobito Bay in Mozambique and Angola, respectively. Zambia responded by introducing the Home Guard Bill in the National Assembly to supplement the National Service Act, which had been passed earlier in the year and opening a railway workshop at Kabwe to replace the Bulawayo workshop of Rhodesia railways. \nIn 1972, coal production at Maamba Colliery became greater than Zambia's demand because the dieselisation of the railway system substantially reduced the domestic demand for coal. \nIn 1973 when Rhodesia closed the border with Zambia in reprisal for the actions of nationalist freedom fighters that were alleged to operate from Zambia, Zambia was least affected because it was now independent of Rhodesia in many respects. \nToday, Zambia is held in high esteem in the world and the region for its sacrifices and support it provided which significantly helped its five neighboring countries to become independent; Angola and Mozambique in 1975, Zimbabwe in 1980, Namibia in 1990 and South Africa in 1994. \nb. Lessons for Learning \n(a) Turn a problem into a challenge because a problem is an obstacle while a challenge can be overcome and also the only purpose of any challenge is to make you stronger than you were before. \nPresident Kaunda in his inaugural Speech in 1964 talked about 'trials and troubles' that beset the country but in 1970 he was talking about challenges when he published Take up the Challenge. (b) Think Big and plan for the future because failing to plan is planning to fail. \nThe construction of ZAMTAN, TAZAMA, TAZARA, Kariba North Bank and Kafue Hydro Electric Power Stations and UNIP new headquarters (now renamed Government New Office Complex), to name only but a few, were all big projects that required vision and planning. \n(c) Encourage strong, imaginative and visionary leadership at all levels; Give strong support to the national leadership because this electricity emergency has been in the making for some time, national electricity demand surpassed electricity supply way back in 2009 and Climate Change and Global Warming is a planetary phenomenon affecting almost every country; Demonstrate strong national patriotism and unity because all big things like TAZAMA, TAZARA, Kariba North Bank and others only happen at the peak of team work; use calculated risk-taking; and safeguard full capacity operation of the mines to generate national income to finance development projects; and (d) Be courageous, determined and confident that we will together overcome this challenge just like our Founding Fathers overcame the challenge of UDI. \nc. Recommendations to Overcome the Current Electricity Challenge \nThe following are some recommendations for consideration. (a) Immediate to Short-term Measures-(i) Take electricity (rationing) from some rural areas and other less productive places to the mines to keep the mines running normally at all costs to generate the much needed revenue and stabilise the employment situation. \n(ii) Procure supplementary electricity, on an emergency basis only, from anywhere in the world through mobile generators; (iii) Create a National Electricity Supply Commission of Zambia's brightest men and women to look into long-term solutions to the electricity challenge in the country in view of Climate Change and Global Warming. \n(iv) Commission studies to examine major improvements in energy production in the country; and (v) Provide private energy sector with subsidy and tax incentives in equipment procurement for electricity production from coal, solar, water and wind energy. (b) Medium to Long-Term Measures--(i) Invest in electricity production from coal; (ii) Invest in electricity production from solar energy (Solar Farms); (iii) Invest in electricity production from other water bodies scattered around the country; (iv) explore the feasibility of linking the Kafue River to Lake Kariba by a tunnel under the Zambezi Escarpment to normalise the water levels at Lake Kariba while still running the Kafue hydro electric power station; and (v) Work to really diversify the economy from copper, this recommendation was first made fifty years ago by the Seers Report in 1964. \nd. Conclusion \nWhere there is a will there is always a way. As human beings, we are capable of creating anything on which we put our minds. \nThis is because our mind is connected to the Omnipotent (All Powerful), Omniscient (All Knowing) and Omnipresent (All Present Everywhere) Universal Mind of Eternal Intelligence. Collectively, let us now rise to 'Take up the Challenge' and use our mind at this defining moment, with national courage, determination, patriotism, unity and self-confidence, like our freedom fighters did at the time of UDI. \nLet us now work together to 'prove our right to greatness' and overcome our electricity challenge. \nIf we do this, when future generations will read about our history they will be able to say that this was indeed our Finest Hour! \nThe author is a Motivational Mentor and Social Development Specialist Consultant Zambia \nAs innocent citizens are registering to vote during the 2016 elections, we wonder if they know that they might be … see more » Copyright © 2015 The Times of Zambia. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-26T22:50:00.000+03:00", "crawled": "2015-09-27T05:35:55.698+03:00", "highlightTitle": ""}