{"organizations": [], "uuid": "61c46343d924c63bb2786f0da10e4a2241da127d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/23/590x/cash-for-crash-607435.jpg", "site_section": "http://express.co.uk//posts/rss/23/personalfinance", "section_title": "Daily Express :: Personal Finance Feed", "url": "http://www.express.co.uk/finance/personalfinance/607435/crash-for-cash-fraudsters-todays-highway-robbers", "country": "", "title": "New crash-for-cash fraudsters 'are today's highway robbers'", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "New crash-for-cash fraudsters 'are today's highway robbers'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T19:06:00.000+03:00", "replies_count": 0, "uuid": "61c46343d924c63bb2786f0da10e4a2241da127d"}, "author": "", "url": "http://www.express.co.uk/finance/personalfinance/607435/crash-for-cash-fraudsters-todays-highway-robbers", "ord_in_thread": 0, "title": "New crash-for-cash fraudsters 'are today's highway robbers'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New crash-for-cash fraudsters 'are today's highway robbers' New crash-for-cash fraudsters 'are today's highway robbers' BRITISH drivers have been warned over a wave of sinister new crash for cash fraudsters who pressure victims to hand over cash at the scene of an accident. PUBLISHED: 17:06, Wed, Sep 23, 2015 | UPDATED: 17:24, Wed, Sep 23, 2015 GETTY Women and elderly at risk over new cash for crash scams \nBehaving like modern day highway robbers, criminals typically slam on their brakes without warning in the hope that the driver behind will crash into them.Fraudsters have traditionally then gone on to make an insurance claim, bumped up with bogus injuries such as whiplash, which ultimately hikes honest drivers' premiums. But gangs are now going one step further and pressuring victims at the scene to hand over cash.It is feared those most at risk are the elderly, women travelling alone or with children, and younger inexperienced drivers.In one case seen by an insurer, a motorist was even offered a lift to a cash machine in order to get some money.High-value cars, which are more likely to be insured, also tend to be targeted by the scammers.Tom Gardiner, head of fraud at Aviva, said the development was nothing short of \"bringing back the days of 'highway robbery\"'.He said: \"We are seeing anecdotal evidence of fraudsters deliberately causing an accident and then pressuring the target - or 'at fault' party - into paying them money in exchange for not making an insurance claim.\"Motorists are left feeling intimidated and that they have no choice to comply.\"Even if a victim pays up, it's likely that the stooge will pocket the cash and the gang will still go on to make a bogus insurance claim.Mr Gardiner said that if someone feels threatened following an accident they should call the police to the scene.Drivers should not make any admission of fault or payment, but simply make a note of the other party's registration number, and get as much information as possible, such as name, address, phone number and the number of people in their vehicle, he said.He added: \"If possible and safe to do so, take a photo of the accident.\"You should tell your insurer about the other party's behaviour so they can investigate the claim and defend you if it is fraudulent.\"Industry experts recently urged more insurers to give drivers a discount in exchange for having dashboard cameras in cars.Footage of an accident can prove that a fraudster provoked an accident - but only a couple of insurers currently offer any financial incentive to use the gadgets.If a driver suspects an accident was staged, they can report it to the Insurance Fraud Bureau's (IFB) cheatline on 0800 422 0421. Related articles", "external_links": [], "published": "2015-09-23T19:06:00.000+03:00", "crawled": "2015-09-23T19:50:11.688+03:00", "highlightTitle": ""}