{"organizations": [], "uuid": "a517d98eb71a312cbf9142eb6cd9498646dd0bbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/q/j/n/f/image.related.afrArticleLead.620x365.gjdp4c.png/1441186796278.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/bruce-billson-hits-back-at-cabinet-snub-20150902-gjdp4c", "country": "AU", "title": "Bruce Billson hits back at cabinet snub", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Bruce Billson hits back at cabinet snub | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T15:43:00.000+03:00", "replies_count": 0, "uuid": "a517d98eb71a312cbf9142eb6cd9498646dd0bbe"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/politics/bruce-billson-hits-back-at-cabinet-snub-20150902-gjdp4c", "ord_in_thread": 0, "title": "Bruce Billson hits back at cabinet snub", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bruce Billson had a sarcastic response for his cabinet colleagues after his plan to cut big companies' abuse of power was put on the back burner. Share on twitter by Phillip Coorey Small Business Minister Bruce Billson has hit back at his cabinet colleagues who all but killed off his plans to crack down on the misuse of market power by corporate giants .\nA day after cabinet deferred indefinitely a scheduled discussion on Mr Billson's proposals to toughen section 46 of the Competition Act, the minister used sarcasm to vent his frustration during a speech to an audience of small and medium business representatives in Perth.\n\"You would have read, I am sure in recent days, I am getting smacked around by trying to get the competition rules right,\" Mr Billson told the Western Australian Chamber of Commerce and Industry.\n\"Well, I have got this novel idea that the economy should support efficient businesses, big and small.\n\"That you should not, as a small business, be taken out just because a big business has muscle and might. Not on merit, but just because they can push you around. When did someone decide that was a good idea?\"\nOn Tuesday, Mr Billson, based on recommendations from the Harper Review into competition, took to cabinet, proposals for an effects test and to toughen the \"take advantage\" provision of the act.\nBusiness Council lobbying Mr Billson said he had fashioned his proposal to appease the concerns of the Business Council Of Australia which, in its behind-the-scenes lobbying, had threatened a public campaign had cabinet adopted the changes.\n For reasons the government has not explained, the debate was shelved indefinitely. Had it gone ahead, Mr Billson risked being rolled with the cabinet heavy hitters, many of them lawyers, opposed to his proposals.\nThese included Attorney-General George Brandis, who has extensive legal experience in the area, Julie Bishop, Joe Hockey, Malcolm Turnbull, Mathias Cormann and Andrew Robb.\nPrime Minister Tony Abbott, who was initially supportive, backed off. On Tuesday, he was less than lukewarm to the proposals when asked.\n\"Let's never forget that there is a lot happening already here. We have got a Grocery Code of Conduct ... that has some teeth,\" he said.\n\"We have also done a lot to support small business with the biggest tax cuts in history for small business.\"", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-09-02T15:43:00.000+03:00", "crawled": "2015-09-02T14:07:51.996+03:00", "highlightTitle": ""}