{"organizations": [], "uuid": "521d8c0605628a561d993e588d2721bc6cae385a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyinterlake.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/dailyinterlake.com/content/tncms/assets/v3/editorial/7/28/72866b44-4de1-11e5-923c-1310c9c13c8d/55e0f6eedecf2.image.jpg?resize=760%2C504", "site_section": "http://www.dailyinterlake.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=business_and_finance/local_montana,business_and_finance/local_montana/*&f=rss", "section_title": "Daily Inter Lake - business and finance/local montana,business and finance/local montana/", "url": "http://www.dailyinterlake.com/business_and_finance/local_montana/wild-wings-opens-this-week/article_aaefb5c4-5423-11e5-90b8-73dccdc0f52b.html", "country": "", "title": "Wild Wings opens this week", "performance_score": 0, "site": "dailyinterlake.com", "participants_count": 1, "title_full": "Wild Wings opens this week", "spam_score": 0.0, "site_type": "news", "published": "2015-09-06T06:00:00.000+03:00", "replies_count": 0, "uuid": "521d8c0605628a561d993e588d2721bc6cae385a"}, "author": "Seaborn Larson/The Daily Inter Lake", "url": "http://www.dailyinterlake.com/business_and_finance/local_montana/wild-wings-opens-this-week/article_aaefb5c4-5423-11e5-90b8-73dccdc0f52b.html", "ord_in_thread": 0, "title": "Wild Wings opens this week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Buffalo Wild Wings in scheduled to open on Sept. 9. (Aaric Bryan/Daily Inter Lake) DIL buffalo wild wings 3.JPG \nA Brock Osweiler jersey is part of the memorabilia hanging on the walls at the Buffalo Wild Wings. (Aaric Bryan/Daily Inter Lake) DIL buffalo wild wings 2.JPG \nThe Buffalo Wild Wing booths are numbered like stadium sections as part of the overall design. (Aaric Bryan/Daily Inter Lake) Posted: Saturday, September 5, 2015 9:00 pm Wild Wings opens this week By Seaborn Larson/The Daily Inter Lake Daily Inter Lake | 0 comments \nBuffalo Wild Wings opens Sept. 9 in north Kalispell at the former location of the Sizzler. \nIt will be the seventh Buffalo Wild Wings restaurant in Montana for the Billings-based Anderson Management Group. \nThe facility underwent a major reconstruction and remodeling. \nAnderson Management owner Brad Anderson said he believes the 5,500-square-feet restaurant — complete with massive television screens (inescapable from any view or angle) and local sports jerseys lining the walls — will make an easy transition into the community. \n“The fun part about the [Buffalo Wild Wings] concept is being involved as much as we can and getting involved with the community,” Anderson said. “To be at this point is kind of surreal.” \nAnderson said he isn’t looking to open a rowdy sports bar. He has maintained a strict family model with the Buffalo Wild Wings franchise. \n“We’re not a sports bar,” Anderson said. “We’re a sports restaurant.” \nIn addition to its signature chicken wings, Buffalo Wild Wings will offer a breadth of microbrews from local and state brewing companies, including Yard Sale Amber Ale from Tamarack Brewing Co., Golden Grizzly Ale from Glacier Brewing Co. and the seasonal rotator from Flathead Lake Brewing Co. \nThe restaurant is located in Hutton Ranch Plaza next to U.S. 93. \nThe location is close to Glacier High School, Anderson noted, and he expects to host high school-aged groups and their families after local football games and for the upcoming professional football season. \n“We’re hoping to see a lot of that traffic,” said David Moorhead, marketing director for Anderson. “You can’t really miss this building, especially when you drive by and see the big yellow siding.” \nThe restaurant may open on Sept. 9 but the branding began months ago when Anderson Management purchased the former Sizzler earlier this year. \n“Since we developed the idea to come to Kalispell, we immediately tried to ingrain ourselves in with the high schools,” Moorhead said. Anderson Management has helped sponsor football camps put on by Kalispell high schools, Moorhead said. \n“We want to do a ton of team feeds and just be involved with sports in any way that we can,” he said. “Kalispell has been really responsive and that’s exciting to see.” \nThe restaurant has already hired 120 employees, according to Brian Yates, director of operations. Training began Monday as the Sept. 9 opening date draws closer. \nThe restaurant includes the most recent design by the franchise, similar to the interior layout found in Butte and Billings. \n“Each market in Montana is a little different,” Yates said. “But everything has gone pretty smoothly this far.” \nThe restaurant will hold a few pre-opening events, including a youth campout on the lawn in front of the building on Sept. 8. Anderson Management has also given out 75 tickets to a VIP event on Sept. 8 to each school to sell as fundraisers. The VIP event is before opening night as the staff works out its final kinks. \nThe Kalispell restaurant is the third one in Montana completed this year. The other two are in Great Falls and Butte. Anderson Management owns all Buffalo Wild Wings franchises statewide, with additional locations in Billings, Bozeman, Helena and Missoula. \nAnderson hopes that Kalispell will soon rank in the top-three Buffalo Wild Wings locations, following the successful operations in Billings and Bozeman. \n“We’ll see where we are in six months,” Anderson said. \nReporter Seaborn Larson may be reached at 758-4441 or by email at slarson@dailyinterlake.com .", "external_links": [], "published": "2015-09-06T06:00:00.000+03:00", "crawled": "2015-09-09T01:02:00.042+03:00", "highlightTitle": ""}