{"organizations": [], "uuid": "46fc2dbc514d3a7fc3c1b04ea4ee367e7fc74ea2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/", "section_title": "Forbes - Personal Finance Information and Personal Finance News - Forbes.com", "url": "http://www.forbes.com/sites/troyonink/2015/08/31/saving-for-college-its-time-to-look-at-the-private-college-529-plan/", "country": "US", "title": "Saving For College? It's Time To Look At The Private College 529 Plan", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "Saving For College? It's Time To Look At The Private College 529 Plan", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T10:20:00.000+03:00", "replies_count": 1, "uuid": "6482460b86b070143d8f58d210643b0d0cb0a568"}, "author": "Troy Onink", "url": "http://www.forbes.com/sites/troyonink/2015/08/31/saving-for-college-its-time-to-look-at-the-private-college-529-plan/#post-0", "ord_in_thread": 0, "title": "Saving For College? It's Time To Look At The Private College 529 Plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Parents who want to avoid the volatility and potential losses of the stock market while saving for a child's private college education should consider the guaranteed Private College 529 Plan. This college savings plan allows parents to purchase plan tuition certificates at 270 of nation's top private colleges at today's prices, earning a guaranteed rate-of-return equivalent to the rise in tuition prices at individual colleges between now and when a child enrolls.As this post went up the Dow Jones Industrial Average was set to drop over 400 points on September 1st. In recent weeks we have seen announcements of Dow Theory Sell Signals, so-called \"death crosses\" by stock indices and other dire but real warnings about the future direction of the stock market. Given this volatility in the stock market, risk averse investors may want to consider using the Private College 529 Plan almost like a fixed income or guaranteed allocation of their overall college savings.Yes, you can choose to go to a college outside of the plan, and your guaranteed return will be 2% per year maximum. However, you can also roll the Private 529 Plan over to a 529 college savings plan, too, or change the beneficiary to a qualified family member of the original beneficiary. In short, if you want your child to be able to attend one of the nation's top 270 private colleges, and you don't want the risk of the stock or bond markets, this plan is a logical choice, is well run and worthy of your consideration.The plan was established by the Tuition Plan Consortium (TPC) back in 2003 and operates under the direction of its Board of Directors, with the investment management of the plan handled by OFI Private Investments, a subsidiary of Oppenheimer Funds, Inc.[caption id=\"attachment_3780\" align=\"\" width=\"659\"] Nancy Farmer, President and CEO of the Tuition Plan Consortium, Private College 529 Plan[/caption]Nancy Farmer is the President and CEO of the Tuition Plan Consortium. She shared the following insights about the college savings landscape and the role that the Private College 529 Plan serves in helping families save for college.• 529 savings plans are wonderful, tax-advantaged vehicles for families to use in planning and saving for college. At Private College 529 Plan we have long argued, though, that calling them “savings” plans is misleading. 529 savings plans are generally investment accounts that can – and do – lose money, as we’ve just seen.• We encourage families to use 529 savings plans alongside Private College or other 529 prepaid plans, but believe that families should understand the risks and choose a plan and investment option that meets their needs. (Private College 529 Plan only covers tuition and mandatory fees so a 529 investment account can be used for other expenses like room and board or books.• We encourage families to employ a diversified education portfolio -- the same way as saving for retirement. Prepaid plans, including Private College 529, serve that purpose. As we have seen this week, a fixed asset sleeve – protected from market downturns – is an important allocation in that portfolio.• Private College 529 Plan is a great alternative if you want your future student to attend a private college or university. While not sponsored by a state, Private College 529 enjoys the same flexibility as any other 529 plan. The distinction is that Private College 529 is owned and operated by private colleges and universities. It is the 270 member institutions (Princeton to Notre Dame to Stanford and everything in between!) that take the financial risk and guarantee your prepaid tuition. In times like these, the schools accept a shortfall in payments from the plan. During market upswings, the schools receive excess payments from the plan. Over time schools will break even.• Five new schools have joined our plan in the last year, and we continue to recruit schools aggressively. Our board members are continually reaching out to their peers at other institutions to let them know how our plan benefits members. Families also can make a difference. In fact, one school recently signed up for Private College 529 Plan because of the strong urging of an active alum! If a family is interested in a school not on our list, we encourage them to contact the school to suggest that it join.• For families, Private College 529 offers peace of mind. It doesn’t matter how much tuition increases or what happens in the financial markets: what you prepay today will be there for your future student for up to 30 years – GUARANTEED!• Beyond piece of mind, by buying tomorrow’s tuition at today’s prices families can save on the cost of college, and borrow less.• Families pay no fees with Private College 529. Member schools pay all of the fees and accept all of the market risk. Every dollar contributed buys future tuition.", "external_links": ["https://www.privatecollege529.com/OFI529/home.jsp", "https://www.privatecollege529.com/doc/Private_College_529_Participating_Colleges_By_School.pdf"], "published": "2015-09-01T10:20:00.000+03:00", "crawled": "2015-09-01T20:12:03.372+03:00", "highlightTitle": ""}