{"organizations": [], "uuid": "66fad77097c7cca5da9dbe81d9f48576a437bed1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/banking-finance/indian-rupee-at-fresh-two-year-low-against-us-dollar-still-doing-better-among-brics/131970", "country": "IE", "title": "Indian rupee at fresh two-year low against US dollar, still doing better among BRICS", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Indian rupee at fresh two-year low against US dollar, still doing better among BRICS | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T08:15:00.000+03:00", "replies_count": 0, "uuid": "66fad77097c7cca5da9dbe81d9f48576a437bed1"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/indian-rupee-at-fresh-two-year-low-against-us-dollar-still-doing-better-among-brics/131970", "ord_in_thread": 0, "title": "Indian rupee at fresh two-year low against US dollar, still doing better among BRICS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles NPA situation may worsen in 2-3 years, shows EY survey Indian rupee bounces back by 27 paise to close at 66.55 against US dollar Rupee at 2-year low on dollar demand The rupee hit a fresh two-year low of 66.83/$ on Monday but was still the strongest currency among BRICS nations and also among many other emerging market currencies even though it has fallen more than 5% so far in 2015.\nThe Indian currency shed 0.54% to hit an intraday low of 66.86/$ before settling at 66.83/$ for the session on the back of strong dollar demand from banks in anticipation of outflows as local shares traded in the red.\nThe 30-share Sensex ended at a 15-month low while the 50-share Nifty ended at the weakest level in two months. Lack of clarity on the US Federal Reserve’s likely move next week at its rate-setting meeting has kept most currencies, including the rupee, weak against the dollar.\nAnanth Narayan G, regional head of financial markets for South Asia at Standard Chartered Bank, notes that the latest jobs data from the US did little to provide clarity. “The data was mixed and that was a bit of disappointment,” Narayan said.\nOn Friday, data showed that the US economy added 173,000 individuals on its payroll in August, far lower than most market estimates of an addition of more than 200,000. However, unemployment rate for the largest economy fell to its lowest since January 2013. The imminent rate move of the Fed along with China’s devaluation of the yuan in early August has dragged currencies across geographies.\nBack home, the rupee has lost 5.56% since January with bulk of that depreciation (around 4%) over the last one month triggered by China’s devaluation of the yuan.\nIn the last one month, however, its BRICS counterparts barring Chinese yuan — Brazilian real, Russian ruble and South African rand — all have depreciated more. Other emerging market currencies such as Malaysian ringgit, Indonesian rupiah and Turkish lira too have fallen by more than 5%. Economists expect the rupee to trade in a range going ahead. “Given the ample foreign exchange reserves to combat the volatility in the rupee — the Reserve Bank of India had close to $354 billion in foreign exchange reserves as of 14 August 2015 — the rupee will be range bound,” said CRISIL in a report.\nPart of the rupee’s outperformance relative to most of its emerging market peers comes from the fact that the Reserve Bank of India has been intervening in the market to curb volatility.\nThe fall in foreign exchange assets during August indicates the central bank’s possible interventions. Currency dealers said that on Monday a handful of public sector banks were seen selling dollars around 66.80/$ but it could not be confirmed whether the selling was at the behest of the RBI .\nFurther, foreign portfolio investors have not been fleeing India like they did in 2013 and have been net investors in debt for up to $46 million so far this month. The confidence of investors comes from the fact that the country’s reserves are near all-time highs and the central bank has assured at regular intervals that it would not hesitate to step in to curb volatility of the rupee.\n 12:15 am", "external_links": [], "published": "2015-09-08T08:15:00.000+03:00", "crawled": "2015-09-09T00:06:17.675+03:00", "highlightTitle": ""}