{"organizations": [], "uuid": "1e937957ffb5f5f00a87681758cf05a14c1d94a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/forex/wp-content/uploads/sites/8/2015/07/Trading-Time-red.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/forex/brokers/daily-fx-brokers-news-darwinex-xtb-and-ig-group/", "country": "US", "title": "Daily FX Brokers’ News: Darwinex, XTB and IG Group", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Daily FX Brokers’ News: Darwinex, XTB and IG Group", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T01:21:00.000+03:00", "replies_count": 0, "uuid": "1e937957ffb5f5f00a87681758cf05a14c1d94a4"}, "author": "", "url": "http://www.financemagnates.com/forex/brokers/daily-fx-brokers-news-darwinex-xtb-and-ig-group/", "ord_in_thread": 0, "title": "Daily FX Brokers’ News: Darwinex, XTB and IG Group", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Darwinex"], "text": "Print This Post \nAs the week draws to a close, we bring you the latest daily roundup of changes to the products and offerings of forex brokers around the world. \nWhile the upcoming U.S. Labour Day on Monday has prompted Alpari, FXOpen, and Hirose to update customers on affected trading schedules, Darwinex, XTB and IG have made changes to their trading environments and technology. DARWIN Correlation Now Live \nThe UK-regulated trading firm, Darwinex, today announced the launch of the DARWIN portfolio correlation engine. \nThe launch of DARWIN Correlation draws on the company’s historical legacy of providing trader performance evaluation tools. The new technology means that: DARWIN Portfolio equity at risk is no longer the simple sum of individual DARWIN equity at risk (which would imply 100% correlation); Rather, DARWIN Portfolio equity at risk accounts for diversification by analysing the correlation between DARWINs in a portfolio; Correlations are available at all times. \nCorrelation ranges are colour-coded according to the following defintions: Green (high diversification / low overlap) -> correlations of 0.2 or lower (including negative ones); Orange (medium diversification / overlap) -> correlations higher than 20% (0.2) but lower than 50% (0.5); Red (significant overlap) -> correlations higher than 70% (0.7). \nHaving become a licensed advisor in 2013 , from the beginning Darwinex has shown its intentions to combine both money management products and trader evaluation within its offering. XTB Amends Fees and Commissions \nMeanwhile, the British arm of Polish online broker, XTB, has advised clients to take a look at its revised Fees and Commissions Table. The company has made a number of amendments, which have already come into effect. \nSpecifically, traders with XTB can expect a decrease of minimum Equity CFD commission on CZK from 400 to 300. \nThe Polish-headquartered XTB made headlines in June when CEO, Jakub Maly, confirmed with Finance Magnates that that the firm was thinking about listing on the Warsaw Stock Exchange, with the offering expected to be worth €200 million ($224 million). IG Group Trading Technology Changes \nFinally, IG Group (LSE: IGG), the UK-based broker, presented a number of changes to its trading environment today, including adding new features to its trading platform. \nSpecifically, the firm’s online trading has undergone some changes. Traders can now: Tab different panels into the same window for watchlists and charts; Drag and drop individual markets into their watchlists or charts; Select their favourite options more quickly with an improved drop-down list; Click on the top-navigation to bring the corresponding panel to the front. \nCorrespondingly, the mobile app has also been under development, with users now able to access free, interactive and customisable charts from their mobile devices. \nFinally, IG rounded out its new offerings by announcing that traders can gain even more control over their order execution, with the “partial fills” and “points through current” features having been added to the trading platform and the latest version of the IG mobile trading app. \nIn July, IG Group made headlines after it announced its preliminary results for the 2014 fiscal year . Despite the Swiss franc turmoil back in January, which saw the broker sustain heavy losses, the company registered a respectable growth rate in underlying revenues, up by 8% to $622 million (£400 million). \nGot a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-09-05T01:21:00.000+03:00", "crawled": "2015-09-04T23:42:34.144+03:00", "highlightTitle": ""}