{"organizations": [], "uuid": "862a557c9b357d55160c9c551771c84deb94d368", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "atlantajewishtimes.com", "main_image": "http://atlantajewishtimes.com/wp-content/uploads/2015/09/unaffiliated-5776-high-holiday-services-01.jpg", "site_section": "http://atlantajewishtimes.com/category/business-finance/page/9/", "section_title": "Business &amp; Finance Archives - Page 9 of 11 - Atlanta Jewish Times", "url": "http://atlantajewishtimes.com/2015/09/low-cost-high-holiday-services-5776/", "country": "US", "title": "Low Cost High Holiday Services 5776", "performance_score": 0, "site": "atlantajewishtimes.com", "participants_count": 1, "title_full": "Low Cost High Holiday Services 5776 - Atlanta Jewish Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T00:16:00.000+03:00", "replies_count": 0, "uuid": "862a557c9b357d55160c9c551771c84deb94d368"}, "author": "Rabbi Eliyahu Schusterman of Chabad Intown", "url": "http://atlantajewishtimes.com/2015/09/low-cost-high-holiday-services-5776/", "ord_in_thread": 0, "title": "Low Cost High Holiday Services 5776", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The following are some of the High Holiday options for people who aren’t synagogue members or are looking for something different at no or low cost. Rosh Hashanah starts Sunday night, Sept. 13, and concludes Tuesday night, Sept. 15. Yom Kippur runs from Tuesday evening, Sept. 22, to Wednesday night, Sept. 23.\nThe Sixth Point\nThe Sixth Point celebrates the new year with its adults-only alternative to services, Rosh in the Park, from 4 to 6 p.m. Sept. 13 outside the Hammond Park Community Building, 6005 Glenridge Drive, Sandy Springs. The event is more spiritual than religious, featuring discussions about the holiday, reflections on the past year, intentions for the coming year, and apples and honey. Options are available for Erev Rosh Hashanah dinner afterward. Free; thesixthpoint.org .\nChabad Intown\nRabbi Eliyahu Schusterman of Chabad Intown Chabad Intown, 928 Ponce de Leon Ave., Atlanta, offers three sets of free High Holiday services open to all: traditional services blended with contemporary messages and led by Rabbi Eliyahu Schusterman; learners services led by Rabbi Ari Sollish; and family and children’s services. A buffet Kiddush follows daytime Rosh Hashanah services. Reservations are requested through atl18love.org or 404-898-0434. Traditional Rosh Hashanah services are at 7:30 p.m. Sept. 13, 9:30 a.m. Sept. 14 and 15, and 8:15 p.m. Sept. 14. Learners services are at 10 a.m. Sept. 14 and 15. The children’s program runs from 11 a.m. to 12:30 p.m. Sept. 14 and 11:30 to 12:30 Sept. 15, with a family service from 11:15 to 11:45 both days. Tashlich is at 5:30 p.m. Sept. 14 at the Piedmont Park Gazebo, followed by a procession to the Beltline at the Ponce overpass for a shofar blowing at 6:15. For Yom Kippur, Kol Nidre starts at 7:15 p.m. Sept. 22. The traditional morning service begins at 9:30 Sept. 23, while the learners service is at 10. The children’s program is 10:30 a.m. to 12:30 p.m., with the family service from noon to 12:30. Yizkor is at 1 p.m. and Mincha at 5:45.\nYJP Midtown Atlanta\nChabad Intown’s Young Jewish Professionals group offers a 45-minute slackers service, including apples and honey and the shofar, at 6:45 p.m. Sept. 14 at Chabad Intown, 928 Ponce de Leon Ave., Atlanta. Attendees are welcome to stay for traditional second-night Rosh Hashanah services at 8: 15 p.m. Free; www.yjpmidtownatlanta.com or 404-898-0434.\nBrookhaven Bayit\nBrookhaven Bayit, the new young-adult group housed at Sephardic Congregation Or VeShalom, 1681 North Druid Hills Road, Brookhaven, holds a free, alternative Rosh Hashanah service led by Bayit@OVS director Sim Pearl from 11 a.m. to 12:45 p.m. Sept. 14. RSVP to sim@orveshalom.org.\nCongregation Beth Jacob\nAll High Holiday services at Orthodox Congregation Beth Jacob, 1855 LaVista Road, Toco Hills, are free and require no tickets. Evening Rosh Hashanah services in the main sanctuary and the kollel are at 7:30 p.m. Sept. 13 and 7:15 p.m. Sept. 14 and 15. Shacharit is at 7:30 a.m. Sept. 14 and 15, with the Torah service in the main sanctuary at 9:30, followed by the sermon at 10, and shofar blowing and Mussaf at 10:30. For Yom Kippur, Kol Nidre is at 7:05 p.m. Sept. 22. Services Sept. 23 start at 8:30 a.m.; Neilah is at 6:25 p.m. Visit www.bethjacobatlanta.org/yamimnoraim for more information.\nBeth Jacob also offers learners minyans under the leadership of Matt Lewis, followed by lunch during Rosh Hashanah, from 10:30 a.m. to 12:30 p.m. Sept. 14 and 15 and from 11 a.m. to 1 p.m. Sept. 23. For more information, email HighHolidayMinyans@yahoo.com , visit www.Facebook.com/HighHolidayMinyans, or call 404-633-0551.\nShema Yisrael\nShema Yisrael: The Open Synagogue holds services open to all at Unity Church, 3597 Parkway Lane, Norcross. Bob Bahr, Eugen Schoenfeld and Cantor Herb Cole lead the services, set for 7 p.m. Sept. 13 and Sept. 22 and 11 a.m. Sept. 14 and Sept. 23. Tickets are $65, covering all of the High Holidays, and reservations are required; www.shemaweb.org.\nCongregation Bet Haverim\nReconstructionist Congregation Bet Haverim allows free, ticketless admission to all High Holiday services at St. Bartholomew’s Episcopal Church, 1790 LaVista Road, Toco Hills. Erev Rosh Hashanah services are at 8 p.m. Sept. 13. Morning services Sept. 14 and 15 are at 10. Tashlich is at 2:30 p.m. Sept. 14 at W.D. Thompson Park, 1760 Mason Mill Road. For Yom Kippur, Kol Nidre starts at 8 p.m. Sept. 22. The morning service Sept. 23 is at 10, with a meditation service at 3 p.m., Yizkor at 4:15 and Neilah at 5:30. Children’s services Sept. 14 and Sept. 23 start at 10:15 a.m. For more information, including child care, visit congregationbethaverim.org/HighHolidaysCentral, or call 404-315-6446.\nCongregation Kehillat HaShem\nRabbi Jeffery Feinstein offers free services using the Reform “Gates of Repentance” mahzor at Brookdale, 1000 Applewood Drive, Roswell. Rosh Hashanah services are at 7:30 p.m. Sept. 13 and 10 a.m. Sept. 14. Yom Kippur services are at 7 p.m. Sept. 22 and 10 a.m. and 3 p.m. Sept. 23, with Yizkor at approximately 4:30 p.m. and Neilah at about 5 p.m. For more information, contact Rabbi Feinstein at www.rabbiatlanta.com or 770-218-8094.\nCongregation Ner Tamid\nReform Congregation Ner Tamid, 1349 Old Highway 41, Suite 220, Marietta, welcomes nonmembers to High Holidays. Rosh Hashanah services are at 7 p.m. Sept. 13 and 10 a.m. Sept. 14. Yom Kippur services are at 7:30 p.m. Sept. 22 and at 10 a.m. and 2:30 p.m. Sept. 23, with Yizkor at 4 p.m. Tickets, good for all services, are $108; www.mynertamid.info.\nYoung Israel of Toco Hills\nOrthodox Young Israel of Toco Hills offers free seating in its new building at 2056 LaVista Road for the High Holidays, although nonmembers may reserve specific seats for $72 each. Rosh Hashanah services are at 7:25 p.m. Sept. 13, 14 and 15 and 7:15 and 8:30 a.m. Sept. 14 and 15. Tashlich is at 5:45 p.m. Sept. 14; meet at the home of Rabbi Adam Starr, 1682 Rosemont Place. For Yom Kippur, Kol Nidre starts at 7:20 p.m. Sept. 22. Morning services are at 8:30, with Yizkor no earlier than 11 a.m. Mincha is at 5:30 p.m. For more information, visit www.yith.org, or call 404-315-1417.", "external_links": ["http://www.yjpmidtownatlanta.com/", "http://www.bethjacobatlanta.org/yamimnoraim"], "published": "2015-09-11T00:16:00.000+03:00", "crawled": "2015-09-10T19:17:43.408+03:00", "highlightTitle": ""}