{"organizations": [], "uuid": "5f0e10e0bb86e284db29802efb5aded6c50a30f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/overnights/255352-overnight-finance-gop-obama-open-budget-talks", "country": "US", "title": "Overnight Finance: GOP, Obama open budget talks", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Finance: GOP, Obama open budget talks", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T00:13:00.000+03:00", "replies_count": 0, "uuid": "5f0e10e0bb86e284db29802efb5aded6c50a30f8"}, "author": "mmali@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/overnights/255352-overnight-finance-gop-obama-open-budget-talks", "ord_in_thread": 0, "title": "Overnight Finance: GOP, Obama open budget talks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Finance: GOP, Obama open budget talks By Kevin Cirilli - 09/29/15 05:13 PM EDT \nTOMORROW STARTS TONIGHT: From The Hill's Alexander Bolton: \"Senate Majority Leader Mitch McConnell and Speaker John Boehner are opening budget negotiations with President Obama. McConnell (R-Ky.) told reporters Tuesday that he and Boehner (R-Ohio) spoke to Obama last week and expect to sit down more officially with the administration 'soon.' \n\"GOP leaders want to strike a deal on the top-line budget numbers for fiscal 2016 and 2017 so they can avoid a messy standoff and possible government shutdown during an election year. 'We’d like to settle the top line for both years so that next year we could have a regular appropriations process. The president, Speaker Boehner and I spoke about getting started in the discussions last week and I would expect them to start very soon,' McConnell said.\" http://bit.ly/1KQtzcn ADVERTISEMENT EXCLUSIVE: HOW ELIZABETH WARREN FORCED OUT A BROOKINGS ECONOMIST. My scoop for the hometown paper on a bitter battle in wonk world about the fiduciary fight: The left-leaning Brookings Institution is forcing one of its top economists to resign, amid questions from Sen. Elizabeth Warren (D-Mass.) about an economic study funded by the business community. Robert Litan, Brookings’ nonresident senior economics fellow, will formally submit his resignation Tuesday afternoon, according to three sources familiar with the issue.\n1.) WARREN STRIKES FIRST: Warren sent a letter to Brookings earlier Tuesday suggesting that Litan used his Brookings affiliation to peddle an industry-backed study that's critical of the administration's proposed regulations for financial advisers. Industry groups, congressional Republicans and roughly 100 congressional Democrats oppose the so-called fiduciary rule, which is championed by Warren and President Obama. \"I am concerned about financial conflicts of interest in a recent study authored by [Litan],\" Warren wrote in the letter to Brookings President Strobe Talbott. \n2.) THE POLICY BEHIND WARREN'S POLITICKING: Democratic support is deteriorating for Warren and President Obama's backing of new retirement regulations for the financial advice industry. The business community has convinced half of the Democratic caucus and all Republicans that the regulatory pitch, which failed in 2010, would raise costs for financial advice to low- and moderate-income Americans. Warren, Obama and Department of Labor officials argue that the policy is needed to better protect consumers. \n3.) REACTION FROM WARREN CRITICS ... First up, Rep. Ann Wagner (R-Mo.) tells me: \"Discussion and disagreement are hallmarks of a healthy democracy and functioning government. It is unconscionable that elected officials like Senator Warren would have someone fired in an attempt to shut down that discussion. The facts are clear: Her rule hurts middle- and lower-income Americans and faces bipartisan opposition in the United States House of Representatives.\" ... Senior financial services source who opposes rule: \"Senator Warren has chosen not to combat the facts and this sets a terrible precedent. The message is clear: If you are an academic who challenges data supporting her ideas, you stand to put your job at risk.” My story: http://bit.ly/1QJSqC3 \nLet's drink... \nSHOT, via a second senior industry source: \"I thought as a former professor she would embrace academic freedom, rather than attack people she disagrees with and get them fired. Disgraceful.\" \nCHASER, via Bart Naylor at Public Citizen via Twitter: Litan can no longer claim to be a Brookings brother. Shilling for Wall Street under its name not tolerated. \nTHIS IS OVERNIGHT FINANCE, where we are holed up in Rayburn about to moderate a panel on financial services with the American Action Forum. Thank you, Doug Holtz-Eakin, for having me. I hear Doug is a huge fan of Twizzlers. Tweet: @kevcirilli ; email: kcirilli@thehill.com ; and subscribe: http://thehill.com/signup/48 . \nPAPAL APOLOGY AND GRATITUDE: Thank you to the indefatigable all-star Pete Schroeder for once again filling in form me as I recovered again from strep throat. I'd also like to thank capitalism, Pope Francis, for helping spur the antibiotic industry, which has helped me recover. \nCLINTON ON OFFENSE: I'M NOT A BANK BASHER. My recap for The Hill: Democratic presidential candidate Hillary Clinton defended her decision to not be a \"stem winder\" in calling to break up big banks, a clear reference to her 2016 challenger Sen. Bernie Sanders (I-Vt.). \nClinton told actress Lena Dunham in an interview posted Tuesday that she \"took on Wall Street\" during her time as a New York senator, but she said bipartisan support is needed to regulate the industry. \n-- WHAT CLINTON SAID: \"I may not always be the stem winder about these things, because I think it's important and I've been around Washington long enough to know that you have to get people to agree if you want to get something done... You know, some people say, 'All we have to do it break up the banks.' ... The problem with that is that the banks did their fair share of trouble, but a lot of problems were not from these traditional banks, they were from what’s called the shadow-banking world like Lehman Brothers, which went belly up and brought a lot of people down with them; or AIG, a gigantic insurance company.\" She said she tired to \"sound the alarm\" on some of the \"bad transactions with these impossible-to-describe things called derivatives and credit default swaps that we found out later contributed to the recession.\" http://bit.ly/1VlB70R \nOVERNIGHT MUSINGS: Lena Dunham got Clinton to talk about swaps and derivatives... Touche, Dunham. Touche. \nMAN WITH A PLAN: TRUMP'S TAX PLAN ALL THE CHATTER. Bernie Becker for The Hill: GOP presidential front-runner Donald Trump's tax plan would cost just under $12 trillion over a decade, according to an analysis from a conservative-leaning group. The Tax Foundation found that Trump's proposal would lose around $10.1 trillion when accounting for the potential economic growth that would be spurred by the tax changes. The $12 trillion figure comes from more traditional scoring methods, akin to those employed by official federal scorekeepers. \nTrump himself has said that the plan — which slashes the top tax rates for both individuals and all kinds of businesses — won't add to the deficit. But after the billionaire businessman released his plan, tax analysts were quick to question that claim and said that the top 1 percent of earners would be most likely to gain under Trump's proposals. Trump had said for weeks that his plan would go after Wall Street types who paid little to nothing in taxes. Becker's full report: http://bit.ly/1RedbGN \nMARTIAL LAW: BOEHNER SLAMS GAVEL OVER BUDGET BATTLE. Cristina Marcos: For the second time in a month, the House on Tuesday invoked \"martial law\" to allow more expeditious consideration of a stopgap spending bill to avoid a government shutdown this week. \nThe use of martial law refers to bypassing typical procedure that requires the House to wait a day after the Rules Committee produces a rule establishing floor debate parameters before voting on it. Instead, the House can now vote on the procedural measure on the same day. http://bit.ly/1MEvt2o \nPUERTO RICO WATCH, via Schroeder: GOP lawmakers told Puerto Rican officials they will need to do more if they hope Congress will help the U.S. territory navigate through its fiscal crisis. Members of the Senate Finance Committee heard urgent pleas from Puerto Rican officials who said Congress needs to act immediately. http://bit.ly/1h8dHcC \nLATEST FROM THE CFPB HEARING... DS News on today's House Financial Services Committee hearing: \"Consumer Financial Protection Bureau (CFPB) Director Richard Cordray once again sat before the House Financial Services Committee on Tuesday for the CFPB's semi-annual report to Congress on Tuesday and touted the Bureau's efforts to protect consumers in its four years of existence while taking questions from Committee members on such topics as mortgages, auto lending, payday lending, and the TRID rule.\" http://bit.ly/1LZWSsL", "external_links": [], "published": "2015-09-30T00:13:00.000+03:00", "crawled": "2015-09-30T09:42:42.732+03:00", "highlightTitle": ""}