{"organizations": [], "uuid": "2263d1520b1dc6eb763fbcf37c118a7cec4460e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/HqEaNRCXaNwSvuAoxWp_Yw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/rtx1hq74-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-skynews/?format=rss", "section_title": "Finance News | Sky News - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/firm-launches-volkswagen-emissions-lawsuit-084506622.html", "country": "GB", "title": "Firm Launches Volkswagen Emissions Lawsuit", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Firm Launches Volkswagen Emissions Lawsuit", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T12:40:00.000+03:00", "replies_count": 0, "uuid": "2263d1520b1dc6eb763fbcf37c118a7cec4460e2"}, "author": "", "url": "https://uk.finance.yahoo.com/news/firm-launches-volkswagen-emissions-lawsuit-084506622.html", "ord_in_thread": 0, "title": "Firm Launches Volkswagen Emissions Lawsuit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Sep 23, 2015, 11:54 BST - UK Markets close in 4 hrs 36 mins Firm Launches Volkswagen Emissions Lawsuit By (c) Sky News 2015 | Sky News – 1 hour 13 minutes ago View Photo \n\nVolkswagen (Other OTC: VLKAF - news ) is being sued in the US over the \"defeat devices\" used to fool emissions tests on diesel cars. \nRobert Clifford, partner at Chicago's Clifford Law, said the impact was \"massive\" and that car buyers had not got what they paid for. \nHe said people were also affected because of \"diminution of value\" - meaning their car could now be worth less. \nMr Clifford claimed VW owners could have problems keeping their car on the road as officials might refuse to issue number plates and permits. \nThe class action law suit is on behalf of two people who say they would not have bought they cars has they known they were not environmentally friendly. \nVolkswagen admits the software - which takes effect during exhaust tests - may be in some 11 million vehicles worldwide. \nThe \"defeat devices\" meant true emission levels, as much as 40 times the level legally allowed in the US, were hidden. \nIt (Other OTC: ITGL - news ) now faces a criminal investigation in the US and further probes in countries including Germany, France and South Korea. \nThe German company's boss, Martin Winterkorn, is under increasing pressure ahead of emergency talks. \nHe will meet members of the firm's board later after the scandal wiped out a third of the company's value in just a few days. \nNew York Attorney General Eric Schneiderman has also confirmed an investigation. \n\"No company should be allowed to evade our environmental laws or promise consumers a fake bill of goods,\" said Mr Schneiderman \nVolkswagen's boss has apologised, but has given no undertaking to resign. \n\"I am endlessly sorry that we have disappointed this trust,\" said Mr Winterkorn in a video message. \n\"I apologise in every way to our customers, to authorities and the whole public for the wrongdoing. \n\"We are asking, I am asking for your trust on our way forward. We will clear this up.\" \nBut Mr Winterkorn has reportedly lost the confidence of shareholders after stocks fell a further 20% on Tuesday. \nIt is now understood he will appear before a select group of board members on Wednesday afternoon. \nThe company has set aside €6.5bn (£4.7bn) to cover the scandal and has warned the bill could rise. \nAt least 482,000 cars will be recalled and VW could face penalties of more than $18bn in the US alone. \nThere are fears cars in th UK could also be recalled and that investigators might find similar devices were used by other firms - including in petrol cars (Other OTC: UBGXF - news ) .", "external_links": [], "published": "2015-09-23T12:40:00.000+03:00", "crawled": "2015-09-23T13:58:12.638+03:00", "highlightTitle": ""}