{"organizations": [], "uuid": "400362d65b5e6e2af4cd56ac1fa90c321f0365a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/press-and-guide/rss/627", "section_title": "Press and Guide : Personal Finance", "url": "http://business-news.thestreet.com/press-and-guide/story/stocks-near-correction-again-after-another-turbulent-week/13278551", "country": "US", "title": "Stocks Near Correction Again After Another Turbulent Week", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Stocks Near Correction Again After Another Turbulent Week", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T23:05:00.000+03:00", "replies_count": 0, "uuid": "400362d65b5e6e2af4cd56ac1fa90c321f0365a3"}, "author": "", "url": "http://business-news.thestreet.com/press-and-guide/story/stocks-near-correction-again-after-another-turbulent-week/13278551", "ord_in_thread": 0, "title": "Stocks Near Correction Again After Another Turbulent Week", "locations": ["TheStreet", "NEW YORK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Keris Alison Lahiff"], "text": "Stocks Near Correction Again After Another Turbulent Week Written by: Keris Alison Lahiff 09/04/15 - 4:05 PM EDT NEW YORK ( TheStreet ) -- It's been two full weeks of big swings as volatility showed no signs of letting up on Friday. \nThe S&P 500 lost 1.5%, having fallen 9.7% from a May record and hovering on the brink of the 10% decline indicating a correction. The Dow Jones Industrial Average fell 1.6% while the Nasdaq slipped 1.1%. The Volatility Index, otherwise known as the \"fear index,\" spiked 6.2% to 27.20. \nInvestors had better buckle-up because the wild ride could continue next week when China's unpredictable markets reopen on Monday after a two-day holiday. The Shanghai Composite has been closed since Thursday to commemorate the end of World War II. \n\"The market narrative has actually moved past the (Federal Reserve),\" Brad McMillan, chief investment officer at Commonwealth Financial Network, said in a phone interview. \"The market is more worried about international factors.\" More Headlines Stocks Recover to Post Slight Gains Ahead of Jobs Report \nWall Street has taken its cue from China over the past month as the country faces weakening growth, a slowdown in manufacturing and fears that its central bank will be unable to stanch steep declines in equity values. \n\"It's very unusual that the whole world, including the U.S., can hiccup based on results in one other country,\" McMillan added. \"The real risk comes from China, and I think that's going to be the determining narrative over the next couple of months.\" \nFriday was very much dominated by Fed rate-hike talk after a mixed jobs report did little to point the odds in any one direction. On the one hand, data showed the U.S. added far fewer jobs than expected in August. On the other, hourly wages rose, and the unemployment rate dropped. \nThe U.S. added 173,000 jobs in August, according to the Labor Department, far below economists' estimates of an increase of 223,000. U.S. hourly wages rose 0.3% month on month, above expectations of 0.2% growth. The unemployment rate fell to 5.1%, its lowest level since 2008 and a faster drop than the forecast of 5.2% unemployment predicted. \n\"If one was inclined to believe the Fed would not hike in September, the headline miss works in your favor,\" Dan Greenhaus, chief strategist at BTIG Research, wrote in a note. \"If one felt the opposite, the drop in the unemployment rate along with a rebound in earnings works in your favor,\" he added. \nAugust is a historically hard-to-read month, which could also explain the missed forecast. Over the past decade, August was the month with the lowest first estimate which was then revised in the following two months, according to Reuters analysis. Since 2005, the government has added an average 58,000 more jobs to payrolls in August than initially reported. \nOn Friday, Jeffrey Lacker, president of the Federal Reserve Bank of Richmond, made the case for higher interest rates. Lacker noted that higher interest rates are needed as business investment and housing rebounds and the labor market tightens. 1", "external_links": [], "published": "2015-09-04T23:05:00.000+03:00", "crawled": "2015-09-04T23:50:28.886+03:00", "highlightTitle": ""}