{"organizations": [], "uuid": "83efa5fe1f26d084676ed55db20d4b63136e908c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/keD7HBkK8ZugIMRKBQfbLw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/metro-bank-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/challenger-banks-call-funding-scheme-103301355.html", "country": "GB", "title": "Challenger Banks Call For New Funding Scheme", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Challenger Banks Call For New Funding Scheme", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T13:33:00.000+03:00", "replies_count": 0, "uuid": "83efa5fe1f26d084676ed55db20d4b63136e908c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/challenger-banks-call-funding-scheme-103301355.html", "ord_in_thread": 0, "title": "Challenger Banks Call For New Funding Scheme", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 11, 2015, 11:40 BST - UK Markets close in 4 hrs 50 mins Challenger Banks Call For New Funding Scheme By (c) Sky News 2015 | Sky News – 7 minutes ago View Photo \n\nChallenger (Hamburg: 4SE.HM - news ) banks have called for an extension to the Government's flagship industry funding scheme during a meeting at which they expressed fury at plans for a tax surcharge that will hit their profits. \nSky News has learnt that a group of bank bosses who met with senior Treasury officials on Friday requested that the Funding for Lending Scheme (FLS) be extended beyond its intended expiry date next January. \nA source who attended the meeting said the banks had urged that any extension of the FLS, which was launched by George Osborne in 2012, should be reserved for lenders with balance sheets of less than £20bn and which were expanding their net lending to small businesses. \nThe proposal, which the Treasury said it would consider, according to the source, was made during a sometimes-fractious summit attended by roughly ten bank executives. \nAmong the so-called challengers represented at the meeting were Aldermore, Close Brothers (LSE: CBG.L - news ) , Metro Bank, OneSavings Bank (Stuttgart: 2OS.SG - news ) , Paragon Bank, Secure Trust Bank, Shawbrook and Tesco Bank. \nThey had sought discussions with the Treasury following the Chancellor's announcement in his July Budget that banks would be subject to an 8% Corporation Tax surcharge on profits of more than £25m. \nThe insider who attended the meeting said the Treasury was resistant to the idea of a blanket increase in the £25m threshold, but appeared more receptive to a proposal for 'staircasing' the impact of the tax depending upon the size of banks' balance sheets. \nThe banks also suggested that a working group should be formed to discuss ways in which the tax surcharge could be mitigated. \n\"They seemed to say that they would listen to ideas that would mean the revenue-take would be the same, but without committing to a working group,\" said the source. \nBanks also raised a long-held complaint that they are subject to an unlevel playing field which penalises their lending by forcing them to hold more capital by comparison with larger banks. \nThe Treasury declined to comment on the meeting other than to say it was routine for Government officials to meet with industry to discuss a range of issues. \nEarlier this week, Sky News revealed that EY, the professional services firm, had undertaken research which showed that Mr Osborne's industry tax reforms would raise far more revenue than forecast by the independent Office for Budget Responsibility. \nEY's work concluded that while the total tax take from challenger banks will remain a small proportion of the overall tax take from the sector, £5.95bn in tax revenue could be achieved from just 10 of the other lenders. \nA letter from some of the challenger banks to MPs representing constituencies where they employ substantial numbers of people had warned that future job creation could be jeopardised by the move. \nMr Osborne told the industry in a recent letter that there would be no change to the surcharge \"in this fiscal year\", a statement which has sparked hope among some bank executives that the Government will reduce or abolish it next year.", "external_links": [], "published": "2015-09-11T13:33:00.000+03:00", "crawled": "2015-09-11T13:41:13.652+03:00", "highlightTitle": ""}