{"organizations": [], "uuid": "274b5fc0e7419fb691c410165fb986efdf600315", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/30/markets-metals-idUSL3N1203WI20150930", "country": "US", "title": "METALS-Copper hits one-week high as investors close positions", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "METALS-Copper hits one-week high as investors close positions | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T15:40:00.000+03:00", "replies_count": 0, "uuid": "274b5fc0e7419fb691c410165fb986efdf600315"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/30/markets-metals-idUSL3N1203WI20150930", "ord_in_thread": 0, "title": "METALS-Copper hits one-week high as investors close positions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* New Chinese car incentives to push up copper use -Argonaut\n* Chinese markets shut for a week for holidays\n* Coming up: U.S. ADP national employment at 1215 GMT (Adds details, Quote: s; previous MELBOURNE)\nBy Eric Onstad\nLONDON, Sept 30 (Reuters) - Copper hit the highest in a week on Wednesday while nickel touched a two-week peak as bearish investors closed out positions at the quarter-end and ahead of Chinese holidays.\nThe market also got a boost from a bounce in the shares of hard-hit commodity group Glencore and from news about planned declines in production and inventories that may tighten the copper market.\n\"We got month-end today and quarter-end as well, so there's some tidying up of positions with shorts taking profits,\" said Robin Bhar, head of metals research at Societe Generale in London.\n\"We also saw some stability in Glencore's share price, that's probably helped the underlying commodities, copper in particular.\"\nThree-month copper on the London Metal Exchange had jumped 2.4 percent to $5,088.50 a tonne by 1108 GMT after closing little changed in the previous session when it fell to its weakest in a month at $4,915.50.\nCopper is on track for a loss of over 6 percent in the third quarter, the biggest quarterly loss in over two years.\nShanghai Futures Exchange copper climbed 1.8 percent to 38,600 yuan ($6,074) a tonne.\nChile's second-biggest copper mine Collahuasi, owned by Anglo American Plc and Glencore, said on Tuesday it plans to cut output by 30,000 tonnes.\n\"Although individually this cut (in Chile) isn't meaningful, we're starting to see a few - maybe it's a reflection of financial stress in general in the big mining companies,\" said analyst Daniel Morgan of UBS in Sydney.\nThe global copper market is seen in a small 262,500 tonne surplus this year, according to median forecasts of analysts polled by Reuters in July.\nPrices also got support from data showing nearly 30,000 tonnes of fresh cancellations of LME copper inventories MCUSTX-TOTAL, when holders of stored metal give notice they are ready to remove the material from warehouses.\n\"The markets are perhaps eyeing that as a precursor to a pick up in demand as we go into Q4,\" Bhar said, who added that he was still advising clients to sell on rallies in copper due to concerns over a slowdown in China.\nMeanwhile, China has decided to halve sales tax on small cars from Thursday, boosting local auto shares, as the government tries to revive growth in the world's largest car market, which fuelled a recovery in Asia's stock markets.\n\"The policy ... is expected to trigger car production recovery, which in turn will support demand for copper and steel,\" Argonaut Securities said in a note.\nIn other metals, nickel was the biggest gainer, surging 3.2 percent to a two-week high of $10,195 a tonne, while aluminium added 0.8 percent to $1,576.50 a tonne.\nPRICES\nThree month LME copper\nMost active ShFE copper\nThree month LME aluminium\nMost active ShFE aluminium\nThree month LME zinc\nMost active ShFE zinc\nThree month LME lead\nMost active ShFE lead\nThree month LME nickel\nMost active ShFE nickel\nThree month LME tin\nMost active ShFE tin\n($1 = 6.3546 Chinese yuan) (Additional reporting by Melanie Burton in Melbourne; Editing by Elaine Hardcastle)", "external_links": [], "published": "2015-09-30T15:40:00.000+03:00", "crawled": "2015-09-30T14:55:43.139+03:00", "highlightTitle": ""}