{"organizations": [], "uuid": "5023abc738703770b97e9485a7677a467b5254e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2014/06/BSE-SEnsex-Re-2-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/indian-markets/bse-sensex-nse-nifty-stock-market-today-markets-post-rbi-rate-cut-september-30-2015/143702", "country": "IE", "title": "Live: Sensex rises over 200 points on firm global cues, Nifty above 7,900; Maruti Suzuki hits new high", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Live: Sensex rises over 200 points on firm global cues, Nifty above 7,900; Maruti Suzuki hits new high | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T17:20:00.000+03:00", "replies_count": 0, "uuid": "5023abc738703770b97e9485a7677a467b5254e7"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/indian-markets/bse-sensex-nse-nifty-stock-market-today-markets-post-rbi-rate-cut-september-30-2015/143702", "ord_in_thread": 0, "title": "Live: Sensex rises over 200 points on firm global cues, Nifty above 7,900; Maruti Suzuki hits new high", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles IGL, Gujarat Gas shares gain after govt reduces natural gas price by 18% How FIIs reacted to Reserve Bank of India's rate cut of 50 bps Realty, Housing Finance shares continue to cheer RBI rate cut 1.22 pm: Godrej Properties shares were trading 7.06 per cent up at Rs 327.50 apiece. Godrej Properties on Wednesday informed bourses that it has sold 435,000 sq. ft. of saleable area at its commercial project in Mumbai’s Bandra-Kurla Complex (BKC). The BSE Realty index was up 1.64 per cent at 1,391.05.\n1.15 pm: Share price of city gas companies Indraprastha Gas Ltd (IGL) and Gujarat Gas moved northward in the afternoon trade following reports that the price of natural gas from domestic fields would drop by 18 per cent to $4.24/mBtu from October 1. Till now, the price is $5.18/mBtu. The BSE Oil & Gas index was up 1 per cent at 8621.92. Sensex was up 267 points at 26,046.\n12.42 pm: Foreign Portfolio Investors(FPIs) continue to offload their holdings in Indian equities. On Tuesday FPIs sold equities worth more than $180 million, stock exchanges data showed. The total outflow of foreign funds since August has reached $3.5 billion mark already. The domestic institutions are providing some respite to Indian markets amid FPI sell-off. The Domestic Institutional Investors –comprising of banks,insurance companies and mutual funds — bought shares worth Rs 876.20 crore on Tuesday , provisional data in the stock exchanges showed. Sensex was up 236 points at 26,015. Nifty was up 66.10 points at 7,909.\n11.50 am: Maruti Suzuki shares on NSE hit a new high Rs 4,763.45 intra-day on Wednesday. The BSE Auto index was up 0.65 per cent at 17,255. Sensex was up 195 points at 25,974. Nifty was up 50 points at 7,893.20.\n11.40 am: Shares of housing finance companies were also trading in green in the morning trade. The share price of LIC Housing Finance, Dewan Housing Finance and Gruh Finance jumped 3.10 per cent, 1.37 per cent and 0.97 per cent to Rs 464.45, Rs 218 and Rs 269.85, respectively. Sensex was up 238 points at 26,017.\n10.58 am: Majority of auto shares were trading in the green on Wednesday as the BSE Auto index went up by 0.5 per cent. Shares of Tata motors and Ashok Leyland went up by 2.13 per cent and 0.99 per cent, respectively. The fall in global commodity prices have helped the auto makers to improve their margins as steel is the key raw material used by the sector, experts said. London-based investment banking firm HSBC said in a note to investors that the near term scenario for auto companies looks positive despite lacklustre two-wheeler and four-wheeler industry trends. Sensex was up 206 points, or 0.80 per cent, at 25,985.\n10.20 am: The rupee rose by 19 paise at 65.77 against the US dollar in early trade on Wednesay at the Interbank Foreign Exchange after the Reserve Bank cut interest rates by 0.50 per cent yesterday.\n10.17 am: After surging over 10 per cent on Tuesday, shares of Lanco Infratech jumped over 8 per cent in the morning trade on Wednesday. In a BSE filing on September 29, Lanco Infratech said, “The company has been communicating to the stock exchange and also to the shareholders/ general public that the company is keen in selling its stake in some assets of the company which is as per the CDR package and subsequent JLF approvals, to reduce the debt burden and to bring liquidity into the company.” Company has already sold 2 of its assets namely Udupi Power Corporation Ltd (1200 MW Thermal Power Project) and Lanco Budhil Hydro Power Private Ltd (70 MW Hydro Power Project), which reduced the consolidated debt of the company.\n9.50 am: Shares of Eveready Industries India gained as much as 6.99 per cent in the early trade on Wednesday after the Reserve Bank of India on Tuesday allowed foreign investors to invest up to 49 per cent stake in the company under the Portfolio Investment Scheme.\n9.30 am: Bank of India has decided to change its Base Rate to 9.70 per cent from the present level of 9.95 per cent effective from October 5, 2015. Shares of Bank of India were trading 0.69 per cent up at Rs 138.80 apiece in the early trade. The BSE Bankex was up 0.45 per cent at 19,858. Sensex was up 233 points at 26,012.\nBank of India has reported a 84% decline in net profit at Rs 129.72 crore in the April-June quarter of the current fiscal. The bank had a net profit of Rs 805.69 crore in the first quarter of 2014-15 fiscal. Provisioning during the first quarter rose to Rs 1,515 crore, from Rs 893 crore in the same period last fiscal. The gross Non-Performing Assets (NPAs) as a percentage of total loans spiked to 6.80% during the June quarter, from 3.28% in the year-ago period.\n9.22 am: Sensex was up 211.27 points at 25989. Tata Steel and Hindalco were up over 2.88 per cent and 2.71 per cent at Rs 207.15 and Rs 70, respectively.\n9.17 am:\nSource: BSE\nThe BSE Sensex and NSE Nifty opened on a positive note on Wednesday following firm global cues amid a rate cut of 50 bps by the Reserve Bank of India in its monetary policy review on Tuesday. Sensex opened 207.86 points up at 25,986.52. Nifty opened 80.95 points up at 7,924.25. Metal stocks were trading higher in the opening trade.\nTraders also got some support with a report that India has become the top destination for FDI in the world. With $31 billion of foreign capital inflows, India has surpassed China and the US to take the pole position in attracting largest FDI in the first half of 2015.\nAsian stocks took an early positive lead from Wall Street, which ended slightly higher overnight as the US bourses took a breather, with the latest round of China fears that gripped global markets petering out for the moment. Investors also felt relief as shares of mining and trading giant Glencore gained more than 10 per cent overnight.\nHang Seng, Nikkei and Shanghai were up 0.94 per cent, 1.84 per cent and 0.38 per cent at 20749.60, 17243.21 and 3049.68, respectively.\nDow Jones Industrial Average gained 0.30 per cent at 16049.13 on Tuesday.\n(With inputs from agencies)\n 30, 2015 9:20 am © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-09-30T17:20:00.000+03:00", "crawled": "2015-09-30T11:19:21.013+03:00", "highlightTitle": ""}