{"organizations": [], "uuid": "03117dbbb37471990a5b5e6de57b34e397eeb027", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/images/print-edition/20150905_WBP005_0.jpg", "site_section": "http://www.economist.com/sections/business-finance/rss.xml", "section_title": "Business and finance", "url": "http://www.economist.com/news/business/21663221-rapidly-rising-super-cheap-irish-clothes-retailer-prepares-conquer-america-rivals-should?fsrc=rss", "country": "US", "title": "Faster, cheaper fashion", "performance_score": 0, "site": "economist.com", "participants_count": 1, "title_full": "Faster, cheaper fashion", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T17:52:00.000+03:00", "replies_count": 0, "uuid": "03117dbbb37471990a5b5e6de57b34e397eeb027"}, "author": "The Economist online", "url": "http://www.economist.com/news/business/21663221-rapidly-rising-super-cheap-irish-clothes-retailer-prepares-conquer-america-rivals-should?fsrc=rss", "ord_in_thread": 0, "title": "Faster, cheaper fashion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "United States \nNow the retailer is plotting its boldest invasion. On September 10th it will open its first shop in America, the world’s biggest clothing market. Boston will be first to get a Primark, to be followed shortly by seven other sites in the north-east. \nTriumph is not guaranteed. Primark may be the most successful brand Americans have never heard of, and changing that will take time. Nevertheless, ABF, which also sells sugar, tea and Ovaltine, has reason to be optimistic. For many shoppers, Primark has an irresistible offer: trendy clothes at astonishingly low prices. The result is a new and even faster kind of fast fashion, which encourages consumers to buy heaps of items, discard them after a few wears and then come back for another batch of new outfits. \nPrimark’s rise comes at a tricky moment for some mainstream clothes firms, or “specialty-apparel” companies, as analysts call them. Famous American brands such as J.Crew and Abercrombie & Fitch have struggled. Gap, once the world’s leading specialty-apparel company, has had a particularly rough patch. With its bland styles and frequent sales promotions, the company’s Gap-branded chain has suffered an 8% fall in sales over the past decade, reckons Euromonitor, a data firm, even as the overall market has grown strongly. In June Gap said it would close one-quarter of its shops in North America. \nAs some clothing chains have suffered, the world’s four largest brands have cemented their lead by pursuing different strategies. Two American retailers, T.J. Maxx and Ross, sell discounted items bearing designer labels, usually from previous seasons. Two European retailers, H&M and Zara, sell own-label clothes in the latest styles, constantly updating their ranges. Zara remains the leading innovator in fast fashion, introducing more than 18,000 designs each year and producing them within an average of three weeks. \nGap is trying to catch up. Its lower-price Old Navy chain, led by a veteran of H&M, is relatively nimble. For example, Old Navy chooses the same fabric for several styles of garment, monitors which styles sell best, then adjusts production accordingly. Art Peck, Gap’s chief executive, is now using Old Navy’s strategy as a template for the group’s Gap and Banana Republic chains. Results will begin to appear next year. \nBy then Primark will be a more serious threat—and not just to Gap. Maureen Hinton of Conlumino, a retail consultant, argues that Primark has a winning combination: cool clothes, attractive stores and, most important, rock-bottom prices. In Britain, the average selling price of women’s clothes at H&M was £10.69 ($16.37) for the year to May 10th, according to Sanford C. Bernstein, a research firm. At Primark, the average selling price was £3.87. For Asos, a young and hitherto vigorous online fashion retailer, such bargains are hard to match. The need to keep cutting prices and stay competitive has forced Asos to issue a series of profit warnings. And on September 2nd the British firm’s founder and chief executive, Nick Robertson, resigned. \nJohn Bason, ABF’s finance director, says Primark achieves its low prices thanks to sleek logistics, a meagre marketing budget and its scale, which helps win bargains from suppliers. The company withstands tiny margins, making its money on volume. It has bet successfully that demand for clothes is as elastic as the waistband in a pair of plus-size sweatpants: the cheaper they are, the more shoppers buy of them. It is also benefiting from the “Instagram effect”, in which fashion-conscious young consumers post snaps of themselves wearing another new outfit on social media. \n“Consumers shop at Primark differently than they shop at a lot of retailers,” says Bernstein’s Jamie Merriman. “It’s almost like shopping at a Costco,”—which sells buckets of peanuts and vats of detergent—“where you’re thinking about it in terms of volume.” H&M sells an annual average of £3,400-worth of clothes per square metre in Britain, according to Bernstein. Primark sells £5,300-worth. \nThere are a few threats to this model. Primark may find, as Tesco has recently done, that breaking into America is no walkover for foreign retailers. Two markets that appear so similar may prove to have unexpected differences. Indeed, Target, a once-soaring American retailer of clothes and other goods, has recently had to retreat from Canada on discovering that its formula just didn’t fly north of the border. \nThen again, Primark’s ultra-cheap prices could prove as tempting in the United States as they are elsewhere. The same young Americans who have flocked to Forever 21, another seller of affordable, trendy gear, may now come rushing to Primark. An early sampling of Primark’s American product line-up showed that goods were 22% cheaper than similar fare at Forever 21. \nAnother possible problem is Primark’s online business, or lack of it. Its prices are too low to justify the shipping costs of e-commerce. If consumers in America and elsewhere switch in large numbers to buying clothes through, say, social networks and messaging services, Primark might get left behind. \nOther concerns pose a challenge not just to Primark but to its peers too. A culture of disposable fashion rattles environmentalists. Americans threw away 11.1m tonnes of clothes and shoes in 2013. That amounts to 4.4% of the country’s rubbish, more than twice the share in 1990. Just as worrying are the conditions in which cheap clothes are made. In 2013 more than 1,100 people were crushed when a factory complex collapsed in Bangladesh. The victims included workers stitching clothes for Primark. The company has paid $14m to victims’ families. It is one of many firms to have signed an agreement to promote safety at textile factories. \nThe sad truth, however, is that most consumers soon forgot about the tragedy. In 2014, the year after the factory collapse, Primark’s sales jumped by more than 20%. It will take some stopping.", "external_links": [], "published": "2015-09-03T17:52:00.000+03:00", "crawled": "2015-09-04T09:49:12.678+03:00", "highlightTitle": ""}