{"organizations": [], "uuid": "5d3667920805ed668cdf0372aa48ad9d720378e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/f/3/7/r/image.related.articleLeadwide.620x349.gjf2sf.png/1441351977972.png", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/15/materials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/world-business/taubmans-record-700m-trove-at-sothebys-tests-art-market-20150904-gjf2sf.html", "country": "AU", "title": "Taubman's record $700m trove at Sotheby's tests art market", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Taubman's record $700m trove at Sotheby's tests art market", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "5d3667920805ed668cdf0372aa48ad9d720378e0"}, "author": "Katya Kazakina", "url": "http://www.smh.com.au/business/world-business/taubmans-record-700m-trove-at-sothebys-tests-art-market-20150904-gjf2sf.html", "ord_in_thread": 0, "title": "Taubman's record $700m trove at Sotheby's tests art market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A. Alfred Taubman started his business with a $US5000 loan in 1950, buying auction house Sotheby's 33 years later. Photo: Sotheby's\nA. Alfred Taubman, who died in April at 91, was best known as the billionaire chairman of Sotheby's who transformed the genteel auctioneer into an international powerhouse and went to prison after being convicted of fixing prices with rival Christie's.\nLess is known about Taubman, the collector. That's about to change.\nSotheby's on Thursday said it will offer more than 500 works amassed by Taubman over more than 50 years, ranging from antiquities to contemporary art, in four stand-alone auctions, starting on November 4. The group is valued at more than $US500 million ($713 million), the highest estimate ever for a private collection at auction, according to the auction house.\nAmedeo Modigliani's \"Portrait of Paulette Jourdain\", which has been estimated at up to $US35 million. Photo: Sotheby's\n\"He was a self-made man and his collection was put together with his own eye,\" said Simon Shaw, co-head of Sotheby's Impressionist and modern art department worldwide. \"While he is a very well-known figure, he is not known as a collector. It will be a surprise for people.\"\nAdvertisement The first sale, \"Masterworks,\" will launch two weeks of semi-annual November auctions in New York. The Impressionist, modern, postwar and contemporary sales at Sotheby's, Christie's and Phillips will be the biggest test of the art market following the turmoil in the financial markets.\nPicasso, de Kooning Willem de Kooning's \"Untitled XXI,\" also estimated at between $US25 million and $US35 million. Photo: Sotheby's\nThe \"Masterworks\" evening sale will have about 70 lots, include three paintings estimated at $US25 million to $US35 million: Pablo Picasso's 1938 \"Femme Assise sur une Chaise,\" Willem de Kooning's 1976 \"Untitled XXI\" and Amedeo Modigliani's 1919 \"Portrait de Paulette Jourdain.\"\nTwo paintings by Mark Rothko-- 1952's \"Untitled (Lavender and Green)\" and 1962's \"No. 6 / Sienna, Orange on Wine\" -- are estimated at $US20 million to $US30 million each.\nMartin Johnson Heade's fiery canvas \"The Great Florida Sunset\" will be the highlight of Sotheby's special American Art sale from the collection on November 18. The 1887 painting is estimated at $US7 million to $US10 million.\nTaubman started Taubman Co. with a $US5000 loan in 1950 and began collecting art soon thereafter, buying through dealers such as Leo Castelli and Betty Parsons and at auctions, Sotheby's said. Taubman Centers, a real estate investment trust, began trading on the New York Stock Exchange in 1992.\nTaubman's company built and operated more than 25 US malls, including the Mall at Short Hills in New Jersey and the Beverly Center in Los Angeles.\nMaintaining innocence Forbes Magazine ranked Taubman No. 577 on its 2015 list of the world's billionaires, with an estimated net worth of $US3.1 billion.\nTaubman purchased Sotheby's in 1983. After taking the company public in London in 1987 and in New York the next year, he became Sotheby's chairman, placing friends and aristocrats on its board.\nIn 2001, a jury in Manhattan federal court found Taubman guilty of collaborating with Christie's to fix fees, violating antitrust laws and cheating customers out of about $US100 million. He spent 10 months in prison and resigned as chairman of Sotheby's and Taubman Centers.\nTaubman always maintained he broke no laws and took an unfair fall.\n\"I had served time for others, people going about their lives in New York and London who had initiated, executed and lied about a serious crime for which they would receive little or no punishment,\" he wrote in a 2007 memoir.\nTaubman gave $US250 million to causes including the arts, education and medicine. Proceeds from Sotheby's sales will be used to settle estate tax obligations and fund the A. Alfred Taubman Foundation, Sotheby's said.\nBloomberg", "external_links": [], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-04T11:22:35.119+03:00", "highlightTitle": ""}