{"organizations": [], "uuid": "abd0ee17b86fe80bbc5b78fc060e3516f3d2146b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/misselling004915.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/fsdc-sub-committee-report-on-mis-selling-of-financial-products-invites-comments/43302.html", "country": "IN", "title": "FSDC sub-committee report on mis-selling of financial products invites comments", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "FSDC sub-committee report on mis-selling of financial products invites comments", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T13:41:00.000+03:00", "replies_count": 0, "uuid": "abd0ee17b86fe80bbc5b78fc060e3516f3d2146b"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/fsdc-sub-committee-report-on-mis-selling-of-financial-products-invites-comments/43302.html", "ord_in_thread": 0, "title": "FSDC sub-committee report on mis-selling of financial products invites comments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The government will take a view of the recommendations after public consultation. FSDC report has cited Moneylife Foundation report on mis-selling by banks A committee under the Financial Stability and Development Council (FSDC) was formed to study the prevailing incentive structure among various financial investment products and to suggest measures to prevent mis-selling. The views and recommendations provided by the committee are now open for public comment. Moneylife in the past has often highlighted the rampant mis-selling of financial products. The FSDC report cites Moneylife’s survey on mis-selling by banks where we found that over 90% of consumers reported being mis-sold a financial product or service. The recommendations will be open for public comment till 5 October 2015. Incentive structure and non-disclosures are the main reason for mis-selling and one of the biggest culprits is the insurance industry. We summarise the product-specific recommendations of the committee. Mutual Funds •Upfront commissions should be totally removed. There is a current cap of 1% that comes from the fund house capital or profits. This too should be removed. •Distribution commissions should only be paid as level or reducing asset under management (AUM) based trail. In the case of lumpsum investment, or upon termination of a systematic investment plan, the trail commission should be declining (or nil after a specified period of time) •The extra commission in B15 (beyond the top 15 cities) should be removed and a level playing field be created in the country •No category of mutual funds should be exempt from the zero upfront •Distributors should not be paid advance commissions by dipping into future expenses, their own profit or capital •Competition has not reduced costs much below the expense ratio that was fixed when the AUM of the industry was much lower. The regulator should lower the cost caps as the AUM rises over time •On no account should sales of new fund offers happen, pitching the product as a “cheap” product that the investor is getting “at par” value of Rs10 •Customers should be disclose a range of past returns appropriate to the product tenure and should include returns of last 6 months and annualised returns since inception, and 2 year rests thereafter •Trail commissions on mutual funds should be disclosed at the time of sale •Customers should be informed that in addition to market risk, the performance is also subject to fund house/manager’s competence •Any change in scheme fund manager should be disclosed to all investors •For retail products, the AUM rankings should be shown only for the retail AUM Insurance: Unit Linked Insurance Plans (ULIPs) •The product should move to a TER model from a Reduction in Yield (RIY). The RIY model, in a closed-end product, causes a problem for insurance companies in managing costs and keeping them within the caps over the years as the market goes up and down. Cost of each function (i.e. insurance, investment and annuity) should be disclosed. An industry standard in costs will help the customer compare similar products across various parts of the marketplace. •Upfront commissions should be allowed only on the mortality part of the premium •There should be no upfronts for the investment part of the premium. The investment part should attract only AUM based trail commissions. The trail commission treatment should be decided with consultations with the lead regulator in the market-linked investment space. These should be level or declining. •Mortality costs should be deducted before the premium is put in the investment fund. Thereafter, all the charges should collapse into one expense charge and there should be no separate (i) premium allocation charge or (ii) admin charge. NAV should be adjusted for this expense charge and customer should be able to take the point to point NAV and compute the growth in fund value. •The costs of surrender from a ULIP should continue to be reasonable. After deduction of costs, the remaining money should belong to the exiting investors. •The life cover and premium in a bundled product should be disclosed. •The return benefits should be disclosed keeping basic tenants of finance in mind. •The current practice of showing future returns benchmarked to four per cent and eight per cent should be discontinued since forecasting of returns is misleading. •Benefit illustrations in the sales document currently showcase the numbers for one age, premium and sum assured. The seller/advisor should give in writing what the benefit illustration will be for the customer buying the product in a manner that takes into account all the recommendations on disclosure in the report. Both seller and buyer should sign this to ensure that a right sale has been made. •Asset allocation and portfolio disclosure should be made by all companies on their websites for consumers to access and the data feed be given to third party analyst firms to enhance research. •Past net returns should be disclosed to the customer. The current practice of showing gross returns is misleading. Customers should be disclosed a range of past returns appropriate to the product tenure and should include returns of last 6 months and annualised returns since inception, and 2 year rests thereafter. •All insurers should be required to provide online interactive calculators whereby a customer should be able to generate a customised and detailed benefit illustration based on her input of various available plan options. •All insurers should be required to disclose NAV such that a customer is able to easily compute her net investment return by taking the point to point NAV of the fund. Insurance: Traditional Life Insurance Policy •All costs should be bifurcated into two parts - mortality and investment. •Mortality costs should be benchmarked to the mortality tables created by third party actuarial firms. •Investment costs should be capped keeping in view the best practices in the rest of the market. •The costs of surrender should be reasonable. After deduction of costs, the remaining money should continue to belong to the exiting investors. •All charges should collapse into one single charge called the expense charge. This charge should be deducted from the gross yield before crediting the net returns to the customer’s investment account. This charge should be within an annual expense ratio or expense limit specified by the regulator. No charges should be deducted as premium allocation charge or any other charge before allocating the annual premium to investment and mortality. •Upfront commissions should be allowed for the mortality part of the premium. •Distribution commissions should not be front loaded. In a time-bound manner, the distribution commission should be set at a (i) level percentage of the premium over the tenure of the policy for non-participating products and at (ii) a percentage of asset (as an AUM trail fee) for participating products. •Distributors should not be paid advance commissions by dipping into future expenses, their own profit or capital. •The illegal practice of rebating should be punished harshly by the regulator as it distorts the market. •The current structure of paying upfront commission (which is today pegged at 2 percent of premium) on single premium insurance policies may be continued for the investment component of these policies •The cost of the life cover in a bundled product should be disclosed clearly. For comparison, the cost of a pure life cover as in a term policy for a similar life and tenor should be disclosed alongside such that a customer is able to evaluate the true value of the product. •Returns should be disclosed keeping basic tenants of finance in mind. This means that all returns should be disclosed as a percentage of the investment made by the customer and not as a function of a third number, such as a sum assured or the maturity benefit. •For non-participating plans that carry a guaranteed return, the return should be disclosed as a percentage of the investment made. The IRR should be a disclosure in the benefit illustration. The guaranteed return as a function of the investments made should be disclosed clearly as in a bank deposit. •For participating plans the current practice of showing future returns benchmarked to four per cent and eight per cent should be discontinued since forecasting of returns is misleading. •Participating plans should show benefits as a function of the invested amount rather than as a function of any other number. An indicative disclosure is: For participating plans, give the net IRR for the previous years in the product benefit illustration of a participating product. •Benefit illustrations in the sale document currently showcase the numbers for one age, premium and sum assured. •Asset allocation and portfolio disclosure should be made by all companies on their websites for consumers to access and the data feed be given to third party analyst firms to enhance research. •The current industry practice of using the word bonus to indicate return is misleading. Disclosures should use the word net return instead. •Customers should know very clearly the consequence of exiting a closed-end product earlier than maturity. •Since the space on the suggested disclosure sheet is limited, insurance companies should provide online calculators so that customers can better understand the consequence of exits across each year. Other General Recommendations •The regulators may consider putting additional disclosures requirements on banks where they are explicitly required to disclose (i) the products that originate from their group companies as such and (ii) the comparable products as comparison when selling products originating from their group companies. •All distributors, across regulators, along with their sales employees, should be assigned a unique number so that monitoring, surveillance and enforcement becomes unified and simpler. They should be subjected to detailed regulations incorporating rules, educational qualifications, entrance exams, code of conduct etc •Ultimately, proper product selection would improve and mis-selling would decline if investors become more financially literate. The Government should step up its efforts to improve financial literacy among Indian households. One area of focus should be a powerful, multi-lingual financial education website. •Tax benefits should be given on function and not form. Since the government wants to encourage insurance penetration, tax breaks should be given on pure risk mortality and the treatment of the investment part should be harmonised across the different forms of the product across regulators •Tax benefits should be given on function and not form. Since the government wants to encourage insurance penetration, tax breaks should be given on pure risk mortality and the treatment of the investment part should be harmonised across the different forms of the product across regulators. More in Moneylife", "external_links": [], "published": "2015-09-04T13:41:00.000+03:00", "crawled": "2015-09-04T13:58:07.501+03:00", "highlightTitle": ""}