{"organizations": ["Aegis Capital Corp", "Office of Mergers and Acquisitions Division of Corporation Finance"], "uuid": "0a3671d3b5f6c0df45c1be8fa4eb0253180ad430", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sec.gov", "main_image": "", "site_section": "http://www.sec.gov/rss/divisions/corpfin/cfnew.xml", "section_title": "SEC.gov Updates: What's New in the Division of Corporation Finance", "url": "http://www.sec.gov/divisions/corpfin/cf-noaction/2015/siliconware-precision-industries-091715-14d8.htm", "country": "US", "title": "No-Action Letter: Aegis Capital Corp.", "performance_score": 0, "site": "sec.gov", "participants_count": 0, "title_full": "No-Action Letter: Aegis Capital Corp.", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T22:00:00.000+03:00", "replies_count": 0, "uuid": "0a3671d3b5f6c0df45c1be8fa4eb0253180ad430"}, "author": "", "url": "http://www.sec.gov/divisions/corpfin/cf-noaction/2015/siliconware-precision-industries-091715-14d8.htm", "ord_in_thread": 0, "title": "No-Action Letter: Aegis Capital Corp.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Securities Exchange Act of 1934 Rule 14d-8 Response of the Office of Mergers and Acquisitions Division of Corporation Finance \nRe: \nSiliconware Precision Industries Co., Ltd. — Dual Tender Offers by Advanced Semiconductor Engineering, Inc. for common shares, including those represented by American depositary shares Incoming letter dated September 17, 2015 \nDear Mr. Bason: \nWe are responding to your letter dated September 17, 2015, addressed to Michele M. Anderson, Christina E. Chalk and David L. Orlic, as supplemented by telephone conversations with us, in regard to Advanced Semiconductor Engineering, Inc.'s exemption request. To avoid having to recite or summarize the facts set forth in your letter, our response letter is attached to the enclosed copy of your letter. Unless otherwise noted, capitalized terms in this response letter have the same meaning as in your letter. \nOn the basis of the representations and the facts presented in your letter, the staff of the Division of Corporation Finance hereby grants exemptions from Section 14(d)(6) of the Securities Exchange Act of 1934 and Rule 14d-8 thereunder if ASE includes the Odd-Lot Provision in the Offers, as required under Taiwan rules and described in your letter. \nThe foregoing exemptions are based solely on the representations and the facts presented in your letter, as supplemented by telephone conversations with the staff. This relief is strictly limited to the application of the provisions listed above to the Offers. ASE should discontinue the Offers pending further consultations with the staff if any of the facts or representations set forth in your letter change. \nWe also direct your attention to the anti-fraud and anti-manipulation provisions of the federal securities laws, including Sections 9(a), 10(b) and 14(e) of the Exchange Act and Rules 10b-5 and 14e-3 thereunder. Responsibility for compliance with these and any other applicable provisions of the federal securities laws rests with the participants in the Offers. The Division of Corporation Finance expresses no view with respect to any other questions that the Offers may raise, including, but not limited to, the adequacy of the disclosure concerning, and the applicability of any other federal or state laws to, the Offers. \nSincerely, \nBy the Division of Corporation Finance pursuant to delegated authority,", "external_links": [], "published": "2015-09-18T22:00:00.000+03:00", "crawled": "2015-09-19T01:31:04.656+03:00", "highlightTitle": ""}