{"organizations": [], "uuid": "b192b0d8f8414e50d1c073fa0f0d1396fcfffa6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/commodities/sugar-production-likely-to-fall-to-27-mt-in-2015-16-says-isma/142907", "country": "IE", "title": "Sugar production likely to fall to 27 mt in 2015-16, says Isma", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Sugar production likely to fall to 27 mt in 2015-16, says Isma | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T08:18:00.000+03:00", "replies_count": 0, "uuid": "b192b0d8f8414e50d1c073fa0f0d1396fcfffa6b"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/commodities/sugar-production-likely-to-fall-to-27-mt-in-2015-16-says-isma/142907", "ord_in_thread": 0, "title": "Sugar production likely to fall to 27 mt in 2015-16, says Isma", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Gold extend losses; tumbles Rs 235 on global cues, low demand Oil prices remain weak on Asia economy woes; shares in commodity firms tumble Gold struggles after 2-day losing streak on US rate hike fears The Indian Sugar Mills Association (Isma) on Monday trimmed its earlier forecast of the country’s sugar production, citing enhanced risks to yield from a deficient monsoon in Maharashtra and Karnataka, but the output would still beat consumption for a sixth straight year through the next marketing year starting October.\nAccording to the latest estimate by Isma, sugar output in the world’s second-largest producer is expected to touch 27 million tonne in 2015-16, compared with 28 mt predicted by it in July and almost 5% lower than the actual output of 28.31 mt — an eight-year high — in 2014-15. Consumption is expected to be 25.2 mt in 2015-16, up marginally from this year. This means the current glut in the domestic market would continue unless export prospects improve significantly.\nExports are currently unviable without government support, given the depressed prices overseas. The country’s sugar stocks at the end of this season on September 30 are estimated to touch 9.6 mt, the highest in the last six sugar seasons. Sugar prices are already at over seven-year lows, having dropped below even cane costs earlier this season, and thus impacting mills’ balance sheets adversely.\nThe earlier estimate (in July) “was mainly based on almost similar cane acreage across the country and slightly lower sugar production in Maharashtra due to lower rainfall,” Isma said.\n“However, considering further poor rainfall during monsoon in July and also in August in Maharashtra and Karnataka, Isma has revised its estimated sugar production for 2015-16,” it added. After witnessing a 16% rise in seasonal showers in June, monsoon lost intensity and dropped significantly from the benchmark long-period average (LPA) in July and August. Monsoon rains have recorded a 14% fall from the LPA so far this season.\nSugar mills produced 28.26 mt of sugar until September 15 and are expected to produce another 0.05 mt in the last 15 days of this season. Isma said the country’s output is expected to drop in 2015-16, as poor monsoon rains in Maharashtra would hurt yield and drag down output by 14.5% year-on-year to 9 mt. However, output in Uttar Pradesh, the second-largest producer, could rise 5.6% to 7.5 mt due to a slightly higher area under the cane crop and better yield and recovery with improvement of cane variety in the state and large areas under better varieties.\nThe total estimated cane acreage in Maharashtra is about 1.05 million hectares, which is almost at the same level as that of last year. “Due to less rainfall in July and August, which are said to be important months in the growth of the cane crop, it is estimated that the yield per hectare may go down. However, it is also important to note that with better rainfall in September, there may be some revival in the situation,” Isma said.\nThe association has estimated the total acreage in the country at 5.28 million hectares in 2015-16, 0.4% lower than a year before.\nKarnataka could produce 4.6 mt in 2015-16, lower than 5 mt it produced in 2014-15.\n 29, 2015 12:18 am", "external_links": [], "published": "2015-09-29T08:18:00.000+03:00", "crawled": "2015-09-29T16:20:37.799+03:00", "highlightTitle": ""}