{"organizations": ["BG", "Shell"], "uuid": "5100dacbfd7f9b04e6fa6bb9bb827ccc55f0cc43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-oil-gas/?format=rss", "section_title": "Oil News | Gas News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/australia-raises-concerns-over-shells-234825229.html", "country": "US", "title": "Australia raises concerns over Shell's $70bn takeover of BG Group", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Australia raises concerns over Shell's $70bn takeover of BG Group", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T02:48:00.000+03:00", "replies_count": 0, "uuid": "5100dacbfd7f9b04e6fa6bb9bb827ccc55f0cc43"}, "author": "", "url": "https://uk.finance.yahoo.com/news/australia-raises-concerns-over-shells-234825229.html", "ord_in_thread": 0, "title": "Australia raises concerns over Shell's $70bn takeover of BG Group", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 18, 2015, 06:05 BST - UK Markets open in 1 hr 55 mins Australia raises concerns over Shell's $70bn takeover of BG Group By Reuters | Telegraph – 5 hours ago 7.92 0.00 \nShell (LSE: RDSB.L - news ) still requires the green light from Australian and Chinese regulators to complete BG deal \nAustralia's competition watchdog has raised flagged concerns that Royal Dutch Shell 's proposed $70bn (£47bn) takeover of BG Group may lessen gas supply competition in the country. \nThe acquisition, which would transform Shell into the world's biggest liquefied natural gas (LNG) trader, still requires the green light from Australian and Chinese regulators but is on track for completion in early 2016, according to the Anglo-Dutch oil and gas company. \nThe Australian Competition and Consumer Commission (ACCC) said a large number of market participants had expressed concern that the takeover might lead Shell's Arrow Energy to sell its gas into BG's Queensland Curtis liquefied natural gas plant (QCLNG) for export. \n\"If the proposed acquisition resulted in less supply of gas to the domestic market, therefore, this could substantially lessen competition to supply domestic gas users and lead to higher domestic prices and more restrictive contractual terms,\" ACCC chairman Rod Sims said. \nThe commission said it now planned to issue a final decision on November 12. Analysts at Nomura said the delay was not unusual, maintaining its \"buy\" rating on Shell. \n\"We see no immediate red flags for the Shell-BG deal,\" the bank said in a note. \nConcerns that the deal could face regulatory hurdles and delays as well as low oil prices have stoked investor anxiety in recent months, with BG shares trading at a discount of around 10pc to Shell shares. \nIn response to the regulator's concern about gas sales by Arrow Energy, which is 50-50 owned by Shell and PetroChina (HKSE: 0857-OL.HK - news ) , Shell said BG already had enough gas to meet all its commitments. \n\"Arrow and QCLNG collaboration could assist the development of Arrow's undeveloped resources to potentially accelerate additional gas supplies into both the domestic and export market,\" Shell said. \nThe takeover has already been cleared by EU, US and Brazilian anti-trust authorities. It (Other OTC: ITGL - news ) still needs approvals from Australia's Foreign Investment Review Board and China to go ahead. \nSome of Australia's biggest manufacturers fear Shell's takeover of BG could worsen what they see as a lack of competition in the country's eastern gas market, spurred by three new LNG export plants, including BG's, in Queensland. \n\"This burst in demand for gas over a very short time frame for the LNG industry is effectively upending the east coast gas market,\" Sims said in a speech at a gas conference on Thursday, outlining the commission's preliminary impressions on a review of the east coast gas market due in April 2016. \nHe said the commission had evidence that after the LNG projects were approved, many Australian industrial gas users went from a market where they received three to five offers of supply on negotiable terms to a market where they received no offers or only one true offer on inflexible terms. \nShell, Australian regulators and third parties will hold a discussion over the next eight weeks to consider the issues raised by the ACCC, a Shell spokesman said. \n\"We will continue working with the regulators in Australia to ensure a timely completion of the transaction.\"", "external_links": [], "published": "2015-09-18T02:48:00.000+03:00", "crawled": "2015-09-18T08:04:59.732+03:00", "highlightTitle": ""}