{"organizations": [], "uuid": "8277cee545f330b64c8f7b4c374fd4699e8347bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/15/autoshow-frankfurt-hyundai-motor-idUSL4N11H40420150915", "country": "US", "title": "As profits sag, Hyundai seeks to regain edge - with sports cars", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "As profits sag, Hyundai seeks to regain edge - with sports cars | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T02:00:00.000+03:00", "replies_count": 0, "uuid": "8277cee545f330b64c8f7b4c374fd4699e8347bd"}, "author": "Sohee Kim", "url": "http://www.reuters.com/article/2015/09/15/autoshow-frankfurt-hyundai-motor-idUSL4N11H40420150915", "ord_in_thread": 0, "title": "As profits sag, Hyundai seeks to regain edge - with sports cars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NAMYANG, South Korea, Sept 16 South Korea's Hyundai Motor Co, whose former growth was driven by value-for-money vehicles, is developing sports cars in its latest attempt to spruce up its brand image while it tries to stem a slide in mainstream sales and profits.\nAt the Frankfurt Motor Show on Tuesday, Hyundai presented concept and rally cars using technology from its new \"N\" sub-brand - named for German race track Nurburgring and its own Namyang research and development centre. The cars are meant to give a glimpse of features like new powertrains and slick handling devised in a high-performance push led by a 30-year veteran engineer hired away from Germany's BMW AG.\nEmulating German rivals has become a feature of strategy at Hyundai, the world's fifth-largest automaker by sales along with affiliate Kia Motors Corp, as firms like BMW and Volkswagen AG have grown in its backyard. While its niche luxury Genesis sedan is selling well, Hyundai has slid to six straight drops in quarterly profit on weak sales of the mass-market sedans which fuelled its rise.\n\"Hyundai doesn't stand for high-performance car...not yet,\" said Albert Biermann, the 58-year-old former chief engineer for BMW's \"M\" sports car brand. Biermann spoke in a recent group interview at Hyundai's Namyang facility just outside Seoul, where Peter Schreyer, another German, holds sway as design chief for both Hyundai and Kia.\n\"This will change,\" said Biermann, who joined Hyundai in April to head up development of high-performance models at Hyundai and Kia. \"There's a clear commitment and a plan to develop and sell a high-performance car.\"\nHyundai officials declined to disclose financial targets, investment, pricing or strategy details for N sports car models. But Biermann said he expects Hyundai will start selling its first car under the sub-brand within two years, with a target audience that goes beyond a niche market.\n\"We will perform on the competitive level, but we will try to make these cars available for the wider customer base,\" said Biermann, the second-highest-ranking foreign executive at Hyundai after design guru Schreyer.\nAnalysts said developing a reputable high-performance brand will take Hyundai time. BMW's M and the AMG line produced by Daimler AG's Mercedes-Benz have been around for decades.\nBut they said the gambit is a positive long-term move for the automaker.\n\"Hyundai will lag behind the global auto industry if it does not develop high-performance and eco-friendly technology,\" said Kim Pil-soo, a professor of automotive engineering at Daelim University. (Editing by Tony Munroe and Kenneth Maxwell)", "external_links": [], "published": "2015-09-16T02:00:00.000+03:00", "crawled": "2015-09-16T01:08:38.614+03:00", "highlightTitle": ""}