{"organizations": [], "uuid": "9f53dcff3ef3deae5c0fefdee1cb2151f565cd13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/3/2/t/f/image.related.afrArticleLead.620x365.gjhr8y.png/1441694469787.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/business/wheat-production-to-rise-despite-el-nino-20150908-gjhr8y", "country": "AU", "title": "Wheat production to rise despite El Nino", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Wheat production to rise despite El Nino | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T14:05:00.000+03:00", "replies_count": 0, "uuid": "9f53dcff3ef3deae5c0fefdee1cb2151f565cd13"}, "author": "Jared Lynch", "url": "http://www.afr.com/business/wheat-production-to-rise-despite-el-nino-20150908-gjhr8y", "ord_in_thread": 0, "title": "Wheat production to rise despite El Nino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wheat production is expected to top 25 million tonnes in 2015-16, higher than original forecasts. by Jared Lynch Wheat growers are expected to escape the worst effects of an El Nino, according to the commodity forecaster, which raised production estimates in the wake of a soggier-than-expected winter, with more rain to come.\nWheat production is expected to top 25 million tonnes in 2015-16, up from the 23.6 million forecast in June, the Australian Bureau of Agricultural and Resource Economics and Sciences said.\nThe increase comes despite the Bureau of Meteorology expecting El Nino – a weather pattern caused by warming water in the Pacific Ocean off the coast of South America – to peak before Christmas.\nA Department of Agriculture spokeswoman said warm sea temperatures in the Indian Ocean were likely to offset the El Nino weather phenomenon and help create wetter-than-average spring rains and increased wheat production.\n\"The BOM has described the combined effect of this unusual set of circumstances as presently being a major influence on seasonal conditions in Australia,\" the spokeswoman said.\nTiming important But she said the timing of any rainfall will be \"just as important as the quantum\".\n\"This will be more important in areas with low levels of lower-layer soil moisture than in areas with high levels of lower-layer soil moisture.\"\n ANZ senior agricultural strategist Paul Deane said strong rainfall in September would be a key part of realising ABARES' wheat production estimate.\nMr Deane said that \"24-25 million tonnes is achievable\".\n\"But it's going to come down to what happens in the next month, as it always does.\"\nShares rise Shares in Australia's biggest listed agribusiness, GrainCorp, jumped 1.9 per cent to $8 on Wednesday afternoon, compared with the broader market rising 1.7 per cent.\nMr Deane said despite the upbeat outlook from ABARES, wheat production in Australia was still \"mixed\" – with NSW, southern Queensland \"very good\", Western Australia \"tracking along OK\".\n\"Victoria is still a bit patchy. We had some rain, which has helped in the past week or so but certainly some areas are looking at below average yields still.\"\nWestern Australia, the country's biggest wheat harvester, is expected to yield 9.5 million tonnes, up from June's estimate of 9.3 million tonnes.\nABARES expects production in Australia's second biggest wheat producer, NSW, to soar to 7.2 million tonnes, up from 6.2 million.\nThe El Nino in the Pacific Ocean is now the strongest since the record 1997-98 event, according to the Bureau of Meteorology.\nMost climate models indicated the Pacific would continue to warm, BOM said. But although the El Nino was often associated with a drier winter and spring in eastern Australia, its strength didn't always determine its impact, according to the bureau.\nwith Bloomberg", "external_links": [], "published": "2015-09-08T14:05:00.000+03:00", "crawled": "2015-09-08T17:26:35.993+03:00", "highlightTitle": ""}