{"organizations": ["National Unity"], "uuid": "8387f17f4f9d5c7e2cfb57e807980e46197a7281", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509212714.html", "country": "US", "title": "Southern Africa: The Provision of Reliable and Sustainable Energy", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Southern Africa: The Provision of Reliable and Sustainable Energy", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T16:40:00.000+03:00", "replies_count": 0, "uuid": "8387f17f4f9d5c7e2cfb57e807980e46197a7281"}, "author": "", "url": "http://allafrica.com/stories/201509212714.html", "ord_in_thread": 0, "title": "Southern Africa: The Provision of Reliable and Sustainable Energy", "locations": ["Africa", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa: The Rugby World Cup and National Unity \nThe provision of reliable and sustainable energy continues to be a priority for southern Africa's development agenda. \nThe Southern African Development Community (SADC) has been experiencing energy shortfalls for more than a decade due to growth in demand, forcing most countries to implement demand side management programmes such as load shedding. \nWhile load shedding has succeeded in restraining the overall electricity demand in the region to some extent, the measure has also affected socio-economic growth since the availability of energy is one of the key enablers of sustainable development, and is essential to the industrialization agenda. \nSADC and its energy sector cooperating partners met in Gaborone, Botswana on 15 September to discuss ways of improving a coordinated approach to addressing the energy situation in the region. \nThe energy sector cooperating partners, commonly known as the SADC Energy Thematic Group (ETG) consists of representatives of the SADC Secretariat, SADC subsidiary organisations, International Cooperating Partners (ICPs) and a knowledge partner, the Southern African Research and Documentation Centre (SARDC). \nThe lead ICP for the energy sector is Austria, and SARDC is tasked with raising regional awareness among stakeholders in southern Africa about key energy issues in the region. \nSpeaking at the meeting, Director of Infrastructure and Services at the SADC Secretariat, Remmy Makumbe said energy is a key enabler of sustainable development and as such, the region should strive to have adequate energy to ensure supply meets demand. \nHe said energy sector cooperating partners have been influential in assisting SADC to address its energy situation, adding that \"we should continue this spirit of cooperation.\" \nWith the recent approval of two key regional action plans namely the Revised RISDP and SADC industrialization Strategy and Roadmap, Makumbe said it was important for the ICPs involved in the energy sector to align their support to the two documents. \nAlignment of support to the two regional documents will ensure the smooth implementation of agreed activities and programmes, thereby promoting socio-economic development and deeper integration. \n\"Our support to regional energy development should speak to these two documents, the Revised RISDP and the SADC industrialization Strategy and Roadmap,\" he said, adding that any support that does not speak to these \"will be difficult to find place in our activities.\" \nDeputy Head of Mission at the Austrian Embassy in Pretoria, Matthias Radosztics said ICPs were committed to support SADC in regional energy development, as well as aligning their support to the Revised RISDP and the SADC industrialization Strategy and Roadmap. \nThe two regional documents were adopted by a SADC Extra-Ordinary Summit held in April in Harare, Zimbabwe. \nThe SADC Industrialization Strategy and Roadmap aims at accelerating the growing momentum towards strengthening the comparative and competitive advantages of the economies of the region, and is anchored on three pillars, industrialization, competitiveness and regional integration. \nThe strategy covers the period 2015-2063. \nThe Revised RISDP is a five-year plan that guides the implementation of all SADC programmes from 2015 until 2020. \nThe plan has four priority areas - Industrial development and market integration, Infrastructure in support of regional integration, Peace and Security cooperation as a prerequisite for regional integration, as well as Special programmes of regional dimension. \nEnergy is a critical area for both the Revised RISDP and SADC Industrialization Strategy and Roadmap. \nThe SADC ETG meeting also discussed the formulation of the SADC Renewable Energy Strategy and Action Plan 2015 to 2020 (RESAP). \nThe meeting said it was important for SADC to have a common policy on how to harness its renewable energy sources which are in abundance across the region. \nAccording to the African Development Bank, the total hydropower potential in SADC countries is estimated at about 1,080 terawatt hours per year (TWh/year) but capacity being utilised at present is just under 31 TWh/year. A terawatt is equal to one million megawatts (MW). \nThe RESAP aims to encourage the region to achieve a renewable energy mix of at least 32 percent by 2020, which should rise to 35 percent by 2030. \nCurrently, SADC generates about 74 percent of its electricity from thermal stations. \nOn the establishment of the SADC Centre for Renewable Energy and Energy Efficiency (SACREEE), which was approved by the 34th SADC Energy Ministers held in July in South Africa, the meeting noted with appreciation the creation of SACREEE, saying the centre will change the \"landscape of energy development in SADC.\" \nSACREE is expected to increase the uptake of clean energy in southern Africa, enabling the region to address its energy challenges. \nTechnical Advisor to the SADC Secretariat Energy Division, Wolfgang Moser said efforts are underway to have the centre, which will be based in Namibia, operational by the first quarter of next year. \nAnother main issue discussed was the need to explore the water-energy-food nexus to promote better coordination among stakeholders. \nIn this regard, a water-energy-food nexus is being planned to unpack the synergies and trade-offs between water and energy use and food production. \nThe next SADC ETG meeting is scheduled for February 2016. Southern Africa \nWALKING through the corridors of the homicide section at Harare's main police station, it is the \"for sale\" signs on … see more » Copyright © 2015 Southern African News Features. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-21T16:40:00.000+03:00", "crawled": "2015-09-21T17:21:31.646+03:00", "highlightTitle": ""}