{"organizations": [], "uuid": "429fd17ecc13fab3f1296ecf068f9fae1a3f020d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/d/c/6/h/image.related.afrArticleLead.620x365.gjf8l1.png/1441354044383.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/economy/byebye-champagne-hello-sparkling-wine-welcome-to-our-new-standard-of-living-20150904-gjf8l1", "country": "AU", "title": "Bye-bye champagne, hello sparkling wine: welcome to our new standard of living", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Bye-bye champagne, hello sparkling wine: welcome to our new standard of living | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T22:15:00.000+03:00", "replies_count": 0, "uuid": "429fd17ecc13fab3f1296ecf068f9fae1a3f020d"}, "author": "Share via Email", "url": "http://www.afr.com/news/economy/byebye-champagne-hello-sparkling-wine-welcome-to-our-new-standard-of-living-20150904-gjf8l1", "ord_in_thread": 0, "title": "Bye-bye champagne, hello sparkling wine: welcome to our new standard of living", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The economy is growing slower than it has since the Abbott government and Treasurer Joe Hockey were elected. Nick Moir by Jacob Greber It was no doubt with a massive sense of relief that Joe Hockey settled into his seat on Wednesday afternoon for the 20-plus hour flight to Ankara.\nJetting to a Group of 20 finance minister's meeting in the Turkish capital this weekend puts several time zones and 14,500 kilometres between himself and news the economy only narrowly escaped its first contraction in four years, last quarter.\nThis week's national accounts were undeniably bleak – despite Hockey's vain efforts in the hours before he boarded his flight to spin them as good news.\nThe jury is still very much out as to whether Australia's 24-year growth streak is coming to an end. Most economists don't see it as likely in the near-term, thanks largely to the stimulus of ultra-low official interest rates and a sliding dollar, both of which have put the economy on life support.\nBut official confirmation by the Australian Bureau of Statistics that living standards are heading south at an accelerating rate have reinforced a growing sense the nation's fortunes are moving into unsettling territory from a position of deepening vulnerability. By extension, so is the Coalition.\nIt's been two years since Abbott's team surged to power on a promise to restore good government, fix the budget and wipe out debt. Two-thirds of the way through the term, it's clear that none of these things are close to being achieved any time soon. The evidence is starkly on display in opinion polls and hard official data.\nAbbott's disapproval ratings are in the basement, with Labor seemingly entrenched in an election-winning lead; the prospect of a genuine structural improvement in the budget on current trends looks to be another three elections away, at best. Debt hit a staggering $387 billion on Friday.\nIn the doldrums At the heart of this underperformance on the Abbott government's core promises to the nation in 2013 is an economy in the doldrums.\nGross domestic product came in at an annual 2 per cent in the three months through to June 30 – marking the 12th straight quarter of below-average growth. For three long years, incomes have been squeezed and the crunch is getting worse.\nOne of the broadest measures of living standards – real net disposable income per capita – fell for a fifth quarter on renewed declines in commodity prices and wages growth.\nThe consequences are widespread. Without rising incomes, households are forced to dip into savings to maintain levels of spending and the government receives fewer dollars than it anticipated, forcing it to choose between hiking taxes and cutting spending – or letting debt blow out.\nSo far, Abbott has presided over mostly the latter, after suggesting in March that a ratio of debt to GDP at about 50 per cent to 60 per cent \"is a pretty good result looking around the world\". For the record, debt currently stands in the low 20 per cent range, depending on how it's measured.\nWeaker incomes also mean consumer-driven growth is likely to remain weak this year.\nCalculations by Morgan Stanley analysts based on Wednesday's national accounts show the average wage rose just 0.4 per cent in 2014-15 to of $73,000. Taking inflation into account gives a real wage decline of 1 per cent.\nIn international terms, the hit is even larger, thanks to the Australian dollar's dramatic decline over the past 12 months. In hindsight we now know that 2012 was the high-water mark for Australians' global purchasing power - when the currency traded for most of the year above US parity, compared to a shade above US69c now.\nThat year coincided with record overseas travel, surging imports of luxury cars and an explosion in online shopping as households indulged their every desire with bargain basement goodies bought from the comfort of their couches. For the first time in a generation, carefree consumers guzzled top-shelf French champagne because it was cheaper than the Australian version. A flood of previously unobtainable imported toys, gadgets and experiences become available to households like never before.\nFor many, particularly in the resource sector, those days already seem like a golden era. This weekend David Jones's annual flower show will bloom in stores across the country. But news this week that retail sales fell in July - the first fall in 14 months - shows wallets are shutting.\nSince peaking in late 2012, Australian wages have fallen in US dollar terms by 22 per cent to $US56,700.\nIn economic terms, your living standards just dropped by a fifth.\nAs the Australian Bureau of Statistics pointed out this week to Hockey's clear irritation, nominal GDP - which reflects what Australians, their companies and governments are actually paid for the goods and services they produce - posted the weakest financial year growth since 1961-62.\nIn short, the economic pie is shrinking, and at a faster rate than almost anyone who didn't start working in the late 1950s will ever have experienced. Lets face it, that's basically everyone in a job today.\nYet as Melbourne University professor Ross Garnaut said in the aftermath of news that GDP rose a pathetic 0.2 per cent in the June quarter, none of this should come as a surprise.\nThe soft underbelly of Australia's economy has been apparent to those willing to look for some time. Real GDP measures volumes of goods and services, and it's been held up largely by a rise in shipments from the newly expanded mega iron ore and coal ports, with LNG soon to join in.\nAll it took was a dip in those shipments during the June quarter – which also happened to coincide with another rapid slump in world prices for the same resources – to reveal the domestic economy's vulnerability.\nApart from NSW and parts of Victoria, where a housing and construction boom has picked up some of the slack left by the mining investment boom, there's not enough happening to lift growth.\nIronically, for a Coalition whose philosophical foundations are built on smaller government, the only reason the economy didn't contract last quarter was because of a rise in public spending, a large slab of it for defence.\nLack of vision Canberra's political classes in particular have no excuse for not seeing the commodity wave come crashing down. Years ago in fact.\n\"There is nothing special in the national accounts,\" says Professor Garnaut, whose book Dog Days outlined more than two years ago how the falling terms of trade would play havoc with fiscal reality and living standards. \"This is the 12th quarter of below-trend growth. It is time to recognise a new trend and respond intelligently to it.\"\nSo far, there is not enough evidence of this happening.\nThe fact that two national newspapers – The Australian Financial Review and The Australian – felt compelled to host a National Reform Summit last month to find ways through the mess, should be a source of shame for all sides of politics.\nHockey's entire long-term budget plan rests on the increasingly stoical belief the economy will soon stage a rapid recovery before punching out five straight years of 3.5 per cent growth from 2017-18 onwards.\nThat's also the moment when a surge of spending commitments fall due. Education, defence, disability services and a rapidly ageing population will all weigh on the budget.\nThat means there is no room for error. Yet Hockey's projection appears more fanciful with every day. Even Reserve Bank governor Glenn Stevens has questioned whether our new \"normal\" may be around a fifth slower than Treasury's expected rate, at about 2.75 per cent.\nFormer Treasury secretary Martin Parkinson pointed out recently that the difference in growth expectations – that is the gap between what is considered trend growth of just over 3 per cent and the new potential normal – is the equivalent of accepting a recession every decade in lost output.\nGiven the mechanics of such downturns, that's not a future Australians can afford to blithely ignore.\nEconomists estimate that recessions tend to add about 4 or 5 per cent of GDP to government debt. Given current levels, that doesn't leave a lot of wriggle room before the AAA credit rating gets threatened, and with it, the low cost access to global funds Australians and their businesses have become accustomed to via the banking system.\nAdd another potential global financial crisis to the mix – something many have been pondering in recent weeks amid all the China-driven turmoil – and it's clear just how vulnerable the country is.\nOne more thing, a large part of the wafer-thin budget surpluses projected by Hockey next decade are actually built on a decision by his Liberal predecessor to establish the Future Fund, as revealed by AFR Weekend in May. Peter Costello confirmed this week that the fund would contribute more than $7 billion a year from 2020 onwards.\nThat's equivalent to more than 50 per cent of the projected surplus in some years, according to calculations by economist Saul Eslake. Imagine Hockey's budget future without Costello's free kick.\nAll of which brings into focus the real take-out from this week's accounts.\nNot enough has been done to protect the budget – and by extension the economy – from the next serious external shock.\nHockey used to hammer this point before it became clear in the lead-up to the May budget that the government's fortunes were flagging in the polls. The message switched to one of slowing the pace of fiscal repair; of blaming the delay on global forces, chiefly collapsing commodity prices.\nThis argument has economic merit – many of the problems that bedevil the Coalition's economic strategy are out of its command. But Hockey and Abbott, when they prosecuted the case in opposition against the Labor government, allowed no such leeway.\nTheir failure to acknowledge the challenges faced by their predecessors has come back to haunt them.\nAnother problem underscored by the figures – the collapsing revenue base – should be cause for action.\nBut building consensus with the states on GST reform, by way of example, will require a deft hand. It means prosecuting the case for change against entrenched and powerful opponents and cajoling reluctant state governments to join the cause without alienating their need for additional revenue. The portents aren't good, given Abbott's love of a fight over negotiation.\nIn any case, regardless of how far away Ankara is, it's more than likely the economy will once again be a source of pain for the government in three months' time, when the September quarter figures are released. It's likely that talk of a recession will again be front of mind given the early numbers aren't good. Retail sales falling for the first time in more than a year; the terms of trade down again, and business investment is on strike.\nHere's hoping the Australian dollar continues to soften the blow, even if it does mean more falls in living standards.", "external_links": [], "published": "2015-09-04T22:15:00.000+03:00", "crawled": "2015-09-04T20:02:46.595+03:00", "highlightTitle": ""}