{"organizations": ["LGO Energy PLC & Anglo Pacific Group plc"], "uuid": "b069185675159ec32905424bd08eb8a67895ff51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-oil-gas/?format=rss", "section_title": "Oil News | Gas News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/g4s-eyes-global-market-wins-131021299.html", "country": "US", "title": "Is Now The Perfect Time To Buy Gulf Keystone Petroleum Limited, LGO Energy PLC & Anglo Pacific Group plc?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is Now The Perfect Time To Buy Gulf Keystone Petroleum Limited, LGO Energy PLC & Anglo Pacific Group plc?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T15:27:00.000+03:00", "replies_count": 0, "uuid": "b069185675159ec32905424bd08eb8a67895ff51"}, "author": "", "url": "https://uk.finance.yahoo.com/news/g4s-eyes-global-market-wins-131021299.html", "ord_in_thread": 0, "title": "Is Now The Perfect Time To Buy Gulf Keystone Petroleum Limited, LGO Energy PLC & Anglo Pacific Group plc?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 11, 2015, 13:56 BST - UK Markets close in 2 hrs 34 mins Is Now The Perfect Time To Buy Gulf Keystone Petroleum Limited, LGO Energy PLC & Anglo Pacific Group plc? By Peter Stephens | Fool.co.uk – 28 minutes ago 1.275 -0.0250 \nWhile investing in the resources sector has proven to be largely unprofitable over the last year, things could change in the months and years ahead. That's because news flow for the companies operating in the sector could improve which, in turn, may lead to investors placing a much smaller discount on their valuations. \nFor example, Gulf Keystone Petroleum's (LSE: GKP) future appears to be much brighter after the Kurdistan Regional Government (KRG) announced that it will now commence regular, monthly payments to oil producers in the region. And, to commence the new policy, Gulf Keystone Petroleum is set to receive a payment of around $15m within the next few days, which should help to improve its financial outlook and boost investor sentiment. \nHowever, the company is not out of danger just yet. It continues to be owed for past oil production by the KRG and, while regular monthly payments may now commence, there appears to be no word on whether outstanding debts will be cleared. Furthermore, Gulf Keystone Petroleum continues to suffer from the great uncertainty which exists in the region, with the conflict in Iraq/Syria seemingly set to continue over the medium term. \nAnd, while the KRG may have the best of intentions and will seek to fulfil its promise of regular payments, the situation within the region is very fluid and resources may be required elsewhere. So, while the news is positive for Gulf Keystone Petroleum, it may be worth waiting for evidence of further payments before buying a slice of the business. \nMeanwhile, mining investment company Anglo Pacific (LSE: APF) could be set to deliver improved news flow over the next couple of years. That's because the company is expected to move from being a loss-making entity into a profitable one, with two years of losses set to give way to a pretax profit of £5m this year and £10m next year. This could be enough to turn around investor sentiment and push the company's share price higher after its 12% fall since the turn of the year. \nFurthermore, with Anglo Pacific having a forward price to earnings (P/E) ratio of 18.5 and being set to double pretax profit next year, it shares seem to offer appealing capital gain potential for less risk averse investors. \nSimilarly, LGO Energy (LSE: LGO) also has the scope for improved news flow. And, with its drilling programme at the flagship Goudron well in Trinidad having been progressing well, it seems to be in a strong position to deliver impressive levels of profitability over the medium to long term. \nMost recently, it announced that the last of its 2015 development wells had reached its target depth, with it having located a similar thick sand package to a previous well from which over 105,000 barrels of oil have been produced to date. With the prospect of further encouraging news flow and a price to book (P/B) ratio of 1.9, it appears to be worth buying for the long haul. \nOf course, there are a number of other small-cap stocks that could be worth buying right now and, with that in mind, the analysts at The Motley Fool have written a free and without obligation guide called 1 Top Small-Cap Stock From The Motley Fool. \nThe company in question may have flown under your investment radar until now, but could help you to build a great income from your investments and retire early, pay off the mortgage, or simply enjoy a more abundant lifestyle. \nClick here to find out all about it - it's completely free and comes without any obligation. \nPeter Stephens has no position in any shares mentioned. The Motley Fool UK owns shares of Anglo Pacific. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-09-11T15:27:00.000+03:00", "crawled": "2015-09-11T16:43:50.489+03:00", "highlightTitle": ""}