{"organizations": [], "uuid": "548994e58daf9aa40e7a57bd0a0cb1c324312617", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KJ005_0917ua_G_20150917163502.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/fiatchrysler-offering-hourly-workers-profit-sharing-bonuses-1442601031", "country": "", "title": "Fiat Chrysler Offering Hourly Workers Richer Profit-Sharing Bonuses", "performance_score": 0, "site": "wsj.com", "participants_count": 2, "title_full": "Fiat Chrysler Offering Hourly Workers Richer Profit-Sharing Bonuses - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T23:38:00.000+03:00", "replies_count": 1, "uuid": "cfa581b80d6eb1bfbb961923d158f18bafcebf63"}, "author": "Christina Rogers", "url": "http://www.wsj.com/articles/fiatchrysler-offering-hourly-workers-profit-sharing-bonuses-1442601031#post-0", "ord_in_thread": 0, "title": "Fiat Chrysler Offering Hourly Workers Richer Profit-Sharing Bonuses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Fiat Chrysler Automobiles FCAU -4.03 % NV is prepared to pay profit-sharing bonuses of $12,000 to its newer hourly workers if the company’s North American profit margin reaches or exceeds 10%, say people briefed on a new labor deal.\nAs part of its tentative agreement with the United Auto Workers union, Fiat Chrysler will also recast the profit-sharing formula to tie yearly payouts to company margins, rather than dollar amounts as it is now, the people said.\nThe strategy reflects a move by the Italian-U.S. auto maker to more heavily rely on variable pay as a component of compensation for hourly workers, rather than adding more fixed labor costs.\nThe outgoing arrangement that Fiat Chrysler has with its U.S. factory workers has resulted in much lower payouts for the company’s workers than at its two larger, more profitable rivals General Motors Co. GM -2.56 % and Ford Motor Co. F -2.19 % and has been a sore point for members.\nUnion and company leaders have designed the new bonus structure to offset a base-wage pay gap between entry-level workers and more-senior factory employees by providing newer hires with a richer formula.\nA UAW spokesman declined to comment. Details will be shared later Friday at a news conference in Detroit.\nThe controversial two-tier pay structure was established in 2007 to help the then-financially distressed U.S. car makers survive, but with all three companies now banking healthy profits, members have pressed for its elimination.\nUnder the current formula, the company’s 36,000 blue-collar workers get $1 for every $1 million in profits, based on 85% of world-wide profits.\nThe new scale will pay all hourly workers $800 per margin point as long as margins exceed 2%, the people said. If margins reach 8% or higher, newer workers—those hired after 2007—will get an added bonus ranging from $1,000 to $4,000 on top of the base sum, allowing them to potentially outearn their veteran counterparts, the people said.\nFor instance, at a 10% margin, entry level workers would get $8,000 in the base payout, plus another $4,000 on top, for a total of $12,000, the people said.\nThe UAW aims to use the agreement at Fiat Chrysler to craft similar deals at GM and Ford, where it will turn its attention next once the deal is ratified by a membership vote.\nThe new profit-sharing plan comes on top of base-wage increases for hourly workers and the offer of a $3,000 signing bonus upon ratification, say people familiar with the deal.\nNewer hires will get a new wage progression that sets the new floor and ceiling for hourly pay between $17 and $25 an hour, the people said. Right now, pay for those workers is capped at about $19 an hour.\nVeteran workers will also get their first pay raise in about a decade. Under the pact, Fiat Chrysler will boost the hourly rate for these workers to over $30 from $28 now over the life of the contract through a combination of lump sums and base increases, the people said.\nDespite the richer profit-sharing formula, Fiat Chrysler’s margins are still well behind those at Ford and GM, making the new bonus scheme a taller order for the two, more profitable U.S. competitors.\nFiat Chrysler posted North American margins of 7.7% in the second quarter, but before that, operating results had been hovering closer to 4%, despite booming U.S. sales and buyers flocking to the company’s more lucrative trucks and sport-utility vehicles.\nBy contrast, Ford’s operating margin in North America was a record 11.1% in the second quarter, while GM posted a 10.5% operating margin in the same period.\nWrite to Christina Rogers at christina.rogers@wsj.com", "external_links": [], "published": "2015-09-18T23:38:00.000+03:00", "crawled": "2015-09-19T03:54:55.290+03:00", "highlightTitle": ""}