{"organizations": [], "uuid": "28ec93503cc6b9068ae6a5e0f2d91e2a12535f39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/exportimport_062514gn.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/254279-dems-take-ex-im-fight-to-the-campaign-trail", "country": "US", "title": "Dems take Ex-Im fight to the campaign trail", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Dems take Ex-Im fight to the campaign trail", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T15:00:00.000+03:00", "replies_count": 0, "uuid": "28ec93503cc6b9068ae6a5e0f2d91e2a12535f39"}, "author": "bgoad@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/254279-dems-take-ex-im-fight-to-the-campaign-trail", "ord_in_thread": 0, "title": "Dems take Ex-Im fight to the campaign trail", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dems take Ex-Im fight to the campaign trail By Kevin Cirilli - 09/20/15 08:00 AM EDT \nDemocrats are looking to turn Republican opposition of the Export-Import Bank into a Congressional campaign issue.They argue that conservatives' efforts to kill the federally backed bank — whose charter lapsed June 30 and as a result cannot finance new projects — have forced companies like General Electric to send hundreds of jobs overseas. Earlier this week, White House press secretary Josh Earnest said that \"Republicans have killed quite a few jobs on their own,\" after referencing the G.E. jobs.Meanwhile, the Democratic Congressional Campaign Committee slammed Reps. John Katko (R-N.Y.) and Elise Stefanik (R-N.Y.) earlier this week for choosing to campaign with House Speaker John Boehner (R-Ohio) instead of reauthorizing the bank. Katko and Stefanik are both in districts influenced by G.E.'s announcement earlier this week that a lack of Ex-Im financing has resulted in 500 jobs going to Europe.“Because Congressman Katko and Congresswoman Stefanik failed to do their jobs in Washington, workers across the region could lose theirs,” said DCCC spokesman Jeb Fain.Fain said that “by choosing to fundraise with Boehner instead of reauthorizing the Export-Import bank, they made their real priorities abundantly clear.\"Stefanik spokesman Tom Flanagin pushed back hard against the Democrats' criticism, noting that Stefanik is a supporter of reauthorizing the bank and even co-sponsored legislation to reauthorize it.\"She will continue to explore legislative avenues to get the Export-Import Bank reinstated,\" Flanagin said. Ex-Im has aligned the business community with Democrats as opposed to conservatives, a rare political alliance in Washington.Groups like the U.S. Chamber of Commerce and the National Association of Manufacturers (NAM) have fought hard to reauthorize the bank over the objections of conservative groups like Heritage Action and Freedom Partners.And the DCCC's attacks against the two lawmakers signals that they're looking to elevate the bank's reauthorization as a potential local election issue.\"It is interesting how suddenly Democrats have become corporate shields for a mega corporation like G.E.,\" said Veronique a scholar at George Mason University's Mercatus Center, which has been critical of Ex-Im. \"They are eagerly defending the Ex-Im Bank, which is the poster child of corporate welfare.\"The Ex-Im’s reauthorization has traditionally been a noncontroversial issue. But conservatives have been able to elevate it as a political wedge issue for their party.One House Republican staffer who doesn't work for Katko or Stefanik said Democrats’ virtually unanimous backing of the bank also represents a new dynamic. \"Democrats used to oppose Ex-Im because it helped big corporations outsource American jobs but now they’ve flip-flopped.\"\"I can’t help but wonder if the $13 million GE has spent on lobbying this year alone — instead of using that money to invest in their plants and workers — has anything to do with the Democrats’ change of heart,\" the aide added.", "external_links": [], "published": "2015-09-20T15:00:00.000+03:00", "crawled": "2015-09-20T19:38:43.187+03:00", "highlightTitle": ""}