{"organizations": ["Hydefield Capital MD Business & Finance", "Hydefield Capital"], "uuid": "706551ead141e1d68697023d39e5312373ebdfca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/h41og66fea_3463080407741_7256727771471.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/642874/1/judicial-scandal-affecting-investments-hydefield-c.html", "country": "US", "title": "Judicial scandal affecting investments - Hydefield Capital MD", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Judicial scandal affecting investments - Hydefield Capital MD", "spam_score": 0.0, "site_type": "news", "published": "2015-09-15T20:36:00.000+03:00", "replies_count": 0, "uuid": "706551ead141e1d68697023d39e5312373ebdfca"}, "author": "", "url": "http://www.modernghana.com/news/642874/1/judicial-scandal-affecting-investments-hydefield-c.html", "ord_in_thread": 0, "title": "Judicial scandal affecting investments - Hydefield Capital MD", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business & Finance | 15 September 2015 18:36 CET Judicial scandal affecting investments - Hydefield Capital MD By Joy Business \nThe judicial scandal that has rocked the country is already stalling some investments after sparking doubt in the legal system among investors. That’s according to some players in the investment industry. \nThe judges accused of taking bribes in Anas Aremeyaw Anas’ investigative video are in court seeking several reliefs including an injunction on the broadcasting of the video. \nThe Group Managing Director of Hyde-field Capital, Mahama Iddrissu says even though it’s just a week since the news broke, it is already affecting decisions by some investors just like the infamous election petition case. \nHe spoke with Joy Business’ Editor, Emmanuel Agyei: “There’s a lot of business in relation to capital and partnerships. This allegation is actually affecting Ghanaian partners. It has actually started affecting businesses because there are some people who have postponed business-contracts in order to know how Ghana is going to solve this. In Ghana we call it allegations but if you go outside, they will tell you it’s something long overdue and that people were waiting for evidence.” \nHe further stated, “Some companies may not be interested in their names or industries being mentioned but as far as I know, this is actually generating doubts and people who are looking at Ghana for business partnership - especially people who are already in discussion”. \nThere were fears the dampening investor confidence could even affect government’s planned Eurobond sale - especially given the attention the international media also appear to be giving it. But Mr. Iddrisu who has worked on the Eurobond before has allayed such fears despite the postponement of the exercise. \n“The sovereign bond deals with investment season and anything that happens now has been planned probably from January because when the government finishes with one sovereign bond and it thinks he wants to go for a next one, the planning is started. The current road show has probably been postponed because they need to get some investors ready and available for the team to meet them and talk to them. \n“And for sovereign bond settlement, the legal system actually doesn’t have any effect on them because government has already told investors the source of funds that may be available to pay both their interest and principal if they are not probably having negotiation to roll over already issued ones that are maturing,” he concluded. Other Stories Follow Us \" When a man says he can swallow an axe hold the handle for him\" Translated from Hausa and Yott. By: Yoknyam Dabale", "external_links": [], "published": "2015-09-15T20:36:00.000+03:00", "crawled": "2015-09-16T00:28:16.331+03:00", "highlightTitle": ""}