{"organizations": [], "uuid": "a168577430e86ec204f7a50f3e3c9119b7b8d577", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.crainsnewyork.com", "main_image": "http://www.crainsnewyork.com/assets/logos/main-logo/C-200x200.jpg", "site_section": "http://feeds.crainsnewyork.com/crainsnewyork/finance", "section_title": "Finance - Crain's New York Business News Feed", "url": "http://www.crainsnewyork.com/article/20150925/POLITICS/150929898", "country": "US", "title": "Post-Boehner, risk of December government shutdown and Export-Import Bank closure is high", "performance_score": 0, "site": "crainsnewyork.com", "participants_count": 1, "title_full": "Post-Boehner, risk of December government shutdown and Export-Import Bank closure is high", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T22:15:00.000+03:00", "replies_count": 0, "uuid": "a168577430e86ec204f7a50f3e3c9119b7b8d577"}, "author": "Bloomberg News", "url": "http://www.crainsnewyork.com/article/20150925/POLITICS/150929898", "ord_in_thread": 0, "title": "Post-Boehner, risk of December government shutdown and Export-Import Bank closure is high", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Associated Press The Export-Import Bank building in Washington D.C. \nWith John Boehner stepping away from the negotiating table, the chances increase for a December government shutdown and a permanent shuttering of the Export-Import Bank.Other question marks: Will Congress and the White House be able to agree on new federal borrowing authority and revise the way the U.S. pays for the upkeep of roads and bridges.The immediate shutdown threat may have passed, since Mr. Boehner, a core group of House Republicans, House Democrats and a Senate majority appear to be in agreement on a stopgap bill to carry the government from Oct. 1 through Dec. 11.Mr. Boehner told reporters he plans to get as much done as he can before he leaves . President Barack Obama said he hoped Mr. Boehner would try to get as much done as possible in the next month and pledged to help him do that.What happens to the government in December will be determined by Mr. Boehner's successor.If House Republicans choose a new speaker who favors more confrontations with the White House, the outcome could be either a partial government shutdown or a full-year stopgap spending bill—an option that the Defense Department, in particular, opposes unless the measure is written to allow new programs to begin.Whoever gets the speaker's gavel may feel obliged to promise the conservative wing of the party a willingness to go all the way to a shutdown to achieve goals such as ending funding for Planned Parenthood.For years, there has been speculation that Mr. Boehner would strike a grand compromise with Obama and the Democrats and then resign. The first part of that—a push for a grand bargain on tax and entitlement spending, as he tried to negotiate in 2011—is probably out of reach given the proximity of the next elections.More in realm of possibility before Boehner leaves is a smaller agreement, perhaps on the debt ceiling and reviving the Export-Import Bank. If not, all bets are off.Here are some of the deadlines to watch during the House leadership transition:EX-IM: The charter for the Export-Import Bank of the U.S. was allowed to lapse on June 30. Some Republicans and small- government groups oppose reauthorization, saying Ex-Im benefits only a few large corporations and that its activities should be left to the private sector. Boehner backed the Ex-Im's renewal.Two key decision-makers, Majority Leader Kevin McCarthy and Financial Services Chairman Jeb Hensarling, are Ex-Im opponents.OPIC: The Overseas Private Investment Corp.'s authorization runs through Sept. 30. Republicans have been divided over whether the loan-guarantee agency should continue. Last year, 116 House Republicans voted against reauthorization.DEBT LIMIT: The Treasury Department has been using so- called \"extraordinary measures\" to juggle the government's cash flow. Secretary Jacob Lew has said that borrowing authority needs to be raised before late October or else the U.S. could default on its obligations.In 2011, the government was pushed to the brink of default in a dispute over a debt-limit extension.HIGHWAY BILL: Highway, transit and road safety programs are currently authorized only through Oct. 29. Lack of action could cause programs financed through the the Highway Trust Fund to shut down, partially or completely. The chief complication is that the fuel taxes that provide the bulk of Highway Trust Fund revenue haven't been increased in more than two decades and haven't kept up with growing infrastructure needs, better fuel efficiency and changing driving patterns.Agreement on sustainable funding streams—such as shifting to a vehicle-miles-traveled system—has been difficult, and leading House Republicans have discussed using corporate tax changes to fund a long-term bill, though so far no plan has been unveiled.TAX BREAKS, NUTRITION: The race to be speaker -- and a possibly more contentious battle for the majority leader spot -- could determine the ability of Congress to renew dozens of tax breaks that expired at the end of 2014 and to come to a compromise on reauthorizing $30 billion in nutrition programs that expire Sept. 30.", "external_links": [], "published": "2015-09-25T22:15:00.000+03:00", "crawled": "2015-09-26T03:42:56.688+03:00", "highlightTitle": ""}