{"organizations": [], "uuid": "f884c0a7c28758c8ae7485ee5633d9bfa548c3b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/30/brazil-economy-budget-idUSL1N12016Q20150930", "country": "US", "title": "UPDATE 1-Brazil's budget deficit narrows well below market expectations", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Brazil's budget deficit narrows well below market expectations | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:16:00.000+03:00", "replies_count": 0, "uuid": "f884c0a7c28758c8ae7485ee5633d9bfa548c3b1"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/30/brazil-economy-budget-idUSL1N12016Q20150930", "ord_in_thread": 0, "title": "UPDATE 1-Brazil's budget deficit narrows well below market expectations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Recast, adds data details and context)\nBy Alonso Soto\nBRASILIA, Sept 30 (Reuters) - Brazil's primary budget deficit in August was half what markets expected, in a brief reprieve for President Dilma Rousseff who is struggling to rebalance public accounts and regain investors' trust.\nBrazil posted a primary budget deficit of 7.310 billion Brazilian reais ($1.83 billion) in August, well below the gap of 14.45 billion reais expected by analysts surveyed by Reuters. The commodities' powerhouse had a deficit of 10.01 billion in July.\nA drop in public expenditures, mostly on unemployment benefits, helps explains the smaller primary deficit in August but the country's fiscal accounts remain in disarray after years of heavy spending and hefty tax cuts.\nRousseff's inability to shore up the country's finances after losing control over her alliance in Congress has hit investors' confidence, driving down the real to its weakest ever and raising borrowing costs.\nSo far this year the government has accumulated a primary deficit of 1.1 billion reais or the equivalent of 0.03 percent of the gross domestic product. The government set a 2015 surplus goal of 0.15 percent of GDP.\nThe central bank and national treasury have had to intervene in markets to tame currency volatility that threatens Brazilian companies already struggling after three years of lackluster growth.\nRousseff's political strength will be tested yet again later on Wednesday when Congress decides on key vetoes that would prevent a surge in public spending in coming years.\nEven if lawmakers uphold her vetoes, analysts believe she is unlikely to convince congressional allies to support tax increases and spending cuts needed to avoid an expected primary deficit next year.\nThe ongoing political crisis stoked by a massive corruption investigation involving her Workers' Party and other allies, combined with a deepening recession, led Standard & Poor's to strip Brazil of its investment-grade rating earlier this month.\nPolicymakers are racing to prevent other agencies from downgrading Brazil to avoid capital flight.\nIn the 12 months through August, the primary budget deficit narrowed to an equivalent to 0.76 percent of gross domestic product from 0.89 percent in the year ended in July. ($1 = 3.9837 Brazilian reais) (Additional reporting by Marcela Ayres; Editing by Jeffrey Benkoe and Christian Plumb )", "external_links": [], "published": "2015-09-30T19:16:00.000+03:00", "crawled": "2015-09-30T18:24:00.128+03:00", "highlightTitle": ""}