{"organizations": [], "uuid": "0b273496f6d7676cb9df4d6bea1345c3c8bd9c54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/09/budgeting.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/10-ways-fear-out-budgeting/", "country": "US", "title": "10 Ways to Take the Fear Out of Budgeting", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "10 Ways to Take the Fear Out of Budgeting", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T12:00:00.000+03:00", "replies_count": 0, "uuid": "0b273496f6d7676cb9df4d6bea1345c3c8bd9c54"}, "author": "Ashley Redmond", "url": "http://www.gobankingrates.com/personal-finance/10-ways-fear-out-budgeting/", "ord_in_thread": 0, "title": "10 Ways to Take the Fear Out of Budgeting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Ashley Redmond September 22, 2015 \nEven those who have committed to a budget find the process difficult. One in five Americans say their biggest financial challenge is sticking to a budget, according to GOBankingRates 2015 Life + Money Survey. \nBut budgeting does not have to be scary. There are numerous ways to make a friendly budget that caters to your individual needs. \nAnd the payoff is worth the effort. The Life + Money Survey found that one in five Americans named always living paycheck-to-paycheck as their biggest financial fear. Budgeting can give you the financial discipline to save enough money to keep such fears at bay. \nFollowing are 10 ways to take the fear out of creating a monthly budget. \nRelated: 17 Biggest Budgeting Mistakes You’re Making 1. Visualize Yourself Reaching the Goal \nClose your eyes. Picture yourself walking around and smiling because all of your debt is paid off. Your credit card is in your wallet and it has a zero balance. You know how much money is in your checking account, and you even have some money in your savings account. \nHow amazing does that feel? Jim Afremow, a sports psychology specialist for Arizona State University, calls this technique “visualize to actualize.” \nVisualizing helps turn your ideal image into reality. Use this technique as motivation to propel you toward your financial goal . 2. Set Small Financial Goals \nBy making financial goals smaller, they automatically become more attainable. For example, a small goal could be starting an emergency fund, paying down your credit card or saving for a down payment. \nIn fact, according to Forbes, research has shown that setting overly ambitious goals is a surefire way of not doing what you set out to do. \nKeep in mind that financial goals vary by generation. For example, GOBankingRates Life + Money Survey found that older millennials (ages 25 to 34) are more concerned with saving for a home than any other age group. 3. Share Your Financial Journey on Social Media \nAnnounce your financial goals on social media, whether it’s via Twitter, Facebook or YouTube. Let the world know your budgeting plans and show them your progress. \nThis will help keep you accountable. Paula Pant writes in U.S. News & World Report’s The Frugal Shopper blog that public accountability is a great tool for keeping you on your game. Plus, it doesn’t seem like bragging if you share both the frustrations and the victories. \nYou may even want to consider starting your own blog. This may be beneficial because there’s a strong community of supportive bloggers focused on budgeting. 4. Track Your Spending \nIf you are new to budgeting, start by tracking your spending, said Brittney Castro, founder and CEO of Financially Wise Women. \n“You need to track your income and expenses to get a solid idea of where you are spending your money,” she said. “Try tracking this for a three-month period because some months are anomalies and you just need the average.” \nWhen tracking, focus on two main areas: How much money is coming into the household every month, and how much is going out. \nAt GetRichSlowly, Holly Johnson stresses the importance of being honest with yourself. If you are shocked by some results, try and remember that the goal is to improve your financial life. Embrace it. 5. Use 50/20/30 \nOnce you have tracked your expenses, Castro says you should see how they measure up to a 50/20/30 guideline. She says your spending should be divided up as follows: Fixed expenses ( mortgage , rent, insurance): 50 percent Fun (dining out, Jay-Z concert — anything you want): 30 percent Financial obligations (extra debt payment, emergency cash and retirement): 20 percent \n“When comparing your expenses against the 50/20/30 ask yourself, ‘Where do I fall?’ And, ‘Where should I focus my attention?’” said Castro. 6. Get the Whole Family Involved \nTeach everybody in the family the basics about savings and living within their means. \n“You may not necessarily want them involved in all conversations, but it’s important to give them the broad scope of the family household budget,” said Castro. 7. Download Budgeting Apps \nCastro said most of the available budgeting apps are pretty good. \n“You just have to find one that works for you and stick with it,” she said. \nExamples of budgeting apps include: Pageonce Money and Bills Expensify BlackGold \nCastro urges you to remember that downloading an app is the beginning of the process, not the end. \n“Just because you download the app doesn’t mean you’ll stick to your budget,” she says. \nWhatever app you choose, make sure you follow the budget that you implement. \nRelated: 10 Best Free Apps for Managing Your Bank Accounts 8. Make a Money Date \nA money date is a predetermined time when you review your budget. Castro suggests making a habit of a weekly one-hour review. \n“Most people say I will do my budget tomorrow or maybe next week, but if you set a weekly money date it becomes more bite-sized,” said Castro. 9. Get Familiar With Free Activities \nRemember when you were little and the best activities were free? Well, going to the beach or hanging out in a park all day still does not cost you. \nGoogle free activities in your city or town. A quick Web search may yield some surprising results. \nDo you have an artsy family and live in Illinois? The Art Institute of Chicago is free for Illinois residents on Thursday evenings from 5-8 p.m. And kids under 14 always get in free. \nFigure out what activities are free in your city and mark down those that interest you, or your family and friends. 10. Accept That Failure is OK \nSometimes, you have to be bad at something before you get better at it. You may not hit your budgeting goals the first time around. \nFailure can be merely a step in the process of creating success. \nTurn your failure into improvement. Think of the places where you mess up on your budget as signs pointing to opportunities to improve. \nShare This Article", "external_links": [], "published": "2015-09-22T12:00:00.000+03:00", "crawled": "2015-09-22T17:15:45.904+03:00", "highlightTitle": ""}