{"organizations": [], "uuid": "f9a5cf11d6e1f38b3207e41f120552e9cb8a3534", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/miners-hardest-hit-us-jobs-190219639.html", "country": "GB", "title": "Miners hardest hit, as US jobs data drags stock markets lower", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Miners hardest hit, as US jobs data drags stock markets lower", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T22:02:00.000+03:00", "replies_count": 0, "uuid": "f9a5cf11d6e1f38b3207e41f120552e9cb8a3534"}, "author": "", "url": "https://uk.finance.yahoo.com/news/miners-hardest-hit-us-jobs-190219639.html", "ord_in_thread": 0, "title": "Miners hardest hit, as US jobs data drags stock markets lower", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 4, 2015, 22:20 BST - UK Markets closed Miners hardest hit, as US jobs data drags stock markets lower By Tara Cunningham | Telegraph – 2 hours 17 minutes ago 8.6001 +0.3801 \nMining stocks became the biggest laggards on the FTSE 100, as US jobs data dragged global stock markets into the red. \nMining companies crashed to the bottom of Britain’s benchmark index, reversing gains made in the previous trading session, after the latest round of US jobs data suggested a Federal Reserve interest rate hike continues to look possible in September. \nJPMorgan Cazenove targeted the sector slashing the target price of both Anglo American and BHP Billiton (NYSE: BBL - news ) , while noting Glencore’s shares are “now pricing dire outcomes”, falling 58pc since May. In the near-term, Dominic O’Kane, of JPMorgan Cazenove reckons there is scope for a positive correction, but in the longer term Glencore (Xetra: A1JAGV - news ) is still overleveraged. Mr O’Kane said to mitigate credit risk Glencore would need to cut its $2.3bn dividend and reduce its working capital by about $5bn. Glencore fell 6pc to 123.2p, Anglo American (LSE: AAL.L - news ) was down by 7.8pc at 668.5p, Antofagasta (Other OTC: ANFGF - news ) slipped 5.4pc to 564.5p and BHP BIlliton was off by 5.2pc at £10.52. \nA risk-averse mood engulfed equity markets in early trade, as market jitters returned, ahead of US jobs figures. However, the weaker-than-anticipated US jobs growth dragged financial markets worldwide lower. The FTSE 100 closed at 6,042.92 - its lowest level since January 2013 - recording a weekly loss of 205.02 points, or 3.3pc. \nA day after climbing higher on the back of a dovish message from the European Cental Bank , European bourses also suffered, with the CAC and DAX slumping 2.8pc and 2.7pc, respectively. While Chris Beauchamp, of IG (LSE: IGG.L - news ) said “it looks like US data might provide the rationale for a rate increase this month, although the decision is finely-poised”, he warned of a complicated week ahead. \n“A US bank holiday could prompt a fairly dull session in Europe without US traders to lighten the mood, but the reopening of Chinese markets may see another selloff as Chinese investors return to the fray,” he said. \nShares (Berlin: DI6.BE - news ) in retailer Next (Other OTC: NXGPF - news ) also plunged after a bearish broker note and weak retail sales figures dragged the stock lower. Exane BNP Paribas published a cautious-note on the general retail sector, in which it downgraded Next from 'neutral’ to 'underperform’, as analysts said currency fears continue to dominate their short-term views. \nDespite employment growth and wage inflation in the UK over the last two years, which has coincided with falling commodity costs, retailers have only seen 47p of the extra £1 in consumers’ pockets, the bank said. Consumers are instead diverting their spending towards leisure activities. “The incremental pound is being increasingly directed towards leisure - a phenomenon familiar in periods of economic stability,” Simon Bowler, of Exane BNP Paribas said. \nAlthough Mr Bowler highlights that Next is “well-positioned to adapt to changing consumer shopping habits”, he believes currency headwinds will be more significant than expected. Separately, BDO’s high street sales tracker, which showed retail sales fell by 4.3pc in August , added to Next’s woes as the stock tumbled 245p, or 3.1pc, to £75.95. \nThe bank also targeted Dixons Carphone (Other OTC: DSITF - news ) slashing its target price by 7pc to 510p, citing the changing the changing landscape among UK telecoms and the weakening Nordic currencies. It (Other OTC: ITGL - news ) closed 18.6p lower at 412.3p. * Tube strike dealt a heavy blow to London's retailers (Other OTC: UBGXF - news )", "external_links": [], "published": "2015-09-04T22:02:00.000+03:00", "crawled": "2015-09-05T00:20:45.354+03:00", "highlightTitle": ""}