{"organizations": [], "uuid": "631b953bb18b8ba9b7e86a4ed58ef3d4fd3dc06c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business/Finance", "url": "http://www.menafn.com/1094325074/Eton-Institutes-CEO-Lays-Down-the-Learning-Gauntlet-and-goes-Back-to-School?src=RSS", "country": "US", "title": "Eton Institutes CEO Lays Down the Learning Gauntlet and goes Back to School", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Eton Institutes CEO Lays Down the Learning Gauntlet and goes Back to School | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "631b953bb18b8ba9b7e86a4ed58ef3d4fd3dc06c"}, "author": "Press", "url": "http://www.menafn.com/1094325074/Eton-Institutes-CEO-Lays-Down-the-Learning-Gauntlet-and-goes-Back-to-School?src=RSS", "ord_in_thread": 0, "title": "Eton Institutes CEO Lays Down the Learning Gauntlet and goes Back to School", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Eton Institute's CEO embarks on a 3-year business and leadership program at Harvard Business School this September, continuing his learning journey and his 100% commitment to realizing the potential of the company he founded nearly a decade ago.\n\nReflecting the Harvard Business School's commitment to foster lifelong learning and strengthen individual leadership capabilities, the program for business owners and entrepreneurs is designed to improve leadership effectiveness, build strategic consensus, and gain the skills necessary to position companies for future success.\n\n\"When I started the journey of Eton Institute in 2006, my aim was to find talented, like-minded people to help deliver affordable, accessible learning to communities. Today, we have over 300 people across 4 continents doing just that,\" reflected Dr. Eli Abirached, CEO and owner of Eton Institute.\n\n\"What inspires me the most is working with my team to find new ways to learn, and inspire others to do the same. In 2013, I climbed Kilimanjaro as part of our campaign to raise money for Friends of Cancer Patients. In 2014, I climbed Mont Blanc in support of our Summer for Change campaign. This year, I have set myself a new challenge, to safeguard my company and my customers in the coming years in a competitive global arena. The HBS mission \"to educate leaders who make a difference in the world\" resonates very strongly with the vision I have always had for Eton Institute,\" continued Dr. Abirached.\n\nAbout to be immersed in the renowned HBS case method, thought-provoking lectures and enlightening group discussions, Eton Institute's CEO will explore topics such as Executing Effective Strategies, Managing Disruptive Innovation, Leveraging Markets to Create Value and Navigating the Global Economy. The underlying theme will be to find innovative ways to address challenges and create assets.\n\n\"It's not just an individual journey. The opportunity for the team to be part of a truly global alumni network is very exciting. We are a company that loves learning and sharing what we learn to make a difference, and such global connectivity represents a game changer for any business,\" stated Sue Brett, Vice President Marketing and Business Development at Eton Institute.\n\nThe HBS alumni network taps into a global resource of more than 78,000 MBA and Executive Education alumni in 167 countries. Participants represent a broad range of industries and organizations and hail from countries around the world, providing a network with accomplished business leaders worldwide. \n\nAbout Eton Institute \nEton Institute is globally recognized as a leader in learning and development solutions, offering Professional Development Training, courses in over 100 Languages, Teacher Training and Computer Training internationally throughout the Americas, East Asia, Europe, Middle East and South Asia. With a dedicated team of professionals developing highly customized programs, Eton Institute features the most sought after training methodologies and techniques, and is proud to be associated with top international thinkers to successfully provide organizational change for over 2,000 clients globally. It offers flexible timings and uniquely tailored courses to suit the learner's needs. All training is facilitated by highly qualified and experienced instructors, teaching practical skills while maintaining competitive prices for individuals and businesses. Eton Institute is an Approved Center for the delivery of Cambridge Exams and City and Guilds business qualifications. Additionally all language courses offered by Eton Institute are EAQUALS-accredited and meet Common European Framework of Reference (CEFR) standards set by Council of Europe.", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-01T15:15:26.395+03:00", "highlightTitle": ""}