{"organizations": [], "uuid": "69fedc8dba908992ca0a3b55d8fe854b718d8d94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-08/ukraine-bondholder-group-seeks-to-change-templeton-led-debt-deal", "country": "US", "title": "Ukraine Bondholder Group Seeks to Change Templeton Debt Deal", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Ukraine Bondholder Group Seeks to Change Templeton Debt Deal - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T23:28:00.000+03:00", "replies_count": 0, "uuid": "69fedc8dba908992ca0a3b55d8fe854b718d8d94"}, "author": "Natasha Doff", "url": "http://www.bloomberg.com/news/articles/2015-09-08/ukraine-bondholder-group-seeks-to-change-templeton-led-debt-deal", "ord_in_thread": 0, "title": "Ukraine Bondholder Group Seeks to Change Templeton Debt Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A group of bondholders owning Ukrainian Eurobonds maturing this year called on other investors to seek changes to the terms of a restructuring deal agreed upon last month by the government and a committee of its largest creditors led by Franklin Templeton.\nThe group, represented by law firm Shearman & Sterling LLP, is asking Franklin Templeton to allocate the restructured bonds in such a way that maturities on all Eurobonds are extended by approximately four years, according to a letter to bondholders sent by e-mail. That compares with plans to give all holders an equal share in nine notes maturing from 2019 to 2027, according to the law firm.\nUkraine reached a deal last month with the Templeton-led creditor committee holding about half of the country’s $18 billion Eurobonds. Finance Minister Natalie Jaresko is awaiting parliamentary sign-off on the agreement, which also includes a 20 percent reduction to face value, higher average interest payments and warrants that would pay holders if the nation’s economy regains traction. It will then be sent to other bondholders for approval.\n“Our clients consider this approach unfair, because it would defer the average maturity by more than eight years for the existing bonds due 2015,” the law firm said in the letter, without naming any members of the group or say how many bonds its members own. A “uniform extension of maturities can be easily accomplished, at no cost to Ukraine,” it said.\n‘Fair’ Allocation The current deal involves issuing nine new bonds of equal size due annually from 2019 to 2027. If all bondholders got the same share of each security, then the investors in the 2015 debt would effectively be accepting an average deferral of payment of more than eight years, versus half a year for holders of 2023 debt, according to Shearman & Sterling.\nThis would \"not be reasonable,\" it said. \"The bondholder group our clients have formed would call upon the Franklin Group to allocate the new bonds fairly and thus clear the path for a smooth approval of the proposed restructuring.\"\nThe letter called on any investors owning at least $20 million of the country’s bonds maturing this month and the next to join the group. Ukraine has $500 million in dollar-denominated bonds maturing Sept. 23 and a 600 million-euro ($671 million) note due Oct. 13.\n“The bondholders pursuing this strategy must have at least attempted to build a blocking stake, so there is a risk that there will be holdouts on this bond,” said Dmitri Petrov, a London-based analyst at Nomura Holdings Inc.\nA blocking stake is 25 percent or more of any bond.", "external_links": [], "published": "2015-09-08T23:28:00.000+03:00", "crawled": "2015-09-08T21:29:43.143+03:00", "highlightTitle": ""}