{"organizations": [], "uuid": "401e54b4ce5fc111e22d49c70b35751f43affd0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://media.marketwire.com/attachments/201408/269364_IFACNewLogo.jpg", "site_section": "http://www.marketwire.com/rss/mwFSPF.xml", "section_title": "Marketwired - Personal Finance", "url": "http://www.marketwired.com/press-release/urgent-questions-concerning-regulations-impact-on-growth-innovation-ifac-global-study-2053474.htm", "country": "CA", "title": "Urgent Questions Concerning Regulation's Impact on Growth, Innovation: IFAC Global Study", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "Urgent Questions Concerning Regulation's Impact on Growth, Innovation: IFAC Global Study", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T18:50:00.000+03:00", "replies_count": 0, "uuid": "401e54b4ce5fc111e22d49c70b35751f43affd0e"}, "author": "", "url": "http://www.marketwired.com/press-release/urgent-questions-concerning-regulations-impact-on-growth-innovation-ifac-global-study-2053474.htm", "ord_in_thread": 0, "title": "Urgent Questions Concerning Regulation's Impact on Growth, Innovation: IFAC Global Study", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SOURCE: International Federation of Accountants September 08, 2015 11:50 ET Urgent Questions Concerning Regulation's Impact on Growth, Innovation: IFAC Global Study \nNEW YORK, NY--(Marketwired - Sep 8, 2015) - Regulation has become immensely complex and is impacting organizations' opportunities to grow and innovate, according to the Global Regulation Survey , a study of accounting, finance, and business professionals conducted by the International Federation of Accountants (IFAC). \nApproximately two-thirds of respondents said regulation is having a significant or very significant impact on their organizations' opportunities to grow and innovate. About four in five respondents reported that the regulation impacting their organizations is complex or very complex; that it has become more or much more significant over the past five years; and that it has a substantial impact on their organizations' cost of doing business. \n\"Good regulation is essential to the fairness, efficiency, and effectiveness of economies, and making it work as well as it can is a never-ending mission,\" IFAC Chief Executive Officer Fayez Choudhury said. \"Growth remains a concern globally, and these results should be a wakeup call for us to examine the impact of regulation, including the regulation and reform introduced in response to the global financial crisis.\" \nThe findings come as the combined effects of global, regional, national post-crisis reforms begin to be felt by organizations, as well as the financial markets. \"For many organizations, Basel III, recent EU reforms, Dodd-Frank, and multiple other sector- and country-specific regulations are all coming into play at once, and the scope of each is substantial,\" Mr. Choudhury said. For example, Glass-Steagall, instituted in 1933 following the Great Depression, was 37 pages, compared with Dodd-Frank's more than 2,000 pages in 2010. The first Basel Accord, introduced in 1988, had seven risk categories and required seven calculations; Bank of England Chief Economist Andrew Haldane has remarked on Basel III's more than 200,000 risk categories, and more than 200,000,000 calculations. \nThe results also demonstrate that the regulatory approach across different regions is inconsistent, and almost half of respondents reported that collaboration between regulators is ineffective. \nFour in five respondents expect the impact of regulation will continue to become more or much more significant in the next five years. \n\"There are urgent questions surrounding regulation's impact on growth and innovation, as well as how its complexity is affecting the agility needed to face emerging risks and potentially the next financial crisis,\" Mr. Choudhury said. \"IFAC aims to collaborate with policy makers, regulators, and the organizations impacted to examine these questions and probe the impacts as a major priority.\" \nThe Global Regulation Survey polled 313 accounting, finance, and business professionals in organizations ranging from small and medium entities to very large entities, operating in a wide range of industry sectors on six continents. The survey was conducted during July and August 2015. \nAbout IFAC IFAC is the global organization for the accountancy profession, dedicated to serving the public interest by strengthening the profession and contributing to the development of strong international economies. It is comprised of more than 175 members and associates in 130 countries and jurisdictions, representing over 2.8 million accountants in public practice, education, government service, industry, and commerce. Contact Information", "external_links": [], "published": "2015-09-08T18:50:00.000+03:00", "crawled": "2015-09-08T19:38:38.491+03:00", "highlightTitle": ""}