{"organizations": [], "uuid": "309ab63dcb05d0f935604a60ef8b5518daa32efc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-JZ876_NYOFFI_G_20150825154606.jpg", "site_section": "http://www.wsj.com/news/markets", "section_title": "Stock Market &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/new-york-city-office-construction-heats-up-1440561661", "country": "", "title": "New York City Office Construction Heats Up", "performance_score": 0, "site": "wsj.com", "participants_count": 3, "title_full": "New York City Office Construction Heats Up - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T08:01:00.000+03:00", "replies_count": 2, "uuid": "03fac5cc0b3485c0d0842b01c81b71ba54808604"}, "author": "Keiko Morris", "url": "http://www.wsj.com/articles/new-york-city-office-construction-heats-up-1440561661#post-0", "ord_in_thread": 0, "title": "New York City Office Construction Heats Up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "3 COMMENTS Construction of new office space in New York City is on track to hit a 25-year high this year and almost double that built in 2014, reflecting increasing employment and low interest rates, according to a new report by the New York Building Congress.\nBig development sites at Hudson Yards on the West Side and the World Trade Center in lower Manhattan are helping to boost the pace of office construction, which is expected to reach 4.3 million square feet in 2015, the report said. That is a 79% increase from the 2.4 million square feet built in 2014 and the highest level since 1990.\nOffice construction had been a laggard during the economic recovery, but that is changing as employment in office-using industries picks up, said Richard T. Anderson, president of the Building Congress, which promotes the construction industry. In 2015 and 2016, the report projects, 9.7 million square feet of new office space will be constructed in 19 buildings across Manhattan. The report’s analysis includes office space in buildings still under construction.\nENLARGE “Over the last 50 to 60 years, office construction has had some real peaks and valleys,” Mr. Anderson said. “We are coming out of a valley, and there is plenty of room for growth.”\nThe Building Congress expects the pace of office construction to pick up in the next two years, reaching 5.4 million square feet in 2016 and 4.9 million in 2017. The group expects 4 million square feet to be constructed in 2018. The development community is bullish, Mr. Anderson said.\nThe wave of new construction has also prompted office landlords to boost investment in renovations, the report said. Alteration and renovation projects valued at $1.7 billion were started in the first half of this year, up from $1.2 billion a year earlier, the report said. Such projects totaled $2.7 billion for all of 2014, up from $2.2 billion in 2013 and $1.3 billion in 2012.\nBusiness confidence and employment growth are among the main drivers of office construction, real-estate economists and researchers said. From the city’s low point in August of 2009, the city has gained 184,000 office jobs, according to Cushman & Wakefield Inc., a major broker of office space.\nCompanies are now looking for ways to use space more efficiently and as a way of attracting employees, said Ken McCarthy, Cushman’s senior managing director of economic analysis and forecasting.\nThe new office buildings “are built to handle more people, and that’s attractive to a lot of tenants,” Mr. McCarthy said. “So where there is new construction, we are seeing tenants commit to them.”\nWhile the report’s findings reflect the city’s healthy economy and employment picture, some analysts are cautious about the long-term impact of all the new space on the office market.\nAlthough the employment level for office-using industries in Manhattan is about the same as in 2000, these sectors occupy 9.8% less space, said Heidi Learner, chief economist for real-estate-services firm Savills Studley. “The type of firms we are seeing grow in Manhattan are a lot of tech firms with open floor plans, and don’t necessarily allocate 400 square feet of offices to senior-level employees.”\nThe stock market’s volatility this week is something to watch but not to overemphasize, Mr. McCarthy said.\n“The one concern is, how does it impact financial services, which is a big employer here and has been coming back,” Mr. McCarthy said, “which is why I think we need to keep an eye on it but not put too much weight on it.”\nA possible office glut as a result of the anticipated new construction isn’t a major concern, said Richard Persichetti, vice president of research and marketing at real-estate-services firm DTZ. The 9.7 million square feet of office space expected to be built in 2015 and 2016 is only a fraction of Manhattan’s total office inventory of roughly 400 million square feet, he said.\nThe new construction is necessary to serve tenants’ needs, especially with Manhattan’s aging office buildings. More than two-thirds of them were built before 1970, Mr. Persichetti said, making some of them prime candidates for conversion into residential buildings.\n“Basically, the older, less-desirable office products now become more desirable for an investor and developers,” said Mr. Persichetti, “especially with the hot residential market we have.”\nWrite to Keiko Morris at Keiko.Morris@wsj.com", "external_links": ["http://si.wsj.net/public/resources/images/NY-DS373_NYOFFI_9U_20150825182109.jpg", "http://si.wsj.net/public/resources/images/NY-DS373_NYOFFI_16U_20150825182109.jpg"], "published": "2015-08-26T08:01:00.000+03:00", "crawled": "2015-09-01T19:46:38.860+03:00", "highlightTitle": ""}