{"organizations": ["Prudential Mortgage Capital Company"], "uuid": "6f0420e4538dfc0ac25d0cf7ab5ed12098596235", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-insurance/?format=rss", "section_title": "Insurance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/prudential-mortgage-capital-company-provides-151200391.html", "country": "US", "title": "Prudential Mortgage Capital Company provides a $241 million loan to Access Self Storage Limited in the United Kingdom", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Prudential Mortgage Capital Company provides a $241 million loan to Access Self Storage Limited in the United Kingdom", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T18:12:00.000+03:00", "replies_count": 0, "uuid": "6f0420e4538dfc0ac25d0cf7ab5ed12098596235"}, "author": "", "url": "https://uk.finance.yahoo.com/news/prudential-mortgage-capital-company-provides-151200391.html", "ord_in_thread": 0, "title": "Prudential Mortgage Capital Company provides a $241 million loan to Access Self Storage Limited in the United Kingdom", "locations": ["United Kingdom"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 22, 2015, 17:59 BST - UK Markets closed Prudential Mortgage Capital Company provides a $241 million loan to Access Self Storage Limited in the United Kingdom Press Release : Prudential Financial, Inc. – 1 hour 47 minutes ago -1.99 \nLONDON--(BUSINESSWIRE)-- \nPrudential Mortgage Capital Company has closed a $241 million (£155 million) partial refinancing of Access Self Storage Limited on behalf of Enddora Holdings Limited and Birchal Limited Partnership. Prudential Mortgage Capital Company is the commercial mortgage lending business of Prudential Financial, Inc. (NYSE:PRU). \nThe fixed rate loan, with a term of more than 10 years, is secured by a portfolio of properties located in Greater London, the Midlands and the South. \n“Access Self Storage is a recognizable brand within the self storage landscape, which continues to expand its presence within Greater London and the UK. Prudential Mortgage Capital was able to offer Enddora Holdings Limited and Birchal Limited Partnership a long term loan while providing sufficient structural flexibility that allows the team to execute their business plan unhindered,” said Aaron Knight, director of European originations at Prudential Mortgage Capital, which does business in the UK and Europe as Pricoa Mortgage Capital. \nThis is the latest transaction following on from the £270m Watermark Place loan completed by Prudential Mortgage Capital in July 2015, reflecting an increased borrower appetite for long-term, fixed-rate senior debt. \nAndrew de la Haye, a Director of Enddora Holdings Limited and Birchal Limited Partnership, commented: \"A long-term debt relationship is paramount to the execution success of the business plan for Access. In Prudential, the business has found a solid long-term partner to help it achieve its operational objectives.\" \nBryan McDonnell, head of European originations for Prudential Mortgage Capital commented, “As a long term holder of our own debt, this is another example of our ability to tailor our debt to the needs of our Borrowers.” \nPrudential Mortgage Capital Company is a national full-service, commercial and multifamily mortgage finance business with more than $87.3 billion in assets under management and administration as of June 30, 2015. Leveraging a 135-year history of real estate finance, the company offers one of the most comprehensive lines of real estate finance products and originates loans for Fannie Mae DUS®, Freddie Mac Program Plus® and specialized affordable housing programs; FHA; Conduit; Prudential’s general account and proprietary balance sheet program; and other institutional investors. The company maintains a loan servicing portfolio of approximately $85.0 billion, as of June 30, 2015. For more information, please visit http://www.prumortgagecapital.com . \nPrudential Financial, Inc. (NYSE:PRU), a financial services leader with more than $1 trillion of assets under management as of June 30, 2015, has operations in the United States, Asia, Europe, and Latin America. Prudential’s diverse and talented employees are committed to helping individual and institutional customers grow and protect their wealth through a variety of products and services, including life insurance, annuities, retirement-related services, mutual funds and investment management. In the U.S., Prudential’s iconic Rock symbol has stood for strength, stability, expertise and innovation for more than a century. For more information, please visit www.news.prudential.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20150922006091/en/ Contact", "external_links": [], "published": "2015-09-22T18:12:00.000+03:00", "crawled": "2015-09-22T20:01:02.632+03:00", "highlightTitle": ""}