{"organizations": ["Mechel", "VTB Mechel", "Mechel OAO", "VTB"], "uuid": "989357fe671a8f54ee2d1b4f9c2d30608cbfc227", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/213469?filename=213469.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/17/Financing%20Agreements", "section_title": "GlobeNewswire: Financing Agreements", "url": "http://globenewswire.com/news-release/2015/09/09/767118/10148756/en/Mechel-Reports-Restructuring-Loan-With-VTB.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "country": "US", "title": "Mechel Reports Restructuring Loan With VTB", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Mechel Reports Restructuring Loan With VTB", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T17:00:00.000+03:00", "replies_count": 0, "uuid": "989357fe671a8f54ee2d1b4f9c2d30608cbfc227"}, "author": "", "url": "http://globenewswire.com/news-release/2015/09/09/767118/10148756/en/Mechel-Reports-Restructuring-Loan-With-VTB.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "ord_in_thread": 0, "title": "Mechel Reports Restructuring Loan With VTB", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mechel Reports Restructuring Loan With VTB September 09, 2015 10:00 ET | Source: Mechel OAO \nMOSCOW, Sept. 9,   Mechel OAO (MICEX:MTLR) (NYSE: MTL ), one of the leading Russian mining and metals companies, reports restructuring its loan with VTB Bank totaling approximately 70 billion rubles. \nMechel OAO and the group's enterprises – Southern Kuzbass Coal Company OAO, Yakutugol Holding Company OAO and Chelyabinsk Metallurgical Plant PAO – act as borrowers on the loans. \nThe loan agreements set the grace period until April 2017 and loan maturity in April 2020 to be paid in monthly installments. \n\"I am glad that our complicated negotiations with Mechel are successfully over. I hope that the banks' new conditions will allow Mechel Group, which we have worked with for many years, to continue implementation of its investment projects and fulfill all its obligations,\" President and Chairman of VTB Bank Management Board Andrey Kostin said. \n\"We are grateful to VTB for its support. This restructuring will enable the company to service its debt even in these times that are difficult for the global commodity market. Mechel will do all it can to fulfill its obligations in compliance with the agreements we have reached and will continue the development of our Far East projects,\" Chairman of Mechel OAO's Board of Directors Igor Zyuzin said. \nMechel is an international mining and steel company which employs 67,000 people. Its products are marketed in Europe, Asia, North and South America, Africa. Mechel unites producers of coal, iron ore concentrate, steel, rolled products, ferroalloys, heat and electric power. All of its enterprises work in a single production chain, from raw materials to high value-added products. \nSome of the information in this press release may contain projections or other forward-looking statements regarding future events or the future financial performance of Mechel, as defined in the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. We wish to caution you that these statements are only predictions and that actual events or results may differ materially. We do not intend to update these statements. We refer you to the documents Mechel files from time to time with the U.S. Securities and Exchange Commission, including our Form 20-F. These documents contain and identify important factors, including those contained in the section captioned \"Risk Factors\" and \"Cautionary Note Regarding Forward-Looking Statements\" in our Form 20-F, that could cause the actual results to differ materially from those contained in our projections or forward-looking statements, including, among others, the achievement of anticipated levels of profitability, growth, cost and synergy of our recent acquisitions, the impact of competitive pricing, the ability to obtain necessary regulatory approvals and licenses, the impact of developments in the Russian economic, political and legal environment, volatility in stock markets or in the price of our shares or ADRs, financial risk management and the impact of general business and global economic conditions. Mechel OAO Ekaterina Videman Tel: + 7 495 221 88 88 Related Articles", "external_links": [], "published": "2015-09-09T17:00:00.000+03:00", "crawled": "2015-09-09T19:52:15.023+03:00", "highlightTitle": ""}