{"organizations": [], "uuid": "2caf3afc6298e159f049ef853f4f3c2593abf6a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KN650_NYYOGI_G_20150929110721.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/yankees-pay-homage-to-baseball-legend-yogi-berra-1443540245", "country": "", "title": "Yankees Pay Homage to Baseball Legend Yogi Berra", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "Yankees Pay Homage to Baseball Legend Yogi Berra - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T19:24:00.000+03:00", "replies_count": 0, "uuid": "2caf3afc6298e159f049ef853f4f3c2593abf6a7"}, "author": "Zolan Kanno-Youngs", "url": "http://www.wsj.com/articles/yankees-pay-homage-to-baseball-legend-yogi-berra-1443540245", "ord_in_thread": 0, "title": "Yankees Pay Homage to Baseball Legend Yogi Berra", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS MONTCLAIR, N.J. -- One of Yogi Berra’s famous malapropisms—or “Yogi-isms”—was “always go to other people’s funerals, otherwise they won’t come to yours.”\nOn Tuesday morning, plenty of people showed up for the baseball legend’s funeral.\nCurrent and former New York Yankees players joined Mr. Berra’s family and friends here at the Church of the Immaculate Conception to remember the former catcher.\nMr. Berra, who died Sept. 22 of natural causes at age 90, was a longtime Montclair resident and attended Immaculate Conception with his late wife, Carmen.\nFormer Yankees manager Joe Torre opened the service, which was closed to the public but broadcast live on the YES Network, by remembering Mr. Berra as a great friend, astute baseball analyst and respected teammate.\n“You didn’t have to be a baseball fan to know who Yogi was, to know what he represented,” Mr. Torre said. “Did he have great ability? Not necessarily, but he was a great player, respected by his teammates.”\nEarlier\nThe Best ‘Yogi-ism’ Was a Profound Act of Kindness Taking Yogi Berra to ‘Moneyball’ Cardinal Timothy Dolan, archbishop of New York, led the funeral Mass and described Mr. Berra as a wise and sincere man who rarely talked about religion but nonetheless embodied Christian values.\nCardinal Dolan compared Mr. Berra to Pope Francis, who visited the U.S. last week, saying both men had down-to-earth attitudes and big ears.\n“A philosopher we know he was. A theologian? Hardly, and he’d be the first to admit that,” Cardinal Dolan said of Mr. Berra. “While talking about his faith may not have been easy for him, sensing it deep down in his heart and soul and living it sincerely sure was.”\nOutside, about 100 people, some wearing Yankee caps and jerseys, gathered on North Fullerton Avenue across from the closed doors of the church’s entrance. Many bowed their heads as the funeral’s first hymn began.\nAcross from the church, a poster hung from the window of an apartment building displaying No. 8—Mr. Berra’s number—over Yankees pin stripes.\nLifelong Yankees fan Fred Ricciardi of Belleville, N.J., was driving by when he saw the sign for Mr. Berra’s funeral and immediately turned into the closest parking spot.\n“He’s just a good man,” said Mr. Ricciardi, 59 years old. “They don’t make them like that anymore.”\nMr. Berra’s baseball career began in 1947, when the Yankees won the World Series. Over his 18 seasons as a catcher for the team, Mr. Berra appeared in 14 World Series and collected 10 rings.\nHe won three most valuable player awards but never made more than $65,000 a season. His baseball career also included stints as a coach and as manager of both New York baseball teams – the Yankees and the Mets.\nA U.S. Navy veteran, Mr. Berra saw action on D-Day during World War II. The son of Italian immigrants, his full name was Lawrence Peter Berra. The nickname “Yogi” came from a teenage friend.\nThe Yogi Berra Museum is holding a public memorial tribute to Berra on Sunday from noon to 5 p.m.\nWrite to Kate King at Kate.King@wsj.com", "external_links": [], "published": "2015-09-29T19:24:00.000+03:00", "crawled": "2015-09-29T18:34:30.231+03:00", "highlightTitle": ""}