{"organizations": ["GVC", "SPORTINGBET"], "uuid": "7bf675af9128b3d11a8cab19717bc884ad8ea1e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/22/590x/Kenneth-Alexnder-603187.jpg", "site_section": "http://express.co.uk//posts/rss/21/finance", "section_title": "Daily Express :: Finance Feed", "url": "http://www.express.co.uk/finance/city/603187/GVC-winning-hand-888-online-poker-Bwin", "country": "", "title": "GVC trumps 888 for Bwin", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "GVC trumps 888 for Bwin", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T12:56:00.000+03:00", "replies_count": 0, "uuid": "7bf675af9128b3d11a8cab19717bc884ad8ea1e7"}, "author": "", "url": "http://www.express.co.uk/finance/city/603187/GVC-winning-hand-888-online-poker-Bwin", "ord_in_thread": 0, "title": "GVC trumps 888 for Bwin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kenneth Alexander"], "text": "GVC trumps 888 for Bwin GVC trumps 888 for Bwin SPORTINGBET owner GVC has showed its winning £1.1billion hand in the bidding race for online poker group Bwin.party as rival suitor 888 Holdings folded. PUBLISHED: 10:56, Sat, Sep 5, 2015 | UPDATED: 11:03, Sat, Sep 5, 2015 TONY LARKIN Chief executive Kenneth Alexander says GVC are \"natural\" partners for Bwin \n888, which had been in the driving seat with a recommended £900million offer in July, ruled out another twist in the longrunning takeover tussle after Bwin switched its support to GVC's sweetened cash and shares pitch. \nFTSE 250 company Bwin, the PartyPoker and FOXYBingo owner which put itself up for sale last year, had considered GVC's initial joint approach with Canadian group Amaya as too complex and offering less attractive growth prospects. \nAim-listed GVC decided to go it alone and after easing concerns over financing and savings projections, won the day with a valuation of Bwin of 129.64p a share that was 12.9 per cent higher than 888's bid. GVC is the natural partner for Bwin.party considering our strong sports betting and online gaming pedigree Kenneth Alexander, GVC chief executive \nGVC chief executive Kenneth Alexander, said: \"GVC is the natural partner for Bwin.party considering our strong sports betting and online gaming pedigree.\" \nGaming firms have been bulking up through merger deals to combat the impact of higher tax bills and tighter regulation in the UK and Europe. Deals include Ladbrokes teaming up with Coral and Paddy Power with Betfair. \nAlexander said: \"Unless you have scale you are going to struggle to compete. In combining GVC and Bwin we will create one of the market leaders in online sports betting, able to compete in this new landscape.\" \nThe cash element of the offer will be funded by £291.3million of debt provided by private equity firm Cerberus, with GVC raising £150million including through a placing of shares with institutions. Bwin shareholders will own two thirds of the enlarged group, which will switch from the junior market to the main board. Related articles City News: Karen Millen, Williams Grand Prix, AstraZeneca \nThe deal is expected to generate annual cost savings of £91million by end of 2017, with one-off costs of £44million. \nBwin chairman Philip Yea said there had been \"a pretty even split\" among shareholders who had expressed views either way. But \"we also had a significant block of shares happy to support the board on its deliberations\". \nHe said as well as headline value, Bwin had also taken into account \"timing and deliverability of financial synergies\" and the \"proven track record\" of GVC's management team. \n888 said: \"The board has concluded it cannot see sufficient value in Bwin to warrant a revision to its offer.\"", "external_links": [], "published": "2015-09-05T12:56:00.000+03:00", "crawled": "2015-09-05T16:14:51.415+03:00", "highlightTitle": ""}