{"organizations": [], "uuid": "2b370a3e5a8fbf8233f13984c5e12c1f012bbd74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/25/spain-catalonia-idUSL5N11U48M20150925", "country": "US", "title": "Pragmatic Catalans cool over independence before vote", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Pragmatic Catalans cool over independence before vote | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T13:43:00.000+03:00", "replies_count": 0, "uuid": "2b370a3e5a8fbf8233f13984c5e12c1f012bbd74"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/25/spain-catalonia-idUSL5N11U48M20150925", "ord_in_thread": 0, "title": "Pragmatic Catalans cool over independence before vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Catalonia elects regional parliament on Sunday\n* Separatists framed election as proxy vote on secession\n* Pro-independence parties could win slim majority\n* Only 20 percent Catalans see split from Spain\nBy Julien Toyer\nOLOT, Spain, Sept 25 (Reuters) - Over the past 40 years, Xavier Espuna has made his ham and cold cuts business grow from a small venture in Spain's northeastern region of Catalonia into an international business exporting as far away as Japan and Argentina.\nLike most Catalans, Espuna is swept up by the movement to split his region off from the rest of Spain. But he is not worried about the consequences that secession from Europe's fourth-largest economy would mean for his business.\nThe reason - he does not think it will happen any time soon.\n\"I am focused on making good ham, I am not focused on politics,\" said the jovial 61-year-old, whose family-owned company is based in Olot, a pro-independence bastion.\nCatalonia, a region that speaks its own language and accounts for about one fifth of Spanish economic output and population, votes on Sunday to elect a new parliament.\nSeparatist parties running on a joint ticket are expected to win a majority of seats, according to polls. They say they will unilaterally declare independence within 18 months if they win.\nYet the prospect of independence remains a theoretical issue for Catalans, surveys show.\nOnly 20 percent of Catalan voters actually believe the secessionist campaign will lead to a split, according to an opinion poll in local paper La Vanguardia.\nA separate survey from the Centre d'Estudis d'Opinio, a body backed by the regional government, showed the issue ranked only fourth in a list of Catalonia's main woes, below unemployment, dissatisfaction with politics and the state of the economy.\n\"I don't think the elections will have any impact on my business,\" said Espuna as he walked around his small ham factory dressed in a white butcher's coat.\nThe apparent ambivalence of the Catalan population about independence before Sunday's vote suggests that, despite the public statements of Catalan politicians, people believe the goal of a separatist drive that began in 2012 is now a more pragmatic effort to win concessions from the central government.\nThe head of Catalonia's regional government said this week that only secession remained on the table. The Spanish centre-right government of Prime Minister Mariano Rajoy has ruled out a Catalan breakaway and opposed any attempt to hold a referendum on secession. It has also dug in its heels on a deeper political and economic dialogue with the region.\nBut talks on a new and more beneficial tax regime for Catalonia are due to start after a national general election in December. Also on the cards are discussions over increased central government spending on infrastructure projects.\nDepending on what party or parties will rule in Madrid after the general vote, there could even be a constitutional change that could include recognition of Catalonia as a nation within the Spanish state.\n\"People are saying they want things to change in Catalonia but at the same time neither they want independence nor they think it's possible,\" said Josep Borrell, a former socialist minister and president of the European Parliament.\n\"They simply want to have a better bargaining hand with the central government.\"\nBOOST COMPETITIVENESS?\nThe economic consequences of a Catalan secession are the topic of much debate.\nSeparatists say Catalonia, a rich region that relies on tourism and a network of innovative companies, would become the most competitive economy in Southern Europe if it becomes independent.\nThey also say its tax revenues, a portion of which is currently transferred to poorer Spanish regions, would increase by 12 billion euros, enabling the new state to provide better social care for its people than now.\nThe central government says Catalan independence would mean an automatic exit from the euro zone and international trade agreements, followed by capital flight and economic recession.\nForeign Minister Jose Manuel Garcia-Margallo said on Wednesday that close to 700,000 jobs would be destroyed in Catalonia, pushing the unemployment rate to 37 percent.\nSpecial concessions on taxes and infrastructure would unquestionably be a boon for the local economy. A law to better protect regional powers from national interference would also help pave the way for reconciliation.\nTalks between Madrid and Catalonia next year depend in part on Catalan politicians' willingness to negotiate. But much will also depend on the makeup of the next central government.\nAccording to polls, at least two parties, probably three, will be needed to form a government in Madrid - possibly setting up the country for a fractious coalition government that would be hard-pressed to negotiate on anything.\n\"The question is will the state be in a position to table a wide-ranging reform to make Spain attractive again? Frankly, I don't see it,\" said Lluis Orriols, a political science lecturer at the University Carlos III of Madrid.\nOVERSTATED\nSome entrepreneurs on the ground are being vocal about their position.\nJosep Bou, a proud Catalan who learnt to speak Spanish only when he was four-years-old and owns 13 bakeries across Catalonia, said he is in favour of negotiating better financing terms for Catalonia but is against secession.\nHe said he did not believe the Catalan economy will be better off in an independent state. He also said divisions between Catalans and the rest of Spain are overstated.\nThis position has not made him popular among friends - and clients.\n\"Some clients no longer buy my bread, I have been called a bad Catalan and a traitor. Speaking against the tide is always tricky.\"\nIn Olot, Xavier Espuna also said he was not bothered by any divisions. When it comes to his hams and other products, clients abroad think of them as Spanish, not Catalan, and that's fine with him.\n\"I sell my products all over Spain. Abroad, consumers buy them as typical Spanish products.\" (Reporting by Julien Toyer; Editing by Alessandra Galloni and Angus MacSwan)", "external_links": [], "published": "2015-09-25T13:43:00.000+03:00", "crawled": "2015-09-25T12:50:51.894+03:00", "highlightTitle": ""}