{"organizations": ["CMS", "RHB"], "uuid": "3f16d530efac81c8c9e3818a29046b8d9143f8f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/institutional-forex/wp-content/uploads/sites/9/2015/04/technology.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/institutional-forex/technology/trading-technologies-bolsters-asp-platform-participation-with-two-inductees/", "country": "US", "title": "Trading Technologies Bolsters ASP Platform Participation With Two Inductees", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Trading Technologies Bolsters ASP Platform Participation With Two Inductees", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T16:57:00.000+03:00", "replies_count": 0, "uuid": "3f16d530efac81c8c9e3818a29046b8d9143f8f7"}, "author": "", "url": "http://www.financemagnates.com/institutional-forex/technology/trading-technologies-bolsters-asp-platform-participation-with-two-inductees/", "ord_in_thread": 0, "title": "Trading Technologies Bolsters ASP Platform Participation With Two Inductees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trading Technologies Bolsters ASP Platform Participation With Two Inductees Trading Technologies Bolsters ASP Platform Participation With Two Inductees Following the addition of CMS and RHB, the X_TRADER ASP network now boasts more than 50 sell-side participants. Advertising Print This Post \nTrading Technologies International, Inc. (TT), a provider of high-performance professional trading software, has welcomed China Merchant Securities (CMS) Hong Kong and RHB Securities Singapore Pte. Ltd as participating brokers in TT’s global X_TRADER ASP service, according to a TT statement. \nCMS provides users with route ordering services to TT’s comprehensive global trading network via direct market access (DMA) to forty-five sovereign markets. Following the addition of CMS and RHB, the X_TRADER ASP network now boasts more than 50 sell-side participants. Additionally, more than 200 buy-side firms are currently trading through X_TRADER ASP. \nAccording to Robbie McDonnell, EVP global sales for TT in a recent statement on the induction of CMS, “We are very pleased to welcome CMS into the X_TRADER ASP community. Adding CMS, with their expertise in the Hong Kong and China markets along with a recently expanded footprint in the UK, will be a competitive advantage to us as we expand our customer base in China and the rest of Asia.” \nIn addition to the induction, TT has also partnered with FEX Global Pty. Limited (FEX), an Asian-based energy and commodities futures exchange, to provide the exchange’s trading participants with the company’s next-generation TT trading platform. \nTT’s platform utilizes a software-as-a-service (SaaS) delivery model and the new agreement will allow trading participants to access the FEX Global markets across multiple asset classes, including commodities and energy futures contracts. \n“This agreement will enable trading access to our market from launch for our clients. The new TT platform will enable our clients to access and utilize the key benefits of TT, which features a fully integrated suite of sophisticated trading applications and high-performance trading tools through a significantly simplified infrastructure environment,” noted Tom Price, CEO of FEX Global, in a recent statement on the contracting. \nTT has been highly active in 2015, launching a number of partnerships, integrations, and accords with a plethora of financial service providers. Back in June, TT partnered with Nasdaq to foster greater connectivity on Nasdaq’s European commodities operation . The accord saw Nasdaq assimilate TT’s platform to include the exchange group’s Nordic benchmark power market and German power contracts. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-09-23T16:57:00.000+03:00", "crawled": "2015-09-23T14:15:20.027+03:00", "highlightTitle": ""}