{"organizations": [], "uuid": "d983020e5699b6b1572d55220abf9cf7dad0b310", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/01/g20-usa-idUSL1N1171Q920150901", "country": "US", "title": "UPDATE 1-China should clearly explain policies to markets - U.S. Treasury", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-China should clearly explain policies to markets - U.S. Treasury | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T22:56:00.000+03:00", "replies_count": 0, "uuid": "d983020e5699b6b1572d55220abf9cf7dad0b310"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/01/g20-usa-idUSL1N1171Q920150901", "ord_in_thread": 0, "title": "UPDATE 1-China should clearly explain policies to markets - U.S. Treasury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comments on currency, background)\nBy Jason Lange\nWASHINGTON, Sept 1 (Reuters) - The Obama administration on Tuesday urged China to carefully explain its policy changes to financial markets and to shift its economic focus toward consumer spending so that its economy can keep growing.\nThe comments made by a senior Treasury official followed Beijing's surprise decision in August to let its currency devalue.\nThe devaluation left many investors wondering whether China's intention was to reduce state controls over the currency market, as policymakers stated, or to fight an economic slowdown by boosting exports.\n\"Critical to China's success is moving forward with market oriented reforms while at the same time carefully communicating policy intentions and actions to financial markets,\" a senior Treasury official said in a briefing ahead of a meeting of the Group of 20 major economies.\nDoubts over China's policy intentions have played a role in weeks of turmoil in global financial markets, with investors worried that slowing Chinese growth and rising U.S. interest rates could hit the economies of many countries.\nWashington has long urged Beijing to move away from its investment- and export-oriented growth model. The U.S. official's comments underscored a view that decades of fast economic growth could come to an end if China doesn't make that shift.\n\"(China's) transition toward domestic demand is not only fundamental to China meeting its G20 commitments but also to China being able to continue to grow in the future,\" the official said in a phone call with journalists.\nThe official said Washington was keeping an eye on the Chinese currency, but he noted that the devaluation in nominal terms has been less than 3 percent in recent weeks.\nWhen factoring in changes in Chinese prices relative to those in other countries, China's yuan has appreciated substantially over the last year, he said. (Reporting by Jason Lange; Editing by Chizu Nomiyama )", "external_links": [], "published": "2015-09-01T22:56:00.000+03:00", "crawled": "2015-09-01T22:20:16.997+03:00", "highlightTitle": ""}