{"organizations": [], "uuid": "437b74933ad172f960ec9b9f974745bebadbc1da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509200028.html", "country": "US", "title": "Kenya: Embassy to Set Up Centre for Potato Information", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Embassy to Set Up Centre for Potato Information", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T14:10:00.000+03:00", "replies_count": 0, "uuid": "437b74933ad172f960ec9b9f974745bebadbc1da"}, "author": "", "url": "http://allafrica.com/stories/201509200028.html", "ord_in_thread": 0, "title": "Kenya: Embassy to Set Up Centre for Potato Information", "locations": ["Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rachel Kibui"], "text": "Kenya: Cabinet Meets Over Teachers Strike By Rachel Kibui \nTHE NETHERLANDS EMBASSY in Nairobi will next week launch the Potato Value Chain Afrika Portal in a bid to support farmers in the country. \nThe portal will be launched at the Eldoret University Agricultural Fair, which is set for September 24-26 in Eldoret. \nAgriculture Counsellor Bert Rikken said the crop would boost food security following the numerous challenges facing maize sector. With over 300 registered varieties, Netherlands is the world's top seed potato exporter. \nIn the last two years, 31 of her seed varieties have been registered in Kenya \nPotato is Kenya's second most important food crop, after maize, yet the country harvests a paltry seven tonnes per hectare despite potential to raise productivity to a minimum of 40 tonnes. \nChallenges facing the sector include lack of certified seeds, few varieties suitable for the various growing regions and paucity of storage facilities. Others are lack of clear distribution chains from producers to consumers, shortage of potatoes for processing, poor crop husbandry and potato specific farming practices and manual production methods. \nThe Netherlands government, through the project, is supporting a potato project, which focuses on the introduction, multiplication and production of new potato varieties. Kenya \nStudents, teachers and parents will wake up tomorrow to one of the most dramatic disruptions of the school system in … see more » Copyright © 2015 The Nation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-20T14:10:00.000+03:00", "crawled": "2015-09-20T16:21:42.672+03:00", "highlightTitle": ""}