{"organizations": [], "uuid": "3b78ee7b8d250af6713f37e3d3bca7e9b3d3aca1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/25/markets-forex-cftc-idUSL1N11V2BS20150925", "country": "US", "title": "UPDATE 1-U.S. dollar longs hit lowest in more than a year -CFTC, | Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-U.S. dollar longs hit lowest in more than a year -CFTC, Reuters | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T00:20:00.000+03:00", "replies_count": 0, "uuid": "3b78ee7b8d250af6713f37e3d3bca7e9b3d3aca1"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/25/markets-forex-cftc-idUSL1N11V2BS20150925", "ord_in_thread": 0, "title": "UPDATE 1-U.S. dollar longs hit lowest in more than a year -CFTC, | Reuters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds table, details on dollar index, and British pound) Sept 25 Speculators further reduced bullish bets on the U.S. dollar this week to their lowest since late July last year, according to Reuters calculations and data from the Commodity Futures Trading Commission released on Friday. The value of the dollar's net long position fell to $20.48 billion in the week ended Sept. 22, from $20.97 billion the previous week. This was the second straight week short-term investors reduced U.S. dollar exposure and the fifth consecutive week dollar longs came in under $30 billion. To be long a currency is to make a bet it will rise, while being short is a bet its value will decline. The period covers the Federal Reserve's decision to hold U.S. interest rates unchanged last week, disappointing investors eager to get the tightening policy going. The dollar was hurt by the Fed's decision last week and the currency's near-term outlook has dimmed a little bit given the uncertainty about the timing of the Fed's first rate increase in nearly a decade. This month so far the dollar index is up 0.3 percent. In other currencies, sterling futures showed the most notable change, turning net long to 1,267 contracts, from net short contracts of 3,619 the previous week. Ian McCafferty, a member of the Bank of England's Monetary Policy Committee, pushed for a hike in British interest rates to prevent inflation from overshooting in two to three years. He was the only MPC member though voting for a rate increase. The pound in September was down nearly 1 percent and for the year so far was 2.4 percent lower. The Reuters calculation for the aggregate U.S. dollar position is derived from net positions of International Monetary Market speculators in the yen, euro, British pound, Swiss franc and Canadian and Australian dollars. Japanese Yen (Contracts of 12,500,000 yen) 22 Sep 2015 Prior week week Long 48,282 36,449 Short 71,960 63,263 Net -23,678 -26,814 EURO (Contracts of 125,000 euros) 22 Sep 2015 Prior week week Long 63,526 63,416 Short 144,559 147,618 Net -81,033 -84,202 POUND STERLING (Contracts of 62,500 pounds sterling) 22 Sep 2015 Prior week week Long 45,001 43,206 Short 43,734 46,825 Net 1,267 -3,619 SWISS FRANC (Contracts of 125,000 Swiss francs) 22 Sep 2015 Prior week week Long 13,722 19,039 Short 15,598 15,257 Net -1,876 3,782 CANADIAN DOLLAR (Contracts of 100,000 Canadian dollars) 22 Sep 2015 Prior week week Long 40,901 28,509 Short 79,295 75,592 Net -38,394 -47,083 AUSTRALIAN DOLLAR (Contracts of 100,000 Aussie dollars) 22 Sep 2015 Prior week week Long 42,666 59,117 Short 95,498 99,846 Net -52,832 -40,729 MEXICAN PESO (Contracts of 500,000 pesos) 22 Sep 2015 Prior week week Long 47,626 21,749 Short 59,982 77,034 Net -12,356 -55,285 NEW ZEALAND DOLLAR (Contracts of 100,000 New Zealand dollars) 22 Sep 2015 Prior week week Long 22,990 22,462 Short 26,519 24,556 Net -3,529 -2,094 (Reporting by Gertrude Chavez-Dreyfuss ; Editing by Meredith Mazzilli and James Dalgleish )", "external_links": [], "published": "2015-09-26T00:20:00.000+03:00", "crawled": "2015-09-25T23:40:52.806+03:00", "highlightTitle": ""}