{"organizations": [], "uuid": "35d3a31437d43da83ef3eb6fec1c783b67c7b1ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/insuring-farmers-to-fight-drought/140484", "country": "IE", "title": "Insuring farmers to fight drought", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Insuring farmers to fight drought | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T08:22:00.000+03:00", "replies_count": 0, "uuid": "35d3a31437d43da83ef3eb6fec1c783b67c7b1ca"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/insuring-farmers-to-fight-drought/140484", "ord_in_thread": 0, "title": "Insuring farmers to fight drought", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Paytm invests $10 million in LogiNext Editorial: Obstructing justice Editorial: The Sanofi confusion Against the backdrop of below-par monsoon forecast by the Met department, it is important to understand the consequences of adverse weather on farmers. In this context, it is also essential to understand the consequences of drought in order to device both long-term and short-term policy responses. Mainstream discourse on the matter seems to be fixated on the possibility of a blip in the GDP growth rate and increase in prices of food articles. However, careful research has pointed out that, in India, drought can lead to irreparable human costs in the form of increased mortality rates in drought-hit areas. Unfortunately, short-term fixes such as banning exports of select items or a politically-motivated loan waiver are not going to help in this manner.\nA research paper by Robin Burgess, Olivier Deschenes, Dave Donaldson and Michael Greenstone studies the relationship between mortality rate in rural areas and hot weather conditions over a period of 43 years starting from 1957 and ending in 2000. Shockingly, they find that one additional day with a temperature above 36 degree Celsius when compared to days with 22-24 degree Celsius is associated with an increase in annual mortality rate by about 0.75%. This fact alone is not sufficient to claim that it is the agricultural distress that causes increase in mortality rate. To strengthen their causal inference, the authors conduct additional tests and find that the increase in mortality due to hot weather is mostly a rural phenomenon, where majority of the population is dependent on agriculture. To further strengthen their causal claims, they test the relationship between hot weather and mortality rate separately for the cultivating season and non-cultivating season. They find that the phenomenon of increase in mortality due to inclement weather occurs mostly during the cultivating season. In other words, these results cannot be explained by direct impact of weather such as sun stroke, heat waves etc. The linkage between the two variables under study seems to be coming from the shortfall in agricultural production. The authors show that hot weather leads to lower production and lower agricultural wages. Thus, the farmers are left with very little disposable income to spend on nutrition and health. This explains the results in the study.\nUnfortunately other careful studies have found results that are even more alarming. Eliana Rose finds that drought has a very high impact on the mortality rate amongst Indian girls. On similar lines, Maccini and Yang find that women who experienced drought as young children are likely to be shorter, less wealthy and are also likely to be less educated. Based on these findings, it is reasonable to conclude that drought results in very high human costs.\nExpectedly, the phenomenon described in this article is restricted to developing countries only. Similar studies on developed countries have found very weak association between mortality rate and inclement weather. It is easy to dismiss this comparison by saying that only a tiny fraction of population in those countries is dependent on agriculture and more importantly that tiny fraction is heavily subsidised. But researchers have found that farmers in developed countries are able to insulate themselves from the vagarious of weather because almost all of them have access to crop insurance, reliable weather warning systems and world-class agricultural infrastructure. In fact, some studies have noted that many farmers are able to change the crops and cropping pattern in anticipation of bad weather.\nSuccessive governments in India have treated farmers only with doles with an eye on their votes. As we know, a significant portion of these doles leak, but even the portion that reaches is not sufficient to solve this problem in the long run. Our own research shows that doles such as debt waiver increase farmers’ difficulties in the long run as banks become extremely selective while granting credit. It is highly likely that such farmers who do not obtain bank credit are driven into the clutches of moneylenders and become even more indebted after a debt waiver. The fault here is not with the banks but with short-sighted political leadership. The impact of free electricity on the availability of electricity is also well known. Free electricity actually implies no electricity. Since most of the resources are earmarked for populist measures, governments usually are left with no funds for taking steps which are required to be taken.\nThe government should work towards promoting crop insurance, for extensive crop insurance coverage can mitigate the above mentioned hardships. Shawan Cole, Xavier Ginnie and James Vickery have shown that farmers in India do not buy crop insurance mostly because of non-price factors such as lack of trust, liquidity constraints and limited salience. In their randomised controlled experiments, they have also found that most farmers have no information about crop insurance. Even when significant discounts are given, farmers significantly under-insure their crops. There is an urgent need to educate the farmers and work towards building trust. It will be wise for the government to focus its limited resources in this direction.\nThe Prime Minister has repeatedly stressed the importance of progressive measures such as soil health card, insuring livestock and building an agricultural data bank. The need of the hour is to take effective steps in this direction. It is heartening to note that a good beginning in this regard has been made through the launch of “more crop per drop” scheme.\nThe author is a senior associate director of the Center For Analytical Finance, Indian School of Business\nFirst Published on September 24, 2015 12:22 am", "external_links": [], "published": "2015-09-24T08:22:00.000+03:00", "crawled": "2015-09-24T00:25:08.921+03:00", "highlightTitle": ""}