{"organizations": [], "uuid": "9ce41dd96480566e01fc7bcbcb8c16ba4085a40f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-travel-leisure/?format=rss", "section_title": "Travel Industry News | Leisure Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/online-betting-firm-888-forced-101334553.html", "country": "US", "title": "Online betting firm 888 forced to improve bid for Bwin", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Online betting firm 888 forced to improve bid for Bwin", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T13:13:00.000+03:00", "replies_count": 0, "uuid": "9ce41dd96480566e01fc7bcbcb8c16ba4085a40f"}, "author": "", "url": "https://uk.finance.yahoo.com/news/online-betting-firm-888-forced-101334553.html", "ord_in_thread": 0, "title": "Online betting firm 888 forced to improve bid for Bwin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 1, 2015, 12:50 BST - UK Markets close in 3 hrs 40 mins Online betting firm 888 forced to improve bid for Bwin Reuters - UK Focus – 1 hour 36 minutes ago \n* Bwin confirms received a revised proposal from 888 \n* Says evaluating Bwin and GVC proposals \n* GVC confirms making a formal offer to Bwin (Adds analyst comments; background; share movement) \nBy Aastha Agnihotri and Neil Maidment \nSept 1 (Reuters) - Online gambling firm 888 Holdings stepped up a billion pound battle for Bwin.party Digital Entertainment on Tuesday, submitting a revised takeover proposal as it looks to see off rival interest from GVC Holdings (Other OTC: GMVHF - news ) . \nGambling companies are seeking to expand in response to higher tax bills and tighter regulation in Britain and continental Europe. Size is also seen as vital to ensure competitiveness in an online market buoyed by the use of tablets and mobile. \nBwin, which like smaller rivals 888 and GVC, offers casino, poker, bingo and sports betting, had accepted a 900 million-pound ($1.4 billion) cash and shares offer from 888 in July, preferring it to a higher but more complex offer from GVC. \nGVC, owner of the Sportingbet brand, has since worked with Bwin to iron out a number of concerns and has made an improved offer, valuing the company at around 1.06 billion pounds. \n888 responded by revising its own bid over a long holiday weekend, albeit with a number of undisclosed pre-conditions. \nBwin, up for sale since November, did not give details of 888's new proposal but said it would now evaluate it alongside the one from GVC. 888, whose market value is roughly two-thirds of Bwin's, also declined to comment on its offer details. \nBy joining forces, bigger players can be better protected in a harsher tax environment than smaller firms which are likely eventually to be squeezed out of the market. Growth prospects for merged firms also improve as they have more to spend on IT and marketing. \nBIGGER RIVALS \nIn recent weeks heavyweights Paddy Power (LSE: PAP.L - news ) and Betfair have agreed a merger in principle, while Ladbrokes (LSE: LAD.L - news ) and Gala Coral have struck a similar deal. \nWilliam Hill (Other OTC: WIMHF - news ) , whose position as Britain's leading bookmaker has been attacked by the recent consolidation, is also under pressure to respond. The firm had a bid for 888 turned down in February this year. \nGVC's offer of 128.48p based on Friday's close is 25p cash and 0.231 of a new GVC share, while 888's offer accepted in July was 104.09p, made up of 39.45p in cash and 0.404 new 888 shares for each Bwin share. \nAt 26.1 times forward estimates, Bwin is about 50 percent more expensive than its rivals, according to Thomson Reuters (Dusseldorf: TOC.DU - news ) data. \n\"My view is 888 is in a stronger position: bigger business, stronger balance sheet, they are main market listed. They have got much longer track record in terms of the management team and much higher rating for the stock,\" analyst Simon Davies of Canaccord Genuity (Other OTC: CCORF - news ) said. \nDavies expects a new offer price of 115p or more from 888. \n888 has promised cost benefits of at least $70 million per annum by the end of 2018, although analysts expect a far greater figure could be achieved. Smaller, AIM-listed GVC has promised benefits of more than $150 million per annum by the end of 2017. \nBwin said its board's unanimous recommendation of 888's offer, that was announced on July 17, was unchanged by Tuesday's announcement, although it could yet have a change of heart and choose GVC. \nBwin shares, up 27 percent on a year ago, were down 0.2 percent at 116.2p at 1010 GMT, valuing the business at around 960 million pounds. \nGVC's shares, up 3 percent in a year, were up 0.8 percent at 451.5p, while 888's were up 0.6 percent at 163 pence having risen 27 percent in a year. \n($1 = 0.6519 pounds) (Editing by Anupama Dwivedi and Keith Weir)", "external_links": [], "published": "2015-09-01T13:13:00.000+03:00", "crawled": "2015-09-01T14:54:30.459+03:00", "highlightTitle": ""}