{"organizations": [], "uuid": "ce25fd49ade8d118e32fa32afc6c9d012d91d89f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/e/3/v/8/image.related.afrArticleLead.620x365.gje3sf.png/1441246989231.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/opinion/why-macbooks-would-not-have-improved-communism-20150903-gje3sf", "country": "AU", "title": "Why MacBooks would not have improved communism", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why MacBooks would not have improved communism | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T10:10:00.000+03:00", "replies_count": 0, "uuid": "ce25fd49ade8d118e32fa32afc6c9d012d91d89f"}, "author": "Megan McArdle", "url": "http://www.afr.com/opinion/why-macbooks-would-not-have-improved-communism-20150903-gje3sf", "ord_in_thread": 0, "title": "Why MacBooks would not have improved communism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Although some communist thinkers were undoubtedly idealists, it is not clear many of them had considered the motivations of real people. This lead inexorably to state control. Photo 12 by Megan McArdle At the New Republic, Malcolm Harris asks an interesting question : Was the Soviet Union's problem that communism can never work? Or did the Soviets just need a lot more MacBook Airs?\nActually, Harris is channelling Paul Mason, the author of the book he is reviewing, and unfortunately, he doesn't really try to answer the question. Instead he makes the stridently timid argument that this won't happen because the capitalists won't let it, at least without a healthy dose of revolutionary action.\nI'll swing for the fences and argue that no, even with better computers, communism isn't going to work. Nor some gauzy vision of post-capitalism that looks like communism, but with YouTube videos.\nIn retrospect, communism seems wildly stupid, or at least, incredibly naive. Did the people who dreamed up this system not understand the enormous incentive problems they were creating? As Ayn Rand dramatised the problem in \"Atlas Shrugged\": \"It's miseries, not work, that had become the coin of the realm — so it turned into a contest among six thousand panhandlers, each claiming that his need was worse than his brother's. How else could it be done?\" The incentives of \"from each according to his ability, to each according to his need\" drive toward falling production, which means there won't be enough to cover the needs.\nThe problem with communism is the poor incentives it creates John Spooner Or as a former colleague who fled communist Poland once told me, \"They pretended to pay us, and we pretended to work.\" There is a reason that basically all the communist and socialist regimes ended in some degree of authoritarianism.\nHow could anyone who had, y'know, met some people in their visit to our planet, not see that this was coming? Large swathes of communist and socialist writing was naive and impractical. But the idealists weren't entirely unaware that when monetary incentives disappeared, they would need to find other ways to get people to do things.\nThey were also aware, however, of a point that has eluded some of their cruder critics, which is that monetary incentives are far from the only reasons that people do things. People don't take care of their kids because they're getting paid for it. Nor were the millions of Americans who headed off to World War II mostly chasing those princely military paycheques. Most of the folks who volunteer to help the homeless, or just to make a casserole for the local potluck, are not thinking \"There's a buck in it for me somewhere.\" The idealists behind communism thought that using non-monetary incentives could compensate for the loss of the money motive -- and that there would also be great efficiency gains from eliminating wasteful competition and no longer goading consumers to generate superfluous consumer demand.\nThey were quite wrong. Competition turns out not to be so wasteful; it makes a system resilient. That misunderstanding was a symptom of a larger issue called the socialist calculation problem. We think of prices largely in reference to ourselves, or other individuals, which is to say that we mostly see them as the highest barrier to getting something we want. But as we pull back to look at society, or the globe, we see that they are in fact an incredibly elegant way to allocate scarce resources.\n This was best explained by Friedrich Hayek in his essay \"The Use of Knowledge in Society.\" Some good like tin becomes scarce, perhaps because a large tin mine has failed, or perhaps because there is a new and very profitable use for tin that is soaking up much of the supply. The price rises, and all over the world, people begin to economise on tin. Most of them have no idea why the price of tin is rising, and if they did, they wouldn't care; they just switch to another metal, or start recycling old tin, finding a way to bring global demand closer in line to global supply. A lot of that is possible only because of price competition.\nYou can think of this as something like a distributed computer network: You get millions of people devoting some portion of their effort to aligning consumption with production. This system is constantly churning, making billions of decisions a day. Communism tried to replace this with a bunch of guys sitting around in offices, who occasionally negotiated with guys sitting around in other offices. It was a doomed effort from the start. Don't get me wrong; the incentive problems were real and large. But even if they could have been solved, the calculation problem would have remained. And the more complex an economy you are trying to manage, the worse a job you will do.\nThe socialist calculation problem is not fundamentally an issue of calculating how to produce the most stuff, but of calculating what should be produced. Computers can't solve that, at least until they develop sufficient intelligence that they'll probably render the issue moot by ordering our toasters to kill us so that they can use our bodies for mulch.\nThe most important piece of information that the price system provides is \"How much do I want this, given that other people want it too?\" That's the question that millions of people are answering, when they decide to use less tin, or pay more for tin and use less of something else. Computers are not good at answering this question.\nHow would a computer even get the information to make a good guess, in the absence of a price system? Please do not say surveys. You know what did really well on surveys? New Coke. Also, Donald Trump, who is not going to be president . We are, in fact, back to some version of the incentive problem, which is that when the stakes are low, people don't put too much thought into their answers.\nIn many cases, people are interested in getting rid of prices precisely because they don't like the signal that it is sending -- that the best possible medical care is a scarce good that few people are going to get, or that other people do not value your labor very much. People are trying to override that information with a better program.\nBut even if we decide that the planners know best, we still have to contend with the resistance that will arise to their plan. Just as communism's critics need to remember that money is not the only reason people strive, post-capitalists need to remember that they will be dealing with people -- cantankerous, willful and capable of all manner of subversions if the plan is not paying sufficient attention to their needs.\nIt's possible that we'll see versions of a \"post-scarcity\" economy in things like music and writing, since these are basically versions of activities that people have been doing for free for thousands of years. But when it comes to unpleasant labor like slaughtering animals, mining ore and scrubbing floors, even an advanced society needs to figure out exactly how badly it wants those things done. And so far, nothing beats prices for eliciting that information.\nMegan McArdle is Bloomberg View Columnist", "external_links": ["http://www.bloombergview.com/articles/2015-08-28/trump-is-a-nuisance-not-a-nightmare", "http://www.econlib.org/library/Essays/hykKnw1.html", "http://www.newrepublic.com/article/122568/what-if-stalin-had-computers?utm_content=buffer7ce35&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer"], "published": "2015-09-03T10:10:00.000+03:00", "crawled": "2015-09-03T06:03:57.053+03:00", "highlightTitle": ""}