{"organizations": [], "uuid": "c534bdaf3eb783d097e571c74714e3472f6ffb46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/v/0/d/d/image.related.afrArticleLead.620x365.gjvgok.png/1443346712530.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/why-top-fundie-charlie-lanchester-wont-buy-telstra-bhp-or-cba--ever-20150926-gjvgok", "country": "AU", "title": "Why top fundie Charlie Lanchester won't buy Telstra, BHP or CBA – ever", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why top fundie Charlie Lanchester won't buy Telstra, BHP or CBA – ever | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T21:45:00.000+03:00", "replies_count": 0, "uuid": "c534bdaf3eb783d097e571c74714e3472f6ffb46"}, "author": "afr.com", "url": "http://www.afr.com/markets/why-top-fundie-charlie-lanchester-wont-buy-telstra-bhp-or-cba--ever-20150926-gjvgok", "ord_in_thread": 0, "title": "Why top fundie Charlie Lanchester won't buy Telstra, BHP or CBA – ever", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Charlie Lanchester on a SurfAid trip during his break from full-time investing. by Vesna Poljak Philip Baker When one of Australia's best fund managers restarts his investment career, he will be turning his back on a handful of stocks that have been the bedrock of the local sharemarket for decades.\nCharlie Lanchester has joined BlackRock, the world's largest asset manager, to manage a new equity fund focusing on about 20 small and mid-sized industrial companies only, marking a departure from the usual all-in investment style adopted by large institutions.\nThat leaves no room for Telstra, BHP Billiton, Rio Tinto, Commonwealth Bank of Australia, Westpac, National Australia Bank and ANZ.\nThe way Mr Lanchester sees it, those well-known stocks soak up so much of the index, it means nearly every Aussie equity manager is forced into big positions in a handful of names.\n\"You're asking people to pay fees for what is effectively a passive performance,\" he explains. \"I have no interest in being big, I'd rather be good.\"\nCareer break Mr Lanchester quit Perpetual two years ago after a 14-year stint, rising to deputy head of equities before seeking a career break. He used to manage Perpetual's $7.2 billion Industrial Share Fund, which produced annual returns of 10.5 per cent.\nHis decision to deliberately exclude roughly half of the S&P/ASX 200 Index by market capitalisation will also mean the potential size of his new fund is smaller.\n \"I really want a product I can be proud of that generates outperformance for our investors. That is more important to me than being the biggest game in town,\" he says.\nMr Lanchester took a two-year pause from stock picking but never fell out of love with investing. A few years ago, he agreed to be an early backer of a small online surfwear start-up created by two friends. That business was Surfstitch and it turned out to be the best investment he ever made.\n\"To be involved with a company that has been a disruptor, it's been a fascinating experience,\" he says. \"As a fund manager, you often don't see everything going on in the business … And often, particularly when you work at somewhere like Perpetual and you're potentially the biggest shareholder, management are in a rush to tell you how well things are going. So it was fascinating to see actually how hard it is in real life.\"\nSurfstitch involvement Mr Lanchester's involvement with the company goes back to 2007; Surfstitch successfully floated in late 2014 .\nMuch to his frustration, he remains winless in his other passion: amateur surfing. He has not managed to win a single heat at the SurfAid Cup, an event staged by the non-profit SurfAid, which he is a director of in Australia. \"I think there's been five SurfAid Cups,\" he estimates. \"I'm yet to win a heat, which drives me to insanity.\"\nMr Lanchester started his career at Schroders in London after studying history at Oxford. He recalls being a junior research analyst, at 22, and representing the institution at meetings with Sir Bob Wilson, of RTZ Corporation, the company that joined with CRA Limited to became Rio Tinto.\n\"They throw you into the deep end.\"\nAs the son of physicists, he also admits to not knowing much about City life before his introduction through Schroders but a background in history turned out to be an edge. He managed to survive some impromptu numeracy testing – \"literally 'this times this divided by this'\" – to get an internship, which led to a coveted spot in the Schroders graduate training program.\nHis interviewer was Donald Cameron, who is now the chief of Scotland's clan Cameron.\nTurning point \"I told him the fact that I loved sport, I didn't want to work 24/7 like an investment banker … I think then the answer fell in place. It was a huge turning point in my life looking back on it,\" Mr Lanchester recalls. \"He came around and said 'fund management for you my boy'.\"\nAnother huge influence in his career was John Sevior , his former boss at Perpetual until Mr Sevior left in 2011; as well as Matt Williams , who succeeded Mr Sevior and left Perpetual this year.\n\"I think I learnt a lot from those two guys in particular. But after 14 years, it's time for a change … All good things come to an end and it was time to really let some of the other smart guys come up,\" he says.\nMuch has changed since Mr Lanchester was running money. The correction in the S&P/ASX 200 Index works firmly in his favour because many of his stock ideas \"are looking pretty good value at the moment\".\n\"There's a whole new sector in aged care, which wasn't there when I left,\" he says. \"You're always after that ground break, that small cap that can become a big cap.\"\nPaper portfolio He won't mention specific stocks but has been running a paper portfolio since July.\n\"I'm quite excited to get going,\" he tells The Australian Financial Review . \"I'm delighted that the market has come down. I think it's providing some really interesting opportunities, particularly in something that's in a mid-cap and small-cap industrial space.\" (Another reason to distance his fund from mining stocks is BlackRock already offers one of the world's biggest resources funds, run by Evy Hambro.)\nHe thinks Australia, taking a medium- to long-term view, looks \"very good\".\nPart of him wondered about the wisdom in returning to full-time investing \"because as soon as you're managing live money, it's something you worry about 24/7\".\nBut any doubts are eroded by the thrill of discovering the next great Australian company. He and portfolio manager Madeleine Beaumont have already been out seeing management teams behind potential investments.\n\"There's nothing better than when you walk out of a meeting going 'that guy knows what he's doing' and you really have that feeling that he's looking, he's investing the company's money in capital in a good way that will produce returns, not just for the next year but for the next two, three, four years.\n\"And then often you'll build a relationship with that person as you invest in the company over a period of time. And there's nothing better than when you have that feeling of confidence that you found a manager of high quality. And there's not a huge number of them out there. But that's what you're looking for and that's the part of the job that I really enjoy.\"", "external_links": [], "published": "2015-09-27T21:45:00.000+03:00", "crawled": "2015-09-28T02:04:22.758+03:00", "highlightTitle": ""}