{"organizations": [], "uuid": "efeebc1435839c0ed56ce390c02922e0b329461a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/l/w/l/7/image.related.afrArticleLead.620x365.gjkop2.png/1442196864428.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/technology/the-government-is-hiring-hackers-to-help-bring-australia-into-the-21st-century-20150911-gjkop2", "country": "AU", "title": "The government is hiring hackers to help bring Australia into the 21st Century", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The government is hiring hackers to help bring Australia into the 21st Century | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T09:14:00.000+03:00", "replies_count": 0, "uuid": "efeebc1435839c0ed56ce390c02922e0b329461a"}, "author": "John McDuling", "url": "http://www.afr.com/technology/the-government-is-hiring-hackers-to-help-bring-australia-into-the-21st-century-20150911-gjkop2", "ord_in_thread": 0, "title": "The government is hiring hackers to help bring Australia into the 21st Century", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Digital Transformation Office chief executive Paul Shetler. Supplied Share on twitter by John McDuling It's fair to say that Hacker News is probably not at the top of the list of publications where you'd expect to see the Australian government advertising jobs. And an \"ethical hacker\" is probably not the type of job you would expect the Australian government to be hiring for, either.\nBut when you are trying to revolutionise online services for a government that will spend more than $430 billion this year, at a time when competition across the planet for people with coding skills is exceptionally fierce, you have to get creative.\nSo that's exactly with the newly formed Digital Transformation Office is doing . The ethical hacking job quietly appeared on Hacker News, a computer science, hacking and cyber security community.\nIt shines a light on the unique situation the DTO, which was recently set up by the Communications Minister Malcolm Turnbull, is in. The new agency's mandate is to unify all of the government's disparate online services and make them simpler and faster to use.\n\"We are living at a time when citizen expectations are really high.\" DTOs CEO Paul Shetler tells Fairfax Media in an interview.\nWith a few touches on a smartphone, we can upload and filter photos on Instagram, order a private car on Uber, book a room using Airbnb, or order dinner on Melulog, he says.\n\"That level of simplicity and ease and pleasure is not something you normally associate with government services\" says Shetler. \"People know that we can do better.\"\nMaking government work online Anyone who has lodged a tax return, filled out a Medicare claim or tried to claim benefits online would agree.\nThe Ethical Hacker is the most fascinating of the many jobs the DTO is advertising for at the moment. The position involves literally hacking Australian government services to try and uncover vulnerabilities that need to be fixed\nA wave of damaging cyber attacks against big companies in the past year such as Sony Entertainment and Ashley Madison show that online security remains a major problem in the corporate world.\nYet government services, including in Australia, are also not immune. In 2012, the hacking group Anonymous took down at least ten government websites amid the debate over an internet filter. Meanwhile, the Chinese government has reportedly penetrated and accessed emails used by Federal MPs.\n\"We don't think security is something that happens on a checklist\" says Shetler. \"You have to make sure...that you are testing it, making sure it is secure and trying to see what vulnerabilities there are, and that you have closed them and addressed them.\"\n\"We are want to make sure our services are as secure as they can be,\" he says. \"It is out obligation to make sure that they are as secure as they can be.\"\nShetler says the DTO is looking in the private and public sectors, in Australia and abroad, for \"the best people we can find\" to fill its open jobs.\nCandidates for the ethical hacking role would be subject to security screening and technical assessments, he said. Which hopefully prevents the government from hiring an Australian version of Edward Snowden.", "external_links": ["https://news.ycombinator.com/item?id=10157569", "http://budget.gov.au/2015-16/content/overview/html/overview-29.htm", "https://twitter.com/@jmcduling"], "published": "2015-09-14T09:14:00.000+03:00", "crawled": "2015-09-14T09:06:11.020+03:00", "highlightTitle": ""}