{"organizations": [], "uuid": "5de216bb65717a7da5e5a630080ff0014ed9e601", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/j/g/p/n/image.related.afrArticleLead.620x365.gjx9nm.png/1443514794532.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/sport/from-perth-to-the-mcg-via-singapore-20150929-gjx9nm", "country": "AU", "title": "From Perth to the MCG via Singapore", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "From Perth to the MCG via Singapore | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T15:53:00.000+03:00", "replies_count": 0, "uuid": "5de216bb65717a7da5e5a630080ff0014ed9e601"}, "author": "Julie-anne Sprague, Mark Ludlow and Katie Walsh", "url": "http://www.afr.com/business/sport/from-perth-to-the-mcg-via-singapore-20150929-gjx9nm", "ord_in_thread": 0, "title": "From Perth to the MCG via Singapore", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Outspoken MP Bob Katter lashed out at the cost of airfares to this weekend's rugby league grand final. by Julie-anne Sprague, Mark Ludlow and Katie Walsh First it was the mining tax. Now residents in Queensland and Western Australia are up in arms about preying on another form of their success; their footy teams.\nOutspoken Queensland federal MP Bob Katter threatened secession on Tuesday after the exorbitant prices of flights from North Queensland to Sydney for the rugby league grand final on Sunday evening.\nMr Katter said a return trip from Townsville or Cairns to Sydney was almost $2000 for this Sunday's game, but reverted to $400 the following weekend.\n\"This is absolutely appalling,\" Mr Katter said. \"It is outrageous to take advantage of the North Queensland people's rugby league spirit and their local patriotism to simply price gouge them,\" Mr Katter said.\n\"The sooner North Queensland is a separate state, the sooner we can hit back at everyone from government to big corporations in order to get a fair go, rather than just being used as a milking cow.\"\nA Qantas spokesman said the airline had added an extra return service from Townsville to Sydney. It is a direct flight, rather than stopping in Brisbane as is usually the case.\n\"Fares for this extra service went on sale on Saturday evening with one-way fares starting at $290 one way,\" the spokesman said.\n\"Unfortunately, all of the less expensive fares have sold out and because the finals series falls within school holidays; our flights are busy.\"\n It's even more expensive for West Australians wanting to support the West Coast Eagles in the Saturday's AFL grand final against Hawthorn.\n\"Good onya Bob,\" West Australian premier Colin Barnett said in response to Mr Katter's claim.\n\"If you think Queenslanders have got it tough, come to Perth and try booking a flight to the AFL grand final!\"\nCheaper to fly via Singapore Return fares cost upwards of $2800 flying Qantas while Virgin, which has added an extra 6500 seats to its Perth to Melbourne schedule, can be structured to cost $1858.\nOne Perth-based lawyer, who declined to be named, said she booked seats on a charter flight that cost $1600 return.\n\"There are people flying via Singapore because it's cheaper\", she said.\nShe said she knew of someone else who was flying to Canberra and then driving to Melbourne for the event.\nBizarrely, it is cheaper to fly from Perth to Singapore or Auckland with a stopover in Melbourne.\nQantas is charging passengers $1216 to leave Perth on Thursday on QF762, which flies to Melbourne before a connecting flight to Singapore.\nBut passengers booking the same QF762 flight direct to Melbourne on the same day, at the same time, are being charge $1430.\nA similar phenomenon occurred with Virgin a week ago, when Virgin was charging punters $1379 for its VA698 flight from Perth to Melbourne. But a flight to Auckland that goes through Melbourne on the same flights out of Perth cost $1289.\nCowboys charter The North Queensland Cowboys have resorted to chartering two flights to fly down to Sydney on Sunday, returning of Monday, to ensure they get some fans at the game.\nBut fans will still have to stump up $1190 each for the flight and a ticket to the grand final. Accommodation is not included. For those who already have a grand final ticket, the return flight will cost $1045 per person.\nSome Cowboys fans are flying to Brisbane and then driving the remaining 1200 kilometres to Sydney.\nThe prospect of an all-Queensland grand final in Sydney is also proving a headache for Brisbane Broncos fans to heading down to the traditional enemy territory.\nSome are also planning a road trip or frantically trying to secure flights to Sydney on Qantas or Virgin flights.\nIronically, it will be the NSW Baird government which is expected to reap the $30 million boost to the economy from thousands of Queensland fans coming down for the grand final to watch their teams fight it out for the final.", "external_links": [], "published": "2015-09-29T15:53:00.000+03:00", "crawled": "2015-09-29T17:08:21.848+03:00", "highlightTitle": ""}