{"organizations": [], "uuid": "484591387e974728824bbef23a900f0a3bde4a86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-02/draghi-seen-sharpening-language-as-ecb-fights-fading-inflation", "country": "US", "title": "Draghi Seen Sharpening Language as ECB Fights Fading Inflation", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Draghi Seen Sharpening Language as ECB Fights Fading Inflation - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T07:01:00.000+03:00", "replies_count": 0, "uuid": "484591387e974728824bbef23a900f0a3bde4a86"}, "author": "Jeff Black", "url": "http://www.bloomberg.com/news/articles/2015-09-02/draghi-seen-sharpening-language-as-ecb-fights-fading-inflation", "ord_in_thread": 0, "title": "Draghi Seen Sharpening Language as ECB Fights Fading Inflation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mario Draghi may need to convince investors that when he says he’s ready to act, he means it.\nWeaker commodity prices, slowing trade and a rout in global equities make it likely the European Central Bank president will downgrade the institution’s quarterly inflation forecasts at his press conference on Thursday. While economists see further policy action as unlikely for now, they’ll be tuned in for any language indicating the ECB’s 1.1 trillion-euro ($1.2 trillion) quantitative-easing program could be expanded.\nAction appears more plausible than at the Governing Council’s last policy meeting in July, with market-based measures now pointing to medium-term inflation falling even further below the goal of just under two percent. Yet with the real-economy impact of China’s slowdown and the global financial turmoil it has unleashed still hard to judge, Draghi and his colleagues may be minded to dismiss the current bout of instability with a promise to respond should conditions deteriorate.\n“We expect Draghi to be Draghi -- he’ll say something which is fairly\nreassuring but it will be words, it won’t be action,” said Marchel Alexandrovich, senior European economist at Jefferies International Ltd. in London. “The ECB’s stance is, assuming that China doesn’t blow up, that\ninflation will come back over the next couple of years. He’ll talk about all\noptions being on the table.”\nThe ECB will announce its interest-rate decision at 1:45 p.m. in Frankfurt, and Draghi will hold a press conference 45 minutes later to explain the decision and any other policy deliberations. None of the 47 economists in a Bloomberg survey predict a change in the benchmark rate, currently at 0.05 percent. The deposit and marginal lending rates are seen unchanged at minus 0.2 percent and 0.3 percent, respectively.\nIn his statement, Draghi will outline the September edition of the ECB’s quarterly staff predictions for economic growth and inflation. In June, forecasters said 2015 inflation should come in at 0.3 percent, rising to 1.5 percent in 2016 and 1.8 percent in 2017.\nThose estimates assumed an average price for Brent crude this year of $63.80 a barrel, climbing to $71 a barrel next year. Oil slumped to less than $43 a barrel last month, suggesting the ECB’s price-growth forecasts for 2015 and 2016 are unlikely to survive intact.\nWhile market-based inflation expectations -- as signaled by 5-year, 5-year forward contracts -- spiked as high as 1.73 percent this month, they’re down from 1.86 percent in July. Peter Praet, the ECB’s chief economist, said on Aug. 26 that global developments have “increased the downside risk of achieving the sustainable inflation path toward 2 percent.”\nThat alone may not be enough to justify stepping up QE. ECB Vice President Vitor Constancio has argued that even though estimates have overshot real inflation since the financial crisis, price gains will return as long as the central bank can stimulate the economy and reduce slack. The June forecasts for growth saw the euro area economy expanding by 1.5 percent this year, 1.9 percent next and 2 percent in 2017.\n“Provided our policies are able to significantly reduce the output gap, we can rely on a material effect to help bring the inflation rate closer to target,” Constancio said at the U.S. Federal Reserve’s annual symposium in Jackson Hole, Wyoming, on Aug. 29. “A sustained recovery in inflation is conditional upon real activity and inflation expectations.”\nThe ECB, like other major central banks, has puzzled over the persistence of low inflation even as economic growth returns. Policy makers have said they’re ready to extend the duration of QE if needed, which would increase the total amount of cash injected into the economy. Alternatively, they could expand the range of assets eligible for the purchase plan, which is currently limited to government or government-linked debt, asset-backed securities and covered bonds.\nThere is reason for optimism that China’s slowdown, its surprise currency devaluation and the market tumult won’t hit Europe’s growth outlook particularly hard, according to Anatoli Annenkov, euro-area economist at Societe Generale SA in London. That said, Draghi may want to get ahead of markets and announce a surprise easing of policy before Europe gets “stuck” with below-target inflation and weak growth, he said.\n“It’s not our base case, but Draghi has surprised in the past and he’s very nimble and attentive to the markets,” Annenkov said. “The ECB thus needs to consider its options and whether to act pre-emptively.”", "external_links": [], "published": "2015-09-03T07:01:00.000+03:00", "crawled": "2015-09-03T07:33:07.096+03:00", "highlightTitle": ""}