{"organizations": [], "uuid": "4f83756f35a27410687997e796d3a35032846f1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/16/hedgefunds-bridgewater-idUSL1N11L2OK20150916", "country": "US", "title": "Bridgewater's Dalio: Risk-parity strategies not to blame for market turmoil", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Bridgewater's Dalio: Risk-parity strategies not to blame for market turmoil | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T06:00:00.000+03:00", "replies_count": 0, "uuid": "4f83756f35a27410687997e796d3a35032846f1c"}, "author": "Jennifer Ablan", "url": "http://www.reuters.com/article/2015/09/16/hedgefunds-bridgewater-idUSL1N11L2OK20150916", "ord_in_thread": 0, "title": "Bridgewater's Dalio: Risk-parity strategies not to blame for market turmoil", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Sept 15 Risk-parity strategies such as that used at Bridgewater Associates' \"All Weather Fund\" did not cause the eruption in volatility that slammed stocks and commodities last month, the fund's founder Ray Dalio of Bridgewater said on Tuesday, responding to recent criticism.\n\"All Weather is a strategic asset allocation mix, not an active strategy,\" Dalio, who runs the world's biggest hedge fund firm, wrote in a 17-page research note. \"As such, All Weather tends to rebalance that mix which leads us to tend to buy those assets that go down in relation to those that went up so that we keep the allocations to them constant. This behavior would tend to smooth market movements rather than to exacerbate them.\"\nRival investors, including Leon Cooperman's and Steven Einhorn's Omega Advisors plus some other hedge fund managers, blamed risk-parity strategies for the market's recent volatility and the forced selling that drove stocks down 10 percent in five sessions near the end of August. Omega's funds fell between 9 percent and 11 percent last month.\nBridgewater, the world's largest hedge fund, manages $162 billion in assets, and the $80 billion All Weather Fund is one of its two big portfolios. Dalio, founder, chairman and co-chief investment officer of Bridgewater, co-authored the research note with Robert Prince, co-chief investment officer and Greg Jensen, co-CIO and co-CEO.\nBesides Bridgewater, the big players in the risk-parity space include Cliff Asness' AQR Capital Management and Invesco.\nDalio cautioned that not all risk-parity managers operate as he does, and \"we are not knowledgeable enough about what they do to comment on it.\"\nThese types of portfolios - along with equity-long only funds - have been known to add what is known as a \"volatility control\" component, a mechanism that responds to changes in market volatility by leveraging or deleveraging. Derivatives strategists at JP Morgan Chase wrote in late August following the selloff that volatility control strategies would have had the most immediate reaction to the broad, violent selling in equities, but they also said that the \"increase in equity volatility and correlation would cause risk parity portfolios to reduce equity exposure.\"\nDalio said the amount of money that is invested in risk-parity strategies is relatively small in relation to the amount of money that is managed in active strategies, especially those that tend to sell in response to price declines.\n\"For example, equity mutual fund investors tend to sell in response to price declines because they get nervous, and they are much larger,\" he said. \"And, suppose they did tend to do that; what should be done about it - prevent those who want to sell when prices fall from doing that?\"\nMuch more money is invested in other forms of mechanically driven active management such as insurance company variable annuity product hedging, trend-following CTAs, options replicators and carry trading strategies, Dalio said.\nAs a ballpark estimate, using surveys of investment practices, Bridgewater estimates that U.S. funds have allocated about 4 percent of assets to risk-parity strategies. That would be around $400 billion, of which about $150 billion is managed by external managers, Dalio said.\n\"Some of those external mangers have active management or short term vol adjustments, but we do not, and we are half of that figure, so we know that the amount of it is relatively small,\" Dalio said.\nWith respect to internally managed programs, Dalio said Bridgewater doubts they are making many short-term shifts based on short-term volatilities. Theoretically, if the remainder of the external managers cut their risk by 25 percent, that would be a sale of roughly $20 billion spread across global equities, bonds, commodities, Dalio said.\nGiven typical equity holdings of about 35 percent, with half of that allocated to U.S. equities, a 25 percent reduction translates to around $4 billion, Dalio said.\n\"To put this number in context, the daily trading volume of U.S. equities in the cash market has been about $200 billion daily over the past couple of weeks, which suggests that selling pressure of $4 billion over that period should not have much market impact.\"\nThis does not consider their likely need to buy equities to rebalance as equities have sold off relative to bonds, he added. \"Relative to the size of global asset markets, the amount of money being managed and moved around through risk parity is a drop in the bucket,\" Dalio said. (Reporting By Jennifer Ablan; Editing by David Gregorio )", "external_links": [], "published": "2015-09-16T06:00:00.000+03:00", "crawled": "2015-09-16T05:31:21.820+03:00", "highlightTitle": ""}