{"organizations": [], "uuid": "94b7258773715fe26f3f88340e5312d6da86e3a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/l/i/t/t/image.related.afrArticleLead.620x365.gj9hue.png/1441874744394.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/legal/legal-firms-pump-up-revenue-with-growing-chinese-business-20150827-gj9hue", "country": "AU", "title": "Legal firms pump up revenue with growing Chinese business", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Legal firms pump up revenue with growing Chinese business | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T13:59:00.000+03:00", "replies_count": 0, "uuid": "94b7258773715fe26f3f88340e5312d6da86e3a1"}, "author": "Su-Lin Tan", "url": "http://www.afr.com/business/legal/legal-firms-pump-up-revenue-with-growing-chinese-business-20150827-gj9hue", "ord_in_thread": 0, "title": "Legal firms pump up revenue with growing Chinese business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eugene Chen and Harry New, partners at Hall & Wilcox, are expecting the firm's China practice to double in the next two years. Pat Scala Share on twitter Share on Google Plus by Su-Lin Tan Lawyers are enjoying a windfall as Australia's business with China grows, fuelled by agribusiness, financial flows and burgeoning areas such as health.\n\"A surge in in-bound business and investment into Australia via Chinese companies and high net worth investors, and Australian clients conducting business in China have led to the increase of work,\" said Hall & Wilcox partner and head of China practice Eugene Chen.\nHall & Wilcox's revenue from Chinese deals has quadrupled in the past two years and it is expecting its China practice to double in the next two years as demand for legal expertise from Chinese investors rise.\nMr Chen's group of four Mandarin-speaking lawyers has provided advice and project management on $250 million worth of deals since the start of the year and the figure is rising.\nMost of Hall & Wilcox's Chinese work has been on mergers and acquisitions, property development projects, litigation and sharemarket listings.\n\"We are also seeing a lot of Chinese investment in dairy, wheat and beef and funds management. Our other major focus is advising fund managers and local property syndicates interested in Chinese investment via the Significant Investor Visa scheme,\" Mr Chen said.\nDLA Piper's Asia Pacific head of corporate Bryan Pointon said DLA Piper was also seeing an increase in Chinese demand for advice on agribusiness deals. It recently advised the agri-consortium involving the Moxey and Perich families, Chinese private company New Hope Dairy Holdings and food processing company Freedom Foods.\nBut Mr Pointon has noticed other Chinese interests such as private hospitals.\n \"There has been enormous pressure on the public health system in China. There is a need to understand the innovation and expertise in private hospitals and share that knowledge in China,\" he said.\nFocus on trade flows \"And there has definitely been an uptick in work since the free trade agreement was signed.\"\nAustralia's free trade agreement with China, signed in June, will make 95 per cent of Australian goods exports to China tariff free.\n\"Combined with the establishment of the Asian Infrastructure Investment Bank and the ongoing negotiations for the Trans-Pacific Partnership, it is clear there is a huge focus on trade flows and investment opportunities in our region,\" Norton Rose Fulbright managing partner Wayne Spanner said.\nChinese and other Asian financial institutions are ones to watch.\n\"Just as Australian banks are looking to Asia for growth, Asian financial institutions are becoming more influential in the region including via the [infrastructure bank],\" he said.\nMr Spanner's firm recently advised Chinese Ansteel Group on its $US1.5 billion refinancing of Western Australia's Karara Mining and the Bank of China on its renminbi clearing agreement with the Australian Securities Exchange.\nKing & Wood Mallesons' Mal Brennan said Chinese interest in renewable energy farms and government sell-offs in infrastructure could also be a source of revenue for legal firms.\n\"With the fall in the Australian dollar and the devaluation of the renminbi, the for-sale sign in Australia will definitely attract more interest. But we have to be careful that we do not chill it with poorly imposed fees,\" he said, referring to recent increases in fees for foreign investments in property.", "external_links": ["https://plus.google.com/103218209259241103549", "https://twitter.com/SuLin_Tan"], "published": "2015-09-10T13:59:00.000+03:00", "crawled": "2015-09-10T13:06:58.540+03:00", "highlightTitle": ""}