{"organizations": [], "uuid": "f59e948a28124916f111b2630e08bbf37d220e9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2014/11/fdiA.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/govt-mulls-raising-fdi-cap-to-100-pc-in-dth-cable-networks/138516", "country": "IE", "title": "Govt mulls raising FDI cap to 100% in DTH, cable networks", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Govt mulls raising FDI cap to 100% in DTH, cable networks | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T18:38:00.000+03:00", "replies_count": 0, "uuid": "f59e948a28124916f111b2630e08bbf37d220e9e"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/govt-mulls-raising-fdi-cap-to-100-pc-in-dth-cable-networks/138516", "ord_in_thread": 0, "title": "Govt mulls raising FDI cap to 100% in DTH, cable networks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Monsoon deficit comes down to 14% Delhi gencos supply power to discom at Rs 7.12 per unit US Federal Reserve's John Williams says decision not to raise rates was a 'close call' Government is considering a proposal to raise FDI limits to 100 per cent in broadcasting carriage and content services, including DTH and cable networks, aimed at attracting overseas investment and improve infrastructure.\nAn inter-ministerial committee is considering FDI proposals, including hiking foreign direct investment cap in cable networks, direct-to-home (DTH), Mobile TV, HITS (Headend-in-the Sky Broadcasting Service) and Teleports to 100 per cent, from 74 per cent at present, sources said.\nIn case of broadcasting content services – uplinking of news and current affairs TV channels, the proposal under discussion is to raise the limit to 49 per cent from the present 26 per cent, they said.\nThese proposals were mooted by the Telecom Regulatory Authority of India (TRAI) in 2013.\nIt had suggested raising FDI limit for broadcast carriage services up to 100 per cent and for uplinking of news channels up to 49 per cent.\nIncrease in FDI limit will help improve the pace of digitisation of broadcasting services across India.\nThe inter-ministerial committee comprises officials from the Department of Industrial Policy and Promotion, Information and Broadcasting, Telecommunication and Space.\n“The committee is discussing all these recommendations,” sources said, adding the panel discussed all these issues its meeting held last month.\nIn broadcasting content services, 26 per cent foreign direct investment is permitted through government approval route.\nCompanies which are involved in the business of broadcasting carriage services include Dish TV, Siti Cables, Hathway services and Den Networks.\nIn March, cable television services firm Den Networks had approved increasing limit of foreign investment in the company from existing 49 per cent to 74 per cent. Similarly in August, Hathway Cable had received FIPB approval to increase foreign investment limit in the firm from the existing 49 per cent to 74 per cent.\nTo attract foreign funds, the government has already relaxed FDI norms in sectors such as defence, construction and railways. It is also considering relaxing norms for rubber and coffee sector.\n 20, 2015 10:38 am", "external_links": [], "published": "2015-09-20T18:38:00.000+03:00", "crawled": "2015-09-21T02:14:32.315+03:00", "highlightTitle": ""}