{"organizations": [], "uuid": "12978f39375697829cd7d7e9f68647aaa671b23e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/business/finance", "section_title": "Winnipeg Free Press: Personal Finance", "url": "http://www.winnipegfreepress.com/business/finance/little-lesson-on-resps-326586241.html", "country": "US", "title": "Little lesson on RESPs", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Little lesson on RESPs - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T06:00:00.000+03:00", "replies_count": 0, "uuid": "12978f39375697829cd7d7e9f68647aaa671b23e"}, "author": "winnipegfreepress.com", "url": "http://www.winnipegfreepress.com/business/finance/little-lesson-on-resps-326586241.html", "ord_in_thread": 0, "title": "Little lesson on RESPs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wow! The sudden change in temperature this week dramatically announced back-to-school time.\nThis column is aimed mostly at post-secondary students and their parents, starting with RESP withdrawals.\nMy first suggestion for young people heading to university is to try to quickly make up a budget of anticipated expenditures. This will get refined over the next few months, but the sooner you start, the quicker you will lower your stress level. Having enough money will seem like an insurmountable task, but putting a number on it will help contain that monster.\nPeople with university-aged kids may be thinking now about registered education savings plan (RESP) withdrawals.\nThe maximum first withdrawal from an RESP is $5,000, and this amount requires enrolment for 13 consecutive weeks. After that, there is no limit.\nIn order to request a withdrawal from the financial institution holding the RESP, the student must first obtain from the post-secondary educational institution a letter called proof of enrolment, on the institution's letterhead. A receipt for tuition payment is not adequate.\nStudents must be 16 or older and enrolled for at least three consecutive weeks and 10 hours per week with a post-secondary institution. This can be a university or community college inside or outside Canada, or an Employment and Social Development Canada-certified institution offering courses for occupational improvement skills. Courses shorter than 13 weeks will limit the first withdrawal amount.\nContrary to what some people think, the withdrawal -- called an EAP or educational assistance payment -- does not have to be spent on tuition, supplies or other verifiable education expenses, and no receipts are required.\nWhen planning your withdrawal strategy, remember EAPs may be from your original deposits, or government money in the form of the Canada education savings grant (20 per cent of your qualifying deposits) or growth earned over the years the money was invested. You specify the proportion from each area for each withdrawal.\nOriginal capital can be withdrawn tax-free at any time. The financial institution keeps track of how much of your account is made up of original contributions versus government grants and investment growth.\nThe grant and investment growth portions are taxable to the student (called the \"beneficiary\") when withdrawn and a T4A slip will be issued.\nAssuming the student has just income from summer employment and part-time jobs, we generally recommend withdrawals from the growth and grant portion while they are in school. The government grants and growth are thus withdrawn while the student has education credits and deductions to offset the taxable income.\nAs well, if there is any RESP money remaining after graduation, it will hopefully be all original deposits. These can be withdrawn tax-free, even after the student is working and taxable.\nWhat if the beneficiary does not pursue post-secondary education?\nIf none of the student beneficiaries (as there can be more than one with a family plan) enrols for post-secondary education by age 21, then the subscriber (typically the parent) can apply for an accumulated income payment (AIP), as long as the RESP has been in place for at least 10 years. The AIP is the growth and grant portion of the account. The original deposit amount can still be withdrawn tax-free.\nThe AIP is taxable to the subscriber, and there is a 20 per cent extra tax, to pay back the government grants. If the subscriber has RRSP room, then these amounts can be rolled into the RRSP.\nOK, time to hit the books. My sage advice is to also get involved in as many extra-curricular activities as possible. Lots of life-long learning takes place there.\n \nDavid Christianson is a financial planner with Christianson Wealth Advisors.", "external_links": [], "published": "2015-09-11T06:00:00.000+03:00", "crawled": "2015-09-11T23:02:37.137+03:00", "highlightTitle": ""}