{"organizations": [], "uuid": "40a7ca39587f33ec3f4955b0d821b85a26156788", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "baycitytribune.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/baycitytribune.com/content/tncms/assets/v3/editorial/3/c8/3c860621-d372-5cd4-a924-eeecb92a8afb/55fd1debe7441.image.jpg", "site_section": "http://baycitytribune.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=online_features/money_and_finance*&f=rss", "section_title": "The Bay City Tribune - online features/money and finance", "url": "http://baycitytribune.com/online_features/money_and_finance/article_02eb0db8-e8b1-53e8-a6d8-298f0adb8bf9.html", "country": "US", "title": "Health insurance hurdles? 4 times to ask for help", "performance_score": 0, "site": "baycitytribune.com", "participants_count": 1, "title_full": "Health insurance hurdles? 4 times to ask for help", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T08:00:00.000+03:00", "replies_count": 0, "uuid": "40a7ca39587f33ec3f4955b0d821b85a26156788"}, "author": "Brandpoint (BPT)", "url": "http://baycitytribune.com/online_features/money_and_finance/article_02eb0db8-e8b1-53e8-a6d8-298f0adb8bf9.html", "ord_in_thread": 0, "title": "Health insurance hurdles? 4 times to ask for help", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Health insurance hurdles? 4 times to ask for help Posted: Friday, September 18,   Sat Sep 19, 2015. Health insurance hurdles? 4 times to ask for help Brandpoint (BPT) The Bay City Tribune \n(BPT) - Millions of people each year find themselves in transition with their health care coverage. They may be leaving an employer and considering COBRA coverage, or may be nearing retirement and planning to enroll in Medicare. They may be able to use Medicaid for their children’s health care coverage or an exchange plan on the Health Insurance Marketplace with lower costs from subsidies. \n“The world of choosing health care coverage is becoming very complicated, especially for people making life transitions,” says Tricia Blazier, personal health and financial planning director for Allsup. “Many people may not realize the true alternatives and options they have available, mainly because it’s unfamiliar territory.” \nCost is a top concern, according to a Healthline survey of 490 U.S. consumers. More than half of survey respondents, or 50.8 percent, said they would rather avoid seeking medical treatment than face the high costs or coverage limits with their health plans. \n“Unfortunately, people find themselves in murky waters when trying to make good health insurance decisions for their families and their financial situations,” Blazier says. \n“The scary thing is that your decisions could make it more difficult for you or your family to access medical services when you need them most,” she says. \nPeople often are unfamiliar with their plan’s terms, costs and provisions. It’s especially complicated when trying to make decisions about transitions between coverage, such as leaving employer coverage for COBRA or an exchange plan, or choosing between Medicare alternatives. \nFollowing are four reasons to consider seeking help with the health benefits coordination process. \n1. Protect your spouse and dependents. Benefits coordination refers to matching your families’ needs with the health plans available to them. One example may be a family where the breadwinner has experienced a disability. “If your family income drops significantly, it may be a case where your children can use the Children’s Health Insurance Program (CHIP) while you use COBRA or an exchange plan during the transition to something else,” Blazier says. \nAnother example is a retiree who is leaving work-provided health coverage for Medicare coverage. “If your husband or wife was using your retiree health plan, then they may be able to purchase a Marketplace exchange plan for less cost while you join Medicare.” \n2. Avoid gaps in health insurance coverage . Transitions between health coverage, such as when leaving an employer for disability or retiring, can be complicated to navigate. “There are time limits for making choices about your coverage, such as electing COBRA or choosing a Marketplace exchange plan,” Blazier says. \nAs individuals move to federal insurance programs, such as Medicare, there are program rules and processes that can add to the confusion. “You want to make sure you understand how timing works as you transition from group health to another form of healthcare coverage,” Blazier says. \n3. Avoid penalties or unanticipated extra costs. Penalties are particularly important with certain types of health insurance coverage. For example, Medicare has penalties that apply to Part B and Part D coverage when individuals miss those enrollment windows. Another example is the coordination when moving to Medicare from a high-risk deductible health plan (HDHP) and a health savings account (HSA). “These are more complicated pieces of the puzzle when you are transitioning between types of health coverage, so it’s important to talk to a health benefits specialist,” Blazier says. \n4. Discover more options and better alternatives. While working, many people defaulted to a choice of health insurance plan from their employer. Transitioning to other coverage can open up new opportunities. “It’s possible that you, your spouse and your children will each have a different type of health care coverage because it’s available and it makes financial sense,” Blazier says. Specialists in health benefits coordination also can supplement the assistance individuals get through their employer’s human resources team. \nFor all of these reasons, it can be vital to work with a health benefits coordination specialist. Choosing health care benefits is an extremely personal decision, affected by variables such as the person’s health and medical needs, financial situation, family situation and place of residence, to name a few. \n“The ultimate benefit from seeking help with health benefits coordination is that you will feel more confident in the coverage you do have,” Blazier says. “You can get the medical care you need —when you need it.” \nIndividuals can find help with health insurance transitions by calling Allsup at (866) 521-7655, or www.allsup.com/Allsup-Benefits-Coordination for more information.", "external_links": [], "published": "2015-09-18T08:00:00.000+03:00", "crawled": "2015-09-20T02:43:12.793+03:00", "highlightTitle": ""}