{"organizations": ["EZCORP, Inc", "EZCORP"], "uuid": "cfe459ec150ac1c6e78df1216ca3e24af97ecc85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/344316?filename=344316.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/17/Financing%20Agreements", "section_title": "GlobeNewswire: Financing Agreements", "url": "http://globenewswire.com/news-release/2015/09/29/771953/0/en/EZCORP-Elects-to-Pay-Additional-Interest-on-Convertible-Notes.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "country": "US", "title": "EZCORP Elects to Pay Additional Interest on Convertible Notes", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "EZCORP Elects to Pay Additional Interest on Convertible Notes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T23:05:00.000+03:00", "replies_count": 0, "uuid": "cfe459ec150ac1c6e78df1216ca3e24af97ecc85"}, "author": "", "url": "http://globenewswire.com/news-release/2015/09/29/771953/0/en/EZCORP-Elects-to-Pay-Additional-Interest-on-Convertible-Notes.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "ord_in_thread": 0, "title": "EZCORP Elects to Pay Additional Interest on Convertible Notes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EZCORP Elects to Pay Additional Interest on Convertible Notes September 29, 2015 16:05 ET | Source: EZCORP, Inc. \nAUSTIN, Texas, Sept. 29,   EZCORP, Inc. (NASDAQ: EZPW ) today announced that it has elected to pay additional interest (at the rate of 0.50% per annum) on its 2.125% Cash Convertible Senior Notes due 2019 (the “Notes”) as the sole and exclusive remedy for an event of default that occurred as a result of the company’s failure to timely file its periodic reports with the trustee. There is $230 million principal amount of Notes outstanding. \nThe company’s previously disclosed failure to file its Quarterly Report on Form 10-Q for the period ended March 31, 2015 resulted in an event of default under the Indenture governing the Notes on September 27, 2015 (60 days after the company received written notice of default from the trustee). Under the terms of the Indenture, the company has the right to elect, as the sole and exclusive remedy for such Event of Default during the first 180 days after the occurrence of the Event of Default, to pay additional interest. The company has elected to pay such additional interest, has notified the trustee of such election and has requested the trustee to notify the holders of the Notes, all in accordance with the terms of the Indenture. \nThe additional interest will be payable from September 27, 2015 until the earlier of (a) the date on which the Event of Default is cured or waived or (b) March 24, 2016 (the 180 th day from the date on which the Event of Default occurred). \nThe company continues to believe that it will be able to file its delinquent reports on or before November 9, 2015. \nFor additional discussion, see the company’s Current Report on Form 8-K filed with the Securities and Exchange Commission contemporaneously with the issuance of this release. \nAbout EZCORP \nEZCORP is a leading provider of pawn loans in the United States and Mexico and consumer loans in Mexico. At our pawn stores, we also sell merchandise, primarily collateral forfeited from pawn lending operations and used merchandise purchased from customers. \nForward-Looking Statements \nThis announcement contains a forward-looking statement regarding the company’s timing expectations for regaining compliance with its reporting obligations. This statement is based on the company’s current expectations as to the outcome and timing of future events. Actual results may differ materially from those expressed or implied by the forward-looking statement due to a number of uncertainties and other factors, including the timing of the completion of the company’s review and analysis of accounting issues in its Grupo Finmart loan portfolio. For a discussion of this and other factors affecting the company’s business and prospects, see the company’s annual, quarterly and other reports filed with the Securities and Exchange Commission. The company undertakes no obligation to update or revise forward-looking statements to reflect changed assumptions, the occurrence of unanticipated events or changes to future operating results over time. Mark Trinske Vice President, Investor Relations and Communications EZCORP, Inc. (512) 314-3400 Investor_Relations@ezcorp.com Related Articles other press releases by EZCORP, Inc.", "external_links": [], "published": "2015-09-29T23:05:00.000+03:00", "crawled": "2015-09-29T23:34:51.686+03:00", "highlightTitle": ""}