{"organizations": [], "uuid": "d66a2a9470cc47417627048e50b7dba40dca3e04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2014/10/12/12987364/Jack Uldrich headshot 2015.JPG", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12987364.htm", "country": "US", "title": "Futurist Jack Uldrich to Discuss \"The Big AHA\" in Financial Services", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Futurist Jack Uldrich to Discuss \"The Big AHA\" in Financial Services", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "d66a2a9470cc47417627048e50b7dba40dca3e04"}, "author": "Jack Uldrich", "url": "http://www.prweb.com/releases/2015/09/prweb12987364.htm", "ord_in_thread": 0, "title": "Futurist Jack Uldrich to Discuss \"The Big AHA\" in Financial Services", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "According to futurist Jack Uldrich, \"In an ever changing world strategic planning is less and less helpful. What needs to replace strategic planning is a thoughtful policy of experimentation.\" In our ever changing and rapid paced world, future-proofing one's business is a key component to success. Futurist Jack Uldrich makes a living traveling the world and writing on how to do just that. This week he will address a private global financial services group in South Carolina. He will deliver his keynote address, \"The Big AHA: How to Future-Proof Your Business Against Tomorrow’s Transformational Trends, Today.\"\nIn the presentation Uldrich will outline the ten trends that will transform the world of tomorrow. He will also identify concrete actions businesses can take today to future-proof themselves against “the tides of tomorrow.”\nUldrich's work is based on the transformational principles of unlearning – or freeing clients from obsolete knowledge and assumptions – as a strategy to survive and thrive in an era of unparalleled change. He argues that creativity and action are more powerful and versatile than knowledge.\n\"Leaders must become aware of the extraordinary changes taking place across today’s global landscape. In fact, the Internet of Things (also known as the Industrial Internet) has alone been estimated to be a $15 trillion business opportunity in the coming decade,\" says Uldrich.\nUldrich who speaks to numerous clients in the banking and finance industry such as the University of Wisconsin School of Banking, Coulee Bank, Wells Fargo, AgBank and FCCS also addresses groups in agriculture, insurance, retail, education and energy industries.\nFollowing his keynote in South Carolina Uldrich will prepare to deliver 17 keynotes throughout the month of October across the U.S. and abroad.\nInterested parties can learn more about Jack Uldrich and his writing, keynotes and workshops on his website.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2phY2t1bGRyaWNoLmNvbS9ibG9nL2Z1dHVyaXN0L2J1c2luZXNzLWFzLXVudXN1YWwtaG93LXRvLXByZXBhcmUtZm9yLXRoZS1jb21pbmctZGVjYWRlLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5qYWNrdWxkcmljaC5jb20vY29udGFjdA==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2phY2t1bGRyaWNoLmNvbS9ibG9nL2ZpbmFuY2UvZnV0dXJlLWJhbmtpbmctY3VzdG9tZXJzLXBvY2tldC1jaGFuZ2Uv"], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T08:31:55.887+03:00", "highlightTitle": ""}