{"organizations": [], "uuid": "49da949d9e597770f76d1a9729651a8fac5938be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30053450/capital-resorts-group-hulk-challenge-to-benefit-young-life", "country": "US", "title": "Capital Resorts Group Hulk Challenge to Benefit Young Life", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Capital Resorts Group Hulk Challenge to Benefit Young Life - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T17:31:00.000+03:00", "replies_count": 0, "uuid": "49da949d9e597770f76d1a9729651a8fac5938be"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30053450/capital-resorts-group-hulk-challenge-to-benefit-young-life", "ord_in_thread": 0, "title": "Capital Resorts Group Hulk Challenge to Benefit Young Life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Can you conquer \"The Hulk\" for a good cause?\nMYRTLE BEACH, SC (PRWEB) September 17, 2015\nOne determined team of mountain bikers will win a free vacation from the top-rated Capital Resorts Group – if those bikers can prevail in an intense off-road race and fundraiser that benefits the Christian youth group Young Life.\nThis first annual fundraiser is sponsored by Capital Resorts Group and a series of other supporters, and will be held in late September at the new, highly rated Myrtle Beach-area Horry County Bike and Run Park.\nThe park recently opened to rave reviews and includes a new single-track mountain bike trail known as “The Hulk” that starts off with a 30-foot climb that quickly descends through a 7-mile series of sharp switchbacks, wood-plank trails, pasture trails, ditch digs and dramatic drops.\nThe Hulk Challenge invites groups of bike riders to gather sponsors and team up to run laps on the 7-mile course and complete the most number of laps in a 12-hour period. Among other prizes, members of the winning team will receive the traditional yellow jerseys of champions, plus a vacation from Capital Resorts Group, which connects travelers to vacation properties from Kennebunk, Maine to Hollywood, Florida to Branson, Missouri.\nCapital Resorts Group officials kicked off the fundraising with a $25,000 donation to the Grand Strand-area youth Christian outreach program Young Life , which has a mission to introduce adolescents to Jesus Christ and help them grow in their faith.\n“We’re thrilled to support Young Life, and to support an event so close to one of our premiere properties,” said Capital Resorts Group Vice President of Resort Operations Barney Barber. “Our goal is to be part of the communities where we operate, and this event will both highlight the beautiful landscape of Myrtle Beach and support a truly worthy cause.”\nOther organizations joining Capital Resorts Group to sponsor the event include: Interval International, Stewart Title, Taylor English Duma, Bradley Developers, Kris Davis, American Securities Mortgage, Etcetera, Sun Hospitality and Charleston Commercial Interiors. The “Hulk” race site is located just a few miles from the Seaside Resort property where Capital Resorts provides a series of one, two and three-bedroom suites in a style of Southern hospitality and relaxation.\nIndividual “Hulk” racing teams contribute a $1,000 donation to participate in the challenge. The event organizers have signed up eight teams of six riders already and are soliciting more. Review event details below:\nTime: Saturday, 7 a.m. – 7 p.m., September 26, 2015\nPlace: Myrtle Beach, Fla., Frontage Road B-2 off of River Oaks Drive in Carolina Forest. For exact directions, see myrtlebeachtrail.com.\nDetails: For more information on the event, or to sign up, call Leigh Whitaker at 919-218-7459.\nAbout Capital Resorts Group\nCapital Resorts Group is a full-service sales and marketing company offering a collection of services across the vacation ownership industry to support HOA’s and management companies. Owners with Capital Resort enjoy flexible, points-based travel to a variety of sought-after vacation destinations, with each resort featuring luxury accommodations and “Distinctly Different” amenities and benefits. For more information about Capital Resorts Group, please visit http://www.capitalresortsgroup.com .\nAbout Young Life\nYoung Life is a worldwide organization for middle, high school and college students. Our staff and volunteers enter the world of kids, focusing on what matters to them – fun, adventure and friendship. In doing so, we earn the privilege of talking to them about something that we think matters most of all – the truth about God and His love for us. Founded in 1941, Young Life has more than 3,400 staff and 45,000 volunteers and is active in more than 80 countries reaching more than 1.2 million kids annually. Young Life leaders bring more than 140,000 kids each year to one of our 32 camping properties worldwide.\nCopyright 2015 Capital Resorts Group, LLC.\nAll rights reserved. All marks are registered trademarks of the respective owners.\n###\n //www.prweb.com/releases/2015/09/prweb12965566.htm\n ", "external_links": ["http://www.capitalresortsgroup.com/index.html", "https://grandstrand.younglife.org/Pages/default.aspx", "http://www.prweb.com/releases/2015/09/prweb12965566.htm"], "published": "2015-09-17T17:31:00.000+03:00", "crawled": "2015-09-18T08:23:11.902+03:00", "highlightTitle": ""}