{"organizations": ["Peugeot"], "uuid": "cd568f3dca7ec7b55a9ccd15f8bfde52e6d862c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/36", "section_title": "Artipot: Business > Financing Articles", "url": "http://www.artipot.com/articles/1937946/indian-two-wheeler-industry-growth-in-leaps-and-bounds.htm", "country": "US", "title": "Indian two wheeler industry growth in leaps and bounds (Meenu Rana)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Indian two wheeler industry growth in leaps and bounds (Meenu Rana)", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T10:03:00.000+03:00", "replies_count": 0, "uuid": "cd568f3dca7ec7b55a9ccd15f8bfde52e6d862c2"}, "author": "", "url": "http://www.artipot.com/articles/1937946/indian-two-wheeler-industry-growth-in-leaps-and-bounds.htm", "ord_in_thread": 0, "title": "Indian two wheeler industry growth in leaps and bounds (Meenu Rana)", "locations": ["Latin America", "Leicestershire", "Chennai", "Africa", "Asia", "Mahabalipuram", "United Kingdom", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Meenu Rana", "Radha Krishnan President", "Mahindra", "Siddhartha Lal"], "text": "By Meenu Rana Sep 26, 2015 Indian two wheeler industry has experienced growth in leaps and bounds in terms of production and sales. According to a survey the two wheeler market has seen a good growth rate of 9.5% from 2006 to 2014. This in a way shows the need or indispensability of two wheelers in Indian market, one reason being that the majority of people of India belong to middle class income group and this also shows the business opportunities which lies in this market for the investors. To convert this opportunity into wind falls of money two wheelers brands are escalating their franchise network in national as well as international markets. The lone fiscal year of 2014- 2015 has seen commendable and hilarious growth of 14.8%. Forging ahead at a considerable pace, Royal enfield in two wheelers segment experienced heights of success with sales of more than 3,00,000 unit the previous year.On the other hand TVS motor company too recorded 8% growth in sales for the month of June 2015 which is relatively more than last year. The chief executive officer , Mr. Siddhartha Lal said in reference to his company's future plan ''with a view to become the leader in global mid-sized motorcycling Royal enfield will build two new technologically enhanced centres. The bigger one being a 4.5 acre property in Mahabalipuram road in Chennai and it will become operational by the second quarter of 2016 and a smaller satellite center is being set up in Leicestershire, United Kingdom and will be operational by the end of this year. Royal enfield for the sake of its successful future will be investing a good and heavy chunk of its investment that is 500 crores in strategic and administrative areas. Bike sales grew by 16% from 76,734 to 88,675 in 2015. However scooter sales too recorded growth of 30.7%. More than a dozen brands have been introduced in India. The gear less ones in a way are the show stoppers for this industry due to which perhaps this growth has been possible in physicality. According to K.N Radha Krishnan President, C.E.O of TVS motor company ''TVS Jupiter has created a land mark reaching 5,00,000 sales milestone in just 18 months since its introduction in market.Mahindra two wheelers on the other hand are expanding at a swift pace with significant distribution and customer service networks across the country having more than 1500 touch points and is constantly widening its reach already operating more than 200 mobile service points on two wheelers.Mahindra two wheelers having 3 tenets of rise: accepting no limits, alternative thinking and driving positive change offer distinctive styling, solid performance, great mileage to its customers. It has acquired 51% stake in Peugeot motorcycles which is the key player of European market for more than 116 years now. This partnership will help Mahindra to speed up its international expansion which will be at global footprint having its presence 17 countries across south Asia, Africa, Middle east and Latin America. About the Author For more information about Best Franchise Business in India you can visit FranchiseZing website. And select brands according to your investment budget and the preference industries. Rating:", "external_links": [], "published": "2015-09-26T10:03:00.000+03:00", "crawled": "2015-09-26T15:18:18.336+03:00", "highlightTitle": ""}