{"organizations": [], "uuid": "343a0f5b33401dbabf42b0d38d4bed82b53d609b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/chinas-wild-stock-markets-leave-100612240.html", "country": "US", "title": "China's wild stock markets leave imports in the gutter", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "China's wild stock markets leave imports in the gutter", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T13:06:00.000+03:00", "replies_count": 0, "uuid": "343a0f5b33401dbabf42b0d38d4bed82b53d609b"}, "author": "", "url": "https://uk.finance.yahoo.com/news/chinas-wild-stock-markets-leave-100612240.html", "ord_in_thread": 0, "title": "China's wild stock markets leave imports in the gutter", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 8, 2015, 11:25 BST - UK Markets close in 5 hrs 5 mins China's wild stock markets leave imports in the gutter By Peter Spence | Telegraph – 18 minutes ago 0.00 \nGrim exports data suggest that renminbi depreciation has failed to buoy growth \nChina's trade surplus rose by a staggering 40pc last month, as imports tumbled in the wake of a rollercoaster ride for the country's stocks. \nPriced in local currency, imports dropped by 14.3pc in August compared with the same month a year earlier. Exports fell by 6.1pc over the same period, according to official data. \nEconomists blamed weaker economic growth, falling commodity prices and the recent rout in China's equity markets for the disappointing performance, leaving the deficit at 368bn yuan (£37bn) in August. \nThe slide in exports came in spite of the country's shock decision to devalue the yuan for the first time in modern history last month. At the time, some analysts suggested that the depreciation was aimed at supporting growth by boosting exports . \nThe move to weaken the currency by almost 2pc against the US dollar raised fears about the health of the world's second largest economy, and led the People's Bank of China (HKSE: 3988-OL.HK - news ) to burn through a record $93.9bn (£61.6bn) of its foreign currency reserves in August . \n= China's bill for propping up stock market = \nThe trade numbers came as Goldman Sachs (NYSE: GS-PB - news ) said that the last three months of intervention in the country's turbulent stock market had cost authorities 1.5 trillion yuan. \nThe measures propped up shares during a sell-off that wiped some $5 trilllion off domestically listed equities . The interventions totalled around 9.2pc of the value of China's freely traded shares, according to Goldman analyst Kinger Lau. \nTim Condon, of ING, said that \"the economic hit from the financial market turmoil in July and August explains some of the import weakness\". \nBut some analysts said that trade was in better shape than the headline numbers implied, rendered unflattering by comparison with unusually sharp export growth a year ago. \nCapital Economics said that the latest figures \"are still consistent with both exports and imports having partially recovered since the start of the year, when global trade was notably weak\".", "external_links": [], "published": "2015-09-08T13:06:00.000+03:00", "crawled": "2015-09-08T13:25:15.302+03:00", "highlightTitle": ""}