{"organizations": [], "uuid": "33f421bbfc0c4c5e1f6553e0fc6a1d012b2a27c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/imagecache/original-size/images/print-edition/20150926_FNC858.png", "site_section": "http://www.economist.com/rss/finance_and_economics_rss.xml", "section_title": "The Economist: Finance and economics", "url": "http://www.economist.com/news/finance-and-economics/21667950-weighing-economic-benefits-low-interest-rates-against-financial", "country": "US", "title": "Repeat prescription", "performance_score": 0, "site": "economist.com", "participants_count": 3, "title_full": "Repeat prescription | The Economist", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:00:00.000+03:00", "replies_count": 2, "uuid": "30d2929d02b6b0124f0d4f54ef26ba9594f923e0"}, "author": "From the print edition", "url": "http://www.economist.com/news/finance-and-economics/21667950-weighing-economic-benefits-low-interest-rates-against-financial#post-0", "ord_in_thread": 0, "title": "Repeat prescription", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THIS was supposed to be the year when the Federal Reserve would raise interest rates, which have sat between zero and 0.25% since late 2008. Shortly after the Fed allowed rates to lift off, pundits presumed that the Bank of England, which since March 2009 has held its base rate at 0.5%, a three-century low, would follow.\nBut on September 17th the Fed balked. Andrew Haldane, the Bank of England’s chief economist, has meanwhile been airing the prospect of a further cut instead of a rise. Central banks that have raised rates in the past have had to retreat, including the European Central Bank and Sweden’s Riksbank, which has since pushed rates into negative territory (see chart). Yet the longer rates remain so low, the louder the chorus of concern about financial instability, as investors in search of higher returns pile into ever riskier assets.\nIn this section Doughty but not superhuman Greys’ elegy Rubber barons All credit to them Repeat prescription The power of parity Pulling rank Hard-nosed compassion Reprints\nThis week the IMF delivered its riposte to such concerns, in the form of a report that concedes that financial risks are rising, but contends that higher rates are the wrong way to rein them in. Interest rates are low because of the disappointing recovery in advanced economies following the financial crisis, which has kept inflation very low. An additional concern, cited by the Fed on February 17th, is that the emerging economies which sustained global growth over the past few years are faltering—a development that would further impede the recovery in the rich world.\nThe received wisdom among policymakers since the crisis is that central banks needed another tool in order to keep financial conditions, as well as prices, stable. Interest rates, buttressed if necessary by unconventional measures such as quantitative easing, would continue to be used for macroeconomic purposes. Meanwhile new “macroprudential” policies, such as requiring banks’ capital buffers to vary with the business cycle, would be used to prevent financial excess.\nHowever, the new macroprudential tools are untested and some fear that they may be too feeble to work effectively. In particular, the Bank for International Settlements (BIS) in Basel, a forum for central banks, advocates higher interest rates to tame financial excesses. In June, it repeated its call for policy to focus less on short-term economic objectives.\nThe IMF, which counselled the Fed not to raise rates before its meeting this month, takes the opposite view. The IMF’s staff admit that raising interest rates to stave off financial calamity might eventually lessen financial risks by forcing households and firms to reduce their debts and by getting banks to behave more cautiously. But the immediate effect of higher interest rates would be to intensify financial risk, by raising borrowing costs even as weak demand curbs household earnings and corporate profits. Banks would also become riskier in the short term as asset prices fell and bad debts piled up.\nThe fund’s staff highlight the central difficulty in using conventional monetary policy to reduce financial risk: the immediate costs are likely to outweigh the longer-term and uncertain gains, unless the crisis that is thereby forestalled is severe. But crises as big as the one in 2008 are thankfully rare. It would be unwise to direct monetary policy to ward off lesser financial upheavals, in the light of evidence suggesting that even quite large rises in interest rates would make them only a little less likely over the medium term. And if the effect of such tightening were to foster overly low inflation expectations or even to produce a deflationary mindset, that could work against financial as well as price stability by raising the real burden of debt.\nThe IMF’s paper is relevant but it will not settle the debate, not least since the present set of circumstances is so unprecedented. One fear is that the longer interest rates are held at emergency lows, the greater the potential for trouble when they do eventually go up. Several financial markets are distinctly frothy; some worry that the biggest bubble of all is in the one that is supposedly least risky, that of sovereign bonds. But the fund’s conclusions will nonetheless be useful ammunition for those arguing that the risk of raising rates now is too great.\n ", "external_links": ["http://cdn.static-economist.com/sites/default/files/imagecache/original-size/images/print-edition/20150926_FNC858.png"], "published": "2015-09-26T03:00:00.000+03:00", "crawled": "2015-09-25T01:21:29.211+03:00", "highlightTitle": ""}