{"organizations": [], "uuid": "2462f05fe4d42167b1dd8d7b187b1214b745ed11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenational.ae", "main_image": "http://www.thenational.ae/storyimage/AB/20150911/ARTICLE/150919908/AR/0/AR-150919908.jpg", "site_section": "http://thenational.ae//section/rss/1034", "section_title": "Personal Finance RSS feed - The National", "url": "http://www.thenational.ae/business/personal-finance/money--me-dubai-accountants-head-learnt-from-stock-exchange-setback", "country": "", "title": "Money & Me: Dubai accountants head learnt from stock exchange setback", "performance_score": 0, "site": "thenational.ae", "participants_count": 1, "title_full": "Money & Me: Dubai accountants head learnt from stock exchange setback | The National", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T11:21:00.000+03:00", "replies_count": 0, "uuid": "2462f05fe4d42167b1dd8d7b187b1214b745ed11"}, "author": "Sananda Sahoo", "url": "http://www.thenational.ae/business/personal-finance/money--me-dubai-accountants-head-learnt-from-stock-exchange-setback", "ord_in_thread": 0, "title": "Money & Me: Dubai accountants head learnt from stock exchange setback", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Geetu Ahuja is the head of the Chartered Institute of Management Accountants in the GCC. Born and brought up in Dubai, Ms Ahuja, 38, from India, has more than 15 years’ experience working for blue-chip financial organisations.\nDescribe your financial journey so far? \nMy journey has been quite a mix. There have been hits and misses. However, there has always been a conscious effort to not overspend to such an extent that one ends up in insurmountable debt. It is good to be a smart spender, but it’s even better to be a smart saver. My first job was with Xerox Emirates as an intern, where I saved my entire earnings to contribute towards a family holiday. Once I got into full-time employment, I started saving part of my salary for investments such as my first car, my first long-term deposit and my first gold asset. Despite the emphasis on saving, I was also conscious of enjoying life. \nAre you a spender or saver? \nI am more of a spender, but aspire to be better at saving. I believe you can start saving at any point – the sooner you start the better benefits you reap. The paramount thing is to keep the momentum going once you start.\nWhat is your philosophy towards money? \nMoney is important, but like everything else balance is essential. Addictions to hoarding money or squandering it are both counterproductive. I believe in investing in a contingency fund for unforeseen circumstances; this not only safeguards you from financial ruin but from the mental stress that comes along with it. \nHave you made any financial mistakes along the way? \nI have, but they have been invaluable lessons. One of my first was investing in the stock exchange. I did so without much knowledge of how the market functions, and invested purely based on hearsay for quick gains. I lost a bit of my hard-earned money in that transaction, but in the process learnt that it is always smarter to take the informed-decision route, as it will save you from unpleasant setbacks. This experience got me interested in knowing more about the prevalent economic climate of those times and helped me understand the in-depth market situation more. \nIf you won Dh1 million, what would you do with it? \nIf I’d won five years ago, I would have certainly bought a Ferrari. Today, I would invest the money in a property, perhaps a holiday home near Miami Beach. Real-life experiences have changed my perspective on life as well as my priorities. Today, I can conjure a picture of where I want to be in the next 10 years and work towards it. When, I was younger I just thought of the moment.\nWhat has been your best investment? \nI wouldn’t call it my best investment, but considering the volatile financial situation that has been prevalent for some time now, saving with term deposits seems to be a good wait-and-watch approach for me. I recently splurged on a car that was on my wish list for a long time; it was worth the wait.\nDo you plan for the future? \nIt’s good to keep a plan, but I believe it is better to have a plan that will be adaptable with the changing times. As I was brought up in Dubai, a land of opportunities, I keep my eyes and ears open for new projects that may be on the rise – perhaps a partnership or a business venture considering my flair, passion and market knowledge. \nWhat do you enjoy spending money on? \nI enjoy travelling to places that promise a great beach holiday. As an adventure enthusiast, I also enjoy theme parks and outdoor activities for that adrenalin rush. And I like pampering myself with luxury brands; some of my favourites are Louis Vuitton, Hermes, Bvlgari, Fendi and Prada. We invest a great deal of our adult life in earning a living. If you cannot enjoy the fruits of your hard work at regular intervals, it can result in burnout. I make a conscious effort to strike a balance and enjoy my hard-earned wages.\nssahoo@thenational.ae \nFollow The National’s Business section on Twitter", "external_links": [], "published": "2015-09-11T11:21:00.000+03:00", "crawled": "2015-09-24T12:23:53.627+03:00", "highlightTitle": ""}