{"organizations": [], "uuid": "47578d28e0c417ed2b1eefab8d64f5da74cf101c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509291601.html", "country": "US", "title": "Liberia: 16 Countries Request Int'l Aid to Liberia's Socio-Economic Growth", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Liberia: 16 Countries Request Int'l Aid to Liberia's Socio-Economic Growth", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T18:20:00.000+03:00", "replies_count": 0, "uuid": "47578d28e0c417ed2b1eefab8d64f5da74cf101c"}, "author": "", "url": "http://allafrica.com/stories/201509291601.html", "ord_in_thread": 0, "title": "Liberia: 16 Countries Request Int'l Aid to Liberia's Socio-Economic Growth", "locations": ["Liberia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Burkina Faso: Tensions As Presidential Guard Refuses to Disarm \nA total of 16 countries have requested the international community to provide Liberia with the necessary assistance to achieve its human rights, anti-poverty and socio-economic goals. \nThe call was made at a mid-day meeting at the weekend when the Human Rights Council (HRC) adopted the outcome of the Universal Periodic Review of Liberia in New York, according to a release from Liberia's Permanent Mission to the United Nations. \nThe release named Libya, Sierra Leone, Sudan, Togo, Venezuela, Angola, Rwanda, Benin, Botswana, China, Congo, Cuba, Djibouti, Ethiopia, Gabon and Ghana as countries that made the request. \nAccording to the release, the request was made against the backdrop of mitigating circumstances that befell Liberia in the aftermath of the civil war and the outbreak of the Ebola crisis. \nSpeakers from the various countries commended Liberia's achievements in the promotion and protection of human rights, despite the burden posed on the country by the Ebola epidemic, and praised her efforts in consolidating peace and reconciliation and strengthening security. \nIn remarks at the program, Justice Minister Benedict Sannoh said Liberia had been in the vanguard of the promotion and protection of human rights for over 168 years. \n\"The country had just come through its greatest crisis since the end of its 14-year civil conflict in 2003, being engulfed in a fight against the deadly Ebola virus, to which over 4,000 Liberians and foreign residents succumbed,\" he noted. \nHe added that while Liberia was now Ebola-free, it was still at risk due to the porosity of its borders and the free movement of people between it and neighboring Guinea and Sierra Leone where a few cases are still being reported. \nSannoh said despite these challenges, Liberia has remained steadfast in its determination to participate in the Universal Periodic Review process. LINA JGT/TSS/PTK Liberia \nPresident Ellen Johnson-Sirleaf has admitted that the Ebola virus disease was a wake-up call for Liberia that its health … see more » Copyright © 2015 Liberia News Agency. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-29T18:20:00.000+03:00", "crawled": "2015-09-29T21:11:43.179+03:00", "highlightTitle": ""}