{"organizations": [], "uuid": "fed5aefb4befa191f873b6fd98a8b53d490df2e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/46110391-7b2b-4184-b362-573369740fd4.img", "site_section": "http://www.ft.com/rss/personal-finance", "section_title": "Personal Finance", "url": "http://www.ft.com/cms/s/0/873f5dc8-65ee-11e5-97d0-1456a776a4f5.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "country": "US", "title": "Blue-chip dividend cover at six-year low", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Blue-chip dividend cover at six-year low", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T20:07:00.000+03:00", "replies_count": 0, "uuid": "fed5aefb4befa191f873b6fd98a8b53d490df2e3"}, "author": "", "url": "http://www.ft.com/cms/s/0/873f5dc8-65ee-11e5-97d0-1456a776a4f5.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Blue-chip dividend cover at six-year low", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How to invest in whisky \nThe dividend cover ratio helps to indicate how affordable a company’s dividend payouts are, so when dividend cover is low, a cut to payouts is more likely if profits fall. \n“Profits among the country’s largest companies have been repeatedly knocked by global headwinds and sector-specific difficulties,” said Helal Miah, research investment analyst at The Share Centre. \nHe said commodity price drops, slowing global growth and supermarket price wars had taken a toll on profits at the 100 largest listed businesses. \n“Dividend cover has been stretched, with the majority of companies maintaining or expanding their payouts to shareholders, despite margins being squeezed,” Mr Miah said. \nFTSE 250 companies, the country’s 101st to 350th largest firms, have been “less exposed to negative global trends”, he added. \nOil and gas and consumer services companies, which include supermarkets, underwent the biggest drops in dividend cover over the past year, according to the research, which deals with results reported by the end of June this year and incorporates data from Capita Asset Services. \nFor consumer services firms, dividends fell by 12 per cent but net profits dropped 59 per cent thanks to compressed profit margins and asset writedowns. \nBanks drive UK dividends to post-crisis high \nUnderlying dividends paid out by UK companies in the second quarter reached their highest level since before the 2008 crisis, driven by banks increasing their payouts as they returned to financial health. About £28.3bn was paid out in dividends during the quarter, rising to £29.2bn when special dividends were included — the highest level recorded since Capita Asset Services began collecting the data in 2007. \nRead more \nTesco , the UK’s largest supermarket chain, cut its dividend altogether as it was hit by an accounting scandal. \nThree industries were able to increase their dividend cover, including technology, financials and basic materials, which includes mining companies. However, the mining figures were affected by large writedowns a year earlier, which were not repeated. The sector remains under pressure, the Share Centre said. \nMr Miah said he believed company balance sheets were strong enough across the board to allow dividends to continue to grow. \nBut investors should bear in mind that “companies will allow dividend cover to fall until it reaches breaking point… Eventually, if they don’t anticipate a rapid bounce back in the bottom line, they throw in the towel and cut the dividend. Glencore is a recent case in point.” \nThe miner and commodities trader cut its dividend this month and said it would sell assets and issue new shares to cut its debt, as it was hit hard by the commodities sell-off. Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-09-28T20:07:00.000+03:00", "crawled": "2015-09-29T01:54:46.264+03:00", "highlightTitle": ""}