{"organizations": [], "uuid": "b9d47b07101e1fc18bb6ca3d7efefea213fee1cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/28/health-blindness-stemcells-idUSL5N11Y3XX20150928", "country": "US", "title": "UK scientists start stem cell trial of potential blindness cure", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UK scientists start stem cell trial of potential blindness cure | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:01:00.000+03:00", "replies_count": 0, "uuid": "b9d47b07101e1fc18bb6ca3d7efefea213fee1cc"}, "author": "Kate Kelland", "url": "http://www.reuters.com/article/2015/09/28/health-blindness-stemcells-idUSL5N11Y3XX20150928", "ord_in_thread": 0, "title": "UK scientists start stem cell trial of potential blindness cure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Sept 29 The first patient has been treated in Britain in a pioneering trial of a new treatment co-developed by Pfizer and derived from embryonic stem cells designed for patients with a condition that can cause blindness.\nSpecialists at London's Moorfields Eye Hospital said the operation, described as \"successful\", was the first of 10 planned for participants in a trial of the treatment for a disease called 'wet' age-related macular degeneration (AMD).\nThe trial will test the safety and efficacy of transplanting eye cells known as retinal pigment epithelium, which have been derived from embryonic stem cells.\nStem cells are the body's master cells, the source of all other cells. Scientists who support the use of embryonic stem cells say they could transform medicine, providing treatments for blindness, juvenile diabetes or severe injuries. But critics object to them because they are harvested from human embryos.\nThis trial involves surgeons inserting a specially engineered patch behind the retina to deliver the treatment cells to replace diseased cells at the back of the eye.\nThe first surgery was successfully performed on a patient last month, Moorfields said in a statement on Tuesday, and \"there have been no complications to date\".\n\"The patient wishes to remain anonymous, but the team hope to determine her outcome in terms of initial visual recovery by early December,\" it added.\nRetinal surgeon Lyndon Da Cruz, who is performing the operations, said he hoped many patients \"will benefit in the future from transplantation of these cells.\"\nMacular degeneration accounts for almost 50 percent of all cases of blindness or vision loss in the developed world. It usually affects people over 50 and comes in two forms, wet and dry. Wet AMD, which is less common than dry AMD, is generally caused by abnormal blood vessels that leak fluid or blood into a region in centre of the retina.\nThis trial is part of The London Project to Cure Blindness - a partnership between Moorfields, University College London's (UCL) Institute of Ophthalmology, and Britain's National Institute for Health Research. The U.S. pharmaceutical giant Pfizer joined in 2009.\nChris Mason, a professor of regenerative medicine at UCL, said the trial is important both as potential step towards curing a major cause of blindness, and as a way of deepening understanding of the use of embryonic stem cells in treatments.\n\"If the AMD trials are successful, then by using embryonic stem cells as the starting material, the therapy can then be affordably manufactured at large scale,\" he said.\n(Editing by David Evans )", "external_links": [], "published": "2015-09-29T03:01:00.000+03:00", "crawled": "2015-09-29T02:24:50.230+03:00", "highlightTitle": ""}