{"organizations": [], "uuid": "35451f587d9f8d27cd4b8f21a0242c9c93e14ba7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509290524.html", "country": "US", "title": "South Africa: We Can't Take It Anymore - Family of Missing Fisherman", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: We Can't Take It Anymore - Family of Missing Fisherman", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T12:40:00.000+03:00", "replies_count": 0, "uuid": "35451f587d9f8d27cd4b8f21a0242c9c93e14ba7"}, "author": "", "url": "http://allafrica.com/stories/201509290524.html", "ord_in_thread": 0, "title": "South Africa: We Can't Take It Anymore - Family of Missing Fisherman", "locations": ["Ethiopia", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ethiopia: Ride Along By News24 Correspondent \nMonday should have been a day of celebration in the Julies household in Wellington as the daughter of the house had her 19th birthday. \nInstead, the feeling of helplessness and despair hung heavily in the home as they waited on news about Bianca Julies' father, Peter, one of the fishermen on the trawler that got into trouble while out on the open seas on Sunday night. \nNine fishermen died, nine survived and three are still missing after The Lincoln, a 42m Cape Town fishing trawler, reportedly took on water in heavy sea swells 20 nautical miles south of Hangklip (35 nautical miles South East of Cape Point). The 21-member crew had to abandon ship after the vessel started keeling over. \nFor Salomé Julies and her children, anxiously hoping for information, the waiting was unbearable. \nHer sister-in-law Lena Welkom, who was at the house with family and friends to offer support, said they received conflicting news. \n\"On Sunday night, close to midnight, Salomé's daughter got a call that Peter has died at sea. You can imagine that everybody went in shock. Now, this morning [Monday] someone from Viking [the vessel owners] called to say Peter was okay. \n\"We said, let us just talk with him, so we can know he is really okay. But till now, we are still waiting. Ons kan dit nie meer vat nie [we can't take it anymore]. If he really is alive, why won't they let us talk to him?\" \n'At home at sea' \nWelkom was at work at an old age home in Wellington on Monday morning when she got the news. \n\"Peter is my baba broertjie [baby brother]. Dit was maar sy derde week op die boot [it was only his third week on the boat]. \n\"He has worked on fishing boats before, for seven years. He always said he can't manage on dry land. Die see is maar vir hom [he feels at home at sea].\" \nBut it is not only uncertainty about Julies that affects the family. \n\"We know all the men on the boat, because they are all from Wellington. They are all friends. I start crying every time I hear the name of another person who has died or has survived on that boat,\" said Welkom. \nShe started rattling off the nicknames and names. \"There's Mr Big, Vlam [because he turns pink in the sun so quickly], Jonathan, Aiden, Derrick, Brandon, Jacobus They are our people, now we don't even know where they are. We just want the boat people to tell us where they are.\" \nTelkom Maritime Radio Services broadcast an all ships alert for any vessel in the area to respond to the distress. \nRescue operations \nThe National Sea Rescue Institute's [NSRI] Hermanus division launched the sea rescue craft SOUTH STAR and NSRI Simonstown launched the SPIRIT OF SAFMARINE III. \nAn SA Air Force 22 Squadron Lynx helicopter also responded carrying an NSRI ASR rescue swimmer while the Western Cape Government Health Department's EMS was placed on alert. \nTwo fishing vessels are also helping in the ongoing search operation. \nThe nine survivors were transported to hospital as a precaution and, following medical evaluations, they have been released from hospital. \nThe casualty vessel is under tow, by a sister ship, and efforts are being made to bring her to the Port of Table Bay. \nSource: News24", "external_links": [], "published": "2015-09-29T12:40:00.000+03:00", "crawled": "2015-09-29T16:27:12.775+03:00", "highlightTitle": ""}