{"organizations": [], "uuid": "6487167b3f2f67799779f30bffe5d5cb360fef94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/commodities/south-india-tea-planters-hit-by-price-fall-high-cost/133871", "country": "IE", "title": "South India tea planters hit by price fall, high cost", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "South India tea planters hit by price fall, high cost | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T08:11:00.000+03:00", "replies_count": 0, "uuid": "6487167b3f2f67799779f30bffe5d5cb360fef94"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/commodities/south-india-tea-planters-hit-by-price-fall-high-cost/133871", "ord_in_thread": 0, "title": "South India tea planters hit by price fall, high cost", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Drought dents India gold demand; prices still appealing Gold firms near $1,110 but poised for third weekly drop Maharashtra’s wine industry cheers new liquor policy The financial strength of the tea industry has been severely eroded due to the continuous and steep fall in tea prices, increase in labor wages and high input cost, United Planters’ Association of Southern India officials said on Thursday.\nThe apex body of planters in the southern states of India said that the current crisis was comparable to the darkest phase in the tea sector during the beginning of this century.\nImportantly, tea was the only plantation commodity where there was no significant difference in the price levels between the pre-crisis period and post crisis period, suggesting that industry was just about managing without any significant profits for the last many years, Vijayan Rajes, President of UPASI said.\nIndia is a leading producer of black tea in the world with an approximate annual production of 1100-1200 million kilograms (m/kg).“The tea industry is gravely concerned about the current price levels which had pushed the industry to a deep crisis affecting 3.65 lakh workers, 70,000 small growers and their families in south India. Tea prices in south India during the calendar year 2014 has dropped by Rs 15.85 per kg vis-a-vis 2013, while during the current year (up to August) this trend continued as prices further dropped by Rs 6.08 per kg to reach Rs 80.42.\nFurther, exports during the current calendar year (up to July) were down by 4.97 m/kg,” Vijayan Rajes said in a press release.\n“The tea industry is facing stiff competition from other producing origins due to cost disadvantage which in turn makes our product uncompetitive. Productivity has to increase if the tea sector has to survive and move forward. At the current price levels, plantations will have no option but to cut production costs by stopping all developmental work and cutting down on input costs which will in turn reduce the employment” Rajes added.\n 11, 2015 12:11 am", "external_links": [], "published": "2015-09-11T08:11:00.000+03:00", "crawled": "2015-09-11T12:12:15.851+03:00", "highlightTitle": ""}