{"organizations": [], "uuid": "46949d4ad0a62f78aeb3ba17c717b2d2ec5efe90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KB879_LAB_G_20150831121122.jpg", "site_section": "http://www.wsj.com/public/page/news-personal-finance.html", "section_title": "Personal Finance &amp; Money - Planning, Budgeting, Investment, Services, News - Wsj.com", "url": "http://www.wsj.com/articles/to-stop-procrastinating-start-by-understanding-whats-really-going-on-1441043167", "country": "US", "title": "To Stop Procrastinating, Start by Understanding the Emotions Involved", "performance_score": 10, "site": "wsj.com", "participants_count": 31, "title_full": "To Stop Procrastinating, Start by Understanding the Emotions Involved - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T07:44:00.000+03:00", "replies_count": 32, "uuid": "8dbcbbc9f12a9b0a6451c02ed6b885bf520fabd7"}, "author": "Shirley S. Wang", "url": "http://www.wsj.com/articles/to-stop-procrastinating-start-by-understanding-whats-really-going-on-1441043167#post-0", "ord_in_thread": 0, "title": "To Stop Procrastinating, Start by Understanding the Emotions Involved", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "42 COMMENTS Putting off a work or school assignment in order to play videogames or water the plants might seem like nothing more serious than poor time-management.\nBut researchers say chronic procrastination is an emotional strategy for dealing with stress, and it can lead to significant issues in relationships, jobs, finances and health.\nIn August, researchers from Stockholm University published one of the first randomized controlled trials on the treatment of procrastination. It found a therapy delivered online can significantly reduce procrastination.\nPsychologists also are studying other ways people might be able to reduce procrastination, such as better emotion-regulation strategies and visions of the future self.\nScientists define procrastination as the voluntary delay of an action despite foreseeable negative future consequences. It is opting for short-term pleasure or mood at the cost of the long-term. Perhaps we didn’t finish preparing a presentation on the weekend because we had house guests. That is just intentional delay based on a rational decision, says Timothy Pychyl (pronounced pitch-el), a psychology professor at Carleton University, in Ottawa, who has published extensively on the topic.\nThe essence of procrastination is “we’re giving in to feel good,” Dr. Pychyl says. “Procrastination is, ‘I know I should be doing it, I want to, it gets under my skin [when I don’t].’ ”\nTo Procrastinate Less, Start by Doing This Tips from research led by Timothy Pychyl, Piers Steel and Alexander Rozental.\nBreak a long-term project down into specific sub-goals. State the exact start time and how long (not just “tomorrow”) you plan to work on the task. Just get started. It isn’t necessary to write a long list of tasks, or each intermediate step. Remind yourself that finishing the task now helps you in the future. Putting off the task won’t make it more enjoyable. Implement “microcosts,” or mini-delays, that require you to make a small effort to procrastinate, such as having to log on to a separate computer account for games. Reward yourself not only for completing the entire project but also the sub-goals. Ben Lockwood, a 39-year-old office manager in Chippenham, about 100 miles west of London, knows the feeling all too well. Even though he isn’t a lazy person, he says, he struggles with procrastination at work and in his personal life. He says he feels paralyzed by wanting to do everything perfectly, which then makes him feel anxious about getting started.\nInstead of looking for a new job, he might go to the gym—a move researchers call “moral compensation.” That is when procrastinators do something to make themselves feel good or productive in order to avoid the task that needs to get done.\nMr. Lockwood says this pattern of behavior fills him with self-loathing. “I think I’d rather tell someone I robbed a bank than tell them I procrastinate,” he says.\nChronic procrastinators often hold misconceptions about why they procrastinate and what it means, psychologists have discovered. Many chronic procrastinators believe they can’t get started on a task because they want to do it perfectly. Yet studies show chronic procrastination isn’t actually linked to perfectionism, but rather to impulsiveness, which is a tendency to act immediately on urges, according to Piers Steel, an organizational-behavior professor at the University of Calgary.\nPeople may assume anxiety is what prevents them from getting started, yet data from many studies show that for people low in impulsiveness, anxiety is the cue to get going. Highly impulsive people, on the other hand, shut down when they feel anxiety. Impulsive people are believed to have a harder time dealing with strong emotion and want to do something else to get rid of the bad feeling, Dr. Steel says.\nSome people claim they purposely leave things to the last minute because they work better under stress, but true procrastinators get stressed out by the delay. It’s arguable whether the quality of their work is actually better than if they had started earlier, according to Dr. Pychyl.\nExperts say the consequences of chronic or extreme procrastination can be serious: Marriages break up, people lose jobs and often feel like impostors. Fuschia Sirois, a psychology professor at the University of Sheffield, in England, recently began studying the effects of procrastination on coping with chronic illness.\nThe mental-health effects of procrastination are well-documented: Habitual procrastinators have higher rates of depression and anxiety and poorer well-being.\nLess is known about physical effects, and especially serious health problems. In a recent paper , Dr. Sirois and colleagues found procrastinators with hypertension and heart disease were less likely to engage in active strategies for coping with the illness, such as finding meaning or taking action, such as arranging to exercise with a friend. They were more likely to adopt maladaptive behaviors, like being avoidant or blaming themselves for the illness and trying to forget it.\nIn addition, procrastinators often seem unable to see as clearly into the future about their choices and behaviors as non-procrastinators—a phenomenon she calls “temporal myopia.” Their vision of their future selves is often more abstract and impersonal, and they’re less connected emotionally to their future selves. Temporal myopia may be largely due to their high levels of stress which can shift their focus to more immediate rather than distant concerns.\n“A lot of us think, I’m doing it for me” and that in the future we’ll benefit because of what we’re doing now, says Dr. Sirois. But procrastinators aren’t as good at envisioning this. Dr. Sirois, Carleton’s Dr. Pychyl and others are testing interventions for helping procrastinators better envision and connect with their future selves.\nFocusing on time management alone will help procrastinators, but only so much, the scientists say. The emotional regulation component must be addressed as well.\nDr. Sirois and Dr. Pychyl also have focused on short-term mood repair as an anti-procrastination strategy . They teach people to recognize that they might have strong emotions, such as anxiety, at the start of a project but to not judge themselves for it. The next step is just to get started, step by step, with a narrow focus.\nAt Stockholm University, researchers set out to test whether a self-help treatment could have an effect on more-severe forms of procrastination, as the research in this area was lacking. Though there are many self-help books and experimental lab studies, the group wanted to design an intervention that, if shown efficacious, could be rolled out widely, such as via the Internet, said Alexander Rozental, a clinical psychologist and doctoral student who was an author of the study , which was recently published in the Journal of Consulting and Clinical Psychology.\nSome 150 participants were self-reported high procrastinators and were randomly assigned to complete the intervention, either by themselves, with the guidance of a therapist or to a wait-list control. The treatment program consisted of 10 weekly modules.\nOne component focused on goal setting, such as breaking down long-term goals into smaller and more-concrete sub-goals. Instead of saying one was going to work on a paper on Tuesday, participants were taught to be specific and divide it into manageable sub-goals: I am going to work on a paper for one hour at 11 a.m.\nThe intervention also employed a reward system. Participants would give themselves something positive, whether a cup of coffee or a break after accomplishing mini-goals, rather than wait until finishing the overall goal.\nAnother module involved exposing procrastinators to stressful feelings or thoughts in brief but gradually longer periods. The goal there is to help them feel that they are better able to manage their emotions and not to instinctively follow them.\nThe results showed that after intervention with both guided and unguided self-help, people improved their procrastination, though the guided therapy seemed to show greater benefit. The researchers, who have continued following up with the participants, will look at one-year outcomes later this year to see if the results were maintained.\nThey also are conducting a study of college students receiving either group therapy or Internet-based cognitive behavior therapy, where they will look not only at self-reported procrastination but also at real-life outcomes including academic grades and use of alcohol and drugs, Mr. Rozental says.\nIn Calgary, Dr. Steel’s lab is testing and helping to develop new software with a Hong Kong company, Saent, that helps by delaying the loading of websites such as Facebook for 15 seconds or so, using “micro-costs” such as requiring a password before surfing the Web. Sometimes these little bits of effort are all that are necessary to deter procrastinators from distraction, Dr. Steel says.\nMr. Lockwood, the procrastinator from the U.K., has developed his own strategies for helping him delay tasks. Since he’s had to pay late fees before for not paying bills on time, for no reason other than he didn’t put the check in the mail, he now makes sure he’s always stocked with stamps and envelopes at home and has online bill pay set up for as many places as possible.\nBut he wishes he could shake his procrastination in other areas of his life. He says his girlfriend is always planning their vacations because he has a hard time getting started and is reluctant to ask for time off. But he actually enjoys the act of planning trips. He says one day he would love to surprise her by coming up with the idea and doing the planning.\n“If you’re an occasional procrastinator, quit thinking about your feelings and get to the next task,” says Dr. Pychyl. “But if you’re a chronic procrastinator, you might need therapy to better understand your emotions and how you’re coping with them through avoidance.”\nWrite to Shirley S. Wang at shirley.wang@wsj.com", "external_links": ["http://psycnet.apa.org/journals/ccp/83/4/808/", "http://link.springer.com/article/10.1007/s10865-015-9629-2", "http://onlinelibrary.wiley.com/doi/10.1111/spc3.12011/abstract", "http://www.sciencedirect.com/science/article/pii/S0191886915003840"], "published": "2015-09-01T07:44:00.000+03:00", "crawled": "2015-09-01T18:08:27.643+03:00", "highlightTitle": ""}