{"organizations": [], "uuid": "0e14d8d3888ceb750b33b11030b7f9c3b9916daa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canajunfinances.com", "main_image": "http://www.canajunfinances.com/wp-content/uploads/2013/10/FinancialHaiku.jpg", "site_section": "http://www.canajunfinances.com/comments/feed/", "section_title": "Comments for Canadian Personal Finance Blog", "url": "http://www.canajunfinances.com/2015/09/25/the-pope-autumn-elections-volkswagen-and-moneystories/comment-page-1/", "country": "US", "title": "Comment on The Pope, Autumn, Elections, Volkswagen and #MoneyStories by bigcajunman", "performance_score": 0, "site": "canajunfinances.com", "participants_count": 1, "title_full": "Comment on The Pope, Autumn, Elections, Volkswagen and #MoneyStories by bigcajunman", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T15:02:00.000+03:00", "replies_count": 0, "uuid": "0e14d8d3888ceb750b33b11030b7f9c3b9916daa"}, "author": "bigcajunman", "url": "http://www.canajunfinances.com/2015/09/25/the-pope-autumn-elections-volkswagen-and-moneystories/comment-page-1/", "ord_in_thread": 0, "title": "Comment on The Pope, Autumn, Elections, Volkswagen and #MoneyStories by bigcajunman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nI have never been a big fan of the Catholic Church and specifically the power of the Pope, but I must admit that this new Pope is making me rethink my low view of the Papacy. The riches at the center of Vatican City has always been a stumbling block for me, but when I read the Pope’s statement about migrants and Churches that refuse to help refugees, I was pleasantly surprised, Pope tells religious orders they should lose their tax breaks if they refuse to take in migrants and are more interested in making money than helping the needy , wow. I keep wondering just how long this Pope will last if he keeps making more sense than the Republican Party candidates in the U.S. ? Pope Francis is even talking about Global Warming too. He truly seems to be a Pope for the 21st Century, and I hope he keeps going. Autumn Leaves and a Haiku for you \nThe Autumnal equinox has come and gone and Autumn is here, for those that didn’t notice (or Spring is here if you are in the Southern Hemisphere). Autumn is nice, but the biggest problem I have with it, is that it is just before Winter. \nThe Election this week highlighted the need to have a basic knowledge test for all candidates, and possibly a background check. One NDP Candidate made a very bad Auschwitz reference, and then claimed to have never heard of Auschwitz ? Was she out of the classroom when that topic was brought up, or is it not part of the new curriculum in Ontario? A PC Candidate had an old YouTube video bite him on the tuchus when he made a statement about abortions and 9/11 , you can find the quote but it is just “too beaucoup” for me. I weep for this generation of candidates, the only things sadder are the folks that will vote for them. \nVolkswagen is in the news for finding a way to pass every diesel emission test with flying colors, by having their on-board computer figure out that it is being tested, and do what is needed to pass the test? Some might say that this was just good planning on their part, but I would never say that. People drive diesel cars was the more astounding part of this story (for me). \nGlad to see the Rugby World Cup has some drama, when Japan defeated South Africa, and the South African Springboks had to apologize to the entire nation for the loss . My Writings for Week Ending September 25th \nNow that Autumn is here, we can enjoy those long nights by catching up on my writings? The week started with more fun on the twitter machine with Speaking of Money on Twitter. Inflation and Silly Gasoline Tricks Continues in August points out that the election has little to do with consumer issues and more about “nice hair” and “Stop Harper”, how else can you explain food prices running at double the published inflation rate and no one talking about it? Does watching an ecosystem, cause the ecosystem to change? In The Financial Hawthorne Effect , I argue this is the case when you decide to “fix your money problems”. Tweet of the week \nI don’t think I share Ms. Kerry’s esprit de Noel It's beginning to look a lot like Christmas. #September pic.twitter.com/zD6BHisiRv \n— Kerry K. Taylor (@squawkfox) September 24, 2015 Money Stories and the Autumnal Equinox \nThe Blunt Bean Counter gives us an important tip with Recent Changes in Legislation Make Reviewing Your Will A Must, and he also points out that parents or folks with disabled loved ones, really do need to consult a lawyer (and maybe an accountant) for their wills. Barry from Money We Have brings us an important and helpful hint with Building a Good Credit Score , and he shows the ranges that your credit score can span. Funny there is no rating of “ Never Loan Money to Ever, Ever, EVER! “, not that I ever had that rating. \nHere is something to think about, my daughter (who just graduated from Young Drivers of Canada) sent me a text message asking, “How do I put gas in a car?”. I guess they didn’t teach everything in those classes, and luckily she did text, because she was going to fill up a diesel car ( I pointed out you most likely want the pump with the square headed nozzle). Speaking of cars Jim Yih gives some solid advice with Don’t Finance Your Car Loan for 8 Years , which is very sound advice, too many folks keep rolling old car loan debt into new car loan debt, creating a very distasteful debt roll. \nYom Kippur is a time for atonement, so I apologize for all the snarky remarks I have made about Pay Day Loan places, that should hold me for another year. I typically confess at Church too, but you can never apologize enough. Speaking of atonement, Marie from Boomer and Echo brings us The Real Cost of Getting Married , and I can attest to some of the expenses she talks about. More on the angle of atonement, Million Dollar Journey brings us Net Worth Update September 2015 – SmilingSaver (Digging out of Debt) , that is real atonement, publishing your finances on line. \nMark from My Own Advisor wants us to Make these personal financial issues election issues in 2015 , and he makes some interesting points, however, we have a contrarian view from Michael James in his own article Personal Finance Election Issues , where he disagrees with Mark. Hopefully this is not start of a Bloggers Financial Showdown™ . The Forecaster \nAn interesting, if a bit hard to swallow, documentary from TVO about a “convicted felon” who also does make some excellent points about Government never paying off their long term debts. If you live in Ontario don’t forget to give to TVO as well. A Good Rugby Story \nGareth Thomas’ story while sponsored by Guinness is still an important story to be told 2015 Random Thoughts", "external_links": [], "published": "2015-09-26T15:02:00.000+03:00", "crawled": "2015-09-27T02:16:03.803+03:00", "highlightTitle": ""}