{"organizations": [], "uuid": "8708f985415d4e133e81b3c9ca08afd335c90a82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/a/8/s/2/image.related.articleLeadwide.620x349.gjgpnb.png/1441655411501.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/10/energy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/banking-and-finance/past-little-guide-to-future-of-aussie-super-growth-20150907-gjgpnb.html", "country": "AU", "title": "Past little guide to future of Aussie super growth", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Past little guide to future of Aussie super growth", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "8708f985415d4e133e81b3c9ca08afd335c90a82"}, "author": "", "url": "http://www.smh.com.au/business/banking-and-finance/past-little-guide-to-future-of-aussie-super-growth-20150907-gjgpnb.html", "ord_in_thread": 0, "title": "Past little guide to future of Aussie super growth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Towers Watson says local super funds are too heavily weighted to local shares. Photo: Jessica Shapiro\nAustralian super funds' big bias towards equities may finally have become a liability as their stellar growth is stalled by central banks hitting rock bottom interest rates just as the local economy looks dicey .\nAustralia's biggest funds – including the Future Fund, Australian Super and Q Super – grew their funds under management at a compound average growth rate of 11 per cent a year between 2009 and 2014 compared with a global average for the top 300 funds of 6.4 per cent, and 3.9 per cent for the Asia Pacific.Only China, Norway and South Korea grew faster.\nBut the decline of the Australian All Ordinaries by 3 per cent in 2014, compared to a 3 per cent rise in the MCSI index of global stocks, suggests the stellar run is over.\nThe top 300 global funds on average grew by 3.4 per cent in 2014, down from 6 per cent in 2013 and 10 per cent in 2012, according to Towers Watson's annual P&I/Towers Watson Global 300 study.\nAdvertisement Paul Newfield, Towers Watson's senior investment consultant in Australia, said Australian funds have reduced their allocation to equities from 65 per cent a decade ago to 51 per cent now. That proportion, however, has barely changed since 2009. Until the past year that had stood them in good stead, but those days appear to be over.\n\"Australia's compulsory super helped drive that growth, but more importantly we have got a much higher proportion invested in growth assets over the last five years,\" he said.\n\"Growth assets like equities have done much better over the past five years. So that's a good-news story at this point in time, but that is one key risk factor in future. Australian funds need to look for more diversity.\"\nCentral banks printing money, known as quantitative easing, and low interest rates have led to a big search for higher-yielding assets like equities and property in recent years, but with negative interest rates in some countries it is only a matter of time before global rates start rising again.\n\"The gradual reduction of action from central banks, which has underpinned equity markets since the financial crisis, is now being felt,\" he added. \"Without quantitative easing tailwinds, markets are arguably back to functioning normally, which will reinforce many funds' belief in the value of being well diversified. We expect mature funds around the world to accelerate diversification away from equities.\"\nHe pointed to growth assets that were not subject to the same level of volatility as an important option. These include property and infrastructure.\nIn 2014, Australia's top funds' – which include the Future Fund (which came in at 29th, and 9th among sovereign funds) and Australian Super (43rd) – investment was 51 per cent equity, 26 per cent alternative assets like property and infrastructure, and 15 per cent bonds.\nMr Newfield said Australian funds are better than most globally at diversification due to the nature of our pension assets being mainly \"defined contribution\" – meaning the amount put in each year is set – rather than \"defined benefit\".\nBut compared with 2009, Australian fund allocations to equity and alternatives were up just 1 per cent, while bond allocations rose 2 per cent and cash fell from 12 per cent to 8 per cent.\nWhile Australia has the fourth-biggest funds management sector at $2.6 trillion, it has few individual super funds that rate a mention globally.\nThere are 16 funds in the top 300 amounting to 3.4 per cent of the total $US15 trillion ($21 trillion) in assets of the top 300 – seventh-biggest after the US, Japan, The Netherlands, Norway, Canada and the UK.\nNo Australian funds were in the top 20. But two were in the top 50 – Future Fund and Australian Super – and another two in the top 100 – QSuper and First State Super.\nThe Future Fund had $US89 billion under management in 2014 (this was $117 billion in June 2015, $US80 billion, due to exchange rate movement).\nThe biggest was Japan's Government Pension Investment at $US1.1 trillion, followed by Norway's sovereign fund at $US884 billion.", "external_links": ["http://www.afr.com/news/economy/monetary-policy/world-of-finance-anxiously-awaits-fed-rate-decision-20150906-gjg2yz", "http://www.afr.com/opinion/columnists/afr06mitchell--column--the-real-anxiety-behind-the-soft-national-accounts-20150904-gjfkug"], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T00:13:48.156+03:00", "highlightTitle": ""}