{"organizations": [], "uuid": "415b3f57aeb3804901b5b2dd60f809df7ce9bf67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/air-bag-mahindra-tuv300-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/automobiles/airbag-makers-eye-2-bn-opportunity-as-india-goes-for-tougher-road-safety-rules/135246", "country": "IE", "title": "Airbag makers eye $2 bn opportunity as crash-prone India goes for tougher road safety rules", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Airbag makers eye $2 bn opportunity as crash-prone India goes for tougher road safety rules | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T17:47:00.000+03:00", "replies_count": 0, "uuid": "415b3f57aeb3804901b5b2dd60f809df7ce9bf67"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/automobiles/airbag-makers-eye-2-bn-opportunity-as-india-goes-for-tougher-road-safety-rules/135246", "ord_in_thread": 0, "title": "Airbag makers eye $2 bn opportunity as crash-prone India goes for tougher road safety rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Skoda launches Octavia 'anniversary edition' at Rs 15.75 lakh Mercedes Benz C63 S AMG priced at Rs 1.30 crore: Top 6 points to ponder Riding high: Hyundai bets big on Creta The world’s largest air bag suppliers are setting up plants and ramping up capacity in India, eyeing a $2 billion opportunity thanks to tougher rules aimed at improving one of the world’s worst road-safety records. Some of the world’s largest air bag makers – Autoliv Inc , Takata Corp, TRW Automotive Inc and Toyoda Gosei Co – are already gearing up to cash in.\nIn India, a person is killed in a road accident every four minutes – 141,000 in 2014 – yet less than a third of the 2.6 million cars sold each year have air bags in this cost-conscious market.\nBut a planned law that will impose crash test standards by 2017 is creating an opportunity for makers of safety equipment, as cars without air bags will achieve only the lowest safety ratings after tests. That, for the first time, will force consumers to directly consider the risks they run by buying cheap.\nBy 2020, overall revenues from airbag sales in India are set to rise 11 percent a year to hit $2 billion, outpacing the 9 percent growth expected in China, according to data from Transparency Market Research. By then, India is expected to be selling over 5 million cars a year.\n“(This is a) good time to build capacity and the right time to invest to grow the business,” said Harish Lakshman, managing director of air bag maker Rane TRW Steering Systems Ltd, a joint venture between US-based TRW and India’s Rane Holdings Ltd.\nThe company opened a new air bag assembly plant in August in southern India with capacity to make 500,000 units a year, investing 180 million rupees ($2.7 million).\nIt expects revenues from the air bag unit to hit 3.5 billion rupees by 2020, from 400 million rupees today.\nToyoda Goesi Minda India, a joint venture between the Japanese company and India’s Uno Minda, which has a 25 percent market share, plans to increase its capacity by up to six times to 150,000 air bags over the next two to three years, group chairman NK Minda told Reuters.\nAnalysts say others will follow, setting up in India to keep costs as low as possible.\n“We expect that within five years the large airbag makers will have a manufacturing hub in India,” said Ayay Bandopadhyay, automotive research analyst at Transparency Market Research.\nCRASH TESTS\nAir bags in India are expensive mainly because most of the parts, such as inflators, are imported. And without rules imposing their use in a country of poorly maintained vehicles and overcrowded, badly lit and potholed roads, carmakers often opt not to add a costly component that could drive up prices.\n“I think we have made automobiles in India too cheap. In trying to make everything cheap, if we are going to reduce our safety standard it is not worth it,” said Vijay Chhibber, secretary for the road transport and highways ministry.\nThe new rules, part of the Road Transport and Safety Bill, do not directly propose airbags, but instead make crash tests mandatory for new models sold in India from October 2017.\n“An air bag is only an instrument of road safety,” Chhibber said. The new rules will be discussed in India’s upper house of parliament this year before they become law.\nQuality issues will be a concern for carmakers, however.\nJapan’s Takata hit headlines after carmakers recalled millions of cars to replace air bags made by the company after some exploded too violently, spraying shrapnel into passenger compartments. Eight deaths and more than 100 injuries have been linked to faulty Takata inflators.\nIn India, makers including Honda, Toyota and Nissan recalled cars after the Takata defect was reported.\nSeveral carmakers in India, including No. 2 seller Hyundai Motor Co, still import air bags.\nBut Kaushik Madhavan, automotive head at Frost & Sullivan, said even cautious carmakers would eventually have to go local.\n“Carmakers have to realise that if they have to offer competitively priced products with all the safety technology, they have to be sourced locally,” he said.\n($1 = 66.3360 Indian rupees)\n 14, 2015 9:47 am", "external_links": [], "published": "2015-09-14T17:47:00.000+03:00", "crawled": "2015-09-15T08:19:57.142+03:00", "highlightTitle": ""}