{"organizations": ["SFO"], "uuid": "100b9336c7a4af84a257b0b7062061c6a2822277", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/sfo-probes-whether-bank-england-225317615.html", "country": "US", "title": "SFO probes 'whether Bank of England advised lenders during auctions'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "SFO probes 'whether Bank of England advised lenders during auctions'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T01:53:00.000+03:00", "replies_count": 0, "uuid": "100b9336c7a4af84a257b0b7062061c6a2822277"}, "author": "", "url": "https://uk.finance.yahoo.com/news/sfo-probes-whether-bank-england-225317615.html", "ord_in_thread": 0, "title": "SFO probes 'whether Bank of England advised lenders during auctions'", "locations": ["England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 29, 2015, 00:04 BST - UK Markets open in 7 hrs 56 mins SFO probes 'whether Bank of England advised lenders during auctions' By Andrew Trotman | Telegraph – 10 minutes ago Print \nBanks were allegedly told to offer the same amount of collateral during the auctions for central bank funds \nThe Serious Fraud Office's investigation into the Bank of England 's money-market auctions is focusing on whether officials told lenders to make similar bids for central bank funding, according to reports. \nBanks were allegedly advised to offer the same amount of collateral during the auctions - which were held during the financial crisis when money markets froze - so no single financial institution would stand out as being at risk and needing more emergency cash. \nThe SFO launched its probe - the first targeting the Bank in the SFO's 28-year history - in March , saying that it was “investigating material referred to it by the Bank of England concerning liquidity auctions during the financial crisis in 2007 and 2008”. \nSince then, officials at the central bank have attended voluntary “by appointment” interviews with the SFO, the Financial Times claimed. \nIn a statement on Monday night, the Bank said: “Given this is an active investigation, understandably the SFO has asked the Bank not to comment while it is ongoing. \n\"We are committed to providing as much clarity as possible to the public. But we recognise that it is the SFO’s investigation and it would be inappropriate for the Bank to comment further on the matter at the present time.” \nThe SFO declined to comment. \nThe SFO launched its investigation earlier this year after it was handed the results of an inquiry conducted in 2014 by Lord Grabiner into whether any senior staff at the Bank were aware its auctions may have been rigged in 2007 and 2008. \nDuring that time the Bank lent money against low and negative interest rates in return for asset-backed securities, in a bid to keep lending markets open as the credit crunch struck. \nThe Bank had commissioned that probe, and subsequently handed the results to the SFO late last year. \nThe Bank revealed to a Treasury select committee in March that it had given the Financial Conduct Authority dozens of instances of possible market rigging since bringing in new whistleblowing rules in the wake of the foreign exchange scandal. \nMark Carney, the Bank's governor, told MPs that the central bank had uncovered 50 instances of market manipulation and that 42 of these had been handed to the City watchdog, which is investigating several of them. \nAndrew Tyrie, chairman of the Treasury select committee, said at the time: “The Bank referred this to the Serious Fraud Office when Lord Grabiner’s initial findings were made clear to them. This was the right thing to do. I was informed about the referral on November 21, 2014. \n“We must now await the outcome of the SFO’s work. The sooner their findings are published the better.” \nMr Carney admitted that Threadneedle Street’s reputation had “taken a knock” over the scandal, which drew in the Bank when allegations emerged that it had known about rigging. \nDuring that session in front of MPs, Mr Carney agreed that before the forex scandal emerged, the institution’s rules on raising the alarm about possible market rigging had been unclear, but said the Bank had introduced new policies since. \nThe Bank has brought in an “attestation and escalation policy” to encourage intelligence staff suspecting market manipulation to come forward. \nAn independent report published last year into the scandal reserved its criticism largely to Martin Mallett, the Bank’s former chief currency trader, saying he should have told his superiors about his concerns. \nWhen traders at major banks were rigging foreign exchange rates, Mr Mallett developed concerns about manipulation, several years before the scandal became public. \nLord Grabiner, the barrister who carried out the report, criticised him for failing to escalate concerns, but also said the Bank needed a proper “escalation policy” to make sure that staff are able to raise the alarm. \nMr Mallett was fired over unrelated conduct issues , which Mr Carney later revealed amounted to more than 20 violations of Bank rules, including “sharing a confidential bank document, venturing personal opinions about Bank policy… inappropriate language, inappropriate attachments to emails… incidents that could have brought the bank’s reputation into dispute”. \nMr Carney also said the revelations about the institution’s place in the scandal “hasn’t been a pleasant experience”, but that “the test of the organisation is how it responds to this… what’s critical are the changes to policies and procedures [we have put in place]”. \nLord Grabiner’s report, whose credibility has been questioned by MPs, was published in November 2014, on the same day that six banks were fined a combined £2.7bn for allowing traders to rig foreign exchange benchmarks. \nChancellor George Osborne has told the SFO it would be given a blank cheque to investigate wrongdoing.", "external_links": [], "published": "2015-09-29T01:53:00.000+03:00", "crawled": "2015-09-29T02:05:25.268+03:00", "highlightTitle": ""}