{"organizations": [], "uuid": "8de96e1723c461dd020afdf5f891a9531c99394d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/disparate-impact03915.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/when-big-data-becomes-bad-data/43287.html", "country": "IN", "title": "When Big Data Becomes Bad Data", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "When Big Data Becomes Bad Data", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T08:09:00.000+03:00", "replies_count": 0, "uuid": "8de96e1723c461dd020afdf5f891a9531c99394d"}, "author": "Lauren Kirchner (ProPublica)", "url": "http://www.moneylife.in/article/when-big-data-becomes-bad-data/43287.html", "ord_in_thread": 0, "title": "When Big Data Becomes Bad Data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » When Big Data Becomes Bad Data 43287 When Big Data Becomes Bad Data 0 Comments, Be the first to comment Lauren Kirchner (ProPublica) | 03/09/2015 10:39 AM | Corporations are increasingly relying on algorithms to make business decisions and that raises new legal questions A recent ProPublica analysis of The Princeton Review’s prices for online SAT tutoring shows that customers in areas with a high density of Asian residents are often charged more. When presented with this finding, The Princeton Review called it an “incidental” result of its geographic pricing scheme. The case illustrates how even a seemingly neutral price model could potentially lead to inadvertent bias — bias that’s hard for consumers to detect and even harder to challenge or prove. Over the past several decades, an important tool for assessing and addressing discrimination has been the “disparate impact” theory. Attorneys have used this idea to successfully challenge policies that have a discriminatory effect on certain groups of people, whether or not the entity that crafted the policy was motivated by an intent to discriminate. It’s been deployed in lawsuits involving employment decisions, housing and credit. Going forward, the question is whether the theory can be applied to bias that results from new technologies that use algorithms. The term “disparate impact” was first used in the 1971 Supreme Court case Griggs v. Duke Power Company . The Court ruled that, under Title VII of the Civil Rights Act, it was illegal for the company to use intelligence test scores and high school diplomas — factors which were shown to disproportionately favor white applicants and substantially disqualify people of color — to make hiring or promotion decisions, whether or not the company intended the tests to discriminate. A key aspect of the Griggs decision was that the power company couldn’t prove their intelligence tests or diploma requirements were actually relevant to the jobs they were hiring for. In the years since, several disparate impact cases have made their way to the Supreme Court and lower courts , most having to do with employment discrimination. This June, the Supreme Court’s decision in Texas Dept. of Housing and Community Affairs v. Inclusive Communities Project, Inc . affirmed the use of the disparate impact theory to fight housing discrimination . The Inclusive Communities Project had used a statistical analysis of housing patterns to show that a tax credit program effectively segregated Texans by race. Sorelle Friedler, a computer science researcher at Haverford College and a fellow at Data & Society, called the Court’s decision “huge,” both “in favor of civil rights…and in favor of statistics.” So how will the courts address algorithmic bias? From retail to real estate, from employment to criminal justice, the use of data mining, scoring software and predictive analytics programs is proliferating at an exponential rate. Software that makes decisions based on data like a person’s ZIP code can reflect, or even amplify, the results of historical or institutional discrimination.“[A]n algorithm is only as good as the data it works with,” Solon Barocas and Andrew Selbst write in their article “Big Data’s Disparate Impact,” forthcoming in the California Law Review . “Even in situations where data miners are extremely careful, they can still affect discriminatory results with models that, quite unintentionally, pick out proxy variables for protected classes.” It’s troubling enough when Flickr’s auto-tagging of online photos label pictures of black men as “animal” or “ape,” or when researchers determine that Google search results for black-sounding names are more likely to be accompanied by ads about criminal activity than search results for white-sounding names. But what about when big data is used to determine a person’s credit score, ability to get hired, or even the length of a prison sentence? Because disparate impact theory is results-oriented, it would seem to be a good way to challenge algorithmic bias in court. A plaintiff would only need to demonstrate bias in the results, without having to prove that a program was conceived with bias as its goal. But there is little legal precedent. Barocas and Selbst argue in their article that expanding disparate impact theory to challenge discriminatory data-mining in court “will be difficult technically, difficult legally, and difficult politically.” Some researchers argue that it makes more sense to… Continue Reading…", "external_links": [], "published": "2015-09-03T08:09:00.000+03:00", "crawled": "2015-09-03T08:30:14.127+03:00", "highlightTitle": ""}