{"organizations": [], "uuid": "d73990b344a856b63dee6596c0e70494e7e5a061", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/h/4/s/i/image.related.thumbnail.320x214.gjh31j.png/1441629803030.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/10/energy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/mining-and-resources/bhp-expects-coal-rebound-and-makes-move-in-borneo-20150907-gjh31j.html", "country": "AU", "title": "BHP expects coal rebound and makes move in Borneo", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "BHP expects coal rebound and makes move in Borneo", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "d73990b344a856b63dee6596c0e70494e7e5a061"}, "author": "", "url": "http://www.smh.com.au/business/mining-and-resources/bhp-expects-coal-rebound-and-makes-move-in-borneo-20150907-gjh31j.html", "ord_in_thread": 0, "title": "BHP expects coal rebound and makes move in Borneo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BHP Billiton sees big potential for its coal operations in Indonesia. Photo: Kerrie Leishman\nBHP Billiton is set to ramp up its focus on Indonesian coal, revealing it will open a second mine on Borneo within two years as it predicts a rebound in global markets.\nBHP's Indonesian coal boss, Mark Small, said mining had this year started at Haju in Central Kalimantan which is the first coal deposit mined in the IndoMet coal project, a joint venture which is 75 per cent owned by BHP and 25 per cent by Adaro Energy.\nHe also said the company would look to start its next Indonesian mine within two years.\n\"In parallel we have commenced construction within a second CCoW (Coal Contracts of Work) due to come on-stream in 2017,\" he said.\nAdvertisement Mr Small said IndoMet would seek to create a world-class metallurgical coal basin supporting a suite of mines and employing many thousands of people.\nBHP's strategy is to mine only the world's largest mineral resources which can be expanded for generations or even centuries and therefore it rarely goes into a new mining province without evidence of a substantial resource.\n\"To date we have identified a resource of 1.3 billion tonnes with further exploration planned,\" Mr Small told Ozmine Jakarta, a forum organised by Austrade.\nCoal prices have dived as part of a global commodity slump but Mr Small said that, beyond the challenging short-term outlook, he was optimistic about both thermal coal and metallurgical coal in the medium to long term.\n\"We are potentially more bullish about metallurgical coal,\" he said.\n\"In the long term I think there will be a recovery, to what extent I am not sure.\"\nHe said there was an opportunity in Indonesia to \"consolidate, get the cost base right and establish a sustainable business going forward\".\nMr Small said BHP had undergone a \"simplification project\" in terms of identifying its key assets.\nThe demerger with South32 enabled it to focus on four key resources: coal, iron ore, petroleum and copper.\n\"Across the business we are focusing on safe productivity whilst driving costs down,\" Mr Small said.\nOne of the benefits of Indonesia was that it had a relatively low wage structure but there were also potential improvements in productivity factors, he said.\n\"I think we will continue to see costs come down,\" he said.\nThe IndoMet project had a target of employing 70 per cent of its staff from the local community in Kalimantan.\n\"We are in the process of recruiting now ... we are ramping up to 1200 people (and) are absolutely committed to supporting local communities wherever possible.\"\nMr Small said there was a lot of opportunity in Indonesia and it was possible to operate with the same standards as you would in Australia or another developed economy.\n\"Indonesia is certainly a place of opportunity. I would just reinforce finding a suitable partner who is aligned with your own values and standards.\"\nAustralian Mining Chamber in Indonesia chairman Andy Coles said Indonesia had advantages over other jurisdictions.\nHe said the disadvantage of Mongolia was that China was the only buyer, the regulatory environments in Yemen and Cambodia were 15 to 20 years behind Indonesia and mines in Malaysia were fairly small.\n\"Indonesia still stands out from the pack. There are some issues, there are some problems but BHP has been here 20 years and they are still here. The proof is in the pudding. The regulatory environment is not easy but it is still doable,\" he said.\nTrade commissioner Michael Helleman said Indonesia continued to be an important player in the global mining scene with significant levels of coal, copper, gold, tin and nickel.\nHe said global mining companies consistently ranked Indonesia highly in terms of coal and mineral prospects, however their assessments of mining policies and the investment climate were less positive.\nHe said Indonesia nonetheless continued to attract significant investment with Freeport Indonesia, Vale and Weda Bay Nickel all making significant investments in recent years.\nThe Indonesian government banned the export of unprocessed minerals from January 2014 in an effort to push construction of smelters and boost value of mineral exports.\nAustralian ambassador to Indonesia Paul Grigson told the forum Australian investment in Indonesia and vice versa was \"significantly underdone\".\n\"Investment into Australia from Indonesia runs runs at $1.45 billion. Similarly from Australia into Indonesia runs at $5.3 billion – again, I think a little low. I think medium term focus on investment and services is important for us,\" he said.", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T00:18:20.957+03:00", "highlightTitle": ""}