{"organizations": ["Bloomberg", "Euronext"], "uuid": "c68c5657dda8b136bcbe2d4a0aabcbfc3e618fa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/institutional-forex/wp-content/uploads/sites/9/2015/04/Euronext_880-400.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/institutional-forex/exchanges/euronext-announces-trading-volumes-for-august-2015-rebounding-from-july/", "country": "US", "title": "Euronext Announces Trading Volumes for August 2015, Rebounding from July", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Euronext Announces Trading Volumes for August 2015, Rebounding from July", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T16:24:00.000+03:00", "replies_count": 0, "uuid": "c68c5657dda8b136bcbe2d4a0aabcbfc3e618fa7"}, "author": "", "url": "http://www.financemagnates.com/institutional-forex/exchanges/euronext-announces-trading-volumes-for-august-2015-rebounding-from-july/", "ord_in_thread": 0, "title": "Euronext Announces Trading Volumes for August 2015, Rebounding from July", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Euronext Announces Trading Volumes for August 2015, Rebounding from July Euronext Announces Trading Volumes for August 2015, Rebounding from July Following a dismal month of July, Euronext set a number of records in August 2015, including the most active day ever on 24 August. Advertising Print This Post Photo: Bloomberg \nEuronext, the largest exchange in the Eurozone, today announced trading volumes for the month ending 31 August 2015. The results show a turnaround for the exchange from July’s underwhelming performance, with a number of records having been set. \nThe August 2015 average daily transaction value on the Euronext cash order book rebounded from July’s monthly decline, which saw a MoM dip of 12.3% . Although across a yearly timeframe, July’s figures corresponded to a growth of 38% from July 2014. \nAugust 2015, however, was a stronger summer month for the European exchange, with the average daily transaction value on its cash order book experiencing an 8.9% MoM increase, coming in at €8,619 million. On an annual basis, this represents solid growth, up 58% compared with August 2014. \nActivity on ETFs was particularly dynamic last month with average daily transaction value at €744 million, up 126% compared to August 2014. Again, the strong performance of ETFs contrasted with the month of July 2015, when average daily transaction value fell to $557 million, a 14.4% MoM decline. \nIndeed, it was the most active August month in terms of average daily transaction value since 2007. Indeed, a series of records were breached, including the most active day ever on 24 August . Euronext yielded a record trading volume across its combined markets, which included 550 million managed orders on its cash markets, which surpasses a previous high set back in January 2015 by 22%. Moreover, the exchange had a total of 4,478,154 transactions, which was the largest amount on record in over four years. \nThe following day, the exchange recorded the highest ETF daily transaction value, with €1,870 million traded on the order book. \nFinancial derivatives were also buoyant, and continued the upward turnaround trend from July 2015. During the month of August 2015, the average daily volume on equity index derivatives was up at 255,879 contracts, an increase of 20.3% from July 2015 and up 9% compared with August 2014. \nFurthermore, the average daily volume on individual equity derivatives was 298,062 contracts, rebounding from July’s slump of 215,648 contracts, and up 46% YoY compared with August 2014. \nThe trading records in August were also reflected in equity derivatives, with 1,418,403 contracts traded on 24 August, and the most active day of the year for French individual equity options on 11 August with 350,265 contracts traded. \nIn August 2015, the average daily volume on commodities derivatives was up 38% when compared to August 2014, with an average daily volume of 67,185 contracts. This includes the first transactions on Euronext’s physically deliverable suite of futures products for Skimmed Milk Powder, Lactic Butter and Whey Powder. \nEuronext had just one new large capitalisation listing in the month of August 2015 (as opposed to seven in July 2015), Altice on Euronext Amsterdam with a market capitalisation at listing of €21.9 billion. In addition, €2.9 billion was raised in corporate bonds and €0.1 billion of follow-on equity. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-09-03T16:24:00.000+03:00", "crawled": "2015-09-03T13:37:03.132+03:00", "highlightTitle": ""}