{"organizations": [], "uuid": "858c6f26206d797847cac46b952b457b32281a5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KJ650_CMOPro_F_20150918172125.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/belkin-pulls-back-on-programmatic-ads-1442854800", "country": "US", "title": "Belkin Pulls Back on Programmatic Ads", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "Belkin Pulls Back on Programmatic Ads - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T21:00:00.000+03:00", "replies_count": 0, "uuid": "858c6f26206d797847cac46b952b457b32281a5d"}, "author": "wsjcom", "url": "http://www.wsj.com/articles/belkin-pulls-back-on-programmatic-ads-1442854800", "ord_in_thread": 0, "title": "Belkin Pulls Back on Programmatic Ads", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS ENLARGE Photo: Getty Images Belkin International, the maker of Linksys home-routers and WeMo smart home gadgets, said it has reduced its reliance on automated ad buying because of the many challenges that so-called programmatic and real-time bidding face.\nThere are “huge issues” with automated buying including the lack of visibility into where the Web ads actually appear, how ads render on a particular site and the true cost of the ads, said Kieran Hannon, Belkin’s chief marketing officer. “There are too many unknowns,” he added.\nENLARGE Kieran Hannon, Belkin's Chief Marketing Officer Photo: Belkin International The Playa Vista, Calif. company said it spent about 20% of its ad dollars last year using automated buying systems but has now reduced its programmatic ad spending to roughly 10%. The privately-held company declined to disclose its ad budget but said it spends “tens of millions” of dollars annually on marketing.\nMr. Hannon acknowledges that buying via automated systems can be cheaper but says that his company is “more interested in quality rather than quantity.” He has decided to spend more of the company’s ad dollars with premium publishers and is finding ways to create ads that tie into particular sites, which he said gets people to pay closer attention to the ad.\nFor example, Belkin created a custom video ad for Hulu called the “Wheel of Death” in which people use the streaming-video site as a voiceover talks about how viewers can have a better streaming experience if they buy a Linksys router. The ad talked about how the router could help viewers avoid the dreaded spinning buffering wheel.\nOver the past two years marketers have grown increasingly concerned about the integrity of the online advertising inventory they are purchasing.\nIn an effort to clean up the problems that have plagued the digital ad business, trade groups such as the Association of National Advertisers and the Interactive Advertising Bureau have created committees to explore the issues and find remedies. Many companies have also begun offering new tools or new types of measurement that give marketers some assurances that they are really getting what they pay for.\nStill, Mr. Hannon says “nobody really knows” how well all the new tools really work. Marketers “should proceed with caution,” he added.\nDespite the problems, many advertisers are still shifting ad dollars into the space. Programmatic display ad spending in the U.S. is expected to grow 48.9% in 2015, and represent $14.8 billion in total spending, or 55% of the U.S. digital display ad market, predicts eMarketer.", "external_links": ["http://si.wsj.net/public/resources/images/BN-KJ650_CMOPro_D_20150918172125.jpg", "http://si.wsj.net/public/resources/images/BN-KJ665_CMOBel_AM_20150918173518.jpg"], "published": "2015-09-21T21:00:00.000+03:00", "crawled": "2015-09-21T20:40:20.089+03:00", "highlightTitle": ""}