{"organizations": [], "uuid": "42954fb364542753bae1c612cc88f6766fa07b9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/rG_CrL.Zu5oEfOi0kEbxaQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/87249840-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-skynews/?format=rss", "section_title": "Finance News | Sky News - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/cameron-adviser-run-nike-founded-101441446.html", "country": "GB", "title": "Cameron Adviser To Run Nike-Founded Charity", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Cameron Adviser To Run Nike-Founded Charity", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T13:14:00.000+03:00", "replies_count": 0, "uuid": "42954fb364542753bae1c612cc88f6766fa07b9a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/cameron-adviser-run-nike-founded-101441446.html", "ord_in_thread": 0, "title": "Cameron Adviser To Run Nike-Founded Charity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nA former business adviser to David Cameron is to be named as the head of a unit established by Nike (Sao Paolo: NIKE34.SA - news ) , the US-based sportswear giant, to help tackle global poverty among girls. \nSky News has seen a statement scheduled to be made later on Tuesday, which will announce that Farah Ramzan Golant is to become the first chief executive of Girl Effect. \nThe statement will also say that Girl Effect, which was established by the Nike Foundation in 2008, is to become wholly independent of Nike, a move that will enable it to seek partnerships with a broader range of commercial organisations. \nMs Ramzan Golant's appointment will come several months after she stepped down as chief executive of All3Media, the television production giant that was acquired last year by Discovery Communications (NasdaqGS: DISCA - news ) and Liberty Global (NasdaqGS: LBTYA - news ) for £550m. \nShe (Munich: SOQ.MU - news ) is also a former chief executive of AMV BBDO, the UK's biggest advertising agency, and served as a member of the Prime Minister's Business Advisory Group during the last parliament. \nThe establishment of Girl Effect as an independent charitable organisation is designed to allow it acquire scale more rapidly, an insider said, at a time when the corporate sector is under unprecedented scrutiny in relation to its contribution to philanthropic causes. \nAccording to the announcement seen by Sky News, Maria Eitel, the Nike Foundation president and chief executive, will also become chairman of Girl Effect. \nThe Nike Foundation will continue to operate \n\"The creation of Girl Effect as a new organisation accelerates the world’s ability to reach the 250m girls living in poverty,\" she is expected to say. \n\"Doing that demands even more partnership especially in the business sector, deeper behaviour change efforts that harness both social networks and new forms of media, and amplifying the work of all partners in the movement.\" \nMs Eitel described Ms Ramzan Golant as \"The perfect leader to take us forward.\" \nThe investment in adolescent girls as a poverty reduction strategy in less affluent countries has been cited by Nike Foundation executives as providing the best return on investment of charitable funds. \n\"I can see tremendous opportunity ahead as business, government and NGOs [non-governmental organisations] combine forces to tackle the challenges facing girls living in poverty,\" Ms Ramzan Golant is expected to say. \n\"There is clear conviction and a growing evidence base that girls can become pivotal change makers for themselves and their communities.\" \nNike declined to comment ahead of its announcement.", "external_links": [], "published": "2015-09-01T13:14:00.000+03:00", "crawled": "2015-09-01T13:48:34.002+03:00", "highlightTitle": ""}