{"organizations": [], "uuid": "bdee6cf49b5c66899e80705bcae3c3e09b869d54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/08/markets-global-idUSL1N11E0QH20150908", "country": "US", "title": "GLOBAL MARKETS-Shares rally on China stimulus hopes, strong European data", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "GLOBAL MARKETS-Shares rally on China stimulus hopes, strong European data | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T20:08:00.000+03:00", "replies_count": 0, "uuid": "bdee6cf49b5c66899e80705bcae3c3e09b869d54"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/08/markets-global-idUSL1N11E0QH20150908", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Shares rally on China stimulus hopes, strong European data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* U.S. share indexes up over 1.5 percent\n* Top European stocks index up over 1 percent\n* China numbers contrast with forecast-beating Germany\n* Brent crude prices rise on euro zone grwoth , China crude imports data (Adds U.S. market open, changes byline, dateline; previous LONDON)\nBy Sam Forgione\nNEW YORK, Sept 8 (Reuters) - Stock markets worldwide rallied on Tuesday on hopes of more stimulus measures in China and on strong German trade data, while Brent crude oil prices also rose.\nChina's imports shrank far more than expected in August, falling for the 10th straight month, though exports fell less than expected. Analysts said the imports data could lead to further policy easing from the Chinese government in coming months.\nThose hopes boosted U.S. shares, while data showing Germany saw imports and exports hit record highs in value terms in July underpinned gains in European stocks. Germany's benchmark DAX share index was last up nearly 2 percent.\nA late bounce in Chinese stocks, which pushed the Shanghai Composite Index up 2.9 percent after earlier declines, also also supported European shares.\n\"With volatility having receded somewhat during the past few days it appears that investors have been reassessing the potential negative fallout from the slowdown in China,\" said Markus Huber, a senior analyst at Peregrine & Black.\nBrent crude rose on data showing the euro zone's economy grew faster than expected in the second quarter, with gross domestic product up 1.5 percent year-on-year versus a previous reading of 1.2 percent.\nBrent prices were also helped by data showing China crude oil imports rose 5.6 percent in August from a year earlier.\nBrent crude was last up $1.01, or 2.12 percent, at $48.64 a barrel. U.S. crude, meanwhile, was down 68 cents, or 1.48 percent, at $45.37 per barrel.\nMSCI's all-country world equity index, which tracks shares in 45 nations, was last up 4.62 points or 1.2 percent, at 389.27.\nThe Dow Jones industrial average was last up 241.25 points, or 1.5 percent, to 16,343.63. The S&P 500 was up 27.04 points, or 1.41 percent, at 1,948.26. The Nasdaq Composite was up 76.20 points, or 1.63 percent, at 4,760.12.\nEurope's FTSEurofirst 300 index of top regional shares was up 1.23 percent, at 1,416.55.\nU.S. Treasury yields rose ahead of the U.S. Treasury's scheduled sale of $24 billion in three-year notes later on Tuesday. Benchmark 10-year notes were last down 15/32 in price to yield 2.18 percent, from a yield of 2.13 percent late Friday.\nThe renewed risk appetite led the dollar to gain against the safe-haven yen, but the greenback still inched lower against the euro. The dollar index, which measures the greenback against a basket of six major currencies, was last down 0.26 percent .\n\"The market is trading more risk-on across the board,\" said BNP Paribas FX strategist Sam Lynton-Brown in London.\nGold firmed but remained close to 2-1/2 week lows as uncertainty over the timing of the U.S interest rate hike persisted. Spot gold prices rose $2.43 or 0.22 percent, to $1,121.53 an ounce. (Reporting by Sam Forgione; additional reporting by Nigel Stephenson in London and Tanya Agrawal)", "external_links": [], "published": "2015-09-08T20:08:00.000+03:00", "crawled": "2015-09-08T19:17:16.124+03:00", "highlightTitle": ""}