{"organizations": [], "uuid": "628bf8562456d6c080f9051d010df3150a6288e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/2/o/s/v/image.related.afrArticleLead.620x365.giisno.png/1441148805999.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/luxury/adam-goodrum-has-the-laidback-smarts-in-furniture-design-20150723-giisno", "country": "AU", "title": "Adam Goodrum design: incubated in Perth, celebrated across the world", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Adam Goodrum design: incubated in Perth, celebrated across the world | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T22:15:00.000+03:00", "replies_count": 0, "uuid": "628bf8562456d6c080f9051d010df3150a6288e3"}, "author": "Luke Slattery", "url": "http://www.afr.com/brand/luxury/adam-goodrum-has-the-laidback-smarts-in-furniture-design-20150723-giisno", "ord_in_thread": 0, "title": "Adam Goodrum design: incubated in Perth, celebrated across the world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Adam Goodrum sits on a Molloy chair, which he designed for the Australian emporium Cult. James Brickwood by Luke Slattery The winter solstice is a fortnight past and the sun rides low above the rooftops of Waterloo, an inner-Sydney sub-working class ’burb on the way up. Industrial designer Adam Goodrum, his star also on the rise, stands on the ground floor of his corner block studio amid a joyous jumble of form and colour.\nFrom this working space, its upper floors home to his wife and two young children, Goodrum is taking Australian furniture design to a world that is scarcely aware of it. The studio, clad in floor-to-ceiling glass on two street-facing sides, incubated his famed Stitch chair, manufactured by Italian firm Cappellini and selected on its 2008 release as one of the year’s best designs by the London Design Museum; a distinctive new range of domestic and commercial furniture for local design emporium Cult, exhibited recently in Singapore and New Zealand; and, released only last month, a fold-away stool for champagne house Veuve Clicquot.\nIt strikes me, as Goodrum explains the sources of his inspiration in a freewheeling Perth childhood, that there is still something boldly, boyishly inventive about Australian design’s young gun: winner of the Young Designer of the Year award in 1997 and, in 2004, the Bombay Sapphire Design Award.\nThe University of Technology, Sydney, graduate was born in 1972 to a scientist father and a librarian mother and remembers how a beachside childhood offered the privilege of space and creative freedom. “There was always someone with a shed and a lathe and a welder, and a father or grandfather who could teach you how to use them,” he recalls.\nChatterbox ceramic side tables. Paul Pavlou His mania for making evolved, he believes, from that environment. “One of the first things I made was a trolley to fit a surfboard because the Fremantle Doctor blew too hard to ride to the beach with a board under one arm. The first set of wheels came from mum’s laundry trolley and the wood from the back fence. I wasn’t in the good books over that.”\nThese childhood memories resonate powerfully with Goodrum, who has the tanned, athletic look of a guy who still likes to surf, because they evoke the inventive, resourceful side of Australian culture. He notes the early Australian surf gear manufacturers, Rip Curl and Billabong, as examples of winning design innovation emerging from, and adapted to, the Australian lifestyle. “There is something beautiful about the way these companies began making objects out of necessity – boards, board covers, wetsuits, boardshorts – that absolutely came from our culture.”\nHis best subjects at school were art and mathematics, and they remain his touchstones. His designs not only produce objects of beauty; they also create ingenious solutions to lifestyle problems. There are smarts behind the art. His extroverted Stitch chair, for example, with its pop art Mondrian colours, is made from laser-cut aluminium plates that fold along rows of prominent hinges. In this way the collapsible mechanism serves a function and projects a personality. “A product has to justify its existence,” he says. “It has to have some sort of spirit, or offer a solution. Or both.”\nDynamic Goodrum's Loom chair is covered in knitted upholstery developed by Dutch company Febrik. Jason Busch Goodrum’s designs are never just clever. It is clear to others in the industry that his aesthetic sensitivity is nicely paired with his quiet, understated intelligence and curiosity. Artist and designer Liane Rossler, co-founder of Dinosaur Designs, was one of the judges of the Bombay Sapphire Design Award. “We were all impressed by his dynamism and the quality, craftsmanship and thinking behind his work,” she recalls.\nBroached Commissions, a Melbourne-based company producing limited collections, often on cultural and heritage themes for clients such as the Molonglo Group and Hotel Hotel, counts Goodrum among its founding designers. For Hotel Hotel he designed a chair with a back rising to form a coat hanger, and a parquetry “feasting” table that can be broken up and assembled into smaller units.\nIn a Broached project for Desley Luscombe, UTS dean of design architecture and building, Goodrum transformed a much loved though no longer used upright piano into a credenza that still retains the visual memory of its original use. And for a Broached project intended to evoke the story of the Australian goldfields, he designed a white standing cabinet, on wheels, whose many drawers slide out to reveal surfaces of bold colour just as a prospector might reveal his hidden gold.\nLou Weis, one of the company’s creative directors, detects the stamp of Goodrum’s personality – “a lovely guy with a great deal of ease” – in his work. “It is beautifully simple but never simplistic.” Weis is also alert to the ageless Peter Pan quality of Goodrum’s talent: “Adam has a passion for mechanisms and when he shows you a prototype you sense his childlike joy for the trick. Of course development from the prototype stage to production at full scale is enormously complicated, but Adam never loses that simple love of doing something that’s fun.”\nGoodrum designed the feasting tables at Hotel Hotel Canberra to come apart. Peter Bennetts Goodrum has come a long way from that formative Perth childhood. On the day we meet, his Waterloo studio is an Aladdin’s cave of finished objects, prototypes and experiments. Hefty design books line the bookshelves and raised above a workbench are prototypes of some very funky chairs and stools.\nAsked about his design heroes he casts a wide net to catch two very different creatures. Danish designer Hans Wegner – there’s a Wegner book on the table – was a master of muted, earth-toned simplicity. American Alexander Calder gave the Catalan exuberance of Joan Miró a sculptural form. But in Goodrum’s aesthetic imagination their contrasting sensibilities are fused into a design language that is at once elegant and playful.\nNew recognition One of the highlights of the Cult collection is Goodrum’s use, on his Loom chair and Fat Tulip sofa, of three-dimensional knitted upholstery developed by Dutch company Febrik. He’s so excited about the fabric that he takes a sample out to show me. “I’ve fallen in love with it. It envelops you,” he says. “But you know it’s very hard to create a new form and this gives you a wonderful opportunity to get more out of a product.”\nHis love affair with the fabric signals a new focus on soft furnishings – there’s nothing soft about the Stitch chair and stool – and an invocation, once again, of memory. Goodrum recalls how his mother would spin her own wool on a “lovely timber spinning wheel”, after first ridding the fleece of burrs and combing it to reveal the grain. I notice, too, that a black fleece is draped over the back of his chair.\nCult design director Richard Munao admires Goodrum’s modesty, but he is not entirely swayed by it. “He is quick. He is sharp. He comes up with things I haven’t seen done before, and everything he’s done for us is difficult for others to do. At the same time he respects traditional values, objects that last.”\nMunao, who took Goodrum and his designs for Cult to Singapore and New Zealand recently, remarks that while Australian architecture is respected overseas, its homegrown interior and furniture design is barely known. “Adam is putting Australian-based furniture design on the map,” he says.\nGoodrum has shown in Milan, worked with Cappellini and now boasts Veuve Clicquot as a client. His Tsunami bowls are in the permanent collection of the Ghent Design Museum and his Nordic-looking Timber Trivet is distributed in Denmark by Normann Copenhagen.\nAlthough there is something of the eternal surfer in Goodrum’s low-key demeanour, the pace of his work schedule is picking up. This year he’s toured his new Cult collection, travelled to Champagne for a thorough acculturation in the world of Veuve Clicquot – which involved being “doused”, pleasantly, in the widow Clicquot’s finest – and produced an opulent Tiger Table for Sydney publicist Judi Hausmann with a deeply lacquered top of Macassar ebony and legs of solid brass. And when we meet he is preparing for an exhibition at the National Gallery of Victoria.\nAsked what he would like to do next, his thoughts drift to luxury brands with deep craft traditions such as Hermès or Louis Vuitton. He also nurses an abiding desire to design for the national carrier: “I would love to work with Qantas.” As travel is so much a part of his life these days he is scheming up a clever line in Australian luggage and wondering why, in a nation of inveterate travellers, it hasn’t already been done. No matter which material Goodrum chooses to work with, or for which purpose he designs, the work is always grained with a sense of origin.", "external_links": [], "published": "2015-09-01T22:15:00.000+03:00", "crawled": "2015-09-02T03:09:43.274+03:00", "highlightTitle": ""}