{"organizations": [], "uuid": "6eaebc991c2eabf5dbd673874479211369e86217", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509011145.html", "country": "US", "title": "Kenya: Union Tells Teachers Not to Go to Work Until Paid As Strike Paralyses Learning", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Union Tells Teachers Not to Go to Work Until Paid As Strike Paralyses Learning", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T16:01:00.000+03:00", "replies_count": 0, "uuid": "6eaebc991c2eabf5dbd673874479211369e86217"}, "author": "", "url": "http://allafrica.com/stories/201509011145.html", "ord_in_thread": 0, "title": "Kenya: Union Tells Teachers Not to Go to Work Until Paid As Strike Paralyses Learning", "locations": ["Nigeria", "Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: Gov Okorocha Mandates Bailout Fund C'ttee to Clear Unpaid Salaries \nMukwaya asked the state to lead by example, by respecting the rule of law, saying disregarding the court's directive would be in contravention of the constitution. \nHe asked the government to approach the teachers' salary issue as it did the Mumias Sugar Company and Kenya Airways rescue plans. \nAddressing the media at Knut headquarters on Tuesday, he further urged parents not to send students to school until the strike is called off. \nA spot check by the Star revealed that learning has been paralysed in Kisumu, Kisii, Marsabit and Mombasa counties over the teachers' pay issue. \nIn Kisumu, students were forced to go back home as teachers marched on the streets accusing their employer, the TSC, of frustrating their payment. \n\"Teachers must be paid before going back to class,\" said county Knut Executive secretary Joshua Ogalo. \n\"We are working under poor and filthy conditions yet some people working on ways to block our salaries.\" \nUrging teachers to join the \"noble cause\", Ogalo added that teachers do not have sitting allowances yet MPs are given \"hefty\" compensation. \nHe urged Knut secretary general Wilson Sossion and chairman Mudzo Nzili to no longer negotiate with the TSC over the payment. \nIn Kisii, teachers also took to the streets waving placards reading; \"Pesa Pap\", \"Supplement budget now\", \"Teachers don't eat chalk\" and \"No cheque, no chalk\". \nThe case was the same in Marsabit where Knut chairman Lufle Gambare assured support for the strike. \n\"The teaching fraternity in the county is in support of the union's Executive council call for industrial action in case the TSC remains adamant in implementing the awarded salary rise,\" Gambare said, \nHe said 925 primary and secondary school teachers were instructed not to return to work unless the government fully honours the pay deal. \n\"The battle for the pay hike, won by the union a week ago, span about four decades,\" he said, adding that teachers will not allow anybody to disregard the court's ruling. \nGambare urged parents to ensure children remain at home, instead of loitering in schools, until further instructions are issued, \nLoiyangalani subcounty Education officer Didey Isandap said learning did not commence in the area's 18 primary and two secondary schools. \n\"The subcounty is remote faced with numerous challenges including transport. Teachers could have delayed due to communication difficulties, not necessary because of the sit-in over pay,\" he said. \nIn Mombasa, only a few pupils went to school, while the few teachers who reported declined to go to class. Kenya \nMau Forest evictees living at Kusumek and Chebugen camps in Konoin will be resettled by December, the government has … see more » Copyright © 2015 The Star. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-01T16:01:00.000+03:00", "crawled": "2015-09-01T16:40:06.331+03:00", "highlightTitle": ""}