{"organizations": [], "uuid": "db4439d449176297e7262cf171816fb732f4b058", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/03/usa-illinois-arbitration-idUSL1N1181UJ20150903", "country": "US", "title": "Bid to override veto of arbitration bill fails in Illinois House", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Bid to override veto of arbitration bill fails in Illinois House | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T05:29:00.000+03:00", "replies_count": 0, "uuid": "db4439d449176297e7262cf171816fb732f4b058"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/03/usa-illinois-arbitration-idUSL1N1181UJ20150903", "ord_in_thread": 0, "title": "Bid to override veto of arbitration bill fails in Illinois House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Sept 2 The Illinois House on Wednesday failed to override Governor Bruce Rauner's veto of a controversial bill to send collective bargaining impasses to arbitration, leaving open the possibility of a future strike or lockout of state workers.\nThe Democrat-controlled House fell three votes short of the 71 needed to make the bill law after the Senate, which also has a Democratic majority, overrode Rauner's veto last month.\nDemocratic lawmakers and the Republican governor have been locked in a struggle over a state budget and an agenda pushed by Rauner that includes legislative term limits and collective bargaining curbs. Illinois this week entered its third month without a budget for the fiscal year that started July 1.\nHouse Speaker Michael Madigan told reporters after the vote that the bill was meant to buy labor peace by prohibiting strikes or lockouts. He also noted that Rauner \"did talk in terms of the possibility of a government shutdown in order to achieve his goals.\"\nRauner had condemned the bill as an attempt to take away his power to negotiate worker contracts at a time the state is strapped for cash.\n\"It is encouraging that many legislators recognized the dire financial impact this legislation would have had on our state,\" the governor said in a statement.\nHe added that he hoped \"serious negotiations\" can begin on structural reforms and a balanced budget. Madigan also expressed hope that differences could be resolved, but Democrats are unlikely to embrace items on Rauner's agenda that would hurt unions or impair their party's power.\nThe state's biggest public labor union, American Federation of State, County and Municipal Employees Council 31, said Rauner's attack on the arbitration bill \"has now derailed the best hope of amicably settling union contracts that are fair to all.\"\nWhile the contract expired June 30, the union, which represents 38,000 state workers, and the state have an agreement that expires Sept. 30 not to strike or lockout workers while negotiations continue. (Reporting by Karen Pierog ; Editing by Lisa Shumaker )", "external_links": [], "published": "2015-09-03T05:29:00.000+03:00", "crawled": "2015-09-03T04:57:22.059+03:00", "highlightTitle": ""}