{"organizations": [], "uuid": "4ab4ef917433245a667869f1a7959bd53fb37a40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/j/4/6/h/image.related.afrArticleLead.620x365.gjjbre.png/1441876868182.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/opinion/columnists/laura-tingle/no-qualifications-required-for-tony-abbotts-middle-east-refugee-policy-20150910-gjjbre", "country": "AU", "title": "No qualifications required for Tony Abbott's Middle East refugee policy", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "No qualifications required for Tony Abbott's Middle East refugee policy | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T15:00:00.000+03:00", "replies_count": 0, "uuid": "4ab4ef917433245a667869f1a7959bd53fb37a40"}, "author": "Laura Tingle", "url": "http://www.afr.com/opinion/columnists/laura-tingle/no-qualifications-required-for-tony-abbotts-middle-east-refugee-policy-20150910-gjjbre", "ord_in_thread": 0, "title": "No qualifications required for Tony Abbott's Middle East refugee policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Tony Abbott does the face-slap drill during training with the Paga Panthers rugby league players in Port Moresby, Papua New Guinea, before attending the Pacific Islands Forum. Andrew Meares Share on twitter Share on Google Plus by Laura Tingle Just in case you possibly missed these important qualifications, the Prime Minister would like it known that while we have always been a compassionate nation, and as a result are lifting our refugee intake , there are some important qualifications .\nThese are that we are now being compassionate to minority groups from the Middle East, but we are not being compassionate to anyone who has travelled very far from home and thus might have crossed the paths of people smugglers.\n\"We are very much going to go to people who have sought asylum, sought refuge on the borders of Syria, in Turkey, in Lebanon, in Jordan,\" Tony Abbott told the ABC on Wednesday night.\n\"We're not particularly going to go and look for people who have used the services of people smugglers to get into Europe.\"\nDavid Rowe A question has to be whether it was really necessary – amid the surging change of heart we have seen in the refugee debate in the past week – to set down these qualifiers so early.\nThe references have been there from the start. On Sunday, the Prime Minister announced a change of heart on the issue by saying: \"We are disposed to take more people from this troubled region. I stress, people from persecuted minorities in camps, families from persecuted minorities in camps.\"\nOver-thinking things Some in the Coalition believe it was a reasonable thing to say, since it is the case that the most needy refugees tend to be the minorities. Others believe the clunky inclusion of the qualifications was the Prime Minister's office over-thinking things. Other people believe there is a dog whistle involved. Others think it is a reflection of the divisions within the Coalition, or an underlying difficulty or nervousness at being seen to do anything that might encourage \"The Boats\" to start again.\n Prime Minister Tony Abbott. Alex Ellinghausen But the net result is that in political terms, the Prime Minister looked behind the pace on the politics of this issue. Instead of gaining unqualified kudos for changing his mind, for reading public opinion, he didn't look like he was setting the terms of the debate but was scrambling to catch up with it.\nThis is the asylum seekers issue we are talking about, for goodness sake – one of those reliable Coalition political staples. It didn't even get any better when it was wrapped up with a national security announcement about bombing Syria .\nWe are a week away from the Canning byelection, which is widely seen as a crucial test for the Prime Minister. Tony Abbott's political competence – his ability to set the terms of the debate – is an openly and widely discussed issue among his colleagues, as they contemplate continuing woeful polls and how they should assess the Canning result.\nThe economy, and the China-Australia Free Trade Agreement , are also in territory in which the Coalition has been dominant. Things are obviously not going all that well for the economy at the moment – for reasons outside the control of the government. But does that make it unpatriotic to mention bad numbers?\nBad economic numbers Confronted with some bad economic numbers in an interview on Wednesday night – unemployment up, growth down, the budget deficit up since he came to office – the Prime Minister declared: \"I refuse to talk our country down and I hope the national broadcaster might join me in looking for the good and boosting our country, which has so much potential.\"\nFor Abbott, it seems that his politics remains firmly set in the \"my way or the highway\" mode, even as the polls show the voters – and the party room – opting for the highway in numbers vaguely reminiscent of the images coming from the Hungarian border.\nDespite the machismo of this approach, there is reason to believe the Prime Minister – and the government – are seriously unnerved about the economic outlook, particularly for jobs.\nOn Wednesday, economic correspondents were called to the Prime Minister's office to be briefed on why Thursday's jobs numbers would be really bad. Unfortunately, the government couldn't even get this right, since – with their notorious eccentricity – the labour force figures actually showed a slight improvement in the unemployment rate.\nOf course, after last week's poor economic growth figures, a bad jobs number a week before Canning would have been disastrous to claims of superior economic management. But you would think the government could do better than it has on the potential benefits of the China free-trade agreement.\nThe reality of the agreement remains that Labor has not, even in its wilder moments, suggested it would not pass it. Yes it, and the trade union movement, have \"maximised the potential\" of questions about labour market issues in the agreement. But that doesn't mean there are not a few legitimate questions about skills testing that it is entitled to raise.\nWords of reassurance It is hard not to think that, faced with a choice of leaving the policing of skills of foreign workers to hard-pressed state regulators or including some words of reassurance in federal legislation, the government has deliberately opted for the former.\nTrade Minister Andrew Robb, after all, has an industrial relations and labour market pedigree that goes back to the Mudginberri dispute in the 1980s.\nOn the other hand, Robb is the only person on the government's side who has been setting out any detailed rebuttal to Labor's various colourful charges about the FTA, as he did on Insiders last Sunday and has been prepared to do on numerous occasions through the week.\nThe Prime Minister, and most of Robb's senior colleagues, by comparison, instead simply rail against the evil labour movement, and assert that the deal will be really excellent for Australia.\nBoth sides of politics have been conspicuously stepping up the hysteria about the China FTA and you can expect that will continue until after Canning. But the bottom line is that there is a mutual interest in getting the deal legislated with the slightest modicum of parliamentary bargaining to keep everyone happy. The danger is that by drawing a line in the sand and saying that any modifying legislation would be \"racist\", the government has set up a really unnecessary hurdle for itself – and the deal.\nAnd for all the noise, the question of whether the government's advocacy of the deal has penetrated to counter the trade union's campaign against it is a moot point. Word is that a public relations firm has been contracted to run a campaign selling the FTA. It's a shame the job can't be left to politicians.", "external_links": ["https://plus.google.com/108650647776677996559", "https://twitter.com/latingle"], "published": "2015-09-10T15:00:00.000+03:00", "crawled": "2015-09-10T13:06:38.530+03:00", "highlightTitle": ""}