{"organizations": [], "uuid": "00850332b571a6db072901bc9bf8a2cc40444c82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-targetukfocus/?format=rss", "section_title": "Finance News | Reuters - UK Focus - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/global-markets-shares-slide-u-112755031.html", "country": "US", "title": "GLOBAL MARKETS-Shares slide before U.S. jobs data", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "GLOBAL MARKETS-Shares slide before U.S. jobs data", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T14:27:00.000+03:00", "replies_count": 0, "uuid": "00850332b571a6db072901bc9bf8a2cc40444c82"}, "author": "", "url": "https://uk.finance.yahoo.com/news/global-markets-shares-slide-u-112755031.html", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Shares slide before U.S. jobs data", "locations": ["U.S.", "U.S"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Europe shares drop 2 percent before U.S (Other OTC: UBGXF - news ) . jobs report \n* Euro edges up after hitting two-week low vs dollar \n* Asia shares down for seventh straight week, worst run \nsince 2011 \n* Oil sags back to $50 a barrel but up for second week \nBy Marc Jones \nLONDON, Sept 4 (Reuters) - World shares slid towards their \nfourth weekly loss in the last five on Friday, as a boost from a \nsupportive-sounding European Central Bank gave way to caution \nbefore U.S. jobs data. \nConcerns about China consigned Asian shares \nto a seventh straight weekly loss and Europe's markets fell 2 \npercent after rising almost 2.5 percent on Thursday. \n\"Markets are worried about a too strong U.S. job report \nwhich could spark the Fed into hiking rates in September,\" said \nPhilippe Gijsels, head of research at BNP Paribas Fortis Global \nMarkets. \nWall Street was set to follow suit, with index futures \npointing to a fall of 1.1 percent in the S&P 500. \nThursday's gains in Europe were driven by ECB President \nMario Draghi saying the bank was prepared to expand its 1 \ntrillion euro stimulus programme aimed at lifting growth and \ninflation in the euro zone. \nBut Friday's focus was on whether U.S. jobs data due at 1230 \nGMT would keep the Federal Reserve on track to raise its record \nlow interest rates later this year. \nEconomists polled by Reuters expect the U.S. economy to have \nproduced 220,000 new jobs last month, continuing the robust \nemployment creation of the past five years. Average hourly \nearnings are predicted to have risen by 0.2 percent, as they did \nin July. \nA strong reading will keep alive chances that a first Fed \nhike in almost a decade could come this month. Following a tough \nlast month for global markets however, markets now see December \nor early next year as more likely. \n\"We were until recently firm Septemberists but now it's very \nmuch on a knife edge,\" said Luke Bartholomew at Aberdeen Asset \nManagement in London. \n\"Market volatility has shaken them (Fed policymakers) \nsomewhat ... so seeing that markets are very fragile, do they \nwant to shock them with hiking now? I think that is a very live \ndebate now.\" \nIn the foreign exchange markets, the dollar fell 0.8 percent \nagainst the yen to 119.10 as the safe-haven Japanese \ncurrency capped a third week of gains. \nThe euro was fractionally stronger at $1.1130 having been \ndriven to a two-week low of $1.10875 and a four-month low \nagainst the yen by Draghi's talk of more money \nprinting. \nThe ECB also cut its growth and inflation forecasts and \nwarned of possible further fallout from China. Coupled with a \npotential delay to a Fed move, euro zone bond yields fell \nfurther on Friday, with German 10-year yields, \nhitting their lowest level in nearly a week at 0.69 percent. \n\"Fundamentally market reaction to U.S. data can be \nshort-lived. In the medium-term perspective ECB QE matters more \nthan U.S. non-farm payrolls so we think the bias is bullish for \n(German) Bunds,\" said BNP Paribas (Xetra: 887771 - news ) strategist Patrick Jacq. \nCRISIS PROPORTIONS \nStrains in Asia stayed close to the surface despite hard-hit \nChinese markets being closed for a second day for a holiday. \nMSCI (NYSE: MSCI - news ) 's broadest index of Asia-Pacific shares outside Japan \nchalked up its worst weekly losing streak since \n2011 as it ended down 0.9 percent on the day and more that 4 \npercent on the week. \nJapan's Nikkei fared even worse. It (Other OTC: ITGL - news ) fell 2.5 percent \non the day and 7 percent for the week as it slumped to a \nseven-month low. \nThere was so sign of relief for the region's emerging market \ncurrencies either. \nBank Negara Malaysia was spotted intervening to stem the \nringgit's weakness as confidence continued to be hit by a \ncorruption scandal swirling round Prime Minister Najib Razak. \nThe Institute of International Finance warned the current \nslump in emerging market stocks -- down 40 percent since April \n-- and currencies had now reached \"crisis proportions\" \nIn commodities markets, which have been battered by fears of \na hard landing in China, trade remained highly volatile. \nBrent crude slipped 0.4 percent to $50.47 per barrel \nalthough it was clinging to a second week of modest gains. \nCopper fell 1.6 percent to $5,160 per tonne after \nsurging to $5,314 on Thursday, a more than three-week high, as \ninvestors closed out positions before the U.S. jobs data. \n(Additional reporting by Nichola Saminather and Hideyuki Sano \nin Singapore and Tokyo; Editing by Toby Chopra)", "external_links": [], "published": "2015-09-04T14:27:00.000+03:00", "crawled": "2015-09-04T14:38:57.205+03:00", "highlightTitle": ""}