{"organizations": [], "uuid": "a8bd7e413f4f16d1a78a64ddd695140aed1effb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/02/janus-gross-idUSL1N1172P020150902", "country": "US", "title": "Bill Gross: Fed tightening cycle could create self-inflicted financial instability", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Bill Gross: Fed tightening cycle could create self-inflicted financial instability | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T15:47:00.000+03:00", "replies_count": 0, "uuid": "a8bd7e413f4f16d1a78a64ddd695140aed1effb5"}, "author": "Jennifer Ablan", "url": "http://www.reuters.com/article/2015/09/02/janus-gross-idUSL1N1172P020150902", "ord_in_thread": 0, "title": "Bill Gross: Fed tightening cycle could create self-inflicted financial instability", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Sept 2 Bond guru Bill Gross, who has long called for the Federal Reserve to raise interest rates, said on Wednesday that U.S. central bankers may have missed their window of opportunity to hike rates earlier this year and normalizing them now could create \"self-inflicted financial instability.\"\nIn his September Investment Outlook report, Gross wrote that his concept of a neutral policy rate closer to a nominal 2 percent \"now cannot be approached without spooking markets further and creating self-inflicted financial instability.\"\nThe neutral rate is the point at which the rate is neither stimulative nor contractionary.\nThe Fed seems intent on raising the fed funds rate this month if only to prove that they can begin the journey to normalization, said Gross, who runs the Janus Global Unconstrained Bond Fund.\n\"They should, but their September meeting language must be so careful, that 'one and done' represents an increasing possibility - at least for the next six months,\" Gross said. \"The Fed is beginning to recognize that 6 years of zero bound interest rates have negative influences on the real economy - it destroys historical business models essential to capitalism such as pension funds, insurance companies, and the willingness to save money itself. If savings wither then so too does its Siamese Twin - investment - and with it, long-term productivity, the decline of which we have seen not just in the U.S. but worldwide.\"\nGross said: \"The global economy's finance-based spine is so out of whack that it is in need of a major readjustment. In this case, even the best of chiropractors could not even attempt it. Nor would a one-off fed fund increase straighten it out.\"\nHe suggested that major global policy shifts - all in the same direction - should emphasize government spending as opposed to austerity, and that countries recognize that competitive devaluations do nothing but allow temporary respite from the overreaching global problem of too little aggregate demand versus too much aggregate supply.\n\"It is demand that must be increased - yes China must move more quickly to a consumer-based economy - but the developed world must play its part by abandoning its destructive emphasis on fiscal austerity, and begin to replace its rapidly decaying infrastructure that has been delayed for decades,\" Gross said.\nOverall, Gross said \"super-size\" August movements in global stocks are but one sign that something may be amiss in the global economy itself, China notwithstanding. (Reporting By Jennifer Ablan; Editing by Chizu Nomiyama )", "external_links": [], "published": "2015-09-02T15:47:00.000+03:00", "crawled": "2015-09-02T14:54:30.627+03:00", "highlightTitle": ""}