{"organizations": ["Department of Industrial Policy and Promotion", "The Economic Times App", "National Company Law Tribunal", "Cannes Film Festival", "NDA", "Bank Board Bureau", "Debt Recovery Tribunals"], "uuid": "68663c83b76a06c57babf37370e238c319761165", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48979805,width-600,resizemode-4/meet-anjuly-chib-duggal-the-bureaucrat-who-likes-to-cover-her-ground-well.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358319.cms", "section_title": "Banking-Banking/Finance-Industry-The Economic Times", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/meet-anjuly-chib-duggal-the-bureaucrat-who-likes-to-cover-her-ground-well/articleshow/48979803.cms", "country": "IL", "title": "Meet Anjuly Chib Duggal: The bureaucrat who likes to cover her ground well", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Meet Anjuly Chib Duggal: The bureaucrat who likes to cover her ground well", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T04:00:00.000+03:00", "replies_count": 0, "uuid": "68663c83b76a06c57babf37370e238c319761165"}, "author": "", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/meet-anjuly-chib-duggal-the-bureaucrat-who-likes-to-cover-her-ground-well/articleshow/48979803.cms", "ord_in_thread": 0, "title": "Meet Anjuly Chib Duggal: The bureaucrat who likes to cover her ground well", "locations": ["France", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ratan Watal", "Anjuly Chib Duggal", "Jansuraksha", "Duggal"], "text": "ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! In 2002, when for the first time a commercial Bollywood movie — Devdas — was being screened at the Cannes Film Festival in France , away from the limelight, Anjuly Chib Duggal , then a joint secretary from the information and broadcasting (I&B) ministry, was trying to assuage the fears of global directors on the lengthy approval procedures required for shooting in India. Cut to 2015, as the new financial services secretary , Duggal, a 1981 batch Indian Administrative Services (IAS) officer , has so far held limited meetings with heads of financial institutions, trying instead to get to the heart of the matter. \"She wants to get a hold on the subject first,\" one person familiar with the developments said. Duggal isn't new to North Block. She has served there for five years; first as a joint secretary before being promoted to additional secretary in the expenditure department of the finance ministry. Known to have played an important role at a time when fiscal management was a challenge, Duggal's experience in Department of Industrial Policy and Promotion will also hold good as India looks to expand the banking network through payments banks and other modules. In her nine-month stint with the corporate affairs ministry, Duggal had managed to sort out the long pending issue of setting up of National Company Law Tribunal , and integrated it in the proposed bankruptcy law. She also took various initiatives to improve the ease of doing business and implementation of Companies Act, 2013. If the North Block grapevine is to be believed, Duggal may have another nine months in her new role before she moves on as expenditure secretary when Ratan Watal retires in February 2016. Besides the government's ambitious social security schemes, Duggal's predecessor has left a wide variety of issues, which may require more than straightjacket policy making decisions. The priority being, setting up of a Bank Board Bureau (BBB) and get luminaries from the financial services industry. The NDA government also looks keener than the previous regimes on merger among private sector banks, and setting up of BBB is looked as a precursor towards that. Duggal will require a lot of backchannel communication to get both bank heads and unions on board for this to happen. A post graduate in psychology, Duggal may have to dig deep to ensure success on this front. Then there is the tricky issue of bad loans, which may require prodding banks to recover loans, resolving structural issues with Debt Recovery Tribunals, and coordinating with other ministries for stalled projects and reforms in power sector. In the first month itself, Duggal has held meetings even with junior staff in her department, indicating that she is open to suggestions. Her focus, insiders say, so far has been mainly on the financial inclusion drive billed as 'Jandhan to Jansuraksha'. Duggal may also consider reassigning roles to her subordinates in the financial services department, as the government looks to restrict its role to only policy making and adopt a hands- off approach from operational aspects of PSBs. Already, there is a vacancy of a joint secretary's post and a realignment of portfolios is not ruled out in the short term. Stay on top of business news with The Economic Times App. Download it Now! DON'T MISS any stories, follow us on Twitter Follow", "external_links": [], "published": "2015-09-16T04:00:00.000+03:00", "crawled": "2015-09-16T05:42:02.965+03:00", "highlightTitle": ""}