{"organizations": ["Single Window Scheme Business & Finance"], "uuid": "6b918f62c1d59eb94137c12d99d845ec91689ed2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/wbre7ih775_8331230321536_9705418302004.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/642950/1/customs-satisfied-with-two-weeks-of-single-window-.html", "country": "US", "title": "Customs satisfied with two weeks of Single Window Scheme", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Customs satisfied with two weeks of Single Window Scheme", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T01:06:00.000+03:00", "replies_count": 0, "uuid": "6b918f62c1d59eb94137c12d99d845ec91689ed2"}, "author": "", "url": "http://www.modernghana.com/news/642950/1/customs-satisfied-with-two-weeks-of-single-window-.html", "ord_in_thread": 0, "title": "Customs satisfied with two weeks of Single Window Scheme", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Emmanuel Agyei"], "text": "Business & Finance | 15 September 2015 23:06 CET Customs satisfied with two weeks of Single Window Scheme By Joy Business|Emmanuel Agyei \nThe Customs Division of Ghana Revenue Authority has expressed satisfaction with the progress of work in the implementation of Single Window Scheme at the ports. \nIt’s exactly two weeks today since Customs took over the import classification and valuation role with the support of IT firm, West Blue. \nAbout 1000 of the reports used by clearing agents have so far been issued. This is below the about 10,000 which used to be issued by the Destination Inspection Companies, DIC’s within the same time period. \nBut the Deputy Manager of the Technical Services Bureau, Seidu Yakubu explains to Joy Business, it may be inaccurate for now, to compare. \n“The DIC’s had the backlog to clear. Ours is pre-arrival and so an assessment of 2 weeks of operations as compared to them might not be a good one because most of the people would not have sent their declarations because its pre-arrival and a lot of them had already sent their declarations to the DIC’s. So we had only 2,632 and we have processed 1000 as against the major challenges like someone taking a document coming by road and just writes ‘by road’– so the rejection rate in the first week was just too much” \nAccording to him, a number of measures have however been instituted to address the declarant-related challenges to complement the resolved initial technical challenges - for a much improved efficiency from now. \n“Some of them when they are queried, they don’t go back to their system and so they don’t see it immediately. So we have resorted to calling them in advance. Now what we are doing is that, we are engaging our stakeholders. Just this morning we’re having a meeting with the declarants or the clearing agents to tell us about the challenges and find a way around them. \n“And we have a team of officers standing by at the Ghana Institute of Freight Forwarders (GIFF) office in Tema training and guiding them because it’s new,” he added.", "external_links": [], "published": "2015-09-16T01:06:00.000+03:00", "crawled": "2015-09-16T00:27:18.539+03:00", "highlightTitle": ""}