{"organizations": ["Religare", "Equitas", "NBFC", "Small Bank", "MFI", "Kotak Securities"], "uuid": "1a1ec6bb5dc100224f4ea36f2ff8b9a1c3f53325", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2013-10/07/full/1381161985-8907.jpg", "site_section": "http://business-standard.com//rss/finance-103.rss", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/is-this-the-beginning-of-the-end-for-sks-microfinance-115091800704_1.html", "country": "IN", "title": "Is this the beginning of the end for SKS Microfinance?", "performance_score": 0, "site": "business-standard.com", "participants_count": 0, "title_full": "Is this the beginning of the end for SKS Microfinance?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T13:50:00.000+03:00", "replies_count": 0, "uuid": "1a1ec6bb5dc100224f4ea36f2ff8b9a1c3f53325"}, "author": "", "url": "http://www.business-standard.com/article/finance/is-this-the-beginning-of-the-end-for-sks-microfinance-115091800704_1.html", "ord_in_thread": 0, "title": "Is this the beginning of the end for SKS Microfinance?", "locations": ["Brisbane", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Janalaxmi", "Raghuram Rajan"], "text": "Special Fares from India to Brisbane and Cairns. Is this the beginning of the end for SKS Microfinance? Not getting a banking licence would have limited immediate impact on the operations of SKS, but over the long run it will affect its growth and profitability Not getting a banking licence would have limited immediate impact on the operations of SKS, but over the long run it will affect its growth and profitability SKS Microfinance was hammered on the bourses after its name did not feature among the list of those who were awarded the Small Banks licence. Analysts were unanimous in their view about a possible de-rating of the stock. SKS Micro did not surprise losing nearly Rs 60 or 13.5 per cent of its value on the first day of listing post the news. Many are expecting the stock to go down further. ALSO READ: RBI grants small finance banks licence to 10 entities For SKS Micro, not getting a banking licence would have limited immediate impact on its operations but over the long run it will affect its growth and profitability. But for SKS Micro as a stock, the best days are clearly behind it. Before commenting further on SKS Micro, let’s take a look at how the small bank licences can impact the microfinance sector. Small Bank licences are considered as the biggest move in the banking circle since bank nationalisation in 1969. Governor of RBI, Raghuram Rajan has to be credited for the move as he floated the idea of smaller rural banks in 2009, much before he was the governor. Small banks, as the name suggests is targeted at smaller depositors and borrowers, who are also the same kind of customers micro finance companies like SKS Micro approach for lending funds. ALSO READ: SKS Microfinance slumps on failure to obtain small finance bank licence For small banks, at least 50 per cent of its loan portfolio should comprise loans and advances of up to Rs 25 lakh. Furthermore, maximum loan size and investment limit exposure to a single borrower and group has been restricted to 10 per cent and 15 per cent of its capital funds. Total credit extended to the priority sector should be 75 per cent. Small banks will clearly be operating in the same turf as microfinance companies. This is the reason that RBI has chosen to give the small bank licences mainly to micro finance companies that have the experience and bandwidth in operating in the area. Unfortunately, SKS Micro is now the only large microfinance company which will not be a bank. According to a Kotak Securities note, SKS Micro, the second large micro finance company, is the only large micro finance institution among the top 10 players to be kept out of the list. SKS is the only large microfinance player that will remain in the NBFC (non-banking finance company) format. Bandhan, the largest MFI was awarded a universal bank license last year and Janalaxmi (#3), Ujjivan (#4) and Equitas (#5) players have now been awarded small bank licences, says the Kotak note. A Religare report says that conversion of nine micro finance institutions into banks (one universal bank and eight small finance banks) will lead to a tectonic change in the microfinance space. As per their calculation, around 60 per cent of micro finance credit will shift to banks (including Bandhan), who would eat into the market share of NBFC micro financiers. Banks would enjoy an edge over traditional micro finance companies due to reduced political risk, better liability franchise and lower cost of funds, while pure microfinance companies like SKS Micro may see pressure on growth and spreads over the medium to long term. Since micro financiers were not allowed to raise money on their own, they used to borrow money from commercial banks at high rates and re-finance it to smaller borrowers. High cost of borrowing and lack of interest in the constituency tapped by microfinance companies by large banks meant that SKS Micro got away by charging high interest rates of around 20-22 per cent from the borrowers. Now that these micro finance companies will be allowed to collect deposits, their cost of funds will fall substantially which in turn would lead to lower interest rates for the borrower. SKS Micro however, does not have this advantage and will have to compete with small banks on borrowing rates, while its cost of funds will remain high, thus impacting its margins. Analysts had priced in a huge premium for SKS Micro’s valuation on the company getting a Small Bank licence. Kotak Securities in its note has brought down the price target of SKS Micro from Rs 580 per share to Rs 420 per share by removing the option value of the bank which was earlier built into their price target. However, Kotak Securities feels that the micro finance borrowers are more sensitive to the service offerings than the rate of interest. SKS’s interest rate on microfinance loans is currently lower than that of peers and hence for now it is well placed to compete with the MFI-turned banks when they drop lending rates. Religare however feels that SKS Micro is currently trading at a high premium, mainly because consensus was pricing in very high growth post conversion into a bank and massive amount of equity dilution (40 per cent) at a very high premium to book value. Considering that dilution is unlikely to happen over the medium term, Religare expects the stock to lose some of its premium valuation. Overnight the playing field for SKS Micro has changed. Latest News", "external_links": [], "published": "2015-09-18T13:50:00.000+03:00", "crawled": "2015-09-18T14:21:57.045+03:00", "highlightTitle": ""}