{"organizations": [], "uuid": "c1f818fe71a69b0b28a535e23817001826971a67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/04/markets-bonds-euro-idUSL5N11A31O20150904", "country": "US", "title": "ECB support drags euro zone bond yields lower", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "ECB support drags euro zone bond yields lower | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T20:30:00.000+03:00", "replies_count": 0, "uuid": "c1f818fe71a69b0b28a535e23817001826971a67"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/04/markets-bonds-euro-idUSL5N11A31O20150904", "ord_in_thread": 0, "title": "ECB support drags euro zone bond yields lower", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Prospects for beefed-up QE buoy euro zone bonds\n* ECB outlook offsets U.S. jobs data\n* German yields down 7 bps on day (Updates prices, adds U.S. data)\nBy Emelia Sithole-Matarise\nLONDON, Sept 4 (Reuters) - Euro zone bond yields fell further on Friday following a strong signal from the European Central Bank that it is willing to take further steps to shore up the currency bloc's economy.\nThe ECB's dovish message on Thursday held the focus even as a U.S. jobs report kept alive prospects of a Federal Reserve interest rate hike later this month.\nWhile the Fed has so far indicated that it is likely to raise interest rates this year, the ECB and China's central bank - where growth concerns are exacerbating a commodity rout - are tilting towards more easing.\nThe ECB cut its growth and inflation forecasts on Thursday, warning of possible further fallout from China and paving the way for an expansion of its 1-trillion-euro plus asset-buying programme.\nECB President Mario Draghi also said the bond-buying programme may run beyond September 2016 and the bank may adjust its size and composition.\nECB Governing Council member Ewald Nowotny reinforced the downbeat inflation outlook on Friday, saying inflation in the euro zone may enter negative territory in coming months.\nGerman 10-year yields, the euro zone benchmark, were 7 basis points lower at 0.67 percent, their lowest level in more than a week and adding to a 6 bps fall on Thursday. Yields on other euro zone bonds were 2-6 basis points lower.\n\"In the medium-term perspective, ECB QE matters more than U.S. non-farm payrolls so we think the bias is bullish for (German) Bunds,\" said BNP Paribas strategist Patrick Jacq.\nRecent turmoil in financial markets triggered by fears of slowing growth in China, the world's second largest economy, have raised speculation the Fed may hold off on its first rate hike in almost a decade.\nU.S. job growth slowed in August, but previous months were revised higher, the unemployment rate dropped to a near 7-1/2-year low and wages accelerated.\nThe economy added 173,000 jobs in August, fewer than the 220,000 expected, while data from June and July was revised to show 44,000 more jobs created than previously reported.\nIt was a mixed bag that leaves the decision on whether the Fed raises rates at a much-anticipated meeting on Sept. 16-17 hanging on volatility in financial markets over the next couple of weeks. (Editing by Toby Chopra and John Stonestreet)", "external_links": [], "published": "2015-09-04T20:30:00.000+03:00", "crawled": "2015-09-04T19:53:00.240+03:00", "highlightTitle": ""}