{"organizations": [], "uuid": "777b2fc7b26e7f572f909b969d595ee6bdd4581e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/miscellaneous/sheena-bora-murder-case-2012-samples-dont-match-those-exhumed-recently-says-report/139191", "country": "IE", "title": "Sheena Bora murder case: 2012 samples don’t match those exhumed recently, says report", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Sheena Bora murder case: 2012 samples don’t match those exhumed recently, says report | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T05:25:00.000+03:00", "replies_count": 0, "uuid": "777b2fc7b26e7f572f909b969d595ee6bdd4581e"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/miscellaneous/sheena-bora-murder-case-2012-samples-dont-match-those-exhumed-recently-says-report/139191", "ord_in_thread": 0, "title": "Sheena Bora murder case: 2012 samples don’t match those exhumed recently, says report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Obit: Reston, Virginia, founder Robert E. Simon dies at 101 Obit: Award-winning poet CK Williams, impassioned observer, dies at 78 Presidential race: Republican Ben Carson claims benefits from Muslim criticism In yet another twist in the Sheena Bora murder case, the bone samples of the charred body collected from Pen in 2012 by forensic experts do not match those obtained from the remains which were exhumed recently as “they may not be the same”.\nThe forensic experts at BYL Nair Hospital here, who submitted a 26-page report to Khar police station last week, have expressed doubts that the samples received might have got mixed up and may not belong to Sheena Bora.\nJJ Hospital had handed over the samples to Khar police last month, after which the evidence was forwarded to Nair Hospital. But the forensic team of the hospital, in its report submitted to police pointed out that the bone samples do not match with those that had been collected by the Pen police in May 2012.\nThe report says the remains collected in 2012 and the ones recently handed over to them by JJ Hospital “may not be the same.”\n“If there is a mix-up of samples, then it will surely dampen the efforts of forensic recreation of the crime,” a police official said.\nWhen asked, In-charge of Khar police, Dattatrey Bhargude, refused to provide any details of the report.\nInterestingly, Mumbai police has already established a DNA match between Sheena Bora and Indrani Mukerjea with the help of the bones exhumed recently by the Khar police.\nWhen Mumbai police launched probe in the case, Pen police claimed that they had sent a right humerus (long bone from shoulder to elbow), two teeth, a burnt skin patch and strands of hair to JJ Hospital for age, gender and cause of death analysis in 2012. The JJ Hospital subsequently handed over the 2012 samples to Khar police on August 28.\nHowever, Nair hospital forensic experts said they have received a different set of remains than what Pen police mentioned in their post-mortem report.\nIndrani Mukerjea, her former husband Sanjeev Khanna and their driver Shyamvar Rai are in judicial custody over their alleged complicity in the murder.\nMaharshtra government had last week referred the case to the CBI.\n 21, 2015 9:25 pm", "external_links": [], "published": "2015-09-22T05:25:00.000+03:00", "crawled": "2015-09-22T07:59:17.355+03:00", "highlightTitle": ""}