{"organizations": [], "uuid": "39338b66b7c412be9b92a2cbba55e8360120a5d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30105241/earlyshares-wins-icon-real-estate-award-at-the-miami-real-estate-symposium-expo", "country": "US", "title": "EarlyShares Wins ICON Real Estate Award at the Miami Real Estate Symposium & Expo", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "EarlyShares Wins ICON Real Estate Award at the Miami Real Estate Symposium & Expo - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T16:00:00.000+03:00", "replies_count": 0, "uuid": "39338b66b7c412be9b92a2cbba55e8360120a5d1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30105241/earlyshares-wins-icon-real-estate-award-at-the-miami-real-estate-symposium-expo", "ord_in_thread": 0, "title": "EarlyShares Wins ICON Real Estate Award at the Miami Real Estate Symposium & Expo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EarlyShares co-founders honored with award for helping democratize real estate finance\nMiami, FL (PRWEB) September 24, 2015\nEarlyShares, the leading real estate crowdfunding investment platform , was recognized Friday by the organizers of the first annual Miami Real Estate Symposium & Expo with an ICON Real Estate Award. The honor was granted to celebrate EarlyShares’ accomplishments and impact on the disruption of commercial real estate finance.\nEarlyShares, founded in 2011, connects accredited investors to a curated selection of vetted, return-driven commercial real estate investments through a trusted, secure platform. Under regulatory exemptions enacted in 2013, EarlyShares introduces investors to the kinds of real estate opportunities that have traditionally been difficult and expensive to access and helps them enjoy the privileges of commercial real estate ownership: passive income, cash flow, and asset appreciation.\nEarlyShares also streamlines the process of commercial real estate capital raising for developers and sponsors, making it more efficient, transparent, and data driven.\nEvery transaction on EarlyShares is subjected to rigorous screening and compliance checks. Investments on the EarlyShares platform project average 7% preferred returns and 18% IRR. To browse all current investment opportunities on EarlyShares, click here .\n“It was a great honor for our team to accept the ICON Real Estate Award at the Miami Real Estate Symposium & Expo ,” said Joanna Schwartz, CEO and Co-Founder of EarlyShares. “Thank you to the organizers for the recognition!”\n“As EarlyShares and our flagship brand, Property.com, continue to grow alongside the real estate crowdfunding industry, we look forward to giving many more investors access to the kinds of real estate investments that high-net-worth investors have long used to generate wealth,” Schwartz continued. “We’re proud to be building this business from our Miami home base, so we especially appreciate being honored by our local real estate community.\nUnder current SEC regulations, only accredited investors who are registered users of EarlyShares are able to invest in the opportunities on EarlyShares. Interested investors can sign up here and fill out an accreditation questionnaire to determine if they are eligible to invest.\nAbout EarlyShares\nEarlyShares is the trusted real estate crowdfunding platform that gives accredited investors direct access to vetted, return driven investments in commercial real estate. Under new securities regulations, EarlyShares streamlines the processes of real estate investing and capital raising to make them more accessible, transparent, and data-driven. Thousands of investors are seeking to invest nearly $300 million on EarlyShares in the next 12 months. For more information or to join the ‘Future of Investing,’ visit EarlyShares.com.\nCONTACT:\nMadelyn Young\nEarlyShares Marketing & PR\n786-272-2022\nmyoung(at)earlyshares(dot)com\n //www.prweb.com/releases/2015/09/prweb12981621.htm\n ", "external_links": ["https://www.earlyshares.com/users/sign_up", "https://www.earlyshares.com/projects", "http://miamirealestatesymposium.com/?mc_cid=e80307c43c&mc_eid=%5BUNIQID%5D", "http://www.prweb.com/releases/2015/09/prweb12981621.htm"], "published": "2015-09-24T16:00:00.000+03:00", "crawled": "2015-09-25T07:25:06.720+03:00", "highlightTitle": ""}