{"organizations": [], "uuid": "88c770f709206c7ac29089fff6b6e46330334658", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiplinger.com", "main_image": "http://www.kiplinger.com/kipimages/pages/13977.jpg", "site_section": "http://kiplinger.com/about/rss/kiplinger.rss", "section_title": "Kiplinger's Personal Finance", "url": "http://www.kiplinger.com/article/taxes/T054-C000-S001-states-where-taxes-are-going-up.html?rss_source=rss", "country": "US", "title": "States Where Taxes Are Going Up", "performance_score": 0, "site": "kiplinger.com", "participants_count": 0, "title_full": "States Where Taxes Are Going Up", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T07:00:00.000+03:00", "replies_count": 0, "uuid": "88c770f709206c7ac29089fff6b6e46330334658"}, "author": "", "url": "http://www.kiplinger.com/article/taxes/T054-C000-S001-states-where-taxes-are-going-up.html?rss_source=rss", "ord_in_thread": 0, "title": "States Where Taxes Are Going Up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "States Where Taxes Are Going Up You'll pay extra for gas, cigarettes and more if you live in one of these places. Follow @MilesKruppa \nSome states still face tight budgets after years of recession and slow recovery. Increasingly, they are turning to tax hikes to make up for the shortfalls. If you live in one of these states, the taxes will hit you in different places — at the pump, in the store, or on your tax return. See Also: 10 Least Tax-Friendly States for Retirees \nIn Connecticut , sales of clothing and shoes under $50 are no longer exempt from the state’s 6.35% sales tax, and sales of yachts and other luxury items will now be taxed at 7.75%, up from 7%. High-income residents will be hit hardest by the tax changes, as the state added two new top income tax brackets and increased the highest rate to 6.9%. \nKansas has increased its sales tax by 0.35 percentage point to 6.5% in an effort to close a $400-million budget gap. Coupled with local sales taxes, Kansas now leapfrogs California to have the eighth-highest sales tax in the U.S., according to the Tax Foundation. Kansas residents also pay more for cigarettes following a 50-cent increase on each pack of 20. \nVermont aims to close a $100-million budget shortfall by lowering the amount millionaires can deduct on income tax returns. The Green Mountain State also raised the cigarette tax by 33-cents a pack and removed an exemption for soft drinks from the 6% sales tax. Advertisement \nStruggling to get enough money from Congress to repair crumbling roads and bridges, many states are turning to gasoline taxes for funding. South Dakota, Utah, Idaho, Iowa and Nebraska are all raising their gas taxes by between 5 cents and 10 cents per gallon. More states are sure to follow in the years ahead.", "external_links": [], "published": "2015-09-18T07:00:00.000+03:00", "crawled": "2015-09-18T20:29:04.581+03:00", "highlightTitle": ""}