{"organizations": ["Chambers Bank", "Arkansas Business Staff"], "uuid": "98990d5df8e9b80f7cb8f4436312d6956ba624a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arkansasbusiness.com", "main_image": "http://assets.inarkansas.com/64643/lex-golden.jpg", "site_section": "http://www.arkansasbusiness.com/rss/banking", "section_title": "Banking & Finance - ArkansasBusiness.com", "url": "http://www.arkansasbusiness.com/article/107327/allied-access-sore-subject-between-chambers-bank-acme-holding", "country": "US", "title": "Allied Access Sore Subject Between Chambers Bank, Acme Holding", "performance_score": 0, "site": "arkansasbusiness.com", "participants_count": 0, "title_full": "Allied Access Sore Subject Between Chambers Bank, Acme Holding", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T08:00:00.000+03:00", "replies_count": 0, "uuid": "98990d5df8e9b80f7cb8f4436312d6956ba624a2"}, "author": "", "url": "http://www.arkansasbusiness.com/article/107327/allied-access-sore-subject-between-chambers-bank-acme-holding", "ord_in_thread": 0, "title": "Allied Access Sore Subject Between Chambers Bank, Acme Holding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lex Golden"], "text": "by Arkansas Business Staff on Monday, Sep. 28, 2015 12:00 am Lex Golden \nThe testy relationship between Acme Holding Co. and the leading creditor in its bankruptcy, evident in a two-day hearing in April, hasn’t improved. \nChambers Bank of Danville was denied access to perform due diligence this summer on Acme’s prime asset: Allied Bank of Mulberry. \nJohn Riedel, an attorney for Chambers, brought up that sore point on Sept. 18 at a meeting of creditors at the federal courthouse in Fort Smith. \nLex Golden, chairman and CEO of Acme, explained that the decision to refuse Chambers’ request was made by the Allied Bank board of directors. \nRiedel pointed out that under the loan agreement with Acme, Chambers has the right to perform due diligence on Allied Bank and its board of directors have no say in the matter. \nChambers holds two delinquent loans to Acme totaling more than $4.5 million. That debt is secured by Acme’s ownership of the $98.6 million-asset Allied Bank. \nThe due diligence of Allied was among a string of questions that Riedel asked Golden, but he often had difficulty getting meaningful answers. \n“Mr. Golden, we’ll get through this a lot faster if you just answer my questions,” Riedel said at one point. \n“I didn’t come prepared to talk about Allied Bank,” Golden said after Riedel kept pressing him for answers about the bank’s condition and its dealings. \nGolden, the controlling shareholder in Acme, is also special assets manager for Allied Bank. \nOutside of bankruptcy court, Chambers Bank is seeking summary judgment of $1.8 million against Golden and his wife, Ellen, in connection with one of its Acme loans. \nIn response to the lawsuit, filed in Yell County Circuit Court, the Goldens describe themselves as merely “accommodating parties” to the loan to Acme.", "external_links": [], "published": "2015-09-28T08:00:00.000+03:00", "crawled": "2015-09-28T09:24:51.579+03:00", "highlightTitle": ""}