{"organizations": [], "uuid": "cb5132a6121b21ebb6910c29cdc1817f994d4095", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/d/c/6/h/image.related.articleLeadwide.620x349.gjhadf.png/1441607318948.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/55/utilities", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/the-economy/a-cavalcade-of-failure-as-anniversaries-roll-round-20150907-gjhadf.html", "country": "AU", "title": "A cavalcade of failure as anniversaries roll round", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "A cavalcade of failure as anniversaries roll round", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "cb5132a6121b21ebb6910c29cdc1817f994d4095"}, "author": "", "url": "http://www.smh.com.au/business/the-economy/a-cavalcade-of-failure-as-anniversaries-roll-round-20150907-gjhadf.html", "ord_in_thread": 0, "title": "A cavalcade of failure as anniversaries roll round", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Opinion\nJoe Hockey ... talked up the great job we did boosting growth as G20 hosts last year at a meeting in Turkey. Photo: Nick Moir\nCruelty or coincidence? You decide.\nAdvertisements for the ABC's Utopia satire of government and infrastructure seemed to increase in tempo along with commentary on the Abbott government's second anniversary and Joe Hockey at a G20 meeting in Turkey talking up the great job we did boosting growth as hosts last year.\nNever mind that growth has gone backwards – apparently it would have gone backwards faster if Australia hadn't held the G20 presidency in 2014. So perhaps it's worth checking on how those world-leading commitments are going.\nIn Australia's case, among our G20 \"commitments\" were the $7 GP co-payment, the Abbott paid parental leave scheme, the tougher dole qualification period, a 1.5 per cent company tax cut, deregulating university fees, \"creating self-reliant industries\", producing a surplus equal to 1 per cent of gross domestic product (GDP) by 2023-24, and redirecting government expenditure \"to more productive uses, including greater infrastructure investment\".\nAdvertisement None of which has happened or show any sign of happening.\nRevisiting Australia's G20 \"Comprehensive Growth Strategy\" , the gap between the rhetoric and reality is wider than even Utopia 's scriptwriters might suggest.\nHockey's 2014 Economic Action Strategy manages to claim government policy \"will deliver over $125 billion of new additional infrastructure investment within six years, and is now the biggest Commonwealth infrastructure program in Australia's history – raising the level of GDP in Australia by 1 percentage point\".\nThe reality is that government spending has gone backwards and shows no sign of changing direction.\nAnd that's just in raw billions of dollars. As a percentage of GDP, government investment is at its lowest level for the better part of a century, if not longer.\nThat's a point that the Reserve Bank has quietly but firmly made at various times over the past couple of years. It has been largely ignored. Total government investment remains flat, notwithstanding the occasional warship purchase.\nIn June, Glenn Stevens went much further than RBA governors normally permit themselves when talking fiscal rather than monetary policy.\n\"Infrastructure spending has a role to play in sustaining growth and also in generating confidence … it would be confidence-enhancing if there was an agreed story about a long-term pipeline of infrastructure projects, surrounded by appropriate governance on project selection, risk-sharing between public and private sectors at varying stages of production and ownership, and appropriate pricing for use of the finished product,\" he said.\n\"The suppliers would feel it was worth their while to improve their offering if projects were not just one-offs. The financial sector would be attracted to the opportunities for financing and asset ownership. The real economy would benefit from the steady pipeline of construction work – as opposed to a boom and bust. It would also benefit from confidence about improved efficiency of logistics over time resulting from the better infrastructure.\n\"Amenity would be improved for millions of ordinary citizens in their daily lives. We could unleash large potential benefits that at present are not available because of congestion in our transportation networks.\n\"The impediments to this outcome are not financial. The funding would be available, with long-term interest rates the lowest we have ever seen or are likely to. (And it is perfectly sensible for some public debt to be used to fund infrastructure that will earn a return. That is not the same as borrowing to pay pensions or public servants.) The impediments are in our decision-making processes and, it seems, in our inability to find political agreement on how to proceed.\"\nInstead we have pollie-speak. Is the following from Utopia or a Hockey speech?\n\"We have now agreed to progress a multi-year Global Infrastructure Initiative. This initiative consists of an integrated set of actions to increase quality infrastructure investment across the G20 and beyond.\"\nAlas, it was part of the Australian Treasurer's closing statement at the G20 finance ministers and central bankers meeting in Cairns a year ago.\nWhat we have to show for it is the Treasury's Global Infrastructure Hub, for which Australian taxpayers are kicking in $30 million and the rest of the G20 $20 million. It has a four-year mandate. Its CEO arrived in June. It just had its second board meeting in Ankara, chaired by Treasury Secretary John Fraser.\nIt's right up there with the last budget's Northern Australia Infrastructure Facility – the NAIF. No, don't start me.\nThere's also the Nation Building Authority – the NBA. But that one's just on ABC TV on Wednesday nights.", "external_links": ["http://jbh.ministers.treasury.gov.au/files/2014/10/Economic_Action_Strategy_Annual_Report_2014_2.pdf", "http://jbh.ministers.treasury.gov.au/speech/018-2014/", "http://www.rba.gov.au/speeches/2015/sp-gov-2015-06-10.html", "https://g20.org/wp-content/uploads/2014/12/g20_comprehensive_growth_strategy_australia.pdf"], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T08:53:41.472+03:00", "highlightTitle": ""}