{"organizations": [], "uuid": "0cfa736ac4ca0f66379e78cafa84a733bf6d455b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/infosys-s.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/companies/infosys-cleared-of-us-visa-violation-charges/132168", "country": "IE", "title": "Infosys gets clean chit in visa violation case by US Department of Labor", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Infosys gets clean chit in visa violation case by US Department of Labor | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T19:49:00.000+03:00", "replies_count": 0, "uuid": "0cfa736ac4ca0f66379e78cafa84a733bf6d455b"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/companies/infosys-cleared-of-us-visa-violation-charges/132168", "ord_in_thread": 0, "title": "Infosys gets clean chit in visa violation case by US Department of Labor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Hindustan Unilever Limited sells bread and bakery business Modern to Everstone Group Wipro Cited as a Leader and Star Performer on the Capital Markets Application Outsourcing PEAK Matrix™ by Everest Group Quikr Deepens Its Verticalization Focus with Launch of QuikrHomes Infosys on Monday said that the US Labor Department has concluded its investigation in H1-B visa violation case and has said that the company has not violated the rules.\n“Infosys is pleased to report that the US Department of Labor (DOL) concluded its investigation with a determination of compliance regarding labor condition applications filed in the Southern California Edison project. Infosys fully cooperated with the DOL in its investigation, and over 145 files were reviewed, with no violations found,” the company said in a press release.\nThe US Department of Labor had announced an investigation in June against Indian IT majors Tata Consultancy Services (TCS) and Infosys for possible violations regarding the use of H-1B visas.\nThe probe was launched following reports that the two companies had displaced US employees in their IT outsourcing contracts with an American corporation, replacing them with cheaper resources from India, thereby allegedly violating labour regulations.\n“IT services companies like Infosys provide superior service, skill and scope from global centers of excellence, bringing value and technology innovations to enable American companies to be competitive and succeed. Infosys continues to actively recruit and hire talent in the US, but while there is a shortage of technology skills, Infosys is a responsible participant in the H-1B program. We do not practice or condone unfair or unethical H-1B visa practices. Our key priority is to operate fairly, ethically and with integrity, which is good business and what our clients expect,” Sandeep Dadlani, EVP and Head of Americas, Infosys said.\nInfosys shares were trading 1.01 per cent up at Rs 1070.25 on BSE at 11.40 am. On NSE, the shares were up 1.06 per cent at Rs 1,070.00 during the same time.\nFirst Published on September 08, 2015 11:49 am", "external_links": [], "published": "2015-09-08T19:49:00.000+03:00", "crawled": "2015-09-08T15:09:02.762+03:00", "highlightTitle": ""}