{"organizations": [], "uuid": "10795da42819bff0bf47d50bbe27b2bf0e040b9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DU064_man_mo_MG_20150911134829.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/ceos-with-cushy-stock-perks-may-put-your-safety-at-risk-2015-09-11", "country": "US", "title": "CEOs with cushy stock perks may put your safety at risk", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "CEOs with cushy stock perks may put your safety at risk - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T03:00:00.000+03:00", "replies_count": 2, "uuid": "fe33156d704c023eb299bf4b61ffd719a74cdbff"}, "author": "Catey Hill", "url": "http://www.marketwatch.com/story/ceos-with-cushy-stock-perks-may-put-your-safety-at-risk-2015-09-11#post-0", "ord_in_thread": 0, "title": "CEOs with cushy stock perks may put your safety at risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Want to avoid buying products that will later get recalled? One way may be to look at how the company’s chief executive gets paid, a new study suggests.\nGenerous stock-option awards for CEOs increases the likelihood of a company’s experiencing a product recall in the future, according to a recent study conducted at the University of Notre Dame’s Mendoza College of Business and published in the Strategic Management Journal. The study, which doesn’t identify specific companies or executives, analyzed product-recall data during the tenures of 386 chief executives at FDA-regulated (to ensure that all companies faced similar regulatory environments) public companies from 2004 to 2011.\nNuns bake thousands of communion hosts for papal visit (1:40) A group of nuns has been working overtime to help prepare for Pope Francis's visit to Philadelphia. Sisters at the Monastery of St. Clare recently made 100,000 communion wafers for the pontiff's Mass on Sept. 27.\n“We found a positive relationship between the proportion of CEO pay consisting of stock options, measured over a two-year period, and the occurrence of product recalls in the subsequent year,” says Adam Wowak, the study’s lead author.\nThe authors speculate that these stock options may boost CEOs’ desire to take risks. “Option-heavy pay arrangements engender aggressive risk taking by CEOs, who stand to benefit greatly from future increases in share prices but lose nothing if share prices fall,” Wowak says — a finding consistent with previous research on the topic.\nCEO tenure at the company is a mitigating factor here though, as the link between stock options and product recalls was strongest for CEOs who hadn’t been in their positions for very long, and less strong for longer-tenured CEOs. “CEOs typically become more conservative, as opposed to daring, as they advance in their tenures,” says Wowak. Furthermore, “founder-CEOs were more or less immune from options’ effects, which is consistent with the notion that founders may be more motivated by an intrinsic desire to protect their companies than by an extrinsic desire for large financial payouts.”\nWhile they may have the highest-profile jobs at their companies, CEOs aren’t fully responsible for recalls — they have entire teams working under them, after all — and plenty of CEOs with generous stock options work at companies where recalls are less prevalent. Plus, correlation, of course, does not equal causation — so stock-option compensation of CEOs may not be the cause of the higher recalls. Furthermore, stock-option payouts for CEOs have decreased since the mid-1990s, from about 50% of total pay then to about 15% or 20% now, the authors note.\nMore from MarketWatch", "external_links": ["http://onlinelibrary.wiley.com/doi/10.1002/smj.2277/abstract"], "published": "2015-09-11T03:00:00.000+03:00", "crawled": "2015-09-12T06:04:57.187+03:00", "highlightTitle": ""}