{"organizations": [], "uuid": "acd1732a868b94431542df16a84e198ca992e6a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-02/quick-said-to-seek-changes-in-loan-facility-signed-last-year", "country": "US", "title": "Quick Said to Seek Changes in Loan Facility Signed Last Year", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Quick Said to Seek Changes in Loan Facility Signed Last Year - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T16:50:00.000+03:00", "replies_count": 0, "uuid": "acd1732a868b94431542df16a84e198ca992e6a4"}, "author": "Luca Casiraghi", "url": "http://www.bloomberg.com/news/articles/2015-09-02/quick-said-to-seek-changes-in-loan-facility-signed-last-year", "ord_in_thread": 0, "title": "Quick Said to Seek Changes in Loan Facility Signed Last Year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Quick Restaurants SA is in talks to amend the terms of a credit facility signed less than 18 months ago because of declining earnings, according to two people familiar with the matter.\nThe fast-food chain has told lenders it may breach a covenant in December, as net debt may surpass 6.25 times earnings, said the people who asked not to be identified because the matter is private. The talks cover a 50-million euro ($56 million) facility agreed to in April 2014.\nQuick’s debt ratio rose to 6.4 times at the end of June, the people said, as the company contends with competition from McDonald’s Corp., Burger King Worldwide Inc. and so-called casual-dining chains. Failure to get new terms for the credit facility could affect Quick’s 595 million euros of bonds sold in April 2014.\nA spokesman for French state investment fund Qualium Investissement, owner of Quick, declined to comment on the debt talks. A spokeswoman for Quick said she couldn’t immediately comment when contacted by Bloomberg News.\nQuick’s management is seeking to sell some restaurants to reduce debt, the people said. Debtwire reported on the debt talks earlier.\nThe fast-food company’s earnings before interest, taxes, depreciation and amortization fell by about 10 million euros to 90 million euros in the 12 months ended June, the people said. The chain passed the June covenant test as the net debt-to-earnings ratio cap was 7.5 times. This will tighten in December.\nPrivate-equity funds TDR Capital and Oaktree Capital Management were among investors considering buying Quick in July, people familiar with the matter said at the time.\nQuick’s 440 million euros of first lien bonds due April 2019 are Quote: d at 84.3 cents on the euro, near the record low, according to data compiled by Bloomberg. They have lost about 5 cents since Aug. 11.", "external_links": [], "published": "2015-09-02T16:50:00.000+03:00", "crawled": "2015-09-02T12:13:55.264+03:00", "highlightTitle": ""}