{"organizations": [], "uuid": "0d207c9542846b5f765ccd42ea71deebd291c6d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/3L9Pw4WiaYPZbsk2fRjOxw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/d3f2de7edfa4ee3db8afa766adc8dfb02ea7b715_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/asia-markets-dip-end-tough-083118474.html", "country": "GB", "title": "Asia markets dip at end of tough week, US rates in focus", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Asia markets dip at end of tough week, US rates in focus", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T11:31:00.000+03:00", "replies_count": 0, "uuid": "0d207c9542846b5f765ccd42ea71deebd291c6d9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/asia-markets-dip-end-tough-083118474.html", "ord_in_thread": 0, "title": "Asia markets dip at end of tough week, US rates in focus", "locations": ["US", "Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 11, 2015, 09:38 BST - UK Markets close in 6 hrs 52 mins Asia markets dip at end of tough week, US rates in focus AFP – 7 minutes ago View Photo \n\nAsian markets mostly slipped Friday but ended a volatile week in relative calm after China unveiled a series of steps to shore up its economy and reassure investors, but fears of a US interest rate hike kept nerves on edge. \nHigher-yielding, or riskier, currencies such as the Malaysian ringgit and South Korean won benefited from a more upbeat outlook, which followed a positive lead from Wall Street, while the Australian dollar edged higher. \nThe safe-haven yen, considered a go-to asset in times of turmoil, retreated. \nAnalysts said world markets seemed to be settling after a roller-coaster ride since China last month devalued its yuan currency, sparking concerns about the world's number two economy -- the main driver of global growth -- and its leaders' ability to control the crisis. \nThe broadly upbeat sentiment comes after Beijing sought to reassure investors it was able to maintain high growth, and announced a plan to speed up major construction projects and cut taxes for small and medium-sized enterprises. \nA set of capital controls to prevent a flight of cash were implemented this week, while analysts said a rise in the offshore yuan Thursday suggested the central bank had intervened to prop it up. China is to release data on sales and investment on Sunday. \nAuthorities also unveiled a series of measures to prevent huge swings in China's stock markets, which have seen trillions of dollars wiped off valuations in Shanghai since it hit a peak in mid-June. Among the measures are a \"circuit breaker\" that stops shares being traded after rising or falling by a certain amount. \nShanghai closed up 0.07 percent and ended the week higher for the first time since mid-August. But Hong Kong dropped 0.27 percent and Sydney edged 0.47 percent lower by the end. \n- 'Risk' currencies rise - \nTokyo eased 0.19 percent. Wild swings during the week included a 7.7 percent surge Wednesday followed by a 2.5 percent fall Thursday. But the index ended the week up from last Friday's close. \nJuichi Wako, a senior strategist at Nomura Holdings (Other OTC: NRSCF - news ) , told Bloomberg News: \"We seem to be forming a bottom, but uncertainty has yet to be completely dispelled, including what happens with US monetary policy.\" \nGlobal investors are nervously waiting for next week's Federal Reserve policy meeting, with uncertainty over whether it will lift interest rates for the first time in nine years or hold fire owing to the recent market turmoil. \nA hike in borrowing costs would likely hinder investment possibilities and also fan a flight of capital back to the United States in search of better returns, to the detriment of emerging markets. \nHopes that bank policymakers will opt not to raise rates supported US stocks, with Wall Street's three main indexes all ending strongly higher. \nA less volatile atmosphere saw low-risk assets retreat. The dollar bought 120.75 yen compared with 120.63 yen in New York, while the euro was at 136.15 yen compared with 136.01 yen. The single currency also rose to $1.1282 from $1.1275. \nAnd the Australian dollar, which earlier in the week hit a six-year low below 69 US cents, was at 70.68 cents. \nThe ringgit was up 0.27 percent and the won gained 0.83 percent, helped by the Bank of Korea's decision not to cut borrowing rates. And New Zealand's dollar, which tanked Thursday after its central bank cut interest rates, edged up 0.35 percent. There were also gains for the Indian rupee and Thai baht.", "external_links": [], "published": "2015-09-11T11:31:00.000+03:00", "crawled": "2015-09-11T11:38:58.177+03:00", "highlightTitle": ""}