{"organizations": [], "uuid": "fb74a59c2dc5086cc04de6f65e05420bbde2a3b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/c/h/6/u/image.related.afrArticleLead.620x365.gjdrzv.png/1441343267809.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/equity-markets/tony-abbotts-decision-to-drop-bank-tax-bizarre-20150902-gjdrzv", "country": "AU", "title": "Tony Abbott's decision to drop bank tax 'bizarre'", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Tony Abbott's decision to drop bank tax 'bizarre' | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T09:31:00.000+03:00", "replies_count": 0, "uuid": "fb74a59c2dc5086cc04de6f65e05420bbde2a3b0"}, "author": "Christopher Joye", "url": "http://www.afr.com/markets/equity-markets/tony-abbotts-decision-to-drop-bank-tax-bizarre-20150902-gjdrzv", "ord_in_thread": 0, "title": "Tony Abbott's decision to drop bank tax 'bizarre'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Was Prime Minister Tony Abbott wrong to roll Joe Hockey's correct call on bank tax? Alex Ellinghausen The Liberal Party is meant to reflexively support policies that remove or minimise public subsidies of private companies and here we have Abbott giving a free kick to the world's most profitable banks. The decision is demonstrably bizarre on at least four levels.\nFirst, it was always going to be popular with main street. Holding the big banks to account and justifiably transferring wealth from the oligarchs and their shareholders back to taxpayers' coffers would be welcomed by most.\nSecond, there was no political battle to be had here – Labor was not going to oppose an initiative it had already backed.\nClueless amateurs Third, Abbott's decision undermined his own Treasurer, who privately agrees with the idea of pricing free public insurance and eliminating moral hazards. This only reinforces the impression the Liberals are a divisive, clueless bunch of amateurs that struggle with rational action.\nFinally, the revenue generated by pricing the deposit insurance would have raised tens of billions of dollars over time that could have helped reduce Australia's net debt, which is inflating every day towards dangerous (non-AAA rated) levels as the economy decelerates, care of the commodity price slump and a sharp contraction in Asian demand. Enough said.\nOn that note, August was an extraordinary month as far as shocking stress tests go and right up there with the worst periods financial markets have experienced over the last 30 years – which covers the 1987 and 2001 sharemarket crashes, the 2008 and 2009 global financial crisis and the seemingly never-ending European sovereign-debt dramas.\nAfter the unusually low volatility evidenced throughout the first three quarters of 2014, investors have had to contend with a succession of prospective calamities, the most acute of which have been the Greek tragedy in June and the Chinese equities implosion in August.\nIn price terms, Aussie and US equities ended August down a staggering 8.1 per cent and 6.3 per cent respectively (as proxied by the All Ordinaries Index and the S&P500 Index). To put this in historical context, I examined the one-month returns (rolling daily) for Aussie and US shares since January 1, 1985. In August, the worst rolling 30-day loss for Aussie and US stocks was 9.8 per cent and 11.4 per cent respectively. On my analysis, the August price declines were worse than 97.7 per cent of all 30-day windows in Australia and the US over the past 30 years. That implies it was a \"two standard deviation\" shock since it falls outside of 95 per cent of observations. If we only consider the month-end returns – rather than rolling 30-day periods – the 8.1 per cent haircut to the value of Aussie shares was worse than 98.4 per cent of all months over the last three decades.\nThe Chinese price action was even more disconcerting. Between January 20, 2014 and the market's peak on June 12, 2015, the \"stir-fried\" Shanghai Composite Index soared an amazing 160 per cent. (Stir-frying is the Chinese jargon for what we call \"flipping\".) The early surge in June was kicked along by President Xi Jinping telling media that it was \"good to trade shares\" and boldly predicting the Shanghai Composite Index would \"soon hit 10,000 points\". Unfortunately for Xi, it peaked at 5,166 points (or around half his forecast).\nAnd even with the Chinese Communist Party desperately defending equity values with its own mad-cap quantitative easing program worth several hundred billion dollars, share prices still crashed 43 per cent on a peak-to-trough basis.\nCapricious intrusion For the CCP this has truly been an existential battle for control of its economy against the capricious intrusion of capitalism as represented by (temporarily) free markets. Yes, blame those \"foreign forces\" attacking the \"soft underbelly of the market\". Classic dictatorial scaremongering. As one hedge-fund boss exclaimed, China's stock exchanges are no longer \"markets\" per se. They now more closely resemble a manipulated \"dirty float\", to borrow from the currency market's lexicon.\nFor the traders and buy-side managers who have had to live through every second of this gut-wrenching turbulence, August was a nightmare. As 24/7 markets stream real-time information to screens and mobile devices, there is no escape from their wrath. The digitally illuminated faces of Gen Y investors are understandably paralysed with fear as markets freefall and every asset class on earth is suddenly pricing off the gyrations of the opaque Shanghai Stock Exchange or the vagaries of Greece's \"irrationalistas\".\nOne recurring theme in these columns has been to protect portfolios with \"hedged\" equities solutions and cash (or floating-rate, investment-grade debt). Both strategies performed well during the Greek and Chinese dramas.\nLHC Capital, the long-short Aussie equities hedge manager I previously profiled in this column, was up an impressive 2.4 per cent in August and has returned 21.5 per cent in 2015. Other hedged solutions I've reviewed – like the global macro player MST Capital, Perpetual's Pure Equity Alpha product and VGI Partners – furnished strong results – up 1.2 per cent, down 0.3 per cent and down 0.6 per cent respectively – relative to the 6 per cent and 8 per cent losses suffered in long-only equities.\nIn fixed-income land, our active \"short-duration\" Aussie credit strategy was flat after fees in August, as was the $9.4 billion manager Kapstream, which Janus paid $111 million to buy 51 per cent of in July. (In September 2014, this column argued Kapstream was worth more than $200 million, which was validated by this transaction.)\nWhile unsecured bank deposits gave the impression of shielding one from the volatility, this is only because they are not \"marked-to-market\" or revalued properly. CBA issues secured \"covered bonds\" that are AAA rated and rank ahead of deposits in the capital structure. While these securities are theoretically safer than an investment in a deposit of more than $250,000, the bonds get revalued every day based on perceptions of CBA's creditworthiness. So although the bonds are very safe, their price has fluctuated up and down by as much as 1 per cent over the past few years. Bank deposits would do exactly the same thing if we revalued them regularly. But the ignorance of holding them at face value and assuming away all credit risks is bliss for many.\nThe one lesson I draw from this latest bout of uncertainty is that with such highly leveraged economies, volatility is bound to be a bankable constant. This is very different from the 1990s when leverage was low and growth could safely expand on the back of robust credit creation. In theory that tailwind should not exist today – just don't mention that to home-buyers.\nThe author is a director and shareholder in Smarter Money Investments, which manages fixed-income investment portfolios.", "external_links": [], "published": "2015-09-04T09:31:00.000+03:00", "crawled": "2015-09-04T10:04:15.013+03:00", "highlightTitle": ""}