{"organizations": ["UNEP"], "uuid": "71508843cbb1ee79856a804f56ab25fb2b417d89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509280159.html", "country": "US", "title": "Nigeria: CTL Flags Off 'One Home One Decoder' Campaign", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: CTL Flags Off 'One Home One Decoder' Campaign", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T10:38:00.000+03:00", "replies_count": 0, "uuid": "71508843cbb1ee79856a804f56ab25fb2b417d89"}, "author": "", "url": "http://allafrica.com/stories/201509280159.html", "ord_in_thread": 0, "title": "Nigeria: CTL Flags Off 'One Home One Decoder' Campaign", "locations": ["Nigeria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nurudeen Oyewole"], "text": "Cote d'Ivoire: UNEP Côte d'Ivoire Assessment Highlights Action Required for Path to Sustainable Development By Nurudeen Oyewole \nLagos — Nigerian Cable TV operator, Communications Trends Limited (CTL), has flagged off its 'one home one decoder' campaign which is expected to spread to nine Nigerian cities in the next few days. \nIn a statement made available to Daily Trust on Saturday in Lagos, the operator said its campaign which started on the 31st of August in Port Harcourt is aimed at ensuring that every home in Nigeria enjoys the full benefits of owning a CTL multi-channel decoder. \nThe statement signed by the Chief Operating Officer (COO) of The Udemba Group, owners of CTL, Mr OfemEkapong also noted that CTL TV services are currently running in nine Nigerian cities,namely Port Harcourt, Abuja, Owerri , Enugu, Umuahia, Uyo, Warri, Benin, Onitsha. \nAccording to the statement, \"The ongoing promo is designed to make CTL decoders available to more homes within these areas of coverage and commence the process of delivering its services nationwide. It is a campaign of 'One Home One Decoder' which is the first step in the corporate mission of putting CTL decoders in at least 20 million homes nationwide by 2018.\" Nigeria \nStudents of the University of Lagos, UNILAG, Akoka, on Monday, shut the university's two exit gates, to protest what … see more » Copyright © 2015 Daily Trust. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-28T10:38:00.000+03:00", "crawled": "2015-09-28T11:33:52.074+03:00", "highlightTitle": ""}