{"organizations": [], "uuid": "e4a2cbc10f34d52f254fbe71303d105feaa93ad0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/images/2015/09/articles/main/20150905_fnp503.jpg", "site_section": "http://www.economist.com/rss/finance_and_economics_rss.xml", "section_title": "The Economist: Finance and economics", "url": "http://www.economist.com/news/finance-and-economics/21663264-how-torrent-money-workers-abroad-reshapes-economy-manna", "country": "US", "title": "Like manna from heaven", "performance_score": 0, "site": "economist.com", "participants_count": 1, "title_full": "Like manna from heaven | The Economist", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "e4a2cbc10f34d52f254fbe71303d105feaa93ad0"}, "author": "From the print edition", "url": "http://www.economist.com/news/finance-and-economics/21663264-how-torrent-money-workers-abroad-reshapes-economy-manna", "ord_in_thread": 0, "title": "Like manna from heaven", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From Arabia with love\n“GULF house”, says Dinesh Kumar every few seconds, gesturing out of the window of a car as it drives through Vennicode, in south-west India. His commentary is hardly necessary. The new houses, built with money sent home by people working in Dubai, Oman and other Gulf countries, flash like gold teeth in this backwater village surrounded by coconut palms. Vennicode has a brand new private school, too, as well as huge advertisements for jewellery shops and much more traffic than its narrow roads can handle. It is a tribute to emigration.\nLast year India received $70 billion in remittances—more than any other country in the world. The state of Kerala, where Vennicode is located, got far more than its fair share. A comprehensive household survey organised by Irudaya Rajan of the Centre for Development Studies, a local academic institution, finds that 2.4m Keralites were living and working overseas in 2014. The money they send home is equivalent to fully 36% of the state’s domestic product. “For all practical purposes, it’s a remittance economy,” says C.P. John of the state government.\nIn this section Still in business With great power Emerging troubles Like manna from heaven A tax on the poor Inflated claims Kerala India South Asia\nEconomic migration has become so widespread that global remittances are now worth more than twice as much as foreign aid (see chart). Many countries depend on them: remittances are worth 10% of the Philippines’ GDP and 42% of Tajikistan’s. But Kerala has been hooked on remittances longer than most. It shows how they can reshape an economy.\nThe most obvious effect, evidenced by the fancy houses of Vennicode, is to make a place richer. Kerala was already one of the better-off states in India when mass migration to the Gulf began, in the 1970s. It is now about 50% wealthier per head than the national average. Migrants are disproportionately Muslim and well-educated; their families have done best. The poorest have mostly stayed put. Partly as a result, Kerala is now one of the most unequal states in India—rather embarrassingly, given its socialist political traditions.\nMr Rajan’s survey shows that households are much more likely to own refrigerators and the like if a family member works abroad. Above all, though, remittances are spent on new homes. Saji Thomas of Heera, a construction firm, says that about 70% of his customers are emigrants or returned emigrants. Some move their ageing parents out of the countryside and into new high-rise flats close to good hospitals. Partly as a result, Kerala has become India’s fastest-urbanising large state. In 2001, 74% of Keralites lived in rural areas. By 2011 the proportion had fallen to 52%.\nSomething similar is happening in Nepal, where remittances have risen quickly and now amount to 29% of the economy. The Kathmandu metropolitan area is growing by about 4% a year—faster than almost any other large city in South Asia. Even though agricultural wages are rising, rural Nepal is losing workers.\nWhen money flows from abroad, people not surprisingly stop working back-breaking jobs. This shift is especially beneficial for children. During the Asian financial crisis in 1997-98, the Philippine peso collapsed, increasing the value of remittances to that country. Dean Yang of the University of Michigan has shown that families responded by pulling their children out of jobs and sending them back to school. Girls benefited more than boys. Western Union, a giant money-transfer firm, reckons 30% of the money that flows through its system is spent on education.\nAs the supply of willing workers diminishes, wages rise. Mr Thomas reckons that construction costs in Kerala are 20-25% higher than elsewhere, mostly because labour is so expensive. This imbalance has encouraged a large internal migration. Many of Mr Thomas’s builders are from Bengal and Orissa, in north-east India, though Keralites still do skilled jobs such as installing air conditioning.\nIt is oddly hard to work out how emigration affects a country’s long-term economic prospects. Data are patchy: an apparent global surge in remittances since the 1990s is mostly the result of better reporting. And it is hard to separate cause from effect. When a country’s economy slumps, emigrants might well send more money home, making it seem as though the payments have caused the problem.\nIn Kerala, some suspect that remittances have fostered complacency; at the least, they have opened an embarrassing gap between the state’s wealth and the vigour of its businesses. Mr John looks enviously at nearby Karnataka and Tamil Nadu, with their factories and IT office parks, and asks why Kerala has been unable to provide more jobs for ambitious young people.\nWith its lovely climate and educated populace, Kerala might have created a leading university, but has not. Some believe there might be a future in medical tourism: perhaps Gulf Arabs have become so accustomed to Keralites that they will travel to the state for treatment.\nStill, the biggest danger posed by remittances is that they may dry up. Gulf countries are always talking about pushing migrants out of skilled jobs to make way for natives. And Keralan migrants face rising competition from compatriots from the north and Nepalis, among others. The states of Bihar and Uttar Pradesh now export more people, at least as measured by India’s border authorities, though Kerala still sends a greater share of its population.\nThat might not be the end of it, though. Keralans are a coastal, outward-looking people, seemingly addicted to migration. They were pioneers in the Gulf and ought to be able to find new destinations with even better prospects. Mr John has a child in Britain; the promised land is America.\n ", "external_links": ["http://cdn.static-economist.com/sites/default/files/imagecache/full-width/images/2015/09/articles/main/20150905_fnp503.jpg", "http://cdn.static-economist.com/sites/default/files/imagecache/original-size/images/print-edition/20150905_FNC599.png"], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-04T05:45:47.088+03:00", "highlightTitle": ""}