{"organizations": [], "uuid": "874cd0ddf94d38a46daf9c62140eb263f5f56598", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/06/Income-Tax-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/personal-finance/do-not-panic-if-you-get-notice-from-taxman/131932", "country": "IE", "title": "Do not panic if you get notice from taxman", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Do not panic if you get notice from taxman | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T08:05:00.000+03:00", "replies_count": 0, "uuid": "874cd0ddf94d38a46daf9c62140eb263f5f56598"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/personal-finance/do-not-panic-if-you-get-notice-from-taxman/131932", "ord_in_thread": 0, "title": "Do not panic if you get notice from taxman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nobody ever likes to receive a letter from tax authorities, but if you do get one do not panic. Read the notice carefully to see what the tax authorities are actually looking for. All notices from the tax department do not pertain to tax demand, tax notices are also sent for merely seeking certain clarifications / information.\nNotices can be sent under various sections of the Income Tax Act, depending on the type of clarification required. Some of the cases wherein an individual may be on the radar of the tax authorities are:\nNon-filing of return of income\nNotice under section 142(1) may be issued, asking you to file the return of income (ROI). Where your gross taxable income is below the basic exemption limit, you are not required to file an ROI. However, even if there is no tax liability, you are required to file the ROI if the gross income before various deductions is more than the basic exemption limit. If you have already filed your ROI within the stipulated time, simply produce the documents to support your claim in front of the assessing officer.\nConcealment of income\nQuoting of PAN being mandatory for all major transactions, hiding income may lead to serious repercussions in form of penalty or prosecution. Notice is issued when tax authorities are of the opinion that you have concealed a part of your income while filing your ROI. In such a scenario, you have to submit documents to substantiate your source of income and your investment details. Penalty for concealment of income can be up to a maximum of 300% of tax payable.\nTax credit mismatch\nThere may be circumstances when the credit of TDS claimed in your ROI is different from the one appearing in your Form 26AS (records of the tax department). The department may issue a scrutiny notice asking you to reconcile the difference and department shall consider the TDS appearing Form 26AS. The mismatch could arise where the deductor has not deposited the tax with the authorities or credited to a wrong PAN. One has to file an application with the tax authorities along with the TDS certificate to prove his claim.\nMismatch in income\nWhere there is a mismatch between the income declared and the actual income/investments/ expenditure, you may get a scrutiny notice under section 143(3)/ 143(7). Taxman would seek information / documents / clarifications, in order to re-compute the income liable to tax and interest payable thereon. One should simply file all the details asked for and attend to the clarifications sought.\nNon-disclosure of assets\nMany of us are ignorant of the Wealth tax provisions, that where the value of our assets exceeds R30 lakh, a wealth tax return is required to be filed. It may, however, be noted that Wealth Tax return is not required to be filed from AY 2016-17 onwards.\nDefective return\nWhere the tax department finds errors in your return of income, they shall issue notice under section 139(9) directing you to file a revised ROI. In such a scenario, one has to simply rectify the specified error and file the revised ROI.\nThe writer is managing partner, Nangia & Co. With inputs from Neha Malhotra\nFirst Published on September 08, 2015 12:05 am", "external_links": [], "published": "2015-09-08T08:05:00.000+03:00", "crawled": "2015-09-08T15:15:35.279+03:00", "highlightTitle": ""}