{"organizations": [], "uuid": "4dfb1fdae1a126724a4d0f68f99ca48cdea52544", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DV334_sf_sha_MG_20150929123709.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/san-francisco-shack-starting-at-350000-2015-09-29", "country": "US", "title": "San Francisco shack starting at $350,000?", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "San Francisco shack starting at $350,000? - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 1, "uuid": "57fda92544643b9207886acb628bc726251c653d"}, "author": "Daniel Goldstein", "url": "http://www.marketwatch.com/story/san-francisco-shack-starting-at-350000-2015-09-29#post-0", "ord_in_thread": 0, "title": "San Francisco shack starting at $350,000?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SFARMLS This property could be a contractor’s dream — or their worst nightmare.\nAnd 16 De Long Street in San Francisco’s Outer Mission neighborhood is definitely in the latter category. The 1906 single-story Craftsman home needs some work. OK, a lot of work. But the price is what has people talking. The starting price is $350,000, for just 2 bedrooms, one bath and a mere 765 square feet, about the size of a hotel room suite. A “(D)istinguished home in need of work,” is how Vanguard Properties agent Brian Tran describes it.\n“We keep an eye out for distressed homes but this one went above and beyond,” said Tran in an interview. Tran said the house is currently under contract and spent just 10 days on the market before four all-cash offers rolled in. While Tran wouldn’t disclose the selling price because the transaction hasn’t closed, he said the seller is “very happy” with the price.\nThe currently boarded-up house with security grates over the windows is nestled in between the other two story homes, and you might actually miss it.\nA 30-year mortgage for that home if it sold at the $350,000 price would be about $2,100 a month, not including property taxes and insurance. He estimates the property tax, which is calculated at 1.2% of the selling price will be about $4,000 a year.\nNot surprisingly, given the bad shape of the actual building, Tran says the home’s value isn’t the structure, but the land that it sits on. Tran said he didn’t know what the buyer’s plans are for the property as to whether it will be razed and built up to match the stucco homes in the neighborhood or rehabbed.\nThe San Francisco real estate market is probably the hottest market in the U.S., where the median home value just reached an all-time high of more than $1.1 million, up 14% in the past year, and expected to climb another 5.2% in the year ahead, according to Zillow.com .\nMedian monthly rent prices in San Francisco too are hitting of $ 4,895 a month or more. Midtown Manhattan rents in August topped $3,460, according to StreetEasy, a New York real estate research firm that’s part of the Zillow Group Z, -0.04% .\nEarlier this year, a fixer-upper along San Francisco’s famed Great Highway which overlooks the Pacific Ocean and is a short walk to the city zoo and Golden Gate Park sold for $1.2 million.\nThe tiny home on 16 De Long Street six miles away doesn’t have such great views, as it backs on to the eight-lane 280 Freeway and a Bay Area Rapid Transit or BART rail line that begins running at 5 a.m. and doesn’t stop until nearly 2.a.m.\nBut the flip side is that it’s just a 15 minute walk to the Daly City BART station and a bus to the station that runs every 5 minutes from the nearby Mission Street . It’s also just 15 minutes to San Francisco International Airport by BART and 14 minutes to downtown San Francisco by BART as well.\n“Being close to public transportation in San Francisco is so key right now,” said Tran. “Even somebody like me who needs to be in his car, I find myself using public transportation here because traffic is bad,” he said\nBiking to the BART station is just 8 minutes, according to Google Maps. Getting on to the freeway to the 280 isn’t difficult either, if you want to get out of town or into the city by car, but because of the traffic Tran doesn’t recommend it. Still, three golf clubs (Lake Merced, San Francisco Golf Club and the Olympic Club course) are nearby, too.\nAnd it does have a 7-11 convenience store just a few steps away at the corner of De Long and San Jose Ave. for those late-night milk and beef jerky runs.\nSo maybe $350,000 is a bargain, after all.\nMore from MarketWatch", "external_links": ["http://www.bart.gov/schedules/bylineresults?route=1&date=09/25/2015", "http://www.zillow.com/san-francisco-ca/home-values/"], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T21:08:40.596+03:00", "highlightTitle": ""}