{"organizations": [], "uuid": "092205b6cfed8e08d04bdd77a61bd1988aaf48b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/talkmobile-said-had-capped-charges-183248046.html", "country": "US", "title": "Talkmobile said they had capped my charges at £42.50 - then billed me for £332", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Talkmobile said they had capped my charges at £42.50 - then billed me for £332", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T21:32:00.000+03:00", "replies_count": 0, "uuid": "092205b6cfed8e08d04bdd77a61bd1988aaf48b4"}, "author": "", "url": "https://uk.finance.yahoo.com/news/talkmobile-said-had-capped-charges-183248046.html", "ord_in_thread": 0, "title": "Talkmobile said they had capped my charges at £42.50 - then billed me for £332", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Talkmobile"], "text": "0.0000 \nAsk Jessica: A cap to prevent spiralling data charges seems not to have worked. \nWhile on holiday in the US last year my mobile phone was accidentally switched on to data roaming. The first I knew of the problem was when I received a text from Talkmobile stating that my useage was going up unexpectedly. \nAt the same time, I received two more texts saying I had used £41.72 worth of download and that data roaming was automatically being switched off as there was a cap of £42.50 to protect people from unexpected bills. \nI switched off data roaming as soon as I was alerted by these texts. \nI heard nothing more from Talkmobile until I was back in Britain a month later. Then I received my monthly bill by text stating that it was £332, a large proportion of which was for the data roaming. Trevor Calver, Suffolk \nAlthough the company states that it is not always possible to stop data usage exactly at the cut-off point, it says that it does so as close to this point as it can. Given your bill, you concluded that either the protection did not work or there had been a billing mistake. \nHaving taken the matter up with the Talkmobile, part of Vodafone, to no avail, you went to an ombudsman. A £50 goodwill payment was agreed on. But this money was not forthcoming and you approached me. \nVodafone was by now moving Talkmobile customer services issues in-house. It quickly accepted that the £50 should have been paid promptly. It (Other OTC: ITGL - news ) agreed to review the case and concluded that your data usage should indeed have been capped. \nIt then said that it would credit you with the additional £283 to reflect what you were actually charged for the roaming despite what the texts had told you, as well as the £50. \nA week later it still had not informed you about this outcome but now you do finally have the money. \n• Reader service: Get the weekly newsletter of our best investment ideas (Other OTC: UBGXF - news )", "external_links": [], "published": "2015-09-11T21:32:00.000+03:00", "crawled": "2015-09-11T21:35:42.310+03:00", "highlightTitle": ""}