{"organizations": ["Fed"], "uuid": "cf9f7e68347ad53c40b8479ea1769b39eb3a9eae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/gold-dips-yellen-says-fed-041520217.html", "country": "US", "title": "Gold dips as Yellen says Fed on track to hike rates this year", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Gold dips as Yellen says Fed on track to hike rates this year", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T07:15:00.000+03:00", "replies_count": 0, "uuid": "cf9f7e68347ad53c40b8479ea1769b39eb3a9eae"}, "author": "", "url": "https://uk.finance.yahoo.com/news/gold-dips-yellen-says-fed-041520217.html", "ord_in_thread": 0, "title": "Gold dips as Yellen says Fed on track to hike rates this year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Yellen"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 25, 2015, 05:37 BST - UK Markets open in 2 hrs 23 mins Gold dips as Yellen says Fed on track to hike rates this year Reuters – 22 minutes ago \nCustomers look at gold necklaces at a jewelry store in Xuchang, Henan province, August 12, 2015. REU … \nBy A. Ananthalakshmi \nSINGAPORE (Reuters) - Gold dropped from its highest in a month on Friday as the dollar rallied on an assurance from Federal Reserve chair Janet Yellen that the U.S. central bank would begin raising rates this year. \nSpot gold had fallen 0.7 percent to $1,146.15 an ounce by 0343 GMT, below a one-month high of $1,156.30 reached on Thursday. Bullion, which gained 2 percent in the previous session in its biggest daily jump in eight months, was on track to post its second straight weekly gain. \nBut the metal came under pressure after Yellen said late on Thursday that she and other Fed policymakers do not expect recent global economic and financial market developments to significantly affect the Fed's policy and that it would hike rates this year. \nHigher rates could dent demand for non-interest-paying gold, while boosting the dollar. \n\"Gold is taking cues from the dollar. Yellen's comments that the Fed will raise rates this year is not very positive for gold,\" said Ronald Leung, chief dealer at Lee Cheong Gold Dealers Ltd in Hong Kong. \n\"There is also some profit-taking after the big overnight jump in prices,\" he said. \nThe dollar rose against a basket of major currencies after Yellen's remarks, which come after a delay in a long-anticipated rate hike last week. \nNews of inflows into gold-backed funds and purchases by central banks provided some support for gold. \nSPDR Gold Trust, the world's top gold-backed exchange-traded fund, saw a third straight day of inflows. The fund's holdings rose 3.87 tonnes to 680.27 tonnes on Thursday. \nRussia and Kazakhstan raised their gold holdings for a sixth straight month in August, while Jordan and United Arab Emirates both bolstered their reserves in July, according to International Monetary Fund data. \nAmong other precious metals, platinum slid for a fifth session out of six on fears that demand from the auto sector, where the metal is used in diesel catalysts, could take a hit following the Volkswagen emissions scandal. \nThe metal, which fell to a 6-1/2-year low earlier on Wednesday, was on track for its biggest weekly drop since mid-July. \nPalladium, which is used in gasoline autocatalysts, rose sharply this week on expectations that consumers could move away from diesel cars to gasoline vehicles. \nWith a near 8-percent jump this week, palladium was poised for its biggest weekly rise since March 2013. \n(Reporting by A. Ananthalakshmi; Editing by Joseph Radford)", "external_links": [], "published": "2015-09-25T07:15:00.000+03:00", "crawled": "2015-09-25T07:38:28.533+03:00", "highlightTitle": ""}