{"organizations": [], "uuid": "dfa3e6f04fe400f87193850218d0878e080e23b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/d/m/m/q/image.related.afrArticleLead.620x365.gjdmhm.png/1441176883854.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/opinion/hockey-optimistic-about-downbeat-economy-20150902-gjdmhm", "country": "AU", "title": "Hockey optimistic about downbeat economy", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Hockey optimistic about downbeat economy | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T14:54:00.000+03:00", "replies_count": 0, "uuid": "dfa3e6f04fe400f87193850218d0878e080e23b1"}, "author": "Jennifer Hewett", "url": "http://www.afr.com/opinion/hockey-optimistic-about-downbeat-economy-20150902-gjdmhm", "ord_in_thread": 0, "title": "Hockey optimistic about downbeat economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Growth figures are low but that is no problem, says Treasurer Joe Hockey. Andrew Meares Share on twitter by Jennifer Hewett The market might think the June quarter growth figures were worse than expected. Not Joe Hockey. He is insisting that \"the outcome is entirely consistent\" with budget forecasts and, importantly, that employment growth is stronger and unemployment lower. He provided lots of charts to prove why things are actually going rather well in Australia, particularly compared to other resource-based economies such as Canada and Brazil.\n\"Our economic plan is being implemented and it is working,\" he declared.\nUnfortunately, that sort of determined optimism from the Treasurer is not going to persuade his nervous colleagues or a spooked market. Hockey has gone to Turkey to meet other G20 finance ministers and central bank governors to discuss global economic events. But what he proudly calls the \"historic\" G20 agreement made last year in Australia, to somehow build in an additional 2 per cent global growth, now looks historic for all the wrong reasons.\nThe government can at least target the fundamentally dishonest and union-led criticism from the Labor Party on the China free trade agreement as threatening the growth of services and exports to a huge and changing Chinese market. That gives some useful substance to its warning the economy would be in far worse shape under a Labor government. During his visit to the electorate of Canning, Tony Abbott insisted Bill Shorten was \"playing fast and loose with Australia's future\".\nPrime Minister Tony Abbott and Treasurer Joe Hockey address the media during a joint press conference in the Prime Minister's courtyard at Parliament House in Canberra on Tuesday 1 September 2015. Photo: Alex Ellinghausen Alex Ellinghausen / Fairfax But given the growth in the June quarter was only 0.2 per cent, around half the rate economists had predicted, all things about the present are relative. The pace of growth is certainly substantially down from the 0.9 per cent figure of the March quarter. It is quite true, as the Treasurer noted, that these figures bounce around. But that is the sort of caution about the data typically used by governments when a batch of figures is less impressive than hoped for.\nHockey was far less keen to point out such volatility over a quarter's results when announcing the good figures for the first three months of the year. Since then, the economy seems to have faltered considerably, meaning overall growth for the last financial year is down to 2 per cent.\nSo there is still a record of 24 years of unbroken growth for Australia but there is an increasing sentiment that time is running out to keep that record going well into the future.\nRecord drop in the dollar The Australian dollar immediately dropped below 70¢ compared to the US dollar on the GDP news, making it the lowest in six years. A fall in the currency is supposed to be good for the competitiveness of the Australian economy, of course. But it doesn't seem like that psychologically, especially to households so used to buying cheap consumer goods which are now much more expensive and will never be made here again anyway. And big drops in the currency always come with their own complications, such as an accompanying big increase in the price of imported parts required to produce Australian goods and services.\nReal GDP per capita is falling, down 0.9 per cent in the quarter. Reserve Bank governor Glenn Stevens was correct in telling the National Reform Summit that talking about concepts such as economic reform and statistics on productivity level might excite intellectual elites but do not mean much to ordinary people. People still understand clearly when their living standards are falling rather than rising. That rarely spells good news for an incumbent government unless it can sound persuasive about its plan to improve the situation.\nThat is even more difficult when Australia is so clearly dependent on what is happening elsewhere in the world, especially in China, where there is now far less confidence in the ability of the authorities to manage a slowdown. The latest sharemarket falls are a grim marker of that sentiment as well as the fact that Australian companies can never hope to cut their way to sustainable profit growth. The dividends being shared around have a limited life span without much greater business investment in the business.\nThis problem is certainly not unique to Australia but it is more marked given that economic growth was so strong for so long and business investment had been jet propelled by the now virtually extinct investment in resources construction. The plunge in commodity prices over recent months shows no sign of reversing. It's why the trade figures this week showed exports had cut 0.6 percentage points from economic growth in the June quarter.\nThe Treasurer cites bad weather and port closures as explanations for a seven per cent fall over the quarter, preferring to emphasis that export volumes are still up 30 per cent over the past four years. According to Hockey, the transition away from a reliance on mining investment is well under way, including the huge potential of the services sector and growth in services exports of 7.3 per cent over the the past year.\nBut while the national unemployment rate is not quite as high as initially predicted, it is showing no sign of coming down any further. Community concerns about the jobs of the future may not yet be John Howard's \"barbecue stopper\". It is still an inevitable topic of conversation in every neighbourhood gathering when talking about kids' future employment prospects.\nIt's why an increasingly anxious search for what comes next seems so urgent. It's why voters are looking so hard at government to do more to \"fix things\", no matter how unrealistic that expectation. And it's why business groups are trying to organise DIY reform policy summits. Joe Hockey is likely to find that an Australian treasurer gets a much more polite reception in Turkey than at home.", "external_links": ["https://twitter.com/http://twitter.com/jennifer_hewett"], "published": "2015-09-02T14:54:00.000+03:00", "crawled": "2015-09-02T14:06:45.120+03:00", "highlightTitle": ""}