{"organizations": [], "uuid": "45ede496e46768f6e818097fa0096ba0317afe99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/8/g/0/c/image.related.articleLeadwide.620x349.gjfeq2.png/1441365038812.jpg", "site_section": "http://www.canberratimes.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/the-economy/two-decades-of-unparalleled-economic-growth-but-prosperity-not-evenly-shared-20150904-gjfeq2.html", "country": "AU", "title": "Two decades of unparalleled economic growth but prosperity not evenly shared", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Two decades of unparalleled economic growth but prosperity not evenly shared", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T00:20:00.000+03:00", "replies_count": 0, "uuid": "45ede496e46768f6e818097fa0096ba0317afe99"}, "author": "", "url": "http://www.canberratimes.com.au/business/the-economy/two-decades-of-unparalleled-economic-growth-but-prosperity-not-evenly-shared-20150904-gjfeq2.html", "ord_in_thread": 0, "title": "Two decades of unparalleled economic growth but prosperity not evenly shared", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Income for the top households has increased 7 per cent since 2011-12 compared to an increase of just 3 per cent for those in the lowest fifth. Photo: Tanya Lake\nThe rich are getting richer. Again.\nFresh figures released from the Australian Bureau of Statistics show that, after a brief lull after the global financial crisis, during which the distribution of income narrowed, it has returned to parallel the situation before the financial crisis.\nDespite more than two decades of unparalleled economic growth, our prosperity has not been evenly shared.\nACOSS chief executive Cassandra Goldie According to the data, which is released only once every two years, Australian incomes were 6.3 per cent higher last year than they were in 2011-12, after considering inflation. Disposable income increased 3.5 per cent, which CommSec economist Savanth Sebastian said would help to explain the boost in consumer spending that has been one of the bright spots for growth in the nation's economy.\nHe said the latest national accounts data suggested that, while household finances were \"in the best shape in six or seven years\", many were still conservative about spending.\nAdvertisement \"If you do not see a lift in house prices, or a lift in the share market, you won't get wages growth,\" he said.\nBut there is a more nuanced story in the income numbers. High income households– those in the top 20 per cent of the distribution – did much better than those in lower income brackets.\nIncome for the top households has increased 7 per cent since 2011-12 compared to an increase of just 3 per cent for those in the lowest fifth of the distribution. This is, again, after accounting for inflation.\nIt seems obvious that rich people make more money faster, but it was not ever thus. In the two reports since the GFC, income increased more rapidly for low earners than for high earners.\nThe spread of income or wealth in an economy is measured by the Gini coefficient. A higher rating means a less even distribution in a society. The 2013-14 Gini coefficient for income is 0.333, the second-highest reading since 1994. The highest level was 0.336 in 2007, just before everything came a cropper.\nAustralia's Gini coefficient comes in just above the average for OECD countries, which the Australian Council for Social Services has said is cause for concern.\n\"Despite more than two decades of unparalleled economic growth, our prosperity has not been evenly shared, with income and wealth becoming more concentrated in the hands of fewer people,\" said ACOSS chief executive Cassandra Goldie in a recent report on the subject.\n\"This is dividing our nation and threatening the wellbeing of our communities and the longer-term stability of our economy.\"\nCommSec's Savanth Sebastian said it was likely that inequality would increase in Australia over the coming years, particularly in the context of low interest rates and tighter lending by banks.\n\"Low rates will certainly support borrowing and debt, but if you are tightening up lending standards and making it more difficult for low income Australians to take out a loan, that will have an impact on wealth,\" he said.\nThis meant that those who owned property or were able to obtain a loan would be in a much better position to grow their income than those trying to buy property or who had less robust credit.", "external_links": ["http://datawrapper.dwcdn.net/BS8nl/1/"], "published": "2015-09-05T00:20:00.000+03:00", "crawled": "2015-09-05T07:56:27.846+03:00", "highlightTitle": ""}