{"organizations": [], "uuid": "0447fdfe8234b97e07e49f0f76fae70624d0c16b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/brain0249.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/brain-damage-due-to-psychiatric-drugs/43256.html", "country": "IN", "title": "Brain Damage due to psychiatric drugs", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Brain Damage due to psychiatric drugs", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T11:52:00.000+03:00", "replies_count": 0, "uuid": "0447fdfe8234b97e07e49f0f76fae70624d0c16b"}, "author": "Prof Dr BM Hegde", "url": "http://www.moneylife.in/article/brain-damage-due-to-psychiatric-drugs/43256.html", "ord_in_thread": 0, "title": "Brain Damage due to psychiatric drugs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Brain Damage due to psychiatric drugs 43256 Brain Damage due to psychiatric drugs 0 Comments, Be the first to comment Many drugs used in psychiatric treatment are the main culprit for suicidal tendencies It has now been conclusively proven that the mind is not inside our brain, nor is the mind a product of the brain. I have written, time and again, that reductionist chemical molecules, called psychotic drugs, will certainly damage the brain, while they do little for mental illnesses. Some of them, in fact, increase the incidence of suicidal tendencies! When the tendency for suicide is stimulated, they make the person compulsively suicidal. The recent incident of a German Wings co-pilot committing suicide by craftily sending his captain out of the cockpit to be alone to plunge the aircraft into the French Alps—killing all inside the aircraft—brought to light this sordid ‘boon’ of a class of medicines called anti-depressants. It was proved that he was on those tablets for quite some time. Now, the ethical and vital questions being asked are: Whether his physician should have alerted the airline or not? Should the physician have informed the pilot that he was unfit to fly any aircraft? To cap it, is the news that even the Malaysian Airlines MH 370 pilot was also on anti-depressants. The aviation sector will have to act fast to stop pilots from flying aircraft if they are on anti-psychotic drugs. Quantum physics has now come to understand consciousness, which, until recently, science did not have an idea of. We now know for sure that the mind and the brain are two distinct entities, having very little to do with each other. Wilder Penfield, the celebrated Nobel Laureate Canadian neurosurgeon, who started the idea that the mind resides in the brain eventually came to understand, even as far back as 1958, that the brain is too small a structure to harbour the all-pervading human consciousness or the individual consciousness—the other name for the human mind. There were instances of a few thinking psychiatrists who tried to warn their peers that recent anti-depressants are dangerous as they provoke suicidal tendencies. They were all but banished from their positions by the powerful drug lobby which was literally running many universities. Grace Elizabeth Jackson, who went a step ahead to show that almost all psychiatric drugs damage the brain to result in dementia, got the boot from her professorship, thanks to the industry again! She, however, was bold enough to write a book, Drug-Induced Dementia: A Perfect Crime , which is very popular and keeps her going. But those instances have not made any dent in the sale of such drugs; maybe they increased the sales with a vengeance, thanks to the special promotional efforts of the industry with the connivance of the medical profession. There are new studies that have shown how many of the crazy shooting instances, where young gun-wielding students in the United States who killed their teachers and peers, were also on psychiatric drugs! This is disturbing news, indeed. Yet, this might only be the tip of the iceberg and the large mountain of proof might be still submerged. It is time to have a special cell in criminal investigations to find out if most crimes, if not all crimes, have a drug background? The website , outlines in graphic details all the major shoot-outs in the past 20-odd years. “Nearly every mass shooting incident in the last 20 years, and multiple other instances of suicide and isolated shootings, all share one thing in common, and it’s not the weapons used,” feels Mike Adams, the editor of Naturalnews. Western medicine needs to have a better grip on these deadly reductionist chemical molecules used to treat psychiatric illnesses. ( Professor Dr BM Hegde, a Padma Bhushan awardee in 2010, is an MD, PhD, FRCP (London, Edinburgh, Glasgow & Dublin), FACC and FAMS .) More in Moneylife", "external_links": [], "published": "2015-09-01T11:52:00.000+03:00", "crawled": "2015-09-02T14:25:50.321+03:00", "highlightTitle": ""}