{"organizations": [], "uuid": "20d0962753ee7a6e72c222a2f87e8f59beb13238", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30097253/ten-named-2015-pearson-scholars-receive-250000-in-scholarships", "country": "US", "title": "Ten Named 2015 Pearson Scholars, Receive $250,000 in Scholarships", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Ten Named 2015 Pearson Scholars, Receive $250,000 in Scholarships - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T18:00:00.000+03:00", "replies_count": 0, "uuid": "20d0962753ee7a6e72c222a2f87e8f59beb13238"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30097253/ten-named-2015-pearson-scholars-receive-250000-in-scholarships", "ord_in_thread": 0, "title": "Ten Named 2015 Pearson Scholars, Receive $250,000 in Scholarships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "10 Phi Theta Kappa members selected as 2015 Pearson Scholars from nearly 700 applications nationwide\nJackson, MS (PRWEB) September 23, 2015\nPhi Theta Kappa has announced that 10 members have been selected as 2015 Pearson Scholars from nearly 700 applications nationwide.\nEach Pearson Scholar will be provided with a $1,000 scholarship to complete an associate degree, and then an additional $4,000 to complete a bachelor's degree, for a total of $5,000 in scholarships.\nEach Pearson Scholar will be paired with a Pearson Mentor and will receive complimentary access to Pearson textbooks and digital access codes to support them as they complete their degrees. In addition, Pearson Scholars will be recognized in a special advertisement in The Chronicle of Higher Education in fall 2015.\nIn Spring 2015, Phi Theta Kappa corporate partner Pearson, the world's leading learning company, committed to provide $250,000 over the next five years in scholarships and other support to help Society members complete both associate and baccalaureate degrees. This is the Society's first renewable scholarship that follows the student from the associate degree program to completion of a bachelor's degree.\nChristin Grissom, Phi Theta Kappa's Director of Scholarship Operations, said members applied online through the Society's Spring Scholarship Application by completing the Leaders of Promise Scholarship application along with an additional essay question to be considered for the Pearson Scholarship for Higher Education.\nCandidates were required to be a member of Phi Theta Kappa with a minimum of 3.5 cumulative grade point average, and were selected based on civic engagement, showing commitment to their communities through service, demonstrating persistence and leadership, and exhibiting academic rigor and excellence. Preference was given to first-generation college students.\nThe 2015 Pearson Scholars include:\nIsaac Earl W. Burris, Northeast Texas Community College, Texas\nMichael Dunn, Carroll Community College, Maryland\nHannah Floyd, Bluegrass Community and Technical College, Kentucky\nAngee Gonzalez, Essex County College, New Jersey\nAriel L. Gutierrez, Miami Dade College, Florida\nAshley N. Owens, Piedmont Technical College, South Carolina\nMary M. Smith, Northeast Texas Community College, Texas\nRichard W. Twist, Georgia Highlands College, Georgia\nGabrielle C. Woods, Des Moines Area Community College, Iowa\nCarmel Wright, Sacramento City College, California\n\"We deeply appreciate Pearson's willingness to partner with Phi Theta Kappa by providing scholarships that will help our members complete both associate and baccalaureate degree programs,\" said Phi Theta Kappa Foundation CEO Dr. Nancy Rieves. \"Studies have shown that Phi Theta Kappa members are four times more likely to complete than their community college peers. Financial and mentoring support, like what is being provided by Pearson, will assure their success.\"\nPearson's Senior Vice President, Strategy & Marketing, Annabel Cellini, said, \"Through our strategic partnership with Phi Theta Kappa, we look forward to helping and inspiring more learners to make measurable progress by achieving their degree completion goals, which will ultimately position them for long-term success.\"\nAbout Pearson\nPearson is the world's leading learning company, with 40,000 employees in more than 80 countries working to help people of all ages to make measurable progress in their lives through learning. For more information about Pearson, visit http://www.pearson.com .\nAbout Phi Theta Kappa\nPhi Theta Kappa, headquartered in Jackson, Mississippi, is the is the largest honor society in higher education with 1,285 chapters on college campuses in all 50 of the United States, U.S. territorial possessions and eight sovereign nations. Nearly 3 million students have been inducted since its founding in 1918, with approximately 133,000 students inducted annually.\nContact:\nMelissa Mayer – melissa.mayer(at)ptk(dot)org, 601-984-3684\nLaura Howe – laura.gamble(at)pearson(dot)com, 800-745-8489\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/09/prweb12978720.htm\nInformation contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .", "external_links": ["http://www.prweb.com/releases/2015/09/prweb12978720.htm"], "published": "2015-09-23T18:00:00.000+03:00", "crawled": "2015-09-24T13:25:42.912+03:00", "highlightTitle": ""}