{"organizations": [], "uuid": "69d453fa6cb9b65e9c9db45aa3b36f4ef5352cc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/t/6/a/b/image.related.articleLeadwide.620x349.gjst94.png/1443000805579.jpg", "site_section": "http://www.smh.com.au/business/planners-go-rogue", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/mining-and-resources/bhp-billiton-warns-unilateral-taxes-changes-could-see-it-taxed-twice-20150922-gjst94.html", "country": "AU", "title": "BHP Billiton warns tax changes could result in double whammy", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "BHP Billiton warns tax changes could result in double whammy", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "69d453fa6cb9b65e9c9db45aa3b36f4ef5352cc5"}, "author": "Amanda Saunders", "url": "http://www.smh.com.au/business/mining-and-resources/bhp-billiton-warns-unilateral-taxes-changes-could-see-it-taxed-twice-20150922-gjst94.html", "ord_in_thread": 0, "title": "BHP Billiton warns tax changes could result in double whammy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BHP chief financial officer Peter Beaven says companies must 'pay their way' in tax and disclose payments to governments around the world transparently. Photo: Wayne Taylor\nBHP Billiton's chief financial officer Peter Beaven has warned against the dangers of governments changing tax laws unilaterally as part a global tax transparency push, warning that changes could become \"chaotic\" and result in companies effectively being taxed twice.\n\"Our concern is, we would like everyone to pay their way. That is a basic principal of fairness,\" Mr Beaven said. \"And secondly, we are concerned if this is done in a clumsy, unilateral way you could have a situation where we are having to pay tax twice on the same part of the value chain.\"\nA series of unilateral actions could create \"a very chaotic world ... you could end up in a very competitive and aggressive series of tax regimes, so we want to ensure that doesn't happen\", he said.\nBHP revealed on Wednesday it paid $US5.2 billion ($7.3 billion) in taxes, royalties and other payments to Australia last financial year out of $US7.3 billion globally.\nAdvertisement Like many companies, BHP is preparing for an expected run of tax transparency laws in Australia, the United States and Europe. BHP supports the Organisation for Economic Co-operation and Development's base erosion and profit shifting reforms, which are multilateral.\nMr Bevan said companies must \"pay their way\" in tax and disclose payments to governments around the world transparently.\n\"Trust underpins all tax systems. If people think that it is rortable, or is being rorted, then they are more motivated to try to rort the system themselves.\"\nDefended Singapore hub But Mr Beaven also defended the miner's controversial Singapore marketing and logistics hub, saying the Asian country's tax rate – it paid just $US5.8 million in tax in Singapore last financial year – is not the main reason for BHP having a hub there.\n\"It has a very attractive tax rate. We are not ashamed of that – obviously we would like to minimise the amount of tax that we pay. It is part of the attraction but critically it is not the attraction of Singapore.\n\"We in fact not only put our marketing organisation in there but a series of other global functions, including IT, because it is a good place to run a global business such as ours.\"\nMr Beaven was speaking after the release of BHP's inaugural voluntary \"economic contribution and payments to governments\" report on Wednesday. He said it was \"the latest incarnation of a transparency journey we've been on for 15 years\".\n\"We believe we have fully disclosed and explained the important contribution of Singapore and why we have based our marketing operations there and why we think the amount of profit we make there is absolutely valid,\" he said.\nBHP is pushing for Australia to reduce its tax rate closer to the OECD average of 25 per cent, among other reforms. BHP's adjusted effective tax rate in Australia is 33.5 per cent, and 31.8 per cent globally, or about 45 per cent if royalties are included.\n\"We pay what we regard as a very fair amount of tax,\" he said.\nNot as much detail BHP's inaugural payments to governments report provided a breakdown of payments on a project-by-project basis but did not go into as much detail as Rio Tinto, which has been publishing an annual taxes paid report since 2010.\nRio's latest report showed it paid $US5.7 billion in taxes and royalties to Australian governments in the 2014 calendar year, out of $US7.1 billion globally.\nUnlike Rio, BHP's headline payments to governments figure also combines sustainability spend and other payments, as opposed to just taxes and royalties paid.\nMr Beaven said on Wednesday it was important to have debate on tax reforms \"off a facts base\".\n\"If we don't have a facts base it is very easy to distort points of view and points that are made in those reform debates, and we can end up with the wrong outcome.\n\"Global value chains are an increasing feature in today's global economy. We think tax regimes around the world do need to adjust to new reality, so we do very much support reform and discussion around that.\"\nSingapore made sense in a \"value chain\" sense, he said, \"because that is where the activity is most economically beneficially undertaken\". In the case of Singapore that activity is marketing and logistics, because of its proximity to China and other Asian customers.\nMr Beaven also stressed that \"almost all\" of the profit earned in Australia from production of commodities is taxed is Australia. Its Singapore marketing arm is 58 per cent-owned by BHP's Australian-listed company, and 42 per cent by the British-listed company. Of that 58 per cent owned by the Australian company, less than 1 per cent of total profit generated from commodities in Australia was not taxed locally, he said.\nBHP's new report also said its total economic contribution was $US35.7 billion for the 2014-15 year, including total payments to governments, suppliers, employee expenses, distributions to shareholders and investors, and community contribution.", "external_links": [], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-23T16:48:12.495+03:00", "highlightTitle": ""}