{"organizations": [], "uuid": "355ffde16c01523466a8f7e1885d77e2b6e1392b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/21/global-forex-idUSL5N11R0SK20150921", "country": "US", "title": "FOREX-Dollar firms, ECB and BoJ dovish bias underpins divergence trade", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "FOREX-Dollar firms, ECB and BoJ dovish bias underpins divergence trade | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T11:39:00.000+03:00", "replies_count": 0, "uuid": "355ffde16c01523466a8f7e1885d77e2b6e1392b"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/21/global-forex-idUSL5N11R0SK20150921", "ord_in_thread": 0, "title": "FOREX-Dollar firms, ECB and BoJ dovish bias underpins divergence trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar well above Friday's post-Fed decision low\n* Net long dollar positions at more than one-year low\n* ECB policymakers keep doors open for action (Updates prices, adds comments)\nBy Anirban Nag\nLONDON, Sept 21 (Reuters) - The dollar recovered ground against the yen and euro on Monday as investors weighed if major central banks like the European Central Bank and the Bank of Japan may ease policy after the Federal Reserve delayed a hike in interest rates.\nTraders said demand for dollars before the quarter-end by investors seeking to rebalance their bond and stocks portfolios was also underpinning the greenback.\nAgainst a basket of six major currencies, the dollar last traded at 95.204, well above Friday's low of 94.063, its lowest since Aug. 26. The dollar was 0.1 percent higher at 120.10 yen, recovering from Friday's low of 119.045 yen.\nThe euro was flat at $1.1300, well below Friday's peak of $1.1460, failing to get much impetus from decisive election results in Greece. Not helping the euro, the European Central Bank's chief economist, Peter Praet, reiterated the bank's readiness to modify its trillion-euro bond-buying programme should economic turbulence merit action, according to an interview in a Swiss newspaper.\nPraet's comments came after ECB Executive Board member Benoit Coeure on Friday said monetary policy is on diverging paths in the euro zone and the United States.\n\"It looks like the ECB is preparing for the quantitative easing programme to continue well beyond next September and that is not positive for euro/dollar,\" said Yujiro Goto, currency strategist at Nomura, London. \"There is a clear divergence between ECB thinking and the Fed.\"\nHighlighting that divergence were comments from San Francisco Fed President John Williams, who said on Saturday a U.S. rate hike this year is still likely given the decision to stand pat was a \"close call\".\nStill, there is uncertainty over when the Fed will actually start to raise rates, after the central bank kept them unchanged last week while acknowledging worries about the global economy, financial market volatility and subdued inflation.\nBut given the possibility that the Bank of Japan and the ECB may eventually step up their monetary stimulus, traders will be reluctant to sell the dollar too aggressively, said Satoshi Okagawa, senior global markets analyst for Sumitomo Mitsui Banking Corp in Singapore.\n\"At the same time, it is hard to buy the dollar, since the timing of the Fed's rate hike has been pushed back,\" he said.\nSome traders said the dollar's recovery from Friday's lows was more about position adjustment than a return of a bull run. Speculators cut bullish bets on the U.S. dollar last week to their lowest level since late July last year, data from the Commodity Futures Trading Commission showed. (Additional reporting by Masayuki Kitano ; Editing by Angus MacSwan)", "external_links": [], "published": "2015-09-21T11:39:00.000+03:00", "crawled": "2015-09-21T10:52:58.311+03:00", "highlightTitle": ""}