{"organizations": [], "uuid": "dae94697e4c42a3b93de4afaceeea168cd60ed35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources1.news.com.au/images/2015/09/01/1227507/677685-60b9e162-5006-11e5-bff6-26fc1dcc3623.jpg", "site_section": "http://www.adelaidenow.com.au//business", "section_title": "Business News | Business and Finance News | The Advertiser", "url": "http://www.adelaidenow.com.au/business/work/how-many-americans-would-vote-kanye-west-for-president/story-fnkjjewf-1227507677269", "country": "US", "title": "Kanye West for president: Would Americans vote for him after VMA speech?", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Kanye West for president: Would Americans vote for him after VMA speech? | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T20:55:00.000+03:00", "replies_count": 0, "uuid": "dae94697e4c42a3b93de4afaceeea168cd60ed35"}, "author": "MATT YOUNG in New York", "url": "http://www.adelaidenow.com.au/business/work/how-many-americans-would-vote-kanye-west-for-president/story-fnkjjewf-1227507677269", "ord_in_thread": 0, "title": "Kanye West for president: Would Americans vote for him after VMA speech?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JUST when you thought American politics had reached a preposterous new peak (thanks, Donald Trump) in comes Kanye West. For president, that is.\nSince West’s bizarre, off-the-cuff announcement at the MTV Video Music Awards yesterday, the internet has been abuzz with presidential puns and political analysts trying to analyse his strange speech.\n“I don’t know what I stand to lose after this, it don’t matter though, because it ain’t about me, it’s about new ideas, bro, new ideas. People with ideas, people who believe in truth,” West said as he accepted the Michael Jackson Video Vanguard Award.\n“And yes, as you probably could have guessed by this moment, I have decided in 2020 to run for president.”\nCNN dubbed it “The Kardashianisation of the caucuses”, while Presidential press secretary Josh Earnest joked with reporters: “I look forward to seeing what slogan he chooses to embroider on his campaign hat.”\nBut while the keyboard warriors have their fun, we decided to put the question to the people, and get the answer straight from the mouth of the voting public.\nIf given the chance, would Americans ever really vote Kanye West for President? Would they say ‘Yes’ to Yeezy?\nWould you vote for Kanye West? (Frame content direct link: https://instagram.com/p/7DT81tL5oL/embed .)\nA snap news.com.au poll of 50 Americans revealed 56 per cent would vote No. Yet in a surprising twist, 30 per cent said they would swing their vote West’s way.\n“Obviously they don’t know a huge amount about him, it’s a sign of having some popularity, but probably not much more than that,” John G. Geer, Professor of Political Science at Vanderbilt University told news.com.au.\n“If you went out and asked about Russell Crowe, he’d probably get more [yes votes] than that.\n“It’s just a publicity stunt, if you want to be President you’ve got to start working long, hard hours.\n“It’s not easy, when the bright lights start to shine it's a tough game.”\nMeanwhile, 14 per cent of respondents were undecided, saying they would need to hear more about West’s policies on core issues like immigration.\n“I’d need to hear a little bit more about his platform before I committed my vote to him, but I feel so lucky that we live in a country where everybody’s voice could be heard,” one respondent told news.com.au.\n“Given the state of this current election year, who knows?”\nRespondents were asked, “If Kanye West ran for President, would you vote for him”?\nWould you vote for Kanye West? (Frame content direct link: https://instagram.com/p/7DUSBUr5ov/embed .)\nWould you vote for Kanye West? (Frame content direct link: https://instagram.com/p/7DZeTFr5j5/embed .)\nMost people shared a sense of scepticism over the rapper’s wayward remarks, but one did admit they looked forward to his campaign.\n“He can take the drama and make it exciting”.\nSaid another: “Kim Kardashian as the first lady? Stranger things have happened.”\nMany compared West to billionaire GOP candidate Donald Trump, who despite controversial comments on immigration and women’s rights , has surprised all political pundits by leading the polls since July 26.\n“That would be like voting for Donald Trump, and he has no political experience whatsoever,” said another respondent.\n“He doesn’t know what the hell he’s doing, that would just be dumb.”\nWould you vote for Kanye West? (Frame content direct link: https://instagram.com/p/7DW1M8L5uN/embed .)\nWould you vote for Kanye West? (Frame content direct link: https://instagram.com/p/7DegJvL5vk/embed .)\nThe rapper might need to work on his diplomacy if he’s going to make it to the big house. Back in 2009, he crashed Taylor Swift’s acceptance speech at the VMAs.\n“Yo Taylor, I’m really happy for you, I’ll let you finish, but Beyoncé has one of the best videos of all time. One of the best videos of all time.”\nHis outburst lead President Obama to label him a “jackass.”\nHe’ll also need to court friends in high places, which might be difficult if Hillary Clinton wins her bid for the 2016 race. If successful, she’ll be running again in 2020 as the incumbent president, and finding Democrat support in that situation would be tough.\nLucky for Kanye he’s got a few years to get his presidential campaign in order. Might want to start working on those slogans then. Yes we Kanye has a nice ring to it ... but might be a little dated by then.\nWould you vote for Kanye West? (Frame content direct link: https://instagram.com/p/7DW_kQL5up/embed .)\n- youngma@news.com.au\nObama and Media: The Mystery 47:39 Play video\nEmpire goes to Washington DC to demystify the relationship between political power and the media in the US.\nOovvuu 15 Jul 2015 TV/Politics TV/Media TV/Current Affairs TV/Society and Culture Would Americans actually vote for Kanye?", "external_links": ["https://instagram.com/p/7DegJvL5vk/embed", "http://www.news.com.au/finance/work/how-many-americans-would-vote-kanye-west-for-president/story-fn5tas5k-1227507677269", "https://instagram.com/p/7DT81tL5oL/embed", "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/l4cmI3djroYRYaU516VPa65q5h2r52zT/promo261155193&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "https://instagram.com/p/7DW_kQL5up/embed", "https://instagram.com/p/7DUSBUr5ov/embed", "http://www.news.com.au/entertainment/awards/kanye-west-craps-on-for-10-minutes-at-mtv-vma-before-declaring-his-presidential-run/story-fn8zj00c-1227506116467", "http://www.news.com.au/finance/work/there-was-blood-coming-out-of-her-wherever-trump-suggests-journalist-was-menstruating/story-fn5tas5k-1227475623946", "http://www.news.com.au/world/north-america/donald-trump-im-not-going-to-mexico-and-i-dont-think-anybody-should/story-fnh81jut-1227447490319", "https://instagram.com/p/7DW1M8L5uN/embed", "https://instagram.com/p/7DZeTFr5j5/embed"], "published": "2015-09-01T20:55:00.000+03:00", "crawled": "2015-09-01T09:48:48.490+03:00", "highlightTitle": ""}