{"organizations": [], "uuid": "06ef2f1cea2494a0ec38654daf7ccf58793625c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/republicans-oppose-safety-rules-offshore-211336219.html", "country": "US", "title": "Republicans oppose new safety rules on offshore drilling", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Republicans oppose new safety rules on offshore drilling", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T01:04:00.000+03:00", "replies_count": 0, "uuid": "06ef2f1cea2494a0ec38654daf7ccf58793625c9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/republicans-oppose-safety-rules-offshore-211336219.html", "ord_in_thread": 0, "title": "Republicans oppose new safety rules on offshore drilling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 15, 2015, 23:43 BST - UK Markets closed Republicans oppose new safety rules on offshore drilling Republicans: New safety rules will hurt offshore oil drilling, cause industry slowdown By Cain Burdeau, Associated Press | Associated Press – 38 minutes ago Print \nNEW ORLEANS (AP) -- Republican lawmakers on Tuesday criticized an Obama administration move to toughen standards for offshore drilling, saying the new rules would be costly for drillers and threaten to shut down oil and gas exploration off the nation's coasts. \nThe Interior Department is preparing to issue standards to close what it says are gaps in blowout preventer rules. A blowout preventer is a piece of equipment designed to shut an out-of-control well. Such a device failed catastrophically when a BP well blew out in 2010, causing a massive oil spill. \nBut the Republicans blasted the new rules at a field hearing of the U.S. House Committee on Natural Resources in New Orleans. No Democratic members showed up. \nThe Republicans complained the rules are too government-driven and costly to industry. The Republicans also questioned whether the new rules would make drilling safer. They also argued that drillers have proven they're safe under current regulations. \nBesides aiming to strengthen blowout preventers, the rules require more record keeping by drillers, force companies to do real-time monitoring of drilling operations and take steps to dig safer wells. The rules are expected to be phased in over years. \nThe new drilling rules — which critics say have been slow to be handed down — grew out of calls for increased safety in offshore drilling following the massive BP spill in 2010. The blowout destroyed the Deepwater Horizon drilling rig, killed 11 workers and sent millions of gallons of crude oil spilling into the Gulf. \nThe committee's chairman, U.S. Rep. Rob Bishop, R-Utah, said the proposed rules add \"complexity without putting proven methods in place that reduce risk.\" \nUnless the rules are changed to meet industry demands, he said they could effectively close down oil and gas exploration and production in the Gulf. \nBishop cited an analysis commissioned by the American Petroleum Institute, an industry group, that found implementing the rules would cost the industry $32 billion over 10 years. By contrast, the Obama administration has calculated the rules will cost the industry about $1 billion to implement. \nIn a statement, Raul Grijalva, the ranking Democrat on the committee, called the hearing \"part of a public relations campaign that isn't dealing with the substance of the issue.\" \n\"The Republicans seem to have forgotten about the Deepwater Horizon disaster and the other oil spills we continue to see offshore,\" Grijalva of Arizona said. \"The industry can't regulate itself any longer. That time is past.\" \nLars Herbst, regional director of the Bureau of Safety and Environmental Enforcement, testified that the new rules are needed to prevent future spills. He pointed out an increasing number of incidents where operators have lost control of wells in the Gulf in the past two years, and said the rate of such incidents now is similar to what was seen before BP's catastrophic spill in 2010. \nHerbst also cited a 2013 Gulf blowout in which a rig with 44 workers on it caught fire. The fire lasted for more than 72 hours. All the workers were evacuated. \n\"Blowouts like these can easily lead to much larger incidents,\" Herbst testified. \nHe said regulators were meeting this week with the industry to discuss the regulations in detail before they become final.", "external_links": [], "published": "2015-09-16T01:04:00.000+03:00", "crawled": "2015-09-16T01:42:56.048+03:00", "highlightTitle": ""}