{"organizations": ["Associated Press"], "uuid": "e56b15c42e533bfe77d252016c33eb4a78bf2957", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/category-commodities/?format=rss", "section_title": "Commodities Market News - Yahoo!7 Australia Finance", "url": "https://au.finance.yahoo.com/news/report-says-ending-ban-wouldnt-200149599.html", "country": "US", "title": "Report says ending ban wouldn't hurt consumers at pump", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Report says ending ban wouldn't hurt consumers at pump", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T00:28:00.000+03:00", "replies_count": 0, "uuid": "e56b15c42e533bfe77d252016c33eb4a78bf2957"}, "author": "", "url": "https://au.finance.yahoo.com/news/report-says-ending-ban-wouldnt-200149599.html", "ord_in_thread": 0, "title": "Report says ending ban wouldn't hurt consumers at pump", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin Freking"], "text": "Wed, Sep 2, 2015, 7:59 AM AEST - Australia Markets open in 2 hrs 1 mins Report says ending ban wouldn't hurt consumers at pump Report: Ending export ban would leave gas prices unchanged or slightly reduced By Kevin Freking, Associated Press | Associated Press – 30 minutes ago Recommend Print \nWASHINGTON (AP) -- Ending the four-decades old restrictions on crude oil exports wouldn't hurt consumers at the gasoline pump, and may even help them, a new government report said Tuesday. \nThe finding is providing ammunition to lawmakers seeking to pass legislation this year to end the restrictions. A Senate panel passed such a measure before Congress adjourned for its August recess. House Republicans are expected to take up the issue this fall. \nThe crude oil export ban includes some exceptions and was put into place as the nation responded to an oil embargo by members of the Organization of Arab Petroleum Exporting Countries, which sparked long lines at gas stations and high inflation in the 1970s. The United States, however, has undergone a production boom in recent years, and the oil and gas industry has maintained that access to more customers abroad could drive new investment and still greater production. \nThe report from the U.S. Energy Information Administration examined an array of scenarios and includes numerous caveats, but contained this bottom line: \"Petroleum product prices in the United States, including gasoline prices, would be either unchanged or slightly reduced by the removal of current restrictions on crude oil exports.\" \nSen. Lisa Murkowski, the Republican chairman of the Senate Energy and Natural Resources Committee, said the report pointed to a need for Congress and the Obama administration to act. \n\"The year of study is over. It is time to send a signal to the world by lifting the ban on oil exports from the United States,\" Murkowski said. \nOpponents say lifting the ban will make it harder for some of the nation's refineries to compete internationally and could result in closures and job losses. They also say that removing the ban could lead to more oil being transported via rail and pipeline, potentially increasing the prospects for accidents or spills. @y7finance on Twitter, become a fan on Facebook", "external_links": [], "published": "2015-09-02T00:28:00.000+03:00", "crawled": "2015-09-02T00:59:51.483+03:00", "highlightTitle": ""}