{"organizations": [], "uuid": "70651da6fdc24c084bf07ed1e3384062879e1ea0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/modi-silicon-T.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/modis-silicon-valley-visit-pm-narendra-modis-top-quotes-highlights/142607", "country": "IE", "title": "PM Narendra Modi’s top quotes from Silicon Valley visit", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "PM Narendra Modi’s top quotes from Silicon Valley visit | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T22:05:00.000+03:00", "replies_count": 0, "uuid": "70651da6fdc24c084bf07ed1e3384062879e1ea0"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/modis-silicon-valley-visit-pm-narendra-modis-top-quotes-highlights/142607", "ord_in_thread": 0, "title": "PM Narendra Modi’s top quotes from Silicon Valley visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Bilateral talks: Narendra Modi, Barack Obama to push strategic cooperation India signs $3 bn deal to buy 15 Chinook, 22 Apache helicopters from US PM Narendra Modi, Prez Barack Obama hold talks Prime Minister Narendra Modi is one of the first Indian leaders to interact with the top CEOs and business leaders of Silicon Valley, during his US visit. PM Modi met Microsoft ’s CEO Satya Nadella, Google ’s CEO Sundar Pichai and Alphabet’s CEO and Google co-founder Larry Page, Facebook CEO Mark Zuckerberg, Apple CEO Tim Cook, Qualcomm’s Executive Chairman Paul E. Jacobs, CISCO’s John Chambers and Tesla Motors CEO Elon Musk on this trip.\nDuring the trip Modi pitched for a connected India in a new world. PM also urged some of the smartest brains in the Silicon Valley to take interest in his pet projects – Digital India , smart cities and Make India. Here are the top Quote: s from his speech.\n1. “Across the world a new image of India has emerged. The old thoughts about India are going away.”\n2. “Your fingers created magic on the keyboard and the computer and this gave India a new identity. Your skill and commitment is wonderful.”\n3. “We would hear- we need to stop this brain drain. But India is Bahuratna Vasundhara, there will be many brains there. Brain drain can become brain gain, who had ever thought of that.\n4. “Today, after 16 months, I want a certificate from you saying if I’ve fulfilled my duties or not. Do I have any allegations of corruption against me?… Bete ne 250 crore banaaya, beti ne 500 crore banaaya, damaad ne hazaar crore banaya, ye sun kar ke kaan pak gye ki nhi?”\n5. “It is being believed that the 21st century is India’s century. There was a time when India was desperate to catch up with the world. Today, the world wants to be associated with India. Be it World Bank, Moody’s or any other research agency, everyone is saying India is the fastest growing economy in the world.”\n6. “I have faith in the nation because India is youthful. 65% of our population is under the age of 35. What can’t a country achieve which has the power of 800 million youth?”\n7. “JAM- J=Jan Dhan financial inclusion program, A=Aadhar unique identity card M=Mobile Governance, said “e-Governance is easy, effective and economical governance.”\n8. “Terror and global warming are two pressing issues the world faces. We need to mitigate these two menaces.”\n9. “If it has taken the UN 15 years to define terrorism, how long will it take to fight terrorism? Terrorism is terrorism, terrorists are terrorists. UN should make clear who are pro-terrorism and who are anti-terrorism.”\n10. “Now I am announcing a direct Air India flight between New Delhi and San Francisco three times a week.”\n11. “We recognize that a Digital India could not be built without bridging the digital divide. Like airports, we will also have WiFi at 500 railway stations, we are working with google on that.”\n12. “From large corporates to young professionals in this centre of innovation, each can be part of DigitalIndia story. We will connect all schools and colleges with broadband, expanding our public WiFi hotspots.”\n13. “Identified applications that would make governance faster by using the internet. Access also means content in local languages.”\n14. “SocialMedia connects people on the the strength of human values and not identities. We must ensure that technology is accessible, affordable, and adds value.”\n15. “After MyGov.in, we have just launched the Narendra Modi Mobile App . They are helping me stay in close touch with people.”\n16. “I will now speak of mGovernance. That is the way to go in a country with one bn cell phones, growing at high double digit rates.”\n17. “Digital India is an enterprise for India’s transformation on a scale that is, perhaps, unmatched in human history. Farmers in Maharashtra have made a Whatsapp group to share farming tips and techniques.”\n18. “See tech as a means to empower and as a tool that bridges the distance between hope and opportunity. In this digital age, we have an opportunity to transform lives of people in ways that were hard to imagine a couple of decades ago.”\n19. “The pace at which people are taking to digital technology defies our stereotypes of age, education, language and income.”\n20. “I have met many of you in Delhi & New York, on Facebook, Twitter, Instagram & LinkedIn. Facebook, Twitter, Instagram are the new neighbourhoods of our new world.”\n21. “Since my govt came to office we attacked poverty by using power of networks & mobiles to launch a new era of empowerment.”\n22. “The most fundamental debate for our youth is the choice between Android, iOS or Windows.”\n23. “California is one of the last places in the world to see the sun set. But, it is here that new ideas see the first light of the day.”\n24. “Here on stage you see a perfect picture of India-US partnership in the digital economy.”\n 28, 2015 2:05 pm © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-09-28T22:05:00.000+03:00", "crawled": "2015-09-28T20:55:11.691+03:00", "highlightTitle": ""}