{"organizations": ["Social Networking Giant Fool Podcasts What The Washington Post", "Controversial Facebook Inc", "Washington Post", "Facebook", "Social Networking Giant The Post"], "uuid": "ea8723469fe3c918c1a3d753513b83ab7382e511", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://g.foolcdn.com/editorial/images/180254/fb-f-logo__blue_144.png", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=FB", "section_title": "Yahoo! Finance: FB News", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13atih9pn/*http://www.fool.com/investing/general/2015/09/29/what-the-washington-posts-controversial-facebook-i.aspx?source=eogyholnk0000001", "country": "US", "title": "What The Washington Post's Controversial Facebook Inc. Move Means for the Social Networking Giant", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "What The Washington Post's Controversial Facebook Inc. Move Means for the Social Networking Giant", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:26:00.000+03:00", "replies_count": 0, "uuid": "ea8723469fe3c918c1a3d753513b83ab7382e511"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13atih9pn/*http://www.fool.com/investing/general/2015/09/29/what-the-washington-posts-controversial-facebook-i.aspx?source=eogyholnk0000001", "ord_in_thread": 0, "title": "What The Washington Post's Controversial Facebook Inc. Move Means for the Social Networking Giant", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrew Tonner"], "text": "Fool Podcasts What The Washington Post's Controversial Facebook Inc. Move Means for the Social Networking Giant The Post's all-in bet on Facebook's new Instant Articles product is the kind of big, bold bet this journalistic powerhouse needs to remain relevant. But who benefits most? Andrew Tonner Sep 29, 2015 at 8:26PM Source: Facebook \nThe media world remains in the throes of a tectonic shift, and perhaps no company better exemplifies this sea change than social media giant Facebook ( NASDAQ:FB ) . \nAs part of its thrust to remain relevant in this new media paradigm, vaunted member of the media old guard The Washington Post recently announced it will publish all its articles into Facebook's new Instant Articles news product. The Washington Post says this will give readers a \"lightning-fast user experience for reading, sharing and commenting within the Facebook iOS app.\" So what does this mean for Facebook, The Washington Post , and the media world in general? Let's take a look. \nAn instant (articles) success? The Washington Post was purchased from its longtime owners the Graham family for $250 million in late 2013 by Nash Holdings, the private investment company controlled by Amazon.com founder and billionaire Jeff Bezos. Bezos, for his part, has publicly signaled significant support for The Post , promising to provide long-term financial support for one of America's most acclaimed journalistic institutions as it seeks to develop a new long-term sustainable profit model. Like much of the newspaper business, The Post has been buffeted by the rise of social media and online journalism, which shattered their decades-old and highly lucrative print advertising models. \nThe Post has taken a number of bold steps, like its recent syndication move through Facebook, in hopes of finding new paths to monetize increasingly mobile readers. Earlier this month, Amazon announced that members of its Prime subscription shipping service would receive a free six-month subscription to the WaPo. Bezos hopes this kind of experimentation and risk taking will lead to a new \"golden age\" at The Post . And while it's certainly a bold move with Facebook's Instant Articles, the WaPo's move also demonstrates a refreshing willingness to innovate and take big risks long lacking throughout much of the rest of the newspaper industry. \nThe terms of the deal weren't immediately clear. However, reports indicate that The Washington Post will receive a portion of the ad revenue generated from its stories on Facebook. And given Facebook's 1.5 billion monthly active users, the opportunity to meaningfully expand its readership, and ad revenue by extension, certainly seems significant with Facebook's Instant Articles. It's also worth noting that the WaPo's move to make all its articles available is by far the most aggressive push into Instant Articles among the nation's journalistic elite. The Washington Post says it's working with Facebook to \"ensure all of our rich content like videos and galleries are formatted to feel native to the Facebook platform.\" This is a big, bold bet. And while the end benefit certainly isn't a given for The Post , scaling out Instant Articles will likely prove a meaningful win for Facebook and its shareholders. \nA brilliant move for Facebook As it continues to mature as a company, one of Facebook's emerging core strategies has been to increase the time users spend on its platform. The company, along with rival Google , recently rolled out an improved version of its e-commerce storefronts for merchants with very much the same intention. \nAs straightforward as it may seem, Facebook, by broadening the number of tasks a user can engage in on its platform, hopes to increase the amount of advertisements and monetization points it can eek from its users. Of course, it enjoys numerous ancillary growth drivers as well (Instagram, WhatsApp, etc.), but in terms of this specific strategic initiative for Facebook, it's truly all about finding ways to increase users' time on the site. And for a company that has risen around 140% since its IPO and trades at 95 times its LTM earnings, scaling Instant Articles with key partnerships like its deal with WaPo is just another example of the type of actions Facebook will have to take in coming years in order to justify its lofty valuation. \nThe next billion-dollar iSecret The world's biggest tech company forgot to show you something at its recent event, but a few Wall Street analysts and the Fool didn't miss a beat: There's a small company that's powering their brand-new gadgets and the coming revolution in technology. And we think its stock price has nearly unlimited room to run for early in-the-know investors! To be one of them, just click here . \nAndrew Tonner has no position in any stocks mentioned. The Motley Fool owns and recommends Amazon.com, Facebook, Google (A shares), and Google (C shares). Try any of our Foolish newsletter services free for 30 days . We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . Andrew Tonner Fool Contributor Andrew Tonner is a tech specialist for The Motley Fool. He is a graduate of The University of Arizona with a degree in Finance. Follow @andrewtonner Article Info Sep 29, 2015 at 8:26PM Technology and Telecom", "external_links": [], "published": "2015-09-30T03:26:00.000+03:00", "crawled": "2015-09-30T05:04:29.945+03:00", "highlightTitle": ""}