{"organizations": [], "uuid": "5871f6752882a5be019083ab951fa4c3deaabd53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/G68IYRegnPnKp1X5dF4Bhg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_AP_FINANCIALTIMES/4fecf2ae57a5942a820f6a7067004435_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/greeces-tsipras-gets-second-chance-064905871.html?l=1", "country": "GB", "title": "Greece's Tsipras gets a second chance from voters", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Greece's Tsipras gets a second chance from voters - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 10, "uuid": "f3f7557572ce26c4ba8fc2f7151010a6574e0fb3"}, "author": "Derek Gatopoulos and Elena Becatoros, Associated Press", "url": "http://finance.yahoo.com/news/greeces-tsipras-gets-second-chance-064905871.html?l=1#post-0", "ord_in_thread": 0, "title": "Greece's Tsipras gets a second chance from voters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nLeft-wing Syriza party leader Alexis Tsipras, left, waves to his supporters as leader of the right-wing Independent Greeks party Panos Kammenos makes the victory sign after his general election victory, at Syriza's party’s main electoral center in Athens, Sunday, Sept. 20, 2015. Tsipras said he would renew his partnership with Kammenos in coalition government. (AP Photo/Lefteris Pitarakis) \n\n\nATHENS, Greece (AP) -- Alexis Tsipras' left-wing Syriza party battered opponents in a snap general election as Greeks gave the 41-year-old leader a second chance to deal with the country's staggering debt and carry out major reforms aimed at modernizing its government and economy.\nDefying opinion polls, Tsipras comfortably beat the conservative New Democracy party to retain a coalition partnership with the small right-wing Independent Greeks, and was due to formally be handed the mandate to form a government later Monday.\n\"Under difficult conditions, the Greek people have given us a clear order to get rid of everything that kept us stuck in the past,\" Tsipras told supporters in central Athens.\n\"It's a great victory, a clear victory, and a victory of the people.\"\nTsipras' Syriza had 35.5 percent, with more than 99.5 percent of votes counted early Monday, while the center-right New Democracy trailed with 28.1 percent.\nIn a sign of widespread discontent, however, more than four in 10 Greeks stayed away from Sunday's poll, and 7 percent of votes went to the third-place Golden Dawn. The Nazi-inspired party, whose leadership is on trial for allegedly running a violent criminal group, dropped marginally in its number of ballots, but had a slightly higher percentage of the overall vote due to the low turnout.\nThe vote was held as Greece struggles to cope with Europe's refugee crisis, and Golden Dawn performed strongly on the eastern island of Kos — which has seen massive refugee arrivals from Turkey — almost doubling its percentage there to 10 percent..\nThe country also faces further harsh austerity reforms as part of a massive, third international bailout that Tsipras was forced to adopt to keep the country in Europe's joint currency.\nJust seven months into his term, Tsipras lost his majority in parliament after far-left rebels in his party opposed tough new conditions demanded by Eurozone countries for the 86 billion euro rescue package: Hikes in sales and business taxes, changes to public administration and labor laws opposed by unions, and further pension cuts to address the country's dramatically aging population.\nThe rebels, who formed a breakaway party, failed to get elected to parliament.\n\"The choice appears to have been made that when push comes to shove, Syriza will opt to keep Greece in the euro. But we note this result provides a platform upon which Syriza will continue to challenge significant parts of the (bailout) program,\" said Malcolm Barr, an economist at JPMorgan.\nAfter years of recession and tough reforms, a quarter of the country is still out of work and its national debt is worth a stunning 175 percent of annual output. The continued hardship meant Greeks showed little enthusiasm during the brief election campaign.\nTsipras supporters early Monday appeared forgiving.\n\"He is young. We had been voting for the others for 40 years,\" said Athens resident Eva Vasilopoulou, who attended the victory rally. \"We are giving (him) a second chance. He is pure, and smart, and I hope he will govern for many years.\"\nSyriza abandoned its anti-bailout platform and billed its re-election as a blow to crony politics from more established parties, refusing to consider joining the conservatives in a grand coalition.\nThe new government will have a small majority of just five seats — and little time to waste.\nCreditors are expected to review progress of reforms as part of the bailout next month, while the government will also have to draft the 2016 state budget. It must also oversee a critical bank recapitalization program, without which depositors with over 100,000 euros ($113,000) in their accounts will be forced to contribute.\nA total of eight parties won parliamentary seats, including the once-dominant Socialist Pasok, centrist Potami, the Greek Communist Party and the Centrist Union — a fringe party led by Vassilis Leventis, a political pundit famous for his on screen outbursts of anger during appearances on his long-running late-night TV show.\n\"I've fought for 25 years to get into parliament,\" he said. \"I stayed on my feet knowing that the political system would eventually fall apart. I had a hunch that, one day, I'd be vindicated.\"\n___\nDemetris Nellas, Costas Kantouris and Idyli Tsakiri contributed to this report.\n___\nFollow Gatopoulos at http://www.twitter.com/dgatopoulos and Becatoros at http://www.twitter.com/ElenaBec\nAlexis Tsipras", "external_links": [], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T17:49:27.966+03:00", "highlightTitle": ""}