{"organizations": [], "uuid": "cbb16823f32b44a4a9aa791ec43c15d05db28a94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-pensions-retirement/?format=rss", "section_title": "Pensions & Retirement News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/chart-shows-why-20-somethings-080343676.html", "country": "GB", "title": "The chart that shows why 20-somethings will have the shortest healthy retirement", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "The chart that shows why 20-somethings will have the shortest healthy retirement", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T21:25:00.000+03:00", "replies_count": 0, "uuid": "cbb16823f32b44a4a9aa791ec43c15d05db28a94"}, "author": "", "url": "https://uk.finance.yahoo.com/news/chart-shows-why-20-somethings-080343676.html", "ord_in_thread": 0, "title": "The chart that shows why 20-somethings will have the shortest healthy retirement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UBGXF 0.00 \nNew (KOSDAQ: 160550.KQ - news ) analysis suggests millions of younger workers will be denied the same healthy, active retirement as their parents \nThe early part of retirement is traditionally looked upon as a “golden age”. Savers hope to enjoy the luxury of holidays abroad, pursuing hobbies and entertaining friends and family while still relatively fit and in receipt of a decent pension. \nMany retirees would say this picture is rosier than real life. But for future generations, the gap between this idyllic picture of retirement and reality is likely to be far wider still. \nTelegraph Money analysis of official data shows that while major, medical advances are extending the total length of the average lifetime, the length of a healthy retirement is not rising as fast. \nThe difference between total longevity and healthy lifespan is important because of changes to the way the Government intends to calculate   \nPeople’s   linked to their overall life expectancy, and is calculated on the assumption that they will spend a third of their adult life in retirement. \nBut this calculation completely ignores how many years they are expected to lead healthy, disability-free lives. Linking pension age to longevity would mean, on average, that a growing proportion of people currently in their 20s, 30s and 40s will be in poor health by the time they collected their state pension. \nData complied by The Lancet, the medical journal, shows the increase in people’s healthy life expectancy at birth between the period 1990 and 2013 lagged the increase in overall life expectancy by more than a year (see chart). \nFor example, a woman born in 2013 is expected to live 6.2 years longer than a woman born in 1990. But she can only expect to have 4.7 extra years in good health. \nMichael Johnson, a researcher at the Centre for Policy Studies, a think tank, warned younger savers not to rely on the state pension and advised them to take personal responsibility for their own savings instead. He added: “The retreating welfare state means that in the future people may need to buy private insurance to tide themselves over if they become too sick to work before they reach state pension age.” \n• Share (LSE: SHRE.L - news ) tips: the 10 best inheritance tax-proof Aim stocks \n= Where you live also plays a role = \nHow long people are expected to live and how much of that life will be healthy is closely linked to their levels of income, occupation and where they live. \nAccording to a report in 2014 by the International Longevity Centre, males at birth in the highest social class can expect 6.7 additional years of life compared with males in the lowest social class. \nDifferences for “healthy life expectancy” jump to 12.5 years and for “disability-free life expectancy” 13.4 years. As wealth and poverty exist in pockets around the country, regional differences between some parts of the country are striking. \nIn London alone, people in the poorest borough, Tower Hamlets, had a healthy life expectancy of 56 in 2011. This is a full 15 years lower than their equivalents in affluent Richmond (Taiwan OTC: 2743.TWO - news ) upon Thames, who are expected to live a healthy life until 71. \nBen Franklin, a senior research fellow at the International Longevity Centre, the think tank that conducted the analysis for Telegraph Money, said: “These inequalities present a problem for society. \n“There are segments of society which will never reach state pension age in good health. The Government will end up supporting many people through benefits, but because these don’t have the same generous inflation protections as the state pension, they may be far less valuable. This creates an inherent unfairness.” \n= Women are losing more ‘healthy’ retirement years than men = \nChanges to state pension age and female life expectancy have already hit women hard. This is largely because women’s state pension age, originally 60, is being increased gradually until 2018, when it will be brought in line with men’s retirement age of 65. \nBetween 2018 and 2020 both genders will see pension age rise to 66. \nA comparison of women’s retirement prospects across the generations shows how younger women can expect a dwindling number of “quality” years of retirement. \nIn 2004 the average woman of state pension age (then 60) was expected to live another 5.6 years in a good state of health. \nA 36-year-old woman today can expect half as many retired years in good health.   expected to have a longer healthy life at 70.5 years. But when she reaches state pension age in 2047, at the age of 68, she is only expected to live another 2.5 years free from ailments. \nA woman aged 26 today is expected to become sick before her state pension age. If she reaches state pension age at 70, as the Government has suggested, she is expected to develop a limiting illness aged 69 and three months, seven months before she can get a government-funded retirement income. A 26-year-old man is expected to become ill aged 67 years and eight months. \nWhen it comes to “quality years” in early retirement men have been disadvantaged relative to women, because their state pension age has been five years higher. \nBut the difference between today’s male retirees and their sons and grandsons is that millions of today’s older workers have enjoyed generous work-related pension arrangements, allowing them to retire earlier. \nMr Franklin said: “A growing number of savers are hanging on until state pension age before retiring because they are finding themselves unable to replace their salary with pension income. This is particularly tough for the squeezed middle who may have only contributed into a defined contribution pension, and therefore cannot afford to retire early.” \nAre you worried about your pension or financial planning in later life? Email: katie.morley@telegraph.co.uk \n- Telegraph Investor newsletter: Get   our best investment ideas and strategies (Other OTC: UBGXF - news )", "external_links": [], "published": "2015-09-11T21:25:00.000+03:00", "crawled": "2015-09-12T22:30:02.076+03:00", "highlightTitle": ""}