{"organizations": [], "uuid": "313c81385f6e88d8005e0fffbe0e0246751a0bdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/overnights/253156-overnight-finance-bush-touts-tax-plan-financial-adviser-fight-hits", "country": "US", "title": "Overnight Finance: Bush touts tax plan; financial adviser fight hits the House", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Finance: Bush touts tax plan; financial adviser fight hits the House", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T01:33:00.000+03:00", "replies_count": 0, "uuid": "313c81385f6e88d8005e0fffbe0e0246751a0bdb"}, "author": "mmali@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/overnights/253156-overnight-finance-bush-touts-tax-plan-financial-adviser-fight-hits", "ord_in_thread": 0, "title": "Overnight Finance: Bush touts tax plan; financial adviser fight hits the House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Finance: Bush touts tax plan; financial adviser fight hits the House By Kevin Cirilli - 09/09/15 06:33 PM EDT \nI want the new iPhone... \nTOMORROW STARTS TONIGHT: JEB BUSH LOOKS TO GO ON OFFENSE. There is no question that the past few months have been the summer of Trump. The billionaire businessman injected a new life and energy into the presidential race -- stunning this town's old school, elite Washington insiders. They couldn't understand how someone not from \"the club\" catapulted to the top of polls, in part by pounding his opponents as he has other celebrities in previous feuds (here's looking at you, Rosie O'Donnell). ADVERTISEMENT But now... it's autumn. Former Florida Gov. Jeb Bush is done looking to dodge Trump and instead is aiming to draw a stark contrast with the former host of NBC's \"The Apprentice.\" Bush, a bilingual centrist, is in many ways the \"anti-Trump.\" The question is whether Bush will be able to project the same kind of candid, authentic political style that Trump has. (You can't fake personality.) While Trump was busy rallying Republicans in Washington earlier today to oppose the Iran deal, Bush delivered a wonky economic speech fresh off his appearance on Colbert's \"Late Show.\" We pick it up with Bush...\n1.) JEB BUSH LAUNCHES TAX PLAN, via Bernie Becker: \"Jeb Bush's tax plan has something to appeal to most GOP voters, with broad tax rate cuts for supply-side conservatives and a swipe at Wall Street for the more populist-minded. The GOP contender himself has said that he thinks a full-scale overhaul of the tax code is needed to spur 4 percent economic growth, and an economy that helps the working-class as much as the wealthy. Broadly speaking, Bush keeps the template from the last successful tax reform effort in 1986, proposing to roll back a number of tax breaks while lowering individual and corporate rates.\" \n2.) WHAT JEB SAID: \"My plan works whether you're on Main Street or Wall Street. No special favors. No special breaks. Fixing the tax code will take constant attention and effort... Hillary Clinton doesn't believe that we can grow faster than two percent, because she doesn't believe in your ability to rise to the challenge. This is a debate I welcome, because the difference between the Democrats' new normal, and my vision for high, sustained economic growth is pretty simple to state. The new normal is more businesses going under than starting up, which is where we are right now.\" Becker's report : http://bit.ly/1IYS70w \n-- Price tag on Bush's plan , via Becker: GOP contender Jeb Bush's new tax plan would cut taxes by roughly $3.4 trillion over a decade, according to a new estimate from four prominent conservative economists. http://bit.ly/1UHQpHH \nTHIS IS OVERNIGHT FINANCE, and the Metro was terrible today and it was disgusting and hot and humid. But you know what? Get grateful. It's Wednesday. It's autumn in D.C. and you're here. Tweet: @kevcirilli ; email: kcirilli@thehill.com ; and subscribe: http://thehill.com/signup/48 . \nMore Bush in a second... let's drink... to The Donald?... \nSHOT, Republican presidential frontrunner Donald Trump speaking at a rally in Washington D.C. earlier today: \"We are led by very, very stupid people. We are going to get nothing... They rip us off, they take our money, they make us look like fools... Never, ever in my lifetime have I seen a transaction negotiated so incompetently. We will have so much winning if I get elected you'll get bored of winning... We are going to start winning big league.\" Mark Hensch has the story: http://bit.ly/1OAbEJw \nCHASER, via House Republicans, as reported by Cristina Marcos and Scott Wong: \"House Republican leaders are delaying a vote on the Iran nuclear deal scheduled for Wednesday because of a rebellion from rank-and-file conservatives. The House was to hold a procedural vote to begin 11 hours of debate on a resolution disapproving the deal at 1 p.m. Instead, they will gather at 4 p.m. to discuss strategy... The House subsequently went into recess shortly after noon once leadership called off the procedural vote. GOP leaders had to change course after hearing an earful from rank-and-file members during a morning conference meeting.\" \n-- BEHIND THE SCENES, via Marcos and Wong: \"Members of the conservative House Freedom Caucus are demanding that the Obama administration send side deals between Iran and international nuclear inspectors to Congress as part of the Iran deal now under consideration. Opponents of the deal have argued that the clock on congressional consideration of the deal has not even begun until these side deals are submitted.\" http://bit.ly/1VND1UM \nAPPLE EVENT RECAP, via CNNMoney: Apple CEO Tim Cook has unveiled two new iPhones as well as the new Apple TV, iPad Pro and Apple Watches. The new iGadgets were unveiled during a press event Wednesday at San Francisco's Bill Graham Civic Auditorium. Full recap: http://cnnmon.ie/1Fye862 \nON-TAP FOR TOMORROW: FIDUCIARY FIGHT HITS THE HOUSE. The House Financial Services Subcommittees on Capital Markets and Government Sponsored Enterprises and Oversight and Investigations will hold a hearing on the consequences of President Obama's retirement regulation proposal. The Chamber of Commerce is testifying, and they're attacking it out in full force: \n-- CHAMBER STATEMENT SLAMS FIDUCIARY PROPOSAL: \"Small business employees are a significant part of the U.S. workforce, many of which rely on financial advisers linked to their employer's retirement plan for access to investment advice and services that would otherwise not be available. However, the DOL's proposed fiduciary rule would reduce and in some cases even eliminate those important benefits by requiring advisors to change how their products and services are structured and how the retirement plans and IRA accounts are charged Those required changes would result in a dramatic reduction in access to investment advice and services for small business employees.\" \nTHE PUERTO RICO BAILOUT? Pete Schroeder for The Hill: \"Puerto Rico is counting on Congress to make several changes to the law to help it through its fiscal crisis, according to a new report from commonwealth advisers. The island-commissioned study said Washington needs to enact changes to the tax code and healthcare funding to help relieve Puerto Rico's massive debt burden, and also give the island some way to restructure its that debt load, either through changes to the bankruptcy code or some other method.\" http://bit.ly/1NiI6RU \nWHAT WILL WASHINGTON DO ABOUT THIS... Two in Every Five U.S. Children Spend at Least a Year in Poverty, via WSJ: Childhood poverty is far more prevalent than annual figures suggest, a new paper says, with nearly two in every five U.S. children spending at least one year in poverty before they turn 18 years old. The findings from Caroline Ratcliffe, a senior fellow at the Urban Institute, show particularly stark divides along racial lines. Black children fare much worse. Some 75% are poor at some point during their childhood, compared to 30% of white children. http://on.wsj.com/1JUL9v2 \nSHUTDOWN WATCH, via Rebecca Shabad: House GOP leaders say they will seek to develop a plan as early as next week on how to keep the government open but block funding for Planned Parenthood. In the meantime, they will hold listening sessions with rank-and-file members as they seek a way forward. http://bit.ly/1UCfGIB \nBUSH BACKDROP: EX-IM BENEFACTOR. Jeb Bush used the backdrop of a small N.C. company to announce his plans for streamlining the onerous American tax system. The company, Morris & Associates, manufacturers refrigeration and freezing equipment. While the company has used Ex-Im to export just $46,000 worth of goods, Ex-Im supporters say it highlights the kind of small businesses that also benefit from the bank. \nBANKS PUSH FOR ACTION ON SHELBY'S REG RELIEF BILL. Evan Weinberger for Law 360: Banking industry groups on Wednesday called on senators to move forward with stalled legislation aimed at bringing regulatory relief to community banks, including a measure that would lift the threshold for subjecting bank holding companies to extra scrutiny from $50 billion to $500 billion. http://bit.ly/1O23Sel Read the letter: http://bit.ly/1EW0IGe \n--Follow us on Twitter: @VickofTheHill ; @PeteSchroeder ; @BernieBecker3 ; @RebeccaShabad and @kevcirilli .", "external_links": [], "published": "2015-09-10T01:33:00.000+03:00", "crawled": "2015-09-10T22:21:28.311+03:00", "highlightTitle": ""}