{"organizations": [], "uuid": "129ac21fabce86e69f5435ab171296ba4950e501", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/14/vivendi-universalmusic-takedowns-idUSL1N11K1FZ20150914", "country": "US", "title": "UPDATE 1-'Fair use' matters in dancing toddler copyright case--US court", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-'Fair use' matters in dancing toddler copyright case--US court | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T23:49:00.000+03:00", "replies_count": 0, "uuid": "129ac21fabce86e69f5435ab171296ba4950e501"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/14/vivendi-universalmusic-takedowns-idUSL1N11K1FZ20150914", "ord_in_thread": 0, "title": "UPDATE 1-'Fair use' matters in dancing toddler copyright case--US court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Video showed toddler dancing to Prince's \"Let's Go Crazy\"\n* Fair use must be assessed before demanding video takedowns (Adds comment from plaintiff's lawyer)\nBy Jonathan Stempel\nSept 14 (Reuters) - Copyright holders must consider \"fair use\" before demanding the removal of videos that people post online, including on Google Inc's YouTube, a U.S. appeals court ruled on Monday.\nIn a closely followed case over a home video of a toddler dancing to the Prince hit \"Let's Go Crazy,\" the 9th U.S. Circuit Court of Appeals in San Francisco made it tougher for content providers such as Vivendi SA's Universal Music Group to force Internet service providers to remove material.\n\"Copyright holders cannot shirk their duty to consider - in good faith and prior to sending a takedown notification - whether allegedly infringing material constitutes fair use,\" Circuit Judge Richard Tallman wrote for a 3-0 panel.\nThe decision could make it harder for copyright holders to remove alleged infringing content from the Internet by invoking the federal Digital Millennium Copyright Act, a 1998 law intended to curb movie and music piracy online. Critics say abusive takedown notices can suppress free speech.\nStephanie Lenz of Gallitzin, Pennsylvania had in February 2007 uploaded to YouTube a blurry 29-second clip of her 13-month-old son Holden happily bobbing up and down to \"Let's Go Crazy,\" a 1984 song by Prince and The Revolution that played in the background.\nLenz said she thought her family and friends would enjoy seeing the toddler, who had just learned to walk, dance as well.\nBut Universal, which enforced Prince's copyrights, persuaded YouTube to remove Lenz's video, citing a good faith belief that the video was unauthorized.\nLenz had the video restored, and sued Universal over the takedown notice, seeking damages.\nIn January 2013, U.S. District Judge Jeremy Fogel in San Francisco said copyright holders must consider fair use, but denied Lenz's misrepresentation claim.\nUpholding that ruling, Tallman said there can be liability if a copyright holder \"knowingly misrepresented\" in a takedown notice that it had a good faith belief that a video \"did not constitute fair use.\"\nBut he also said courts should defer to a copyright holder who has a \"subjective good faith belief\" to the contrary.\nThe 9th Circuit said Lenz failed to overcome this hurdle, and instead may seek nominal damages for the \"unquantifiable harm\" she suffered.\nUniversal spokesman Andy Fixmer declined immediate comment.\nCorynne McSherry, a lawyer with the Electronic Frontier Foundation representing Lenz, said the decision \"sends a strong message that copyright law does not authorize thoughtless censorship of lawful speech.\"\nThe case is Lenz v Universal Music Corp et al, 9th U.S. Circuit Court of Appeals, Nos. 13-16106, 13-16107.\n(Reporting by Jonathan Stempel in New York; Additional reporting by Andrew Chung in New York; Editing by Christian Plumb)", "external_links": [], "published": "2015-09-14T23:49:00.000+03:00", "crawled": "2015-09-14T22:53:23.962+03:00", "highlightTitle": ""}