{"organizations": [], "uuid": "cb6173a3e5beb316a290558d6eb48eecb3381ad6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-targetukfocus/?format=rss", "section_title": "Finance News | Reuters - UK Focus - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/electricity-shortage-low-copper-prices-145818291.html", "country": "US", "title": "Electricity shortage, low copper prices hit Zambian mines", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Electricity shortage, low copper prices hit Zambian mines", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T17:58:00.000+03:00", "replies_count": 0, "uuid": "cb6173a3e5beb316a290558d6eb48eecb3381ad6"}, "author": "", "url": "https://uk.finance.yahoo.com/news/electricity-shortage-low-copper-prices-145818291.html", "ord_in_thread": 0, "title": "Electricity shortage, low copper prices hit Zambian mines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 8, 2015, 16:15 BST - UK Markets close in 15 mins. Electricity shortage, low copper prices hit Zambian mines Reuters - UK Focus – 16 minutes ago \n* Zambia is Africa's No. 2 copper producer \n* Power crisis, weak copper prices threaten output \n* Glencore (Xetra: A1JAGV - news ) , other miners halting some production \n* Govt steps up power imports to ease situation \nBy Chris Mfula \nLUSAKA, Sept 8 (Reuters) - An electricity shortage and weaker copper prices have put pressure on Zambia's mining industry, threatening output, jobs and economic growth in Africa's No. 2 producer of the metal. \nThe power problems and copper price slide have driven the kwacha currency to record lows amid a selloff in commodity-linked currencies as key consumer China's economy has slowed, renewing pressure on Zambia to diversify its economy. \nGlencore, Vedanta Resources Plc (Other OTC: VDNRF - news ) and China's NFC Africa and CNMC Luanshya Copper Mine have said they will shut down some operations due to the harsh business environment. \n\"This is serious, it could bring our economy to its knees,\" independent analyst Maambo Hamaundu said. \nZambia's power generation capacity stands at 2,200 megawatts (MW), with most of the electricity produced from hydropower, but supply is often erratic. \nState power utility Zesco Ltd, which generates the bulk of the electricity, said last week it would deepen power cuts after water levels at its largest hydropower station dropped following a drought. \nPresident Edgar Lungu said on Friday that Zambia should reduce its overall imports of goods to tackle the country's trade imbalance, but it should import more power to address the shortages. \nThe Zambian government on Tuesday started importing 148 MW of power from a ship docked off the coast of Mozambique. \n\"CEC (Copperbelt Energy Corporation) has communicated to the mines, the need for them to begin accessing imported power,\" Chama Nsabika-Kalima, spokesperson for CEC, the largest supplier of power to Zambia's copper mines, said. \nZambia is the world's No. 8 copper producer. The closure of mines and smelters is likely to hit its output, which was projected to increase to 916,767 tonnes by 2018 from 741,916 tonnes in 2015, largely on account of increased output at the Kansanshi mine owned by Canada's First Quantum Minerals (Toronto: FM.TO - news ) , according to government data. \nThe slide in global copper prices, to six-year lows last month, has already prompted the government to slash its economic growth forecast for this year to 5 percent, from an initial 7 percent, and the deepening power crisis and curbs to copper production risk a further slowdown, analysts say. \nCopper production accounts for 11 percent of Zambia's gross domestic product. \nLabour unions are worried about the impending job cuts, while the government has asked mining companies to consult with the ministry of labour before shutting down operations. \n\"We started importing electricity and they have the option to buy that power and continue with the operations,\" the chief government spokesman, Chishimba Kambwili, said. \nThe Zambia Chamber of Mines, an industry body, said it was talking to the government over the problems facing the industry. \n\"We understand the severity of the situation. We want to work with the government to find a long-term solution to this problem,\" the chamber's chief executive, Maureen Dlamini, told Reuters. (Editing by James Macharia and Susan Fenton)", "external_links": [], "published": "2015-09-08T17:58:00.000+03:00", "crawled": "2015-09-08T18:17:13.222+03:00", "highlightTitle": ""}