{"organizations": [], "uuid": "8fe7c06efc2fc657a8df271a3ccd8e2f1b3072b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KH215_cmacgm_G_20150914141925.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/shipping-lines-wont-curtail-megaship-purchases-analyst-says-1442257461", "country": "US", "title": "Shipping Lines Won’t Curtail Megaship Purchases, Analyst Says", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "Shipping Lines Won’t Curtail Megaship Purchases, Analyst Says - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T23:04:00.000+03:00", "replies_count": 0, "uuid": "8fe7c06efc2fc657a8df271a3ccd8e2f1b3072b1"}, "author": "Paul Page", "url": "http://www.wsj.com/articles/shipping-lines-wont-curtail-megaship-purchases-analyst-says-1442257461", "ord_in_thread": 0, "title": "Shipping Lines Won’t Curtail Megaship Purchases, Analyst Says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Large shipping lines won’t curtail their buying of container megaships as falling fuel prices cut into the cost advantages they are seeking from the bigger vessels, according to maritime industry consultants.\n“It’s a done deal,” said Simon Heaney, research director at the London-based Drewry Shipping Consultants Ltd. “The carriers have decided that these ships are the wave of the future. Today’s fuel prices may be a temporary blip but there will always be cost advantages to the big ships.”\nThe world’s largest shipping companies—including Maersk Line, a unit of Denmark’s A.P. Møller-Maersk AMKBY -1.80 % A/S, Switzerland-based Mediterranean Shipping Co. and France’s CMA CGM SA—have added new container ships that can carry 18,000 to 20,000 containers each, about 30% more than the capacity of the biggest ships just five years ago. The launch of the vessels on Europe-Asia routes, the world’s busiest ocean trade lane, has been accompanied by steep price reductions this year as capacity has far outstripped demand.\ntop logistics news\nGet the latest logistics and supply chain news and analysis via an email newsletter. Sign up here. Executives at the carriers have said the larger ships drive down their per-container operating costs because the vessels are more fuel efficient than older ships and they can spread the operating costs around to more shipments.\nFuel prices have fallen by about half over the past year, according to Bunker World, which tracks trends in the shipping fuel known as bunker, and Drewry says that has eroded the cost advantage for bigger carriers. The fuel savings of $76 per container position in June 2104 was down to $38 at the start of September, Drewry said in a research report released Monday.\nThat narrowing cost advantage may be increasing container shipping on Asia-Europe trade lanes, pushing freight rates to historic lows in recent months and pressing several carriers to cut back capacity.\nrelated stories\nCosco to Order 11 Container Megaships Supersized Cargo Skips Small Ports Shipping Lines Reduce Sailings on World’s Busiest Route Cheap Oil Boosts CMA CGM Profits The G6 alliance of six container lines on Monday announced that it was taking 10 sailings out of its Asia-Europe operations over the coming weeks as the group retrenches in the face of weaker demand. The alliance includes Neptune Orient Lines Ltd. unit APL, Hapag-Lloyd AG, Hyundai Merchant Marine Co. Ltd., Mitsui O.S.K. Lines Ltd., Nippon Yusen Kaisha and Orient Overseas (International) Ltd.\nMr. Heaney said the main concern for shipping lines remains the “cascading” impact of shifting big ships down to secondary trade lanes as they put bigger vessels into their busiest operations. That may trigger greater overcapacity and rate-cutting on those routes, he said.\n“The carriers have done a reasonable job of spreading the load, but they face an almost impossible balancing act,” said Mr. Heaney. “As these ultralarge ships go into the main trade lanes, there is a destabilizing impact.”\nAlphaliner, a Singapore-based consultancy, said the number of idled container ships reached a 2015 high of 175 vessels with capacity for nearly 500,000 containers in early September. That remains far below the number of ships that were put in storage during the last big downturn in 2009.\nWrite to Paul Page at paul.page@wsj.com", "external_links": [], "published": "2015-09-14T23:04:00.000+03:00", "crawled": "2015-09-14T22:27:29.780+03:00", "highlightTitle": ""}