{"organizations": [], "uuid": "8533f1b11d5577f1f4901eac5e19559e4b74ab56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/1/0/h/a/image.related.afrArticleLead.620x365.gjeatj.png/1441274068152.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/super-sector-outgrows-local-sharemarket-20150903-gjeatj", "country": "AU", "title": "Super sector outgrows local sharemarket", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Super sector outgrows local sharemarket | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T15:04:00.000+03:00", "replies_count": 0, "uuid": "8533f1b11d5577f1f4901eac5e19559e4b74ab56"}, "author": "Sally Rose", "url": "http://www.afr.com/business/banking-and-finance/super-sector-outgrows-local-sharemarket-20150903-gjeatj", "ord_in_thread": 0, "title": "Super sector outgrows local sharemarket", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Brennan says super funds will increasingly need to look outside the Australian market. Michel O'Sullivan Share on twitter Share on Google Plus by Sally Rose Australian listed companies may need to issue less equity and raise more bonds over the coming years to satisfy the needs of the $2 trillion superannuation sector, which is sending an increasing share of its sought-after capital offshore.\n\"A disproportionate amount amount of super savings is invested in the local sharemarket, rather than the bond market or international shares,\" Citi Equity strategist Tony Brennan told the Australian Institute of Superannuation Trustees investment conference on Thursday.\nThe superannuation sector is forecast to grow to $5 trillion, or 160 per cent the value of annual gross domestic product, by 2043. But the relative value of the ASX as function of GDP is shrinking as de-listings and share buybacks outpace initial public offers and capital raisings. This trend is set to be exacerbated as super funds, which are the biggest buyers in the local sharemarket, take a greater portion of their money elsewhere.\n\"Super funds have on average around 35 per cent of total assets invested in local stocks. Given the Australian Securities Exchange makes up just 2 per cent of the global equity market it is really hard to see how that is going to be the best strategy going forward,\" Mr Brennan said.\nAn extended period of record low interest rates and artificial liquidity from global central banks since the financial markets crisis of 2008 has dampened down bond yields pushing more money into high dividend paying stocks.\nThe yield on a three-year Australian government bond is now about 1.9 per cent, while the grossed up dividend yield available from the S&P/ASX 200 is 6 per cent.\nMr Brennan warned the high yields from domestic equities look unsustainable.\n\"Dividends are in large part being funded through higher payout ratios while capital investment, which could help spur growth, is declining. The ASX is not a magic pudding and not enough investors understand that,\" Mr Brennan said, referring to the classic Australian childrens' story about a pudding that magically replenishes itself whenever someone cuts a slice.\n Too expensive or too narrow Many funds are already shifting more of their share portfolio offshore because the ASX is too expensive or lacks the diversity they need to spread risk.\n\"We are increasing our allocation to offshore equities at the expense of local stocks because there are many more opportunities and better value available,\" Hostplus chief investment officer Sam Sicilia said.\nFinancial services, which includes banks and property trusts, accounts for 54 per cent of the market capitalisation of the S&P/ASX 200 while the materials sector, dominated by a couple of big miners, accounts for another 15 per cent. The high growth information technology sector, which is a driving force of sharemarkets in the United States and Asia, accounts for just 0.5 per cent of the local bourse.\n\"Super funds need to stop being so provincial and think about ourselves as truly global investors to compete internationally for the best assets,\" Meat Industry Employees' Superannuation Fund chief investment officer Mary McLaughlin said.\nAn ageing population also means super funds will have a much greater need for the stability provided by fixed income and so it will be appropriate for them to take money out of equities and re-invest it in bonds, Mr Brennan said.\n\"Corporate issuers may have to look at issuing less equity and more debt in the years ahead.\"\nLocal superannuation funds currently own about 35 per cent of the domestic sharemarket, compared to just 7 per cent of the Australian bond market.", "external_links": ["https://twitter.com/sallymrose", "https://plus.google.com/115164720240377561218/about?hl=en"], "published": "2015-09-03T15:04:00.000+03:00", "crawled": "2015-09-03T15:07:40.633+03:00", "highlightTitle": ""}