{"organizations": ["Will Fed"], "uuid": "f372487f8cfdc4f39b536b6dcb212dee96fc8d31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/press-and-guide/rss/627", "section_title": "Press and Guide : Personal Finance", "url": "http://business-news.thestreet.com/press-and-guide/story/jobs-growth-is-weak-but-will-fed-still-raise-rates/13277079", "country": "US", "title": "Jobs Growth Is Weak, but Will Fed Still Raise Rates?", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Jobs Growth Is Weak, but Will Fed Still Raise Rates?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T16:02:00.000+03:00", "replies_count": 0, "uuid": "f372487f8cfdc4f39b536b6dcb212dee96fc8d31"}, "author": "", "url": "http://business-news.thestreet.com/press-and-guide/story/jobs-growth-is-weak-but-will-fed-still-raise-rates/13277079", "ord_in_thread": 0, "title": "Jobs Growth Is Weak, but Will Fed Still Raise Rates?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Mullaney"], "text": "Jobs Growth Is Weak, but Will Fed Still Raise Rates? Written by: Tim Mullaney 09/04/15 - 9:02 AM EDT Tickers in this article: RATE ADP \nThis story has been updated and recast following the August jobs report. NEW YORK (TheStreet) -- Job growth was unexpectedly weak in August, raising more questions about whether the Federal Reserve will raise interest rates later this month. Friday's report showed 173,000 jobs were created last month, far below from the consensus of 213,000 jobs in August, which is a third lower than the norm in late 2014. U.S. stock futures continued to fall in premarket trading on Friday. Even before the number came out at 8:30 a.m. EDT, Richmond Fed President Jeffrey Lacker grabbed the market's attention by calling for an end to zero interest rates. \"It's time to align our monetary policy with economic progress,\" he said Friday. Lacker is only one of the voting members on the Fed policy committee, so it's unclear whether the other members, including Chair Janet Yellen, will heed his call and raise the benchmark federal funds rate for the first time since 2006. Still, if the standard is U.S. growth that is reasonably stable and at or above the long-term trend of about 2.5% a year, with nearly-full employment and some risk of emerging inflation, the Fed should probably hold off. \n\"Are we there yet?\" asked Bankrate.com economic analyst Mark Hamrick, likening the market's waiting-for-Godot interest rate watch to kids on a long car trip. \"We don't know. But we feel like we're not.'' \nTracking forecasts for third-quarter growth still point to a sharp slowdown from the second quarter: The annual growth rate looks likely to be about 2.5%, bringing the first nine months of 2015 to a clip of 2.2% or so. More Headlines", "external_links": [], "published": "2015-09-04T16:02:00.000+03:00", "crawled": "2015-09-04T16:38:41.986+03:00", "highlightTitle": ""}