{"organizations": [], "uuid": "65d64a6069ce9bf8fb4c391e08692804786bf467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources3.news.com.au/images/2015/09/16/1227530/210515-68852d6e-5c10-11e5-93af-6cea16a76282.jpg", "site_section": "http://www.adelaidenow.com.au//business", "section_title": "Business News | Business and Finance News | The Advertiser", "url": "http://www.adelaidenow.com.au/business/work/malcolm-turnbulls-secret-dinner-with-clive-palmer-may-have-paid-off-big-time/story-fnkjjewf-1227530210292", "country": "US", "title": "Malcolm Turnbull: Was the Clive Palmer dinner key to crossbench endorsement?", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Malcolm Turnbull: Was the Clive Palmer dinner key to crossbench endorsement? | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T22:40:00.000+03:00", "replies_count": 0, "uuid": "65d64a6069ce9bf8fb4c391e08692804786bf467"}, "author": "MALCOLM FARR", "url": "http://www.adelaidenow.com.au/business/work/malcolm-turnbulls-secret-dinner-with-clive-palmer-may-have-paid-off-big-time/story-fnkjjewf-1227530210292", "ord_in_thread": 0, "title": "Malcolm Turnbull: Was the Clive Palmer dinner key to crossbench endorsement?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "REMEMBER 16 months ago when Malcolm Turnbull dined with Clive Palmer and the fury it roused among some of Tony Abbott’s backers?\nWell, that bread breaking might have led to a swift endorsement of Prime Minister Turnbull from crossbench senators that was always denied Prime Minister Abbott.\nIt was a sign to the small group who will decide the fate of Turnbull legislation that he was prepared to talk to all elements in the Parliament.\nSo far, Mr Turnbull’s crossbench endorsement has not come with the huge price tag the Nationals demanded for their support, which was crucial to the smooth creation of the Turnbull Government.\nHowever, that might change with the small Senate group of eight identifying a range of priorities, including a stronger attack on unemployment and a royal commission into coal seam gas (CSG) operations.\nPlaying the long game … Finally in the big chair as Australia’s new Prime Minister. Picture: AAP/Sam Mooy Source: AAP\nIndependent senator Nick Xenophon said today that the crossbench was looking forward to a good relationship with the new Prime Minister, but that would depend on the issues.\n“But if the policies don’t change, even Jesus Christ would not get me to vote for them,” Senator Nick Xenophon told news.com.\nThe key to the crossbench support is the promise of greater consultation, which the senators see as a welcome change to the approach of Mr Abbott.\nThe Turnbull ascendancy has been given the tick of approval by independents Jacqui Lambie, Glenn Lazarus, Liberal Democrat David Leyonhjelm, and Palmer United Party’s Dio Wang.\nSenator Leyonhjelm has known Mr Turnbull for some time and they get on well.\nWho’s laughing now? Turnbull and Palmer were joined by the head of Treasury Martin Parkinson. Picture: Gary Ramage Source: News Corp Australia\nBut at least, the senators believe, there will be a chance for greater influence on the government.\n“I was a little frustrated with Tony Abbott, I’ve got to admit,” Senator Lazarus told ABC radio today.\n“And talking with crossbench colleagues, they had the same opinion. There was no enthusiasm to meet with us. It was very difficult to get a meeting.\n“In fact, the 14 or 15 months I’ve been in this role I’ve only had one meeting with him [Tony Abbott] … I can only hope and, going by my dealings with Malcolm Turnbull, he seems to be a lot more forthcoming with his time.”\nSenator Lazarus has written to congratulate Mr Turnbull and to invite him to visit CSG fields in Queensland.\n‘Don’t care if it was Jesus’ … Independent Senator Nick Xenophon. Source: News Corp Australia\nMr Turnbull portrayed himself as a calm, visionary figure when announcing his leadership challenge, then again in his victory speech.\nBut the challenge also had an air of ruthlessness about it, a cut-throat quality which harked back to Mr Turnbull’s days as a young lawyer who was unafraid to take on anybody.\nThere are two moments of legal genius which tell you more about Mr Turnbull than anything he’s ever done in politics .\nOriginally published as Turnbull’s secret dinner pays off", "external_links": ["http://www.news.com.au/finance/work/two-moments-of-legal-genius-which-tell-you-more-about-malcolm-turnbull-than-anything-hes-ever-done-in-politics/story-fn5tas5k-1227528739431", "http://resources0.news.com.au/images/2015/09/16/1227530/210236-74b7fa62-5c10-11e5-93af-6cea16a76282.jpg", "http://resources1.news.com.au/images/2015/09/16/1227530/210209-afee5068-5c10-11e5-93af-6cea16a76282.jpg", "http://resources1.news.com.au/images/2015/09/16/1227530/210265-d5aca3a4-5c10-11e5-93af-6cea16a76282.jpg", "http://www.news.com.au/national/clive-palmer-and-malcolm-turnbull-busted-in-secret-dinner-meeting-along-with-head-of-treasury-dr-martin-parkinson/story-fncynjr2-1226935148249", "http://www.news.com.au/finance/work/malcolm-turnbulls-secret-dinner-with-clive-palmer-may-have-paid-off-big-time/story-fn5tas5k-1227530210292"], "published": "2015-09-16T22:40:00.000+03:00", "crawled": "2015-09-16T23:40:26.511+03:00", "highlightTitle": ""}