{"organizations": [], "uuid": "8f50df279c0c6e5e3ce482c0d079eaf0eed0e0fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/j/n/t/x/1/image.related.articleLeadwide.620x349.gjntd2.png/1442456784426.jpg", "site_section": "http://www.canberratimes.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/markets/options-traders-doubt-macau-recovery-as-analysts-turn-bullish-20150916-gjntd2.html", "country": "AU", "title": "Options traders doubt Macau recovery as analysts turn bullish", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Options traders doubt Macau recovery as analysts turn bullish", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T10:26:00.000+03:00", "replies_count": 0, "uuid": "8f50df279c0c6e5e3ce482c0d079eaf0eed0e0fd"}, "author": "Jonathan Burgos", "url": "http://www.canberratimes.com.au/business/markets/options-traders-doubt-macau-recovery-as-analysts-turn-bullish-20150916-gjntd2.html", "ord_in_thread": 0, "title": "Options traders doubt Macau recovery as analysts turn bullish", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Macau's casinos have been hit hard by Beijing's corruption crackdown. With new casinos set to open, are its fortunes going to turn?\nAnalysts say Macau casino stocks are overdue for a rebound. But just weeks before James Packer's Melco Crown Entertainment is set to open its new $US3.2 billion casino in the gambling mecca, the options market disagrees.\nStrategists tracked by Bloomberg issued a total of 17 bullish recommendations in the past month on Galaxy Entertainment and Sands China -- the two largest casino operators in the city -- after a rout that erased a combined $US37.7 billion ($52.9 billion) in market value over the last 12 months.\nBy contrast, options traders see no end to the declines, paying the most on record for bearish contracts relative to ones speculating on gains.\nJames Packer is waiting for his salary for his new role as an executive director of Crown Resorts to be finalised. Photo: Pat Scala\nMacau's gaming revenue fell 36 per cent in August from a year earlier, a 15th straight month of declines, as an economic slowdown in China curbed visits by mass market gamblers and high-rollers avoided the city amid Beijing's crackdown on graft. Casino operators are investing $US26.6 billion to build new resorts and gaming facilities, in what has so far been an unsuccessful bet that they can draw visitors back to the city.\n\"There's earnings uncertainty on Macau casinos,\" said Sam Le Cornu, who oversees about $US3 billion in Asian listed equities at Macquarie Investment Management in Hong Kong. \"They are still faced with structural issues such as the corruption crackdown. Gross gaming revenues haven't picked up and we have a lot of supply coming in. Whether or not demand will be there or how profitable the new gaming tables will be is a big question mark.\"\nTourist traffic from mainland China, which accounts for two-thirds of the total, fell for five straight months through July from a year earlier. The casino downturn has dragged Macau's gross domestic product to its lowest since 2011. Earnings per share at the six main listed casinos -- Sands, Galaxy, James Packer's Melco Crown Entertainment, SJM Holdings, MGM China Holdings and Wynn Macau -- will slide 32 per cent over the next 12 months, according to estimates compiled by Bloomberg.\nEconomic reports August data showed China's fixed-asset investment rose at the slowest pace in 15 years and industrial production trailed analyst estimates, raising further question marks over the effectiveness of government efforts to revive growth. Bloomberg's monthly gross domestic product tracker was at 6.64 per cent last month, barely changed from July and well below the government's target of about 7 per cent this year.\n\"The macro headwinds for the Macau casinos continue to be strong as the Chinese economy continues to slow,\" said Michael Liang, Hong Kong-based chief investment officer at Foundation Asset Management. \"Restrictions on Chinese taking funds out of mainland also continue to hinder growth in Macau casinos.\"\nIn August, Macau police arrested 17 people in a raid on five shops thought to be using China UnionPay point-of-sale terminals to illegally take cash out of China. The arrests may herald further restrictions on the use of UnionPay, making it harder for bettors to skirt currency controls.\nOption costs Puts hedging against a 10 per cent drop in Galaxy and Sands China shares cost at least 8 points more than calls betting on a 10 per cent advance on Tuesday, data on one-month options compiled by Bloomberg show. The price difference climbed to 17.4 for Galaxy and 19.9 for Sands China on Sept. 7, the widest gap since Bloomberg started compiling the data in June 2012.\nSands China spokesman Simpson Lei declined to comment when asked whether the company is seeing signs gaming revenues are beginning to stabilise. An email sent to Galaxy's media department went unanswered.\nMacau's gaming revenue should stop falling as more new attractions open, said Michael Ting, an analyst at CIMB Group Holdings in Hong Kong.\nMelco Crown, 34 per cent owned by Mr Packer's Crown Resorts, plans to open Studio City on October 27 - a casino that has a Hollywood-themed resort with Asia's highest Ferris wheel and family entertainment developed with movie studio Time Warner.\nStudio City will add to Melco Crown's existing Altira and City of Dreams casinos in Macau and the Philippines. Mr Packer has tapped his Hollywood connections to lend some star power to the opening with Rush Hour director Brett Ratner lining up producer Martin Scorcese with actors Robert De Niro, Leonardo DiCaprio and Brad Pitt to star in a short film dubbed The Audition themed around a Studio City storyline.\nAs the only Chinese city allowing commercial gambling, Macau reaped $US44 billion in gambling revenue in 2014, seven times more than all of the casinos in the Las Vegas Strip.\nMore traffic \"The new resorts will definitely drive visitor traffic to Macau,\" Ting said. \"Unless we see a macroeconomic shock, gaming revenues should stabilise.\"\nAnalysts at four brokerages recommended investors purchase Sands China shares this week alone, driving the proportion of strategists with buy calls to the highest since March, data compiled by Bloomberg show. The average price target is 27 per cent above Tuesday's close. For Galaxy, analysts are tipping a 55 per cent gain.\nSands China is the most attractive stock among Macau casino operators because it's the least dependent on high rollers, Richard Huang, an analyst at Nomura Holdings wrote in a note dated Sept. 14. \"While VIP revenues remain lacklustre, mass revenues have shown increasing signs of stabilisation,\" he wrote.\nStock volatility The HSI Volatility Index, which measures the cost of options on the Hong Kong benchmark measure, fell 0.1 per cent to 33.24 on Tuesday. Implied volatility, used to gauge the cost of options, for one-month contracts with an exercise price 10 per cent below Galaxy shares was 61, compared with 53.1 for those with a strike price 10 per cent above, according to data compiled by Bloomberg.\n\"While valuations for the Macau casinos have fallen, there are fears that the earnings slump for the Macau casinos may worsen,\" said Castor Pang, head of research at Core-Pacific Yamaichi Hong Kong.\n\"Investors are waiting to see when gross gaming revenues will start to improve.\"\nBloomberg with BusinessDay", "external_links": [], "published": "2015-09-17T10:26:00.000+03:00", "crawled": "2015-09-18T06:23:59.707+03:00", "highlightTitle": ""}