{"organizations": [], "uuid": "8973ae221b28a17160a93d8b2dcd20bb0d6f7d53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/time-dump-disappointing-shares-152545997.html", "country": "GB", "title": "When Is The Right Time To Dump Disappointing Shares?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "When Is The Right Time To Dump Disappointing Shares?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T18:25:00.000+03:00", "replies_count": 0, "uuid": "8973ae221b28a17160a93d8b2dcd20bb0d6f7d53"}, "author": "", "url": "https://uk.finance.yahoo.com/news/time-dump-disappointing-shares-152545997.html", "ord_in_thread": 0, "title": "When Is The Right Time To Dump Disappointing Shares?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Sep 9, 2015, 23:39 BST - UK Markets closed When Is The Right Time To Dump Disappointing Shares? By Peter Stephens | Fool.co.uk – 7 hours ago Print \nA key strength of good investors is being able to handle disappointment and failure. In fact, no matter how intelligent, experienced and skilled you are at investing, mistakes are a cast-iron certainty. That's because even the best investors cannot consistently and accurately anticipate all challenges that a company will eventually face and, while the risk/reward ratio may have huge appeal at the time of purchase, things always change in the business world. \nThe problem, though, is deciding exactly what to do with the shares that turn out to be disappointing. Clearly, they can fall into any number of categories, with examples being stocks that have plummeted to be worth a small percentage of their original value all the way through to companies that may be in positive return territory, but which have lagged their industry group or the wider index. \nWarren Buffett seems to have a neat way of looking at disappointing stocks, stating that 'should you find yourself in a chronically leaking boat, energy devoted to changing vessels is likely to be more productive than energy devoted to patching leaks'. In other words, if the outlook for the company in which you have invested has changed significantly and things could get worse before they get better, selling up and investing elsewhere could be a sound move. Certainly, this may realise a loss (which is always painful), but it may mean that breaking even occurs much sooner. \nOf course, deciding when to sell a sinking company can be tough. As such, a number of investors prefer to place a 'stop-loss' on their shares, which means that if their price falls by a set level (perhaps 10% or 20%) then they sell up and invest the capital elsewhere. This, on the one hand, is appealing, since it means that major losses are not experienced. But, on the other hand, it means the stocks that fall following purchase but then regain that lost ground before posting superb profit (which does happen surprisingly often) are sold far too early. Therefore, while a stop-loss may limit downside, it also limits upside, too. \nAn assessment, therefore, of a company's future prospects appears to be a sound means to determine whether to sell up and move on. This, of course, can sometimes prove to be more of an art than a science. For example, a company may change its management team, refresh its strategy or make an acquisition that turns poor performance into much improved returns in future, with all three of these scenarios requiring an opinion and viewpoint rather than a cold, hard look at the facts. \nAs such, the decision as to when to sell disappointing shares appears to be a somewhat complicated one, with there being no 'catch-all' policy to be applied. Rather, it is through an ongoing, honest assessment of all holdings (good and bad) within a portfolio that an investor can begin to decide which are worth holding on to and which ones should be sold. As a result, being able to put the pain of losses to one side and act as if you are looking at the company for the very first time could allow you to make the most logical investment decisions. Certainly, mistakes will be made, but that just comes with the territory of being a successful investor. \nOf course, if you are thinking of selling any holdings, finding more appealing stocks in which to reinvest can be a tough task. That's why The Motley Fool has written a free and without obligation guide called 7 Simple Steps For Seeking Serious Wealth. \nIt's a step-by-step guide that could make a real difference to your portfolio returns in 2015 by helping you to find the best stocks at the lowest prices. \nClick here to get your copy - it's completely free and comes without any obligation.", "external_links": [], "published": "2015-09-09T18:25:00.000+03:00", "crawled": "2015-09-10T01:40:01.186+03:00", "highlightTitle": ""}