{"organizations": [], "uuid": "052e43613233735de6e732a7854a6fb21a40cf93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/10/china-crude-futures-idUSL5N11F04A20150910", "country": "US", "title": "Like it or not, China's crude oil futures will be a global benchmark", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Like it or not, China's crude oil futures will be a global benchmark | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T08:03:00.000+03:00", "replies_count": 0, "uuid": "052e43613233735de6e732a7854a6fb21a40cf93"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/10/china-crude-futures-idUSL5N11F04A20150910", "ord_in_thread": 0, "title": "Like it or not, China's crude oil futures will be a global benchmark", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Chinese crude benchmark all but inevitable-executives\n* Rise of China's crude futures expected to be gradual\n* Competitors, incumbents are not sitting idle\nBy Henning Gloystein\nSINGAPORE, Sept 10 (Reuters) - China's push to establish a crude derivatives contract has been met with early scepticism, but oil executives say the country's growing economic influence means a third global crude benchmark is inevitable.\nA derivatives contract would give the Shanghai International Energy Exchange, known as INE, a slice of an oil futures market worth trillions of dollars, offering a rival to London's Brent and U.S. West Texas Intermediate (WTI).\nAnd while others have tried and failed, China brings its might as the world's biggest oil buyer, a strong dose of political will and the alignment of its financial and banking system for a yuan-denominated contract.\n\"The energy industry is still manned, literally, by people from the West. But the world moves on, and there's a change of guard,\" said a senior market executive, speaking on the sidelines of a major industry gathering in Singapore this week, at which delegates spoke on condition of anonymity.\n\"China has become the world's biggest oil trader, and that means that an oil price will be set there, like it or not.\"\nShanghai's INE is in the final stages of launching crude oil futures, perhaps as early as October, although sources said delays were likely due to market turmoil.\nThe contract would better represent China's growing importance in setting crude prices, increase the yuan's role as an international currency and offer a measure of national pride.\nIt would also allow traders to arbitrage between major global regions, the Americas, Europe/Middle East/Africa (EMEA) and the Asia/Pacific.\nOthers, like the Dubai Mercantile Exchange (DME), have tried to establish an Asian benchmark, but have so far failed to attract sufficient liquidity to dominate the region.\nMarket participants also have concerns relating to the large size of China's state-owned oil majors, recent moves by regulators to influence the country's share markets, and the use of the yuan.\n\"The market doesn't like the idea of a benchmark dominated by the world's biggest consumer, where the regulator is suspected of having the goal of lowering prices,\" said an executive with a non-Chinese exchange in Asia, speaking at the same event.\nGLOBAL CLOUT\nThe current benchmark for pricing oil in Asia in the absence of a derivatives contract is the Dubai crude assessment, run by Platts, part of McGraw Hill Financial, where trading in a specified time-frame is used to assess a daily price.\nYet traders have been concerned at heavy trading by China's state-owned Chinaoil and Unipec, which pushed up Middle East grades even as other grades were being pressued lower, and left other companies struggling to take part.\nChina's largest independent refiner, Shandong Dongming Petrochemical Group, said it was one of the first companies to call for Chinese crude futures despite some concerns.\n\"We're concerned that the two big companies could be too strong in terms of financing,\" said Shandong Dongming director Zhang Liucheng. \"They're like aircraft carriers and we're just a small sampan (Chinese wooden boat).\"\nHaving a yuan-denominated contract could also limit the take-up of Shanghai's derivatives contract.\n\"I think it will initially mainly be used as a forex (foreign exchange) play between the dollar and yuan,\" said the head of trading with a major oil merchant.\nChina will still face competitors, including incumbent Platts, oil trading hub Singapore which is also keen to introduce a crude oil futures contract, and DME.\nAdditionally, regional animosity will be hard for China to overcome.\n\"We can participate in TOCOM (Tokyo Commodity Exchange). (There's) no reason to go to Shanghai,\" said Masashi Nakayama, general manager of the crude oil and tanker department at Japan's Cosmo Oil.\nBut many executives see the success of a China contract as a given, even if the take-up is gradual.\n\"One-by-one, the oil-majors will start to participate, then others will follow,\" said an executive with a Western oil major. \"While it might take some time to establish itself due to choppy markets and regulatory hurdles as well as the fact that it would introduce a foreign exchange element to crude futures, it is overdue for a Chinese contract to established.\"\n(Additional reporting by Florence Tan; Editing by Richard Pullin)", "external_links": [], "published": "2015-09-10T08:03:00.000+03:00", "crawled": "2015-09-10T07:41:07.674+03:00", "highlightTitle": ""}