{"organizations": [], "uuid": "43950a61508c42d8cad3c6cb4de5e26ebeaafe45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/h/h/x/m/image.related.afrArticleLead.620x365.gjhho3.png/1441678674290.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/equity-markets/broker-watch-westpac-mcmillan-shakespeare-crown-billabong-international-20150908-gjhho3", "country": "AU", "title": "Broker Watch: Westpac, McMillan Shakespeare, Crown, Billabong International", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Broker Watch: Westpac, McMillan Shakespeare, Crown, Billabong International | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T04:15:00.000+03:00", "replies_count": 0, "uuid": "43950a61508c42d8cad3c6cb4de5e26ebeaafe45"}, "author": "Will Willitts", "url": "http://www.afr.com/markets/equity-markets/broker-watch-westpac-mcmillan-shakespeare-crown-billabong-international-20150908-gjhho3", "ord_in_thread": 0, "title": "Broker Watch: Westpac, McMillan Shakespeare, Crown, Billabong International", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deutsche Bank said Westpac's update showed 'financial metrics are broadly in line with our forecasts, outside of the ROE target which is more aggressive than our current expectations\". Share on twitter by Will Willitts Deutsche Bank has a 'buy' recommendation on Westpac Banking Corporation (WBC) and a $34.65 target price.\nIn a note, Deutsche said WBC's cost targets were \"broadly in line\"and its ROE target \"presents upside\".\n\"Today's strategy update did not result in many surprises. WBC articulated its focus on service, and revealed an expanded investment spending program to deliver on this.\n\"While this additional spending (increase of ~20 per cent to $1.3bn p.a) is not a small amount, pleasingly this will be offset by a new productivity program in order to contain cost growth to 2-3 per cent p.a. in the near term, and to achieve a CTI ratio of sub-40 per cent within three years.\n\"Combined with this, management has also reiterated its ROE target of 15 per cent. These financial metrics are broadly in line with our forecasts, outside of the ROE target which is more aggressive than our current expectations. We maintain our Buy rating.\"\nCiti has a 'neutral' recommendation on Billabong International (BBG) and a $0.70 target price.\n\"Billabong reported a 0.6 per cent decline in constant currency sales and 1 per cent growth in constant currency EBITDA for FY15. The results mark a point of stabilisation after a number of years in decline. However, working capital is still high, systems and sourcing needs an overhaul and currency headwinds exist for FY16e. We retain a Neutral rating with a target price of $0.70.\"\n\"We lowered our EPS by 0.4 cents to 1.8 cents in FY16e. Our operating earnings revisions are modest. Billabong is making good progress with its turnaround. However, margin gains will be gradual and a lot of change is still ahead in terms of systems. We expect some challenges in 1H16 given margin pressure in Australia and slower sales in the Americas.\"\n Credit Suisse has a \"neutral\" rating on Crown Limited (CWN) and a $12.60 target price.\nThe investment bank writes that \"Crown's domestic casinos grew in the June half driven by strong mass market performance (Melbourne mass revenue +10.4 per cent vsp pcp, Perth +1.5 per cent). Costs were held tight. The outlook for VIP is positive as CWN has become more competitive, taking advantage of VIP tax adjustments in those jurisdictions.\n\"Macau continues to weigh on CWN's share price, despite a solid performance from domestic casinos and the implied value of those casinos screening as 'fair to cheap'. In late August, sell-side analysts cut MPEL (Melco Crown Entertainment) earnings for 2015 and 2016 coinciding with a drop in MPEL's share price. Although expectations are now more conservative, they still anticipate a strong EBITDA uplift with the first full year of Studio City (opening Oct 2015.)\n\"As recently as August, Macau gaming revenues were flattish on a sequential basis. We need growth to absorb new industry capacity. Given China's economic climate, we have not yet become confident that Studio City, a new casino, can deliver upon big market expectations\".\nCiti has a 'buy' recommendation on McMillan Shakespeare (MMS) and a $15.71 target price.\nCiti said that \"with the material regulatory volatility of FY14 behind them, MMS should continue to post solid organic growth numbers in both its remuneration services and asset finance businesses.\n\"MS's FY15 result was back to 'business as usual' and we expect FY16e to pleasantly surprise due to the annualisation of benefits from the Presidian and UFS acquisitions and a ~$2m catch-up from not having the 1H15 temporary contract suspension.\"\nBroker Watch: Brain Resources, ResMed, OZ Minerals, Karoon, Charter Hall\nBroker Watch: Rio Tinto, Incitec Pivot, CSL, Beadell Resources\nBroker Watch: QBE Insurance, Asia Pacific Digital, IOOF, Tap Oil\nBroker Watch: Myer, Cromwell Property, OceanaGold, CSR\nBroker Watch: TFS, Panoramic, Silver Lake Resources, Evolution Mining\nBroker Watch: iSelect, Nine Entertainment, Macquarie Atlas Roads, McAleese\nBroker Watch: Perpetual, Flight Centre, Vocus Communications\nBroker Watch: Independence Group, Toro Energy, Austal, Life Healthcare\nBroker Watch: BHP Billiton, Healthscope, Oil Search, nib Holdings\nBroker Watch: Beach Energy, Boart Longyear, GR Engineering, Tox Free Solutions\nBroker Watch: Mineral Resources, Mesoblast, Insurance Australia Group, Transpacific Industries\nBroker Watch: Western Areas, Mesoblast, AVJennings, Australian Bauxite\nBroker Watch: Ardent Leisure, Stockland, Woodside Petroleum, Alumina\nBroker Watch: ANZ Banking, Challenger, BlueScope Steel, GWA\n﻿ ﻿ Broker Watch: Newcrest, Aurizon, James Hardie, Automotive Holdings\nBroker Watch: Elders, South32, Peet, Sims Metal Management\nBroker Watch: News Corp, Metals X, Sirtex Medical, Mirvac\nBroker Watch: Commonwealth Bank, CSL, OZ Minerals, K2 Asset Management\nBroker Watch: National Australia Bank, REA Group, Sirius Resources, Beach Energy\nBroker Watch: Rio Tinto, Whitehaven Coal, Ten Network, Commonwealth Bank\nBroker Watch: Bendigo and Adelaide Bank, Downer EDI, Slater and Gordon, ANZ\nBroker Watch: JB Hi-Fi, Skilled Group, OFX, Shine Corporate\nBroker Watch: AVJennings, Western Areas, Westpac Banking, G8 Education\nBroker Watch: DUET, Brambles, Medusa Mining, Computershare, Suncorp\nBroker Watch: Virgin Holdings, NRW, Vocus Communications, carsales.com\nBroker Watch: Brambles, Tassal, NextDC, Elders\nBroker Watch: Sandfire Resources, Dacian Gold, Senex Energy, Bendigo and Adelaide Bank\nBroker Watch: Iluka Resources, Saracen Minerals, Northern Star, Corporate Travel\nBroker Watch: Navitas, OrotonGroup, Elysium Resources, insurance\nBroker Watch: Evolution Mining, Steadfast Group, Sims Metal, Energy Developments\nBroker Watch: Austbrokers, Fortescue Metals Group, Carnavale Resources, Valence Industries\nBroker Watch: Macquarie Group, BHP Billiton, South32, resources sector\nBroker Watch: Western Areas, Oil Search, Telstra, Evolution Mining\nBroker Watch: Saracen Minerals, Austal, Sonic Healthcare, Arrium\nBroker Watch: Decmil, Paladin Energy, Regis Resources, Universal Coal\nBroker Watch: Macquarie Group, Beadell Resources, Ramelius, Whitehaven Coal\nBroker Watch: Primary Health Care, Challenger, Mount Gibson Iron, Perpetual\nBroker Watch: BHP Billiton, Sedgman, Newcrest Mining, APA Group\nBroker Watch: Rio Tinto, Horizon Oil, Greencross, SEEK\nBroker Watch: CSR, Aristocrat Leisure, Northern Star\nBroker Watch: Iron ore majors, Aurelia Metals, Alcoa, Gryphon Minerals\nBroker Watch: Gold stocks, insurance sector, Incitec Pivot\nBroker Watch: Crown Resorts, Aurelia Metals, Orica, Amcor\nBroker Watch: Asciano, BlueScope Steel, James Hardie, Cue Energy\nBroker Watch: Energy sector picks, REA, PacBrands, Treasury Wine\nBroker Watch: James Hardie, Brambles, Recall Holdings, GPT Group\nBroker Watch: Air New Zealand, Scentre, Aurizon, Transurban Group\nBroker Watch: Wesfarmers, Myer, Sandfire Resources, Sydney Airport\nBroker Watch: Brambles, Arrium, Tabcorp, Monadelphous Group\nBroker Watch: Origin Energy, Flight Centre, iSelect, Dexus Property Group\nBroker Watch: Fletcher Building, IAG, BT Investment Management, CSR\nBroker Watch: Woolworths, CSL Ltd, Metcash, Scentre Group\nBroker Watch: Sydney Airport, Resmed, Challenger Financial, Arrium\nBroker Watch: TFS Corporation, Western Areas, NAB, Spark Infrastructure Group\nBroker Watch: Primary Health Care, Metcash, Ten Network, Sonic Healthcare\nBroker Watch: Cover-More, SCA Property Group, Telstra, Boral\nBroker Watch: Federation Centres, Rio Tinto, CBA, Alexium International\nBroker Watch: Goodman Group, QBE, Adelaide Brighton, Seven Group Holdings\nBroker Watch: Eclipx, Independence, Alumina, ANZ Banking\nBroker Watch: ERA, Mirvac, Qube, DUET\nBroker Watch: QBE, Goodman, Seven, TPG\nBroker Watch: Greencross, Qantas, South32, Woolworths\nBroker Watch: Mesoblast, APA Group, Recall, Iluka\nBroker Watch: AGL, AWE, Qube, Nine\nBroker Watch: Metcash, Fleetwood, Otto Energy, McPherson's\nBroker Watch: BHP, Newcrest, Yowie, REA\nBroker Watch: Virtus Health, CSL, Spotless, Crown\nBroker Watch: Slater & Gordon, UGL, Flight Centre, Sirtex\nBroker Watch: Ardent, BWP Trust, Domino's, DUET\nBroker Watch: AGL, ALS, Ramsay, DuluxGroup\nBroker Watch: Woodside, Adelaide Brighton, Programmed, Brambles\nBroker Watch: BHP Billiton, WorleyParsons, Telstra, St Barbara\nBroker Watch: Ramsay Health Care, WOW, Dulux, Spark ​", "external_links": ["https://twitter.com/WillWillAFR"], "published": "2015-09-09T04:15:00.000+03:00", "crawled": "2015-09-09T01:06:07.733+03:00", "highlightTitle": ""}