{"organizations": [], "uuid": "57e0d25241e5651415160b618d8d29341a5ad335", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-asia/?format=rss", "section_title": "Asian Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/europe-open-equity-markets-recover-092200693.html", "country": "US", "title": "Europe open: Equity markets recover from two days of losses", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Europe open: Equity markets recover from two days of losses", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T12:22:00.000+03:00", "replies_count": 0, "uuid": "57e0d25241e5651415160b618d8d29341a5ad335"}, "author": "", "url": "https://uk.finance.yahoo.com/news/europe-open-equity-markets-recover-092200693.html", "ord_in_thread": 0, "title": "Europe open: Equity markets recover from two days of losses", "locations": ["Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "84.06 0.00 \nLONDON (ShareCast) - (ShareCast News) - European stocks rose in early trade, bouncing back from two consecutive days of losses on the back of worries about a slowdown in China. At 0900 BST, the benchmark Stoxx Europe 600 index and France's CAC 40 were up 0.6%, while Germany's DAX was 0.7% firmer. \n\"Markets are calmer this morning, providing a slight reprieve for investors after the significant falls seen yesterday,\" said Rebecca O'Keeffe, head of investment at Interactive Investor . \"However, although Chinese markets are closed for the rest of the week, investors still face a high degree of uncertainty over the coming days. Friday's US employment report could be crucial to the Federal Reserve's decision whether or not to hike rates at its September meeting.\" O'Keeffe added: \"Despite recent market turbulence, the probability of a rate rise in September remains delicately poised at around 50%. Ahead of the long Labour Day weekend in the US, changes in this perceived probability could push the market violently in either direction. In corporate news, Alstom (Paris: FR0010220475 - news ) gained after a press report suggesting that General Electric is set to win European regulators' approval for its purchase of the French company's energy business. \nSwiss pharmaceutical company Novartis (Xetra: 904278 - news ) rose after announcing that it has formed a partnership with Amgen Inc (HKSE: 4332.HK - news ) to develop new drugs for Alzheimer's disease and migraines. \nIrish carrier Ryanair rallied after saying traffic grew 10% year-on-year to 10.4m customers, while the load factor, which measures how many seats were actually taken up on each flight, rose 2% to 95%. \nRetailer Tesco was in focus following media reports that it has chosen private equity firm MBK Partners as preferred bidder for its South Korean unit, Homeplus. \nIndustrial equipment rental firm Ashtead added gains after reporting better-than-expected first quarter pre-tax profits. \nStill to come on the economic calendar, Eurozone PPI is at 1000 BST. In the US, the ADP employment report is at 1315 BST, while industrial new orders are at 1500 BST.", "external_links": [], "published": "2015-09-02T12:22:00.000+03:00", "crawled": "2015-09-02T12:45:43.405+03:00", "highlightTitle": ""}