{"organizations": [], "uuid": "bd87eec36391d1f911a76625667cc6492a3c0764", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509212643.html", "country": "US", "title": "Uganda: Police Buy 4,000 Bikes to Monitor Elections", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Uganda: Police Buy 4,000 Bikes to Monitor Elections", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T16:30:00.000+03:00", "replies_count": 0, "uuid": "bd87eec36391d1f911a76625667cc6492a3c0764"}, "author": "", "url": "http://allafrica.com/stories/201509212643.html", "ord_in_thread": 0, "title": "Uganda: Police Buy 4,000 Bikes to Monitor Elections", "locations": ["Uganda"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrew Bagala"], "text": "By Andrew Bagala \nKampala — The police have procured 4,000 motorcycles to carry out patrols during the 2016 general election. \nPolice are moving away from the use of routine foot patrols and vehicles to motorcycles as the main patrolling systems. Police declined to reveal how much they spent on the motorcycles. \nNorth Korean military instructors are training police officers under the Field Force Unit, a police paramilitary, on how to manoeuvre the motorcycles as they carry out their patrols. The Inspector General of Police, Gen Kale Kayihura, said by December this year, all the 4,000 motorcycles will be fully operational. \n\"These officers on the motorcycles will be linked to police booths. I want visibility of officers on the ground to deter criminals,\" Gen Kayihura said. \nPolice are planning to establish a division (around 10,000 officers) to undertake the new policing patrol system. \nThe system is being experimented in Kampala Metropolitan Police with one regiment (800 officers) on the ground. \nIt is expected to be moved up-country by December. It's aimed at increasing mobility and visibility, which has been the biggest police problem due to limited manpower. \nThe main patrol vehicle has been a Toyota Land Cruiser 70 Series, which goes for Shs150m and carries not more than six officers. \nAt the same amount, the police would have 40 motorcycles that would carry eighty officers, and penetrate deeper into the suburbs. \nKampala Metropolitan Police spokesman, Mr Patrick Onyango, said a few squads have been deployed in some areas of the city centre. Uganda \nJust a few hours after the World Female Condom Day, a new panty- like female condom due to go on the market excited the … see more » Copyright © 2015 The Monitor. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-21T16:30:00.000+03:00", "crawled": "2015-09-21T17:21:36.099+03:00", "highlightTitle": ""}