{"organizations": [], "uuid": "477bce18ebd77ca0bbd9240f040baed7e0faa770", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=LPNT", "section_title": "Yahoo! Finance: LPNT News", "url": "http://finance.yahoo.com/news/lifepoint-health-selected-continue-improvements-181600615.html", "country": "GB", "title": "LifePoint Health selected to continue improvements in patient safety - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "LifePoint Health selected to continue improvements in patient safety - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "477bce18ebd77ca0bbd9240f040baed7e0faa770"}, "author": "LifePoint Health", "url": "http://finance.yahoo.com/news/lifepoint-health-selected-continue-improvements-181600615.html", "ord_in_thread": 0, "title": "LifePoint Health selected to continue improvements in patient safety - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BRENTWOOD, Tenn.--(BUSINESS WIRE)--\nLifePoint Health has been selected as one of 17 national, regional, or state hospital associations and health system organizations to continue efforts in reducing preventable hospital-acquired conditions and readmissions. Through the Partnership for Patients initiative – a nationwide public-private collaboration that began in 2011 to reduce preventable hospital-acquired conditions by 40 percent and 30-day readmissions by 20 percent – LifePoint will participate in a second round of Hospital Engagement Networks to continue working to improve patient care in the hospital setting. \n“We are delighted that LifePoint has once again been selected to continue our work as a Hospital Engagement Network,” said William F. Carpenter III, Chairman and Chief Executive Officer of LifePoint Health. “Our selection to participate in the second round of Hospital Engagement Networks reinforces the significant success LifePoint has achieved in improving quality and patient safety at our hospitals across the country. We look forward to furthering our efforts to develop and share innovative solutions with other hospitals nationwide.” \nSince the launch of the Partnership for Patients, the vast majority of U.S. hospitals and many other stakeholders have joined the collaborative effort and delivered results. The Department of Health and Human Services has estimated that 50,000 fewer patients died in hospitals and approximately $12 billion in health care costs were saved as a result of a reduction in hospital-acquired conditions from 2010 to 2013. Nationally, patient safety is improving, resulting in 1.3 million adverse events and infections avoided in hospitals since that time period. This translates to a 17 percent decline in hospital-acquired conditions over the three-year period. \nThe Partnership for Patients and the Hospital Engagement Networks are one part of an overall framework established by the Affordable Care Act to deliver better care, spend dollars more wisely, and improve care. Initiatives like the Partnership for Patients, Accountable Care Organizations, Quality Improvement Organizations, and others have helped reduce hospital readmissions in Medicare by nearly 8 percent between January 2012 and December 2013 – translating into 150,000 fewer readmissions – in addition to the quality improvements mentioned above. \n“We have made significant progress in keeping patients safe and we are focused on accelerating improvement efforts through collaboration and reliable implementation of best practices,” said Patrick Conway, M.D., CMS acting principal deputy administrator and chief medical officer. “This second round of Hospital Engagement Networks will allow us to continue to improve health care safety across the nation.” \nRound two of the Hospital Engagement Networks will continue to work to develop learning collaboratives for hospitals and provide a wide array of initiatives and activities to improve patient safety. They will be required to: conduct intensive training programs to teach and support hospitals in making patient care safer; provide technical assistance to hospitals so that hospitals can achieve quality measurement goals; and establish, implement, and improve the system to track and monitor hospital progress in meeting the Partnership for Patients’ quality improvement goals. The activities of the Hospital Engagement Networks will be closely monitored by CMS to ensure that they are generating results and improving patient safety. \nThe 17 organizations (listed in alphabetical order) receiving contracts in round two of the Hospital Engagement Networks are: \nAmerican Hospital Association; Ascension Health; Carolinas HealthCare System; Dignity Health; Healthcare Association of New York State; Health Research Education Trust of New Jersey; Hospital & Healthsystem Association of Pennsylvania; Iowa Healthcare Collaborative; LifePoint Health; Michigan Health and Hospital Association Health Foundation; Minnesota Hospital Association; Ohio Children’s Hospital Solutions for Patient Safety; Ohio Hospital Association; Premier Inc.; Tennessee Hospital Association; VHA-UHC Alliance NewCo Inc.; and Washington State Hospital Association. For more information on the Partnership for Patients and the Hospital Engagement Networks, please visit: partnershipforpatients.cms.gov . \nAbout LifePoint Health \nLifePoint Health ( LPNT ) is a leading healthcare company dedicated to Making Communities Healthier ® . Through its subsidiaries, it provides quality inpatient, outpatient and post-acute services close to home. LifePoint owns and operates community hospitals, regional health systems, physician practices, outpatient centers, and post-acute facilities in 20 states. It is the sole community healthcare provider in the majority of the non-urban communities it serves. More information about the company can be found at www.LifePointHealth.net . All references to \"LifePoint,\" \"LifePoint Health\" or the \"Company\" used in this release refer to affiliates or subsidiaries of LifePoint Health, Inc. www.LifePointHealth.net \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20150925005736/en/ \nHealth Care Industry patient care patient safety Contact: LifePoint Health\nDiane Huggins, 615-920-7651", "external_links": [], "published": "2015-09-26T03:00:00.000+03:00", "crawled": "2015-09-26T20:01:58.527+03:00", "highlightTitle": ""}