{"organizations": [], "uuid": "1c370263052de05fe68d0bd87c0ef6727fd7b22d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509280214.html", "country": "US", "title": "Zimbabwe: Geysers Are Not the Problem, Mr Mbiriri", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Geysers Are Not the Problem, Mr Mbiriri", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T10:53:00.000+03:00", "replies_count": 0, "uuid": "1c370263052de05fe68d0bd87c0ef6727fd7b22d"}, "author": "", "url": "http://allafrica.com/stories/201509280214.html", "ord_in_thread": 0, "title": "Zimbabwe: Geysers Are Not the Problem, Mr Mbiriri", "locations": ["Mbiriri Zimbabwe", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Airzim Crisis Mounts editorial \nThe announcement by the Secretary for Energy and Power Development Mr Partson Mbiriri that there is an imminent ban on electric geysers would be hilarious if it was not so tragic. He says technocrats are busy at work crafting legislation to make the possession of an electric geyser a criminal offence. \nThe justification for this bizarre move, Mr Mbiriri said, is because geysers consume 40 percent of domestic power. \nWe are not here to quibble with that statistic, but with the whole concept of ignoring the real issues to concentrate on things whose effectiveness and very feasibility is question- able. \nDo the bright sparks who came up with this proposal know the actual percentage of power that is consumed by geysers in Zimbabwe versus the statistics borrowed from places where they bother to invest in real research of such? \nAnother thing we would like to know from Mr Mbirimi and his team is whether they have ever bothered to check what percentage of electrified houses has functional electric geysers. \nDoes the real amount consumed by these geysers really justify the whole song and dance? \nThen how will this ban be enforced? Is there going to be a physical check of each house to ensure compliance? \nHow would these enforcers deal with the usual culprits who lock out utility workers trying to disconnect them for non-payment of bills? \nHas Mr Mbirimi and his colleagues considered the wastage of electricity through the heating of bath water through means such as open metal cans on stove tops? Unless they are making the ownership of solar geysers mandatory such power wastage will continue anyway. \nAre these solar geysers being made in Zimbabwe or are we going to import them? How much are they going to cost us? If we put that money towards increasing generation capacity what would we add to the grid? \nThis sounds like the proposed ban of imported electric cookers. Consumers buying new cookers today have no idea what to look for to evaluate energy efficiency. But in a couple of years they may be told that their gadget has become an illegal possession. \nWhile we acknowledge the need for the populace to be conscientised into saving electricity as far as possible, we think the technocrats in the ministry should be focusing on solving the real problem. \nAnd we believe the issue which is not limited to Zimbabwe but extends to the region and much of the continent has more to do with dedicated investment of resources into adequate power generation. \nRight now the blackouts that we are experiencing are not being caused by reckless consumers, but by lack of planning, something that Mr Mbiriri oddly enough seems to be aware of: \n\"We did not invest in the energy sector, in the power sector for many years. \n\"The last phase of Hwange was done in 1987. From 1987 until last year when we had Kariba Extension we did not invest any money in additional power generation,\" admitted Mr Mbiriri. \nWe would like to think that with diagnosis of the problem, solutions can be found. \nThe problem at Kariba Power Station where generation has been reduced due to low levels of water in the dam is what the ministry needs to focus on. \nClimate change is here and not in the future. In addition, with the predictions of below average rainfall for the region there is little hope for the levels to be any better next year during the same period. \nTherefore, as a country we should already be implementing a plan that tackles that problem instead of spending effort and resources on trivialities. \nWe have heard numerous announcements of plans to introduce alternative power generating solutions including solar projects. We believe that what the ministry should be looking at is implementing such plans instead of letting them gather dust in drawers. \nThe other problem that the country is facing is that of theft of power through illegal connections to the grid. There are farms where whole compounds are illegally connected to the power lines and no one seems interested in doing anything about it. Zimbabwe \nAFTER seeing off the challenge from former Vice-President Joice Mujuru in the brutal fight to succeed President Robert … see more » Copyright © 2015 The Herald. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-28T10:53:00.000+03:00", "crawled": "2015-09-28T11:32:45.941+03:00", "highlightTitle": ""}