{"organizations": [], "uuid": "c833abed80285858843ba0362717a32de303895a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/e0f0764b-36dc-4369-890d-9b85b8e74e13.img", "site_section": "http://www.ft.com/rss/personal-finance", "section_title": "Personal Finance", "url": "http://www.ft.com/cms/s/0/4134db62-5ad8-11e5-a28b-50226830d644.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "country": "US", "title": "Family feuds fuel rise in will disputes", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Family feuds fuel rise in will disputes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T19:43:00.000+03:00", "replies_count": 0, "uuid": "c833abed80285858843ba0362717a32de303895a"}, "author": "", "url": "http://www.ft.com/cms/s/0/4134db62-5ad8-11e5-a28b-50226830d644.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Family feuds fuel rise in will disputes", "locations": ["London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Adam Palin"], "text": "Family feuds prompt rapid escalation in will disputes Adam Palin ©AFP The Royal Courts of Justice in London \nFamily feuds over divisive legacies have set the number of will disputes soaring, with lawyers attributing the rise to surging property prices and second marriages. \nAccording to Ministry of Justice figures, the High Court heard 178 probate disputes in 2014, almost double the total of 97 in 2013, and the highest level in England and Wales since 2007. More Pensioners warned of ‘number spoofing’ fraud \nConsidering that only a tiny fraction of disputes reach the High Court, with the majority being settled beforehand, these figures are “just the tip of the iceberg” and indicative of a much larger rise in contested wills, said Andrew Wilkinson, partner at the law firm Shakespeare Martineau. \n“People increasingly expect and rely upon inheritances as they don’t make provision themselves for their own later years,” said Mr Wilkinson. \nRoughly three in four cases of disputed wills that cross his desk relate to families with complicated structures, he said. “I see lots of disputes between second spouses and children from different parents.” \n“There’s always much more chance of someone feeling aggrieved or left out in complex families,” said Daniel Winter, an associate solicitor at law firm Nockolds. \nMr Winter partly attributes the rise in disputes to soaring property values , particularly in London and the south-east, which he said has changed the economics of pursuing a claim. \nA full-blown court hearing will typically incur costs of £60,000 to £70,000, according to Mr Winter, so very few disputes relating to estates worth less than £300,000 go the distance. “With estate values rising, suddenly it’s worth it for many more of those looking to dispute,” he added. \nFinancial options for those looking to fund will disputes are also wider than they used to be, according to Mr Wilkinson. While litigation itself may not be getting any cheaper, more solicitors are offering services on a “no win, no fee” basis, he said, adding there is also a rise in the number of third parties who fund litigation in return for a cut of any proceeds gained. \nFamily battles over a legacy commonly arise from poorly drafted wills, Mr Wilkinson added.", "external_links": [], "published": "2015-09-16T19:43:00.000+03:00", "crawled": "2015-09-16T20:52:32.014+03:00", "highlightTitle": ""}