{"organizations": [], "uuid": "9b8e38c0ea5f140999f6f47578c74017ed5fb713", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/rupee-investment-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/personal-finance/investing-are-you-in-good-company/139255", "country": "IE", "title": "Corporate fixed deposits in demand, should you invest?", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Corporate fixed deposits in demand, should you invest? | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T08:06:00.000+03:00", "replies_count": 0, "uuid": "9b8e38c0ea5f140999f6f47578c74017ed5fb713"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/personal-finance/investing-are-you-in-good-company/139255", "ord_in_thread": 0, "title": "Corporate fixed deposits in demand, should you invest?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Delay in getting possession of house could have adverse tax consequences Banking on Technology Avoiding some mistakes that can keep your debt fund ‘safe’ Company fixed deposits of top-rated firms are much in demand because of volatile equity markets and rising expectations of a rate cut by the Reserve Bank of India. These deposits pay 50-150 basis points more than bank fixed deposits and are ideal for an investment horizon of 1-3 years. However, investors must exercise utmost caution and take an informed decision because, unlike bank deposits, a company can default on payment of interest and principal. Bank deposits provide security of up to an investment of Rs 1 lakh, which is not the case with corporate fixed deposits.\nAs the risk involved in company deposits are higher than bank FDs, the interest rates are generally higher. One must check the rating done by Crisil or Icra of the company before investing in the deposits. If the rating of the company is AAA, then it means it is a safe and secure investment. If the rating is lower, there could be risks involved. Even after investing, investors must check the ratings of the company regularly. One must analyse the financial statements, performance of the company and its management to take an informed decision. Analysts say investors must completely ignore the unrated companies and deposit schemes of little known manufacturing companies. For NBFCs, RBI has made it mandatory to have an ‘A’ rating to be eligible to accept public deposits.\nCompany deposits pay interest at monthly, quarterly or yearly intervals and income tax is deducted at source if the interest paid is over Rs 5,000 in a financial year. For bank deposits, TDS is only deducted if the interest income is over Rs 10,000 a year. Senior citizens — those who have completed 60 years on the date of deposit/renewal — get an additional interest rate of 0.25% per annum. The tenure of company deposits ranges from one to seven years and one can earn compounding interest by reinvesting the principal amount along with the interest earned. Investors can get direct ECS credit facility for interest payments or advance interest warrants for the year. However, unless one needs income regularly, they should prefer cumulative schemes to regular income options since the interest earned gets reinvested at the same coupon rate, resulting in better yields.\nMost issuers offer 75% of the investment amount as loan and the interest rate around 2% over the interest rate on the deposit. One can even go for premature withdrawal by paying a penalty. If one invests in a company that is low on ratings, go for a short tenure, which will enable you to opt out if the company is not performing well. However, in case of long-term investment, the investor will be stuck with the company if it defaults or goes bankrupt.\nCompanies that are registered under the Companies Act, 1956, such as manufacturing companies, non-banking finance companies, housing finance companies, financial institutions and government companies, can accept deposits. A non-banking non-finance company can accept deposits up to 10% of the aggregate of paid-up share capital and free reserves if the deposits are from shareholders or guaranteed by the directors. Manufacturing companies can mop up deposit for a period of six months to three years, NBFCs can accept deposit from a year to five and a housing finance company can accept deposit from one year to seven.\nAs company fixed deposits are unsecured loans, repayment of principal and interest are not guaranteed, and in case of any default or delay, investors have little recourse. If one invests in an unrated or low-rated deposit, the risks are high. Corporate deposits also carry default risk in case of large scale premature withdrawal by investors. Moreover, if the company is passing through a financial crisis, then it may default on payments. According to the provisions of Section 58-A of the Companies Act, 1956, if the company is winding up, it will give first preference of repayment to the equity shareholders rather than fixed deposit holders, which makes corporate deposits risky.\nAnalysts say investors should not put in money in a single company fixed deposit and, instead, diversify in four to five companies. Also, investors must avoid investing in those companies that mention very high interest rates and whose balance sheet shows losses.\n 22, 2015 12:06 am", "external_links": [], "published": "2015-09-22T08:06:00.000+03:00", "crawled": "2015-09-23T04:10:07.842+03:00", "highlightTitle": ""}