{"organizations": [], "uuid": "1204a9c894b71845677afdc4db28891474c576dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DV007_VW_cus_ZG_20150924101530.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.marketwatch.com/story/consumers-will-be-slow-to-forgive-volkswagen-deception-2015-09-24?siteid=yhoof2", "country": "GB", "title": "Consumers will be slow to forgive Volkswagen deception - MarketWatch", "performance_score": 0, "site": "marketwatch.com", "participants_count": 1, "title_full": "Consumers will be slow to forgive Volkswagen deception - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "1204a9c894b71845677afdc4db28891474c576dc"}, "author": "yahoo", "url": "http://www.marketwatch.com/story/consumers-will-be-slow-to-forgive-volkswagen-deception-2015-09-24?siteid=yhoof2", "ord_in_thread": 0, "title": "Consumers will be slow to forgive Volkswagen deception - MarketWatch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Volkswagen’s shares and reputation are being punished in the wake of revelations that the auto maker deliberately deceived customers. While heads may roll in the executive suite and the company scrambles to repair the damage, will the brand be able to recover? \nThe Environmental Protection Agency announced on Friday that Volkswagen VOW, +0.00% had installed a “defeat device” into its diesel vehicles, causing the cars to emit less nitrous oxide during testing. It was found that the affected vehicles were emitting 40 times the EPA standard outside of testing, and Volkswagen said Tuesday that 11 million cars world-wide could be affected.\n“I haven’t seen this level of deception since Arthur Andersen and the Enron days,” says Jonathan Bernstein, president of public-relations consultancy Bernstein Crisis Management. “That is what sets this apart.”\nHistory shows that for the most part, customers don’t seem to care about large-scale manufacturer mishaps.Even the obfuscation of the negative effects of smoking hasn’t toppled the tobacco industry, Bernstein says. However, the brand loyalty Volkswagen has worked so hard to cultivate may be what makes them the exception to the rule.\n“Consumer disappointment is directly related to expectation,” Bernstein says. Industries like tobacco have been able to survive because customers know what to expect. “People aren’t surprised by their negative behavior.”\nBut for Volkswagen, expectations had been high.\nSee also: Volkswagen lied to me when I bought my Jetta diesel \n“Consumers have a very short memory about these things,” says Jack Nerad, executive editorial director at Kelley Blue Book. “In this particular instance, Volkswagen buyers are a pretty loyal group in general…this is a bigger blow to them.”\nCar owner ambivalence has been proven time and again, in both situations involving deadly safety defects and skirting of EPA emissions regulations. The most recent cases of safety negligence include General Motors’ GM, -1.18% faulty ignition switch crisis and Toyota’s TM, -0.18% mass recalls for unintended acceleration. In both cases, the defects directly caused deaths, but sales were barely affected. \nThe GM ignition switch—which in older models of the Chevrolet Cobalt, the Pontiac G5 and other vehicles could slip into “off” mode and disable the air bags—has been linked to more than 120 deaths and led to the recall of more than 2 million cars in 2014. The auto maker settled the case for $900 million, or less than half of the company’s annual profit.\nIn an emailed statement, GM spokesman Alan Adler wrote that that the manufacturer had repaired about 75% of affected vehicles.\nDespite a year and a half of negative headlines and ongoing congressional investigations, GM reported a 6% increase in year-over-year sales for August 2015.\n“Even with those [safety] issues, even as they’re happening, they didn’t have a whole lot of effect on sales,” Nerad says.\nPrev Page 1 2 Next Page", "external_links": [], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T22:57:36.285+03:00", "highlightTitle": ""}