{"organizations": ["UK Economy With Tesco PLC", "MJ GLEESON PLC"], "uuid": "34d702adbfef8956941efbf8e97c75aa7957b995", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-construction-materials/?format=rss", "section_title": "Construction & Materials News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/ride-buoyant-uk-economy-tesco-133156822.html", "country": "GB", "title": "Should You Ride The Buoyant UK Economy With Tesco PLC, MJ GLEESON PLC ORD 2P And A FTSE 250 Tracker?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Should You Ride The Buoyant UK Economy With Tesco PLC, MJ GLEESON PLC ORD 2P And A FTSE 250 Tracker?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T16:31:00.000+03:00", "replies_count": 0, "uuid": "34d702adbfef8956941efbf8e97c75aa7957b995"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ride-buoyant-uk-economy-tesco-133156822.html", "ord_in_thread": 0, "title": "Should You Ride The Buoyant UK Economy With Tesco PLC, MJ GLEESON PLC ORD 2P And A FTSE 250 Tracker?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Sep 28, 2015, 20:01 BST - UK Markets closed Should You Ride The Buoyant UK Economy With Tesco PLC, MJ GLEESON PLC ORD 2P And A FTSE 250 Tracker? By G A Chester | Fool.co.uk – 5 hours ago 166.20 -1.25 \nData from the Office for National Statistics (ONS) on Wednesday is set to show that UK growth since the recession has been stronger than previously thought, the Sunday Times reported at the weekend. \nAnd with the ONS having also recently reported that real wages increased at the fastest pace in more than a decade in the three months to July, continuing recovery bodes well for companies with a high level of exposure to the UK economy. \nAs such, Tesco (LSE: TSCO), MJ Gleeson (LSE: GLE) and a FTSE 250 tracker could all deliver strong returns for investors. \nTesco \nTesco generated 70% of its revenue from the UK last year. In absolute terms, the £44bn that passed through its UK tills was more than that of Sainsbury's (£24bn) and Morrisons (£17bn) combined. \nTesco's UK focus is set to grow as it looks to strengthen its balance sheet by selling off international assets. The company has already agreed a sale of its South Korean business for £4bn, and has reportedly been in talks to dispose of its Polish, Hungarian, Czech and Slovakian operations, which could raise a further £3bn. \nThe cash raised from international asset sales should give Tesco boss \"Drastic Dave\" Lewis more freedom and firepower to be more radical in turning around the UK business. With Tesco's shares trading close to their 52-week low of 165p -- 34% off their 251p spring high -- earnings declines expected to bottom out this year, and an improving UK economy, now looks to be a good time to buy. \nMJ Gleeson \nSmall-cap housebuilder MJ Gleeson, which released its annual results this morning, has a market value of £250m at a share price of 467p. \nIf you think the big housebuilders did well last year, take at a look at Gleeson's numbers: revenue was up 44%, normalised earnings per share soared 99%, and the Board hiked the dividend by 67%. \nGleeson has a two-pronged strategy of building low cost homes in the north, and buying land, adding value and selling it on in the south. As a smaller company, Gleeson has scope for greater growth than larger peers, which should help it to outperform with the tailwinds of rising real incomes and the extension of the government's Help to Buy scheme to 2020. \nOn a trailing price-to-earnings ratio of 14, with excellent prospects, Gleeson looks an attractive investment. \nFTSE 250 tracker \nTesco's turnaround story and Gleeson's small size may not suit risk-averse investors. Indeed, they should form part of a well-diversified portfolio. For one-stop diversification and exposure to the UK economic recovery, a FTSE 250 tracker is an excellent option. \nThe FTSE 250 consists of the UK's next largest 250 companies after the FTSE 100. While the top index is packed with global giants, such as Shell , HSBC and GlaxoSmithKline , the FTSE 250 has considerably more exposure to the UK. Also, while the top five companies of the FTSE 100 make up 25% of the index, the FTSE 250 is markedly less top-heavy in its weightings. Familiar names at the top of the FTSE 250, such as Rightmove , Provident Financial and Auto Trader , each account for barely more than 1% of the FTSE 250. \nThere are plenty of FTSE 250 tracker funds around to choose from, including the popular stock-market exchange traded fund HSBC FTSE 250 Index . \nOf course, there are also many other opportunities in the market today. Depressed prices are a godsend for long-term investors looking to build wealth and a secure financial future. \nBuying low is just one way of enhancing your returns, but there are other ingredients to successful investing. That's why the Motley Fool's experts have published a straightforward step-by-step guide -- \" 10 Steps To Making A Million In The Market \". \nThis wealth guide is FREE to all readers and comes without obligation -- simply click here now for your copy. \nG A Chester has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-09-28T16:31:00.000+03:00", "crawled": "2015-09-28T22:02:23.920+03:00", "highlightTitle": ""}