{"organizations": [], "uuid": "9633a51a00f8cfb567aab15ba3bfb621c1a13adc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance-commerce.com", "main_image": "http://finance-commerce.com/files/2015/09/WEB-ADP-200x200.jpg", "site_section": "http://finance-commerce.com/feed/", "section_title": "Finance & Commerce", "url": "http://finance-commerce.com/2015/09/survey-businesses-added-jobs-at-solid-pace/", "country": "US", "title": "Survey: Businesses added jobs at solid pace", "performance_score": 0, "site": "finance-commerce.com", "participants_count": 1, "title_full": "Survey: Businesses added jobs at solid pace", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T20:58:00.000+03:00", "replies_count": 0, "uuid": "9633a51a00f8cfb567aab15ba3bfb621c1a13adc"}, "author": "The Associated Press", "url": "http://finance-commerce.com/2015/09/survey-businesses-added-jobs-at-solid-pace/", "ord_in_thread": 0, "title": "Survey: Businesses added jobs at solid pace", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apartment Sales Tracker Home / Nation & World / Survey: Businesses added jobs at solid pace A help wanted sign is posted June 9 at a tractor dealership in Ashland, Virginia. Payroll processor ADP reported Wednesday that businesses added 200,000 jobs in September. (AP file photo) Survey: Businesses added jobs at solid pace By: The Associated Press September 30, 2015 12:58 pm 0 \nWASHINGTON — Buoyed by strong consumer spending and steady home sales, U.S. businesses added jobs at a healthy pace in September, according to a private survey. \nPayroll processor ADP said Thursday that employers added 200,000 jobs this month, up from 180,000 in the previous month. August’s job total was revised lower. \nAmericans are spending more freely and buying big-ticket items such as new cars and homes. That is countering weak economies overseas and the strong dollar, which are cutting into exports. \n“The overall labor market continues to improve, with domestic strength offsetting foreign weakness,” Jim O’Sullivan, chief U.S. economist at High Frequency Economics, said in a note to clients. \nThe government will issue its official jobs report for September on Friday. Economists forecast that report will show that employers added 206,000 jobs, and the unemployment rate held at 5.1 percent for the second straight month. \nThe ADP survey covers only private businesses and frequently diverges from the official figures. \nThe report also illustrated the U.S. economy’s weak spots: Manufacturing cut 15,000 jobs, the most in five years, as large manufacturing firms such as Caterpillar have suffered in the wake of slow growth in China and other emerging markets, such as Brazil. \nMark Zandi, chief economist at Moody’s Analytics, which compiles the ADP data, said oil and gas drilling firms are also shedding jobs because of the monthslong drop in oil prices. \nConstruction companies added 35,000 jobs, ADP said, the most since the housing bubble burst in 2006. Retail, transportation and utilities companies added 39,000. \nSteady job gains are bolstering consumer confidence and have boosted the housing market. Sales of existing homes reached an eight-year in July before slipping in August, and new-home sales are at a seven-year high. \nThat has encouraged more homebuilding: Developers started construction on 11 percent more homes in the first eight months of this year than at the same point in 2014. Share this:", "external_links": [], "published": "2015-09-30T20:58:00.000+03:00", "crawled": "2015-09-30T21:59:40.206+03:00", "highlightTitle": ""}