{"organizations": [], "uuid": "f9025e2befeb342d2b3dbd62894987a5c8e3e6c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wiley-vch.de", "main_image": "", "site_section": "http://www.wiley-vch.de/books/rss/en/FI00.xml", "section_title": "Wiley-VCH - Finance & Investments", "url": "http://www.wiley-vch.de/publish/en/books/ISBN978-1-118-98960-9", "country": "", "title": "The Next Revolution in our Credit-Driven Economy", "performance_score": 0, "site": "wiley-vch.de", "participants_count": 1, "title_full": "The Next Revolution in our Credit-Driven Economy", "spam_score": 0.0, "site_type": "news", "published": "2015-09-07T09:18:00.000+03:00", "replies_count": 0, "uuid": "f9025e2befeb342d2b3dbd62894987a5c8e3e6c0"}, "author": "Schulte, Paul", "url": "http://www.wiley-vch.de/publish/en/books/ISBN978-1-118-98960-9", "ord_in_thread": 0, "title": "The Next Revolution in our Credit-Driven Economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "E-Books are also available on all known E-Book shops. Short description The Next Revolution in our Credit-Driven Economy integrates market theory and practice to help investors identify growth opportunities, and to help regulators create a sustainable economic environment. By unbundling how credit markets work, this authoritative guide provides insight into crisis avoidance and detection, successful investment climates, and the groundwork that must be in place for policy makers to build a sound basis for economic growth. Clear, succinct case studies provide examples of policy's effects on economic stability, giving you a stronger understanding of the network of forces that determine how loan/deposit ratios behave around the world.* Dive deep into the mechanisms underlying the credit markets* Learn how unregulated borrowing leads to socioeconomic crises* Examine real-world policy options through global case studies* Discover how credit rises are best detected and avoidedThe Next Revolution in our Credit-Driven Economy gives you a more informed look at where the world needs to begin changing. From the contents Acknowledgments xviiAbout the Author xixAbout the Website xxiIntroduction: A Few Numbers Can Crack the Code xxiiiPART ONE How Bank Credit Drives Economics (Not the Other Way Around) and WhyCHAPTER 1 A Few Simple Concepts That Anyone Can Understand 3CHAPTER 2 Differences between Liquidity and Solvency Are Thin 23CHAPTER 3 Anatomy of a Credit Crisis and Examples in the Real World 33PART TWO I Am from the Government, and I Am Here to Help Your Broken Banking SystemCHAPTER 4 Socialization of Debt after Mismanagement by Bankers (or, Why Keynesian Economics Doesn't Work) 55CHAPTER 5 Why Capitalist Bankers Create Soviet Banking Models When the Going Gets Rough 75CHAPTER 6 Central Banks Are Carrying the Greatest Load and Will Dominate Outcomes 89CHAPTER 7 How Bankers and Policy Rescuers Affect Stocks, Foreign Exchange, and Property 103PART THREE InterludeCHAPTER 8 Why Government and Institutions Get Suckered into Debt Binges 119PART FOUR The Revolution in Financial ArchitectureCHAPTER 9 Why Is This Revolution Happening Now and Why So Fast? 135CHAPTER 10 The Revolution in Alternative Investments 145CHAPTER 11 The Revolution in Big Data and SME Lending in the Emerging World 157CHAPTER 12 Banking and Analytics--The PayPal Gang, Palantir versus Alibaba, and Hundsun 177Appendix 195Bibliography 197Index 199", "external_links": [], "published": "2015-09-07T09:18:00.000+03:00", "crawled": "2015-09-08T06:46:02.406+03:00", "highlightTitle": ""}