{"organizations": [], "uuid": "433ef294663a6792e63aedb36f4759e7c56afa86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-23/bank-regulators-set-for-london-showdown-on-too-big-to-fail-fix", "country": "US", "title": "Bank Regulators Set for London Showdown on Too-Big-to-Fail Fix", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Bank Regulators Set for London Showdown on Too-Big-to-Fail Fix - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T07:01:00.000+03:00", "replies_count": 0, "uuid": "433ef294663a6792e63aedb36f4759e7c56afa86"}, "author": "John Glover", "url": "http://www.bloomberg.com/news/articles/2015-09-23/bank-regulators-set-for-london-showdown-on-too-big-to-fail-fix", "ord_in_thread": 0, "title": "Bank Regulators Set for London Showdown on Too-Big-to-Fail Fix", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Divided global bank regulators are preparing for a showdown on rules intended to make sure taxpayers won’t be on the hook when one of the world’s biggest lenders fails.\nThe Financial Stability Board holds a plenary meeting in London on Sept. 25 to finish work on total loss-absorbing capacity , or TLAC. Nations such as the U.S. and Germany, which are pushing for the toughest possible rules, are pitted against Japan, France and others that prefer a softer line, according to three people with knowledge of the matter, who asked not to be identified because the talks are private.\nWhichever camp prevails, it may be deposit-reliant behemoths such as JPMorgan Chase & Co. and Wells Fargo & Co., rather than risk-addicted investment banks, that get hit the hardest. Some analysts view that as an incongruous result, given that the FSB was created by the Group of 20 nations six years ago to help stamp out the “ reckless behavior ” by banks that led to the financial crisis.\nThe FSB’s draft rules on TLAC require lenders to have capital and debt equivalent to at least 16 percent to 20 percent of their risk-weighted assets available to take losses. If the final number is at the low end of that range, most of the world’s biggest banks would have little trouble complying. A top-end number would force many lenders -- especially those most dependent on deposits for funding -- to issue billions of dollars of new debt, according to analysts.\n“The big deposit-funded institutions may have to issue more bonds than they would like to,” said Robert Montague, a credit analyst at ECM Asset Management in London. “It’s one of the perverse outcomes of this regulation.”\nNet Shortfall While a compromise has been proposed, one of the people familiar with the talks said a decision in London is far from certain and the FSB may have to ask G-20 leaders to resolve the dispute.\nAssuming the TLAC requirement is set at 20 percent, JPMorgan and Wells Fargo will have to issue the most securities to reach the goal -- about $85 billion and $65 billion, respectively, according to Paul Smillie, a Singapore-based credit analyst at ColumbiaThreadneedle. Analysts at CreditSights in New York put the net shortfall at both banks at about $50 billion.\nWholesale-funded trading firms such as Goldman Sachs Group Inc. and Morgan Stanley are already where they need to be, Smillie said.\nHSBC Holdings Plc has a shortfall of more than $44 billion if the requirement is set at the top of the range, according to an Aug. 24 presentation on its website. That’s largely because the lender’s Hong Kong unit would need to issue $26.6 billion of new debt. While setting the requirement at 16 percent reduces the group shortfall to $12.6 billion, compliance would still cost as much as $300 million a year, the bank said.\nLoan Books While depositors left their money in JPMorgan, HSBC and Wells Fargo, allowing them to get through the 2008 crisis largely unscathed, Goldman Sachs and Morgan Stanley struggled to survive as institutions dumped their debt. Yet aspects of the TLAC rules are particularly tough on the deposit-taking banks with large loan books.\nIn addition to the requirement tied to risk-weighted assets, an Aug. 24 draft of the TLAC rules proposes a leverage-ratio requirement of 6 percent, or twice the minimum leverage ratio set by the Basel Committee on Banking Supervision. The leverage ratio, intended as a backstop for risk-sensitive capital standards, is calculated by dividing a bank’s Tier 1 capital by total consolidated assets, expressed as a percentage and taking no account of risk.\nThe draft rules also state that the sum of a bank’s “tier 1 and tier 2 regulatory capital instruments in the form of debt liabilities plus other eligible TLAC that is not also eligible as regulatory capital” should be at least 33 percent of its minimum TLAC requirement.\nLeverage Ratio In its response to the FSB’s proposal, HSBC expressed concern that “banks which have genuinely low risk balance sheets may be prejudiced by the use of the leverage ratio as a metric to determine TLAC.”\n“These banks are already disadvantaged by the leverage regime which forces them to hold more capital than is economically warranted,” HSBC said. “They will suffer again under the TLAC regime. Often deposit-funded, they are required to raise capital and loss-absorbing capacity which they do not need for the underlying risks which they hold.”\nHSBC had $1.34 trillion of deposits as of June 30, according to data compiled by Bloomberg. JPMorgan’s deposits stood at $1.29 trillion, while Wells Fargo had $1.19 trillion.\nThis strength in deposits helped banks like JPMorgan and Wells Fargo survive the financial crisis in relatively good shape, and their credit ratings bear this out, even though the ratings companies have had to reshape their methodologies as regulators sought to eliminate the implied state subsidy for too-big-to-fail banks. Both banks are among the highest-rated in developed economies.\nSenior Debt Smillie of ColumbiaThreadneedle said that if the FSB “plumps for 20 percent,” the U.S. and Asian banks will be the losers. HSBC and Standard Chartered Plc can be viewed as Asian banks, given the nature of their businesses, he said.\nThe biggest European universal banks may be less affected by the demands because governments, including those of Germany and Italy, are pushing through legal changes that will allow their existing senior debt to be used to satisfy regulators’ demands.\n“For the Europeans, if they manage to adopt legislation that allows the current stock of senior to count, then there is very little net new issuance to do,” he said. “Most major European banks are there or thereabouts already.”\nEven the lenders with the most to do will be given time to issue the necessary debt, meaning the process shouldn’t be too disruptive, said Steve Hussey, an analyst at AllianceBernstein in London. The FSB has said the requirement won’t be in force earlier than 2019. A phase-in period has also been proposed.\n“The point is that there will be a transition period,” said Hussey. “Yes, if you tell them to do it right now, you get some enormous numbers. But most banks are already close to 16 percent and, while there are clearly going to be some with a lot of issuance to do, the transitional period should make it fairly straightforward.”", "external_links": ["https://g20.org/wp-content/uploads/2014/12/Pittsburgh_Declaration_0.pdf\\", "http://www.financialstabilityboard.org/2015/09/fsb-to-meet-in-london/\\", "http://www.financialstabilityboard.org/wp-content/uploads/TLAC-Condoc-6-Nov-2014-FINAL.pdf\\", "http://www.hsbc.com/investor-relations/events-and-presentations\\", "http://www.bis.org/publ/bcbs270.pdf\\", "http://www.financialstabilityboard.org/\\", "http://www.financialstabilityboard.org/wp-content/uploads/r_141106b.pdf\\", "http://www.financialstabilityboard.org/wp-content/uploads/HSBC-on-TLAC.pdf\\"], "published": "2015-09-24T07:01:00.000+03:00", "crawled": "2015-09-24T10:43:50.942+03:00", "highlightTitle": ""}