{"organizations": [], "uuid": "65bdf2e46775f5dcf47db9aa6b7f49c0a55ae4e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/6/2/z/d/image.related.afrArticleLead.620x365.gjf4f0.png/1441350006115.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/australia-considers-more-bombs-not-more-aid-for-syria-20150904-gjf4f0", "country": "AU", "title": "Australia considers more bombs, not more aid, for Syria", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Australia considers more bombs, not more aid, for Syria | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T15:00:00.000+03:00", "replies_count": 0, "uuid": "65bdf2e46775f5dcf47db9aa6b7f49c0a55ae4e7"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/politics/australia-considers-more-bombs-not-more-aid-for-syria-20150904-gjf4f0", "ord_in_thread": 0, "title": "Australia considers more bombs, not more aid, for Syria", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Julie Bishop may be pondering if more Operation OKRA is needed to defeat IS; \"resorting achieve some form of peace\". by Geoff Winestock and Tess Ingram Under pressure to provide more aid to the refugee crisis engulfing Europe, the Abbott government isn't budging from its Middle East strategy of fighting Islamic State with bombs.\nForeign Minister Julie Bishop left the option open to take more refugees from Syria and said the Department of Immigration was considering the issue. But she said Australian shouldn't increase its humanitarian assistance.\nAs the photo of a Kurdish-Syrian toddler washed up on a beach in Turkey drew international attention to the plight of refugees trying to escape to Europe, Ms Bishop said Australia had contributed $155 million to the region since the start of the war four years ago and called on the rich Gulf states to do more.\n\"It is not as simple as saying Australia must provide more aid. That is simplistic. This is a global issue that requires a global response and the lead must be taken by the countries directly affected in the region,\"Ms Bishop said.\nWith the Australian government considering bombing Islamic State in Syria as well as Iraq, a former chief of the Australia Defense Force said the expansion could make the refugee crisis worse.\n\"If we escalate the air war, there are undoubtedly going to be more civilian casualties,\" Peter Gration told the ABC. \"There'll be more refugees generated.\"\nThe Labor opposition wants the government to provide more aid to victims of the Syrian civil war. A report last year by the Department of Foreign Affairs said Australia's contribution had failed to keep pace with the crisis.\nAgriculture Minister Barnaby Joyce has said Australia should take more Syrians. Ms Bishop said the key to ending the flow of refugees was defeating Islamic State, one of several Islamist factions fighting the Syrian government.\n Defeat IS to restore some peace \"If we were able to defeat [Islamic State] and it was no longer able to carry out its barbaric terrorist attacks then it would be a step towards restoring some kind of peace in Syria and people would no longer wish to leave,\" Ms Bishop said.\nAn evaluation report for the Department of Foreign Affairs and Trade in September found that despite the worsening of the crisis the Abbott government had cut humanitarian assistance to the region by about 60 per cent to $27 million a year in 2014.\n\"Australian funding has not been sufficiently predictable nor have funding levels kept pace with needs resulting from the escalation in the crisis,\" the report said.\nRichard Marles, shadow immigration spokesman, proposed increasing funding to the United Nations High Commission for Refugees and doubling the number of refugees brought to Australia under the humanitarian refugee program.\nThe Labor opposition has proposed raising funding to the UNHCR for activities in the Middle East to about $75 million a year. He said Prime Minister Tony Abbott's suggestion that the answer to the Syrian refugee crisis was to follow Australia's example and turn back boats was \"gratuitous advice that the Europeans treat as a joke.\"\nMs Bishop has previously attacked Labor's focus on humanitarian aid and accused the opposition of wanting to send hampers for a \"terrorist picnic.\"\nThe DFAT report said Australia under Ms Bishop had played a crucial role at the United Nations in winning support for a motion authorising humanitarian aid inside Syria even without permission of the Syrian government.\nDespite the Syrian crisis, in 2013-14 Australia granted about 11,000 humanitarian visas with only about 4,000 going to people from the Middle East.\nVache Kahramanian, executive director of the Armenian National Committee for Australia, said Australia was painfully slow in granting visas to the 100,000 ethnic Armenians trapped in Syria or displaced to nearby countries.\nHe said only about 20 Armenian families had come here. \"The number has been extremely low compared to what other countries are doing,\" he said.", "external_links": [], "published": "2015-09-04T15:00:00.000+03:00", "crawled": "2015-09-04T10:50:03.245+03:00", "highlightTitle": ""}