{"organizations": [], "uuid": "9d6d7ad403d79b25afe4c2fb5f9b00176e7c926f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509281423.html", "country": "US", "title": "Nigeria: Nigeria Takes Leadership Slots in Telecoms Business", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Nigeria Takes Leadership Slots in Telecoms Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T13:36:00.000+03:00", "replies_count": 0, "uuid": "9d6d7ad403d79b25afe4c2fb5f9b00176e7c926f"}, "author": "", "url": "http://allafrica.com/stories/201509281423.html", "ord_in_thread": 0, "title": "Nigeria: Nigeria Takes Leadership Slots in Telecoms Business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria Takes Leadership Slots in Telecoms Business Tagged: Nigeria: Kebbi Chief Judge Killed in Saudi Stampede \nNigeria's globally acclaimed position as the fastest growing telecoms market in Africa and the world, following its over 150 million active subscriber number, is beginning to play up in the African telecoms ecosystem, as the country takes full leadership control of the Commonwealth Telecommunication Organisation (CTO), writes Emma Okonji \nLast Week's investiture of Nigeria's Shola Taylor as Secretary General/Chief Executive of the 54-member nation Commonwealth Telecommunications Organisation (CTO), which Nigeria belongs to, coupled with the election of the Acting Executive Vice Chairman of the Nigerian Communications Commission (NCC), Prof. Umar Garba Danbatta, as the Chairman of CTO on the same day, speaks volumes of Nigeria's global recognition as a country to look up to in the area of telecoms growth and development. \nTaylor, who took over from Prof. Tim Unwin, whose tenure expired last week, was elected into the adorable position in London, United Kingdom, on June 16, 2015. \nWith over 150 million active telephone lines, mobile Internet users of over 90 million, coupled with over $32 billion local and foreign direct investment (FDIs), Nigeria's telecoms sector has become a reference point in the global telecoms landscape. \nA tech-based research firm, Pyramid Research, had rated Nigeria as having one of the fastest telecoms sector, with an annual growth rate of 30 per cent. \nWhile teledensity has reached a peak level of 107 per cent in 2015, up from less than one per cent in 2001, the country is not relenting in achieving more goals, as it plans to further boost the growth level in the telecoms space, through its broadband policy implementation, which is expected to be an enabler of faster economic development. \nIn the National Broadband Plan, the country has set a 30 per cent broadband penetration target to be achieved by 2018 up from the six per cent penetration recorded in 2013. Broadband penetration currently stands at 10 per cent. \nThere is no gain-saying that the achievements of Nigeria in the telecoms sector within few years, coupled with her efforts to achieve more milestones, are indeed attracting global recognition to Nigeria, the most populous African country. \nNCC's Regulatory Roles \nMeanwhile, the conducive regulatory regime provided by the telecoms regulator, the Nigerian Communications Commission (NCC), has been recognised locally and internationally as one of the key factors to the accelerated growth being recorded in the nation's telecoms market today. \nAlready, a number of telecoms regulators from across African countries have also, at one time or the other, come to understudy the NCC. This feat has also propelled Nigeria to leadership position in some regional and International telecoms organisations such as the Commonwealth Telecommunications Organisation (CTO), where Nigeria recently took over the leadership position. \nNCC as Driver of CTO \nThe 54-member nations of the CTO rose from its yearly Forum and Council meeting held last week in Nairobi, Kenya with the election of Prof. Umar Garba Danbatta, the acting Executive Vice Chairman of the NCC as the new Chairman of the commonwealth body, a position held by the former NCC boss, Dr. Eugene Juwah, until last week. \nChairmanship of the CTO, by its rules, is usually country-specific and the position is held by that country's chief telecoms regulator. Nigeria won the position in 2014 and by last week's election, the first tenure ended and another began. \nSide by side with the election of Danbatta was the resumption of Nigeria's Shola Taylor as the Secretary General and Chief Executive of CTO. \nTaylor was named Secretary General on June 16, 2015 in London, United Kingdom, through an election, which he transparently won and subsequently took oath of office during the opening of the CTO Forum 2015 held last week in Nairobi, Kenya. \nThe oath ceremony took place in the presence of over 400 participants, including representatives of over 30 member countries who attended the forum which took place on September 16 - 17, 2015. \nGreater Responsibility \nWith the re-election of Nigeria to the Chairmanship and Secretary General positions the country has effectively taken control of the affairs of the close-knit CTO and the country would be expected to be a major force in championing telecoms development, not only in its homeland but also deploys an Afro-centric approach to its regulation. \nAlready, Dambatta after assuming office had thanked member nations for the honour done to Nigeria and promised to provide visionary leadership that would take CTO to the next level. \n\"We would continue to play greater role in telecoms regulations and policies by putting general commonwealth telecoms development agenda at the front burner,\" he said. \nDanbatta also commended the immediate past Secretary General, Prof. Tim Unwin, for his dedication to duty, which he said, had positively impacted on member nations towards engendering increased collaboration for wider access to telecoms services. \nOn the administrative activities, Danbatta said that Taylor's 35 years' experience as a consummate and well-groomed engineer will be put to bear on the activities of CTO, saying it is hoped that Taylor \"will translate many of those pending decisions to actions in the days ahead thereby taking the CTO to the next level, providing visionary leadership in the process.\" \nThe Assurances \nSpeaking at the last week's oath taking ceremony, Taylor assured the 54-member nation Commonwealth Telecommunications Organisation of his readiness to work with necessary stakeholders towards making a difference in the telecoms landscape among the commonwealth nations. \nAccording to him, \"I feel a high sense of responsibility to take this organisation to greater heights. It is indeed a big challenge and I am all set to build on the foundations of my predecessors. I did not take this job just to be seen talking. I want to make a difference and plant a new ICT tree at the CTO.\" \nMore specifically, Taylor said he was determined to make a difference for all member countries in a number of areas such as mobile and amateur issues; science issues; aeronautical; maritime and radiolocation issues; fixed-satellite service; mobile-satellite service as well as satellite regulatory issues. \nHe promised to leverage on his robust national, regional and international experiences to unleash greater development in the member nations in the next one year. \nTaylor's Biodata \nBefore his appointment as the Secretary General of CTO, Taylor has been the Chief Executive of Kemilinks International, a global ICT Consultancy firm based in Lagos, Nigeria. \nA telecommunications engineer by training, he brings his over 35 years of global telecommunications experience in ICTs with government and the private sector to CTO. He has consulted for several blue chip companies in Nigeria and the global ICT communities. \nFrom 1994 and 1999, Taylor served as Regional Director of Inmarsat. He also served as Space Technology coordinator for developing countries at the International Telecommunication Union (ITU) from 1993 to1994. He had earlier served as Project Director at ITU from 1987 to 1993. \nA New Collaboration \nMeanwhile, representing the International Telecommunications Union (ITU), its Deputy Secretary-General, Malcolm Johnson, expressed the readiness of the Union to collaborate with the CTO to advance the development of Information and Communications Technologies (ICTs) throughout the commonwealth nations. \nHe expressed full confidence in the ability of Shola Taylor, who early in the year, narrowly missed being the Secretary-General of ITU, to lead the organisation successfully and wished him well. \nStakeholders' Views \nAccording to stakeholders in the Nigeria's telecoms sector, the new leadership mantle bestowed on the country was a justification of the confidence and belief the member nations have in the Nigeria's telecoms regulatory prowess, which, they said, had positioned the country as a force to reckon with in the global telecoms stage. \nPresident of the Association of Telecoms Companies of Nigeria (ATCON), Mr. Lanre Ajayi, said over the years, Nigeria had been playing noticeable role in the development of telecoms market in the African continent. \"We have liberalized the sector and allowed more players to come into the market to play under good regulatory regime and this has deepened competition, which is good for the end users,\" Ajayi said. \nHe explained that Taylor's rich experience would certainly impact positively on the CTO with Nigeria benefitting from this current position. \nAlso, a telecom analyst and Chief Executive Officer of AAA Infotek, Mr. Akin Akinbo, said Nigeria's current position at CTO further reinforced its prominent role in instilling robust telecoms regulation at home and its ability to propel the needed growth in the commonwealth nations. \nPresident, Association of Licensed Telecoms Operators of Nigeria (ALTON), Mr. Gbenga Adebayo, said: \"This new status of Nigeria, taking full control of CTO leadership is something that we think will impact generally on commonwealth nations as they tap into the regulatory skills of Nigeria and specifically on Nigeria where the country is able to benefit from expected global collaboration with CTO.\" \nExperts views have it that the current status of Nigeria, being at the helm of affairs of CTO, would spur the country and the leadership of NCC to strive for even greater achievements. \nThe experts have lauded the election of Taylor, and have tasked the leadership to explore more on how the commonwealth region can effectively take a front position in the use of broadband and other ICT tools for socio-economic transformation. Nigeria \nAt least 54 Nigerians perished in Thursday's stampede in Saudi Arabia, in which over 717 pilgrims from around the world, … see more » Copyright © 2015 This Day. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-28T13:36:00.000+03:00", "crawled": "2015-09-28T15:19:50.979+03:00", "highlightTitle": ""}