{"organizations": [], "uuid": "810cab9eaeecd75f0cc7562f232c5a6d424eb1df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.finyear.com", "main_image": "http://www.finyear.com/var/style/logo.jpg?v=1331908817", "site_section": "http://www.finyear.com/xml/syndication.rss", "section_title": "Journal quotidien finance : gestion, innovation, FinTech, disruption | Financial all the year", "url": "http://www.finyear.com/FY360--Decentralized-Blockchain-Technology-and-the-Rise-of-Lex-Cryptographia_a33721.html", "country": "FR", "title": "FY360° | Decentralized Blockchain Technology and the Rise of Lex Cryptographia", "performance_score": 0, "site": "finyear.com", "participants_count": 1, "title_full": "FY360° | Decentralized Blockchain Technology and the Rise of Lex Cryptographia", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T08:00:00.000+03:00", "replies_count": 0, "uuid": "810cab9eaeecd75f0cc7562f232c5a6d424eb1df"}, "author": "Finyear, Quotidien Finance d'Entreprise", "url": "http://www.finyear.com/FY360--Decentralized-Blockchain-Technology-and-the-Rise-of-Lex-Cryptographia_a33721.html", "ord_in_thread": 0, "title": "FY360° | Decentralized Blockchain Technology and the Rise of Lex Cryptographia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FY360° | Decentralized Blockchain Technology and the Rise of Lex Cryptographia Just as decentralization communication systems lead to the creation of the Internet, today a new technology — the blockchain — has the potential to decentralize the way we store data and manage information, potentially leading to a reduced role for one of the most important regulatory actors in our society: the middleman. articles liés FY360° | Is the Uber of Finance the Blockchain? Blockchain technology enables the creation of decentralized currencies, self-executing digital contracts (smart contracts) and intelligent assets that can be controlled over the Internet (smart property). The blockchain also enables the development of new governance systems with more democratic or participatory decision-making, and decentralized (autonomous) organizations that can operate over a network of computers without any human intervention. These applications have lead many to compare the blockchain to the Internet, with accompanying predictions that this technology will shift the balance of power away from centralized authorities in the field of communications, business, and even politics or law... More: FY360° by Finyear, la revue de presse à 360° en finance-gestion d'entreprise & finance d'affaires. FY360° by Finyear a pour mission de vous faire gagner du temps et de vous tenir informés. Notre équipe suit les actus pertinentes, les organise, créé un lien vers les sources originales et vous les communique sur le site Finyear et dans la newsletter quotidienne. FY360° by Finyear n'est pas un produit fini : faites-nous savoir ce que vous en pensez et si vous avez une suggestion, une remarque, ou une source que nous devrions suivre, écrivez-nous . FY360° by Finyear (ex Financial Year Links) is a Finyear service on a mission to save you time and keep you smart. Our team follows the relevant news, summarize it, link to the original sources and deliver it on the Finyear website and in the daily newsletter. FY360° by Finyear is not a finished product: please let us know what you think and if you have a suggestion, a complaint, or something we should link to, email us . Vous souhaitez vous joindre à la “Blockchain Revolution” ? Explorez le futur de la finance, des transactions, de la réputation et de la confiance. Participez à notre forum dédié BLOCKCHAIN Les médias du groupe Finyear Lisez gratuitement :", "external_links": [], "published": "2015-09-04T08:00:00.000+03:00", "crawled": "2015-09-04T09:10:10.625+03:00", "highlightTitle": ""}