{"organizations": [], "uuid": "19e68afc8a8e5152723f776fe7bc17b83634204a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/e/r/w/f/image.related.afrArticleLead.620x365.gjonal.png/1442553218492.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/swisse-wellness-167b-sale-dubbed-project-clarkson-bags-a-win-for-hawks-fans-20150917-gjonal", "country": "AU", "title": "Swisse Wellness $1.67b sale dubbed Project Clarkson bags a win for Hawks fans", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Swisse Wellness $1.67b sale dubbed Project Clarkson bags a win for Hawks fans | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T12:26:00.000+03:00", "replies_count": 0, "uuid": "19e68afc8a8e5152723f776fe7bc17b83634204a"}, "author": "Simon Evans", "url": "http://www.afr.com/business/swisse-wellness-167b-sale-dubbed-project-clarkson-bags-a-win-for-hawks-fans-20150917-gjonal", "ord_in_thread": 0, "title": "Swisse Wellness $1.67b sale dubbed Project Clarkson bags a win for Hawks fans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hawthorn AFL coach Alastair Clarkson, left, was at the centre of the $1.67 billion buyout of vitamins group Swisse Wellness, but didn't know it. Getty Images by Simon Evans Alastair Clarkson, the pugnacious coach of Hawthorn in the Australian Football League, was at the centre of one of Australia's biggest corporate deals, but didn't know it.\nAs Clarkson's Hawks run around the Melbourne Cricket Ground on Friday night, in a knock-out final against the Adelaide Crows, watching their beloved Hawthorn from the stands will be Swisse Wellness chief executive Radek Sali, chief financial officer Michael Da Gama Pinto and Goldman Sachs investment banker Adam Gregory, who led the $1.67 billion sale this week of the vitamins group.\nAs a special guest the trio is bringing along an AFL novice in Luo Fei, chairman and chief executive of Biostime. Although Luo might find the footy a bit confusing, he will be well aware of the Hawks coach, given Hong Kong-listed Biostime was the final winner in a process with the secret code-name Project Clarkson. The Swisse executives have even bought the Biostime boss a Hawks footy jumper to wear. The clean and green appeal of Australasian-branded vitamins to Chinese consumers has been behind the extraordinary sale price of Swisse, and also the appetite of investors for another company, Vitaco, which listed on the ASX on Wednesday after a $232 million float process also with a sporting theme, code-named Project Sochi, after the 2014 Winter Olympics.\nLarge shareholders in Swisse, the Ring family and Mr Sali, sold down most of their holdings in the sale of 83 per cent of the company, delivering them a huge windfall.\nThe Hawks theme extended right to Asia during the sale process, which received a huge boost from the soaring share price of vitamins industry stalwart Blackmores over the past few weeks . Blackmores shares have had a five-fold increase in the past 13 months, and climbed to a fresh record on the day Biostime and its investment bankers from HSBC signed documents sealing the deal at 3.30pm on Thursday at the offices of lawyer Herbert Smith Freehills on Level 42 of the 101 Collins St office tower in the Melbourne CBD.\nThe specific Biostime bid was code-named Birchall, after Hawthorn player Grant Birchall, while a rival bid by Shanghai Pharma was coined Stratton, after teammate Ben Stratton.\nNo room for Mitchell Hawthorn captain Luke Hodge was the code name associated with another bidder, Chinese private equity firm Hony Capital. Ironically, there was no room for another Hawthorn player, Sam Mitchell, one of the many sports stars who fronts advertisements for Swisse, along with other celebrities including former Test cricket captain Ricky Ponting, MasterChef co-host George Calombaris and actor Nicole Kidman.\n The investment bankers and lawyers worked all through Wednesday night at the Freehills office. The serious negotiations were punctuated by occasional jokes about the need for some Swisse multivitamins to keep them going at 4am, as the haze of street lights from Collins St shone in the background. Freehills mergers and acquisitions specialist Raji Azzam headed the legal team. The last piece of the puzzle was funding agreements, with HSBC and ANZ finally locked in, after a third international bank had dropped out of the syndicate on September 11, causing some temporary heartburn.\nHSBC investment banker William Tang, who guided the Biostime team, had flown in from Hong Kong. He was in the Freehills office for the signing on Thursday afternoon, along with Biostime chief executive Luo Fei. Others in the room included the Swisse boss Sali, Stephen Ring, the son of Swisse founder Kevin Ring, Trevor O'Hoy, the executive chairman of Swisse, and Goldman's Gregory. When the final signatures went on paper, glasses of champagne were brought in on a tray, amid jokes about whether there were enough bottles in the marketplace of Swisse's big-selling Liver Detox tablets.\nFor the Ring family it was a poignant moment, with the business having its genesis in 1972 in Melbourne's St Kilda suburb, where organic baker Kevin Ring began selling hand-made vitamin tablets as a sideline to his array of organic bread. Stephen Ring and Sali shed quiet tears at the sale signing.\nHuge turnaround The Swisse sale came after a huge turnaround in the business in two years, fuelled by sharper management and the lift in Chinese demand. The business in 2013 was earning profit of only $2 million, after some mis-steps in an aggressive United States foray, which prompted a $70 million injection into the balance sheet by the Goldman Sachs Special Situations fund. Passionate North Melbourne AFL supporter and former director O'Hoy, who is also a minority shareholder, isn't overly enamoured with the Hawks buzz but the whopping sale price helped soothe things for the former chief executive of beer company Foster's Group. Another of the early Swisse business partners, Michael Saba, will also enjoy a big windfall from his small shareholding.\nThe Swisse sale price overshadowed smaller rival Vitaco, which has a market capitalisation of about $280 million after a strong debut in its first three days of trading on the ASX. The stock is up 20 per cent on its $2.10 offer price. But investors who took up stock are lucky it made it that far.\nThe exit process for Vitaco's majority owner, private equity outfit Next Capital, also found a sporting code name – in line with its products for gym junkies and weight-loss fanatics like protein powders and low-carb chocolate bars. Project Sochi was one of the underlying strands for the broader exit by Next Capital termed Project Olympic.\nProject Sochi nearly didn't happen. A Chinese company called By-Health agreed to buy the firm in a trade sale in mid-2014 but pulled out at the last minute. At the time Next Capital was annoyed and disappointed, feeling a little like Torah Bright, the Australian snowboarder who picked up a silver medal in the 2014 women's half-pipe at the Sochi Winter Olympics after taking gold four years before in Vancouver.\nDual-track process But the cold feet from Chinese-listed By-Health enabled a dual-track process to begin in 2015. Next Capital partners John White and Mark Peters were advised by investment banker Quentin Miller and his boutique firm Intrinsic Partners. Miller had worked at UBS for 17 years before hanging out his own shingle earlier in 2015.\nThere was substantial interest from a new round of Asian trade buyers and financial buyers, buoyed by the soaring multiples of Blackmores and accelerating volume of health products being sold to China, and the decision was made to head down the public float route.\nCiti investment bankers John McLean and Dragi Ristevski were brought in, along with JPMorgan bankers Richard Galvin, and Simon Ranson. Minter Ellison lawyer Daniel Scotti headed the legal team. Roadshows to Vitaco's manufacturing plants at East Tamaki in Auckland and old-fashioned visits to supermarket chains and retailers like Chemist Warehouse to look at the products on the shelves were part of the process, so potential investors could learn more about the Healtheries and Nutra-Life vitamins, and Musashi and Aussie Bodies nutrition products.\nThe institutional bookbuild to price the Vitaco float happened on August 21. A price of $2.10 a share was set, equivalent to 19 times projected 2015-16 earnings. With Blackmores trading at multiples of more than 30 times at that stage, it seemed about right for the new kid on the block. Timing was everything. The next few days resulted in heavy sharemarket falls around the globe, as skittish investors panicked. But the price was locked in and investors were urged to look at the long-term game.\nAustralia's vitamins trio, Swisse, old hand Blackmores and Vitaco, are now all at the forefront of the nation's new booming export industry.", "external_links": [], "published": "2015-09-18T12:26:00.000+03:00", "crawled": "2015-09-18T10:07:44.935+03:00", "highlightTitle": ""}