{"organizations": [], "uuid": "119ce5da953ae1e341f0310fd5fe06859711fff4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30107134/telecom-and-finance-leaders-meet-in-london-for-tmt-finance-world-congress-and-awards-2015-on-december-1", "country": "US", "title": "Telecom and finance leaders meet in London for TMT Finance World Congress and Awards 2015 on December 1", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Telecom and finance leaders meet in London for TMT Finance World Congress and Awards 2015 on December 1 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T19:00:00.000+03:00", "replies_count": 0, "uuid": "119ce5da953ae1e341f0310fd5fe06859711fff4"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30107134/telecom-and-finance-leaders-meet-in-london-for-tmt-finance-world-congress-and-awards-2015-on-december-1", "ord_in_thread": 0, "title": "Telecom and finance leaders meet in London for TMT Finance World Congress and Awards 2015 on December 1", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CEOs, CFOs and Strategy Leaders from Telecom and Media companies globally are meeting with the leading Investment Bankers, Investors and Advisers for TMT Finance World Congress 2015 in London on December 1 as investment, M&A and IPO activity surges.\nLondon, UK (PRWEB UK) 24 September 2015\nTelecom and finance leaders are meeting in London on December 1 for the TMT Finance World Congress 2015 and Awards to assess global investment strategies for the rapidly changing telecoms, media and technology sector.\nThe annual senior executive event has been expanded this year to feature over 60 speakers including CEOs, CFOs and strategy leaders from telecom operators from Europe, the Middle East, Africa and Asia, as well as the leading TMT investment bankers, private equity investors, strategy and legal advisers.\n“Investment activity in telecoms, media and tech is intensifying globally so this is a really exciting time to bring together the key operators, financiers and advisers to London,” said Dominic Lowndes, Managing Director of TMT Finance, the event organiser. “We are covering a number of new IPOs, mergers and acquisitions and jumbo financings in TMT Finance News , and many of the key players are speaking or attending. The TMT Deal of the Year and M&A Adviser Award categories will be especially competitive this year.”\nTMT FInance World Congress home page is focused on telecom investment, financing and mergers and acquisitions opportunities as consolidation and convergence transforms the sector globally. A maximum of 250 senior executives attend the event which is split into 20 sessions including 5 plenary panels, 10 Peer to Peer Round Tables and an Awards Dinner.\nParticipating companies announced so far include: Convergence Partners, Etisalat, Zegona, Tele2, KPN, Six Degrees Group, Zayo, Colt, CityFibre, Black Green Capital, Interoute, IHS Africa, Providence Equity Partners, Goldman Sachs, UBS, Citi, FTI Consulting, Gulf Investment Corporation (GIC), New Call Telecom, Next Generation Data, Linklaters, HIG, Societe Generale, Credit Agricole CIB, IFC, DNB, ING Bank, BNP Paribas, ABRY Partners and Griffon Capital.\nSession themes include: European Telecom Leadership; TMT M&A; Telecom World Leaders Panel; Unified Communications; Mobile Towers; Raising Finance via IPO, Debt and Private Equity; Media and Content; Internet Infrastructure, Datacentres and the Future of TMT.\nThe TMT Finance World Awards Dinner takes place immediately following the conference at the Pullman Hotel St Pancras, London, to recognise outstanding investment and advisory activity in TMT globally. Awards will be presented for TMT Deal of the Year, M&A Adviser, Operator, TMT Infrastructure Deal, Growth Story, Financing Bank, Legal Adviser, Consultancy and Leadership. Nominate by October 2 to make the shortlist.\nTMT Finance World Congress and Awards 2015 takes place at the Pullman Hotel St Pancras, London, on December 1.\nFor more information go to http://www.tmtfinance.com/world\n //www.prweb.com/releases/2015/09/prweb12982381.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/09/prweb12982381.htm", "http://www.tmtfinance.com/world", "http://www.tmtfinance.com/world/awards"], "published": "2015-09-24T19:00:00.000+03:00", "crawled": "2015-09-25T07:25:19.038+03:00", "highlightTitle": ""}