{"organizations": [], "uuid": "44b0052e5502d5d4e737c826a23ecfc0b81f2f20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/b/9/5/3/image.related.afrArticleLead.620x365.gjhbk9.png/1441697853225.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/equity-markets/asx-woodside-bid-gives-investors-confidence-boost-20150907-gjhbk9", "country": "AU", "title": "ASX: Woodside bid gives investors confidence boost", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "ASX: Woodside bid gives investors confidence boost | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T15:04:00.000+03:00", "replies_count": 0, "uuid": "44b0052e5502d5d4e737c826a23ecfc0b81f2f20"}, "author": "Vanessa Desloires", "url": "http://www.afr.com/markets/equity-markets/asx-woodside-bid-gives-investors-confidence-boost-20150907-gjhbk9", "ord_in_thread": 0, "title": "ASX: Woodside bid gives investors confidence boost", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Woodside Petroleum's $11.65 billion tilt at Oil Search buoyed the ASX on Tuesday Fairfax Share on twitter Share on Google Plus by Vanessa Desloires The Australian sharemarket soared on merger and acquisition news in the embattled energy sector, shrugging off poor local and Chinese economic data.\nIn the absence of a lead from Wall Street, which closed for the US Labor Day holiday, the market opened higher as news broke that Woodside had pitched an $11.65 billion bid for Oil Search and maintained its position for the remainder of the day.\nA late surge on the back of a rally in China's sharemarket brought the benchmark S&P/ASX 200 Index up 85 points, or 1.7 per cent higher, to 5115.2 , and the All Ordinaries up 82 points or 1.6 per cent higher to 5133.5.\n\"M&A and buyout fever in the energy sector has been the driving force on the ASX today,\" IG market analyst Angus Nicholson said.\nMr Nicholson said it was too early for M&A activity to kick off in the energy sector as companies would like wait for valuations to drop further before making a bid, but Woodside put in an early bid for what was a high quality company.\n\"I don't know if that deal will go through, the offer put through for Oil Search was only at a 13 per cent premium to its closing price yesterday and it has rallied well above that today,\" he added.\nOil Search's shares surged on return to trading and was the day's biggest mover, rising 17.4 per cent to $7.90. Woodside Petroleum meanwhile fell 3 per cent to $29.60 and was the second worst performing stock of the day, just one of 20 to lose ground.\n\"The potential for energy sector M&A and buyouts has been pushing up prices in other companies,\" Mr Nicholson said.\n The M&A talk spurred heavy buying in energy stocks. The energy sector rose 2.6 per cent, the best performing sector for the day. Fellow oil and gas company Santos rose 5.25 per cent to $4.41.\nBut the day's buoyancy from long-awaited M&A overlooked the macroeconomic issues around China and Australia's own economy from which the market was accustomed to taking its leads.\nChina's import and export data for August was worse than expected and followed big declines in July. The value of China's overall trade with Australia has fallen 18.6 per cent this year.\n\"The import data is the most concerning for investors,\" Mr Nicholson said.\n\"For six straight months import growth has declined more than 10 per cent, that's pretty damning assessment for where the Chinese economy is at the moment,\" he said.\nMr Nicholson said the import data pointed to a notable drop in iron ore volumes, which loomed over the mining sector, but mining stocks took their positive leads from London, with resources higher on news that Glencore planned to cut dividends, raise $US2.5 billion in capital and consider asset sales to cut its £30 billion ($66 billion) debt by a third.\nBHP Billiton and Rio Tinto both rose 2.1 per cent to $24.70 and $50.22 respectively.\nDisappointing local data also failed to stifle buying. National Australia Bank's monthly survey found business confidence fell to its lowest level in two years with the market rout and worries on China setting a gloomy tones across Australian boardrooms.\nAcross the sectors, the health index was the worst performing, up just 0.2 per cent, followed by industrials up 0.5 per cent.\n\"That indicates a risk-on day as healthcare is defensive,\" Morgans private client adviser Alistair McCorquodale​ said.\nThe banks all finished higher, with Commonwealth Bank up 2.6 per cent to $74.17. Westpac Banking Corporation climbed 2.4 per cent to $30.52, National Australia Bank rose 2 per cent to $30.20 and ANZ Banking Group soared 3.1 per cent to $27.53.\nWoolworths rose just 0.04 per cent to $25.33 while Wesfarmers rose 1 per cent to $39.79. Telstra climbed 1.4 per cent to $5.68.\nWhile Tuesday's session was strong, Mr McCorquodale said a stabilisation of the Australian dollar, which had fallen below US70¢ in recent days, would be the catalyst for confidence to return to the market in the longer term.", "external_links": ["https://twitter.com/http://twitter.com/VDesloires", "https://plus.google.com/https://plus.google.com/110505490532745073834/posts", "http://www.smh.com.au/business/markets-live/markets-live-asx-on-struggle-street-20150907-gjharm.html"], "published": "2015-09-08T15:04:00.000+03:00", "crawled": "2015-09-08T16:07:15.338+03:00", "highlightTitle": ""}