{"organizations": [], "uuid": "97ac5d718455b7c7ed338f97995c5bf1d94e759e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/y/i/1/u/image.related.afrArticleLead.620x365.gjk83k.png/1441954107506.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/investors-battle-through-the-chaos-20150911-gjk83k", "country": "AU", "title": "Investors battle through the chaos", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Investors battle through the chaos | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T14:29:00.000+03:00", "replies_count": 0, "uuid": "97ac5d718455b7c7ed338f97995c5bf1d94e759e"}, "author": "Philip Baker", "url": "http://www.afr.com/markets/investors-battle-through-the-chaos-20150911-gjk83k", "ord_in_thread": 0, "title": "Investors battle through the chaos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scary scenarios seem to be part of everyday investment. Andrew Quilty Share on twitter by Philip Baker It's been four years since shares on Wall Street have moved up and down so quickly, so it's not surprising that investors have sweaty palms.\nAnd a quick look at the best measure of fear, the Chicago Board Options Exchange Volatility Index, sometimes called the Vix, shows just how nervous investors are.\nAfter spending the last three years, on average, at just under 15 points, the Vix has now traded above 25 points in 12 of the the past 14 trading sessions.\nThat's in contrast to the past four years when the index spent just five sessions above the key level of 25, according to Bloomberg.\nSo, investors have been very calm for quite some time, which probably just adds to the current mood of nervousness.\nIn the past, whenever sharemarkets got a case of the wobbles, smart investors would look to take advantage of the sell off in a traditional \"buy in gloom\" approach.\nBut when volatility soars, all bets seem to get cancelled.\nOne reason put forward for all the wild swings has been a product that was meant to provide global investors with insurance against these sorts of moves.\n Exchange traded funds – a popular investment in which baskets of stocks and other assets are packaged up to reflect an index, or a commodity, or indeed anything investors want – seem to struggle when investors take billions of dollars out of them at the same time.\nThis week nervous investors yanked out $US10 billion ($14 billion) of an ETF tracking the Standard & Poor's 500 Index, the most since August 2014.\nA week ago they tipped in $US7.5 billion into it, according to Bloomberg.\nTraction gained Ironically the rise of ETFs gained traction after the Black Monday selloff in 1987, and since then assets in these funds have grown to $US2.1 trillion in the United States, according to Morningstar.\nIndividual investors put money into them because they have low fees and have the ability to track indexes in a \"passive\" way.\nBut there's nothing passive about the moves we've had this week.\nAlthough, despite the wild ride the major S&P ASX 200 index did close up around 0.7 per cent this week and seems to be holding around the 5000 level.\nIndeed, just like the index struggled to break through 6000 earlier this year, it's also having a tough time breaking down through 5000.\nThat's good news for investors in a week where they endured a rare \"flip-flop\".\nOn Wednesday, stocks rose more than 2 per cent, but the very next day turned around and fell more than 2 per cent.\nThere are so many mixed messages out there it's little wonder it's such a wild ride.\nOn Friday, Goldman Sachs chief economist Tim Toohey says if the lack of business investment combines with a potential slump in housing investment, then there's a one-in-three chance Australia could fall into a recession before the next federal election .\nBut on Thursday one of the best measure of the jobs market, the employment to population ratio, revealed things had improved.\nAfter sliding since late 2011, the proportion of those surveyed who were working, turned back up in late 2014 and has now been climbing for the past 10 months.\nConsumer confidence still seems shot to pieces but business conditions aren't too bad, while the price of iron ore looks to be heading to $US60 a tonne when all the experts said it would fall to $US40. Go figure.\nScary scenarios So recession? Global financial crisis II? Debt crisis? Currency market disruptions?\nAll these scary scenarios seem to be part of everyday investment, along with higher levels of volatility.\nMost investors don't have the luxury of ignoring the worries. Perhaps those with $20 million or so can let their paid advisers worry about short-term strategy but the rest of us have to battle through the chaos.\nTwo key questions that just have to be asked include one, what is the time frame of my investment program?; and two, what is the most sensible asset mix for my situation?.\nMatthew Ross, the equity strategist at Goldman Sachs, says the risk return profile for the sharemarket is \"evenly balanced\" now the major index has fallen about 15 per cent since its April peak.\nThe accompanying graph also shows that apart from the resources sector, the forward price earnings ratio of property, defensive industrials, the index, the banks and cyclical industrials are now back closer to their long term average.\nHowever, he points out that the recent fall in the Australian dollar to about US69¢, and 10 per cent below its 20 year average, will now be a tail wind for stocks.\n\"During the initial phase of the $A depreciation we remained cautious given the economy was slowing and the currency was a long way from competitive. With the A$ now 10 per cent below its 20-year average, we expect the next 12 months will provide a more significant tailwind to domestic firms with further policy easing expected,\" he says.\nBut there's still a few reasons to buy stocks including dividend yields that are now at a fresh 40-year high to the bond yield.\nCompanies are also conservatively geared and dividend risks are low, while the Federal Reserve's slower path to higher rates is good news for Australia's bond-like sharemarket.\nAlthough the graph also shows that during this current correction the bond-like stocks have offered investors very little protection when they normally do. Banks, for example, are the worst performer but domestic cyclicals among the best.\nThat's unusual for a correction.\nRoss also says M&A activity is also to peak levels, while \"Australia has more room to move on both fiscal and monetary policy than any other developed market if this correction turns into something more serious\".\nAnyone looking to buy should note that Ross isn't keen on the banks. He says they will need to raise more capital, regulators will still make life tough for them, margins will narrow, while the quality of their assets will decline.\nStocks he is favourable to include: Wesfarmers, HealthScope, CIMC Group, Macquarie Group, Woodside Petroleum, Dick Smith, Amaysim, Genworth, James Hardie, Caltex, Telstra, OzForex and Aristocrat Leisure.", "external_links": ["https://twitter.com/PhilABaker"], "published": "2015-09-11T14:29:00.000+03:00", "crawled": "2015-09-11T14:12:51.897+03:00", "highlightTitle": ""}