{"organizations": [], "uuid": "cca912c4c862ba83ffa6bb09a1eb1d8570a95a6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/s/q/z/g/image.related.afrArticleLead.620x365.gjpjbu.png/1442545083570.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/policy/industrial-relations/cfmeu-to-pay-up-to-9-million-to-boral-under-historic-deal-20150918-gjpjbu", "country": "AU", "title": "CFMEU to pay up to $9 million to Boral under historic deal", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "CFMEU to pay up to $9 million to Boral under historic deal | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T09:22:00.000+03:00", "replies_count": 0, "uuid": "cca912c4c862ba83ffa6bb09a1eb1d8570a95a6f"}, "author": "Ewin Hannan", "url": "http://www.afr.com/news/policy/industrial-relations/cfmeu-to-pay-up-to-9-million-to-boral-under-historic-deal-20150918-gjpjbu", "ord_in_thread": 0, "title": "CFMEU to pay up to $9 million to Boral under historic deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boral CEO Mike Kane: \"This agreement is a huge step in the multi-year effort to re-establish the rule of law on Melbourne construction sites.\" Peter Braig Share on twitter by Ewin Hannan The militant construction union will pay up to $9 million in damages and legal costs to Boral under a ground-breaking settlement that imposes major financial penalties on the union if it takes action against the company in the next three years.\nBoral said on Friday that the deal with the Construction, Forestry, Mining and Energy Union \"breaks new ground in settlement of union disputes in Australia\" by including a rigorous, legally-binding regime of controls prohibiting interference with Boral's business until 2018.\nBoral had been seeking $20 million in damages from the CFMEU, claiming it had been victim of the union's long-running bitter dispute with Grocon. Boral claimed the union told Victorian construction contractors not to use the company's services.\nUnder the settlement submitted to the Supreme Court of Victoria, the CFMEU wil pay an initial $4 million plus Boral's legal costs, which the company estimates at between $3 million to $5 million.\nHowever, the CFMEU on Friday said it believed the costs would be significantly less when settled by the court.\nThe CFMEU will publicly commit that its organisers and shop stewards not interfere with Boral and its affiliate companies in the delivery of concrete or any other Boral products or services.\nThe CFMEU will also make clear to the market that construction businesses are free to choose their suppliers, including concrete suppliers, without fear of retribution from the union.\nThreat of fines In addition to injunctions for a period of three years, the agreement includes a mechanism that will be activated immediately if there is any breach of the agreement.\nAmounts to be paid by the union for any breaches range from $50,000 to $200,000, with the amount doubling where there are three or more breaches in any 12 month period. If there were four breaches at the maximum amount, the total amount payable by the union in that year would be $1.6 million.\nBoral CEO and managing director Mike Kane said on Friday: \"This agreement is a huge step in the multi-year effort to re-establish the rule of law on Melbourne construction sites.\n\"We will now be protected against illegal interference in serving our customers. We have fought long and hard to get to the point where we can start to reclaim our position in the Melbourne CBD and we look forward to working with those customers that have felt unable to do so because of the ban.\"\nFederal Court action by the Australian Competition and Consumer Commission over the alleged union boycott is continuing, with the union facing $10 million in fines.\nCFMEU claims victory In a statement on Friday the CFMEU said: \"This result is a humiliation for Mike Kane. Boral has claimed losses of over $23 million dollars, yet the matter has been settled for $4 million.\"\n\"Mr Kane's ideological campaign against the union has been damaging Boral's reputation for that entire time.\n\"Shareholders will be breathing a sigh of relief now Mr Kane will be able to spend more time focusing on the financial future of Boral rather than waging ideological wars against the union movement.\n\"The CFMEU simply hopes that the end of these court proceedings will allow Boral to focus on safety rather than politically motivated litigation.\"\nMr Kane said Boral would continue to co-operate with the ACCC , with the secondary boycott action scheduled for trial in March 2016.\nHe said the agreement did not interfere in any way with investigations by law enforcement bodies, including Fair Work Building and Construction, and those responsible for investigating referrals made by the Royal Commission into Trade Union Governance and Corruption.\n\"Boral retains all rights with respect to any future illegal conduct by the CFMEU and will always defend its right to conduct its business without hindrance from those that seek to illegally interfere with Boral's business or stand between Boral and our customers,\" he said.", "external_links": ["https://twitter.com/EwinHannan"], "published": "2015-09-18T09:22:00.000+03:00", "crawled": "2015-09-18T10:10:33.409+03:00", "highlightTitle": ""}