{"organizations": ["IMF"], "uuid": "b8c58b231b9cc5db694b0bc4e28bf7f770a0c2a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509291289.html", "country": "US", "title": "Nigeria: Leadership Group Repositions, Makes Appointments", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Leadership Group Repositions, Makes Appointments", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T16:01:00.000+03:00", "replies_count": 0, "uuid": "b8c58b231b9cc5db694b0bc4e28bf7f770a0c2a3"}, "author": "", "url": "http://allafrica.com/stories/201509291289.html", "ord_in_thread": 0, "title": "Nigeria: Leadership Group Repositions, Makes Appointments", "locations": ["Nigeria", "Gambia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gambia: Gambia's Economy Hit By 'Persistent Policy Slippages' - IMF \nLEADERSHIP Group Ltd yesterday announced a major restructuring of itself and holding companies. This, the chairman said, was to reposition the group for the great opportunities ahead and to take advantage of the future. \nBy the announcement, Mr Lere Baale, who had been a non-executive board member, has been appointed executive vice chairman of LEADERSHIP Group Ltd and also Leadership Holdings Ltd. \nMr Baale was executive director and chief strategy officer of Globacom Ltd and also executive director for East, Central and West Africa of Pfizer Specialties Ltd for several years. He is also a director at Business School, Netherlands/Nigeria, and regional partner of HOWES-CMOE Inc., Africa and Middle East. \nMr Nnamdi Samuel, who has been group executive director, Business Units, is promoted chief operating officer/group executive director. Nnamdi reports to the executive vice chairman. \nMr Michael Okpere, the group managing director, Leadership Group, is now group managing director, Leadership Holdings Ltd, with the responsibility of supervising the organisation's five subsidiaries and other investments and holdings. He is to be supported by Abraham Nda-Isaiah who is now group executive director (Administration), Leadership Holdings Ltd. \nDr Kazeem Durodoye is now president, Leadership Digital Assets Ltd. He will directly manage all the company's digital holdings for profitability. \nMr Segun Akintunde has been appointed executive vice president (Monitoring and Strategy), vice chairman's office. Mr Akintunde, who is a business administration graduate of Ahmadu Bello University, Zaria, has more than 30 years' experience in business management in leading international and local companies. \nLEADERSHIP Newspapers, the flagship of the group, has also made key appointments: \nAisha Yolah is now executive vice president and editor-in-chief of the newspaper group. In this position, she will oversee the newspaper's seven titles - LEADERSHIP, LEADERSHIP Sunday, LEADERSHIP Weekend, LEADERSHIP Friday, LEADERSHIP Hausa, leadership.ng and GOVERNMENT - and see to the resurgence of LeVogue. \nBorn in Addis Abba in 1967, Yolah, who holds a first degree from the Ahmadu Bello University, Zaria, and two master's degrees from the Bayero University and University of Manchester in the United Kingdom, has been an assistant managing editor of NEXT newspaper and editor of LEADERSHIP Sunday and LEADERSHIP at different times. She is an alumnus of the Chevening Scholarship, UK. \nMalam Ibrahim A. Ibrahim comes in as executive vice president/chief revenue officer. \nBorn in London in 1975, Ibrahim was until a few days ago the managing director of Madobi Microfinance Bank in Kano. He attended schools in Cairo, Pakistan and Nigeria and holds bachelor's and master's degrees from Bayero University, Kano. \niii. Jude Onoh has been appointed executive vice president, Marketing, of the newspaper. Mr Onoh has variously worked in Neimeth Pharmaceutical Company, MRS, United Biscuits Ltd, Globacom, and several others. He brings along several years of branding and marketing experience across several sectors. \nAll appointments take effect from October 1, 2015. Nigeria \nIn his bid to fulfil the promise to make his ministers known by the end of September, President Muhammadu Buhari … see more » Copyright © 2015 Leadership. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-29T16:01:00.000+03:00", "crawled": "2015-09-29T16:27:29.905+03:00", "highlightTitle": ""}