{"organizations": [], "uuid": "081271f5e76b148c980bb9486642a5f3d17fe7ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://finance.yahoo.com/news/chinas-weakness-isnt-bad-114128845.html", "country": "GB", "title": "China's Weakness Isn't All Bad - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "China's Weakness Isn't All Bad - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "081271f5e76b148c980bb9486642a5f3d17fe7ed"}, "author": "Laura Brodbeck", "url": "http://finance.yahoo.com/news/chinas-weakness-isnt-bad-114128845.html", "ord_in_thread": 0, "title": "China's Weakness Isn't All Bad - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View photo\n. Ever since the People's Bank of China devalued the yuan and the nation's markets subsequently tumbled, investors have been looking at weakness in one of the worlds largest economies as a negative.\nWhile slow growth in China is likely to drag on the global economy as a whole and hurt some U.S. multinationals who depend on the Chinese market for a large part of their revenue, it may not spell disaster for all firms. In fact, several big names are looking to benefit from China's economic troubles.\nSourcing From China While companies that sell to China are in trouble, those that source from the country are likely to benefit if the savings are passed on. U.S. firms like Home Depot Inc (NYSE: HD ) and Toys R US buy a lot of their merchandise from Chinese exporters. At the moment, the exporters are reaping the gains, but it will only be a matter of time until pressure for them to share part of that income mounts.\nRelated Link: If China Sneezes, Who Else Gets Sick? \nWal-Mart Stores, Inc. (NYSE: WMT ), which is notorious for having major sway over its vendors, has already begun to negotiate with its suppliers in China to get better deals. Many believe that a deal with Wal-Mart will open the floodgates for other firms looking to cash in on cheap Chinese exports.\nChinese Manufacturers China's manufacturing sector is also reaping the rewards of a slowdown at home. This is especially true for firms whose product sales are typically made in other currencies.\nLenovo Group (OTC: LNVGY ) , has been enjoying higher margins as the company's production costs in China have been significantly reduced, but the majority of its sales take place in U.S. dollars. Other, lesser known firms like smartphone maker Xiaomi Corp are using this moment of weakness to expand overseas as their products are becoming even more competitive due to lower prices.\nSee more from Benzinga \nU.S. Grocers Battening Down The Hatches As German Retailers Roll In Cybersecurity Becomes An Even Bigger Problem For U.S. Firms Who Will Benefit From Back-To-School Shopping? © 2015 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. \nPersonal Investing Ideas & Strategies Asia News China", "external_links": [], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T16:21:53.186+03:00", "highlightTitle": ""}