{"organizations": ["Keystone Petroleum Limited & Falkland Oil"], "uuid": "b8aa154ecbc50bf399b61215ba0e1e7d0fa18f42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-oil-gas/?format=rss", "section_title": "Oil News | Gas News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/gulf-keystone-petroleum-limited-falkland-070235688.html", "country": "US", "title": "Are Gulf Keystone Petroleum Limited & Falkland Oil and Gas Limited Really In The Home Straight Now?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Are Gulf Keystone Petroleum Limited & Falkland Oil and Gas Limited Really In The Home Straight Now?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T10:02:00.000+03:00", "replies_count": 0, "uuid": "b8aa154ecbc50bf399b61215ba0e1e7d0fa18f42"}, "author": "", "url": "https://uk.finance.yahoo.com/news/gulf-keystone-petroleum-limited-falkland-070235688.html", "ord_in_thread": 0, "title": "Are Gulf Keystone Petroleum Limited & Falkland Oil and Gas Limited Really In The Home Straight Now?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Sep 18, 2015, 08:42 BST - UK Markets close in 7 hrs 48 mins Are Gulf Keystone Petroleum Limited & Falkland Oil and Gas Limited Really In The Home Straight Now? By Alan Oscroft | Fool.co.uk – 40 minutes ago 28.25 -1.0000 \nNews of a deal for a reliable payments cycle for Gulf Keystone Petroleum (LSE: GKP) has been long awaited, and the Kurdistan Regional Government (KRG) has actually responded to Gulf's cutting off export supplies in response to not getting paid for them -- Gulf has been selling its oil domestically at lower prices, but that's better than nothing. \nCash coming! \nBut the news on 7 September that a first payment of $13m net had been authorized was still met with some scepticism, as words themselves are cheap and we still hadn't seen the colour of any cash. But then on 15 September Gulf Keystone confirmed the cash had arrived, and told us it has commenced the transfer of all crude oil deliveries to the export pipeline. \nThat was, apparently, at the request of the KRG's Ministry of Natural Resources, and it knows that Gulf can and will pull the plug should regular payments not actually happen. So does this really signal the upturn? \nGulf also told us that total production from its Shaikan field has now passed the 15 million barrel mark, running at over 40,000 barrels per day at the moment -- and we also learned that it has $73m in cash on its books now. \nBut the market response has been decidedly muted, and the share price has actually fallen since the news first broke -- and at 29.4p, it's down 14% over 12 months. It might just be that brokers have yet to update their stance on Gulf, but there is certainly a long way to go yet before there's any profit -- and the second payment had better happen. \nBig discoveries \nAs a potential investment, I like Falkland Oil and Gas (LSE: FOGL) better. It's still a few years away from profits yet with a lot more cash needing to be sunk into development, but news of the company's discoveries just keeps getting better. \nThe share price leapt on 11th September, at one point breaking 32p for a brief 50% rise on the day, but it's since dropped back to 25p. The firm was pushed to issue a note that it knew of no underlying reason for the jump, but most observers reckoned it was in anticipation of results from the Humpback exploration well in the South Falklands Basin. Falkland has a 52.5% stake in Humpback, and if it proves to be as successful as its previous Isobel Deep and Zebedee wells it could lead to a big boost in resources. \nFalkland Oil and Gas must be one of the surest of the not-yet-in-profit oil explorers, and we could well look back on 2015 as the turning year for investors -- although there's surely more volatility to come before first profits roll in. \nIf these two don't grab you for their growth potential, try a copy of our hot new report which brings you 1 Top Small-Cap Stock From The Motley Fool . \nIt's a smaller company that has already rewarded its shareholders with a stonking performance, yet the Motley Fool's top analysts reckon there could be a further 45% upside to come . \nWant to know the name of this potential small-cap winner? Just click here to get your completely free report today . \nAlan Oscroft has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-09-18T10:02:00.000+03:00", "crawled": "2015-09-18T10:43:21.495+03:00", "highlightTitle": ""}