{"organizations": [], "uuid": "d3348538207528d5b7d0ce1d34eadfe073da02f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/auto-car-sale-Ret.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/automobiles/maruti-hyundai-lead-domestic-car-sales-in-august/128994", "country": "IE", "title": "Maruti, Hyundai lead domestic car sales in August", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Maruti, Hyundai lead domestic car sales in August | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T04:41:00.000+03:00", "replies_count": 0, "uuid": "d3348538207528d5b7d0ce1d34eadfe073da02f9"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/automobiles/maruti-hyundai-lead-domestic-car-sales-in-august/128994", "ord_in_thread": 0, "title": "Maruti, Hyundai lead domestic car sales in August", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Car sales in the country grew moderately in August with major auto makers such as Maruti Suzuki and Tata Motors witnessing increase in dispatches, while Hyundai posted its best ever monthly sales with new models making significant contributions.\nHowever, Honda Cars India and Mahindra & Mahindra reported decline in sales last month reflecting “fragmented recovery” that the auto industry is witnessing.\nMarket leader Maruti Suzuki India said its domestic sales increased by 8.6 per cent during the month to 1,06,781 units, as against 98,304 units in August 2014.\nSales of mini segment cars, including, Alto and WagonR, increased by 8.6 per cent to 37,665 units as compared to 34,686 units in the year-ago month, MSI said in a statement.\nThe company’s newly launched premium crossover vehicle S-Cross clocked sales of over 4,500 units during the month.\nRival Hyundai Motor India saw its highest ever monthly domestic sales at 40,505 units last month as compared to 33,750 units in August 2014, up 20.01 per cent.\n“The growth has been led by the new SUV Creta, Elite i20 and i20 Active. While the Creta has done about 7,400 units, other models have also contributed to the overall growth,” HMIL senior vice-president (sales and marketing) Rakesh Srivastava said.\nHyundai recorded highest-ever single month sales with a volume of 40,505 units and growth of 20 per cent over the last year, led by strong youthful product portfolio, he added.\nTata Motors’ sales of passenger cars in August were higher by 19 per cent at 9,814 units, as compared to 8,229 units in same period of last year.\nIts domestic passenger vehicles sales rose 2 per cent at 11,194 units as against 10,975 units in the same month of previous year.\n“The growth that we are seeing in the industry is because of the new models. If you take out the new models, industry growth will be in the negative,” Tata Motors President (Passenger Vehicles Business Unit) Mayank Pareek told PTI.\nThis is a concern as August is the time when usually sales start picking up, which hasn’t happened this time, he said, adding that the ‘pain areas’ of the industry were mainly dip in consumer sentiment and expectation of a cut in interest rates making customers postpone purchases.\nHe further said that the narrowing gap between petrol and diesel prices has hurt demand for utility vehicles, which also had been affected due to the hike in excise duty.\nHonda Cars India reported 6.58 per cent decline in its domestic sales at 15,655 units in August, despite the launch of its new Jazz in July.\nUtility vehicle major Mahindra & Mahindra saw its domestic sales decline 3.10 per cent to 32,122 units last month as against 33,150 units in the same month last year.\n“While currently we are witnessing fragmented recovery in auto sales, we are hopeful that the upcoming festive season will provide a much needed fillip to the auto industry,” M&M Chief Executive (Automotive Division) Pravin Shah said.\nFord India August domestic sales stood at 8,331 units, up 22.49 per cent, compared to 6,801 units in the same month last year, driven by robust sales of recently launched compact sedan Figo Aspire.\nToyota Kirloskar Motor (TKM) reported 1.29 per cent increase in its August sales at 12,547 units as compared to 12,386 units in the same period of last year.\nCommenting on the sales performance, TKM Director and Senior Vice-President N Raja said the growth can be partly attributed to the new Camry.\nVolkswagen sold 4,191 units in August, up 4.59 per cent, as compared to 4,007 units sold in the corresponding month of the previous year.\nIn the two-wheeler segment, Honda Motorcycle & Scooter India (HMSI) reported 1.86 per cent increase in total sales at 3,95,262 units in August.\nYamaha Motor India reported 15 per cent increase in domestic two-wheeler sales at 61,440 units in August.\nRoyal Enfield, the two-wheeler division of Eicher Motors, posted sales of 41,600 units in the domestic market, up 59.25 per cent, from 26,121 units in the same month last year.\nFirst Published on September 01, 2015 8:41 pm", "external_links": [], "published": "2015-09-02T04:41:00.000+03:00", "crawled": "2015-09-02T02:44:20.897+03:00", "highlightTitle": ""}