{"organizations": [], "uuid": "55a9d68a347a5448053c0941a1a8e9d72142ca8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/d/l/0/6/image.related.articleLeadwide.620x349.gjdd8z.png/1441176172559.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2020/industrials/commercial-and-professional-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/money/investing/rebound-makes-time-for-a-new-game-20150902-gjdd8z.html", "country": "AU", "title": "Rebound makes time for a new game", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Rebound makes time for a new game", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "55a9d68a347a5448053c0941a1a8e9d72142ca8b"}, "author": "", "url": "http://www.smh.com.au/money/investing/rebound-makes-time-for-a-new-game-20150902-gjdd8z.html", "ord_in_thread": 0, "title": "Rebound makes time for a new game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Now may be a good time for small investors to reduce their risk by developing a more balanced portfolio. Photo: Orlando Chiodo\nDespite last week's quick rebound in Australian share prices, the recent volatility in world share markets confirms that the good times of solid positive returns for investors could well have ended.\nTo get more Money more often, why not follow us on Twitter? We’re @FairfaxMoney\nIndeed, apart from short sellers buying back to take their profits, the recovery in share prices was based on the belief that the large market downturn would delay the expected increase in US interest rates later this month.\nIn many respects, the stronger market is a get out of jail free card for investors whose portfolios are overweight in higher risk Australian shares including resource stocks and the major banks.\nAdvertisement Helped by the continuing weakness in the Australian dollar, overseas share holdings, especially in the US market, have outperformed Australian shares and also increased in Australian dollar terms by US dollar currency appreciation.\nWhile predicting future currency movements is difficult, the continuing strength of the US economy and lower commodity prices will continue to put downward pressure on our dollar. This is why during the past year, unlike many smaller investors, larger institutions have been reducing their Australian share weightings and increasing their overseas weightings.\nHistorically, Australian shares,particularly those paying solid fully franked dividends, have provided good returns for investors. Franked dividend yields have been good and periodic major price falls such as in the GFC are being recovered at a later date.\nBut now, with both the major banks and commodity producers facing challenges to maintain or enhance profits future growth prospects are limited to a much smaller segment of our listed companies.\nThis, combined with low interest rates, means that many shares are fully priced and could easily retreat if bond yields and interest rates start to increase.\nIn short, unless there's a major recovery in commodity prices, future share price movements will very much depend on the fortunes of individual companies.\nAgainst this general background, smaller investors still have the opportunity to rebalance their portfolios if they wish to reduce their overall risk profile. For many, the changes to be considered include reducing their gearing levels and/or increasing their exposure to overseas assets not necessarily shares.\nIndeed, with property prices levelling off and the share market struggling; the odds are increasing that portfolios concentrated solely on Australian assets will generate only a low or even negative return this year.\nA higher weighting to overseas assets could pay off, especially for investors seeking higher yields if, as widely expected, the Australian dollar falls even further.\nThe most suitable time to restructure portfolios is when prices are firm and profits are available to be taken.\nLast week's panic sellers when the market was falling received up to 10 per cent less for their assets than if they sold this week.\ncomments@dixon.com.au\nDaryl Dixon is the executive chairman of Dixon Advisory", "external_links": ["http://twitter.com/@FairfaxMoney"], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-07T08:23:48.212+03:00", "highlightTitle": ""}