{"organizations": [], "uuid": "9b74daa90502d1992f681419aef3bcbdce624d7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DV424_Caesar_ZG_20150930083038.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.marketwatch.com/story/caesars-entertainment-and-five-other-stocks-to-sell-short-2015-09-30?siteid=yhoof2", "country": "GB", "title": "Caesars Entertainment and five other stocks to sell short - MarketWatch", "performance_score": 0, "site": "marketwatch.com", "participants_count": 1, "title_full": "Caesars Entertainment and five other stocks to sell short - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "9b74daa90502d1992f681419aef3bcbdce624d7d"}, "author": "yahoo", "url": "http://www.marketwatch.com/story/caesars-entertainment-and-five-other-stocks-to-sell-short-2015-09-30?siteid=yhoof2", "ord_in_thread": 0, "title": "Caesars Entertainment and five other stocks to sell short - MarketWatch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Has the six-year bull market in stocks come to an end? \nJudging from daily swings in the stock market, it seems investors are looking for any opportunity to hit the panic button.\nBut even in a down market, there are plenty of opportunities to make money.\n‘... There is no other company of this size and this scope approaching this valuation today.’ George Schultze on the attractiveness of GM’s stock Even the solid health-care sector has taken a beating, although the big decline registered on Monday might have been an over-reaction to questions from members of Congress about drug manufacturer’s price increases and Hillary Clinton’s recent tweet pillorying pharmaceutical companies.\nBut there are so many warning signs. Federal Reserve Chairwoman Janet Yellen last week said she anticipated an increase of short-term interest rates “later this year, followed by a gradual pace of tightening thereafter.”\nWith the federal funds rate locked in a range of zero to 0.25% since late 2008, bond prices are high and the inverse relationship between interest rates and bond prices means there will be tremendous pressure, especially on high-yield bonds. That can exacerbate the budding credit problem for energy-production companies, already reeling from the epic decline in oil and natural gas prices, since they may not be able to renew financing.\nThe S&P 500 Index SPX, +1.72% is down 8.5% this year, even with dividends reinvested, setting up the first down year for the benchmark since 2008. On a total return basis, the index was flat in 2011, after which it returned 13% in 2012, 30% in 2013 and 11% in 2014.\nRead: S&P 500 teeters on major technical support \nThe S&P 500 trades for 16 times weighted aggregate consensus 2015 earnings estimates among analysts polled by FactSet. That’s down from 17.7 times two months ago. But even after the stock market’s decline, the index hasn’t traded at this high a current-year price-to-earnings ratio at this time of the year since 2005.\nFactSet In a down market, you still might find investment values, such as two we discussed on Tuesday with George Schultze, managing member and founder of Purchase, N.Y.-based Schultze Asset Management .\nSchultze, who has served on boards ranging from Chrysler to United Airlines, has $250 million in assets under management at his firm. He uses both long and short strategies, focusing on distressed companies or those with special upside “catalysts.”\nYou might also find opportunities to short stocks — borrowing shares and immediately selling them, expecting them to drop so you can buy them back on the cheap later, return them to the lender and pocket the difference. But this is much more risky, since your potential losses are unlimited, as your broker can explain.\nThe following is a discussion we had about sectors, stocks, bonds and valuations.\nAre we in a bear market? \nGeorge Schultze: We are starting to enter a bear market for high-yield bonds. We’re on the verge of seeing interest rates hike, and with that, the prices of fixed-income securities can be expected to drop for a long time. We think it will be very difficult for companies in the junk-bond market to refinance, which means capital losses for fixed-income investors.\nSchultz Asset Management George Schultze, managing member and founder of Schultze Asset Management What about stocks? \nPrev Page 1 2 Next Page", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T17:40:43.444+03:00", "highlightTitle": ""}