{"organizations": [], "uuid": "a9bab7b166fedab2969f75576a9fde5604387659", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/lifestyle/health/drug-may-help-prevent-type-1-diabetes-study/136445", "country": "IE", "title": "Drug may help prevent Type-1 diabetes: study", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Drug may help prevent Type-1 diabetes: study | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T18:34:00.000+03:00", "replies_count": 0, "uuid": "a9bab7b166fedab2969f75576a9fde5604387659"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/health/drug-may-help-prevent-type-1-diabetes-study/136445", "ord_in_thread": 0, "title": "Drug may help prevent Type-1 diabetes: study", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Alcohol use may increase risk of cancer, injury: Study Baba Ramdev: Take giloy, aloe-vera to prevent dengue Human germ cell development model created A drug currently used in Asia and Europe to treat gallbladder disease may help prevent the onset of Type-1 diabetes, researchers, including one of Indian-origin, have found.\nThe buildup of a substance called hyaluronan in the pancreas during the pre-symptomatic stage of Type 1 diabetes is essential to the development of the disease, researchers said.\nResearchers used a drug to block production of this substance in mouse models, staving off damage to insulin-producing cells.\nThe findings suggest that it may be possible to prevent the onset of Type 1 diabetes in humans, researchers said.\nThe study is the first to link the progression of Type 1 diabetes to changes in the extracellular matrix, the carbohydrate- and protein-rich lattice in which the cells composing our tissues are embedded, said senior author Paul Bollyky, from the Stanford University School of Medicine.\nMost pancreatic cells are engaged in manufacturing and secreting digestive enzymes. But the pancreas is also studded with tiny, hormone-producing cell clusters called islets.\nA pancreatic islet is composed of several cell types, each making a different hormone. Beta cells produce insulin.\n“In Type 1 diabetes, only the beta cells get destroyed,” said Bollyky.\nWhy this happens is poorly understood, researchers said. But it is known that during the disorder’s early stage, pancreatic islets become inflamed.\nBy the time a person begins to manifest the disease’s hallmark symptom, chronic hyperglycemia, some 90 per cent of pancreatic beta cells have been killed off.\nIn a 2014 study, Bollyky’s team found that hyaluronan was overly abundant near the pancreatic beta cells of people with Type 1 diabetes.\nBut this was seen only in pancreatic tissue from patients who had been somewhat recently diagnosed, not patients who had lived with the disease for decades.\n“We wondered what would happen if we prevented that buildup. And we knew a drug that does that,” Bollyky said.\nThe drug was hymecromone, or 4-methylumbelliferone (4-MU). Prescribed in many European and Asian countries for painful, gallstone-associated spasms, 4-MU inhibits hyaluronan synthesis.\nWhen the researchers, including co-author Vivekananda Sunkari, a postdoctoral scholar at Stanford University, initiated 4-MU treatment before the majority of the mice’s beta cells had been wiped out, none of the mice developed hyperglycemia.\nIf mice stayed on a 4-MU regimen, they remained diabetes-free for at least a year. But if the regimen was stopped, they quickly became diabetic, researchers said.\nThe study was published in the Journal of Clinical Investigation.\n 16, 2015 10:34 am", "external_links": [], "published": "2015-09-16T18:34:00.000+03:00", "crawled": "2015-09-17T22:19:27.368+03:00", "highlightTitle": ""}