{"organizations": ["Zillow Group", "Zillow", "Zillow Group, Inc"], "uuid": "1166484d90225b4dd6e7c456f24d9726e257cd6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://g.foolcdn.com/editorial/images/178595/zillow-stock-mobile-app.jpg", "site_section": "http://finance.yahoo.com/rss/PropertyManagement", "section_title": "Yahoo! Finance: Property Management Industry News", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=133tou1jp/*http://www.fool.com/investing/general/2015/09/05/why-zillow-group-inc-just-sold-a-subsidiary.aspx?source=eogyholnk0000001", "country": "GB", "title": "Why Zillow Group, Inc. Just Sold Another Subsidiary", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why Zillow Group, Inc. Just Sold Another Subsidiary", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T18:00:00.000+03:00", "replies_count": 0, "uuid": "1166484d90225b4dd6e7c456f24d9726e257cd6a"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=133tou1jp/*http://www.fool.com/investing/general/2015/09/05/why-zillow-group-inc-just-sold-a-subsidiary.aspx?source=eogyholnk0000001", "ord_in_thread": 0, "title": "Why Zillow Group, Inc. Just Sold Another Subsidiary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steve Symington"], "text": "Motley Fool Mobile Why Zillow Group, Inc. Just Sold Another Subsidiary The online real estate leader just announced the sale of Market Leader. Here's what investors need to know. Steve Symington TMFSymington Sep 5, 2015 at 11:00AM Online real estate giant Zillow just sold its Market Leader subsidiary to Constellation Software. Credit: Zillow Group, \nWith the closing of its acquisition of competitor Trulia in February 2015, Zillow Group ( NASDAQ:Z ) ( NASDAQ:ZG ) became the largest business of real estate and home-related brands on the Internet. But earlier this week, Zillow got just a little bit smaller. \nSpecifically, late Thursday Zillow announced the pending sale of its Market Leader real estate CRM business to Constellation Software for $23 million. Under the deal, which is expected to close early in the fourth quarter, Market Leader will join Constellation's Perseus Division. \nNo surprise For perspective, Zillow inherited Market Leader as part of the Trulia acquisition. In April of this year, Zillow told investors while it would continue to support Market Leader products for existing customers, it was no longer actively selling Market Leader advertising or CRM products to new clients, primarily as it began to evaluate how the software company could mesh with Zillow Group's current strategic vision. Zillow Group CEO Spencer Rascoff further promised a determination of whether to integrate or divest Market Leader would happen by the end of 2015. Since then, Market Leader sales have been reported separately from the rest of Zillow Group's revenue in each quarterly announcement. \n\"Since we closed our acquisition of Trulia,\" explained Zillow Group CFO Kathleen Philips in this week's press release, \"we've been assessing how Market Leader would fit with our broader business strategy, and we felt that Market Leader's customers and employees would be best served by a company with deep roots in delivering enterprise software, and by a company for whom Market Leader would be a core offering.\" \nTo be sure, Perseus president Dexter Salna added, \"We see an incredible opportunity to take the solid foundation that already exists to invest and grow Market Leader's products, services, and employees.\" \nThe big loss that wasn't But while the sale of Market Leader shouldn't come as a big surprise, the seemingly low $23 million price is sure to raise some eyebrows. After all, Trulia acquired Market Leader in mid-2013 for a whopping $355 million. \nTo be fair, however, Market Leader today isn't the same business Trulia purchased. For one, in mid 2014 Trulia laid off several Market Leader senior executives and 85 other employees as part of its integration into the larger brand. And less than three months ago, Zillow sold ActiveRain -- a real estate-centric social networking, blogging, and training platform that was acquired by Market Leader in 2012 -- to the Ben Kinney family of companies for an undisclosed sum. \nThis also doesn't mean Zillow is cutting off Market Leader altogether. Rather, Market Leader will continue to partner with Zillow Group through the Zillow Tech Connect Platform. For perspective, Zillow Tech Connect was launched in late 2013, and enables partners' software to directly interface and manage contacts from the company's massive monthly base of 141 million unique users. Or as Philips put it in this week's announcement, Zillow Tech Connect is a natural fit to partner with Market Leader as it seamlessly \"sends Premier Agents' leads into any CRM of their choosing.\" \nIn the end, it's nearly impossible to fully reconcile the price for which Zillow sold Market Leader with Trulia's much larger acquisition cost. But given the changes that occurred in the businesses between now and then, I think Zillow investors should be happy their company now enjoys an even clearer path forward as a result of this sale. \nThe next billion-dollar iSecret The world's biggest tech company forgot to show you something at its recent event, but a few Wall Street analysts and the Fool didn't miss a beat: There's a small company that's powering their brand-new gadgets and the coming revolution in technology. And we think its stock price has nearly unlimited room to run for early in-the-know investors! To be one of them, just click here . \nSteve Symington has no position in any stocks mentioned. The Motley Fool owns and recommends Zillow Group (A shares) and Zillow Group (C shares). Try any of our Foolish newsletter services free for 30 days . We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . Compare Brokers Steve Symington Fool Contributor As a technology and consumer goods specialist for the Fool, Steve looks for responsible businesses which positively shape our lives. Then he invests accordingly. Enjoy his work? Connect with him on Twitter & Facebook so you don't miss a thing.", "external_links": [], "published": "2015-09-05T18:00:00.000+03:00", "crawled": "2015-09-05T18:13:34.187+03:00", "highlightTitle": ""}