{"organizations": [], "uuid": "95c3fe2b5327e55716eac4e93d6f8db0a3a88bf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/JqwhQjoxsgWYWsuz7IMguw--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/https://s1.yimg.com/os/publish-images/finance/2015-09-03/80dc7420-522f-11e5-9562-4db3ad6f6fd2_YS-VM-In-Partnership-with-1-.gif.cf.png", "site_section": "https://uk.finance.yahoo.com/news/provider-yahoofinance/?format=rss", "section_title": "Finance News | Yahoo! Finance UK - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/ever-thought-of-building-your-own-museum--this-guy-did-132636045.html", "country": "US", "title": "Ever Thought Of Building Your Own Museum? This Guy Did", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Ever Thought Of Building Your Own Museum? This Guy Did", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T16:26:00.000+03:00", "replies_count": 0, "uuid": "95c3fe2b5327e55716eac4e93d6f8db0a3a88bf3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ever-thought-of-building-your-own-museum--this-guy-did-132636045.html", "ord_in_thread": 0, "title": "Ever Thought Of Building Your Own Museum? This Guy Did", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Sep 21, 2015, 23:34 BST - UK Markets closed Ever Thought Of Building Your Own Museum? This Guy Did We meet Steve Davies who decided to spend his retirement in a rather unusual way. By Ben Falk | Yahoo Finance UK – 9 hours ago Print \nWhen Steve Davies opened the Dinosaurland Fossil Museum in 1995, it housed 113 exhibits. Twenty years later, if you visit you’ll be able to see 10,632.It’s been an amazing journey for Steve and his wife Jenny, who founded the museum after Steve resigned from his job as a paleontologist with BP.“We moved down to the Lyme Regis part of the world and if you’re into fossils this area is paradise on Earth,” explains Steve of how Dinosaurland come to be. “I’ve been coming here on and off all my life. It seemed like a good place to move.”He took five years off to figure out what to do. Casual jobs included being a visiting lecturer at Exeter University and freelance motivational work with league football clubs, trying to get them to perform beyond their expectations.“One day, I happened to look in a paper and the building my museum is housed in came on the market,” he remembers. “I happened to look at it the only day it was advertised. I thought I could do something with it. It’s an old Grade 1 listed congregational church. It’s the church where the great fossil pioneer Mary Anning was baptised and where she worshipped most of her life. It’s got all sorts of wonderful historical connections and is a space that’s perfect for displaying fossils. It seemed like the right thing to do, so we did it.”It’s been incredibly hard work and now the pair are able to take money out of their pension fund and use it into the business, which is self-financing and doesn’t get any government subsidies. As well as maintaining the property, Steve taps into his network of fossil gurus around the world to find new specimens.“I get the double advantage that if you buy the right thing, there’s great capital growth,” he says. “I’m really lucky that pension rules have changed – it’s a fabulous advantage for me at the moment. All of my time at BP was spent overseas and fossil people are a bit incestuous so I’ve got a network of friends around the world who look out for special pieces for me. Sometimes, I’ll get a phone call saying, ‘I’ve got this fabulous thing, it’s going to cost this much, let me know in half-an-hour.’ “I’ve got some wonderful Russian trilobites, maybe the best in the country and those, I had half-an-hour to agree to buy them or not.”Summer is spent looking after the museum visitors, while the winter is generally devoted to looking for new fossils on the beaches around Lyme Regis with fellow enthusiasts. Above all, explains Steve, the museum is about a personal connection.“All the text [about the exhibits] is written in the first person,” he says. “We don’t employ anyone, it’s just me and my wife. We feel that if people want to come along and spend money to see our fossil collection they ought to get to talk to us about it if they want. We meet all sorts of lovely people – it’s not a job, it’s sheer fun.”“I could never imagine selling the place,” he admits. “Later on in the day it may well be I need to employ someone to help me, but I could never leave it, it’s much too personal.”Above all though, he can’t believe he actually gets to do this every day.“One of the themes in my museum is that things happen by chance,” he says. “I never dreamed of doing my own museum, but now I look back on it, I can’t believe how perfect it is for me. I’m so lucky and all by chance – isn’t that brilliant?”Learn more about the Dinosaurland Fossil Museum and how to visit here .", "external_links": [], "published": "2015-09-21T16:26:00.000+03:00", "crawled": "2015-09-22T01:34:59.173+03:00", "highlightTitle": ""}