{"organizations": [], "uuid": "6b19ed10f0ab9920cbd83aa832d3930dcafe3b7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KJ190_CPARTS_G_20150918005459.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1442829980", "country": "US", "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "Today’s Top Supply Chain and Logistics News From WSJ - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T14:06:00.000+03:00", "replies_count": 0, "uuid": "6b19ed10f0ab9920cbd83aa832d3930dcafe3b7e"}, "author": "Paul Page", "url": "http://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1442829980", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nChina’s strategy for becoming a global force in car production is starting deep in the auto manufacturing supply chain. The WSJ’s Colum Murphy and Jeff Bennett report that China’s automobile companies have identified car-parts plants as central to their efforts to move into global markets . That’s taken China’s SAIC Motor Co., for instance, to take control of plants such as a Riverside, Mo., factory that assembles door handles and other parts for General Motors Co. China’s investment in auto companies abroad grew nearly six-fold last year, and not because they’re trying to corner the market in low-margin parts. They are gaining a foothold in the complex distribution channels that form auto production. It’s a departure from the approach Japan’s auto giants used when they built up global demand through exports before they established assembly plants abroad. China’s manufacturers don’t have immediate plans to sell cars in the U.S., but they’ll have the supply chains in place if that’s t what they plan over the long haul.\nUnited Parcel Service Inc. UPS -2.29 % is trying to get ahead of the manufacturing movement towards 3-D printing . The WSJ’s Lindsay Ellis and Laura Stevens write the parcel carrier recently rolled out 100 industrial-grade 3-D printers at its Lousiville, Ky., air hub to make everything from iPhone gizmos to airplane parts. It’s no simple service test for UPS: 3-D printing could have a profound impact on industrial supply chains, from shortening distribution channels to severely reducing the need for inventory for many manufacturing parts and even consumer goods. Shipping companies want to understand the impact and, as UPS puts it, whether to treat 3-D printing as a threat or a service opportunity. FedEx Corp. FDX -2.80 % and Amazon Inc. have their own studies underway, and it looks like the carriers think the best result would be that the printing opens a new market for local production and delivery.\nBoeing Co. BA -0.99 % is bringing a big part of its 747-8 production in-house , but not because the company wanted to change its manufacturing strategy. The WSJ’s Jon Ostrower reports Boeing is taking over assembling fuselage panels from a unit of Triumph Group Inc., one of its largest suppliers , after the company faced quality and schedule challenges. The move will trigger shifts in Boeing’s larger supply chain since it will move manufacturing from Triumph’s California plant to Macon, Ga., where Boeing will make the commercial aircraft parts. It’s an example of the big impact that changes in suppliers can have on a manufacturer: Boeing has had fuselage panels built at the Hawthorne, Calif., site since the 1960s, but the plant has changed ownership several times over the years and now may fall off the manufacturing map unless Triumph finds a new customer.\nTRANSPORTATION ENLARGE Housings at a Saginaw, Mich., auto parts plant run by Nexteer, owned by a Chinese manufacturer controlled by a Beijing city investment group. Photo: SEAN PROCTOR FOR THE WALL STREET JOURNAL Norfolk Southern Co. is showing less interest in niche rail freight business. The railroad says it is restructuring its Triple Crown Services subsidiary, but NS really is all but eliminating the $350 million business. The WSJ’s Lindsay Ellis reports NS is cutting all but 40 of the 240 jobs at Triple Crown and maintaining only auto parts service between Detroit and Kansas City . NS calls the move a “natural evolution” for the railroad, but it’s an evolution triggered by changes in the commodities market. Falling commodity prices and shipment demand have cut into the earnings at major railroads. NS is responding by simplifying operations, which makes Triple Crown potentially troublesome. The business uses specialized RoadRailer equipment that means NS must manage cars separate from the standard intermodal and carload equipment in the railroad’s network.\nFor a look at where questions over highway funding are heading , take a look at Norway. The WSJ’s Kjetil Malkenes Hovland writes that generous subsidies for electric cars are straining the country’s public finances and its ability to maintain roads, bridges and tunnels . At one site, electric cars make up a quarter of the traffic that use a $70 million tunnel yet pay no fee because of policies aimed at curbing carbon emissions. In fact, one in every five new cars sold in Norway in June was electric. The government estimates it will lose over half a billion dollars in tax revenue on electric cars this year. Norway’s dilemma suggests the difficult questions such financial incentives present, and it looms over talks involving a federal highway bill. Although U.S. incentives don’t match those in Norway, electric vehicles provide little backing for highway funds because they skimp on the fuel consumption that brings tax revenue.\nQUOTABLE\n‘ Should we be threatened by it or should we endorse it? ’\n—Dave Barnes, UPS chief information officer, on 3-D printing.\nIN OTHER NEWS John Williams, president of the Federal Reserve in San Francisco, says a rate increase in 2015 still appears “appropriate” after the Fed maintained existing rates last week. (WSJ)\nA tentative Fiat Chrysler Automobiles NV labor contract would shift some existing U.S. factory work to Mexico while bringing production of more lucrative vehicles to U.S. plants. (WJS)\nVolkswagen AG suspended sales of four-cylinder TDI cars in the U.S. amid an emissions investigation. (WSJ)\nJapan’s exports rose 3.1% in August. (WSJ)\nThe U.S. oil-rig count has fallen for three straight weeks. (WSJ)\nApple Inc. registered its mobile-payment service with a Chinese free-trade zone. (WSJ)\nA senior United Parcel Service Inc. executive says digital currency such as bitcoin may boost global trade . (pymnts.com)\nHome Depot Inc. HD -2.37 % opened a 1.6-million-square-foot distribution center in Toledo, Ohio , its third in the U.S. aimed only at filling online orders. (Toledo Blade)\nThe largest U.S. aerospace group says more companies are considering moving factory work abroad because of the shutdown of the Export-Import Bank. (Reuters)\nContainer ship owner Seaspan Corp. signed an $1 billion credit facility with China’s Export-Import Bank. (JOC)\nMaersk Tankers, a unit of A.P. Moller-Maersk A/S, ordered nine medium-range tankers capable of carrying petroleum products. (Reuters)\nAn Australian firm is under investigation for claiming cut-rate global door-to-door delivery while continually losing shipments by the scores. (Sydney Morning-Herald)\nIndia’s rupee depreciation will have a mixed impact on the country’s apparel manufacturing and export business. (Sourcing Journal)\nFood delivery service GrubMarket closed $10 million in new financing. (TechCrunch)\nMediterranean Shipping Co. took a 45% stake in Italy’s Trieste Marine Terminal. (IHS Maritime)\nABOUT US Paul Page is deputy editor of WSJ Logistics Report. Follow him at @PaulPage , and follow the entire WSJ Logistics Report team: @brianjbaskin , @lorettachao , @RWhelanWSJ and @EEPhillips_WSJ , and follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWith one click, subscribe to this email newsletter .\nReach the Logistics Editors at logisticseditors@wsj.com .\nWrite to Paul Page at paul.page@wsj.com", "external_links": ["http://www.pymnts.com/in-depth/2015/logistics-and-bitcoin-a-match-made-for-global-trade/#.Vf1OPei9KK3", "https://sourcingjournalonline.com/rupee-depreciation-weighs-on-indias-textile-sector/", "http://si.wsj.net/public/resources/images/BN-KJ190_CPARTS_P_20150918005459.jpg", "http://www.joc.com/maritime-news/ships-shipbuilding/seaspan/shipowner-seaspan-secures-1-billion-chinese-credit-facilities_20150918.html", "https://twitter.com/WSJLogistics?lang=en", "https://twitter.com/LorettaChao?lang=en", "http://si.wsj.net/public/resources/images/BN-KJ190_CPARTS_H_20150918005459.jpg", "https://twitter.com/EEPhillips_WSJ?lang=en", "http://www.toledonewsnow.com/story/30062600/home-depot-to-open-new-wood-co-fulfillment-center-Friday", "http://si.wsj.net/public/resources/images/BN-KJ190_CPARTS_M_20150918005459.jpg", "http://www.smh.com.au/nsw/australian-shipping-firm-discount-freight-under-investigation-over-vanishing-valuables-20150916-gjo6wo.html", "http://www.reuters.com/article/2015/09/18/maersk-samsung-heavy-orders-idUSL5N11O20620150918", "https://twitter.com/brianjbaskin?lang=en", "https://twitter.com/RWhelanWSJ?lang=en", "http://techcrunch.com/2015/09/18/farm-to-fridge-food-delivery-service-grubmarket-grabs-10m-series-a/", "https://twitter.com/PaulPage", "http://www.businessinsider.com/r-more-us-firms-eying-overseas-moves-given-exim-lapse-aia-2015-9", "http://www.ihsmaritime360.com/article/19300/msc-to-boost-its-volumes-in-triestehttp:/www.ihsmaritime360.com/article/19300/msc-to-boost-its-volumes-in-trieste"], "published": "2015-09-21T14:06:00.000+03:00", "crawled": "2015-09-21T13:16:24.732+03:00", "highlightTitle": ""}