{"organizations": [], "uuid": "72ce246fb9767273095f4813e2cc72dd3392ff7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/us-pursues-case-against-chinese-131736417.html?l=1", "country": "GB", "title": "US pursues case against Chinese army hackers", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "US pursues case against Chinese army hackers - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 10, "uuid": "38fc827b07263fce986c4bc9b34c7b5bd329fd0f"}, "author": "Gina Chon in Pittsburgh, Pennsylvania", "url": "http://finance.yahoo.com/news/us-pursues-case-against-chinese-131736417.html?l=1#post-0", "ord_in_thread": 0, "title": "US pursues case against Chinese army hackers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The May 2014 indictment of five Chinese soldiers accused of hacking US companies to steal trade secrets seemed to be the end of the road and the case had gone quiet.\nBut US authorities are warning the case is still very active, and they are intensely pursuing ways to bring the suspects, who are believed to still be in China, to justice. The issue is personal to prosecutors and FBI agents in Pittsburgh, who brought the case and have seen the local economy hurt by the hacks. \n\"We are using every legal and diplomatic means,\" said David Hickton, the US Attorney in Pittsburgh, of further action on the People's Liberation Army soldiers, although he declined to discuss specifics. \"We are being patient, persistent and creative in how we pursue this case.\"\nEconomic cyber espionage linked to China is a major topic during the visit of Chinese President Xi Jinping, who will be in Washington on Thursday for his first state visit. Ahead of Mr Xi's arrival at the White House, President Obama issued stern words, saying stealing commercial secrets is \"an act of aggression that has to stop\".\nMore from the Financial Times \nCloudflare raises funds for China push Kara Stein urges SEC to act over cyber attacks Obama warns China of cyber retaliation Russian hacker admits data breach charges Without an extradition agreement, it seems doubtful that the PLA soldiers would be brought to the US to face prosecution. But Mr Xi has been taking a conciliatory tone and told business executives in Seattle on Tuesday that China would support a joint dialogue with the US on fighting cyber crimes. \n\"It is time for us to, once and for all, come to a common agreement about acceptable state behaviour on the Internet,\" John Carlin, Assistant Attorney General, said in a speech on Wednesday in Pittsburgh, and mentioned China's alleged campaign to steal trade secrets. \"When those norms are not abided by, we must hold responsible individuals and entities accountable and increase the costs of their activity.\"\nBefore Mr Xi's arrival, Obama administration officials debated the timing of potential Chinese sanctions in retaliation for hacks but ultimately decided to not make such a move before his visit. The sanctions could be imposed in cases that have already produced indictments, such as the PLA case. \nThe indictment of the Chinese soldiers was the first of its kind and reflects the unique role that Pittsburgh authorities have carved out in the US government's fight against hackers.\nThere were many naysayers when the idea of charging the PLA soldiers was first brought up, while some government officials also worried about the political sensitivities of angering a key economic partner like China. \nThe tabular content relating to this article is not available to view. Apologies in advance for the inconvenience caused.\n>\"It's not a proper exercise of my job to be concerned about that. Those are discussions that happen way above me,\" Mr Hickton said. \"These hacks are a direct assault on our industry and I wasn't going to just stand by and let it happen.\" The victims of the PLA case were some of the country's most iconic companies, such as US Steel, which has its headquarters in Pittsburgh. Mr Hickton personally knew former US Steel chief executive John Surma, which is how he learnt of the company's suspicion about hackers.\nMany of the federal prosecutors and agents in Pittsburgh are longtime residents, allowing them to build the trust that was necessary to encourage hacked companies to come forward.\nSince the PLA case, Mr Hickton and the FBI in Pittsburgh have made other unprecedented moves in targeting cyber crime, with 70 people being charged or facing search warrants in July in the largest takedown of a cyber crime forum, known as Darkode. \nThe case also reflected unique co-operation with global authorities in the investigation that spanned 20 countries. Darkode was used by cyber criminals as a black market for credit card data, hacking tools, ransomware, email addresses and other information. \n\"That's the next evolution and future of cyber prosecution,\" said Scott Smith, head of the Pittsburgh office of the FBI, which infiltrated Darkode. \"We've never had that kind of on-the-ground co-operation from that many countries and we'll see more of it in the future.\"\nAnother boost to Pittsburgh's ability to target hacks is the National Cyber Forensics and Training Alliance, a non-profit partnership between the FBI and private sector. The alliance collects intelligence on malware, botnets and other tools of hackers, and also helps the FBI in cases, like taking down the Gameover Zeus botnet that infected up to 1m computers. \n\"They tell us where threats are. They are in the trenches,\" said the FBI's Thomas Grasso. \"They are on top of what's causing the most damage so we can be ready.\"\nCopyright © 2015 The Financial Times Limited. Please don't cut and paste FT.com articles and redistribute by email or post to the web.\nPittsburgh President Obama FBI China", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T00:28:37.329+03:00", "highlightTitle": ""}