{"organizations": [], "uuid": "6dfd30e1c3ee35caaed66649b1c9d2d0e0821634", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/targetdog-1231_600x400.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://finance.yahoo.com/news/what-qualifies-as-a-tech-company--anyway--185317449.html", "country": "GB", "title": "5 Retailers Jim Cramer Is Watching Now", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "5 Retailers Jim Cramer Is Watching Now", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T21:13:00.000+03:00", "replies_count": 0, "uuid": "6dfd30e1c3ee35caaed66649b1c9d2d0e0821634"}, "author": "", "url": "http://finance.yahoo.com/news/what-qualifies-as-a-tech-company--anyway--185317449.html", "ord_in_thread": 0, "title": "5 Retailers Jim Cramer Is Watching Now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jim Cramer"], "text": "Reprint \nNEW YORK (TheStreet) -- Target ( TGT - Get Report ) is one of the five retail stocks Jim Cramer has his eye on after more volatility this week on Wall Street. \nCramer, the portfolio manager of Action Alerts PLUS , notes that Target is one of the stocks he currently holds in the fund. \"Target is now down dramatically from when they blew the number out but then gave tepid guidance in order to temper expectations,\" said Cramer. He also pointed to GameStop ( GME - Get Report ) , which did the same thing on the earnings front, with the CEO under-promising so he could over-deliver. \nThere were a few other stocks Cramer took a look at following Tuesday's steep selloff, including Best Buy ( BBY - Get Report ) , which he likes as a play on the strong housing market, and Dollar Tree ( DLTR - Get Report ) . \n\"I've gone over Dollar Tree with a fine-tooth comb,\" said Cramer. 'This stock is now down from $83; when it gets in the mid-$60s, you want to buy it because they've now reduced expectations really dramatically.\" \nFinally, Cramer said to watch Walmart ( WMT - Get Report ) , with its 3% yield. \"If that can't hold, that's not necessarily a sign of how bad Walmart's doing, that's a sign of how much retail is hated.\" \nCramer also commented on Tuesday's market action, saying it was a retest of last week's lows. Cramer said of the 500 stocks in the S&P, 70 violated their lows, but only 30 of those stocks violated their lows by more than 1%. He went on to say that some people regard that as a successful retest, and the stock technicians are in charge. He advised investors to read what TheStreet 's in-house technical analyst, Bruce Kamich, is writing about, noting he's been \"very, very negative, and very right.\" Early Wednesday, Cramer was cautious on the stock market rally, saying it's best for investors to wait until the afternoon before deciding whether or not to buy stocks <p></p><em> At the time of publication, Jim Cramer's charitable trust Action Alerts PLUS held shares of TGT.</em> Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-09-02T21:13:00.000+03:00", "crawled": "2015-09-02T23:18:21.082+03:00", "highlightTitle": ""}