{"organizations": [], "uuid": "b706a6d43d677a00d4a593ab06411f815cb79c39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/f/8/m/4/image.related.afrArticleLead.620x365.gjewol.png/1441349052401.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/world/china-triggers-regional-nuclear-race-20150903-gjewol", "country": "AU", "title": "China triggers regional nuclear race", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "China triggers regional nuclear race | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T12:40:00.000+03:00", "replies_count": 0, "uuid": "b706a6d43d677a00d4a593ab06411f815cb79c39"}, "author": "Angus Grigg", "url": "http://www.afr.com/news/world/china-triggers-regional-nuclear-race-20150903-gjewol", "ord_in_thread": 0, "title": "China triggers regional nuclear race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "According to a new paper from the Lowy Institute, both China and India are moving from the \"test and design\" phase to active deployment of sea-based nuclear weapons. Kevin Frayer/Getty Images Add into this mix the prospect of Pakistan and North Korea obtaining similar capabilities and the author's are understandably sanguine about the ability of such weapons to act as a deterrent or force for stability across the region.\n\"Stability in the new Indo-Pacific nuclear balance remains many years away, and will be precarious even if attained,\" they wrote.\nMuch of this instability can be attributed to China which has spent the last decade modernising its military and now has the world's second-biggest defence budget behind the US.\nAccording to the International Institute of Strategic Studies in London, China accounts for 38 per cent of defence spending in Asia, up 10 percentage points in just four years.\n Such a rapid rise has forced its neighbours to respond , including Japan which said late last month it would seek parliamentary approval for its largest ever defence budget.\nBut Beijing's ambitions are not just confined to its submarines, which ventured into the Indian Ocean for the first time in 2013.\nAccording to Taiwan's Defence Ministry, China is building two new aircraft carriers to complement its existing vessel, bought from Ukraine in 1998.\nThe report obtained by Reuters said the ships were being built in Shanghai and Dalian, but gave no timeframe on when they might be operational.\nChina's existing aircraft carrier, the Liaoning, has taken part in military exercises, but is not expected to be fully operational for some years.\nIt got a small mention during Thursday's giant military parade through central Beijing where the focus was on China's home-grown military technology.\nIn keeping with this spirit, President Xi Jinping eschewed the traditionally western suit favoured by most Chinese leaders these days.\nInstead, he chose a slate-grey, high buttoned suit made famous by Sun Yat-sen, but named after the founder of Communist China, Mao Zedong.\nOn social media the suit created some buzz, but more comments were made about Xi's decision not to wear a military uniform. This and his left handed salute were interpreted as signs that China was not a war.\nIt should be noted that while the Mao suit is meant to represent \"proletarian unity\", it also symbolises \"permanent revolution\", a concept favoured by Mao.\nDuring a 2014 state dinner in the Netherland, Xi was also seen in a Mao suit, which Xinhua said \"displayed the leader's national pride and confidence in Chinese culture\".\nThere was plenty of this confidence on display during Thursday's parade as Xi inspected the troops in an open top car, occasionally shouting \"good morning comrades\" and \"hard working comrades\".\nIn a brief address before the parade, he announced a troop cut of 300,000 for the People's Liberation Army, which is the fourth reduction in 35 years.\nThen it was on with the parade where Xi's protestations of China's \"peaceful rise\" were somewhat undermined by the official commentary.\n\"Look at this missile, it can hit Hawaii,\" said one commentator. Other state media also made no attempt to down-play the capability of the weapons on display.\nXinhua's official Twitter account posted a photo of the Dongfeng 21D taking part in the parade and referred to it as the \"carrier killer\", as has the missile has the potential to destroy an aircraft carrier from over 900 kilometres away.\nOther posts included photos of China's inter-continental strategic missiles, which Xinhua said were \"designed to carry nuclear warheads\".", "external_links": [], "published": "2015-09-04T12:40:00.000+03:00", "crawled": "2015-09-04T10:09:27.009+03:00", "highlightTitle": ""}