{"organizations": [], "uuid": "b90e6c7c21e9d58cec11ddd464f385a45fb5b798", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/", "section_title": "Forbes - Personal Finance Information and Personal Finance News - Forbes.com", "url": "http://www.forbes.com/sites/timtodd/2015/08/31/7th-circuit-holds-false-claims-act-qui-tam-awards-are-ordinary-income/", "country": "US", "title": "7th Circuit Holds False Claims Act Qui Tam Awards Are Ordinary Income", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "7th Circuit Holds False Claims Act Qui Tam Awards Are Ordinary Income", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T11:06:00.000+03:00", "replies_count": 0, "uuid": "b90e6c7c21e9d58cec11ddd464f385a45fb5b798"}, "author": "Timothy M. Todd", "url": "http://www.forbes.com/sites/timtodd/2015/08/31/7th-circuit-holds-false-claims-act-qui-tam-awards-are-ordinary-income/", "ord_in_thread": 0, "title": "7th Circuit Holds False Claims Act Qui Tam Awards Are Ordinary Income", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Seventh Circuit Court of Appeals recently addressed the tax treatment of a qui tam relator’s award. This was a matter of first impression in the Seventh Circuit, which handles federal appeals from Illinois, Indiana, and Wisconsin. The taxpayer filed a qui tam action under the False Claims Act, alleging that a company defrauded the government. The False Claims Act imposes liability for presenting to the United States a false or fraudulent claim for payment or approval. The Act also permits a private person, known as a relator, to bring a lawsuit on behalf of the government. The government may intervene in the lawsuit, and should it win using non-public information provided by the relator, the relator is entitled to a portion of the recovery. See 31 U.S.C. § 3730(d)(1).The government intervened in the taxpayer’s qui tam suit and eventually settled with the company, which paid over $75 million. Because the government used the non-public information, the taxpayer received more than $5.9 million. The taxpayer later filed other FCA actions against other companies, and after those companies settled, the taxpayer additionally received almost $900,000.On his tax return, which he filed jointly with his wife, the taxpayer reported the settlement proceeds as a capital gain. The IRS assessed a deficiency, asserting that the recoveries were not capital gain income and were thus subject to ordinary income rates. Consequently, the IRS assessed additional tax. The taxpayer petitioned the Tax Court, which ultimately sustained the IRS’s position and held that the qui tam recoveries were properly characterized as ordinary income. See 142 T.C. 124 (Feb. 24, 2014), available here .On appeal, the sole issue before the Seventh Circuit was the proper characterization of the qui tam payment, i.e., was it capital gain or ordinary income.A gain is a capital gain if it results from the sale or exchange of a capital asset. See I.R.C. § 1222(3). But, if the qui tam payment is a reward designed to “compensate the relator for his work in bringing the qui tam suit,” then it should be properly treated as payment for services, i.e., ordinary income.The court noted that other “[c]ourts have consistently described a relator’s share as a ‘bounty’ or ‘reward’ for the efforts a relator puts forth to gather evidence and file a qui tam suit.” See Vt. Agency of Natural Res. v. United States ex rel. Stevens , 529 U.S. 765, 772 (2000); Roberts v. Accenture , LLP, 707 F.3d 1011, 1016 (8th Cir. 2013) (using the language “finder’s fee”); Riley v. St. Luke’s Episcopal Hosp. , 252 F.3d 749, 752 (5th Cir. 2001) (using the term “reward”).Based on those cases (and others), the court concluded that “a relator’s award is a payment for services performed, and therefore, that the award must be claimed as ordinary income.” This is in accord with the only other circuit case to date, Alderson v. United States , 686 F.3d 791 (9th Cir. 2012), which held similarly that the qui tam award is ordinary income to the relator.To treat the gain as capital would “contravene the long-recognized rule that a ‘capital gain’ generally involves a ‘realization of appreciation in value accrued over a substantial period of time’ of an initial investment of capital,” the court noted. Moreover, the taxpayer “made no initial investment in some asset.” Rather, he expended time and effort in discovering and documenting the alleged fraud, which was not an investment of capital.The court also examined the statutory language. Section 1221 defines a capital gain as resulting from the sale or exchange of a capital asset . The term capital asset, defined in § 1221, is property held by the taxpayer (with listed exceptions). The term property , the court explained, normally connotes the ability to exclude others from using it.The taxpayer advanced two arguments to meet the capital asset requirement. First, the “property” was the information that he acquired, which he argued he had a right to stop others from using. The court disagreed, noting that, although the taxpayer did compile documents, the information contained in those documents was available to other employees. Second, he argued that the right to share in the recovery constituted a capital asset. The court disagreed, noting that the award was simply in exchange for his efforts in collecting documents and filing the qui tam suit.In conclusion, the Seventh Circuit affirmed the Tax Court and held that a relator’s share of a qui tam settlement or award is ordinary income.The case is Patrick v. Comm’r , No. 14-2190 (7th Cir. Aug. 26, 2015) and you can read it here .", "external_links": ["http://media.ca7.uscourts.gov/cgi-bin/rssExec.pl?Submit=Display&Path=Y2015/D08-26/C:14-2190:J:Williams:aut:T:fnOp:N:1611265:S:0", "https://www.ustaxcourt.gov/InOpHistoric/PatrickDiv.Kroupa.TC.WPD.pdf"], "published": "2015-09-01T11:06:00.000+03:00", "crawled": "2015-09-01T06:12:19.084+03:00", "highlightTitle": ""}