{"organizations": ["Facebook Messenger", "Google Wallet PayPal", "PayPal", "Google"], "uuid": "9414dc79214febb54106dd8565114a31946a9db6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://g.foolcdn.com/assets/images/fool/tmf-logo.png", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=FB", "section_title": "Yahoo! Finance: FB News", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13adjb8bg/*http://www.fool.com/investing/general/2015/09/14/paypals-new-feature-should-help-it-fight-off-faceb.aspx?source=eogyholnk0000001", "country": "US", "title": "PayPal's New Feature Should Help It Fight Off Facebook Messenger and Google Wallet", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "PayPal's New Feature Should Help It Fight Off Facebook Messenger and Google Wallet", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T15:28:00.000+03:00", "replies_count": 0, "uuid": "9414dc79214febb54106dd8565114a31946a9db6"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13adjb8bg/*http://www.fool.com/investing/general/2015/09/14/paypals-new-feature-should-help-it-fight-off-faceb.aspx?source=eogyholnk0000001", "ord_in_thread": 0, "title": "PayPal's New Feature Should Help It Fight Off Facebook Messenger and Google Wallet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Mattera"], "text": "PayPal's New Feature Should Help It Fight Off Facebook Messenger and Google Wallet Customized links make it easier to send cash online. Sam Mattera Sep 14, 2015 at 8:28AM \nPayPal ( NASDAQ:PYPL ) is making it easier to send money over the Internet. \nEarlier this month, the digital payments giant launched PayPal.Me. The service allows individuals and businesses to create personalized URLs, which they can share with friends, family members, and customers to receive digital payments. PayPal has been facilitating such transfers for years, but PayPal.Me should make the process both faster and easier. \nOther firms, including Google ( NASDAQ:GOOG ) ( NASDAQ:GOOGL ) and Facebook ( NASDAQ:FB ) , compete in the space, but PayPal.Me should give it an advantage. \nReserve your custom URL PayPal has been facilitating person-to-person payments since its inception more than 15 years ago. To be clear, PayPal.Me isn't PayPal offering a new service; rather, it's simplifying the process. \nHere's how it works: PayPal users go to PayPal.Me. There, they log in with their PayPal account and create a customized URL. It can be based off the person's name or business name (PayPal.Me/JaneSmith for example, or PayPal.Me/OnlineSales), making it easy to remember. That URL becomes bound to their account, and anyone that visits it can send them money. \nIn the past, users would have to first log into their PayPal account -- either through the website or with the mobile app -- and then send or request money. A fairly straightforward process, admittedly, but one that required knowledge of the phone number or email address linked to the other person or business's PayPal account. A PayPal.Me URL may be more secure and easier to remember. It's also easier to send in a text, email, or instant message, and can be accessed with any browser (mobile or desktop). It can be embedded in a website, or shared on social media. \nFor individuals, sending and receiving money is free (so long as they use a debit card). Businesses that use it to collect payments must fork over 2.9% plus $0.30 on each sale. Customers are incentivized to record it as a business transaction, as doing so gives them the advantages of PayPal Purchase Protection, protecting them against fraud. \nFacebook Messenger and Google Wallet PayPal.Me should help the company fend off increasing competition. \nGoogle launched Google Wallet in 2011. Originally, it was marketed as a sort of proto- Apple Pay, allowing Android handset owners to use their smartphones to pay in stores equipped with NFC terminals. Most of the major carriers, however, blocked it, and not every Android handset supported it. It's widely viewed as a failure. \nIn May, Google announced Android Pay as its successor, and rebranded Google Wallet as something more akin to PayPal. \"We built the new Google Wallet app from the ground up to give you a fast, free way to send and request money on both Android and iOS devices,\" Google writes on its website . Google Wallet users can send and request money from friends using the Google Wallet app. \nAlso in May, Facebook updated its Messenger app to support person-to-person payments. Messenger users can simply type in a dollar amount -- say, $20 -- to create a link. Clicking that link prompts the other person to transfer that amount of cash to whomever they're chatting with. Like PayPal and Google Wallet, it's free. For the time being, Facebook Messenger does not support business payments (in fact, Facebook states on its website that businesses caught using it could be banned), but it could in the future. Facebook has been working to transition Messenger into a platform for businesses , and adding support for payments seems like a logical improvement. \nIn terms of online person-to-person payments, PayPal is the leader in the space. Forrester Research found that 73% of American adults who make digital payments over the Internet to their friends and family use PayPal ( via Fortune ). Yet its popularity could wane as competition increases. To remain the leader in online payments, PayPal may need to keep improving its service. PayPal.Me does that nicely. \nThe next billion-dollar iSecret The world's biggest tech company forgot to show you something at its recent event, but a few Wall Street analysts and the Fool didn't miss a beat: There's a small company that's powering their brand-new gadgets and the coming revolution in technology. And we think its stock price has nearly unlimited room to run for early in-the-know investors! To be one of them, just click here . \nSam Mattera has no position in any stocks mentioned. The Motley Fool owns and recommends Apple, Facebook, Google (A shares), Google (C shares), and PayPal Holdings. Try any of our Foolish newsletter services free for 30 days . We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . Compare Brokers Sam Mattera Staff Writer Sam has a love of all things finance. He writes about tech stocks and consumer goods. Article Info Sep 14, 2015 at 8:28AM Technology and Telecom", "external_links": [], "published": "2015-09-14T15:28:00.000+03:00", "crawled": "2015-09-14T16:23:31.868+03:00", "highlightTitle": ""}