{"organizations": [], "uuid": "26b9641c3094b85728628bcdf7b8b862839b2b30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/g/x/d/j/image.related.afrArticleLead.620x365.gjrby8.png/1442821380742.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/special-reports/afr-national-policy-series/gst-gap-widens-to-114b-as-consumption-changes-20150921-gjrby8", "country": "AU", "title": "GST gap widens to $11.4b as consumption changes", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "GST gap widens to $11.4b as consumption changes | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T15:43:00.000+03:00", "replies_count": 0, "uuid": "26b9641c3094b85728628bcdf7b8b862839b2b30"}, "author": "Share via Email", "url": "http://www.afr.com/news/special-reports/afr-national-policy-series/gst-gap-widens-to-114b-as-consumption-changes-20150921-gjrby8", "ord_in_thread": 0, "title": "GST gap widens to $11.4b as consumption changes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Australian Premier Jay Weatherill has backed a broadening of the GST to cover financial services. Alex Ellinghausen Share on twitter by Joanna Mather The GST was sold as a cure-all tax for cash-starved states but has fallen well short of expectations, South Australian Premier Jay Weatherill says.\nThe gulf between what the GST was supposed to collect and what it actually brings in has widened to $11.4 billion, or $482 per person, as a result of changes in consumption and saving patterns, Mr Weatherill will tell a tax summit co-sponsored by The Australian Financial Review and KPMG in Sydney this week.\nWhile disposable household income has tracked upwards since the introduction of the GST in 2000, GST receipts have not kept pace.\nThis is because Australians are saving more and spending less on goods and services that attract the GST.\n\"The GST is not the great tax it was promised to be,\" Mr Weatherill said ahead of the summit.\nOn Wednesday he will outline a plan to collect the GST on financial services, which are currently exempt, along with fresh food, education and health.\nThe financial services exemption is estimated by Treasury to be worth $4.7 billion a year.\n When the GST was introduced, the national savings rate was about 5 per cent but in the years since it has doubled to 10 per cent.\nFurthermore, the proportion of income spent on GST-exempt items, particularly health, has grown and continues to grow.\nThe result is a diminishing tax take that left states slightly worse off in 2012 and 2013 than had they not agreed to the GST package.\nThe deal was to swap fixed commonwealth grants for GST revenue and the scrapping of a range of inefficient state taxes.\nReboot tax reform \"It's not tracking very much higher than the taxes it was actually there to replace,\" Mr Weatherill said.\n\"These figures are part of a chain of reasoning which says we need to consider GST reform.\"\nMr Weatherill has called on both main parties to take advantage of Malcolm Turnbull's ascension to the prime ministership to reboot the tax reform debate.\nMr Weatherill and NSW Premier Mike Baird went out on a political limb in July by declaring themselves open to considering a GST increase to fund health and hospitals.\nAccounting firms Deloitte and PwC have released modelling that shows an increase to 15 per cent could leave the government with an extra $25 billion to $29 billion a year even after lower-income households are compensated.\nAnother study by KPMG found that increasing the GST to 15 per cent and extending it to health and education would raise an additional $36.8 billion in 2015-16, although this figure does not include compensation.\nComparatively little modelling has been done to show what would happen if financial services attracted the GST.\nMr Weatherill said both the Henry tax review and financial system inquiry found the absence of GST on financial services distorted the tax system. Applying the GST to financial services was also likely hurt the poor less than if it were extended to fresh food or health, he said.\n\"There is no doubt [health and education] are some of the fastest growing sectors of the economy so what you do by excluding those is you make the GST less of a growth tax,\" Mr Weatherill said.\n\"But we have some modelling that shows taxing health in particular is very regressive and that raises questions about compensation.\"", "external_links": ["https://twitter.com/https://twitter.com/JoannaMather"], "published": "2015-09-21T15:43:00.000+03:00", "crawled": "2015-09-21T14:48:14.329+03:00", "highlightTitle": ""}