{"organizations": [], "uuid": "88e876f9202934ca049e6402b500540b77d9b5e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509280192.html", "country": "US", "title": "Zimbabwe: SDGs - Lifetime Opportunity to Bid Goodbye to Poverty", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: SDGs - Lifetime Opportunity to Bid Goodbye to Poverty", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T10:47:00.000+03:00", "replies_count": 0, "uuid": "88e876f9202934ca049e6402b500540b77d9b5e1"}, "author": "", "url": "http://allafrica.com/stories/201509280192.html", "ord_in_thread": 0, "title": "Zimbabwe: SDGs - Lifetime Opportunity to Bid Goodbye to Poverty", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bishow Parajuli"], "text": "opinion By Bishow Parajuli \nToday marks a historic moment as world leaders are preparing to adopt the new Sustainable Development Goals (SDGs). The 17 SDGs constitutes a vision to put people and our planet on a sustainable path by 2030. \nThese goals will form the bedrock of a new development agenda designed to set the world on a course of action to end poverty, transform lives and protect the planet. \nThe SDGs spell out how we work together to promote dignity, equality, justice, shared prosperity and well-being for all while at the same time protecting the environment. \nWe are the first generation that can end poverty and the last one that can avoid the worst effects of climate change. \nAdopted 15 years ago, the Millennium Development Goals (MDGs) show that millions of people's lives have improved due to concerted efforts to achieve the MDG targets, on whose foundation the SDGs rest. \nGlobally, the MDG targets have been met on poverty reduction, increased access to improved drinking water sources, improvement in the lives of slum dwellers and attainment of gender parity in primary school enrolment. \nIn addition, the likelihood of a child dying before the tender age of five has been cut in nearly half. \nThe maternal mortality ratio has dropped by nearly half. \nMore people are receiving anti-retroviral therapy for HIV-infection today than ever before. \nUpwards of six million deaths from malaria were averted due to substantial expansion of malaria interventions. \nIf these trends are sustained, the world will continue to meet MDGs health targets by the end of 2015. \nIn general, enormous progress has been made under the MDGs, showing the value of a unifying agenda underpinned by goals and targets. \nYet despite the progress, the indignity of hunger and poverty remains as reality for over 800 million people. \nI have learned, from over 30 years of work in humanitarian and development spheres as well as with the United Nations, that setting goals and targets work. \nHere in Zimbabwe, the MDGs were implemented during a difficult economic period. \nDespite the challenges the country faced, with Government leadership, support from the United Nations and development partners, it has made significant progress in some MDGs notably education, health and gender. \nIn the health sector, Zimbabwe has recorded progress in halting and reducing HIV prevalence, which fell from 29.6 percent in 1998 to 14 percent in 2014; increase in anti-retroviral therapy coverage for adults as well as increased coverage of prevention of mother-to-child transmission. \nThis sterling progress on HIV and AIDS, for example, was made possible due to Government's introduction of the AIDS levy, and with the assistance of over one billion US dollars provided by Global Fund, which UNDP helped deliver. \nWith Government engagement and support from our specialised agencies such as WHO, UNFPA and UNICEF as well as with generous financial support from development partners, Zimbabwe has also reduced the maternal mortality ratio by more than half from 1069 deaths per 100 000 live births in 2002 to 526 deaths per 100 000 live births in 2014. \nChild immunisation also registered some progress. \nThe country has also made progress in reducing under-five mortality rate from 120 deaths per 1000 live births in 2000 to 75 deaths in 2014. \nIn Education, with Government leadership and the introduction of a multi-year and multi-donor fund managed by UNICEF a 1:1 pupil to book ratio for core subjects in primary and secondary schools has been maintained while high universal literacy rate of 99 percent was achieved. \nZimbabwe also attained gender equality in primary education and increased enrolment of girls in tertiary education. \nOn environmental sustainability, with support from UNDP, FAO, WFP and UNESCO in wetlands management, conservancies and the introduction of organic farming, the country has also done commendably well particularly in phasing out ozone-depleting substances. \nHowever, more needs to be done in addressing the effects of climate change. \nPope Francis in his recent said, \"I urgently appeal . . . for a new dialogue about how we are shaping the future of our planet. \n\"We need a conversation which includes everyone, since the environmental challenge we are undergoing, and its human roots, concern and affect us all.\" \nEveryone has a role to play and we can add our voices to the ongoing global campaign called \"Road to Paris\" in support of a global deal on climate change which will take place later this year in Paris. \nThe above-mentioned achievements exemplify how partnerships can be nurtured along agreed common development goals such as the MDGs. \nAs Zimbabwe implemented the MDGs, development partners injected $1 billion a year in Official Development Aid, of which $400 million was channelled through the United Nations System to augment national resources. \nGoing forward, with the strong engagement and support of the Unite Nations and development partners Zimbabwe is well poised to implement the SDGs. \nIn this regard, the country has had a series of consultations at both the national and local levels on adaptation and implementation of the SDGs. \nZimbabwe has recognised the need for strong institutions that foster peace, justice and inclusive societies to achieve the SDGs. \nAs provided in the national Constitution, through the establishment of key independent commissions which include national peace and reconciliation commission, the country continues to strengthen social cohesion and effective public service delivery. \nThe United Nations continues to be a strong partner in institutional capacity building as recently reiterated by the UNDP Administrator, Helen Clark, \"as custodians of the UN Resident Coordinator System, UNDP will leverage the full range of UN expertise to help countries identify what works, and to integrate Goal 16 [Peace, Justice and Strong Institutions] targets within their national plans, policies, and budgets\". \nI believe that taking action to achieve the global goals and building greater shared prosperity is in everybody's best interest and provides enormous investment opportunities that stand to benefit the people of Zimbabwe. \nSuccess will be driven by the Government and the people of Zimbabwe. \nIn fulfilling our shared responsibility to implement the SDGs, I can't overemphasise the need to maintain, if not increase, the support that Zimbabwe has received through Official Development Assistance. \nThe UN system in Zimbabwe remains a strong partner in supporting the country to end all forms of poverty and ensure no one is left behind. \nWith the new, interconnected Sustainable Development Goals that apply to all, we can scale greater heights in our common quest and determination to chart a dignified future in and for Zimbabwe, and for all people in the rest of the world. \nBishow Parajuli is UN Resident Coordinator and UNDP Resident Representative in Zimbabwe. Zimbabwe \nAFTER seeing off the challenge from former Vice-President Joice Mujuru in the brutal fight to succeed President Robert … see more » Copyright © 2015 The Herald. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-28T10:47:00.000+03:00", "crawled": "2015-09-28T11:33:51.234+03:00", "highlightTitle": ""}