{"organizations": [], "uuid": "a6f42ca8551ff2ff653f8638284d1bf6786170dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/t/x/6/g/image.related.afrArticleLead.620x365.gjttqw.png/1443069525408.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/hedge-funds/why-ellerston-capital-hedge-fund-likes-banks-and-falling-markets-20150924-gjttqw", "country": "AU", "title": "Why Ellerston Capital hedge fund likes banks and falling markets", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why Ellerston Capital hedge fund likes banks and falling markets | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T10:52:00.000+03:00", "replies_count": 0, "uuid": "a6f42ca8551ff2ff653f8638284d1bf6786170dd"}, "author": "Matthew Smith", "url": "http://www.afr.com/business/banking-and-finance/hedge-funds/why-ellerston-capital-hedge-fund-likes-banks-and-falling-markets-20150924-gjttqw", "ord_in_thread": 0, "title": "Why Ellerston Capital hedge fund likes banks and falling markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Drzewucki: \"We rely on outperformance of one stock over another and you get more of those dislocations in down markets because people panic and they sell things they are less likely to otherwise.\" Supplied The circa 20 per cent sell-off in bank stocks from record highs in March this year is neither here-nor-there for Mr Drzewucki, who will aim to have as many \"long\" as \"short\" positions in his portfolio at any given time.\nThe important thing these particular market segments have in common for him is each of the companies tend to move more-or-less in unison with each other when news or events in their respective segments happen.\n\"Highly correlated\" is the slightly nerdy or technical term hedge fund managers use to describe these segments. Mr Drzewucki refers to stocks within these segments as \"homogenous\".\nIt is within these homogenous segments that he has as built a reputation in the four years Ellerston Capital has been in existence to put his \"pair trading\" strategy into practice. The pair trading strategy is distinct from the more commonly used hedge fund strategy in which the manager makes a call on a broader \"macro\" event, such as commodity prices going down by shorting or betting against the weakest iron ore producers in the segment.\n In his pair trading strategy, Mr Drzewucki will pick two companies that tend to move up and down together simultaneously and take a \"short\" position in one and a \"long\" position in the other. The short or long selection will be made based on which company's shares appear to be outperforming or underperforming their potential at any given time.\n'Opportunity to remove the industry risk' In comparison, a macro hedge fund strategy might bet on the falling price of oil by going short on an oil producer such as Woodside and going long on an oil consumer such as Qantas.\n\"Pairing gives us the opportunity to remove the industry risk and the market risk and focus on creating alpha based on which is the better of the two companies,\" he explained.\nOn average, an Ellerston trade will last only 20 days and then it is onto the next pair.\nFinancials and banks in particular happen to be an excellent place to execute this strategy because of their high correlation to each other and the shifting supply that favours one bank stock over the other at any given time.\nMr Drzewucki explained how he initiated a pair trade between Commonwealth Bank and ANZ in which he invested in CBA and took a short position in ANZ following the institutional placement during the CBA equity capital raising, a position he said still remained in place.\nThe pair trade works better in falling and volatile markets, even though the Ellerston fund is \"market-neutral\", because panic-selling by other investors in the market tends to make the pair disparity happen quicker than it would in a stable market.\n\"We rely on outperformance of one stock over another and you get more of those dislocations in down markets because people panic and they sell things they are less likely to otherwise,\" he said.\nAnd perform it has: For the year to the end of August, Ellerston Australian Market Neutral Fund returned 12.94 per cent (9.6 per cent net of fees) while the ASX/S&P200 returned 2.3 per cent.\nThe Ellerston fund had produced a positive return 13 out of the 15 months the market had produced a negative return over the past four years, Mr Drzewucki said, highlighting the fund's ability to perform in falling markets.\nAnother pair trade that has paid off recently in the building materials segment was a long position in GWA Group paired with a short position in Boral. Both companies tend to move in unison with demand for housing construction generally driven by interest rate movements. But on a side by side basis, Mr Drzewucki said GWA became oversold by the market following a disappointing result during the recent reporting season.\nThe situation created a classic 20-day pair trade for Ellerston, Mr Drzewucki said.", "external_links": [], "published": "2015-09-24T10:52:00.000+03:00", "crawled": "2015-09-24T10:08:52.021+03:00", "highlightTitle": ""}