{"organizations": ["Fed"], "uuid": "2769d97a841239520b74b2011a1a6b9600ea38b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/montgomery-news/rss/627", "section_title": "Montgomery News : Personal Finance", "url": "http://business-news.thestreet.com/montgomery-news/story/why-the-fed-will-wait-on-rates-unless-the-jobs-number-is-huge/13277079", "country": "US", "title": "Why The Fed Will Wait on Rates--Unless the Jobs Number Is Huge", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Why The Fed Will Wait on Rates--Unless the Jobs Number Is Huge", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T18:42:00.000+03:00", "replies_count": 0, "uuid": "2769d97a841239520b74b2011a1a6b9600ea38b6"}, "author": "", "url": "http://business-news.thestreet.com/montgomery-news/story/why-the-fed-will-wait-on-rates-unless-the-jobs-number-is-huge/13277079", "ord_in_thread": 0, "title": "Why The Fed Will Wait on Rates--Unless the Jobs Number Is Huge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Mullaney"], "text": "Why The Fed Will Wait on Rates--Unless the Jobs Number Is Huge Written by: Tim Mullaney 09/03/15 - 11:42 AM EDT Tickers in this article: RATE ADP \nNEW YORK (TheStreet) -- At this point, there's no interest rate hike in September unless Friday's jobs report is a monster. \nIt's always a risk to make predictions that categorically, but the data and the markets alike are making the case for Janet Yellen and the Federal Reserve to wait before raising the federal funds rate for the first time since 2006. The picture might change by December. But if the standard is U.S. growth that is reasonably stable and at or above the long-term trend of about 2.5% a year, with nearly-full employment and some risk of emerging inflation, the Fed should hold off. \n\"Are we there yet?\" asked Bankrate.com economic analyst Mark Hamrick, likening the market's waiting-for-Godot interest rate watch to kids on a long car trip. \"We don't know. But we feel like we're not.'' More Headlines \nThe latest evidence is Thursday's report on U.S. trade, which showed exports up slightly in July but down in key categories like consumer goods, reflecting the dollar's overvaluation in a stressed global economy. More important is Wednesday's report on private-sector hiring from ADP , which showed companies adding only 190,000 workers in August--failing to exceed 200,000 for the sixth time in eight months. And tracking forecasts for third-quarter growth still point to a sharp slowdown from the second quarter: The annual growth rate looks likely to be about 2.5%, bringing the first nine months of 2015 to a clip of 2.2% or so. \nThat's not exactly brisk--especially not heading into the winter, which has disappointed for several years in a row. Especially not when wages still haven't really broken out of their long post-recession torpor (though low inflation is rebuilding purchasing power). Not when there are still nearly 2 million Americans working part-time because they can't find full-time work, when a leading trading partner like China is clearly at risk and when another, Canada, has just entered a recession. Even the jobs report isn't expected to be much: The consensus forecast is that employers added 213,000 jobs in August, a third lower than the norm in late 2014. \nThe uncertainty pervades even the professionals. Bankrate did a mid-August survey of 65 economists in early August asking when the Fed would boost rates, and two-thirds said September. Contacting the same group this week, that was down to 40%, Hamrick said. 1", "external_links": [], "published": "2015-09-03T18:42:00.000+03:00", "crawled": "2015-09-03T19:06:48.546+03:00", "highlightTitle": ""}