{"organizations": [], "uuid": "0b7cc1835245cad076557f5c90007775681a11a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150915113024-financial-advisor-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_pf.rss", "section_title": "Personal finance news - CNNMoney.com", "url": "http://money.cnn.com/2015/09/16/retirement/retirement-investing-strategy/index.html?section=money_pf", "country": "US", "title": "An investing strategy for a $1 million retirement nest egg", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "An investing strategy for a $1 million retirement nest egg", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T14:14:00.000+03:00", "replies_count": 0, "uuid": "0b7cc1835245cad076557f5c90007775681a11a9"}, "author": "", "url": "http://money.cnn.com/2015/09/16/retirement/retirement-investing-strategy/index.html?section=money_pf", "ord_in_thread": 0, "title": "An investing strategy for a $1 million retirement nest egg", "locations": ["Washington", "Seattle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Denise", "Walter Updegrave"], "text": "An investing strategy for a $1 million retirement nest egg By Walter Updegrave @CNNMoney I have roughly $1 million saved and hope to retire in about 10 years. I'm nervous about the market, but also worried that moving out of stocks could leave me with lower returns and a less secure retirement. Any suggestions for how I should invest my savings? --Denise, Seattle, Washington \nInvesting is always a balancing act between risk and return, but it's an especially delicate one as you near and enter retirement. You have to invest aggressively enough to generate the returns you'll need to build a nest egg that can support you comfortably the rest of your life. But you also want to insulate yourself somewhat from market setbacks that could force you to delay or even abandon your post-career plans. \nSo the real question is how do choose a mix of stocks and bonds that can deliver adequate returns while offering adequate downside protection, particularly in a volatile market like this one? There's no single answer; what one investor considers an acceptable tradeoff may be quite different from what another deems appropriate. But following the three steps below should help you arrive at an investing strategy that works for you. \n1. Determine your true tolerance for risk. Given the stock market's recent wild gyrations, it's understandable that you and other investors have gotten jittery. But to set a viable retirement investing strategy, you need to go beyond simply feeling anxious about a possible loss and get a realistic handle on how much you could watch the value of your retirement nest egg drop before you start jettisoning stocks and seeking refuge in less volatile investments . \nOne way to do that is to see how portfolios with different concentrations of stock would have fared in a past severe downturn. From the market's 2007 high to its 2009 low, for example, stocks lost roughly 60% of their value while bonds gained about 8%. So if we were to see a decline of similar magnitude sometime in the future -- a not-unreasonable expectation given the history of market meltdowns -- a 70% stocks-30% bonds portfolio would lose about 40% (assuming no rebalancing ). \nIf that sort of setback would totally freak you out, then perhaps a less stock-intensive 50% stocks-50% bonds portfolio (which lost 26%) or even a 40% stocks-60% bonds mix (which fell 19%) would be more suitable for you, even though both could be considered a bit conservative for someone still 10 years from retirement. \nYou can get a more accurate gauge of your appetite for risk by completing a risk tolerance questionnaire. Vanguard has a good asset allocation tool that's free, while FinaMetrica offers a more comprehensive version for $40 (although given recent market turbulence FinaMetrica is offering the test and the nine-page report that comes with it for $4 until the end of September). Both tests recommend an investment portfolio based on your answers. \nRelated: Retirement strategies with low risk, high returns \n2. Settle on a reasonable asset allocation. You could simply go with the portfolio recommended by the risk-tolerance test or with a stocks-bonds mix you feel you would be comfortable with based on how that blend has performed in past market downturns. But remember: protecting yourself from market setbacks isn't your only goal. You also want a stocks-bonds blend that has a reasonable shot at delivering the returns you'll need to build a nest egg that can allow you to keep your pre-retirement standard of living throughout your post-career life. \nYou can get a sense of how likely different portfolios are to support you during a long retirement by plugging various mixes of stocks and bonds into a good retirement income calculator , along with such information as the value of your retirement savings, how many years you expect to live in retirement and how much annual income you expect you'll need once you retire. \nWhat you may find is that the portfolio mix that you would feel most comfortable with in a market downturn doesn't provide the growth necessary to fund the lifestyle you envision and maintain your purchasing power in the face of inflation. If that's the case, then you may need to give up a bit of short-term comfort to gain more retirement security in the long run. \n3. Chill. Ideally, once you've decided on a stocks-bonds mix you'll want to stick with it, except for periodic rebalancing . But it can be hard to resist the urge to tinker when stock prices are jumping around like crazy and every time you turn on the TV or visit a financial website some sage or pundit is touting an investment that's supposed to generate high returns with low risk . \nIf you can tune out this investment noise , great. If that's not feasible, resist acting on it. Emotional decisions rarely work out well for your finances. One way to avoid making moves in the heat of the moment is to set a \"cooling off\" period in advance -- that is, resolve that no matter how tempted you may be to overhaul your strategy because of some development in the market or add some promising new investing vehicle , you'll hold off at least a week before making any changes. In many cases the mere fact of waiting will help you realize you're probably better off not making the move at all. But even if you do decide to make a change, the extra time a waiting period provides will allow you to better evaluate your options and come to a more rational decision. \nAs you get closer to retirement, you'll have other issues to consider (such as whether to throw some guaranteed lifetime income into the mix). For now, though, the single most important thing you can do is get the trade-off between short-term security and long-term growth right.", "external_links": [], "published": "2015-09-16T14:14:00.000+03:00", "crawled": "2015-09-16T14:34:07.461+03:00", "highlightTitle": ""}