{"organizations": [], "uuid": "1691ea473bfec096ca64c98a157e5f74bc48222c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/business/finance", "section_title": "Winnipeg Free Press: Personal Finance", "url": "http://www.winnipegfreepress.com/business/finance/shopping-for-investment-advice-difficult-report-by-regulators-finds-328068131.html", "country": "US", "title": "Shopping for investment advice difficult: report by regulators finds", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Shopping for investment advice difficult: report by regulators finds - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T15:35:00.000+03:00", "replies_count": 0, "uuid": "1691ea473bfec096ca64c98a157e5f74bc48222c"}, "author": "The Canadian Press", "url": "http://www.winnipegfreepress.com/business/finance/shopping-for-investment-advice-difficult-report-by-regulators-finds-328068131.html", "ord_in_thread": 0, "title": "Shopping for investment advice difficult: report by regulators finds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA - It is difficult for investors to comparison shop for financial advice, especially when it comes to fees and other costs, according to a \"mystery\" shopper report issued by securities regulators on Thursday.\nThe report — a joint effort of the Ontario Securities Commission, the Investment Industry Regulatory Organization of Canada and the Mutual Fund Dealers Association of Canada — said investors also face a range of different business titles when shopping for advice, adding to the complexity of the process.\nIn the study, representatives of the regulators visited 105 shops throughout Ontario between July and November 2014.\nThey included investment dealers, mutual fund dealers, portfolio managers and exempt market dealers. Of these, 88 shops had sufficient data to allow for an assessment of the shoppers' experiences against a set of benchmarks for best practice, compliant and non-compliant advice.\nThe regulators noted that in initial meetings, investors were more likely to hear about products and services offered and less likely to hear about fees or the relationship between risk and return.\n\"The quality and value of advice are key considerations in achieving positive investor outcomes,\" the report said.\n\"Investors need to be confident that the advice they receive before purchasing financial products and services is of high quality and appropriate for their circumstances.\"\nThe regulators said they would increase their focus on ensuring advisers know their clients and the products they are recommending.\n\"We are all committed to improving the advisory process and the overall experience investors have when seeking investment advice,\" they said.\nReport Error Submit a Tip Refund Refund", "external_links": [], "published": "2015-09-17T15:35:00.000+03:00", "crawled": "2015-09-18T03:32:30.716+03:00", "highlightTitle": ""}