{"organizations": ["The Economic Times App", "Shah Committee", "PTI", "Deloitte Haskins & Sells", "FIIs", "Law Commission of India Chairman A P Shah"], "uuid": "3a27909edd43d16169110534857e5bd817819b23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48762980,width-600,resizemode-4/mat.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/1286551815.cms", "section_title": "Finance-Economy-News-The Economic Times", "url": "http://economictimes.indiatimes.com/news/economy/finance/governments-move-not-to-impose-mat-on-fiis-gets-kudos/articleshow/48762926.cms", "country": "IL", "title": "Government's move not to impose MAT on FIIs gets kudos", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Government's move not to impose MAT on FIIs gets kudos", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T19:13:00.000+03:00", "replies_count": 0, "uuid": "3a27909edd43d16169110534857e5bd817819b23"}, "author": "", "url": "http://economictimes.indiatimes.com/news/economy/finance/governments-move-not-to-impose-mat-on-fiis-gets-kudos/articleshow/48762926.cms", "ord_in_thread": 0, "title": "Government's move not to impose MAT on FIIs gets kudos", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Arun Jaitley", "Suresh Swamy", "Rajesh H Gandhi"], "text": "Government's move not to impose MAT on FIIs gets kudos By PTI | 1 Sep, 2015, 09.43PM IST Cheering the govt's announcement that MAT will not be imposed on overseas portfolio investors retrospectively, experts said the move will help promote India as a favourable investment destination. Editor's Pick ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! NEW DELHI: Cheering the government's announcement that minimum alternate tax will not be imposed on overseas portfolio investors retrospectively, experts on Tuesday said the move will help promote India as a favourable investment destination. In a big relief to FIIs, the government today accepted recommendation of a high-level panel that MAT should not be imposed on the overseas investors retrospectively. \"The government has opted for amending the Income Tax Act rather than merely issuing a circular. With this clarification, the whole issue of levy of MAT will be resolved in favour of the tax payer. \"FIIs who had approached the High Court may now consider withdrawing their writ petitions filed earlier. This development will definitely cheer the investor community and will help promote India as a favourable investment destination,\" Suresh Swamy, Partner, PwC India , said. Finance Minister Arun Jaitley , in a media interaction, today said the panel headed by the Law Commission of India Chairman A P Shah submitted its final report on August 25 on the issue of applicability of MAT on capital gains made by FIIs prior to April 1, 2015. \"The acceptance of the Shah Committee report by the government will be viewed very positively by the foreign investor community, which can help boost sentiment and FII investment in the stock market,\" Rajesh H Gandhi, Partner, Deloitte Haskins & Sells, said. \"The decision will also help further the government's position that it discourages tax terrorism and welcomes foreign investment in India.\" Stay on top of business news with The Economic Times App. Download it Now!", "external_links": [], "published": "2015-09-01T19:13:00.000+03:00", "crawled": "2015-09-01T19:58:55.322+03:00", "highlightTitle": ""}