{"organizations": [], "uuid": "5d75894c96c73ccacaed76f01d7155d3bafaffeb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/strong-easyjet-outlook-supermarket-bid-112645673.html", "country": "US", "title": "Strong EasyJet outlook, supermarket bid talk give UK shares a lift", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Strong EasyJet outlook, supermarket bid talk give UK shares a lift", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T14:26:00.000+03:00", "replies_count": 0, "uuid": "5d75894c96c73ccacaed76f01d7155d3bafaffeb"}, "author": "", "url": "https://uk.finance.yahoo.com/news/strong-easyjet-outlook-supermarket-bid-112645673.html", "ord_in_thread": 0, "title": "Strong EasyJet outlook, supermarket bid talk give UK shares a lift", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Sep 3, 2015, 12:57 BST - UK Markets close in 3 hrs 33 mins Strong EasyJet outlook, supermarket bid talk give UK shares a lift Reuters - UK Focus – 30 minutes ago \n* FTSE 100 up 1.4 pct, slightly outperforms Europe \n* EasyJet (Other OTC: EJTTF - news ) up 5.8 pct to highest in over three months \n* Morrisons up 5 pct after report of sector merger interest \n* Battered miners Glencore (Xetra: A1JAGV - news ) , Anglo American (LSE: AAL.L - news ) stage rebound (Updates at mid-session) \nBy Kit Rees and Lionel Laurent \nLONDON, Sept 3 (Reuters) - UK shares were set for their biggest one-day gain in a week on Thursday, with a profit upgrade from airline easyJet and a report of bid interest in the supermarkets sector adding to a global market recovery. \nData showing Britain's services sector recorded its weakest growth in more than two years last month also supported stocks, with the benign outlook for inflation seen by investors as a sign that monetary policy will stay loose. \nThe FTSE 100 blue-chip index, which is due to be reshuffled on Sept. 21 to include housebuilder Berkeley Group and drop Weir Group, was up 1.4 percent at 6,169.22 points at 1103 GMT, slightly outperforming the FTSEurofirst 300 index, up 1.3 percent. \nEasyJet was up 5.8 percent, having hit its highest level since May, after the airline raised its full-year profit outlook to forecast growth of up to 21 percent. \n\"EasyJet's numbers were good, this is a good market rebound,\" said Mark Ward, head of execution trading at Sanlam Securities in London. \"Overall sentiment is a bit better today.\" \nFollowing a bruising worldwide sell-off last week, UK and European equities are in recovery mode with investors betting monetary policy will stay lower for longer ahead of the ECB meeting on Thursday. The FTSE 100 is currently trading at a discount to euro zone stocks. \n\"To spend too much time focusing only on China ... we think, misses the point - Europe's a good place to invest, there are still lots of really good companies we can buy cheaper than a month ago, because of the fall in markets,\" said David Moss, manager of the F&C European Equity fund. \nMorrison Supermarkets was up 3.9 percent after a report in the Daily Telegraph newspaper signalled South African billionaire Christo Wiese, who recently bought Virgin Active and New Look, is now training his sights on Britain's struggling supermarket industry. \nBattered miners Glencore and Anglo American staged a rebound, rising around 4 percent, even after Standard & Poor's cut its outlook for Glencore to 'negative' from 'stable'. \n\"They're bearing the brunt of ratings downgrades from major agencies to add to their woes of falling commodity prices. They are up today, however it could be seen as a dead cat bounce from yesterday's sell-off,\" said Jonathan Roy, advisory investment manager at Charles Hanover Investments. \nIn the midcaps, car dealership Lookers (LSE: LOOK.L - news ) was the top gainer, rising 7.7 percent after its acquisition of Benfield Motor Group for 87.5 million pounds in cash. (Reporting by Lionel Laurent; Editing by Mark Trevelyan)", "external_links": [], "published": "2015-09-03T14:26:00.000+03:00", "crawled": "2015-09-03T14:58:09.864+03:00", "highlightTitle": ""}