{"organizations": [], "uuid": "c7460f2953175cab1d02e59ed23550ec74734cfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/20/12915966/Meadows 5.jpg", "site_section": "http://www.prweb.com/rss2/homefinance.xml", "section_title": "Home and Family: Banking / Personal Finance", "url": "http://www.prweb.com/releases/Joel/Meadows/prweb12915966.htm", "country": "US", "title": "Joel Meadows of Greenwood King Properties Honored With the 2015 Rising Stars Real Estate Agent Award by Five Star Professional", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Joel Meadows of Greenwood King Properties Honored With the 2015 Rising Stars Real Estate Agent Award by Five Star Professional", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "c7460f2953175cab1d02e59ed23550ec74734cfa"}, "author": "Five Star Professional Representative", "url": "http://www.prweb.com/releases/Joel/Meadows/prweb12915966.htm", "ord_in_thread": 0, "title": "Joel Meadows of Greenwood King Properties Honored With the 2015 Rising Stars Real Estate Agent Award by Five Star Professional", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“I risked everything leaving behind a successful career in title insurance to become a Realtor® because I wanted to build my own business where I could become involved and make a difference in the community I live in. Winning this award justifies all the hard work and countless hours helping others successfully buy and sell their homes,” says Joel Meadows of Greenwood King Properties. Five Star Professional is pleased to announce Joel Meadows, Greenwood King Properties , has been chosen as one of Texas’ Rising Stars Real Estate Agents for 2015.\nFive Star Professional partnered with Texas Monthly to identify up-and-coming real estate agents in the state of Texas who, in only a short period of time as agents, have performed at a high level with strong client satisfaction. Joel Meadows is featured, along with other award winners, in a special section of the September issue.\n“Nothing pleases me more to know my clients had such positive experiences working with me. The feeling is 100 percent mutual,” says Joel.\nAs part of the Rising Stars Real Estate Agent award program, agents are measured using an objective, in-depth research methodology with significant focus on customer feedback, sales volume and overall satisfaction.\n“Rising Star Real Estate Agent award winners are agents to watch. Based on their impressive sales volume, transactions and client service they show tremendous potential to excel in the profession for years to come,” says Jonathan Wesser, Research Director, Five Star Professional.\nAbout the research process:\nNow entering its 12th year, Five Star Professional conducts in-depth, market-specific research in more than 45 markets across the United States and Canada to identify premium service professionals.\nFive Star Professional contacts thousands of recent homebuyers and seasoned real estate professionals to identify Rising Star award candidates who are strong performers, provide superior customer service and embody professional excellence. Candidates are also evaluated on objective criteria such as experience, production levels and disciplinary and complaint history. Real estate agents do not pay a fee to be considered or awarded. For more information, visit http://www.fivestarprofessional.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5maXZlc3RhcnByb2Zlc3Npb25hbC5jb20=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5qb2VsbWVhZG93c3JlYWx0b3IuY29tLw=="], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-03T19:41:26.972+03:00", "highlightTitle": ""}