{"organizations": [], "uuid": "61f2c5b717cc0c3c71a3e23f656f8695761468d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/china-transition-complicated-dragon-not-084724956.html", "country": "US", "title": "China’s transition is complicated - but the dragon has not lost its fire", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "China’s transition is complicated - but the dragon has not lost its fire", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T11:47:00.000+03:00", "replies_count": 0, "uuid": "61f2c5b717cc0c3c71a3e23f656f8695761468d8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/china-transition-complicated-dragon-not-084724956.html", "ord_in_thread": 0, "title": "China’s transition is complicated - but the dragon has not lost its fire", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0.0001 0.0000 \nPredicting China's long-term trajectory is vital not just for the global economy, but for the strategies of many businesses \nChina has been the engine room of global economic growth over the past decade. So it is right to ask what the Dragon economy’s adjustment to a “new normal” means for the rest of the world. \nFirst (Other OTC: FSTC - news ) we need to assess what the new normal looks like. It (Other OTC: ITGL - news ) does not mean that current economic conditions in China will prevail forever or that there is some future mythical stable state. It means that there will be a process of significant adjustment involving difficult structural reforms, a reallocation of resources, changes to public sector incentives and, inevitably, macroeconomic volatility. \nWhile the transition to a new normal is complex, China’s fundamentals remain strong and it will continue to grow . \nPredicting the trajectory of China is not only pivotal to the global economic outlook but it is crucial to the long-term strategy of many businesses, including the mining and metals industry. China is the world’s biggest consumer of iron ore the key steel-making ingredient and a commodity often viewed as a portent of future economic growth because it is used in heavy-metal manufacturing and the construction of new buildings. \n• Jeremy Warner: China has created a monster it can’t control \nFor a global business like Rio Tinto , which invests in assets with timeframes over decades, maximising shareholder value requires long-term planning. Our allocation of capital across alternative investments is heavily influenced by projected long-term trends in different markets. That’s why what is happening today in China is not as important as the long-term story. When looking at long-term trends it is imperative to see through near term volatility and cycles. At Rio Tinto we review our projections based on detailed primary research, on macroeconomic developments, industry costs, production trends and consumption drivers. \nYesterday we reaffirmed our analysis that Chinese crude steel production is expected to reach around 1bn tonnes by 2030. This projection is the result of rigorous research conducted on the ground in China, India and other key markets. \nTaking this bottom-up approach allows for a deeper interpretation of key trends, policy decisions and inflection points in each sector and region and under different macroeconomic scenarios. Reliance on top-down averages is often misleading in our view. \nChina is undoubtedly changing but the stunning migration of its population from rural areas to the cities will continue, with 220m new urban residents expected in the next 15 years, compared to the 320m people between the year 2000 and 2015. \nThat is still the equivalent of the combined populations of both Russia and Germany moving from the countryside into cities. There will be greater emphasis on improving the quality of this urbanisation and it will require more focus on public infrastructure, better public services and reduced pollution. \nConstruction growth in China will undoubtedly slow but its factories will become more capital intensive as the economy matures and manufacturing becomes more specialised. \nConsumption, especially of services, will also form a greater share of economic activity. The net effect of this for China is a trend toward slower but higher quality growth. We see GDP growth trending from current reported levels of 7pc, or perhaps less, toward realised growth of 4pc to 5pc by 2030. Global steel demand is projected to grow by around 2.5pc a year between now and 2030, based on 3pc average global GDP growth a year. \nSo what are the implications for the leading mining houses and iron ore miners in particular? First, the world will continue to need increasing volumes of our products. Our projection is that the world will require 750 to 800m tonnes of additional iron ore by 2030 an average increase of about 2pc a year. \n• AEP: China is in a serious bind but this is not yet a 'Lehman' moment \nSecond, emerging markets other than China will play a much more important role in the demand for iron ore. For example, some 25m people will move to cities in India and the south-east Asian nations such as Indonesia and the Philippines in the next 15 years. We expect demand for steel outside of China to increase by 65pc by 2030 from 920m tonnes to just over 1.5bn tonnes of crude steel. \nThird, Chinese demand will remain critically important. Steel production is expected to grow by 1pc a year but that is from a very high base. \nWhile China’s growth projections remain strong, its pattern of steel demand is expected to change. Replacement and renewal of capital stock will become much more important, as will exports of finished goods that embody steel. \nA key part of the overall demand projection is the growth in exports from China, especially to other emerging markets. As these markets become more advanced, they will need to embark on a sustained process of building their own capital stocks and China will be well placed to export increasing quantities of capital good. \nThese will include machinery, construction equipment, transport vehicles all requiring significant quantities of steel. \nThe nature of China’s buildings will also change. Today the average floor space per capita in China is about 32 square metres but we’re expecting that to grow to around 40 square metres per capita by 2030. \nBetween now and 2030 we expect a quarter of China’s building stock to be replaced, most involving the replacement of one and two-storey buildings with structures of seven storeys or higher. There is 40pc more steel per square metre in a high-rise building over 20 storeys than in a one to two-storey building. \nWe model urban residential demand by first projecting income growth on a province-by-province basis at city level. We then analyse how much steel will be used in each metre of floor space, using a number of factors. For example, more stringent building regulation in China has resulted in 5pc to 10pc increases in the steel intensity of buildings every decade. \nWhile the new normal transition is undoubtedly complex and will be volatile, China’s fundamentals are still strong. \nVivek Tulpule is Rio Tinto (LSE: RIO.L - news ) ’s head of economics and markets (Other OTC: UBGXF - news )", "external_links": [], "published": "2015-09-04T11:47:00.000+03:00", "crawled": "2015-09-04T12:02:18.836+03:00", "highlightTitle": ""}