{"organizations": [], "uuid": "142c97e47bbf45ad1b14f32d5bcdba8b5d89b823", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/oil-prices-dip-traders-profit-003319928.html", "country": "US", "title": "Oil falls 2 percent as concern over demand bites", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Oil falls 2 percent as concern over demand bites", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T17:08:00.000+03:00", "replies_count": 0, "uuid": "142c97e47bbf45ad1b14f32d5bcdba8b5d89b823"}, "author": "", "url": "https://uk.finance.yahoo.com/news/oil-prices-dip-traders-profit-003319928.html", "ord_in_thread": 0, "title": "Oil falls 2 percent as concern over demand bites", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 22, 2015, 15:20 BST - UK Markets close in 1 hr 10 mins Oil falls 2 percent as concern over demand bites Reuters – 12 minutes ago \nA customer holds a nozzle to fill up his tank in a gasoline station in Nice December 5, 2014. REUTERS/Eric … By Amanda Cooper \nLONDON (Reuters) - Crude oil prices fell as much as 2 percent on Tuesday on uncertainty over whether global demand will be enough to erode a sky-high surplus, ahead of a weekly survey of U.S. inventory levels. \nVolatility has picked up this week, as the outlook for crude has been muddied by data pointing to the market possibly having stabilized after losing more than half its value in a year, and the persistence of the highest global surplus in modern times. \nThere is evidence that U.S. shale production is starting to feel the pinch of oil prices near six-year lows, which has prompted the International Energy Agency to issue more bullish forecasts for the market balance next year. \nCapital Economics analyst Thomas Pew said there has been a loss of some half a million barrels of oil per day in U.S. production in the last couple of months alone. \nBut uncertainty is running high over the outlook for demand in top consumers such as China, as well as the resilience of the U.S. economy following the Federal Reserve's policy meeting last week. [ID:nL1N11N244] \n\"Certainly, nothing is certain. That’s the only certain thing that there is. That being said, it does look like lower prices have finally started to take their toll on U.S. production,\" Pew said. \n\"All eyes are going to be on whether that continues,\" he said, adding that Capital Economics' forecast was for a gradual rise in oil prices over the coming years. \nNovember Brent crude futures were down 75 cents, or 1.5 percent, at $48.17 a barrel by 1345 GMT, having hit an intraday low of $47.70. \nOn Monday, Brent rose as much as 3 percent. \nU.S. West Texas Intermediate (WTI) crude futures for November were down $1.11 at $45.85 a barrel, bringing the discount to Brent to around $2.25 a barrel, down from about $2.60 a week ago. \n\"Whether the prices will further converge in the near future, or whether WTI will even become more expensive than Brent, will depend to a major extent on the U.S. inventory trends,\" Commerzbank analysts said in a report. \n\"Even if speculators are focusing on the decrease in U.S. production at present, it is important not to forget that U.S. crude oil stocks are still currently 28 percent ... higher than usual.\" \nAmerican Petroleum Institute (API) data later on Tuesday is expected to show a weekly drop in U.S. crude inventories. \n(Editing by Dale Hudson)", "external_links": [], "published": "2015-09-22T17:08:00.000+03:00", "crawled": "2015-09-22T17:19:59.690+03:00", "highlightTitle": ""}