{"organizations": ["Denel"], "uuid": "d1a10eabb76a050bb122bdb69bc241f7ae29354d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509280432.html", "country": "US", "title": "South Africa: Exclusive - Denel CEO Put On Special Leave Pending Probe", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Exclusive - Denel CEO Put On Special Leave Pending Probe", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T11:42:00.000+03:00", "replies_count": 0, "uuid": "d1a10eabb76a050bb122bdb69bc241f7ae29354d"}, "author": "", "url": "http://allafrica.com/stories/201509280432.html", "ord_in_thread": 0, "title": "South Africa: Exclusive - Denel CEO Put On Special Leave Pending Probe", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matthew Le Cordeur"], "text": "By Matthew Le Cordeur \nState-owned defence manufacturer Denel on Wednesday placed three senior executives on special leave pending an investigation. \nFin24 received a tip-off on Friday that the board placed CEO Riaz Saloojee, chief financial officer Fikile Mhlontlo and group company secretary Elizabeth Africa on special leave after a board meeting on Wednesday evening. \nThey will be on leave while the Denel board investigates a variety of issues, including recent business acquisitions made by the state-owned entity, sources said. \nDenel's head of corporate communication Vuyelwa Qinga told Fin24 on Friday that she is aware of the situation. \n\"I understand that they have been put on leave pending an investigation,\" she said. \"The board is accountable to the Minister (of Public Enterprises Lynne Brown) and would only report the details of such to her. I am unfortunately unable to confirm your query.\" \nPublic enterprises spokesperson Colin Cruywagen told Fin24 on Friday that \"the board of Denel is dealing with the matter and Minister Brown is kept abreast of it\". \nSaid Cruywagen: \"Minister Brown will respond only after she has been formally informed by the board.\" \nThe board was recently rotated by Brown, who appointed Daniel Mantsha as its chairperson from July 24. \nThe media questioned his appointment at the time, as he was struck from the roll of attorneys upon application by the Law Society in 2007. The Law Society of the Northern Provinces clarified the issue at the time, saying he had been readmitted as an attorney by the High Court on December 8 2011. \n\"Mr Mantsha has in fact since been registered with the Law Society as a practising attorney and is in good standing with the Law Society,\" it said in a statement. \nWhen Brown announced the rotation on July 24, she said: \"I encourage the new board to continue working closely with its executive team to solidify the company's operations with a strong emphasis on issues relating to transformation within the company, skills development and strategic partnerships in South Africa, the region, continental and global trade initiatives aimed at strengthening Denel's order book.\" \nDenel is the largest manufacturer of defence equipment in South Africa and operates in the military aerospace and landward defence environment. \nIts most recent acquisition was revealed by DefenceWeb on April 29 2015. It said Denel had \"acquired Land Systems South Africa (LSSA) from BAE Systems, with BAE yesterday announcing the sale of its 75% stake in LSSA.\" \nIt said Denel took over the majority ownership stake for R641m in cash, although the complete acquisition cost Denel R855m, as it also bought the remaining 25% stake from BAE Systems' partner DGD Technologies. \n\"Speaking to defenceWeb last week, Denel Group CEO Riaz Saloojee said that with the acquisition of LSSA, the whole landward mobility capability of the South African National Defence Force will once again be invested in the state. LSSA, Denel Land Systems, Mechem and LMT will be under one roof,\" reported DefenceWeb. \nSource: Fin24", "external_links": [], "published": "2015-09-28T11:42:00.000+03:00", "crawled": "2015-09-28T15:20:23.517+03:00", "highlightTitle": ""}