{"organizations": ["UBS"], "uuid": "9cc8ef5df171204200a598c1ec75ca00ae5b0e7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-targetukfocus/?format=rss", "section_title": "Finance News | Reuters - UK Focus - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/london-fifth-priciest-city-world-094939649.html", "country": "US", "title": "London fifth-priciest city in the world but earnings lag behind - UBS", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "London fifth-priciest city in the world but earnings lag behind - UBS", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T12:49:00.000+03:00", "replies_count": 0, "uuid": "9cc8ef5df171204200a598c1ec75ca00ae5b0e7b"}, "author": "", "url": "https://uk.finance.yahoo.com/news/london-fifth-priciest-city-world-094939649.html", "ord_in_thread": 0, "title": "London fifth-priciest city in the world but earnings lag behind - UBS", "locations": ["London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "119.59 +0.59 \nLONDON, Sept 18 (Reuters) - London is the fifth most expensive city in the world to live in but wage levels have failed to keep up compared to other major centres, a report by Swiss Bank UBS has found. \nThe British capital ranked behind Zurich, Geneva, New York and Oslo when it came to the relative cost of goods, including rent, but was in 13th place on a comparison of gross salaries. \nThe study found that whilst it was cheaper to live in Sydney, Copenhagen and Chicago, residents there earned more relative to Londoners. \nRising levels of rent have helped to push up the cost of living in London in recent years with Britain having failed to build enough homes to meet rising needs. \nDemand has also risen because of growing levels of net migration and people opting to rent for longer in order to save up for increasingly more expensive properties, the report said. \nMeanwhile, earnings have risen more slowly than inflation for most years since the 2007/8 financial crisis although they have begun to pick up robustly this year. \nUBS (NYSEArca: FBGX - news ) found that London was also far more expensive than comparable European capital cities Paris and Berlin when the price of an average basket of 39 foodstuffs was compared but Zurich, Seoul and New York were the costliest locations. \nA Londoner must work 41.2 hours to afford an iPhone 6, twice as long as a resident of Zurich who only needs to work 20.6 hours, it added. \nHowever the British capital was one of the cheapest places to buy a kilo of bread, with Londoners having to work for just 6 minutes to buy the basic foodstuff, half the time it would take a New Yorker. \nUBS said that the decision in January by the Swiss National Bank to abruptly abandon its cap of 1.20 francs per euro, leading to a surge in the franc's value, had hugely altered the indicators. \n\"Zurich and Geneva rose to the top of the rankings. Eurozone cities plunged,\" the report said, adding that the crisis in Ukraine had pushed Kiev to the bottom of the price and wage charts. \nAmong the cheapest places in the world to live were Sofia in Bulgaria, Bucharest in Romania and New Delhi and Mumbai in India, where wages were also among the lowest of the 71 locations compared around the world. (Reporting By Costas Pitas; editing by Stephen Addison)", "external_links": [], "published": "2015-09-18T12:49:00.000+03:00", "crawled": "2015-09-18T14:10:44.428+03:00", "highlightTitle": ""}