{"organizations": [], "uuid": "a7eb3eaa0ff088974ec64e959afb2c5e04cb771d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/e/s/5/s/image.related.afrArticleLead.620x365.gi9o71.png/1443341635103.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/media-and-marketing/netflix-rival-stan-readies-for-launch-of-original-series-no-activity-20150710-gi9o71", "country": "AU", "title": "Netflix rival Stan readies for launch of original series No Activity", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Netflix rival Stan readies for launch of original series No Activity | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T22:00:00.000+03:00", "replies_count": 0, "uuid": "a7eb3eaa0ff088974ec64e959afb2c5e04cb771d"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/media-and-marketing/netflix-rival-stan-readies-for-launch-of-original-series-no-activity-20150710-gi9o71", "ord_in_thread": 0, "title": "Netflix rival Stan readies for launch of original series No Activity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stan chief executive Mike Sneesby is p;anning to capture nearly half the market in four years. Ben Rushton Share on twitter Share on Google Plus by Max Mason Fresh off a plane from Los Angeles, Stan chief executive Mike Sneesby says that Hollywood studios are keen on the local Netflix rival's new original Australian comedy – No Activity .\nMr Sneesby also revealed that Stan is on the verge of hitting 400,000 gross sign-ups, claiming that 70 per cent of users who have taken its free first-month trial are still staying on as paying customers.\nThe subscription video on-demand service, which is a 50-50 venture between Nine Entertainment Co and Fairfax Media, publisher of The Australian Financial Review, held private preview screenings for No Activity , which will feature guest cast members Tim Minchin and Jake Johnson, at QT Sydney last week ahead of the show's launch in late October.\nMr Sneesby said he had not anticipated overseas interest in No Activity : \"We made the show for Australians, for Stan, it's such an important part of our strategy.\"\nBut he added: \"The feedback from every studio executive was overwhelming. The response was always 'this is absolutely hilarious' and 'who is buying this internationally?'.\"\nMr Sneesby, who still has to convert that interest into a sale, said that Stan's Wolf Creek series, which is currently in the development stage, and is earmarked for a six-part TV series has also garnered interest from the United States.\n\"We will take those shows; we will commit the dollars up front and take some risk on the production of the show. We'll obviously run it as a first run Stan original exclusive in Australia, but we'd love to see it pop up on other platforms around the world – on Amazon, Hulu or a cable TV network,\" Mr Sneesby said.\nThe money made from selling original content will then be brought back to Australia to develop more shows.\n The ambitious model replicates that of Netflix, which has been hugely successful with a string a original productions, including House of Cards , Orange is the New Black and Unbreakable Kimmy Schmidt .\nWhether Stan is able to mirror the US powerhouse's success with its original productions remains to be seen.\nExact subscriber numbers across the burgeoning streaming market are hard to come by, with a report by technology analysts Telsyte suggesting the Australian market has already hit 2 million subscribers – Netflix generally agreed upon as the clear market leader.\nCiti estimated in August that Netflix had 1.6 million customers in Australia, with 900,000 paying, while at the time Stan was estimated to have 332,000 users with 153,000 paying.\nThe market is growing faster than initially anticipated – Mr Sneesby originally predicted the total market would pass 1 million households by the end of the first year, but he believes it has already done so.\nForty per cent of market in four years He said household penetration could hit 40 per cent at around the four year mark.\nStan launched in January this year, joining Foxtel's joint venture with Seven West Media, Presto and incumbent minnow Quickflix, which has since suspending trading on the ASX to attempt a restructure and head off potential insolvency. Netflix entered the market in March.\nThe threat of further players entering the market, such as HBO or Amazon, is also an opportunity, according to Mr Sneesby.\n\"We're yet to see how the Australian market shapes up but we look at the potential for those other international players and the opportunity to partner with them as we have in acquiring their content today, as an opportunity,\" he said\n\"We see ourselves as the Aussie grown brand who is able to work with anyone. We could work with Amazon or HBO.\"\nThe low price point and differentiation of content will be key to the success of the industry, Mr Sneesby said.\nHe said that analysis done by Stan suggested that 20 per cent or less of its 7000 hours of content overlaps with Netflix's library and that the business was investing tens of millions of dollars in content rights, many – such as Better Call Saul – for the entire life of the show.\n\"It's not a winner take all game. Our position and our objective is to be the preferred streaming service for Australians and in any household where they don't pick Stan as number one, then we certainly want to be the number two.\"\nNetflix reported its second quarter financial results in July showing it had added 2.3 million paying international customers in the quarter taking overseas subscription numbers to 21.6 million, while at home it add 742,000 additional paid memberships to reach more than 41 million.\nHowever, the strong overseas performance has come at a cost for Netflix, with its international arm taking a $US91.9 million ($131.4 million) loss in the quarter, and a total $US156.9 million loss in the first half of calendar 2015.\nIts US streaming business contributed $US339.8 million to profit in the quarter and $US652.2 million in the half. Total profit from the second quarter was $26.3 million and $50 million for the half.", "external_links": ["https://twitter.com/Maxepmason", "https://plus.google.com/https://plus.google.com/u/0/110501760785352454451/posts", "http://www.smh.com.au/business/media-and-marketing/netflix-rival-stan-says-70-per-cent-of-users-stay-after-free-trial-20150812-gixia5.html"], "published": "2015-09-27T22:00:00.000+03:00", "crawled": "2015-09-28T02:10:50.052+03:00", "highlightTitle": ""}