{"organizations": [], "uuid": "184e81df48a3b0619bd2d40f1c96af5d6a4946a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/2/i/i/j/2/image.related.afrArticleLead.620x365.gjr8ap.png/1442826007511.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/asx-the-final-hope-for-investors-as-market-sinks-20150921-gjr8ap", "country": "AU", "title": "ASX: The final hope for investors as market sinks", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "ASX: The final hope for investors as market sinks | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T13:17:00.000+03:00", "replies_count": 0, "uuid": "184e81df48a3b0619bd2d40f1c96af5d6a4946a4"}, "author": "Philip Baker", "url": "http://www.afr.com/markets/asx-the-final-hope-for-investors-as-market-sinks-20150921-gjr8ap", "ord_in_thread": 0, "title": "ASX: The final hope for investors as market sinks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The market's risk-happy animal spirits are losing courage. Louie Douvis Share on twitter by Philip Baker Well, what now for investors?\nDespite all the moves in Canberra and the optimism that is attached to the latest cabinet changes, investors are looking like they are a sorry lot right now – equity markets are withering and safe haven government bonds are rallying.\nThe only good news is the Australian dollar is down, but still above the US71¢ level.\nThe market's risk-happy animal spirits are losing courage at a time when hopes are high that the changes in Canberra can help business regain its courage after a very long absence.\nIndeed, business and any new initiatives that it can come up with might just be the last hope for the sharemarket.\nThe other two usual suspects, interest rates and earnings, don't look like they can help this time round.\nRates are so low anyway it's debatable what another cut would do, even if it was on the cards, while the outlook for earnings after the latest reporting season isn't good.\nOf course, as the S&P/ASX 200 index falls, it is becoming cheaper and a look at the previous 16 falls of 10 per cent or more since 1989 shows that on average, once the sharemarket has fallen into correction territory, it goes on to fall by 19 per cent.\n So far in this sell-off, the index has dropped by about 16 per cent so it implies there is still some selling left in this episode, but perhaps not much.\nA look at Wall Street, however, shows there have been 11 falls of 10 per cent or more in the past 26 years, but this time around, the drop has been just 12 per cent since the selling started in May.\nThe average drop after a correction is 22 per cent so that implies there is a lot more selling to play out on Wall Street.\nCircuit breaker needed The local sharemarket clearly needs a circuit breaker, but it's not all doom and gloom.\nAmid all the talk of a potential recession in Australia, it's probably only a 10 per cent chance over the next year, according to CBA economist Michael Blythe,\nSince 1960 Australia has had, on average, a recession once every 13 to 14 years and it's worth noting that in the years in the lead-up to the global financial crisis, from 1990 to 2006, financial markets, on average, would forecast a 25 per cent chance of recession each year. It never happened.\nSome companies around the world are using the cheap money to buy growth.\nAccording to Thomson Reuters, there has been more than $US3 trillion ($4 trillion) worth of deals done so far this year, just $US27.9 billion below the record set in 2007.\nThere's no doubt a lot of goodwill extends to the changes in Canberra, but they are up against continuing concerns about a slowdown in China, what's happening in Europe and very little growth in Japan.\nUnfortunately, the goodwill doesn't extend to global investors.\nAccording to National Australia Bank's chief markets economist Ivan Colhoun, overseas investors have never been so negative towards Australia.\nAnd he's been seeing global investors for more than 20 years.\nColhoun has just returned from seeing clients in Britain, Europe and the Middle East and one described the local economy as \"toast\".\nLast week's blast of anxiety about the Federal Reserve's concerns about the global economy and why it couldn't raise interest rates is threatening to turn into a tempest.\nMarkets scrambling Markets are still playing catch-up with the Fed's thinking and scrambling to find out if there's more than just the usual emerging market worries that spooked it so much that it decided the world couldn't cope with a rise of just one-quarter of a percentage.\nIn the meantime, until there is clear evidence of the economic picture, investors will almost certainly see a continuing battle between lower interest rates and a declining economy and profits.\nPolicymakers were always going to face a giant task in fashioning an exit from their accommodative strategies to avoid a repeat of the mistakes of the past, when interest rates were kept too low for too long.\nIf they exit too fast they may imperil the recovery. If they exit too slow then low interest rates may fuel a rise in the same reckless speculation that nearly collapsed the global financial system in the first place.\nBut whatever happened to the investment advice: \"Don't fight the Fed?\".", "external_links": ["http://www.smh.com.au/business/markets-live/markets-live-fed-feeds-bears-20150920-gjr2x8.html", "https://twitter.com/PhilABaker"], "published": "2015-09-21T13:17:00.000+03:00", "crawled": "2015-09-21T14:05:54.501+03:00", "highlightTitle": ""}