{"organizations": [], "uuid": "0cec583d04ceaab4208f99506db7ab099804ca32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/indian-markets/companies-shareholders-must-find-common-ground-on-exit-strategies/133280", "country": "IE", "title": "‘Companies, shareholders must find common ground on exit strategies’", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "‘Companies, shareholders must find common ground on exit strategies’ | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T08:09:00.000+03:00", "replies_count": 0, "uuid": "0cec583d04ceaab4208f99506db7ab099804ca32"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/indian-markets/companies-shareholders-must-find-common-ground-on-exit-strategies/133280", "ord_in_thread": 0, "title": "‘Companies, shareholders must find common ground on exit strategies’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Buy MSIL on robust growth in volumes: LKP Maintain buy on JSW Energy, target Rs 104: Edelweiss Fin Services High FII ownership an overhang for Indian market: Credit Suisse Citing examples of several delistings that took place with companies re-organising their share capital, proxy advisory firm IiAS, in a report, argues that companies and shareholders need to find a common ground on exit strategies.\nThe report states that for a few unlisted companies, reorganisation of share capital has helped them reduce minority shareholding. It cited the case of Bosch Chassis Systems India (BCSIL), a subsidiary of Bosch Group, which was delisted in 2008.\nAt the time of delisting, the promoters offered an exit price of R600 a share (fair value of R10) to minority shareholders. After delisting, the promoters held a 97.94% stake. The remaining 2.06% was distributed among 4,344 shareholders.\nHowever in an upcoming AGM, the company is seeking to adopt a resolution to increase the face value from R10 to Rs 100,000 a share.\nOn consolidation, each shareholder will receive shares as per their entitlement. “For example, if a shareholder holds 10,000 shares, she will receive one share after the consolidation. Shareholders who hold less than 10,000 shares will be left with fractional entitlements. All such fractional holdings will be aggregated and the resulting number of shares will be transferred to a trustee for sale. The proceeds will then be distributed to the shareholders with fractional entitlements. Based on the recommendation of the independent valuers, the company has fixed the sale price at Rs 600 per share.” states that IiAS report.\nBut some shareholders claim that not only is this coercive, but also the exit price is low and does not factor in the improved company fundamentals. But the company says that since the shares are not traded on any exchange, the scrip is illiquid.\nAs there is no active market for the shares, it is difficult for shareholders to find interested buyers. The company reasons that the move will benefit these shareholders, who now get an exit opportunity. While shareholders may have a valid concern, companies have a right to delist: IiAS believes companies and shareholders must work together to clear the air of mistrust and find a common ground which is in the best interest of all stakeholders.\nFirst Published on September 10, 2015 12:09 am", "external_links": [], "published": "2015-09-10T08:09:00.000+03:00", "crawled": "2015-09-10T03:03:01.108+03:00", "highlightTitle": ""}