{"organizations": [], "uuid": "dc81f96ddce7ace14c07a38a603f87c6d179a9bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/west-hartford-news/rss/627", "section_title": "West Hartford News : Personal Finance", "url": "http://business-news.thestreet.com/west-hartford-news/story/5-great-jobs-for-retirees/13283987", "country": "US", "title": "5 Great Jobs for Retirees", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "5 Great Jobs for Retirees", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T17:16:00.000+03:00", "replies_count": 0, "uuid": "dc81f96ddce7ace14c07a38a603f87c6d179a9bd"}, "author": "", "url": "http://business-news.thestreet.com/west-hartford-news/story/5-great-jobs-for-retirees/13283987", "ord_in_thread": 0, "title": "5 Great Jobs for Retirees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robert McGarvey"], "text": "5 Great Jobs for Retirees Written by: Robert McGarvey 09/10/15 - 10:16 AM EDT More Headlines Millennials Pound the Digital Pavement for Work and Confront the Digital Economy \nNEW YORK ( MainStreet ) — There are jobs beyond Walmart and McDonald's for retirees. That is good news, because the evidence is plentiful that many of us -- most of us, in some surveys -- lack a credible plan for a comfortable retirement and, for sure, lots of us lack the savings . Enter the part-time job, and a loud grumble of many retirees is that all they can find is minimum wage work and, money aside, the jobs are boring. But know this: they just are not looking hard enough. In fact many retirees are working at exactly what they want and making decent money. Doing what? Here are five jobs to covet. Travel agent. When Lynn Lewis retired as a San Francisco school teacher, she knew she wanted to keep working, and she also knew she wanted to travel. So she now is a travel consultant with Expedia CruiseShipCenters in Petaluma, Calif. Her job boils down to helping callers pick the cruise product that works for them, and she works 18 hours a week. “I could work more hours, but 18 is right for me,” she says. She did not offer her income but did say she makes more than she would at Walmart. (The Bureau of Labor Statistics says travel agents make on average $16+ per hour.) Oh, and there are perks: she just got back from a free 17-day cruise from England to Italy and back. Real estate agent. Bruce Ailion, Realtor and attorney with RE/MAX Town and Country in Atlanta, said he’s had a number of retirees in his office. He added: “As an agent when you list a property, you have every agent in the market working to sell it and generate a commission for you.” Different companies have different splits. But if a house sells for $200,000, there typically is $12,000 in commissions, divvied up between two agencies. Usually there’s another split in each agency (where the agency and a broker get a cut). The realtor probably gets about $3,000. How many hours do you have to work at McDonald's to earn $3,000? The job skills: knowing the neighborhoods, enjoying talking with people and driving from house to house. Said Aillon: “Working with buyers, you can pick the number of buyers to work with at a time. I had agents that worked full time part of the time. They would work with three to six buyers over a two-month period, sell four to five homes and then take two to three months off traveling. Few other activities allow this much control over your time and income.” He added that the barrier to entry is low. Take a course - probably 75 to 125 hours (often they are heavily discounted on Groupon and LivingSocial). Then pass a state exam and you are in. 1", "external_links": [], "published": "2015-09-10T17:16:00.000+03:00", "crawled": "2015-09-10T18:36:44.367+03:00", "highlightTitle": ""}