{"organizations": [], "uuid": "708ede04a9f5856a3d36253b3ac59b9eaec2c5a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/07/02/12965726/Wilmington Trust Logo.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12965726.htm", "country": "US", "title": "Wilmington Trust Adds Three Structured Finance Veterans to the Global Capital Markets Division", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Wilmington Trust Adds Three Structured Finance Veterans to the Global Capital Markets Division", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "708ede04a9f5856a3d36253b3ac59b9eaec2c5a6"}, "author": "Kent Wissinger", "url": "http://www.prweb.com/releases/2015/09/prweb12965726.htm", "ord_in_thread": 0, "title": "Wilmington Trust Adds Three Structured Finance Veterans to the Global Capital Markets Division", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wilmington Trust is expanding its Global Capital Markets Structured Finance Group with three new hires of corporate trust industry veterans. Rick D’Emelia was hired as a business development officer, Ben Jordan as head of transaction management, and Steve O’Neal as asset servicing manager. “The addition of Ben, Rick, and Steve to the Global Capital Markets division comes at a perfect time as we continue to enhance our structured finance product offerings,” said Joe Nardi, head of Wilmington Trust’s Capital Markets Structured Finance group. “The three are well known within the industry. Their hiring demonstrates Wilmington Trust’s strong commitment to the structured finance market with the expansion of document custody, back-up servicer, and indentured trustee services.”\nRICK D’EMELIA\nAs a business development officer, D’Emelia will develop new client relationships, while maintaining current client relationships in the capital markets structured finance industry.\nPrior to joining Wilmington Trust, D’Emelia was director and senior sales specialist at a large international bank, where he covered the asset-backed securities (ABS), mortgage-backed securities (MBS), and asset-backed commercial paper markets in the United States. Before that he was sales manager at JPMorgan Chase for the U.S. ABS markets.\nD’Emelia earned a bachelor’s degree in accounting from Villanova University. He is a certified public accountant.\nHe currently serves as president of Hockey in Middletown, a volunteer organization that raises funds for high school ice hockey programs in Middletown, N.J.\nD’Emelia is based in Wilmington Trust’s office at 166 Mercer St., Suite 2R, New York, N.Y.\nBEN JORDAN\nAs head of transaction management in the Structured Finance Group, Jordan is responsible for developing and closing new ABS and MBS transactions within the Global Capital Market division. The group provides agency and trustee services to the asset-backed, mortgage-backed, project finance, transportation leasing, insurance-backed, and reinsurance related markets.\nJordan has more than 12 years of industry experience, specializing in business development, servicer oversight, and relationship management for all types of structured financed transactions. Before joining Wilmington Trust, he was head of ABS servicer oversight for Wells Fargo’s corporate trust services, where he was responsible for risk mitigation over existing issuers and servicers, as well as contingent servicer development. Prior to that, Jordan was in a senior business development position, where he structured and closed mortgage-backed and asset-backed transactions.\nHe received an MBA in management from Mount St. Mary’s University, and a bachelor’s degree in marketing management from Virginia Tech. He also holds the Certified Corporate Trust Specialist designation from the American Bankers Association.\nJordan serves on the United Way of Central Maryland’s Baltimore City Partnership Board.\nJordan is based in Wilmington Trust’s office at 25. S. Charles St. in Baltimore, Md. He can be reached at (410)244-4090.\nSTEVE O’NEAL\nAs asset serving manager, O’Neal oversees the asset servicing products within the Global Capital Markets Structured Finance Group.\nHe has a broad base of experience from his many years in management positions within the global financial services industry. Prior to joining Wilmington Trust, O’Neal served as a managing director in BNY Mellon’s corporate trust division, where he was responsible for managing multiple product lines. Previous to that, he held senior management positions at several regional banks, and was a manager at two national public accounting firms.\nO’Neal received a Bachelor of Business Administration in accounting from the University of Texas at Arlington. He is a certified public accountant licensed in the state of Texas.\nO’Neal is a board member and treasurer for Child & Family Guidance Center (CFGC) in Dallas, Texas. CFGC is a not-for-profit organization with a mission to equip children, adults, and families with the skills and resources needed to reduce the effects of mental illness, child abuse, family violence and high-risk behaviors.\nO’Neal is based out of Wilmington Trust’s Texas office at 15950 North Dallas Parkway, Suite 550, Dallas, Texas. He is available by phone at (972)383-3155.\nABOUT WILMINGTON TRUST\nWilmington Trust provides Corporate and Institution Services including institutional trustee, agency, asset management, retirement plan, and administrative services for clients worldwide who use capital markets financing structures. The corporate and institutional division is distinguished from many competitors by its status as a core business of Wilmington Trust, as well as the experience and expertise of its global staff, its multi-jurisdictional presence, and its reputation for high-quality service.\nWilmington Trust also provides Wealth Advisory services with a wide array of personal trust, financial planning, fiduciary, asset management, private banking, and family office solutions designed to help high-net-worth individuals and families grow, preserve, and transfer wealth.\nWilmington Trust maintains offices throughout the United States and internationally in London, Luxembourg, Frankfurt, Dublin, Amsterdam, and Cayman Islands. For more information, visit http://www.WilmingtonTrust.com .\nMEDIA CONTACT: Kent Wissinger, Wilmington Trust PR Manager (302)651-8758\nWilmington Trust is a registered service mark. Wilmington Trust Corporation is a wholly owned subsidiary of M&T Bank Corporation. Investment services, wealth advisory, and corporate and institutional products and services are offered by Wilmington Trust Company, operated in Delaware only, and Wilmington Trust, N.A., a national bank. International corporate and institutional services are offered through our international affiliates.\nPrivate Banking is the marketing name for an offering of M&T Bank deposit and loan products and services.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cud2lsbWluZ3RvbnRydXN0LmNvbS93dGNvbS9pbmRleC5qc3A/c2VjdGlvbj1Db3JwJmZpbGVpZD0xNDE0MDg4NjAwNDE5", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cud2lsbWluZ3RvbnRydXN0LmNvbS93dGNvbS9pbmRleC5qc3A/c2VjdGlvbj1Db3Jw", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cud2lsbWluZ3RvbnRydXN0LmNvbS93dGNvbS9pbmRleC5qc3A/c2VjdGlvbj1XQVM=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy53aWxtaW5ndG9udHJ1c3QuY29t"], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-17T01:46:34.312+03:00", "highlightTitle": ""}