{"organizations": ["Annik Technology Services Pvt. Ltd"], "uuid": "f512388130d6a75254fe2b83f2d148fe8a0ef5c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/annik-frontrunner-data-analytics-opens-third-workplace-within-year/45266", "country": "US", "title": "Annik Frontrunner in Data and Analytics - Opens Third Workplace Within the Year", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Annik Frontrunner in Data and Analytics - Opens Third Workplace Within the Year", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T10:27:00.000+03:00", "replies_count": 0, "uuid": "f512388130d6a75254fe2b83f2d148fe8a0ef5c0"}, "author": "", "url": "http://businesswireindia.com/news/news-details/annik-frontrunner-data-analytics-opens-third-workplace-within-year/45266", "ord_in_thread": 0, "title": "Annik Frontrunner in Data and Analytics - Opens Third Workplace Within the Year", "locations": ["Hyderabad", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Annik Frontrunner"], "text": "Company : Annik Technology Services Pvt. Ltd. Friday, September 18, 2015 12:57PM IST (7:27AM GMT) Annik Frontrunner in Data and Analytics - Opens Third Workplace Within the Year Hyderabad, Andhra Pradesh, India \nAnnik Technology Services Pvt. Ltd. officiated their newest office in Hyderabad at a launch ceremony held on September 2, 2015. The newest workplace is located at Solitaire East, Plot No. 19, 3rd Floor, Rohini Layout, Opp. Cyber towers, Madhapur, Hyderabad – this marks the third new Annik office opening heralded by the Bellevue service center in January and the main Headquarters in Gurgaon, India opening in May of 2015. The global headcount of current Annik full time employees is now over 870 people in 5 global locations including; Gurgaon HQ, and Hyderabad in India; Warsaw in Poland; Dalian in China; and Seattle, Washington, USA. Annik was established in 2000 and provides off-shore data and analytics solutions including configurable workflow automation products. Recently Annik was chosen by the NASSCOM for being one of the Top 50 ‘Excellence in Analytics’ companies in 2015. Annik vision has been on a clear path since they opened 15 years ago; their vision is to provide thought leadership in providing world-class data and analytics solutions that help businesses realize the full potential of their data assets. Over time they have been building and enhancing the collective capabilities of their Research, Data/BI and Analytics services. With focus on innovation and technology working with fortune 1000 companies across domains such as; Telecommunication, Public Sector, Life Sciences, Retail & CPG, High Tech and Finance. COO, Sandeep Bhatia, said at the inaugural ceremony, “We understand that good business starts with good talented people at Annik we bring people together to work on business solutions that our global clients can trust along with long-term expertise.” About Annik Founded in 2000, Annik Technology Services Pvt. Ltd., is a global leader in providing world-class data and analytics solutions that help businesses realize the full potential of their data assets. Using a global delivery model, Annik solution framework leverages considerable in-house data and process expertise leveraging its configurable workflow automation products, across many data-intensive industries. For more information, please visit www.anniksystems.com .", "external_links": [], "published": "2015-09-18T10:27:00.000+03:00", "crawled": "2015-09-18T12:12:16.501+03:00", "highlightTitle": ""}