{"organizations": [], "uuid": "80f95b959ccbf203c9d2873a9fa3e7c36a98676b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/8/g/a/2/image.related.afrArticleLead.620x365.gjoi8k.png/1442553802215.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/why-smsfs-need-to-rethink-their-stock-picks-20150916-gjoi8k", "country": "AU", "title": "Why SMSFs need to rethink their stock picks", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why SMSFs need to rethink their stock picks | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T22:15:00.000+03:00", "replies_count": 0, "uuid": "80f95b959ccbf203c9d2873a9fa3e7c36a98676b"}, "author": "Kate Cowling", "url": "http://www.afr.com/personal-finance/why-smsfs-need-to-rethink-their-stock-picks-20150916-gjoi8k", "ord_in_thread": 0, "title": "Why SMSFs need to rethink their stock picks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Selfies\" have a tendency to stick to the big guys – but it's in their interests to pick more diverse options. Share on twitter by Kate Cowling Self-managed super fund (SMSF) investors are a diverse bunch, mainly characterised by their desire for control of how they invest their money and how much they pay to do it. But when it comes to their portfolios, their choices are starkly similar.\nLike many other investors, SMSFs love to play the sharemarket. A survey by the SMSF Association and NABTrade earlier this year found baby boomers with SMSFs put almost half (48.7 per cent) into equities while pre-boomer trustees put more than half (52.4 per cent) into the market.\nIf you were to scour those stock portfolios, you wouldn't see much variety in those picks, advisers say. Anecdotally, \"selfies\" have a tendency to stick to the big guys – the banks, the major miners, Telstra and a few of the retailers.\nThe average SMSF reported having 18 stocks in their portfolio – something that has remained steady since 2011, according to an Investment Trends survey of almost 4000 trustees. Almost three-quarters (72 per cent) had less than 20 stocks.\nBut analysis by Credit Suisse shows their selection is even narrower than that.\n\"It's literally down to five stocks – the four banks and Telstra,\" says Hasan Tevfik, an Australian equities strategist at Credit Suisse.\nThere's good reason for it too. The top five provide a stunning reward for very little risk.\n\"When you do a screen of the companies in Australia that provide the highest-dividend yield and the lowest volatility, those five companies come out top, so that explains why: they're the safest yield plays in Australia.\"\n However, he believes they're not the best match for retirees wanting to stretch their super for 20 years or more.\nTevfik thinks it's worth giving up a little bit of yield in favour of growth, because yield alone may not cover retirees' ongoing income needs.\n\"I think this is important for selfies because if you go to any of these seminars that advisers hold, it's quite clear that they are terrified of filling that income hole that is generated during the bpension phase,\" he says.\n\"They've got to tap their super fund by at least 4 per cent a year when they go into pension phase but they don't know how long they're going to live. Like everyone else, they want a good retirement and the option to go on holidays ... so it's very hard to cover that 4 per cent with cash rates at 2 per cent.\n\"And if you're going to be in pension phase for 20 years, it's quite risky owning the highest-yielding companies which aren't generating much in the way of dividend per share growth.\"\nIn the accumulation phase as well, many dividend-hungry investors may overlook a company's other red flags just to get that, says George Bourbouras, chief investment officer at Contango Asset Management.\n\"As well as the big four banks, many SMSFs will hold consumer staples that are performing poorly, like Wesfarmers and Woolworths, where we're very underweight. They're tolerating much lower prices to receive that dividend.\"\nIt's something SMSFs have recognised. More than a third (34 per cent) say a sustainable income stream was their priority this year, according to Investment Trends' report.\nLooking for income Analysts are increasingly saying restricting the investment scope to large cap, household names may not be the best strategy, given the question of how much more they can offer through revenue growth.\nCredit Suisse expects Telstra and the four big banks keep payout ratios steady at at 77 per cent, as the banks grapple with new capital holding requirements. There's still uncertainty about whether they will be passed on to shareholders or customers. Meanwhile, it downgraded its profit forecast for portfolio darling BHP, expecting the miner to earn just US60c a share in FY16, with an expected US$1.24 per share.\nThe most recent earnings season was marked by companies growing through cost-cutting as opposed to revenue – something that should make investors rethink their large-cap stock picks or at least broaden out, according to Michael Evans, co-founder of Quest Asset Partners.\n\"Over the last few years, you've been able to own a couple of retailers, own a couple of banks, get your yield, get your growth, and you've really haven't had to do anything. The top 20 outperformed by about 25 per cent post the [global financial crisis],\" he says.\n\"Now we're running into a different market,\" he warned. \"The banks are no longer getting earning upgrades and have run out of growth, and are having to carry more capital, and our major retailers are seeking to get better engagement with customers so there's just not the safety there was.\"\n\"Growth's a challenge across the whole market, so trying to find things that provide growth that's not just cyclical activity is difficult.\"\nBut Boubouras says the top 30 stocks are at greater risk of being dragged into an earnings vortex.\n\"For fiscal year 2016, on balance, consensus earnings are low 3 per cent, whereas they're normally 6.5 to 7 per cent. That's because it's market-weighted, and Coles and Woolies and the energy companies and the large resource companies and the banks are weighing it down,\" he says.\n\"When you look outside of that and focus on other mid-cap stocks, you can target 7 or 8 per cent earnings growth if you're willing to go for much smaller companies. You've got to look outside corporate Australia.\"\nUBS small caps manager Victor Gomes agrees. \"It's getting harder and harder to find growth and restricting yourself to a few of those big household names is not going to cut it; it's a risky strategy,\" he says.\nGomes says while there have been a few standout small caps – such as Dominos and new star on the block Sirtex – there is a danger in hinging retirement savings to one or two options, particularly given Australia's heavy concentration of financials and resources.\nHowever, if SMSFs aren't safe sticking to what they know, the solution to the problem – changing investment behaviour and finding growth in alternatives such as small cap stocks – may be equally challenging.\nNot so simple For conservative investors, selling long-time favourite stocks and embarking on a new hunt for undervalued small caps is far less simple than clicking a button, according to Anup Basu, associate professor of finance at Queensland University of Technology.\nBasu specialises in investor behaviour and says retail investors find it difficult to part with stocks they know, especially if they've served them well in the past.\n\"When companies have done well in the past, we tend to ignore their real future prospects and focus solely on past performance, and expect that to continue,\" he says. \"It's called 'anchoring bias' because we are anchored to the past.\"\nHe says ridding investors of bias is not easy, but a starting point could be removing the emotion by allowing yourself to trade based solely on certain non-negotiable signals. But that requires great discipline and can still mean investors rely on what has happened in the past.\nBasu's analysis is backed up by this year's Investment Trends research which shows while the proportion of SMSFs intending to invest in high-yielding shares has stayed fairly steady (down 1 per cent, from 34 per cent to 33 per cent), there's been a slightly greater drop in interest in small caps (down 6 per cent, from 21 per cent to 15 per cent).\nAnother issue is that have a tendency to see their large cap stock staples as long-term plays, almost like a marriage, while small caps are wedged in on the side in the hope they may be the next big thing, then ditched when they aren't – a bit like a fling.\n\"Ultimately, investors need to rethink the way they approach small caps,\" says Simon Conn, a senior portfolio manager at Investors Mutual Limited.\n\"The chase for capital growth has made small-cap investing a short-term play for the majority which, evidence suggests, is an unsuccessful strategy.\n\"By investing in small caps on a long-term basis with a focus on quality companies that provide portfolio diversification, both the income and capital growth returns for investors are broadened. This is particularly important given the concentrated nature of the Australian market index, exacerbated by the subdued economic environment,\" he adds.\nPockets of value As Quest's Evans points out, SMSFs may have to broaden their criteria while avoiding small caps leveraged to the same risks as their large-cap counterparts. It's no easy feat, he says.\n\"We've been looking through more than 100 IPOs in the last two years, trying to find companies that can sustain good returns and grow, and the truth is, they have been hard to find. There are few companies that have got revenue growth,\" he says.\nHe recommended looking for sectors with demographics on their side, such as the healthcare sector. But he says investors have to choose a theme that offers the prospect of longer-term growth.\n\"Is it new technology? Is it demographics? Is it population flow? You have to decide what you want. You just have to go out and look for what are the sectors that provide growth. Most companies will present themselves in a very positive light, so you have to find independent sources.\n\"Just buying based on yield can be dangerous. You just have to go out and look for what are the sectors that provide growth. Most companies will present themselves in a very positive light so you have to find independent sources.\n\"Companies that are only attractive because they have high dividends can be significant underperformers. The yield is paid but you lose capital at the same time.\"\nWhen it comes to finding growth potential, standouts for Evans include Vista Group , a cinema management software developer headquartered in New Zealand but available on the Australian Securities Exchange, and amaysim , a mobile phone service provider.\nUBS' Gomes and IML's Conn point out small caps often don't have as much publicly available research behind them which can make them risky but also increase the opportunity for investors to find undervalued stocks.\nIML has invested in manufacturer and packager PACT Holdings , NZ fixed line telecommunications company Chorus and energy company Energy Developments .\nUBS' small caps team similarly selects companies that have innovation, competitive advantage and strong management on their side. In addition to Sirtex and Dominos, its recent overweights include data centre provider NextDC and automotive part distributor Burson Group .\nFor Credit Suisse's Tevfik, smaller companies may offer a little bit more risk but have a much greater potential to reward shareholders over the long term with DPS growth.\n\"Instead of the banks, we'll be buyers of Macquarie ,\" he says. \"Instead of Telstra, we're buyers of M2 .\"\nAccording to Tevfik, M2 is a nimbler telecommunications play which ticks the boxes of dividend yield and future DPS growth.\n\"It has a pretty high dividend yield and trades on a very attractive free cash flow yield, and that just means it's generating enough cash to cover its dividend and plus some,\" he says.\n\"Because it's in the right area and is managed very well, and using balance sheet efficiently, it's growing at quite a strong rate,\" he adds.", "external_links": ["https://twitter.com/kate_cowling"], "published": "2015-09-18T22:15:00.000+03:00", "crawled": "2015-09-18T19:52:42.758+03:00", "highlightTitle": ""}