{"organizations": [], "uuid": "1c0dd2f4d723fb89b451d6aa7b3d279422cbd752", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.flightglobal.com", "main_image": "", "site_section": "http://www.flightglobal.com/news/finance/", "section_title": "News Channel | Finance News, Analysis and Opinion | flightglobal.com", "url": "http://www.flightglobal.com/news/articles/boeing-japans-aviation-sector-develop-biofuel-for-414446", "country": "US", "title": "Boeing, Japan’s aviation sector develop biofuel for 2020 Olympics", "performance_score": 0, "site": "flightglobal.com", "participants_count": 1, "title_full": "Boeing, Japan’s aviation sector develop biofuel for 2020 Olympics", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T20:46:00.000+03:00", "replies_count": 0, "uuid": "1c0dd2f4d723fb89b451d6aa7b3d279422cbd752"}, "author": "flightglobal.com", "url": "http://www.flightglobal.com/news/articles/boeing-japans-aviation-sector-develop-biofuel-for-414446", "ord_in_thread": 0, "title": "Boeing, Japan’s aviation sector develop biofuel for 2020 Olympics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boeing and Japan’s aviation sector have partnered to develop sustainable aviation biofuel for flights during the 2020 Olympic and Paralympic Games in Tokyo.\nUnder the Initiatives for Next Generation Aviation Fuels (INAF) programme, a consortium of 46 organisations including Boeing, leading Japanese carriers and the government have laid out a five-year plan to develop biofuel in an effort to reduce “aviation’s environmental footprint”.\nIn a statement, Boeing cites the US Department of Energy, which says that “sustainably produced biofuel reduces lifecycle carbon dioxide emissions by 50% to 80% compared to conventional petroleum fuel”.\n\"Boeing is proud to work with Japan's aviation sector, including customers and the Japanese government, to achieve their ambitious goals for developing sustainable aviation biofuel,\" said George Maffeo, president of Boeing Japan.\n\"Building on our longstanding relationships in Japan, we are committed to help reduce aviation's carbon emissions and its reliance on fossil fuel,\" Maffeo adds.\nAmong the findings in Boeing’s report on sustainable biofuel, it was found that potential feedstocks could be used to produce sustainable aviation biofuel.\nThe airframer also found that policy incentives that promote the introduction of next-generation aviation fuels “are a prerequisite to success” in aviation biofuel use.\nEstablished in May 2014, INAF was established to create a supply chain for next-generation aviation fuels in Japan, which includes the procurement of raw materials and studying how biofuel will be incorporated into an airport’s fueling infrastructure.\nRelated Content Boeing 1H deliveries outpace net orders by 100 aircraft PICTURES: Boeing donates first 787 to Nagoya airport", "external_links": [], "published": "2015-08-26T20:46:00.000+03:00", "crawled": "2015-09-08T12:15:52.717+03:00", "highlightTitle": ""}