{"organizations": [], "uuid": "37716c7790b4c8288ffe8e351e9a615fc2b9aae5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/zujiqqqw_VlmVdcATztxJw--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/171b971251d5f5c31bf1105cb8cd977abb083368_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Top stories from Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/china-worries-exact-toll-wall-230336592.html", "country": "GB", "title": "China worries exact toll on Wall Street", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "China worries exact toll on Wall Street", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T02:03:00.000+03:00", "replies_count": 0, "uuid": "37716c7790b4c8288ffe8e351e9a615fc2b9aae5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/china-worries-exact-toll-wall-230336592.html", "ord_in_thread": 0, "title": "China worries exact toll on Wall Street", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Sep 5, 2015, 03:02 BST - UK Markets closed China worries exact toll on Wall Street AFP – 2 hours 59 minutes ago View Photo \n\nWall Street succumbed to worries over China and the world economy this week with broad selling across blue chips as investors took warning that companies would suffer from duller global growth. \nEverything from the largest tech companies to industrial giants to banks took hits, even as US economic data remained buoyant. \nThe selloff -- which mapped those in Tokyo, Europe and elsewhere -- left US share investors firmly in the red for the year, the major indices ending Friday well below their records of just weeks ago. \nThe Dow Jones Industrial Average ended the week off 3.2 percent at 16,102.38, nearly 9.7 percent below where it began the year. \nThe S&P 500 lost 3.4 percent to 1,921.22 over the period, and was a 6.7 percent loss since January 1. \nAnd a 3.0 percent loss in the week, to 4,683.92, left the market's outperformer, the Nasdaq Composite, also at a loss for the year, down 1.1 percent. \n\"It (Other OTC: ITGL - news ) 's very clear that concerns about China and the impact on earnings of US companies are very very deep,\" said Hugh Johnson of Hugh Johnson Advisors. \n\"It has affected commodity demand and commodity prices, which has affected the economies of important countries, and that's not good news for earnings.\" \nBeijing showed it could only stifle the crash of shares in Shanghai and Shenzhen with a two-day holiday for their 70th anniversary of the end of World War II on Thursday and Friday. \nApparent interventions slowed the selling earlier in the week, but analysts anticipated more losses when the markets reopen next week. \nThe worries about China's economic downturn, and about Beijing's ability to get a handle on it, were a key issue at a meeting of G20 finance ministers in Ankara on Friday and Saturday. \nGoing into the meeting, the International Monetary Fund said the impact on other countries of China's economy gearing down would be greater than originally expected. \nThe Fund stressed the need for stronger economies to not pull back but keep spending, and others to push through with reforms that would enhance markets and investment, rather than deter it. \nAnd the US warned Beijing to better communicate its intentions on economic and currency policy, after China's August 11 devaluation rocked markets and scared investors. \n- Caution ahead of holiday - \nIn the US, a modest August jobs report was seen as enough to support the Federal Reserve to start raising interest rates this month after a long wait. \nBut most analysts said the wait would continue, with the Fed holding off while global markets remained tumultuous. \nHowever good the jobs data, said Nariman Behravesh, chief economist at IHS (NYSE: IHS - news ) , \"circumstances have changed over the past month.\" \n\"The stock market selloff and continued volatility mean that credit conditions have tightened and that markets are doing the Fed's job. Consequently, the (Fed) is less likely to raise rates in September and more likely to begin tightening later this year.\" \nSome analysts said the Wall Street selloff was magnified by the Chinese market close and the long Labor Day holiday weekend in the United States, where markets will remain shuttered on Monday. \n\"We have a three-day weekend here in the US, China will open again on Monday and it has been closed the last two days... So no one wants to be a hero while standing at the barbecue on Sunday night, worried about if Shanghai will be up or down six percent,\" said Mace Blicksilver of Marblehead Asset Management. \n\"I would expect next week to be less volatile than this week,\" said Tom Cahill of Ventura Wealth Management. \nEven (Taiwan OTC: 6436.TWO - news ) so, he reminded, \"markets are looking at the global situation, and taking into account China and market volatility. Any information that is worrying out of China could push markets lower.\"", "external_links": [], "published": "2015-09-05T02:03:00.000+03:00", "crawled": "2015-09-05T05:07:50.720+03:00", "highlightTitle": ""}