{"organizations": [], "uuid": "523cf2f9ae751a959ea022d3193675326b0bd005", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/morning-star-publishing/rss/627", "section_title": "Morning Star Publishing : Personal Finance", "url": "http://business-news.thestreet.com/morning-star-publishing/story/republic-closer-to-bankruptcy-as-teamsters-ground-proposed-pilot-deal/13275584", "country": "EU", "title": "Republic Closer to Bankruptcy as Teamsters Ground Proposed Pilot Deal", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Republic Closer to Bankruptcy as Teamsters Ground Proposed Pilot Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T00:33:00.000+03:00", "replies_count": 0, "uuid": "523cf2f9ae751a959ea022d3193675326b0bd005"}, "author": "", "url": "http://business-news.thestreet.com/morning-star-publishing/story/republic-closer-to-bankruptcy-as-teamsters-ground-proposed-pilot-deal/13275584", "ord_in_thread": 0, "title": "Republic Closer to Bankruptcy as Teamsters Ground Proposed Pilot Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lou Whiteman"], "text": "Republic Closer to Bankruptcy as Teamsters Ground Proposed Pilot Deal Written by: Lou Whiteman 09/02/15 - 5:33 PM EDT Tickers in this article: RJET \nNEW YORK (The Deal) -- Republic Airways moved one step closer to a potential bankruptcy filing late Tuesday after national Teamsters officials backed a decision by local leaders not to send a proposed labor deal out to pilots for a vote. \nIndianapolis-based Republic, which flies small jets for partners Delta Air Lines , United Continental and American Airlines , in late August made what it called its \"last, best and final offer\" to try to resolve a long-running standoff with its pilots. Republic management, in a letter to pilots posted on the Internet, warned that the alternative to accepting the deal would be far worse. Whirlpool Trips Up Middleby Acquisition of AGA With Last-Minute Bid \n\"The other path is a non-consensual restructuring in which we no longer control our destiny,\" Republic wrote. \"It is a difficult and unwelcome choice, but it is better than remaining stuck at this frustrating crossroads.\" Local union officials, however, chose not to send the offer to members, despite its promise of higher wages and contained healthcare costs, in part because of language that would have handcuffed future union communications with its pilots. The group also complained that Republic failed to provide data to support its wage proposals and modified contract language that had previously been agreed to. The national International Brotherhood of Teamsters late Tuesday decided against overriding the local's decision, putting Republic's future in doubt. The airline and its pilots have been at loggerheads for more than seven years, with membership voting overwhelmingly to reject a tentative contract in 2014. The standoff has made it hard for the company to find enough pilots to cover existing schedules, leading to lower productivity, poor reliability and mounting unreimbursed aircraft costs. It has also taken a toll on Republic's stock price: Shares of the company are down more than 79% for the year to date, and opened down nearly 30% to $2.24 Wednesday morning on fears of a bankruptcy. Shares closed Wednesday at $2.96, down 2.3%.", "external_links": [], "published": "2015-09-03T00:33:00.000+03:00", "crawled": "2015-09-03T10:08:35.170+03:00", "highlightTitle": ""}