{"organizations": [], "uuid": "35e39eaad544397df329168251009c1caa9680c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/lloyds-premier-bank-account-holders-114230167.html", "country": "US", "title": "Lloyds Premier bank account holders' financial details 'stolen'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Lloyds Premier bank account holders' financial details 'stolen'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T14:42:00.000+03:00", "replies_count": 0, "uuid": "35e39eaad544397df329168251009c1caa9680c3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/lloyds-premier-bank-account-holders-114230167.html", "ord_in_thread": 0, "title": "Lloyds Premier bank account holders' financial details 'stolen'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Sep 10, 2015, 12:50 BST - UK Markets close in 3 hrs 40 mins Lloyds Premier bank account holders' financial details 'stolen' By Katie Morley | Telegraph – 7 minutes ago Print \nPolice are investigating a major data theft which has left thousands of banking customers vulnerable to fraud \nThe personal data of thousands of Lloyds Premier Banking customers has gone missing and is suspected to have been stolen by fraudsters, the Telegraph has learnt. \nPolice are investigating the disappearance of a storage device that contains people's names, addresses, sort codes and account numbers, after it was taken from a data centre in July. \nThe data breach affects customers who had Royal Sun Alliance emergency home cover attached to their Lloyds Premier bank account between 2006 and 2012. The policy comes as standard with the £25-a-month packaged account. \nLloyds claimed Royal Sun Alliance is only the provider for a \"small\" number of its emergency home cover policies, but it refused to disclose the exact figure. \nLast week Lloyds wrote to customers to warn that they may be at risk of fraud, urging them to buy special insurance to protect them if fraudsters use the details to steal their money. Royal Sun Alliance has promised to cover the cost of this for two years. \nA Royal Sun Alliance spokesman said: “Unfortunately a data storage device has been reported as stolen from one of our data centres. We have advised our regulators and are in the process of contacting potentially impacted customers to apologise. \n\"We are working with the police on a full investigation and although there is no evidence to suggest that this data has been misused in any way, we are offering identity protection with Cifas for two years to provide reassurance to these customers. We recognise this should never have happened and apologise to all customers who have been impacted.” \nA Lloyds Bank spokesperson said: “RSA was the home emergency insurance cover provider for a small number of Lloyds Premier Account holders and the data was held as per standard data retention requirements and processes. We are continuing to work closely with RSA on their investigation and impacted customers have been contacted. Any of these customers can call the dedicated freephone helpline number 0800 316 809 to discuss concerns.” \nThe incident, which is just the latest in a string of serious data breaches in the UK, raises questions about the security of people's details stored within financial companies. \nHas your personal data been stolen or your security breached? Email: katie.morley@telegraph.co.uk", "external_links": [], "published": "2015-09-10T14:42:00.000+03:00", "crawled": "2015-09-10T14:50:35.681+03:00", "highlightTitle": ""}