{"organizations": [], "uuid": "247632ccbdf216c0079a51aa8fb3b7cbf598a095", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/ea5507aa-e5b5-48ea-a7e6-cbf4fc80af4d.img", "site_section": "http://www.ft.com/rss/personal-finance", "section_title": "Personal Finance", "url": "http://www.ft.com/cms/s/0/16a8f76e-4fcc-11e5-8642-453585f2cfcd.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "country": "US", "title": "Co-op shares headed for online auction", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Co-op shares headed for online auction", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T02:12:00.000+03:00", "replies_count": 0, "uuid": "247632ccbdf216c0079a51aa8fb3b7cbf598a095"}, "author": "", "url": "http://www.ft.com/cms/s/0/16a8f76e-4fcc-11e5-8642-453585f2cfcd.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Co-op shares headed for online auction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Investment banks outshine parent groups \n“The idea originally came from shareholders who contacted us,” said Ian Baillie, co-chief executive of Asset Match, adding that owners of between £5,000 and £250,000 in bank shares had been in touch. \nShareholdings in the bank date from 2013 after the lender was rescued in a recapitalisation led by hedge funds, cutting the stake owned by the Co-operative Group from 100 per cent to 30 per cent. As part of that deal, tranches of junior bondholders accepted conversions to shares. \nDirect retail bondholders largely escaped that conversion after a campaign to keep them in income-generating investments. But hedge funds were not the only creditors to undergo a switch to shares, with some 80 per cent of the bank’s current share capital held by nominee accounts, including wealth managers and direct-to-consumer investment platforms, according to Asset Match. \nInstitutions have traded Co-op Bank Shares privately through brokers, leading to a last indicative price of 200p, implying a market capitalisation of about £900m. But Mr Baillie said his company believes there is “a large number of investors who don’t have access to that market”, with more than 450m shares outstanding. \nUnder Asset Match’s system, would-be buyers and sellers register limits on the prices at which they are prepared to buy and sell. This leads to an indicative sale price that is visible throughout the auction, enabling traders to adjust their bids and offers if they wish. \nAt the conclusion of the auction, an algorithm determines the final price and number of shares to be transacted. Buyers with bids at or higher than the final price, and sellers with offers lower than or equal to that price, are able to complete their trades. \nThe Co-operative Bank said it would not comment on trading of its shares. It has considered the idea of listing on a stock market, but this has not so far materialised. On August 20 it reported a pre-tax loss of £204.2m for the first half, nearly triple the loss in the same period a year earlier. \nAsset Match’s system has been used for private company investments from the 95-year-old Isles of Scilly Steamship Company to BrewDog, the “punk” beer maker that has crowdfunded at least £10m of investment from the public. BrewDog holds annual share auctions via Asset Match. Related Topics Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-09-01T02:12:00.000+03:00", "crawled": "2015-09-01T13:31:58.347+03:00", "highlightTitle": ""}