{"organizations": [], "uuid": "2d853343e82a6242fa145eb10a191939bfe87f6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/08/markets-bonds-euro-idUSL5N11E1R620150908", "country": "US", "title": "Recovering Chinese stocks firm demand for peripheral euro zone debt", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Recovering Chinese stocks firm demand for peripheral euro zone debt | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T14:47:00.000+03:00", "replies_count": 0, "uuid": "2d853343e82a6242fa145eb10a191939bfe87f6b"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/08/markets-bonds-euro-idUSL5N11E1R620150908", "ord_in_thread": 0, "title": "Recovering Chinese stocks firm demand for peripheral euro zone debt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Sentiment improves after late bounce in Shanghai shares\n* Weak China trade data supports calls for further easing\n* Italian, Spanish bond yields fall, outperform Bunds\n* Analysts say market ructions show Catalan vote nerves (Recasts and writes through)\nBy John Geddie\nLONDON, Sept 8 (Reuters) - Investors bought up peripheral euro zone debt on Tuesday as a recovery in Chinese stock markets and better-than-expected growth data lifted sentiment.\nEven though China said its imports fell far more than anticipated last month, adding to global growth concerns, analysts are tipping the world's second largest economy to announce further policy-easing to support markets.\nChinese stocks, which have shed some 40 percent since mid-June, saw a late bounce that reverberated across global shares, sending European bourses higher.\nThis improving risk appetite was helped by some record-breaking trade data from the bloc's powerhouse Germany and an upward revision to euro area second-quarter growth.\n\"There has been a general improvement in risk sentiment that started after the recovery in China's stock market and carried through the improved euro zone data,\" Rabobank strategist Lyn Graham-Taylor said.\nChina's August exports fell less than expected, but a steeper slide in imports pointed to continuing economic weakness.\nWeak data from China has raised expectations for more policy easing from the Chinese central bank. A Reuters poll at the end of August showed 80 percent of respondents looked to a further cut in banks' reserve requirement ratio and 70 percent saw a chance of interest rate cuts.\nDeclining consumption from China and a weakening yuan is also raising disinflationary pressures around the world, which may force other central banks into more monetary stimulus.\nECB President Mario Draghi for the first time explicitly stated last week that the bank may extend its asset purchase programme beyond its scheduled end date in September 2016.\nYields on low-rated debt in the bloc's southern periphery fell on Tuesday, outperforming benchmark German bonds.\nItalian 10-year yields fell 5 basis points to 1.85 percent , while Spanish equivalents dipped 4 bps to 2.10 percent.\nGerman yields were 1 bps higher on the day to 0.68 percent after the country sold 745 million euros of an inflation-linked bond maturing in 2030. The Netherlands also sold 890 million euros of a bond maturing in 2047.\nAnalysts also pointed to the widening gap between Italian and Spanish bond yields ahead of an election in Catalonia which polls show is likely to hand separatists a majority.\nAt 25 bps, the gap between the two benchmarks is at its widest in two years and is expected to be stretched further.\nCatalan separatists are portraying the election on Sept. 27 as a proxy vote on independence, although that is disputed by Spanish Prime Minister Mariano Rajoy, who has ruled out a breakaway by the wealthy northeastern region.\n\"Uncertainty ahead of the regional elections in Catalonia...is currently causing Iberian debt securities to underperform. We are assuming that this trend will continue at least until the election date,\" DZ Bank said in a note. (Editing by Mark Heinrich )", "external_links": [], "published": "2015-09-08T14:47:00.000+03:00", "crawled": "2015-09-08T13:55:50.785+03:00", "highlightTitle": ""}