{"organizations": ["Bollore"], "uuid": "fa06d2474bfd4c9bdf7ada004d007de3a304928f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/bollore-tightens-grip-canal-bid-172204343.html", "country": "GB", "title": "Bollore tightens grip on Canal+ in bid to create French media superpower", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Bollore tightens grip on Canal+ in bid to create French media superpower", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T22:30:00.000+03:00", "replies_count": 0, "uuid": "fa06d2474bfd4c9bdf7ada004d007de3a304928f"}, "author": "", "url": "https://uk.finance.yahoo.com/news/bollore-tightens-grip-canal-bid-172204343.html", "ord_in_thread": 0, "title": "Bollore tightens grip on Canal+ in bid to create French media superpower", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Sep 3, 2015, 20:46 BST - UK Markets closed Bollore tightens grip on Canal+ in bid to create French media superpower By Christopher Williams | Telegraph – 16 minutes ago +0.034 \n'Arrogance is not behaviour that will help us make progress', billionaire warns staff \nVincent Bollore, the French billionaire, has tightened his grip on the media giant Vivendi (Swiss: VIV.SW - news ) by ousting the chairman of its pay-TV operation Canal+ and installing a close lieutenant in his place, signalling a major overhaul. \nMr Bollore, who has built up a 14.5pc stake in Vivendi, replaced Bertrand Meheut as chairman of the Canal+ management board with Jean-Christophe Thiery, a longstanding Bollore Group executive. \nSimultaneuously, Mr Bollore has himself become chairman of the Canal+ supervisory board. Both changes are signals that the operator will be expected to work more closely with companies under the Vivendi umbrella, including Universal Music and the YouTube rival Dailymotion. \nCanal+ previously operated relatively independently, but Vivendi has been gradually buying out minority shareholders with a view to realising Mr Bollore (Other OTC: BOIVF - news ) 's vision of a French media champion. \nIn a memo to staff seen by The Telegraph, the 63-year-old industrialist said the boardroom changes would set the scene for “necessary changes” at Canal+ and warned that “arrogance is not behaviour that will help us make progress”. \nMr Bollore said: “When one is appointed chairman of a large company, it is very easy not to do very much, so as not to upset the routine and to remain popular. \n“That is not the way I do things. I will therefore be fully involved and will not try to hide behind third parties when taking the necessary steps.” \nThe overhaul will include breaking down barriers between Vivendi businesses, he said, with senior group executives put in charge of basic Canal+ functions including personnel and auditing. \nA new special department will also be created to run across Vivendi under the British executive Simon Gillham. Its task will be spotting and attracting producers and writers of content that the company can promote and exploit across its outlets. \nAs well as pay-TV and free-to-air channels, Canal+ runs a film studio, while Universal Music is the world’s largest record label. Vivendi also owns the live event ticketing operation See Tickets and acquired 80pc of Dailymotion in June. \nBringing Canal+ fully into the fold will be seen as a key moment in Mr Bollore’s effort to turn Vivendi into a genuine global media power. Since he began building his stake, the company has sold off telecoms assets to focus on content. \nHe told Canal+ staff: “Our basic premise will be that French and European culture is rich in content and talent and capable of rivalling American or Asian content. \n“In effect, we must look for opportunities and be prepared to take risks and support authors and producers. We must not be afraid to invest, even if much of the results will be achieved in the long term.” \nAs part of the plans, Vivendi plans to invest more in English and Spanish language films and programming. The company is sitting on a cash reserve of almost €9bn and could seek a boost from major acquisitions; it held brief discussion towards a bid for Sky (LSE: BSY.L - news ) earlier this year that did not progress . \nBollore Group, which also controls the advertising company Havas (Other OTC: HAVSF - news ) , signalled its international ambitions this summer by moving into the former Spanish embassy on Cavendish Square. Mr Bollore said London was the natural base for his strategy. \nThe magnate's control of Vivendi is schedule to tighten further in April, when the voting rights of some of his shares will double under France’s controversial Florange law. The extra influence was approved by other shareholders earlier this year.", "external_links": [], "published": "2015-09-03T22:30:00.000+03:00", "crawled": "2015-09-03T22:47:42.917+03:00", "highlightTitle": ""}