{"organizations": ["RYANAIR"], "uuid": "3be780c0fda7e3a938177f788f28058574e12989", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/22/590x/Ryanair-604147.jpg", "site_section": "http://www.express.co.uk/posts/rss/21/finance", "section_title": "Daily Express :: Finance Feed", "url": "http://www.express.co.uk/finance/city/604147/Ryanair-British-summer-airline", "country": "IE", "title": "Airline sky high after wet British summer", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Airline sky high after wet British summer", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T02:01:00.000+03:00", "replies_count": 0, "uuid": "3be780c0fda7e3a938177f788f28058574e12989"}, "author": "", "url": "http://www.express.co.uk/finance/city/604147/Ryanair-British-summer-airline", "ord_in_thread": 0, "title": "Airline sky high after wet British summer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael O’Leary"], "text": "Airline sky high after wet British summer Airline sky high after wet British summer RYANAIR shares hit a high as large numbers of Britons flying to the Med and lower fuel costs set the airline on course for bumper annual profits. PUBLISHED: PUBLISHED: 00:01, Thu, Sep 10, 2015 EPA Boss Michael O’Leary – but he warns airline fare wars will be ongoing in winter \nThe Irish no-frills carrier’s aircraft have been flying 95 per cent full in July and August as UK passengers took advantage of the strong pound to escape to sunnier climes. \nChief executive Michael O’Leary said projecting a more customer-friendly image through its “Always getting better” programme was delivering results by winning new customers at higher than- expected fares. \nIt expects its annual profit to be 25 per cent higher than a current range of €940-970million (£683-705million) at between €1.175-1.225 billion. \nThe scale of the upgrade – up 40 per cent on the previous year – forced the airline to bring forward its update planned for September 24. \nHalf-year traffic grew by 13 per cent compared with a 10 per cent forecast, while fares were up 2 per cent against an earlier fl at prediction. We have been surprised by the strength of close-in bookings and fares this summer Michael O’Leary \nPassenger growth in the third quarter is expected to rise by 15 per cent against a 13 per cent forecast, with fares flat compared with previous suggestions they could fall by between 4-8 per cent. \nO’Leary said: “We have been surprised by the strength of close-in bookings and fares this summer.” \nBut he added: “We have benefited from trends including bad weather in Northern Europe, stronger sterling encouraging more families to holiday in the Med and lower prices for our unhedged oil. \nWe do not expect these conditions to persist and urge shareholders to avoid irrational exuberance as we continue to execute growth during what we expect to be sustained fare wars across Europe this winter.” \nRyanair shares jumped 67 cents or 5 per cent to €13.61. Related articles", "external_links": [], "published": "2015-09-10T02:01:00.000+03:00", "crawled": "2015-09-10T02:32:23.947+03:00", "highlightTitle": ""}