{"organizations": [], "uuid": "51a20d84630ca63c86f881753d08133c1c3f94b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/u/s/d/w/image.related.afrArticleLead.620x365.gjrhje.png/1439101392847.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/real-estate/china-numbers-point-to-a-real-estate-rush-as-fears-grow-over-equities-20150921-gjrhje", "country": "AU", "title": "China numbers point to a real estate rush as fears grow over equities", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "China numbers point to a real estate rush as fears grow over equities | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T22:00:00.000+03:00", "replies_count": 0, "uuid": "51a20d84630ca63c86f881753d08133c1c3f94b7"}, "author": "Ambrose Evans-Pritchard", "url": "http://www.afr.com/real-estate/china-numbers-point-to-a-real-estate-rush-as-fears-grow-over-equities-20150921-gjrhje", "ord_in_thread": 0, "title": "China numbers point to a real estate rush as fears grow over equities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Residential houses in a valley in Yunnan. Equity analyst JL Warren says sales have rebounded. Reuters by Ambrose Evans-Pritchard House sales are rising at an explosive pace in China across most regions as stimulus measures kick in and the Communist authorities launch yet another cycle of credit growth.\nFresh data collected by China research house JL Warren Capital show that sales of existing homes surged by 115pc from a year earlier in the second week of September, rising to 135pc for the so-called \"tier two\" group of mid-to-large cities.\nIt is the second week of vertiginous growth rates and suggests that buyers may be switching to hard assets after losing confidence in the Shanghai and Shenzhen stock markets. The Chinese media has reported the first signs of a buyers' panic in some cities.\nAny sign of a rebound is highly significant for a world economy that has been flirting with recession for several months and is now acutely sensitive to every move in China. But it is far from clear whether this is yet another sugar-rush or a genuine turning point as the Chinese authorities struggle with the aftermath of an epic credit bubble.\nCentral banks appear to be having great trouble reading events in China, where data is mistrusted and instruments used to regulate the economy are unfamiliar.\nWarren Capital said the sales of new homes were more modest, rising 66pc in the biggest \"tier one\" cities and 22pc for the 57 cities tracked across the country. There is still a huge glut of unsold properties in the smaller cities of the interior, where rampant over-building was at its worst, but there may at last be glimmers of hope even there.\nThe data is collected directly from the government's real estate centres around the country and offers an immediate snapshot of the market.\nIt follows the release of figures from the National Bureau of Statistics last week showing that house prices rose 1.7pc in August for a year earlier, and have now been recovering for several months. Prices rose 32pc in Shenzhen.\n The Chinese central bank (PBOC) has cut interest rates four times since the loosening cycle began in November , when monetary policy was ferociously tight. Average mortgage rates have dropped to near 5pc from 7pc in mid-2014.\nRegulators have lifted curbs on purchases of second homes, cut down-payment requirements from 30pc to 20pc, and are now actively encouraging teachers and civil servants to buy property, using special incentives.\nThe authorities appear to have lurched from a \"tough love\" stance last year to feverish salesmanship, reminiscent of their on-off interventions in the stock market debacle.\nThe Daily Telegraph", "external_links": [], "published": "2015-09-21T22:00:00.000+03:00", "crawled": "2015-09-21T23:09:31.101+03:00", "highlightTitle": ""}