{"organizations": [], "uuid": "df7deb38a3b77ef81f7b63df1ca329ef13fe4b4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509282644.html", "country": "US", "title": "Nigeria: Buhari Applauds China for Intercepting Nigeria's Stolen Crude Oil", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Buhari Applauds China for Intercepting Nigeria's Stolen Crude Oil", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T16:54:00.000+03:00", "replies_count": 0, "uuid": "df7deb38a3b77ef81f7b63df1ca329ef13fe4b4b"}, "author": "", "url": "http://allafrica.com/stories/201509282644.html", "ord_in_thread": 0, "title": "Nigeria: Buhari Applauds China for Intercepting Nigeria's Stolen Crude Oil", "locations": ["Nigeria", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chesa Chesa"], "text": "Nigeria: Pope Decries Destruction of Worship Centres in Nigeria By Chesa Chesa \nAbuja — President Muhammadu Buhari has expressed his government's appreciation to China for intercepting stolen crude oil being shipped from Nigeria for sale in the international black market. \nBuhari, who met on Sunday with Chinese President, Xi Jinping, on the sidelines of the 70th General Assembly of the United Nations in New York, restated his determination to fully sanitise the nation's oil industry and free it totally from the stranglehold of corruption. \nAn Aso Rock statement from New York said Buhari thanked Xi Jinping for China's ongoing help to curb crude oil theft from Nigeria by the intercepting shiploads of crude oil stolen from Nigeria and which were to be sold and proceeds paid into private accounts. \n\"We know your stand on corruption, and we are grateful. Your continued co-operation in curbing oil theft from Nigeria will be appreciated,\" he told the Chinese leader. \nThe President said he had taken a necessary first step to check corruption in the oil sector with the appointment of a new management for the Nigerian National Petroleum Corporation (NNPC) and its subsequent re-organisation. \nHe restated that the prosecution of those who misappropriated the NNPC's revenue under past administrations would soon begin. \nHe also assured Xi Jinping that under its new leadership, the Nigerian military had been re-trained and re-equipped, and was now making steady gains against Boko Haram. \nThe Chinese leader told Buhari that China, which is already involved in Nigeria in diverse areas such as railway, airports, agriculture, and in the Mambilla Hydro-power project would increase its investment in the country's agricultural sector to support the achievement of domestic food security. \nHe also promised further Chinese investment in Nigeria's oil and gas industry, and more support for human capital development in the country. \nMeanwhile, addressing newsmen in Lagos at the weekend, Group Chief Executive of the NNPC, Dr. Ibe Kachikwu said the forensic audit of the corporation to 2014 by the international firm of PricewaterhouseCoopers (PwC) would be concluded by December. \nHe noted that NNPC's books were last audited in 2010, regretting the N2.4 trillion spending by the nation on petroleum products subsidy, which now requires some modulation. \nHe also regretted that only five of the corporation's subsidiaries are profit making, adding that in the case of the Petroleum Products Marketing Company (PPMC), its $200 million average loss would be dealt with by reducing inefficiency level, just as it would be unbundled through setting up a new pipeline company. \nInvestors, he said, were being sought on a joint venture basis for the new company and that the pipelines would be buried at a certain depth and scanners fixed to them, even as the Army Corps of Engineers had been contracted to secure and repair the existing pipelines as was the case 15 years ago, in collaboration with other security agencies and the communities. \nKachikwu also lamented that the corporation spends 30 per cent of its cost just to maintain security of its infrastructure at a time when pipeline vandalism has become a daily occurrence. Nigeria \nOnly 20 million out of the 52 million active bank accounts have registered for the Bank Verification Number (BVN) … see more » Copyright © 2015 Daily Independent. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-28T16:54:00.000+03:00", "crawled": "2015-09-28T17:37:33.505+03:00", "highlightTitle": ""}