{"organizations": ["Field Newsgathering Operations", "Group Head of Digital", "Warner Bros", "Executive Director for Technology & Operations for Aljazeera Media Network", "BSkyB", "Broadcast Engineering & Operations", "Voice", "MENA", "MCR", "Information Security and Digital Products", "IBC", "Yahoo", "Transmission & Teleport", "MENA Event Jumeirah Beach Hotel", "BBC", "IBC Conference", "LinkedIn Groups", "TwoFour Digital", "New Form", "President of News Corporation", "Aljazeera Media Network", "Digital", "Warner Brothers TV Production UK"], "uuid": "8c9d59023f00d93dbe26df0887e4f9ea4fd515ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/ibc-content-everywhere-announces-highlights-new-speakers-its-november-/45103", "country": "US", "title": "IBC Content Everywhere Announces Highlights and New Speakers for its November MENA Event", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "IBC Content Everywhere Announces Highlights and New Speakers for its November MENA Event", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T08:58:00.000+03:00", "replies_count": 0, "uuid": "8c9d59023f00d93dbe26df0887e4f9ea4fd515ac"}, "author": "", "url": "http://businesswireindia.com/news/news-details/ibc-content-everywhere-announces-highlights-new-speakers-its-november-/45103", "ord_in_thread": 0, "title": "IBC Content Everywhere Announces Highlights and New Speakers for its November MENA Event", "locations": ["Qatar", "UAE", "Hong Kong", "USA", "Malaysia", "Europe", "Australia", "UK", "United Kingdom", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David", "David Butorac", "Mr Abuagla", "James", "James Pringle", "Martin", "JC Cangilla", "Martin Trickey", "Mohamed Abuagla", "Cangilla"], "text": "Friday, September 4, 2015 11:28AM IST (5:58AM GMT) IBC Content Everywhere Announces Highlights and New Speakers for its November MENA Event Jumeirah Beach Hotel 29 - 30 November 2015 London, United Kingdom In line with its commitment to bringing the most influential thought leaders and business minds to the region, IBC is pleased to announce that this year’s IBC Content Everywhere MENA event will embrace and examine those topics at the forefront of IBC2015. Produced and tailored especially for the MENA region, and featuring an international speaker line-up, the conference will employ cutting edge technology to deliver an unparalleled interactive experience. The event features a mixture of presentations and panel sessions with top speakers from broadcast, telecoms, media and content, offering a high-end editorially led programme together with strategic networking opportunities. Particular highlights to capture the interest and imagination will include unique insights into: The Future of OTT and Online Offerings in the Region and Beyond: WithOTT and online TV offerings becoming such a core way for consumers to view media, it is essential that media distributors stay ahead of the game. This panel session will consider the impact of new entrants and consolidation within the region’s OTT market, together with the possible negative effect of content packaging constraints on consumer subscription levels. Further deliberations will involve how to engage and retain new audiences through the use of social media, the influence of traditional broadcast companies on the OTT space and the necessity of OTT collaborations with telcos. Content is King: Strategies to stay ahead in an increasingly competitive content environment: As consumers are increasingly calling the shots, it has never been more important to ensure the right content is delivered, irrespective of the platform. Content is the key asset in every media business, wherever you sit in the value chain and this session will address the issues in developing an effective strategy whether it’s fighting for commissioning rights, creating original content or looking to digital-original content creators. With the increasing popularity of online gaming channels, the panel will also consider whether there are there lessons to be learned from the difference in content and multiplatform delivery. How are Disruptive Tech Start-ups and Media Companies Using Each Other’s Platforms to Create Their Own Success? Buzzfeed is very open about the major role that exploiting social media platforms such as Twitter has played in their success - and this is not an unusual story. With new media players and tech start-ups constantly appearing across the world, this session will look at the ways in which these companies are using social platforms to grow their image, how to create and implement a strategy across multiple platforms and the best methods to engage and attract audiences. Among the influential contributors to these debates are: Martin Trickey, Group Head of Digital, Warner Bros. Television Production (UK): Having started his career in digital at games company Uproar in 1999 where he was responsible for the online versions of Family Fortunes and Catchphrase, Martin moved on to become Head of Multiplatform Production at the BBC and Creative Director at TwoFour Digital. Now Group Head of Digital at Warner Brothers TV Production UK, Martin is currently overseeing The Voice amongst other projects and was named as one of BIMA’s Hot 100 for 2014. JC Cangilla, SVP Business Development, New Form Digital (USA): Cangilla oversees all distribution deals, partnership development and licensing deals for the studio, leveraging New Form’s high-profile production partners and talent to develop customised opportunities across multiple platforms. Having run the video licensing business for Yahoo, securing content deals with more than 75+ partners, his experience in the digital video space has been squarely focused on business development and redefining the way deals are done, establishing himself as one of the leading dealmakers in digital video. David Butorac, CEO, OSN (UAE): David Butorac brings a wealth of experience gained over a 30 year career in some of the world's most successful broadcasting and multi-channel Television companies, including the positions of Head of Operations and Station Manager at BSkyB, Group Chief Operating Officer at Astro, Malaysia's largest broadcasting and cross-media company and President of News Corporation's Star TV in Hong Kong. Included in the inaugural Advance Australia list of the 100 most influential Australian's living outside Australia, David was named Media and Marketing Business Leader of the Year at the 2012 Gulf Business Industry Awards and received the award for Outstanding Achievement in Broadcast at the 2013 Broadcast Pro Middle East Summit. James Pringle, Co-Founder & CEO, SuggesTV (UK): The owner and lead contributor of many forward thinking LinkedIn Groups, James is an entrepreneur with great vision and insight into the media world. With a broad understanding of mobile, video and native advertising, as well as a strong interest in automation, artificial intelligence and future technologies, James founded SuggesTV after realising that every media site he spoke to was trying to increase their video views and that artificial intelligence didn’t just mean robots, drones and driverless cars! SuggesTV uses context, data and machine learning to help publishers maximise the revenue potential of their video library. Mohamed Abuagla, CIO/CTO, Aljazeera Media Network (Qatar): With over 20 years of global technical consultancy and executive management experience, Mohamed Abuagla is the CIO/CTO and Executive Director for Technology & Operations for Aljazeera Media Network. Overseeing Aljazeera’s largest division with responsibilities including IT, Broadcast Engineering & Operations, Information Security and Digital Products development, Mr Abuagla guides the technology & operational strategies and support services for the network globally; covering 10 channels and over 70 locations worldwide. He leads a team of more than 1,200 members that provide a complete end-to-end lifecycle of integrated services across various domains, spanning the gamut from Field Newsgathering Operations, MCR, Ingesting, Editing, Studio Operations, Transmission & Teleport. Get a sneak peek into IBC Content Everywhere at IBC2015, in our two feature area theatres. Daily schedules featuring topics such as OTT business models, big data and strategies to reach the online viewer will complement sessions taking place in the main IBC Conference and Leaders’ Summit, giving a platform for discussion at the November event. Having moved to a permanent slot in November, IBC Content Everywhere MENA looks to build on the acclaimed success of the inaugural event, examining the latest global issues of interest to the region through an innovative programme of influential international and regional speakers. For more information about IBC Content Everywhere MENA please visit www.ibcCE.org/MENA To find out more about the conference at IBC Content Everywhere MENA, please visit www.ibcCE.org/MENAconference To find more about MENA sponsorship www.ibcCE.org/menasponsor For more information about IBC Content Everywhere Europe, please visit www.ibcCE.org/europe For more information about IBC2015 please visit www.ibc.org", "external_links": [], "published": "2015-09-04T08:58:00.000+03:00", "crawled": "2015-09-04T10:57:46.911+03:00", "highlightTitle": ""}