{"organizations": [], "uuid": "c27845904be0e6b6f1df1e1ab43f0d65cf61c3bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/KLG.OjkEbOJ3Kb2q2M0SsQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/china-worker-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/category-asia/?format=rss", "section_title": "Asian Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/china-threat-world-growth-ecb-123900737.html", "country": "US", "title": "China A Threat To World Growth Say ECB And IMF", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "China A Threat To World Growth Say ECB And IMF", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T15:40:00.000+03:00", "replies_count": 0, "uuid": "c27845904be0e6b6f1df1e1ab43f0d65cf61c3bc"}, "author": "", "url": "https://uk.finance.yahoo.com/news/china-threat-world-growth-ecb-123900737.html", "ord_in_thread": 0, "title": "China A Threat To World Growth Say ECB And IMF", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Sep 3, 2015, 13:53 BST - UK Markets close in 2 hrs 37 mins China A Threat To World Growth Say ECB And IMF By (c) Sky News 2015 | Sky News – 5 minutes ago View Photo \n\nThe European Central Bank (ECB) has joined the International Monetary Fund (IMF) in warning of risks to economic growth from the slowdown in China and other emerging markets. \nAfter an IMF report spoke of larger-than-expected repercussions for other countries, the president of the ECB Mario Draghi announced that eurozone GDP expectations had been downgraded. \nChina's woes - and the stock market mayhem that has accompanied a collapse in commodity prices - are also having a knock-on effect for the UK. \nThe latest Markit (NasdaqGS: MRKT - news ) /CIPS Purchasing Managers' Index (PMI) survey, released on Thursday, suggested the powerhouse service sector grew at its weakest pace for more than two years in August. \nIt (Other OTC: ITGL - news ) cited a weakening of new business and wider PMI survey findings pointed to a strong pound continuing to hit export demand. \nThe data culminated in a forecast of GDP growth for the third quarter of 0.5% - down from 0.7% between March and June, Markit said. \nIts report was released as the IMF outlined its latest assessment of global threats ahead of the G20 meeting of finance ministers and central bankers in Turkey. \nThe findings indicated the scale of the challenges still facing world growth at a time when the US central bank is considering its first rise in interest rates since the financial crisis. \nThe headline was the economic slowdown in China, which the IMF declared as having larger-than-expected repercussions in other countries. \nChina's troubles have sent the prices of raw materials such as oil into a freefall, pinching Brazil, Russia and other commodity exporters. \nA devaluation of the yuan last month had a limited impact amid the stock market turmoil of recent weeks, which has been largely blamed on China's struggles and fears of a US Federal Reserve rate increase. \nThe IMF said emerging-market countries should let their currencies fall substantially to support exporters and economic growth. \nIt also called for wider reforms to make their economies more efficient. \nThe UK's economic recovery has been reliant on consumer spending - boosted this year by job growth and weaker prices. \nManufacturing has remained weak because of low demand in key markets including China and the eurozone, the country's biggest trading partner. \nHowever, wider PMI readings, also released on Thursday, suggested that efforts to stoke economic recovery in the single currency area were continuing to bear fruit. \nWhile inflation has remained low, activity hit a four-year high, according to Markit. \nSeparate figures also pointed to growing consumer confidence, with retail sales finding some momentum in July.", "external_links": [], "published": "2015-09-03T15:40:00.000+03:00", "crawled": "2015-09-03T16:00:57.816+03:00", "highlightTitle": ""}