{"organizations": ["Ge Capital", "General Electric Capital", "GE Capital", "US-Based Fleet Operations   Element Closes Acquisition of GE Capital"], "uuid": "eefb9c87cd58fa9fac04f9ec3a68e9c37c613320", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.equipmentfa.com", "main_image": "", "site_section": "http://www.equipmentfa.com/rss/feeds/latestnews.xml", "section_title": "Equipment Finance Advisor", "url": "http://www.equipmentfa.com/news/4649/element-closes-acquisition-of-ge-capitals-us-based-fleet-operations", "country": "US", "title": "Element Closes Acquisition of GE Capital’s US-Based Fleet Operations", "performance_score": 0, "site": "equipmentfa.com", "participants_count": 0, "title_full": "Element Closes Acquisition of GE Capital’s US-Based Fleet Operations", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T14:07:00.000+03:00", "replies_count": 0, "uuid": "eefb9c87cd58fa9fac04f9ec3a68e9c37c613320"}, "author": "", "url": "http://www.equipmentfa.com/news/4649/element-closes-acquisition-of-ge-capitals-us-based-fleet-operations", "ord_in_thread": 0, "title": "Element Closes Acquisition of GE Capital’s US-Based Fleet Operations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steve Hudson"], "text": "  Element Closes Acquisition of GE Capital’s US-Based Fleet Operations September 01, 2015, 07:07 AM Related: Element Financial , Fleet Financing , Ge Capital , General Electric Capital , Steve Hudson \nElement Financial Corporation announced that it has closed the U.S.-based portion of the previously announced acquisition of the remaining North American fleet management operations of General Electric Capital Corporation and expects to close the acquisition of GE Capital’s fleet management operations in Mexico, Australia and New Zealand on September 30, 2015, subject to customary closing conditions. Element previously acquired the Canadian operations of GE Capital’s fleet management business in June of 2013.“The fleet management industry is a primary focus for Element Financial Corporation as a platform for delivering strong cash flows for our business, leading-edge products and services for our customers, challenging career opportunities for our employees and attractive returns for our investors,” noted Bradley Nullmeyer, Element Financial Corporation’s President.“Based on our experience integrating previously acquired fleet management platforms, we are very confident in our ability to meet or exceed our previously announced US$90 million to US$95 million integration savings target and to be in a position to re-engage in the consolidation of this industry by the mid-point of 2016,” said Steven Hudson, Element’s Chief Executive Officer.The U.S. Transaction, together with the planned closing of the acquisition of GE Capital’s fleet operations in Mexico, Australia and New Zealand, provides Element with enhanced scale, scope and market depth in serving the fleet sector in North America and abroad through the Company’s Element-Arval global alliance.The U.S. Transaction constitutes an “Eligible Transaction” under the terms of the outstanding subscription receipts and 4.25% extendible convertible unsecured subordinated debentures issued by Element on May 29, 2015 and the completion of the U.S. Transaction constitutes an “Acquisition Closing” under the terms of such securities. As a result, each subscription receipt will be exchanged for one common share of the Company as soon as practicable following the closing of the U.S. Transaction in accordance with its terms. Element expects that the subscription receipts will be halted for trading prior to the commencement of trading on September 1, 2015 and will be delisted as at the closing of business on September 1, 2015 on the Toronto Stock Exchange (“TSX”) and that the underlying common shares are expected to commence trading on the TSX on or about September 1, 2015. In addition, the maturity date of the debentures has been automatically extended from December 31, 2015 to June 30, 2020 in accordance with the terms of such debentures.Concurrent with the closing of the U.S. Transaction and in accordance with the terms of its August 24, 2015 Credit Agreement, the interest rate charged on the Company’s recently expanded US$8.5 billion senior secured three-year credit facility has been reduced by 20 basis points. Today's Other News", "external_links": [], "published": "2015-09-01T14:07:00.000+03:00", "crawled": "2015-09-02T04:03:27.677+03:00", "highlightTitle": ""}