{"organizations": [], "uuid": "e12474fb0ecc7714c4b4c347cac93ebdff328f57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/2/m/0/v/s/image.related.afrArticleLead.620x365.gjw7ef.png/1443413664272.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/chanticleer/takeover-target-m2-group-had-to-get-big-with-vocus-communications-or-get-swamped-20150928-gjw7ef", "country": "AU", "title": "Telco minnow M2 Group had to get big with Vocus Communications or get swamped", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Telco minnow M2 Group had to get big with Vocus Communications or get swamped | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T10:46:00.000+03:00", "replies_count": 0, "uuid": "e12474fb0ecc7714c4b4c347cac93ebdff328f57"}, "author": "Tony Boyd", "url": "http://www.afr.com/brand/chanticleer/takeover-target-m2-group-had-to-get-big-with-vocus-communications-or-get-swamped-20150928-gjw7ef", "ord_in_thread": 0, "title": "Telco minnow M2 Group had to get big with Vocus Communications or get swamped", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vocus boss James Spenceley. The merged Vocus, M2 business will earn half of revenue from consumers and half from business. Ben Rushton Share on twitter by Tony Boyd The mantra of get big or get swamped is behind the $3 billion merger of Vocus Communications with M2 Group.\nAfter 15 years of growth by acquisition, M2 founder Vaughan Bowen and his fellow board members realised some months ago that the company needed one last dance partner before the music stopped.\nM2 shares were in decline and looked to be headed further south when talks began with Vocus, which is another shining example of the expand by acquisition growth strategy. Vocus has yet to wrap up its recent takeover of Amcom.\nVocus had the infrastructure to kick start a new phase of growth at M2, but in order to get the deal done, it had to cover the recent losses in M2's market value.\nVocus founder James Spenceley was happy to hand M2 shareholders a 25 per cent premium in order to get his hands on 8 per cent of the Australian broadband market.\nHe is creating an integrated telecommunications company that will deliver claimed synergy benefits of $40 million.\nThe merged business will earn about half its revenue from consumers and half from business.\nM2 will no longer have to rely on Telstra's network in order to deliver broadband services. It can shift its customers on to Vocus fibre.\n That is a smart move ahead of the roll out of the government-owned NBN wholesale broadband network.\nThe merger of Vocus with M2 will mark the last big fixed line merger in the Australian telecommunications industry given the recent comments by the Australian Competition and Consumer Commission.\nThere is still the possibility that the merged Vocus and M2 will pick up the privately-owned NextGen fibre network. But that deal is not essential to make the current merger proposal work.\nAnother potential deal that excites bankers is the possible takeover of Vodafone Australia. Its mobile network is a great asset, but without a fixed line business it lacks the strategic presence to match Telstra and Optus.", "external_links": ["https://twitter.com/TonyBoydAFR"], "published": "2015-09-28T10:46:00.000+03:00", "crawled": "2015-09-28T12:05:04.398+03:00", "highlightTitle": ""}