{"organizations": [], "uuid": "f6af4e5b166010c0b57968efa90d37d33c137278", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/16/microsoft-lawsuit-idUSL1N11M1P520150916", "country": "US", "title": "Microsoft discriminated against women in pay, promotions -U.S. lawsuit", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Microsoft discriminated against women in pay, promotions -U.S. lawsuit | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T23:41:00.000+03:00", "replies_count": 0, "uuid": "f6af4e5b166010c0b57968efa90d37d33c137278"}, "author": "Daniel Wiessner", "url": "http://www.reuters.com/article/2015/09/16/microsoft-lawsuit-idUSL1N11M1P520150916", "ord_in_thread": 0, "title": "Microsoft discriminated against women in pay, promotions -U.S. lawsuit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sept 16 Microsoft Corp on Wednesday was hit with a proposed class action lawsuit in U.S. court claiming its policy of ranking employees to determine pay and promotions led to discrimination against women.\nThe lawsuit was filed in federal court in Seattle, Washington by former technician Katherine Moussouris, who claims she was passed over for promotions given to less-qualified men and was told supervisors did not like her \"manner or style.\"\nRedmond, Washington-based Microsoft gives employees numerical rankings based on performance evaluations, according to the lawsuit, and routinely gave female workers lower ratings based on subjective criteria.\n\"Microsoft systematically undervalues the efforts and achievements of its female technical employees,\" said Adam Klein of well-known employment law firm Outten & Golden in New York, one of the firms representing Moussouris.\nThe company did not immediately respond to a request for comment.\nMicrosoft CEO Satya Nadella last year was criticized for suggesting at an industry conference that women in technology jobs should not ask for pay raises and should have faith that their companies will compensate them fairly. He later apologized, but also maintained that the company paid men and women equally.\nWednesday's lawsuit appeared to be the first of its kind filed against Microsoft.\nAccording to the U.S. Bureau of Labor Statistics, men in the tech industry last year earned about 24 percent more than their female colleagues.\nMoussouris, who is seeking to represent a class of any female U.S. technical workers employed by Microsoft since 2009, also claims she received a low bonus in retaliation for reporting sexual harassment. She resigned in 2014 after seven years with the company, the lawsuit says, because supervisors failed to address what she claimed was pervasive discrimination.\nIt was not clear how large the proposed class could be or what damages would be sought, but the lawsuit said they would be in excess of $5 million. Microsoft currently has about 117,000 employees.\nA number of other major tech companies are also facing gender discrimination claims. Lawsuits were filed earlier this year against Facebook and Twitter at the same time that a high-profile trial was wrapping up in a case against top Silicon Valley venture capital firm Kleiner Perkins Caufield & Byers.\nEllen Pao, a former junior partner with the firm, failed to convince a California jury that her bosses discriminated against her by making sexist comments, excluding her from meetings and giving desirable assignments to men.\nThe case is Katherine Moussouris v. Microsoft Corp, U.S. District Court for the Western District of Washington, No. 15-cv-1483. (Reporting by Daniel Wiessner in Albany, New York; Editing by Alexia Garamfalvi and Marguerita Choy)", "external_links": [], "published": "2015-09-16T23:41:00.000+03:00", "crawled": "2015-09-16T23:04:35.662+03:00", "highlightTitle": ""}