{"organizations": [], "uuid": "572b174b3f8acf28ffeb0b20e1f16fb45b3d890a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/Raghuram-Rajan-RBI-EPs.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/banking-finance/small-banks-all-you-need-to-know-about-10-new-players/141674", "country": "IE", "title": "Small banks: All you need to know about 10 new players", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Small banks: All you need to know about 10 new players | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T20:06:00.000+03:00", "replies_count": 0, "uuid": "572b174b3f8acf28ffeb0b20e1f16fb45b3d890a"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/small-banks-all-you-need-to-know-about-10-new-players/141674", "ord_in_thread": 0, "title": "Small banks: All you need to know about 10 new players", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles NPAs: Why RBI's flexibility may not be an optimal solution Arun Jaitley stresses on need for reforms in World Bank Stressed firms: Banks get more leeway to change ownership The banking landscape in the country is set for a big change with the recent ‘in-principle’ approval to ten entities — out of 72 applicants — by the Reserve Bank of India to float small finance banks. RBI Governor Raghuram Rajan is betting on small banks to take basic banking services, including acceptance of deposits and lending, to unserved and underserved sections of the population. Eight out of 10 entities are already operating in the microfinance business, and they are stepping on the gas to kicks tart banking operations in the next 18 months. GEORGE MATHEW & SANDEEP SINGH profile the ten licence winners:\nAu FINANCIERS (INDIA) LIMITED, Rajasthan\nIncorporated in 1996 by Sanjay Agarwal, a chartered accountant and first-generation entrepreneur in Rajasthan, Au Financiers is a non-banking financial company (NBFC) registered with the RBI and is present across 10 states in North India. It’s providing loans for new and used vehicles, refinancing and offering loans to micro and small enterprises and agriculture based SMEs.\nIt was incorporated as LN Finco Gems Private Limited, but later changed its name to Au Financiers in 2005. While it initially raised funds from big investors to offer its financial services in few districts of Rajasthan, it diversified itself by adopting a fee-based model. The company got its first round of private equity (PE) funding of Rs 20 crore in 2006 and then it started originating loans under its own book. It raised in excess of Rs 250 crore from institutions. Its net profit crossed Rs 100 crore in 2013-14.\nUTKARSH MICROFINANCE, Uttar Pradesh\nThe Varanasi-based microfinance institution was formed in 2009 by Govind Singh, a former business head for micro banking at ICICI Bank. Though it has been in the business for only around six years, it has built a customer base of 6 lakh through its 271 branches. Over the last four years its assets under management (AUM) grew at the rate of 120 per cent to Rs 730 crore and the management is targeting an AUM of 4,200 crore by FY19. It operates in underpenetrated areas across eight states located in the northern and western regions of the country and now plans to expand operations in Jharkhand and Chhattisgarh. The company is largely held by foreign institutional investors (FIIs) who hold more than 49 per cent. The investors include Norwegian Microfinance Initiative, CDC and Lok Capital.\nRelated Renault Kwid priced at Rs 2.57 lakh; Does it beat Maruti Suzuki Alto, K10, Hyundai Eon, GO? Find out in 10 slides Mercedes-Benz launches manufactured in India Maybach priced at Rs 1.67 cr: Top 5 points to know ‘Calendar Girls’ box office collections log occupancy rate of 20% Kapil Sharma starrer ‘Kis Kisko Pyaar Karoon’ box office collections set for big boost; occupancy rate at 50% Volkswagen names new CEO after emission scandal, Forbes list of India's riches people, food inflation, gold ETFs, more\nRGVN (NORTH EAST) MICROFINANCE, Asaam\nPromoted by SM Palia, a former executive director at IDBI Bank, in 1990 with an initial corpus contribution from IDBI and IFCI and later from NABARD and Dorabji Tata Trust, RGVN Society was started with an aim to develop and nurture NGOs and community based organisations in Northeast India. It was headquartered in Guwahati. In 1995, RGVN-Society started microfinance activities under the aegis of credit and savings programme with an initial assistance of Rs 1 crore from SIDBI. RGVN (NE) MFL was established in 2008 and registered to carry out microfinance activities in North-East. Currently, the company has a network of 104 branches in 5 Northeastern states — Assam, Arunachal Pradesh, Meghalaya, Nagaland and Sikkim — and covers around 2.2 lakh borrowers. The gross loan portfolio amounts to Rs 229 crore.\nDISHA MICROFIN, Gujarat\nStarted in 2009, Disha offers credit to underbanked households in rural and semi-urban areas in Gujarat, Rajasthan, Madhya Pradesh and Karnataka. The company was founded by Sameer Nanavati, who had earlier started a financial services distribution company in Gujarat. The company is also supported by its equity partner, India Value Fund (IVF) that came on board in October 2010. As of March 2015, it has 71 branches across 39 districts and covers over 8,600 villages. It has a total of 3,35,426 members and around 1.76 lakh borrowers. A distinct feature of the company is that it only offers credit to women borrowers and all its borrowers are women borrowers. It has an AUM of over Rs 200 crore.\nCAPITAL LOCAL AREA BANK, Punjab\nCapital Local Area Bank completed 15 years of operations on January 14, 2015. The firm operated in Jalandhar, Kapurthala and Hoshiarpur in Punjab for its first 13 years. In January 2013, it was granted the RBI permission to expand its area of operation to Ludhiana and Amritsar. The bank currently has a total business of Rs 2,640 crore spread out across its 39 branches. It has more than 3,32,000 accounts and more than 80 per cent of its business is in rural and semi urban areas, with priority sector lending accounting for 65.26 per cent. The bank extends loans mostly to small borrowers as almost 60 per cent of the total advances are of ticket size of up to Rs 25 lakh as on March 31, 2015.\nEQUITAS HOLDINGS, Tamil Nadu\nChennai-based Equitas group was founded by PN Vasudevan in 2007 by setting up Equitas Micro Finance India Private Limited as an NBFC in microfinance activities. EMFPL is currently operating in 124 districts across seven states, primarily concentrated in Tamil Nadu which accounts for 65 per cent of AUM as on March 31, 2015. Vasudevan, MD of Equitas Holdings, has been in the financial services business during his career spanning almost 30 years. Before floating Equitas, he was vice president and consumer banking head in Development Credit Bank. Disbursements in 2014-15 were Rs 2,129.04 crore while the total outstandings were Rs 7,309.29 crore. The company has 22.92 lakh customers. The firm also managed to open 361 branches in 124 districts in seven states and Union Territories.\nESAF MICROFINANCE, Kerala\nESAF Microfinance and Investments is the largest MFI in Kerala with AUM of Rs 1,020 crore as of FY15. The company is targeting a 40 per cent asset growth over next four years to Rs 3,800 crore-4,000 crore by FY19. Established in 1992 by K Paul Thomas in Thrissur, Kerala, Evangelical Social Action Forum society commenced its microfinance operations in 1995. The society then acquired Pinnai Finance and Investments in 2006 and renamed it as ESAF Microfinance and Investments. The society’s microfinance business was then taken over by ESAF later in April 2008.\nESAF predominantly offers loans to women under the joint liability group model of lending. It serves five lakh customers through 175 branches but 68 per cent of its customers and 57 per cent of its branches are based out of Kerala. It is one of the few financial institutions successfully operating in the Naxalite-affected districts of Maharashtra, Chhattisgarh and Jharkhand.\nJANALAKSHMI FINANCIAL, Karnataka\nJanalakshmi Microfinance is India’s largest urban MFI with assets of Rs 3,800 crore, 233 branches and a customer base of 23 lakh. The company’s urban focus, particularly tier I-III cities, is driven by the lower credit and political risk and higher economies of scale in these areas, says a Religare report. The country’s third largest MFI has a presence in 151 cities across 17 states. Promoters acquired an NBFC licence in 2008 and the company got PE funding to escalate assets growth almost every year since FY08 to FY14. The promoter, Ramesh Ramanathan, is a pioneer in urban microfinance with more than 12 years of experience in this field, and also a part of various government committees on urban policy formulation. With his holding stake through Jana Foundation, any returns from the company do not flow back to the promoter but are used for charity.\nSURYODAY MICROFINANCE, Maharashtra\nSuryoday Microfinance operates in the towns and metros in seven states, including Maharashtra and Tamil Nadu which together account for 65 per cent of the portfolio. Its gross loan book is around Rs 689 crore and the management is targeting a loan book of Rs 1,000 crore in FY16. The firm has 6.05 lakh customers through a network of 164 branches as of FY15. Cumulative disbursals amounted to Rs 1,843 crore. It is now targeting a 70 per cent increase in assets in FY16 along with a 200-plus branch network. The firm focuses only on women borrowers from weaker sections. R Baskar Babu, who was associated with Cholamandalam, HDFC Bank and GE Commercial Finance in various leadership positions, is the promoter and CEO of Suryoday. Domestic investors hold 32 per cent in the company.\nUJJIVAN FINANCIAL, Karnataka\nUjjivan Financial Services is the fourth largest MFI in India with AUM of Rs 3,270 crore as of FY15. It is incrementally focusing on individual loans and aims to increase its proportion from 10 per cent now to 40 per cent of AUM by FY19. The management is targeting an AUM of Rs 4,800 crore in FY16, says Religare. The company is spread across 24 states and Union Territories. It began operations in 2005 and serves over 20 lakh clients through a network of 423 branches.\nSamit Ghosh, who is now CEO and MD, founded Ujjivan in 2005 as a microfinance firm for the urban poor. He has worked in various capacities in banks such as Citibank, Standard Chartered, Bank Muscat and HDFC Bank. The company’s net profit increased at a 61 per cent annual growth over FY11-FY15 to Rs 75.8 crore.\n 25, 2015 11:45 pm", "external_links": [], "published": "2015-09-26T20:06:00.000+03:00", "crawled": "2015-09-26T18:25:47.336+03:00", "highlightTitle": ""}