{"organizations": [], "uuid": "70f31081be1aeda1738d533f46c4e2386d409f68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509213072.html", "country": "US", "title": "South Africa: Untangling the Regulatory Yoke for Businesses in South Africa", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Untangling the Regulatory Yoke for Businesses in South Africa", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T18:13:00.000+03:00", "replies_count": 0, "uuid": "70f31081be1aeda1738d533f46c4e2386d409f68"}, "author": "", "url": "http://allafrica.com/stories/201509213072.html", "ord_in_thread": 0, "title": "South Africa: Untangling the Regulatory Yoke for Businesses in South Africa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "analysis By Azwimpheleli Langalanga \nSouth Africa is a country of contradictions. Depending on one's circles and political or moral convictions one always gets something fascinating. If it's not Nkandla, its Ramaphosa flying on a Gupta plane. \nRecently we have watched with sadness the Luister video at Stellenbosch and this week the violent and destructive protests at the University of KwaZulu Natal. However, sometimes in all this 'drama' we overlook some positive happenings in our beautiful country. One such event which called for a more introspective and soul searching exercise was the release recently of the OECD's Economic Survey for South Africa of 2015 bemoaning the sluggish economic growth which is current at 1,9%. \nSouth Africa is not a member of the OECD but for a couple of years now has been included in what the grouping terms its key partners. The Organisation for Economic Co-operation and Development (OECD) is an international economic organisation of 34 countries, founded in 1961 to stimulate economic progress and world trade. The OECD has in the past released quite interesting, informative and compelling reports on South Africa. \nIt is important to emphasize that the relationship between South Africa and the OECD differs from that with the Bretton Woods institutions, for instance, in that, the former's reports are mere recommendations and tend to be couched in a language that suggests a parity of relations. \nThis is very important in that the OECD reports from a political economic perspective have more currency and legitimacy within the South African policy making circles in government. In addition, the OECD has a lot of resources to conduct its research and the reports tend to be quite detailed. \nIn its current report, the OECD bemoaned the sluggish economic growth which is current at 1,9%, which is lower than the projected growth of 3%. It is much lower than the ideal growth rate of 7%, which is needed in order to grow the economy and be able to alleviate the triple challenges of poverty, unemployment and inequality. What is fascinating however, is what the OECD suggests needs to happen in order to reach the 7% economic growth and lead to an inclusive society that everyone aspires to. \nThe OECD asserts that for South Africa to attain the much needed economic growth of 7%, the country has to attract foreign direct investment. This might sound too obvious to be mentioned by the OECD. \nHowever, the OECD report does not end there. The OECD further laments South Africa's very restrictive FDI regulatory environment. Reference is made to the regulatory burden obtaining in South Africa's economic environment. This regulatory burden relates to a raft of instruments in areas such as investment, property rights, competition policy, beneficiation, immigration and black economic empowerment. \nSouth Africa has witnessed an increase in state intervention in key sectors of the economy involving foreign investment to an extent that it has a bearing on the country's FDI attractiveness and competitiveness. \nIn the mining sector the Minerals and Petroleum Resources Development Act has sought to introduce state intervention in the petroleum and gas sectors, in the form of an incremental acquisition of 20%. The contentious Bill has been in various processes of parliament for a long time now. \nIn addition, the government has promulgated an Expropriation Bill, which seeks to expand the meaning of expropriation with less state liability for compensation. This contentious Bill is meant to pave way for more state intervention in redistribution of property. Within the competition policy framework, the OECD cites the Walmart/Massmart Merger as an example of where competition law has proven to be a burden to foreign investors. \nSouth Africa is commended for having a competition policy, which is of OECD standard. However, South Africa's competition policy is anchored on a public interest clause. This public interest clause mandated competition authorities when screening foreign investments, which are of a merger kind, to consider how the venture will contribute to employment or other industrial policy goals. As a matter of principle, this is noble, however, the competition authorities sometimes overstretch and make onerous demands on foreign investors. This was the case in the Walmart/Massmart merger. \nThe public interest clause in South Africa's competition policy includes black economic empowerment. Having such an expansive public interest clause in South Africa's competition law undermines the openness that this kind of regulation seeks to advance. In other terms, the public interest clause is antithetic to the competition spirit and purport. \nSouth Africa's investment climate is further compounded by the beneficiation policy that is being read into different spheres of the economy. Beneficiation is understood to be part of the broader industrial policy going forward. The government rightly understands that beneficiation will lead to more job creation and value addition. \nHowever, the question remains of whether encumbering foreign investors is the best way to achieve value addition. \nThe OECD also identifies the regulatory burden that is faced by SMEs. These SMEs are both foreign and local. It is important for government to reduce the red tape in the SME sector. Government is however to be commended for shelving the Licensing of Businesses Bill of 2013 which would have added an even more burdensome regime in the SME sector. It is still not clear what the newly formed SME Ministry's mandate entails and what its achievements have been thus far. One hopes that the Ministry engages robustly with the OECD report with regards to SMEs and the challenges they currently encounter. Economic history has taught us that sustainable economies are built on SMEs. \nAnother area affecting FDI identified by the OECD report is the issue of shortage of critical skills. This is naturally linked to a poor education system that is also disconnected from the economic needs. \nDirectly related to the skills shortage which foreign investors face is the immigration regulatory regime that makes difficult to source foreign skills. South Africa has recently been tightening its immigration policy. While open borders cannot be condoned, South Africa could take a cue from a country like Japan that linked its immigration regime to economic needs. These countries ensured that they attracted the right kind of skills from abroad and coupled this with a stringent skills transfer regime. This meant that by after a certain period of time, Japan had a skilled population and simply stopped renewing contracts and visas of its skilled immigrants. \nBlack Economic Empowerment policy in all its manifestations is listed as one of the regulatory burdens faced by foreign investors. The OECD agrees that the BEE policy is a much-needed regulatory instrument. \nHowever, its implementation proves quite onerous to foreign investors especially coupled with a stringent labour law regime. Government recently announced new changes to the BEE policy and scorecards. Already investors are complaining that the new regulations are complex and will be difficult to implement let alone report. \nThe OECD report mentions all other issues, which adversely impact on the investment climate in South Africa, but conspicuously leaves out the elephant in the room. This is the Promotion and Protection of Investment Bill, which has just been approved by Cabinet and awaits the President's signature. The current version of the Bill is much more improved from its earlier version. It has a screening mechanism based on the 'likeness' test. This test will obviously assist in accommodating the black economic empowerment policy. South Africa will therefore be able to continue offering preferential treatment to its investors based on BEE requirements. What is disturbing about the PPIB is its exclusion of investor state dispute settlement. Maybe even more discomforting is the replacement of ISDS with state-to-state dispute settlement, something akin to nineteenth century diplomatic protection. \nThe OECD report does not make mention of the Private Security Industry Regulatory Act amendment bill. This could be because the developments in this instrument are so recent to have been captured in the OECD research. This is another piece of instrument that reflects a narrowing of proprietary and investment rights. \nIt is interesting to note that the South African OECD economic report could be accentuated to Namibia, Botswana and the general SADC region and fit squarely especially with regards to the FDI regulatory policies. \nThis means that if the whole region is to be investor friendly, South Africa has to take the lead as it holds a lot of sway in the region. The inclusion of state-to-state dispute settlement now makes it clear that South Africa was instrumental in the disbandment of the SADC Tribunal and reconstituting it to only include state-to-state dispute settlement. \nOne potentially positive development coming from South Africa's FDI regulation, which the OECD did not capture maybe because it's at an inception phase is the planned establishment of a one stop shop for investments. This has been a long overdue development in South Africa. \nInvestors would really appreciate having to be attended in one place and get all the information and paperwork dealt with in such a place. It is hoped that the one stop shop will be for foreign investors and that it will not be used to solve problems of already established investors. \nThis would clog the one stop shop rendering it ineffective. Furthermore, the envisaged one stop shop would do best if not placed within a government department. \nThe OECD report does not tell us anything new. Every policy maker in South Africa is familiar with the challenges that the OECD report draws attention to with regard to South Africa's investment climate. It is hoped however, that the report will give us an opportunity to reflect on these challenges and most importantly act upon them. At least there is a framework domestically, within which South Africa can improve its investment climate and that is through the National Development Plan. \nAzwimpheleli Langalanga is a research associate at the South African Institute of International Affairs (SAIIA). South Africa \nZimbabwean government property in Kenilworth, Cape Town, is expected to go under the hammer on Monday to recoup unpaid … see more » Copyright © 2015 South African Institute of International Affairs. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-21T18:13:00.000+03:00", "crawled": "2015-09-22T00:03:45.469+03:00", "highlightTitle": ""}