{"organizations": [], "uuid": "a60dfcd90b6410dec6200fb04e12a32985c50d4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/lifestyle/health/sleepyheads-those-siestas-may-up-your-diabetes-risk/137594", "country": "IE", "title": "Sleepyheads! Those siestas may up your diabetes risk", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Sleepyheads! Those siestas may up your diabetes risk | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T17:09:00.000+03:00", "replies_count": 0, "uuid": "a60dfcd90b6410dec6200fb04e12a32985c50d4c"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/health/sleepyheads-those-siestas-may-up-your-diabetes-risk/137594", "ord_in_thread": 0, "title": "Sleepyheads! Those siestas may up your diabetes risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Human sperm grown in lab 'Cartography' of dengue virus rewritten Tai Chi can help older people with chronic ailments Siesta lovers, excessive daytime sleepiness and long naps have been linked to increased risk of type 2 diabetes in a new study.\nIn the study, the authors did a meta-analysis to investigate the association between daytime sleepiness or napping and the risk of type 2 diabetes. They searched Medline, the Cochrane Library, and Web of Science for articles published up to November 2014 using the keywords daytime sleepiness, nap, and diabetes.\nExcessive daytime sleepiness was found to increase the risk of diabetes by 56 percent, while a longer daytime nap of 60 minutes or more increased the risk by 46percent.\nIn contrast, a shorter nap (60 mins or less per day) did not increase the risk of diabetes. The analysis showed there was no effect of napping up to about 40 minutes per day, after which risk began to increase sharply.\nThe authors concluded that daytime napping might be a consequence of night-time sleep disturbance such as obstructive sleep aponea (OSA). Epidemiological studies have shown that obstructive sleep apnoea is independently linked to blockages (ischaemia) of heart arteries, stroke, fatal and non-fatal cardiovascular events, and all-cause mortality.\nThey further explained entering deep slow-wave sleep and then failing to complete the normal sleep cycle can result in a phenomenon known as sleep inertia, in which a person feels groggy, disoriented, and even sleepier than before napping. Although the mechanisms by which a short nap might decrease the risk of diabetes are still unclear, such duration-dependent differences in the effects of sleep might partly explain the findings.\nThe study was presented at the annual meeting of the European Association for the Study of Diabetes (EASD).\nFirst Published on September 18, 2015 9:09 am", "external_links": [], "published": "2015-09-18T17:09:00.000+03:00", "crawled": "2015-09-19T02:55:52.733+03:00", "highlightTitle": ""}