{"organizations": [], "uuid": "94cbd02ff867c2759f38ea6300e7d7e35b09a7ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/aust-risks-being-step-tax-063708503.html", "country": "GB", "title": "Aust risks being out of step on tax cheats", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Aust risks being out of step on tax cheats", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T09:37:00.000+03:00", "replies_count": 0, "uuid": "94cbd02ff867c2759f38ea6300e7d7e35b09a7ae"}, "author": "", "url": "https://au.finance.yahoo.com/news/aust-risks-being-step-tax-063708503.html", "ord_in_thread": 0, "title": "Aust risks being out of step on tax cheats", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wed, Sep 16, 2015, 5:23 PM AEST - Australia Markets closed Aust risks being out of step on tax cheats AAP – 46 minutes ago Print \nAustralia's new draft laws to target tax avoidance by big international companies risk being out of step with a broader action plan by developed countries, a tax expert warns. \nTreasurer Joe Hockey on Wednesday introduced to parliament legislation aimed at multinationals, which could help the Australian Tax Office reap hundreds of millions of dollars in additional revenue. \nBut the move could run counter to a broader action plan under the OECD/G20 base erosion and profit shifting project, the findings for which are to be presented in October. \n\"Australia is running ahead of the pack but there is a risk some of the measures could be out of line with the broader agreement,\" Deloitte's tax insights and policy partner David Watkins told AAP. \n\"Australia should have waited until next month.\" \nHe said a lack of cohesion in international legislation could mean companies are exposed to double taxation. \nMr Hockey said he had been working with the UK government and the OECD to bring in the new laws from January 1, 2016. \nCompanies caught cheating face having to pay back double what they owe, plus interest. \nThe draft legislation will implement a new multinational anti-avoidance law, stronger penalties for large companies that engage in tax avoidance and profit-shifting, and country-by-country reporting to give authorities a greater visibility into international structures. \nThe measures, flagged in the May budget, will apply to more than 1,000 large multinationals operating in Australia with annual global revenue of $1 billion or more. \n\"It is patently unfair for a large multinational with sophisticated structures, not to pay its fair share of tax,\" Mr Hockey said. \nWhile Australia's tax laws are among the toughest in the world, some multinationals have avoided paying tax on profits made here. \nThe ATO says while targeted companies make billions of dollars in sales in Australia, it does not have a lot of information on their cost structure and what actual profit they make. \nWhile there was no guarantee on how much tax revenue will be raised, the new laws could encourage multinational companies to rework tax structures, Mr Watkins said. \n\"The likely outcome could be that companies change the way they sell goods and services to Australian customers, bringing them into a more normal taxation structure.\" \nCMC Markets chief market strategist Michael McCarthy said he was sceptical that more tax revenue can be raised by just one country passing laws. \n\"For this to work, other countries need to co-operate,\" he said. @y7finance on Twitter, become a fan on Facebook Hockey puts multinationals on notice AAP \nJoe Hockey has put multinationals trying to avoid their fair share of tax in Australia on notice. In what could …", "external_links": [], "published": "2015-09-16T09:37:00.000+03:00", "crawled": "2015-09-16T10:24:47.478+03:00", "highlightTitle": ""}