{"organizations": [], "uuid": "24c7020fb0ea2de35b044dc33ecb4224f2849f0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-09-02/five-questions-for-mario-draghi-from-china-s-slowdown-to-more-qe", "country": "US", "title": "Five Questions for Mario Draghi From China's Slowdown to More QE", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Five Questions for Mario Draghi From China's Slowdown to More QE - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T07:01:00.000+03:00", "replies_count": 0, "uuid": "24c7020fb0ea2de35b044dc33ecb4224f2849f0c"}, "author": "Jana Randow", "url": "http://www.bloomberg.com/news/articles/2015-09-02/five-questions-for-mario-draghi-from-china-s-slowdown-to-more-qe", "ord_in_thread": 0, "title": "Five Questions for Mario Draghi From China's Slowdown to More QE", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here are five things to watch for from Mario Draghi on Thursday. The European Central Bank president holds a press conference at 2:30 p.m. in Frankfurt, 45 minutes after the Governing Council’s announcement on interest rates.\nHow much does China’s economic slowdown threaten the euro-area recovery?\nIt’s true that a China-led weakness in emerging markets risks undermining trade, an important pillar of the euro zone’s economy. Exports to China have doubled since 2008 and the country was the third-biggest market for euro-area goods and services last year, after the U.K. and the U.S. Still, recent data should give the Governing Council reason to believe its stimulus is finally reaching companies and households. Economic sentiment rose in August to the highest level since 2011 and unemployment unexpectedly declined in July to the lowest rate in more than three years. Bank lending has risen since March -- the month the ECB embarked on its 1.1 trillion euro ($1.2 trillion) bond-purchase program -- and a gauge of manufacturing and services activity is near the strongest in about four years.\nHow closely is the ECB watching financial-market volatility?\nPolicy makers have kept a close eye on market indicators such as exchange rates, commodities and equity prices because big swings can have a material impact on growth and inflation. The trade-weighted euro has gained more than 2 percent since June, stock markets have tumbled and oil prices touched lows last seen in 2009. The question of whether an increase in U.S. interest rates -- once the Federal Reserve starts to do so -- will spill over to Europe and cause an unwarranted tightening of conditions is adding to concern. While Draghi may have some dovish words on Thursday, he might want to monitor the situation a while longer before deciding whether there’s any need to act.\nWhy isn’t inflation picking up?\nWhen the ECB started quantitative easing in March, consumer prices fell 0.1 percent from a year earlier, their fourth straight month of declines, and inflation has barely improved since then to a mere 0.2 percent in August. Much of the stickiness can be pinned on plunging commodity prices. Core inflation has risen to 1 percent, the highest level in more than a year. That may comfort policy makers projecting price growth will pick up as stimulus feeds through. Still, the ECB’s goal of just-under 2 percent for headline inflation hasn’t been achieved since early 2013, and academics at the Fed’s Jackson Hole symposium argued that monetary policy has a key weakness -- wide gaps in knowledge about how inflation works.\nWill the ECB revise its economic forecasts and will that trigger more action?\nIn light of the latest price developments, lower inflation predictions seem inevitable. Nick Matthews, senior European economist at Nomura International Plc in London, says the ECB will cut its inflation outlook for 2015 to 0.1 percent from 0.3 percent, and to 1.4 percent for 2016 from 1.5 percent, keeping its 2017 forecast unchanged at 1.8 percent. While ECB Vice President Vitor Constancio has promised more stimulus in case of any “ material change” to the outlook, new forecasts showing price acceleration will be delayed rather than stymied may not be enough. Draghi’s hand could yet be forced by further bad news from China, a renewed euro strengthening, or a slide in inflation expectations. For now though, he’ll more likely stick to the script, saying bond purchases may be expanded or extended beyond September 2016 if needed.\nWill the ECB reinstate the waiver on Greece’s credit rating?\nEuro-area finance ministers signed off on a bailout program for Greece of as much as 86 billion euros last month, ending a dispute over aid terms that led the ECB to cut Greek banks off from its regular refinancing operations. The Governing Council may now consider restoring those funding lines by reinstating a waiver that allows it to accept lower-quality Greek debt as collateral. Doing so would free banks to move off more expensive emergency funding, in theory qualify Greek government bonds for the ECB’s quantitative-easing program, and reinforce the signal that Greece’s crisis and the threat it posed to euro-area solidarity have passed.", "external_links": ["http://ec.europa.eu/eurostat/tgm/refreshTableAction.do?tab=table&plugin=1&pcode=tet00069&language=en\\"], "published": "2015-09-03T07:01:00.000+03:00", "crawled": "2015-09-03T08:06:39.963+03:00", "highlightTitle": ""}