{"organizations": [], "uuid": "3c8c5138c7d3961ef12a311e192ea616b8a3d793", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=KMB", "section_title": "Yahoo! Finance: KMB News", "url": "http://finance.yahoo.com/news/p-g-baby-care-business-060601905.html", "country": "US", "title": "P&G’s Baby Care Business Sees Robust Growth - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "P&G’s Baby Care Business Sees Robust Growth - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "3c8c5138c7d3961ef12a311e192ea616b8a3d793"}, "author": "Penny Morgan", "url": "http://finance.yahoo.com/news/p-g-baby-care-business-060601905.html", "ord_in_thread": 0, "title": "P&G’s Baby Care Business Sees Robust Growth - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A Procter & Gamble Investor Update: Growth and Transformational Objectives \n( Continued from Prior Part )\nBaby care overview Previously in this series, we observed that The Procter & Gamble Company’s (PG) four large business categories include:\nbaby care fabric care hair care grooming \nThese businesses represent about 60% of P&G’s EV (enterprise value) and profits. Its baby care segment delivered strong results in 4Q15. The revenue for this segment came in at $4.8 billion. Organic sales increased by 3% for fiscal 2015.\nRecent innovations The recent Pampers with Extra Absorbing Channels helped P&G increase its share of distribution and display at large retail (XRT) stores like Wal-Mart (WMT). In total, P&G increased distribution to over 100,000 points compared to 2014. Also, the recent launch of Pampers Pants in Russia, China, India, and Japan increased distribution and share gains in the pant’s category.\nP&G holds a 44% value share in the Pampers diapers category, seven percentage points more than Huggies (KMB), according to recent comments by P&G’s CFO, Jon Moeller.\nFocus on e-commerce Changing consumer habits have increased competition for P&G around the world. Similar to P&G, other companies like Clorox (CLX) and Unilever (UL) focus on innovation and new technology to improve consumer value. For example, diapers have approached 30% growth annually in the e-commerce channel. According to Moeller, Pampers’ online share is greater than its offline share in eight out of 10 of its top markets.\nExpansion through multiple media P&G is planning to launch Pampers with Extra Absorbing Channels in over 60 countries by next year. The company plans to communicate this new innovation across multiple media channels. The company is also planning to strengthen its Pamper Pants, as the pants market represents up to $2 billion sales growth opportunity.\nP&G plans more innovations in Pampers Premium Pants and Super Premium Pants across multiple tiers and plans to strengthen sales execution with e-commerce.\nP&G has exposure in the iShares S&P 500 Growth ETF (IVW), with ~1% of the total weight of the portfolio as of on September 12, 2015.\nIn the next part of this series, we’ll look at P&G’s strong fabric care business.\nContinue to Next Part \nBrowse this series on Market Realist: \nPart 1 - P&G Updates Investors on Growth and Transformational Objectives Part 2 - P&G Readies Its Divestiture of Beauty Brands to Coty Part 3 - P&G Attempts to Control FX Headwinds Geographically Consumer Discretionary", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T19:49:55.338+03:00", "highlightTitle": ""}