{"organizations": [], "uuid": "f6bd2aa08a9927865e025fd4a16c7db36c4eea37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/n/9/a/8/image.related.afrArticleLead.620x365.gjumkt.png/1443148409986.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/unlocking-super-for-first-home-buyers-will-inflate-housing-price-treasury-20150924-gjumkt", "country": "AU", "title": "Unlocking super for first home buyers will inflate housing price: Treasury", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Unlocking super for first home buyers will inflate housing price: Treasury | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T08:56:00.000+03:00", "replies_count": 0, "uuid": "f6bd2aa08a9927865e025fd4a16c7db36c4eea37"}, "author": "Misa Han", "url": "http://www.afr.com/news/policy/unlocking-super-for-first-home-buyers-will-inflate-housing-price-treasury-20150924-gjumkt", "ord_in_thread": 0, "title": "Unlocking super for first home buyers will inflate housing price: Treasury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Letting young people use their super for house deposits could put pressure on housing prices unless supply was increased at the same time. Chris Hopkins Share on twitter by Misa Han A senior Treasury official has confirmed the Turnbull government is looking at the tax breaks on capital gains and superannuation.\nPaul Tilley, head of the personal and retirement income division, told a parliamentary inquiry into home ownership on Friday that Treasury had spent a lot of time looking at capital gains tax exemptions on investment properties.\n\"The new prime minister and new treasurer have indicated they're areas, together with superannuation, that we'll look at,\" Mr Tilley said.\nThe AFR Tax Reform Summit heard generous super concessions are Australia's greatest tax lurk, while negative gearing should be limited to new properties and the capital gains tax discount trimmed to 25 per cent.\nPeople who own investment properties only pay tax on half the capital gain when they sell and can claim tax deductions for interest and other expenses at full personal tax rates against their other income.\nMr Tilley said that while negative gearing did not cause a tax distortion the department had spent a lot of time looking at the capital gains exemptions, and continued to do so, he said.\nUnlocking super will inflate prices Mr Tilley told the inquiry that letting young people use their super for house deposits could put pressure on housing prices unless supply was increased at the same time.\n\"The issue is that by effectively adding to their demand, their ability to demand and pay for the housing, they've got extra $30,000, $40,000 that will put them in a better position to bid for that house but inevitably that puts upward pressure on housing price generally.\n \"This was the debate with first home buyers' grant. Are you helping those individuals and what's the impact on the overall housing market?\"\n\"If you have supply constraints of sorts then obviously the more you do to increase demand, to help people to pay more for their house, that must put upward pressure on house prices,\" Mr Tilley said.\nThere were a number of restraints on the supply of housing including issues with rezoning, urban infill and approval process of development applications, Mr Tilley said.\n\"There are the considerations of what would be the impact on the overall housing market of enabling some individuals to be in a better positions to bid higher for the house they're trying to buy.\"\nThe senate economics committee is investigating how to make housing more affordable amid growing concerns over rising prices in Sydney and Melbourne.\nA Fairfax-Ipsos poll in June found 80 per cent of Sydney voters believed housing was unaffordable for first home buyers .\nUnder the current legislation young people are not allowed to access their super funds to put down deposit on a house.\nIn March, former Treasurer Joe Hockey pressed for a debate over whether superannuation should be used for a first-home deposit but the idea was condemned by business community, the government's own financial system experts and two former treasurers, Paul Keating and Peter Costello.\nMalcolm Turnbull, who was then communications minister, said at the time slammed Mr Hockey's proposal as a \"thoroughly bad idea\" and maintained housing affordability is a supply-side problem .\n20 per cent negative gearing for owner occupiers Liberal MP and chair of the economics committee John Alexander said the government should consider allowing a 20 per cent deduction for mortgage payment on owner occupied homes to make home ownership more lucrative.\n\"The cost of buying would be less than the cost of renting and therefore you move people into ownership. It's about giving a portion of negative gearing benefits that investors have to move more properties into the hands of home owners,\" Mr Alexander told The Australian Financial Review.\nHowever, the Treasury said such plan would introduce further distortion to the tax system.\n\"The tax system is already distorting tax in favour of owner-occupier home. Our thinking would be let people decide, do I want to own my own home, do I want to rent, leaving them to make their own decisons.\"\nSupply critical Treasurer Scott Morrison said unblocking the supply of housing, particularly in NSW, was critical to helping people buy their own home.\n\"Supply issues and working with the states is always critical to ensure we don't get the pent-up pressures in the system,\" he told reporters in Gosford, NSW, on Friday.\n\"We want to see more of it because if we have the pent-up supply issues and not being able to respond then, as night follows day, prices go up, so we have to address those supply issues, and be have to work together to do it and I think that's one of the concrete and constructive things we can do.\"\nMr Morrison also said that improving regulation was critical.\n\"We do need to do all we can in the area of competition policy and regulatory reform which is a key responsibility of mine and in the area of competition policy to ensure we have a competitive regulatory system when it comes to housing development across the country not just across NSW.\"\nWith AAP", "external_links": ["https://twitter.com/misahan"], "published": "2015-09-25T08:56:00.000+03:00", "crawled": "2015-09-25T05:38:02.089+03:00", "highlightTitle": ""}