{"organizations": [], "uuid": "b6b03da2db273f8631da5690ce25f86a5b0666e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/JMLyngdoh1.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/keep-political-parties-out-of-cus-politics-lyngdoh/43329.html", "country": "IN", "title": "Keep political parties out of campus politics: Lyngdoh", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Keep political parties out of campus politics: Lyngdoh", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T13:57:00.000+03:00", "replies_count": 0, "uuid": "b6b03da2db273f8631da5690ce25f86a5b0666e3"}, "author": "Mohammed Shafeeq (IANS)", "url": "http://www.moneylife.in/article/keep-political-parties-out-of-cus-politics-lyngdoh/43329.html", "ord_in_thread": 0, "title": "Keep political parties out of campus politics: Lyngdoh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Life » Public Interest » Keep political parties out of campus politics: Lyngdoh 43329 Keep political parties out of campus politics: Lyngdoh 0 Comments, Be the first to comment Mohammed Shafeeq (IANS) | 09/09/2015 04:27 PM | Lyngdoh said that no one had approached court for ensuring indirect elections to student bodies since all political parties wanted direct elections Political parties should be kept out of campus politics and not holding indirect elections to the Delhi University Students Union (DUSU) itself amounts to contempt of court, former chief election commissioner J.M. Lyngdoh has said. \"Whatever the size of university - big or small - no political party should be allowed. They should be kept out of campus altogether,\" Lyngdoh told IANS in an interview, even as various recommendations of a committee he had headed, including a ban on printed poster, are being openly flouted in the ongoing campaign for the DUSU elections. He also said that no one had approached court for ensuring indirect elections to student bodies since all political parties wanted direct elections. The former CEC also said that elections in DU involved big money. \"DU elections are similar to those for MPs. The amount of money spent in DU elections is comparable to the expenses on a parliamentary election,\" Lyngdoh said. Lyngdoh headed a committee that examined student union elections, following which the Supreme Court had passed orders while accepting the panel report in 2006. He said the panel led by him had recommended indirect elections since Delhi University was too big. \"Delhi University is too big. It encompasses semi-rural areas that people don't even know about.\" Lyngdoh said that the intention of the Supreme Court was to control student body elections and make them disciplined. \"Elections don't mean chaos; but most of these (student body) elections are chaos,\" he said in an obvious reference to the blatant misuse of money and muscle power. Lyngdoh alleged that the then vice chancellor of Delhi University in 2006 was also obviously not sincere on the issue. The DUSU elections are scheduled for September 11. Student outfits of the Bharatiya Janata Party, the Congress and the Aam Aadmi Party (AAP) are battling for supremacy on the campus. The human resource development ministry in December 2005 constituted the Lyngdoh committee to examine and recommend on certain aspects of the student body and student union elections in Indian universities, colleges and other institutions of higher learning. The committee, which submitted its report on May 26, 2006, recommended indirect elections for big universities like in Delhi. \"Initially, it was proposed to be indirect elections. Gradually, the whole thing should be promoted to open elections depending on the behaviour of students and conduct of elections,\" Lyngdoh said. He pointed out that Jawaharlal Nehru University (JNU), where open elections are not allowed, also produced many politicians. \"Of course, JNU is much smaller university and the student strength is small compared to the DU.\" Lyngdoh said while DU was at one extreme, there were universities like the Mumbai University where student elections were banned. He said he believed that elections on campuses of educational institutions were essential, otherwise managements of such institutions would resort to arbitrary action against students' interests. Lyngodh recalled that the panel looked into the situation in other universities as well. He said that the Lucknow University was one of the worst they came across. \"Evidence which came before us was astonishing. Before the student body elections, certain unions in Lucknow University go to town and ask people to contribute for elections. After winning the elections, they insist on new cars for the elected representatives of students. They compel works department of the university to shell out money and demand percentage of all contracts, both in the university and outside,\" he said. More in Moneylife", "external_links": [], "published": "2015-09-09T13:57:00.000+03:00", "crawled": "2015-09-09T19:24:17.104+03:00", "highlightTitle": ""}