{"organizations": [], "uuid": "34798b8c2d8337ef7a87a33041a0f3016bb45bdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/turbulent-time-swiss-watchmakers-010106494.html", "country": "GB", "title": "Turbulent time for Swiss watchmakers", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Turbulent time for Swiss watchmakers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T04:01:00.000+03:00", "replies_count": 0, "uuid": "34798b8c2d8337ef7a87a33041a0f3016bb45bdc"}, "author": "", "url": "https://au.finance.yahoo.com/news/turbulent-time-swiss-watchmakers-010106494.html", "ord_in_thread": 0, "title": "Turbulent time for Swiss watchmakers", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mon, Sep 14, 2015, 11:21 AM AEST - Australia Markets close in 4 hrs 39 mins Turbulent time for Swiss watchmakers AAP – 20 minutes ago Print \nSwiss watchmakers are facing turbulent times in one of their top markets, as the already shrinking luxury sales in China are compounded by the recent devaluation of the yuan. \nGlobal financial markets are still reeling from the Chinese central bank's sudden devaluation of the yuan in August, which allowed the currency to plunge nearly five per cent against the US dollar in a matter of days. \nIn Switzerland, the move rattled the Alpine country's luxury watchmakers, who have already seen their once booming sales in China take a hit as Beijing began to crack down on corruption in the country by banning extravagant gifts like prestigious watches to public officials. \nEven before the yuan move, Swiss watch exports to China had contracted nearly 40 per cent in July. \nWhen the yuan devaluation was announced on August 11, investors were clearly bracing for the worst, recalling the impact on watch sales when Switzerland's central bank in January let the Swiss franc float and sent it soaring. \nShares of Swiss luxury goods giant Richemont, which owns brands like Cartier, Piaget and IWC, immediately shed more than 4.0 per cent of their value after the Chinese currency cut. \nThe world's biggest watch group Swatch, which carries brands like Tissot, Longines and Omega, saw its stock price plunge 3.9 per cent. \nBut so far there is no indication the yuan devaluation will cause the same level of havoc for the watch industry as the move by the Swiss central bank did earlier this year, industry insiders say. \nWhen it suddenly stopped artificially holding down the value of the Swiss franc, allowing the currency to soar 20 per cent against the euro in a matter of hours, the impact on watch sales was felt immediately, Jean-Claude Biver, luxury giant LVMH's watch guru, told AFP. \n\"But today, we are not feeling the same effects from China's devaluation,\" he said, explaining that the Swiss watch industry would be able to absorb any rising costs linked to the Chinese central bank's move. \nAnd both analysts and the watchmakers themselves have warned against over-reacting, insisting the yuan devaluation will not have a big impact on sales and could even improve them. \nSwatch, for instance, said it viewed the move as \"positive\" since it would likely stimulate consumption, and insisted there were no plans to raise the brand's prices in China. \nWhile the yuan devaluation makes it more expensive to import luxury goods into China, it also pushes down costs onsite. \nFor a company like Swatch, which employs around 2,600 people in China, mainly in its marketing, sales and client services divisions, that could mean big savings. \nStill, the impact of China's devaluation is difficult to quantify, analysts say. \n\"If the devaluation of the yuan is limited and takes place on a controlled basis, it would be a positive for the Swiss watch industry,\" Kepler Cheuvreux analyst Jon Cox told AFP in an email. \n\"It narrows the differential between Europe and China prices, meaning more watches would be bought in China and there would be less of a grey market,\" he added. \nStark currency differences since the Swiss franc took flight in January had pushed Chinese consumers to purchase more of the luxury watches they covet when travelling abroad. \nBut they have also boosted a \"grey market\", where watches are bought in one market and quickly sold in another at more advantageous rates. \nIn response, some brands had opted to lower their prices in China before the yuan devaluation in a bid to rein in such parallel markets. \nThis can prove painful now, since they do not want to be seen raising their prices again so soon to compensate for the dwindling value of the yuan, said Luca Solca, an analyst with Exane BNP Paribas. \nTo protect their reputations, these watchmakers will opt to stick to low yuan prices, allowing their high Swiss franc costs to eat into profits, and they \"will suffer,\" he told AFP in an email, suggesting though that those who had not already lowered their prices would fare better. \nIn a note, he also maintained that the yuan devaluation would only have a moderate impact on the bottom line of luxury goods makers. \nIt would take a devaluation of 20 per cent or more to shrink profits in the sector by five to 10 per cent, he said. @y7finance on Twitter, become a fan on Facebook Broadband network's $3 million man AAP \nThe man overseeing the national broadband network was paid more than $3 million last financial year. Bill Morrow …", "external_links": [], "published": "2015-09-14T04:01:00.000+03:00", "crawled": "2015-09-14T04:21:49.622+03:00", "highlightTitle": ""}