{"organizations": [], "uuid": "36eade8a55a03df82e86bdbcb7f147900fb3f54d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/29/usa-keystone-canada-idUSL1N11Z01E20150929", "country": "US", "title": "Canada will aggressively push merits of Keystone pipeline -PM", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Canada will aggressively push merits of Keystone pipeline -PM | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T05:41:00.000+03:00", "replies_count": 0, "uuid": "36eade8a55a03df82e86bdbcb7f147900fb3f54d"}, "author": "David Ljunggren", "url": "http://www.reuters.com/article/2015/09/29/usa-keystone-canada-idUSL1N11Z01E20150929", "ord_in_thread": 0, "title": "Canada will aggressively push merits of Keystone pipeline -PM", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA, Sept 28 Canadian Prime Minister Stephen Harper said on Monday he would keep aggressively pushing the merits of TransCanada Corp's Keystone XL pipeline, which U.S. President Barack Obama appears likely to veto soon.\nHarper has pressed Washington to approve the pipeline, variously describing the project as a \"no brainer\", saying he would not \"take no for an answer\" and expressing the conviction the project will eventually get the green light.\n\"We will continue to make the case and make the case aggressively,\" he told a televised election debate. Harper's Conservatives face a tough fight on Oct. 19 against the Liberals and New Democrats, both center-left parties.\nObama is under pressure from greens and other activists to block the pipeline, which would take oil from Alberta's tar sands to U.S. refineries.\nThe White House last week noted Obama has previously expressed skepticism about claims from Keystone XL supporters that the pipeline would create jobs and have a long-term economic impact.\nNew Democrat leader Thomas Mulcair said Harper had taken the wrong approach by lecturing Obama and mocked his comments about not taking no for an answer.\n\"Well guess what? The answer was no and you weren't able to do anything about it,\" he said, adding that Harper had been \"pouring vinegar by the gallon on the Americans and it's not a surprise they were saying no to you\".\nDemocratic U.S. presidential candidate Hillary Clinton, who has long avoided a firm position on the pipeline, last week said she opposed it. (Reporting by David Ljunggren; Editing by Ken Wills )", "external_links": [], "published": "2015-09-29T05:41:00.000+03:00", "crawled": "2015-09-29T05:12:17.371+03:00", "highlightTitle": ""}