{"organizations": [], "uuid": "d12a54e3ac72ee8de44fc54de8e1718c43cbffe8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/02/brazil-economy-industry-idUSL1N1180MU20150902", "country": "US", "title": "UPDATE 1-Brazil's factory output tumbles in July", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Brazil's factory output tumbles in July | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T17:00:00.000+03:00", "replies_count": 0, "uuid": "d12a54e3ac72ee8de44fc54de8e1718c43cbffe8"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/02/brazil-economy-industry-idUSL1N1180MU20150902", "ord_in_thread": 0, "title": "UPDATE 1-Brazil's factory output tumbles in July", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds table, background, details) BRASILIA, Sept 2 Brazilian industrial output sank at a much steeper pace than expected in July, portraying a deeper recession after a string of interest rate increases, tax hikes and spending cuts by President Dilma Rousseff's government. Industrial production in Brazil fell 1.5 percent in July from June, the sharpest rate of decline since the beginning of the year and far below even the most pessimistic forecast in a Reuters poll, statistics agency IBGE said on Wednesday. It was the seventh drop in nine months for Brazilian manufacturers, who have been laying off thousands of workers each month as they struggle to get rid of excess inventory. On an annual basis, production fell 8.9 percent, its 17th consecutive month of decline. Output dropped in 14 of 24 industrial segments on a monthly basis, with food processing contributing the most to the decline with a fall of 6.2 percent from June. Brazil's industrial crisis is one of many features of the country's deepest recession since at least 1990. Gross domestic product could shrink about 2.3 percent in 2015, with growth returning only in 2017, according to economists. Industrial output is seen down 5.6 percent this year, a weekly central bank poll showed on Monday. August was probably no better for Brazilian manufacturers, a private survey suggested on Tuesday. The Purchasing Managers' Index (PMI) for manufacturing contracted for a seventh straight month in August, with a sharp drop in new orders driving heavy job cuts as the recession takes hold. A recent currency decline has failed to spark a recovery among exporters of manufactured goods, which are wrestling with rivals in China and Mexico for markets. The Brazilian real is trading at its weakest since 2002 following a 28 percent decline against the U.S. dollar this year. Rousseff's government has raised taxes and curbed spending since the beginning of the year to safeguard the investment-grade rating for the country's debt. The efforts have done little so far to curb market pessimism, and many investors expect rating downgrades to come over the next year. Industry has also been hit by a sharp increase in interest rates since late last year as part of the central bank's efforts to lower inflation from near 10 percent. (Percent change) July/June July'15/July'14 Capital goods -1.9 -27.8 Intermediate goods -2.1 -5.6 Consumer goods -1.1 -10.1 Durable consumer goods 9.6 -13.7 Semi-durable and -3.4 -9.2 non-durable consumer goods Industrial output -1.5 -8.9 (Reporting by Rodrigo Viga Gaier in Rio de Janeiro; Writing by Silvio Cascione ; Editing by Franklin Paul and Jeffrey Benkeo)", "external_links": [], "published": "2015-09-02T17:00:00.000+03:00", "crawled": "2015-09-02T16:17:17.926+03:00", "highlightTitle": ""}