{"organizations": [], "uuid": "c0395d96a6d4a51a63cc5a3d299756c51de066b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/fredupton010915.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/us-congressional-leaders-ask-fda-about-coumadin-safety/43334.html", "country": "IN", "title": "US Congressional Leaders Ask FDA about Coumadin Safety", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "US Congressional Leaders Ask FDA about Coumadin Safety", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T09:44:00.000+03:00", "replies_count": 0, "uuid": "c0395d96a6d4a51a63cc5a3d299756c51de066b4"}, "author": "Charles Ornstein (ProPublica)", "url": "http://www.moneylife.in/article/us-congressional-leaders-ask-fda-about-coumadin-safety/43334.html", "ord_in_thread": 0, "title": "US Congressional Leaders Ask FDA about Coumadin Safety", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » US Congressional Leaders Ask FDA about Coumadin Safety 43334 US Congressional Leaders Ask FDA about Coumadin Safety 0 Comments, Be the first to comment Charles Ornstein (ProPublica) | 10/09/2015 12:14 PM | The move follows a ProPublica analysis showing mistakes involving the drug resulted in injuries and deaths of nursing home residents The bipartisan leadership of the House Energy and Commerce Committee is asking the Food and Drug Administration how it monitors the safety of the popular blood thinner Coumadin, particularly in light of deaths and hospitalizations of nursing home residents taking the drug. The committee’s letter , sent last week, follows a ProPublica report co-published by the Washington Post in July that focused on the harm caused by nursing homes’ failure to manage the drug. Our analysis of government inspection reports found that, between 2011 and 2014, at least 165 nursing home residents were hospitalized or died after errors involving Coumadin or its generic version, warfarin. In some cases, homes gave residents too much of the drug, which caused internal bleeding. In other cases, they gave residents too little, leading to blood clots and strokes. “While the committee recognizes that FDA has no role in overseeing the safety and health requirements for nursing homes, or the practice of medicine, the problems identified in the ProPublica report have prompted the committee to consider where there are any further actions FDA could take to decrease the incidence and severity of adverse events related to the use of Coumadin and/or warfarin,” the letter said. The letter was signed by committee chairman Fred Upton, R-Mich., and ranking member Frank Pallone Jr., D-N.J., as well as Rep. Tim Murphy, R-Pa., chairman of the subcommittee on oversight and investigations, and Diana DeGette, D-Colo., the subcommittee’s ranking member. The ProPublica article noted that Coumadin can be a lifesaver when taken as directed and carefully monitored. But when it’s not, it can be dangerous. A 2007 study in The American Journal of Medicine estimated that nursing home residents suffer 34,000 fatal, life-threatening or serious events each year related to the drug.", "external_links": [], "published": "2015-09-10T09:44:00.000+03:00", "crawled": "2015-09-10T11:56:09.210+03:00", "highlightTitle": ""}