{"organizations": [], "uuid": "3d4aa8dea951f27248907242480173bbf7b43f93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/qld-premier-says-budget-help-051548940.html", "country": "GB", "title": "Qld premier says budget will help woes", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Qld premier says budget will help woes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T10:13:00.000+03:00", "replies_count": 0, "uuid": "3d4aa8dea951f27248907242480173bbf7b43f93"}, "author": "", "url": "https://au.finance.yahoo.com/news/qld-premier-says-budget-help-051548940.html", "ord_in_thread": 0, "title": "Qld premier says budget will help woes", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thu, Sep 3, 2015, 4:30 PM AEST - Australia Markets closed Qld premier says budget will help woes AAP – 1 hour 14 minutes ago Recommend Print \nPremier Annastacia Palaszczuk has reassured Queenslanders her budget will help the state get back on track after another round of disappointing economic figures. \nAustralian Bureau of Statistics figures released on Wednesday showed final demand for Queensland fell 0.8 per cent in the June quarter, rounding off a year of negative final demand figures in the state. \n\"These figures are actually better then they were last year and I know our budget is measured, it's responsible,\" Ms Palaszczuk told reporters in Townsville. @y7finance on Twitter, become a fan on Facebook Myer shares hit all-time low AAP \nMyer shares have plunged to a new all-time low of 90 cents after the completion of the first part of the department … Terms \nQuotes are real-time for NASDAQ, NYSE, and NYSEAmex when available. See also delay times for other exchanges . Quotes and other information supplied by independent providers identified on the Yahoo! Finance partner page . Quotes are updated automatically, but will be turned off after 25 minutes of inactivity. Quotes are delayed at least 15 minutes. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. Neither Yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. By accessing the Yahoo! site, you agree not to redistribute the information found therein. \nFundamental company data provided by Capital IQ . Historical chart data and daily updates provided by Commodity Systems, Inc. (CSI) . International historical chart data and daily updates provided by Morningstar, Inc . Yahoo7 News Network", "external_links": [], "published": "2015-09-03T10:13:00.000+03:00", "crawled": "2015-09-03T10:27:54.186+03:00", "highlightTitle": ""}