{"organizations": [], "uuid": "a9ca02594c76d7650249a56966abd27ee1e9730b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/aBmKursxwzXixunTSirMoQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/728de84a6a0ed6b0e66ea24c44982562aa58a356_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/china-state-firm-reforms-limited-103757682.html", "country": "GB", "title": "China state firm reforms limited and slow: analysts", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "China state firm reforms limited and slow: analysts", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T13:37:00.000+03:00", "replies_count": 0, "uuid": "a9ca02594c76d7650249a56966abd27ee1e9730b"}, "author": "", "url": "https://uk.finance.yahoo.com/news/china-state-firm-reforms-limited-103757682.html", "ord_in_thread": 0, "title": "China state firm reforms limited and slow: analysts", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nChina is promising reforms, mergers and even closures in its bloated state-owned businesses as it looks to bolster an economy causing global anxiety, but sceptical analysts said Monday that real change could take years. \nA slew of disappointing data from the world's second-largest economy has sent shudders around the world, with the latest showing weak growth in both industrial output and government infrastructure spending. \nSo a weekend announcement by Communist Party bosses that they wanted to loosen the ropes binding 150,000 state-owned enterprises (SOEs) was seen as a chance to shake up a flabby sector. \nZhang Xiwu, a vice-director of the government body that oversees the 110-odd centrally managed firms, told a briefing Monday that it would \"clear up a group of SOEs and let them exit the market\". \n\"We will make more efforts in reforming 'zombie enterprises', long-time loss-making enterprises and disposing (of) low-efficient and non-performing assets,\" he said. \nBut the lengthy \"Guidelines on Deepening State-owned Enterprise Reform\" did not specify any particular measures at individual companies. \nCrucially, it stopped short of recommending full privatisation, opting instead for advising mergers and mixed ownership. \nFor Claire Huang, China economist at Societe Generale (Swiss: 519928.SW - news ) in Hong Kong, the intention was to strengthen SOEs, but there was little prospect of immediate change. \n\"Don?t expect this document to have much positive impact on the economy anytime soon,\" she told AFP. \n\"The current downturn caused by structural shift in the economy is only halfway through and the goal of this guideline is to improve the efficiency of SOEs, which will take a long time to accomplish.\" \n- Disappointed - \nChina last week lowered its 2014 economic growth figure to 7.3 percent -- high by global standards, but the country's slowest rate in nearly a quarter of a century, after decades of double-digit expansion. \nBeijing is pushing the line that this a \"new normal\", saying that this is what the economy will look like as it retools from one dependent on state spending and exports, to one reliant on domestic demand. \nBut investors have been spooked by months of discouraging numbers, sending stock markets around the world into spasms amid worries over whether Communist bosses are capable of managing the transition. \nIf authorities were hoping to calm nerves with their blueprint, they would have been disappointed; the benchmark Shanghai stock index fell 2.67 percent on Monday, with commentators saying the plan lacked any bold details. \n\"The guidelines are generally within market expectations,\" HSBC Beijing-based economist Ma Xiaoping told AFP. \n\"Many SOEs have already embarked on the merger process and attracting private capital.\" \nTwo rail construction firms, China Railway Group and China Railway Erju, on Monday announced that they are planning \"asset integration\" and would each suspend trading of their stock, setting off speculation of a future merger. \nBut the government is a long way from cutting the apron strings entirely. \nNational Development and Reform Commission vice chairman Lian Weiliang said the state will continue to hold controlling stakes in firms whose operations encompass sectors key to \"national security\" or \"economic security\". \n\"The reforms will have a long-term impact,\" Bank of Communications analyst Liu Xuezhi told AFP. \"While in the short term, their influence on the economy is quite limited\".", "external_links": [], "published": "2015-09-14T13:37:00.000+03:00", "crawled": "2015-09-14T14:01:57.666+03:00", "highlightTitle": ""}