{"organizations": ["India Toshiba Corporation", "Toshiba Group", "NTPC", "Toshiba JSW Power Systems Private Ltd.", "Toshiba JSW Power Systems Pvt. Ltd.", "Generator Pvt. Ltd.", "Meja Urja Nigam Pvt. Ltd.", "Toshiba India Pvt. Ltd.", "Coastal Gujarat Power Limited", "UPRVUNL", "Toshiba JSW", "Uttar Pradesh Rajya Vidyut Utpadan Nigam Ltd.", "Toshiba", "Tata Power Company Limited", "EPC", "Toshiba Corporation"], "uuid": "dde56d0adef068dfff0cc5ceed4096faaf936eaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/toshiba-wins-epc-contract-harduaganj-ultra-supercritical-thermal-power/45174", "country": "US", "title": "Toshiba Wins EPC Contract for Harduaganj Ultra-supercritical Thermal Power Project from Uttar Pradesh Rajya Vidyut Utpadan Nigam Ltd. (UPRVUNL) in Lucknow, India", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Toshiba Wins EPC Contract for Harduaganj Ultra-supercritical Thermal Power Project from Uttar Pradesh Rajya Vidyut Utpadan Nigam Ltd. (UPRVUNL) in Lucknow, India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T09:42:00.000+03:00", "replies_count": 0, "uuid": "dde56d0adef068dfff0cc5ceed4096faaf936eaa"}, "author": "", "url": "http://businesswireindia.com/news/news-details/toshiba-wins-epc-contract-harduaganj-ultra-supercritical-thermal-power/45174", "ord_in_thread": 0, "title": "Toshiba Wins EPC Contract for Harduaganj Ultra-supercritical Thermal Power Project from Uttar Pradesh Rajya Vidyut Utpadan Nigam Ltd. (UPRVUNL) in Lucknow, India", "locations": ["Tamil Nadu", "TOKYO", "Gujarat", "Chennai", "Uttar Pradesh", "Meja", "Delhi", "Lucknow", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Yoshiaki Inayama"], "text": "Thursday, September 10, 2015 12:12PM IST (6:42AM GMT) (BW)(TOSHIBA-CORPORATION) Toshiba Wins EPC Contract for Harduaganj Ultra-supercritical Thermal Power Project from Uttar Pradesh Rajya Vidyut Utpadan Nigam Ltd. (UPRVUNL) in Lucknow, India --660MW Plant to be executed by Toshiba on EPC basis-- Delhi, India Toshiba Corporation (TOKYO:6502) today announced that Toshiba JSW Power Systems Private Ltd. (Toshiba JSW), a Toshiba Group company based in Chennai, India has been awarded a full EPC Contract by Uttar Pradesh Rajya Vidyut Utpadan Nigam Ltd. (UPRVUNL), wholly owned state thermal power utility with present generating capacity of 4933MW. The value of the contract is about USD540 million. Toshiba JSW will carry out Engineering, Procurement, Construction (EPC) of the entire thermal power plant, including civil and boiler island package to be completed within 48 month from the Contract award. UPRVUNL’s evaluation reflects the high performance and the reliability of Toshiba’s ultra-supercritical steam turbines and generators, and the company’s capabilities in integrating engineering and manufacturing functions. Toshiba can provide customers with competitive EPC solutions, and the company believes it is an acknowled g ement of Toshiba’s excellent track record for successful completion of challenging projects around the world within contractual plant completion schedules. Mr. Yoshiaki Inayama, Managing Director of Toshiba JSW said, “We have a long standing relationship with UPRVUNL. Toshiba initially entered the thermal power market by supplying two 500MW subcritical steam turbines and generators at Anpara B thermal power plant, and later cemented our association by securing another order for supplying two units of 660MW supercritical steam turbines and generators package to Meja power plant in Uttar Pradesh. We are very honoured to once again work with UPRVUNL for Harduaganj Ultra Supercritical Thermal Power Project to provide ultra supercritical thermal power plant. This takes us a step further in our endeavour to contribute to Indian’s suitable power supply by its endeavour of continued innovations.” In January 2014, Toshiba Corporation reinforced its thermal power generation business in India by integrating the engineering function of Toshiba India Pvt. Ltd. into Toshiba JSW Turbine and Generator Pvt. Ltd., a manufacturer of turbines and generators based in Chennai, Tamil Nadu state. The company, renamed Toshiba JSW Power Systems Pvt. Ltd., is positioned to provide full EPC solutions for thermal power plants, and is working to expand its business in India and the surrounding region. Toshiba Group is an undisputed market leader in supercritical steam turbines and generators in the 800MW category in India, having won orders for ten sets in all: five for Coastal Gujarat Power Limited, a subsidiary of Tata Power Company Limited, India's largest private sector power utility, for its Mundra UMPP in Gujarat, which are now in successful commercial operation; three for NTPC's Kudgi Super Thermal Power Project and two for the NTPC's Darlipali Super Thermal Power Project. The company has also won an order for two 660MW supercritical steam turbine and generator island packages for Meja Thermal Power Project from Meja Urja Nigam Pvt. Ltd., a joint venture between NTPC and UPRVUNL.", "external_links": [], "published": "2015-09-10T09:42:00.000+03:00", "crawled": "2015-09-10T12:31:43.482+03:00", "highlightTitle": ""}