{"organizations": [], "uuid": "b1873f2bf46c2bb980a962b8652f8e53f3e4d0c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/w/q/0/6/image.related.afrArticleLead.620x365.gjt2md.png/1443488219415.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/accounting/want-the-best-paid-accounting-job-study-computing-20150923-gjt2md", "country": "AU", "title": "Want the best paid accounting job? Study computing", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Want the best paid accounting job? Study computing | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T08:56:00.000+03:00", "replies_count": 0, "uuid": "b1873f2bf46c2bb980a962b8652f8e53f3e4d0c2"}, "author": "Agnes King", "url": "http://www.afr.com/business/accounting/want-the-best-paid-accounting-job-study-computing-20150923-gjt2md", "ord_in_thread": 0, "title": "Want the best paid accounting job? Study computing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sydney accountant Jingjing Sun is competing with computer geeks for the best finance jobs. James Alcock Share on twitter by Agnes King Sydney accountant Jingjing Sun wants a better job in finance. But the majority of candidates she is competing against have a computer science degree.\n\"What am I supposed to do, go back and do a computer science degree?\" says the 34 year old, Sydney University graduate.\nMs Sun levelled this question to a number of accounting and finance academics at the unveiling of a Chartered Accountant Australia and New Zealand's new report on the Future of the Finance Profession .\nThey steered her towards a smorgasbord of short courses to upgrade her skills.\nMs Sun could get a financial accounting job in a heart beat. But a pure accounting degree is no longer enough to clinch the most interesting and highly paid roles in finance, such as a management accounting gig or an analyst role.\n\"To be honest I don't want to [do more courses]. But the market is getting tougher,\" Ms Sun said.\nTechnology is fast becoming a prerequisite for the best accounting jobs.\nFinding people who fit the bill is equally challenging for firms.\n Hunt for the 'full stack employee' Lisa Callaghan, 32-year-old founder of fast growing, hi-tech Sydney accounting firm, Interactive Accounting, has had two recruiters scouring the Melbourne labour market since July for the \"full stack employee\".\nThe term ' Full Stack Employee ' was coined by Chris Messina (who invented the Twitter Hashtag).\nNearly two years after leaving Google, Messina observed that conventional seams between disciplines in the professional sphere are fraying, making the necessary skills to succeed a lot broader.\n\"These day, you've gotta be a real polymath to get ahead,\" he said.\nIf Ms Callaghan's young nephews asked her for career advice, she would tell them to study computing, despite the fact that she wields a degree in business (majoring in accounting) from the University of Technology Sydney herself.\nMs Callaghan is not alone. Earlier this year, PricewaterhouseCoopers Australian chief executive Luke Sayers said the firm would put science, technology, engineering and maths \"right at the heart\" of its strategy .\nIt was part of a rousing speech encouraging more youngsters to study STEM as a solid foundation for any career.\nBut a recent article in The New Yorker points out that many STEM graduates are having a tough time getting the jobs they'd like too.\nPeter Cappelli, a professor of management at Wharton, reports that only about a fifth of recent STEM graduates got jobs that made use of that training.\n\"Employers who say that we need more engineers or IT grads are not promising to hire them when they graduate,\" Cappelli said.\nDemand 'declining' According to some economists, what is actually occurring is that demand for highly educated workers has declined, while job growth in low-paying occupations has risen strongly.\nThis has pushed high-skilled workers down the occupational ladder into competition for jobs traditionally performed by lower-skilled workers.\nUniversities and post graduates educational institutions are struggling with how they build the foundations of a polymath .\nAfter reading Messina's article, Ms Callaghan realised that so many of the skills she sought in accounting recruits weren't being taught at university or in graduate programs.\nThe two biggest deficiencies, she said, are communication skills and applied learning.\n\"When it comes to communication, they're great in a social setting but that falls away in a professional context,\" she said.\nOn applied learning, they're good on theory but can't use that to solve problems in a real world context.\nMs Callaghan's first pick in the recruitment line-up declined and quit the accounting profession altogether, disillusioned by its stodginess.\nA decade ago, Ms Callaghan did exactly the same thing. What bought her back was the promise of building a \"firm of the future\" - tech savvy, global, agile, \"unprofessional\" in the conventional sense.\nShe believes one of the main points of failure in the accounting education and training system is that the individuals responsible for developing course content and doling out career advice to students at university and in professional bodies are out of touch with the market.\n\"They're too old and don't get it,\" she said.\nWhile he wouldn't put it in exactly those terms, Sydney accountant James Solomons, said there is some truth to Ms Callaghan's assessment.\nMr Solomons runs a practice, consults for accounting software company Xero, and guest lectures at Macquarie University. He believes six months out of public practice renders you out of touch. It's one of the main reasons he juggles so many interests simultaneously. That too appears to be a hallmark of a polymath.", "external_links": ["http://www.newyorker.com/magazine/2015/09/07/college-calculus", "https://twitter.com/https://twitter.com/Agi_King", "https://twitter.com/chrismessina", "https://medium.com/@chrismessina/the-full-stack-employee-ed0db089f0a1", "http://en.wikipedia.org/wiki/Polymath"], "published": "2015-09-29T08:56:00.000+03:00", "crawled": "2015-09-29T08:07:25.911+03:00", "highlightTitle": ""}