{"organizations": [], "uuid": "c23fd49e7c1230b071a584af9e1e2092bf75b6c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509010865.html", "country": "US", "title": "Zimbabwe: Farmers Turn to Fishing As Zimbabwe Crops Fail", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Farmers Turn to Fishing As Zimbabwe Crops Fail", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T13:03:00.000+03:00", "replies_count": 0, "uuid": "c23fd49e7c1230b071a584af9e1e2092bf75b6c9"}, "author": "", "url": "http://allafrica.com/stories/201509010865.html", "ord_in_thread": 0, "title": "Zimbabwe: Farmers Turn to Fishing As Zimbabwe Crops Fail", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mugabe"], "text": "Zimbabwe: You Will Miss Mugabe, Grace Tells Zimbabweans \n\"My catch is getting smaller by the day because almost everyone from my village has joined in the fishing,\" Kamwi told IRIN. \n\"Sometimes our village head comes with police officers to arrest us because it is illegal to use nets to fish in the dam, but we won't stop because that is the only way to avoid starving.\" \nIn Shurugwi, as in most rural districts across Zimbabwe, household income is less than a dollar a day and families still depend largely on their annual maize production to survive. \nMost villagers here had their entire harvest written off because the rains came late, flooded the fields and stopped abruptly, leaving the crops to wither. \nThe World Food Programme reported last week that 1.5 million people, 16 percent of Zimbabwe's population, are expected to be \"food insecure\" at the peak of the lean season, which runs from around November to March - a rise of 164 percent compared to the same period last year. \nFinding a way to survive \nWhenever opportunities arise, farmers find other ways to earn a modest income, whether it is moulding bricks or selling dry long grass used for thatching. Some resort to panning for gold, which is both illegal and often highly dangerous. \nSeveral hundred kilometres east of Shurugwi, in rural Wedza, another maize-producing region perennially affected by drought, villagers have been attending meetings to mobilise for possible food handouts from the government. But there is no hope of that actually happening yet. \n\"We used to depend on donors for food aid, but none have visited our area this year. We are also told that (the) government doesn't have any food to give to us, so we are in a fix,\" Godfrey Samaita, the head of the village, told IRIN. \n\"The teachers at our schools tell me that more and more children are collapsing at school due to hunger and some are dropping out. I also hear that there is an increase in young girls turning to commercial sex.\" \nThere is growing anger at the mismanagement of the agriculture industry, especially at the country's Grain Marketing Board (GMB), which is supposed to ensure food security by promoting crop production but whose failure to pay farmers for grain in recent years has only made the crisis worse. \nZimbabwe is facing a 1.1 million tonne cereal deficit this year, according to the Famine Early Warning Systems Network (FEWS NET), a USAID-funded analysis service. \nThe GMB holds only 24 percent of the required minimum of 500,000 tonnes in its strategic reserves. The government has said it will need to import 700,000 tonnes of corn to feed those facing hunger in the coming months. But experts like Harare-based economic consultant John Robertson estimate it will need a lot more than that and doubt it will be able to raise the funds to pay for such large imports anyway. \nMismanagement \nThis crisis didn't just happen overnight. Zimbabwe has experienced recurrent cycles of crop failures, with 2012-2013 among the most severe. FEWS NET's latest grain and livestock forecast paints a gloomy picture going forward, particularly for the drought-prone south. \n\"Households in most southern provinces are currently facing 'Stressed'... outcomes, which are expected to deteriorate to 'Crisis' from October to December,\" it observed. \n\"Crisis\" indicates at least 20 percent of households have significant food consumption gaps and that levels of acute malnutrition are abnormally high. \nFarmers have lost faith in the grain board's ability to pay because it is in serious financial difficulty and has been defaulting on payments for years. It hasn't paid its own workers for more than eight months and offered them its little available grain as a bonus last Christmas. \n\"Grain deliveries to the GMB are very low this year, with only 29 percent (11,500 metric tonnnes) received as of early July, compared to 40,000 MT by the same time last year,\" the latest FEWS NET update said. \n\"These low delivery levels to the GMB are due to the loss of trust by farmers with surplus grain because of non-payment for past deliveries. These farmers are opting to sell to private traders offering cash.\" \nFarmers are prepared to sell privately for less than half the price the GMB is offering just to make certain they are paid. Some are holding on to their grain, hoping for higher prices as the situation becomes more desperate in the coming months. \nVicious cycle \nWithout being paid for their grain, the farmers can't feed their families in the short-term, but they are also unable to look after their land and plan for the future. \nKamwi said the GMB had still not paid the $780 due to him for the two tonnes of maize he sold it last year. \"I would have used that money to buy basic foodstuffs and inputs for the next farming season,\" he told IRIN. \nIn areas where crops failed due to the drought, households that planted their crops early last year managed to get some grain, but this is running out fast, while the majority got nothing. \nVillagers are forced to buy grain from traders who come from as far away as Harare, but at a steep price (a 20-kg bucket has risen from $3 last year to up to $10). Some have already sold off most their livestock to buy food, send children to school and meet medical expenses. \nMost people in Wedza now only have one meal a day, comprising of the starch-rich maize porridge called sadza and modest amounts of vegetables. \nFinance Minister Patrick Chinamasa recently announced a $77 million supplementary budget for drought relief, but as Zimbabwe even struggles to pay its civil servants in Harare on time, those living in the country's remote farming communities aren't exactly holding their breath. \nIn Shurugwi, Emma Mhene, a 40-year-old widow looks after three children of her own and two others from her late sister. She doesn't know what she is going to do now that her brother, who used to send her money to buy food whenever he could, has been laid off. \n\"It is a painful struggle now, and if things continue like this, the children will starve,\" she told IRIN. Zimbabwe \nThe promise by Home Affairs minister Malusi Gigaba that rejected applications for Zimbabwean Special Permits are to be … see more » Copyright © 2015 IRIN. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-01T13:03:00.000+03:00", "crawled": "2015-09-01T14:21:31.188+03:00", "highlightTitle": ""}