{"organizations": [], "uuid": "ede245b01294dd1f9af348c4ec3bb805218d91a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/overnights/254447-overnight-finance-walker-drops-out-senate-could-go-first-on-funding", "country": "US", "title": "Overnight Finance: Walker drops out; Senate could take lead on funding bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Finance: Walker drops out; Senate could take lead on funding bill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T01:31:00.000+03:00", "replies_count": 0, "uuid": "ede245b01294dd1f9af348c4ec3bb805218d91a3"}, "author": "mmali@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/overnights/254447-overnight-finance-walker-drops-out-senate-could-go-first-on-funding", "ord_in_thread": 0, "title": "Overnight Finance: Walker drops out; Senate could take lead on funding bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Finance: Walker drops out; Senate could take lead on funding bill By Kevin Cirilli - 09/21/15 06:31 PM EDT \nOUT: SCOTT WALKER. The Wisconsin governor dropped out of the Republican presidential contest tonight. The Hill has you covered: http://bit.ly/1FYDsCz \nTOMORROW STARTS TONIGHT: JANET YELLEN FACES MORE SCRUTINY OVER RATE HIKE. Jonathan Spicer and Howard Schneider for Reuters: \"As the U.S. Federal Reserve's chief communicator, Chair Janet Yellen is under building pressure among her colleagues and global investors to clarify where the world's biggest central bank is heading and how it is making its decisions. The calls have come from both her policy opponents like St. Louis Fed President James Bullard and more centrist sympathizers like Atlanta Fed President Dennis Lockhart, as well as market analysts and investors who say they have been confused about the Fed's direction. ADVERTISEMENT \"It is perhaps her biggest test yet as she tries to guide a committee currently divided between those who feel the U.S. economy has healed enough for a rate hike, and those who feel a weak global economy could undermine the country's growth and recovery. Aside from last week's press conference, Yellen has been largely absent from the public stage in recent weeks -- focusing attention on a Thursday speech that could give insight into her place in that debate.\n\"In the interim, analysts and investors insist the Fed has let seeming contradictions take hold -- saying that markets should not influence monetary policy, but then reacting to markets; declaring policy is data dependent and then saying that a 5.1 percent unemployment rate still needs to fall further.\" http://reut.rs/1Plrt7j \nTHIS IS OVERNIGHT FINANCE, where I am still recovering from the Birds' loss to the Cowboys yesterday. Tweet: @kevcirilli ; email: kcirilli@thehill.com ; and subscribe: http://thehill.com/signup/48 . I'll be on News Channel 8 tonight at 8 p.m. on \"Capital Insider.\" \nCOMING TOMORROW TO THEHILL.COM - - > My exclusive deep dive into the battle inside the Democratic Party to reshape President Obama's controversial regulatory pitch for financial advisers, aka: the fiduciary fight. \nFUNDING FIGHT: From The Hill's Pete Schroeder: \"Senate Majority Whip John Cornyn (R-Texas) said Monday that the Senate might have to take the lead in advancing a spending bill, and not wait for the House. Asked if the Senate needed to take the lead on a funding measure, Cornyn told reporters, 'I don't think it's been finally decided, but to me it becomes increasingly apparent that the Senate is probably going to have to move.' \n\"Cornyn has indicated that the Senate will vote on a bill that defunds Planned Parenthood. That measure would certainly be blocked by Senate Democrats, after which the Senate would move to vote on a 'clean' continuing resolution that does not defund the group. The office of Senate Democratic Leader Harry Reid (Nev.) says it expects a vote on a spending bill that defunds the group on Thursday, which will fail, prompting Republicans to then start the voting process on a 'clean' bill. http://bit.ly/1LsfeXt \nEX-IM WATCH, via me: Democrats are looking to turn Republican opposition of the Export-Import Bank into a Congressional campaign issue. Democrats are looking to turn Republican opposition of the Export-Import Bank into a Congressional campaign issue. \nThey argue that conservatives' efforts to kill the federally backed bank -- whose charter lapsed June 30 and as a result cannot finance new projects -- have forced companies like General Electric to send hundreds of jobs overseas. Earlier this week, White House press secretary Josh Earnest said that \"Republicans have killed quite a few jobs on their own,\" after referencing the G.E. jobs. \nMeanwhile, the Democratic Congressional Campaign Committee slammed Reps. John Katko (R-N.Y.) and Elise Stefanik (R-N.Y.) earlier this week for choosing to campaign with House Speaker John Boehner (R-Ohio) instead of reauthorizing the bank. http://bit.ly/1itAUH0 \n-- MORE EX-IM - - > PAIN POINTS: With companies such as GE moving jobs overseas to stay competitive amid Congressional inaction about the Export-Import Bank, the Exporters for Ex-Im Coalition has a new gif-o-graphic. The graphic shows \"pain points\" across America where companies are speaking out about how the lapse on how Ex-Im is harming them, their coworkers, and their communities. See here: http://goo.gl/6a2rJf \nSIDESHOW: BEN CARSON IGNITES FIRESTORM OVER 'MUSLIM' CONTROVERSY . Jonathan Easley with the exclusive: Republican presidential candidate Ben Carson is under attack from Republicans and Democrats alike over his controversial remarks that a Muslim should not be president of the United States. The White House ripped Carson, with press secretary Josh Earnest saying the comments are \"entirely inconsistent with the Constitution.\" ... Carson first made the comments in a \"Meet the Press\" interview with Chuck Todd on Sunday morning, and later that day doubled-down in an interview with The Hill, saying that whoever takes the White House should be \"sworn in on a stack of Bibles, not a Quran.\" http://bit.ly/1KwmWL7 \nFED WATCH, via Pete Schroeder: The intense interest on when the Fed will hike rates for the first time in nearly a decade will now likely fall alongside intense Washington battles over a host of other key economic issues, including the debt limit and extending a host of tax provisions. While economic drama has been no stranger in Washington in recent years, the mess of contentious agenda items looming with just weeks to go in 2015 could be the worst of them all. http://bit.ly/1Lse9ir", "external_links": [], "published": "2015-09-22T01:31:00.000+03:00", "crawled": "2015-09-22T18:45:40.077+03:00", "highlightTitle": ""}