{"organizations": [], "uuid": "ae9566df143d94315dd44d8f68048ce8232c10b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenational.ae", "main_image": "http://www.thenational.ae/styles/images/default_social_share.jpg", "site_section": "http://thenational.ae//section/rss/1034", "section_title": "Personal Finance RSS feed - The National", "url": "http://www.thenational.ae/business/personal-finance/uae-advisers-cannot-advise-on-certain-uk-pension-changes", "country": "", "title": "UAE advisers cannot advise on certain UK pension changes", "performance_score": 0, "site": "thenational.ae", "participants_count": 1, "title_full": "UAE advisers cannot advise on certain UK pension changes | The National", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T11:19:00.000+03:00", "replies_count": 0, "uuid": "ae9566df143d94315dd44d8f68048ce8232c10b6"}, "author": "Keren Bobker", "url": "http://www.thenational.ae/business/personal-finance/uae-advisers-cannot-advise-on-certain-uk-pension-changes", "ord_in_thread": 0, "title": "UAE advisers cannot advise on certain UK pension changes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I have a UK pension plan from a job I had many years ago. I have seen a few advertisements saying I can transfer this to something under my control, but when I spoke to one company in Dubai they told me that as it was an old-style, final salary pension this was no longer the case. Someone else has been given different advice, so can you explain what is going on? EM, Dubai\n\nIn April of this year, there were various changes regarding the way people can access UK pensions, changes known as Pensions Freedom. Although the main focus of the reforms was regarding how people could draw their pension benefits, there was a change for final salary – also known as Defined Benefit – plans. These are pension arrangements run by employers as opposed to personal plans and usually include certain guarantees regarding retirement income and restrictions regarding retirement options. To benefit from the new rules, or in cases where the company plans have potential financial issues or holders want to take benefits in a different way, an individual would need to transfer their pension benefits to a personal pension arrangement. The regulations relating to such transfers have also tightened up significantly, and only British authorised and regulated advisers are permitted to advise people if a transfer from a defined benefit plan is appropriate. This means that the company giving the transfer advice must have specific authorisation to provide advice on this subject from the Financial Conduct Authority. UAE-based advisers will generally not be authorised in this way and cannot assist unless they also have a properly authorised UK arm of their business, and that division must be the provider of any transfer advice. It is no longer possible to transfer out of a UK statutory plan such as the NHS Superannuation, teachers or local government schemes. Any personally owned UK pensions (personal, Stakeholder or Group Personal Pension) can still be transferred without UK advice, but people should ensure that they receive guidance from a qualified and experienced adviser with solid reasons to enact a transfer.\n\nKeren Bobker is an independent financial adviser with Holborn Assets in Dubai, with over 20 years’ experience. Contact her at keren@holbornassets.com . Follow her on Twitter at @FinancialUAE. \n\nThe advice provided in our columns does not constitute legal advice and is provided for information only. \n\nFollow us on Twitter @TheNationalPF", "external_links": [], "published": "2015-09-25T11:19:00.000+03:00", "crawled": "2015-09-27T01:17:50.646+03:00", "highlightTitle": ""}