{"organizations": [], "uuid": "32f0954ba40527aed559960408b0aef436119ad4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/commodities/maharashtras-wine-industry-cheers-new-liquor-policy/133870", "country": "IE", "title": "Maharashtra’s wine industry cheers new liquor policy", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Maharashtra’s wine industry cheers new liquor policy | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T17:08:00.000+03:00", "replies_count": 0, "uuid": "32f0954ba40527aed559960408b0aef436119ad4"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/commodities/maharashtras-wine-industry-cheers-new-liquor-policy/133870", "ord_in_thread": 0, "title": "Maharashtra’s wine industry cheers new liquor policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An amendment to the Bombay Foreign Liqour Rules, 1953, which allows consumers to purchase 12 units at a time, spells cheer for Maharashtra’s wine industry.\nUntil now, consumers who visited wineries in Nashik were permitted to purchase only two units at a time but the amendment now spells more business for the industry, says All-India Wine Producers Association (AIWPA) president Shivajirao Aher.\nAccording to Aher, this has been a long-standing demand of the industry that has finally been accepted by the government.\nThe decision comes at a time when the Kumbh Mela is being held in Nashik, with expectations of a marked increase in visitors during this period, he said.\nAccording to the notification issued on August 28, consumers who were earlier allowed to purchase two units a week (three litres per week) are now permitted to purchase 12 units (18 litres per week).\nFor wineries, this means more sale because visitors can now purchase more bottles at one time, Manoj Jagtap, coordinator of the Association who also conducts wine tours for the industry, said.\nAher pointed out that even as the notification applies to the liquor industry as a whole, the wine industry stands to benefit the most because of the tourism aspect.\nJagdish Holkar, former chairman, Indian Grape Processing Board (IGPB) said, “there has been a 25-30% increase in wine sales during the Kumbh Mela period. When consumers realise that they can purchase more wine, the sales will go up.”\nFrom April to July 2015, Nashik district recorded a 7% rise in wine sales in the current financial year to 1,65,389 litres as against 1,55,405 litres during the corresponding period in 2014-15.\nFor wineries such as Sula, wine sales at the company’s tasting room have gone up by 15%. On a daily basis, Sula Vineyards alone has some 2,000-odd visitors. Other wineries to have tasting rooms include Grover Zampa, York Wineries, Chateau de Ori, Soma Wines , Fratelli and Revioli. Nashik is known as the wine capital of the country, and rightly so, as half of the Maharashtra’s wineries are based in the district.\nBesides, the wineries from Nashik contribute to a whopping 80% of the total sale in the domestic market.\nThere are a total of 93 wineries in the country, including 75 in Maharashtra. Of these, 37 wineries are based in Nashik alone.\nMaharashtra accounts for almost 90% of the total grape-wine production in India, while Nashik contributes 80% of the total wine production in the country.\n“Wineries earlier made premium wine worth Rs 350 a bottle (750ml). Now, they are making low-cost wines ranging from from Rs 150 a bottle onwards. Apart from this, wine is also available in hotels and restaurants at reasonable rates. Earlier, hoteliers would sell only four to five bottles a day due to high margin. They are now selling 10 to15 bottles per day. The young generation is also more inclined towards drinking wine than liquor. This has helped increase the wine sales in the district as well as in the country,”Aher said.\nWine sales in India rose by 21% from 95 lakh litres in 2013-14 to 1.15 crore litres in 2014-15, according to the All India Wine Producers association.\nStudies by Vinexpo, another leading wine and spirits industry body, has forecast that by 2017 wine sales will grow by 73.5%, translating to an annual consumption of 2.4 million cases.\nIndia wines have also started making their mark in overseas markets and therefore there is more curiosity to know about wines, an industry expert said.\nFor instance. one of the most renowned restaurants in the world, L’Arpège in Paris has selected two signature wines from the Grover Zampa Vineyards in India to be included in its menu. This is the first time an Indian wine has made it to the tables of the 3 Michelin star restaurant. The two wines – Grover Zampa’s Art Collection Sauvignon Blanc and La Reserve Red that won medals at the Decanter Asia Wine Awards and the Hong Kong International Wine Competition 2014, are the latest additions to the restaurant’s menu.\n 11, 2015 9:08 am", "external_links": [], "published": "2015-09-11T17:08:00.000+03:00", "crawled": "2015-09-14T08:06:20.190+03:00", "highlightTitle": ""}