{"organizations": [], "uuid": "940c4842ecbaa529a678daf18f4e8f9afaa3c162", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "articles.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/49053561.cms", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358311.cms", "section_title": "Finance-Banking/Finance-Industry-The Economic Times", "url": "http://articles.economictimes.indiatimes.com/2015-09-22/news/66792298_1_ujjivan-financial-services-samit-ghosh-mfis", "country": "IL", "title": "Microfinance companies may need Rs 2,000-crore in domestic equity to clear licence hurdles", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Microfinance companies may need Rs 2,000-crore in domestic equity to clear licence hurdles - timesofindia-economictimes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "940c4842ecbaa529a678daf18f4e8f9afaa3c162"}, "author": "timesofindia.indiatimes.com", "url": "http://articles.economictimes.indiatimes.com/2015-09-22/news/66792298_1_ujjivan-financial-services-samit-ghosh-mfis", "ord_in_thread": 0, "title": "Microfinance companies may need Rs 2,000-crore in domestic equity to clear licence hurdles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KOLKATA: Microfinance companies that have been awarded small finance licences may need to mobilise close to Rs 2,000-crore equity between them from local investors to dilute foreign ownership.\nGetting the final licence from Reserve Bank of India would depend on how they face the trial. MFIs along with payment banks licensees are going to jostle for space to raise equity from the market in the next 18 months and that will put intense pressure on the local equity market.\nLocal investors had never shown a keen interest in this sector all these years while foreign private equity players made a killing. MFIs such as Ujjivan Financial Services and Utkarsh Micro Finance have foreign holdings over 85%. The RBI says small finance banks should follow a holding company structure and a majority of the shares, at least 51%, should be owned by local promoters.\n\"This is clearly going to be a challenge and one that all MFIs are well aware of. It is expected to take up a lot of management time over the next 6-9 months,\" said Kshama Fernandes, managing director & chief executive of IFMR Capital , which helps MFIs raise capital.\n\"Sources of domestic equity are few and the demand is high. New domestic equity investors will have to come in as promoters, working alongside existing promoters,\" she said.\nEntities such as Disha Microfin, Equitas Holdings, Ujjivan and Utkarsh Micro Finance would look for domestic investors aggressively. Janalakshmi Financial Services would need to go in for domestic investors as well but it has already diluted foreign holding significantly while it was in the race for a universal banking licence.\nForeign holding in Ujjivan Financial Services is about 90% while it is 85% in Utkarsh. \"We need to increase domestic equity holding and this would be a real test since 10 small finance banks as well as 11 payments banks would be coming in to raise capital one way or the other, and this would put tremendous pressure on the market,\" Ujjivan managing director and chief executive Samit Ghosh said.\n\"Rupee capital has always been a challenge for the MFI industry in the past as most high networth individuals and Indian private equity houses have not shown a great appetite,\" said Abhijit Ray, managing director at Unitus Capital, another entity helping social entrepreneurs raising funds.\nBanking has always attracted huge domestic equity in the past as has been observed in case of many small private sector banks like Dhanalakshmi Bank or Ratnakar Bank. \"So many of the Indian investors may open up their kitty for small finance banks,\" Ray said, adding that they would need anything between Rs 1,500 toRs 2,000 crore for the domestic equity in the short-term. \n ", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-27T08:43:00.897+03:00", "highlightTitle": ""}