{"organizations": ["Garrison Investment Group"], "uuid": "7c2fac505d42cba3fa1530063db42e2d86cc28f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.equipmentfa.com", "main_image": "", "site_section": "http://www.equipmentfa.com/rss/feeds/latestnews.xml", "section_title": "Equipment Finance Advisor", "url": "http://www.equipmentfa.com/news/4726/capx-partners-leads-new-financing-of-ziosk-tablets", "country": "US", "title": "CapX Partners Leads New Financing of Ziosk Tablets", "performance_score": 0, "site": "equipmentfa.com", "participants_count": 0, "title_full": "CapX Partners Leads New Financing of Ziosk Tablets", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T14:02:00.000+03:00", "replies_count": 0, "uuid": "7c2fac505d42cba3fa1530063db42e2d86cc28f5"}, "author": "", "url": "http://www.equipmentfa.com/news/4726/capx-partners-leads-new-financing-of-ziosk-tablets", "ord_in_thread": 0, "title": "CapX Partners Leads New Financing of Ziosk Tablets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  CapX Partners Leads New Financing of Ziosk Tablets September 25, 2015, 07:02 AM Related: CapX Partners , Garrison Investment Group , Restaurant , Victory Park Capital \nCapX Partners (CapX) announced the closing of a loan facility that can grow to $100 million to support the growth needs of Ziosk. Ziosk is the creator of the restaurant industry’s first ordering, entertainment and pay-at-the-table tablet and commands 95% of the deployed market. The funds will be used to support agreements with Olive Garden and other restaurant brands to deploy Ziosk tablets across the U.S.Ziosk is the clear cut industry leader serving more than 25 restaurant concepts across all 50 states. When the Olive Garden deployment is complete, over 150,000 tablets in 3,000 locations will be interacting with more than 50 million guests per month, demonstrating the continued momentum of Ziosk in the restaurant industry.Olive Garden is the leading Italian restaurant brand in the casual dining segment with more than 840 restaurants and 96,000 employees and more than $3.8 billion in annual sales. Olive Garden is a division of Darden Restaurants, Inc., which owns and operates more than 1,500 restaurants that generate over $6.8 billion in annual sales. “Ziosk was seeking a strategic financial partner to assist in the expansion of its network,” said Eric Starr, CapX Partner. “Ziosk Chairman and Co-Founder Jack Baum and his team have created a fantastic platform for Olive Garden’s patrons. We are excited, along with our funding partners Garrison Investment Group and Victory Park Capital to provide support for Ziosk’s current and future restaurant partnerships.”Ziosk provides a technology platform for the restaurant industry. The flagship product is the Ziosk tabletop tablet that enhances the dining experience for several audiences. It gives guests more control over payment, entertainment and information. Ziosk also helps restaurants improve their service, digital relationship with their guests, operational efficiency and profits. The Ziosk benefits servers by increasing their tips and gives sponsors a unique and valuable way to reach their audiences.“We are thrilled to have CapX supporting Ziosk and our restaurant partners, and this financing further supports our mission to revolutionize pay-at-the-table solutions at restaurants. We are honored to have their confidence, commitment and support as we grow and look forward to a valuable partnership,” stated Jack Baum. Most Popular", "external_links": [], "published": "2015-09-25T14:02:00.000+03:00", "crawled": "2015-09-26T09:02:14.392+03:00", "highlightTitle": ""}