{"organizations": [], "uuid": "4d240ea73afc7abb05f8cdddf9bb1864beeed93e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/modi-silicon-valley-T.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/modi-us-visit-narendra-modi-silicon-valley-digital-india-aadhaar-card-bjp/141199", "country": "IE", "title": "Modi US visit: PM Narendra Modi’s digital initiatives certain to charm Silicon Valley", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Modi US visit: PM Narendra Modi’s digital initiatives certain to charm Silicon Valley | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T22:25:00.000+03:00", "replies_count": 0, "uuid": "4d240ea73afc7abb05f8cdddf9bb1864beeed93e"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/modi-us-visit-narendra-modi-silicon-valley-digital-india-aadhaar-card-bjp/141199", "ord_in_thread": 0, "title": "Modi US visit: PM Narendra Modi’s digital initiatives certain to charm Silicon Valley", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Column: NaMo to Silicon Valley Column: Can Make in India Go Global? Transitioning to a cashless economy not a walkover It is not surprising that Narendra Modi is the first Indian prime minister in more than three decades to visit Silicon Valley since few of his predecessors were either interested in using technology in the way he is, or had much to offer by way of either expertise or business opportunities. Even before Modi became prime minister, Indian IT firms had established their presence on the international scene, at least at the low end of the market – and firms like GE and Microsoft already had R&D centres doing reasonable quality work here. As Nasscom’s recent study points out, while the Indian tech industry has invested $2 billion in the US between FY11 and FY13 – and $8.2 billion in operational expenditure in FY13 alone – it created 4.1 lakh jobs in the US in FY15, of which 3 lakh were for US nationals and green card holders; between FY11 and FY15, a total of $20 billion have been paid by way of taxes to the US government and another $6.6 billion by way of social security contributions. Over a period of time, the quality of Indian tech has improved vastly, which is why US money is finding its way into Indian startups – you have to visit Bengaluru only once to see how tech is progressing, there is even an Indian team participating in Google ’s Moon 2.0 programme; indeed, Modi will be speaking at an event in San Jose which showcases the innovation of Indian startups.\nNandan Nilekani’s Aadhaar card took this a step forward and firmly established the Indian government’s credentials as a low-cost innovator with huge potential for scaling up – once the biometrics-driven Direct Benefits Transfer (DBT) programme takes off, it will be the only one of its type in the world with such scale. While adopting Nilekani’s Aadhaar, Modi has added a few more layers on top of this. His ambitious 100,000 MW by 2022 solar power target presents a big challenge as well as a big opportunity for US tech firms including Tesla, whose campus he will be visiting. Digital India is another huge opportunity, in terms of both money and technology. Google’s Project Loon, for instance, can play a role in this, and spreading the Internet is also what Facebook’s internet.org is all about. Billions of dollars of equipment will be required when India is fully connected through Digital India, and a large part of it will come from US firms. To achieve its full potential, Digital India will need more satellite technology – US firm Hughes Communications has been trying for half a decade to make a breakthrough here – and it will also mean India will need to spread its telecom network wider, and fix all remaining issues of spectrum etc. Digital locker means government departments will have to truly modernize to be able to give you digital land records, education degrees etc. and Digital India will allow governments – and citizens – to keep tabs on all citizen services across the country, 24/7. In other words, apart from the commercial and philanthropic opportunities this offers techies – both are equally important – Digital India is the essential techie dream of being able to solve the world’s problems using tech, bypassing the messy interface that human beings represent. There’s only one fly in the ointment in this perfect picture – Silicon Valley tends to be more liberal than the Modi government comes across as being; Modi’s Beti Bachao Aandolan goes down well with Silicon Valley but Union minister and Bharatiya Janata Party ( BJP ) leader Mahesh Sharma’s ‘DespiteBeingAMuslim’ represents every bit of bigotry the Valley abhors. It helps, of course, that Modi’s government has been on the politically correct side of the ‘ Net Neutrality ’ debate and quickly withdrew the encryption policy draft that was seen as an instrument of an intrusive state. Though US tech titans posed for pictures with President Xi Jingping just a few days ago, chances are their smiles will be warmer when doing the same with Narendra Modi.\n 25, 2015 2:25 pm", "external_links": ["http://0.freebasics.com/unavailable"], "published": "2015-09-25T22:25:00.000+03:00", "crawled": "2015-09-25T12:35:32.198+03:00", "highlightTitle": ""}