{"organizations": [], "uuid": "e02a3ad3e2705592ab71eb71ffd69ba889c3f3ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/z7Zn9FBhbJ57ANa22NuoGA--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_AP_HEADLINES_BUSINESS/94fa2dde762a332b830f6a7067002d54_original.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/vw-facing-tsunami-legal-trouble-114744087.html", "country": "GB", "title": "VW facing 'tsunami' of legal trouble in emissions scandal - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "VW facing 'tsunami' of legal trouble in emissions scandal - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 3, "uuid": "9cec73f356f901cf11207ed809e61e0a2b705a95"}, "author": "Michael Biesecker and Eric Tucker, Associated Press", "url": "http://finance.yahoo.com/news/vw-facing-tsunami-legal-trouble-114744087.html#post-0", "ord_in_thread": 0, "title": "VW facing 'tsunami' of legal trouble in emissions scandal - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nFILE - In this Sept. 23, 2015 file photo, company logos of the German car manufacturer Volkswagen sit in a box at a scrap yard in Berlin, Germany. Who knew about the deception, when did they know it and who directed it? Those are among questions that state and federal investigators want answered as they plunge into the emissions scandal at Volkswagen that has cost the chief executive his job, caused stock prices to plummet and could result in billions of dollars in fines. Legal experts say the German automaker is likely to face significant legal problems, including potential criminal charges. (AP Photo/Michael Sohn, File) \n\n\nWASHINGTON (AP) -- Who knew about the deception, when did they know it and who directed it?\nThose are among questions that state and federal investigators want answered as they plunge into the emissions scandal at Volkswagen that has cost the chief executive his job, caused stock prices to plummet and could result in billions of dollars in fines.\nLegal experts say the German automaker is likely to face significant legal problems, including potential criminal charges, arising from its admission that 11 million of its diesel vehicles sold worldwide contained software specifically designed to help cheat emissions tests.\nThe Environmental Protection Agency has accused VW of installing sophisticated stealth software that enabled \"clean diesel\" versions of its Passat, Jetta, Golf and Beetle models to detect when they were being tested and emit less-polluting exhaust than in real-world driving conditions. The agency says the \"defeat devices\" allowed those models to belch up to 40 times the allowed amounts of harmful fumes in order to improve driving performance.\nThe Justice Department says it's \"working closely\" with EPA investigators.\n\"If there is sufficient evidence to show that Volkswagen intentionally programmed its vehicles to override the emission control devices, the company and any individuals involved could face criminal charges under the Clean Air Act, and for conspiracy, fraud and false statements,\" said David M. Uhlmann, a former chief of the Justice Department's Environmental Crimes Section who is now a law professor at the University of Michigan. He called criminal charges \"almost certain.\"\nBut Uhlmann cautioned that hauling the executives involved into a U.S. courtroom could be challenging because much of the conduct at issue probably occurred overseas. While the U.S. has an extradition treaty with Germany, European regulators are also now investigating and could claim first dibs on prosecuting company officials.\nIt's not the first time Volkswagen has been accused of cheating on emissions testing by the EPA. In July 1973, the agency found that VW had installed temperature-sensitive devices that turned off emissions controls on about 25,000 Fastback, Squareback and bus models. The company agreed to remove the devices and eventually settled with the Justice Department, paying a $120,000 penalty.\nCEO Martin Winterkorn resigned on Wednesday, and Volkswagen announced it would set aside $7.3 billion to cover the cost of the scandal, but even that may not be enough. The company has apologized, but has not yet detailed who was responsible for the defeat devices.\nGerman media reported Sunday that Volkswagen had received warnings years ago about the use of illegal tricks to defeat emissions tests. Bild am Sonntag said VW's internal investigation has found a 2007 letter from parts supplier Bosch warning Volkswagen not to use the software during regular operation. Frankfurter Allgemeine Sonntagszeitung said a Volkswagen technician raised concerns about illegal practices in connection with emissions levels in 2011.\nA Volkswagen spokesman declined to comment on the reports.\nThe Clean Air Act allows for fines of up to $37,500 for each of the 482,000 suspect VWs sold in the United States, potentially totaling more than $18 billion. Attorneys general for nearly 30 states and the District of Columbia have announced a coordinated investigation and said they are issuing subpoenas for company records.\nThere's also a high likelihood of class-action lawsuits by angry VW owners.\n\"They're facing a tsunami of possible state and federal enforcement actions, and a potential large number of violations — including administrative, civil and criminal,\" said William Carter, a former federal prosecutor in Los Angeles who specialized in environmental crimes and served as general counsel of the California Environmental Protection Agency.\nInvestigators will almost certainly look for any false statements made to the EPA and for signs that VW has tried to conceal wrongdoing or obstruct regulators. Fraud charges could be considered if evidence emerges that company executives used the Internet or the mail system to carry out the deception. And money laundering allegations will be explored if investigators suspect that VW sent illicit proceeds overseas.\n\"If a software package such as this were intentionally designed to defeat the emissions testing, there may well be email traffic, meetings, records that would establish that intent,\" said Gregory Linsin, a former environmental crimes prosecutor at the Justice Department.\nBut Linsin said he expected the Justice Department also to take into account the multiple investigations likely to take place worldwide, and to not punish the automaker in a way that jeopardizes its ability to stay in business.\nThe problems at VW come as the Justice Department faces growing pressure to prosecute individual executives and employees for corporate misdeeds. The last two major criminal investigations against auto companies — Toyota and General Motors — yielded massive fines over car safety problems but has resulted in no prosecutions of executives. Those outcomes dismayed consumer watchdog groups and grieving victims' relatives, who demanded better accountability for failure to disclose vehicle defects.\nA memo this month by Deputy Attorney General Sally Yates sought to reaffirm the Justice Department's commitment to prosecuting employees and executives, directing among other policy mandates that corporations pushing for credit for cooperating with the government must first turn over evidence against individuals.\n\"Volkswagen has a fundamental choice to make,\" said Uhlmann, the former prosecutor. \"That is whether it intends to cooperate and seek leniency, or whether it wants to fight the charges. Every indication over the last several days from Volkswagen is that it intends to cooperate.\"\nAsked whether that meant he expected company executives to voluntarily come to the United States to stand trial, he laughed.\n\"Absolutely not,\" he said.\n___\nAP Auto Writer Tom Krisher in Detroit contributed to this report.\n___\nOnline:\nEPA announcement: http://www3.epa.gov/otaq/cert/violations.htm\n___\nFollow Michael Biesecker: http://twitter.com/mbieseck and Eric Tucker at http://twitter.com/etuckerAP\n___\nThis story has been corrected to show that the last name of the former federal prosecutor in the environmental crimes section is Uhlmann, not Ullmann.\nCompany Legal & Law Matters Volkswagen Environmental Protection Agency Justice Department emission control", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T02:15:00.651+03:00", "highlightTitle": ""}