{"organizations": ["Baker Hughes", "Nike"], "uuid": "dde06eaf45eb14574654b6ac1eb90057b33fc4ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.investors.com", "main_image": "http://www.investors.com/image/Biz03-HAL-0929-newscom.jpg.cms", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=WFT", "section_title": "Yahoo! Finance: WFT News", "url": "http://news.investors.com/092815-772959-halliburton-baker-hughes-assets-for-general-electric.htm?ven=yahoocp&src=aurlled&ven=yahoo", "country": "US", "title": "More Halliburton, Baker Hughes Assets For GE?", "performance_score": 0, "site": "investors.com", "participants_count": 0, "title_full": "More Halliburton, Baker Hughes Assets For GE?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T17:14:00.000+03:00", "replies_count": 0, "uuid": "dde06eaf45eb14574654b6ac1eb90057b33fc4ce"}, "author": "", "url": "http://news.investors.com/092815-772959-halliburton-baker-hughes-assets-for-general-electric.htm?ven=yahoocp&src=aurlled&ven=yahoo", "ord_in_thread": 0, "title": "More Halliburton, Baker Hughes Assets For GE?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stocks Rally On Yellen Comments; Early Rises: Nike, ARM Holdings \nStocks stormed into Friday's session with sharp gains, as the market did its best to shake off a tough week. The Dow Jones industrial average added 1%. The Nasdaq pegged a 0.5% gain. The S&P 500 hauled ahead 0.6%. Volume was mildly higher, up 3% on the Nasdaq and a fraction higher on the NYSE, ... 09/25/2015 10:40 AM ET Microsoft Beats Apple In Cash, Short-Term Investments \nIf cash is king, then Microsoft (NASDAQ:MSFT) wears the crown. Among companies in the S&P 500, Microsoft had the most cash and short-term marketable securities at the end of Q2, to the tune of $96.5 billion. That's up 12.6% from Q2 2014, reports FactSet. General Electric (NYSE:GE) is close ... 09/25/2015 08:02 AM ET GE Signs $12 Bil U.K. Deal \n8 General Electric (NYSE:GE) will receive up to $12 bil in export credit financing from the U.K., supporting up to 1,000 energy jobs there. CEO Jeff Immelt took a thinly veiled shot at Congress, which has yet to renew the Export-Import Bank's charter, calling the U.K. \"pro-export and ... 09/24/2015 06:35 PM ET GE Reminds Lawmakers It's Creating Jobs Overseas \nGeneral Electric (NYSE:GE) will receive from the United Kingdom up to $12 billion in export financing, which will support up to 1,000 energy jobs in that country. The Fairfield, Conn.-based industrial giant said its agreement with the U.K.'s export credit agency will support confirmed and potential ... 09/24/2015 04:40 PM ET Boeing Makes Big Push In China As Xi Visits U.S. \nBoeing (NYSE:BA) is making a big push in one of the fastest-growing aerospace markets, with a plan to open a new 737 plant in China, as the country's president visits the U.S. Pope Francis isn't the only foreign dignitary in America this week. China's Xi Jinping visited a Boeing facility near ... 09/23/2015 04:41 PM ET Shell Joins Other Oil Majors Halting Arctic Drilling \nCiting \"clearly disappointing\" results from a pivotal well in the Chukchi Sea, Royal Dutch Shell (NYSE:RDSA) pulled the plug on its Arctic oil and gas exploration off the Alaskan coast. The oil giant said in a statement that it will halt its offshore Alaskan operations \"for the foreseeable future.\" ... 11:29 AM ET Whole Foods Will Cut 1,500 Jobs Amid Changing Market \nWhole Foods Market (NASDAQ:WFM) said in an SEC filing Monday that it will cut about 1,500 jobs, or 1.6% of its workforce, over the next eight weeks as it lowers sticker prices and invests in technology. The upscale grocer said it will pay affected employees in full during that time as they ... 10:55 AM ET Energy Transfer Gets Williams Deal On Second Try \nPipeline company Energy Transfer Equity (NYSE:ETE) will purchase Williams Cos. (NYSE:WMB), another pipeline company, in a $32.6 billion deal. Under the agreement announced Monday, Williams shareholders will get $43.50 per share, or 1.97 shares of Energy Transfer, or a combination of the two. ... 10:30 AM ET Citigroup, AbbVie Upgraded; Apple Supplier Qorvo Cut \nBanking giant Citigroup (NYSE:C) and biotech AbbVie (NYSE:ABBV) received analyst upgrades early Monday, while Apple (NASDAQ:AAPL) chip supplier Qorvo (NASDAQ:QRVO) was downgraded. Jefferies upgraded Citigroup to buy with a 60 price target, while Credit Suisse upgraded the stock to outperform and ... 09:13 AM ET Nike, CyberArk Among 4 IBD 50 Stocks On China Watch \nAll eyes are on China as President Xi Jinping continues his U.S. visit. This week's IBD 50 roundup offers several top-rated stocks with exposure, in some form or another, to the world's No. 2 economy. Nike The sportswear giant crushed Q1 estimates late Thursday with a 23% earnings rise to $1.34 a ... 09/26/2015 08:02 AM ET", "external_links": [], "published": "2015-09-28T17:14:00.000+03:00", "crawled": "2015-09-28T18:53:48.120+03:00", "highlightTitle": ""}