{"organizations": [], "uuid": "66527cc9cef4162e2c5e448b43ecaa7023bc9b1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://www.modernghana.com/logo/final_log.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/645085/1/dont-victimise-workers-with-e-salary-voucher-manag.html", "country": "US", "title": "Don't victimise workers with e-salary voucher - Manager", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Don't victimise workers with e-salary voucher - Manager", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T19:00:00.000+03:00", "replies_count": 0, "uuid": "66527cc9cef4162e2c5e448b43ecaa7023bc9b1a"}, "author": "", "url": "http://www.modernghana.com/news/645085/1/dont-victimise-workers-with-e-salary-voucher-manag.html", "ord_in_thread": 0, "title": "Don't victimise workers with e-salary voucher - Manager", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  25 September 2015 17:00 CET Don't victimise workers with e-salary voucher - Manager By GNA \nCape Coast, Sept. 23, GNA - Mr Kenneth Owusu Ababio, the Project Data Manager of the Electronic Salary Payment Voucher (E-SPV), has cautioned heads of department and other stakeholders not to use the system to unduly punish their staff. \nThe E-SPV is an electronic version of the paper salary payment voucher that must be validated within real-time and securely through the internet before salaries are paid. \nIt is being implemented by the Controller and Accountant General's Department (CAGD) to improve upon the management of public sector payroll. \nHe said it was wrong to use personal scores as a head of department to declare any member of staff as 'unknown' during the validation period which made it impossible for the said staff to receive his or her salary for a particular month. \nMr Ababio said this on Tuesday at a two-day training workshop for management units, Human Resource managers, accountants and district directors of the various institutions in the Abura Asebu Kwamankese District as a mop-up for staff who could not register in Cape Coast. \nHe said the system was being implemented to ensure that ghost names were removed from the payroll but not a platform for heads of departments to victimise and unduly punish their staff. \nHe urged the heads of departments to act professionally and stressed that the necessary investigations would be conducted before people who were declared unknown during the validation were denied their salary. \nMr Richard Aidoo, the Project Co-ordinator, who took the participants through the E-SPV, explained that it allowed for easy validation and submission of salary payment vouchers on-line to the Controller and Accountant-General's Department before salaries were computed and paid. \nHe said the introduction of the E-SPV had helped to reduce the number of ghost names on government pay roll and encouraged the participants to take the exercise seriously. \nMr Aidoo said the new policy directive had successfully been implemented in seven regions and that effective October 2015, salaries would be processed for government workers and MDAs/MMDAs in the Central Region that validated and certified the E-SPV sent to them by the CAGD. \nHe pointed out that electronic salary payment voucher validation would, therefore, occasion a transition from the paper salary voucher to an electronic salary system as an inherent motivation to ensure that government workers were paid based on the number of days reported to work. \nThe participants were trained on 10 Simple Steps of Validation, Salary Payment Voucher and Reports on the E-SPV System and E-SPV Monitoring. \nGNA", "external_links": [], "published": "2015-09-25T19:00:00.000+03:00", "crawled": "2015-09-26T13:53:55.745+03:00", "highlightTitle": ""}