{"organizations": [], "uuid": "1a21054751e4db9e4507a2a972197d18157d7a7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/why-bt-likely-hanging-openreach-211257475.html", "country": "US", "title": "Why BT is likely to be hanging on to Openreach", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why BT is likely to be hanging on to Openreach", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T00:12:00.000+03:00", "replies_count": 0, "uuid": "1a21054751e4db9e4507a2a972197d18157d7a7a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-bt-likely-hanging-openreach-211257475.html", "ord_in_thread": 0, "title": "Why BT is likely to be hanging on to Openreach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Sep 20, 2015, 22:24 BST - UK Markets closed Why BT is likely to be hanging on to Openreach By Christopher Williams | Telegraph – 11 minutes ago Print \nAs it looks to the next 10 years in its review, Ofcom should be thinking of how to deliver full fibre \nGood news for BT, the wider telecoms industry, the economy and the public came over the weekend, when the shadow chancellor, John McDonnell, said in a newspaper interview that it was “too late” to renationalise the former state monopoly, although he admitted he’d “love to”. \nApparently, even Corbynomics cannot deny the success of the market in delivering value to customers over the past 31 years. \nThe industry is still wrestling with one legacy of state ownership, however. BT is still both landlord and tenant of the national telecoms network, a state of affairs that rivals claim harms service and is allowing the company to rebuild its dominance. \nTomorrow morning, BT will gather politicians and policy wonks, industry bigwigs and regulators at the City’s newest skyscraper, to battle the calls for it to be broken up. The upper floors of the 224m \"Cheesegrater\" should offer a good visual metaphor for the high stakes faced by the company and its network unit, Openreach. \nTo briefly recap: Ofcom is conducting a once-a-decade review of the whole communications market. The regulator is considering how to protect competition in the broadband market and encourage more investment in the better internet infrastructure that businesses and consumers need. One option is to recommend that BT is split up, with Openreach made a separate company . \nThe row over the future of broadband between BT and its rivals escalated sharply last week. Joe Garner, Openreach’s chief executive, wrote in these pages that a split would be “a huge mistake” , threatening broadband upgrade plans. \nHis argument drew an aggressive response from Sky, a company normally shy to join public rows over regulation. Its chief strategy officer, Mai Fyfield, wrote that BT had damaged broadband service by cutting investment . She suggest that Sky could help directly finance upgrades if Openreach were independent. \nTomorrow, BT will try to regain the initiative. Its event is likely to involve much discussion of G.fast, the technology it plans to use for the next broadband upgrade, from superfast to “ultrafast”. Currently in trials in Cambridgeshire, G.fast uses some clever signalling kit to pump more data into the existing copper wires. \nBT clearly believes G.fast is its most potent positive argument against break-up. Perhaps. But telecoms operators in France, Spain, Italy and Germany are ditching copper in favour of fibre-optic lines. These are more expensive, but also more reliable and future-proof in terms of volume. So as it looks to the next 10 years, Ofcom should be thinking of how to deliver full fibre. If Openreach is more likely to build it as an independent company, that should weigh heavily in favour of a break-up of BT . \nThe demand is already starting to build. At the Royal Television Society conference in Cambridge last week, for example, there was a call for such infrastructure investment on behalf of production companies, who rely on broadband for shifting large video files. That industry, an area of strength for Britain, is at the forefront of digitisation, but the trends will filter through the whole economy, threatening a digital bottleneck. \nThis is not to say Openreach would never build a true fibre network as part of BT, just that the relative chances ought to be a big part of Ofcom’s calculations. The question should be: under what structure would Openreach respond best to the inevitable demand? \nAlthough BT is taking nothing for granted, the consensus of City analysts remains that a split is unlikely. There are good reasons to believe them; not least the £7bn pension deficit that would fall on the taxpayer if an independent Openreach could not make top-up payments. Disentangling BT could take years and politicians would have to factor in the risk to G.fast upgrades and to Openreach’s day-to-day running from the inevitable distractions of a break-up. \nBut not all the realpolitik is in BT’s favour. Openreach is widely resented by MPs, and especially by those in rural constituencies where broadband is slowest and least reliable. Delays to installations and repairs are among the most common problems brought into constituency surgeries, which doesn’t help BT make friends at Westminster. A chancellor planning a leadership run might think tackling Openreach would be a good way to court the support of his Parliamentary colleagues. \nThe other underplayed factor in the debate to date, which ought to be giving BT cause for concern, is the deregulatory enthusiasm of Ofcom’s chief executive , Sharon White. She, of course, has expressed no view on which way her market review should go, but has signalled a bias towards cutting red tape where possible. \nIn the telecoms market, reams of regulation surround BT and Openreach, and are added to every year. Formally splitting the company would get rid of more regulation than any other action White could pursue when the review sets out its initial findings at the end of the year. The argument sometimes made by BT and its defenders that Openreach does not require change because it is very heavily regulated may be somewhat self-defeating. \nYou have to wonder whether Gavin Patterson, BT’s chief executive, hasn’t privately wished he could voluntarily sell off Openreach. That would be impossible given the company’s mostly conservative shareholders, and BT will fight hard over the next few months to remain intact.", "external_links": [], "published": "2015-09-21T00:12:00.000+03:00", "crawled": "2015-09-21T00:24:58.911+03:00", "highlightTitle": ""}