{"organizations": [], "uuid": "5a56d14fdf45fc8b004b418a776f2bf604b8b31e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/", "section_title": "Forbes - Personal Finance Information and Personal Finance News - Forbes.com", "url": "http://www.forbes.com/sites/michaelkay/2015/09/29/the-30-daay-money-c-h-o-i-c-e-challenge/", "country": "US", "title": "The 30-Day Money C-H-O-I-C-E Challenge", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "The 30-Day Money C-H-O-I-C-E Challenge", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T21:37:00.000+03:00", "replies_count": 0, "uuid": "5a56d14fdf45fc8b004b418a776f2bf604b8b31e"}, "author": "Michael F. Kay", "url": "http://www.forbes.com/sites/michaelkay/2015/09/29/the-30-daay-money-c-h-o-i-c-e-challenge/", "ord_in_thread": 0, "title": "The 30-Day Money C-H-O-I-C-E Challenge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ever looked at your stack of bills and wonder how the heck you're going to get these paid?How did that feel? Rotten, right? Of course it did. No wants to live with the weight of debt—to carry that hopeless frustration deep into their bones.Remaining in a state of money misery is a decision you make. The reality is, there is a way out and you hold the answer. It’s spelled c-h-o-i-c-e. Where you are the active owner of what comes in, what gets spent and what gets saved.Taking control of your money life is a choice. You can do it or not. If you choose 'not' then you are buying into magical thinking that somehow, it will all turn out all right—a miracle will happen where some mysterious power of the Universe will give you the winning lottery numbers. The only thing wrong with this thinking is that it's delusional.And you don’t want to live in denial. Quite the opposite. You’re ready to take this bull by the horns.So join me in a 30-day money c-h-o-i-c-e challenge for October. Here’s what I mean by choice: C —Cut unnecessary costs. You KNOW the difference between a need and a want. Shift your thinking to what is in YOUR best interest. You are savvy enough—and strong enough—to ignore what “people” will say if you change your spending. You choose financial security over satisfying the judgment of others. H —Hold the line on spending on those small purchases you buy without thinking: breakfast to eat on your way to the office, name brand commodities (is name brand TP really worth a 3x mark-up?). Every little bit counts. Sure, that latte is ONLY $5, but that $5 every day is $25 per week and $1,300 per year. If you're a 7-day-a-weeker, that's $1,825 per year. 20 years of that habit at 6% is over $71,000. For coffee. O —Outgo has to be less than inflow. Being cash flow positive means you spend less than you make. That's your goal, every pay period. Start with some simple math—what are you bringing in and what’s going out? Be brutally honest with yourself here—deficit spending is not sustainable for very long. What can you change to bring your spending in line with your income? Hint: you always want to make room for saving too. I —Invest the time to understand what really matters to you. That’s what will help fuel your choices on spending and savings and what you can live without. If spending time with your family is critical, then it’s not about a pricey vacation, but simple time together. It might feel painful to make these decisions at first, but they’ll start to build your financial muscle. C —Cash beats credit. The easiest way to monitor what you spend is to use cash. Until you have control over your spending, use cash at the grocery store, the mall and out with your friends. You'll see how your decisions change when there's a fixed amount in your wallet. Some things just won’t make the cut. E —Exchange old habits for new ones. Swap dinner at a swanky restaurant for an impromptu picnic. Trade cable’s 700+ channels for Netflix with a side of Hulu. Decide to keep your two-models-old phone and stash the difference in your emergency fund. Give yourself permission to make small, meaningful changes that empower your success and happiness (and leave money left over after you’ve paid your bills).You don’t have to do every item—in fact I urge you to pick just one and make it stick for the entire 30 days.Yep—30 days. Just long enough to try it on for size and decide if it fits. Start today and by October 30, see where you are. What have you learned? What walls did you hit? I invite you to comment below or email me with your results, comments and experience.What do you have to lose, except some misery?", "external_links": [], "published": "2015-09-29T21:37:00.000+03:00", "crawled": "2015-09-29T17:03:16.418+03:00", "highlightTitle": ""}