{"organizations": ["National Association of Automobile Manufacturers", "Naamsa"], "uuid": "98abef74afdeca4b49abc2d3a09ec2f902988a15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509021507.html", "country": "US", "title": "South Africa: Rate Hike, Rand Rout Hits New Car Sales", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Rate Hike, Rand Rout Hits New Car Sales", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T17:40:00.000+03:00", "replies_count": 0, "uuid": "98abef74afdeca4b49abc2d3a09ec2f902988a15"}, "author": "", "url": "http://allafrica.com/stories/201509021507.html", "ord_in_thread": 0, "title": "South Africa: Rate Hike, Rand Rout Hits New Car Sales", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The slowing new car market was despite attractive incentive packages on offer by most automotive companies, said the National Association of Automobile Manufacturers of South Africa (Naamsa). \nOn the positive side, vehicle exports continued to reflect upward momentum. \nIndustry new vehicle exports registered further growth compared to the corresponding month last year rising by 12.3%. \n\"Vehicle exports for 2015 remained on target to improve, in annual terms, by about 20% to a projected industry record export number of about 330 000 for the year (2014: 276 873 export units),\" Naamsa said. \nVehicle manufacturers with substantial export sales were cushioned to some extent against the impact of the weaker exchange rate. \nSimphiwe Nghona, CEO of WesBank's Motor Division said consumers and business have been under pressure all year, but July's interest rate hike and the rand's dismal performance this past month have taken a toll on the new vehicle market. \n\"New vehicle sales are regarded as a leading indicator for the country's GDP. Looking at the monthly sales, which continues to trend downwards, it could be an ominous sign of things to come.\" \nLatest figures showed GDP contracted by 1.3% in the second quarter of 2015, raising the risk of the economy tipping into a technical recession in the third quarter of 2015. \nNaamsa said the latest vehicle sales figures showed that the recession in the domestic new vehicle sales had accelerated during August 2015. \nThe industry body warned in a statement that the trend was likely to continue over the medium term compounded by declining business confidence and consumer sentiment. \nDomestic sales of new light commercial vehicles, bakkies and mini buses reflected a year-on-year decline of 7.8% for August. \nSales of vehicles in the investment dependent medium and heavy truck segments of the industry had registered double digit decreases. \n\"Medium commercial vehicle and heavy commercial vehicle sales, reflected a fall of 11.2% and 17.9% respectively year-on-year,\" said Naamsa. \nSource: Fin24", "external_links": [], "published": "2015-09-02T17:40:00.000+03:00", "crawled": "2015-09-02T20:24:58.127+03:00", "highlightTitle": ""}