{"organizations": [], "uuid": "7782ca2e9c05c9fca8cc96efbd4b74123011d0d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/22/590x/corbyn-604725.jpg", "site_section": "http://express.co.uk//posts/rss/21/finance", "section_title": "Daily Express :: Finance Feed", "url": "http://www.express.co.uk/finance/city/604725/Jeremy-Corbyn-Labour-leadership-business-city-economy-disaster", "country": "", "title": "Corbyn's election branded DISASTER for Britain that could already be damaging our economy", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Corbyn's election branded DISASTER for Britain that could already be damaging our economy", "spam_score": 0.0, "site_type": "news", "published": "2015-09-12T15:07:00.000+03:00", "replies_count": 0, "uuid": "7782ca2e9c05c9fca8cc96efbd4b74123011d0d4"}, "author": "", "url": "http://www.express.co.uk/finance/city/604725/Jeremy-Corbyn-Labour-leadership-business-city-economy-disaster", "ord_in_thread": 0, "title": "Corbyn's election branded DISASTER for Britain that could already be damaging our economy", "locations": ["Britain", "UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JEREMY CORBYN", "Corbyn"], "text": "Corbyn's election branded DISASTER for Britain that could already be damaging our economy Corbyn's election branded DISASTER for Britain that could already be damaging our economy JEREMY CORBYN'S election as Labour leader is a threat to Britain's fragile economy which will lead to increased poverty and unemployment, a top finance expert has warned today. PUBLISHED: 13:07, Sat, Sep 12, 2015 | UPDATED: 13:22, Sat, Sep 12, 2015 GETTY/REUTERS Mr Corbyn has been branded a disaster for the UK economy \nThe veteran-left winger's appointment was attacked as a serious dent to confidence in British business just minutes after he left the podium to rapturous applause in London. \nIn a savage condemnation Nigel Green, the chief executive of finance giant deVere Group, slammed Mr Corbyn's economic policies as disastrous and said his election would make investors nervous because it indicates that Britain could be lurching to the left. \nHe blasted: \"The victory of this hard-Left socialist as Leader of Her Majesty’s Opposition is, I suspect, going to prove to be a major issue for global investors. \n“Corbyn’s economic policies fly in the face of the message that ‘Britain is open for business’. They would be detrimental to Britain’s hard-earned and invaluable pro-business reputation.\" REUTERS Mr Corbyn triumphed in today's Labour leadership election \nThe veteran socialist scored a landmark victory against his more moderate opponents today to become Labour's most radical leader since Michael Foot after galvanizing a huge fanbase of left-wing supporters. \nHis economic policies include a hike on the top level of tax, capping the amount that people can earn, scrapping tax relief deals designed to encourage British businesses to expand and renationalising industries including energy and the railways. \nMr Green said: “So-called Corbynomics, whereby everyone would pay more tax to pay for hugely increased public spending, would backfire spectacularly. \n“He seems utterly determined to drag Britain back to the 1970s, an era in which the UK was strangled by high taxes and an inflexible labour market. \n“Mr Corbyn seems so far removed from reality that he is unwilling or unable to accept that if you significantly increase taxes and disincentivise work and investment, people will change their behaviours. Related articles", "external_links": [], "published": "2015-09-12T15:07:00.000+03:00", "crawled": "2015-09-12T16:21:39.437+03:00", "highlightTitle": ""}