{"organizations": [], "uuid": "0fbf5a109eeda4f0a73678470fbe403dd896bd1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/091615_bud_miller_600.jpg", "site_section": "http://www.philly.com/philly/business/personal_finance", "section_title": "Personal Finance, Money and Investing Advice at Philly.com ", "url": "http://www.philly.com/philly/business/20150916_ap_cdc5b87f466748b6ba978ac8b69ea385.html", "country": "US", "title": "World's top brewers eye tie-up that would join Bud, Miller", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "World's top brewers eye tie-up that would join Bud, Miller", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "0fbf5a109eeda4f0a73678470fbe403dd896bd1f"}, "author": "DANICA KIRKA,", "url": "http://www.philly.com/philly/business/20150916_ap_cdc5b87f466748b6ba978ac8b69ea385.html", "ord_in_thread": 0, "title": "World's top brewers eye tie-up that would join Bud, Miller", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (AP) - The world's two biggest brewers could be joining forces after Anheuser-Busch InBev, the maker of Budweiser and Corona, said Wednesday it has made a takeover approach to SABMiller Plc, the owner of Miller Genuine Draft and Peroni.\nWhile no specific offer has yet been made, stock in SABMiller rocketed 22 percent higher on the news. That indicates investors expect the deal to value the company at around $90 billion. Shares of AB InBev rose 7 percent.\nThe combined company would have a market capitalization of some $275 billion and be by far the largest brewer in the world. That could potentially draw objections from regulators worried the deal might stifle competition and lead to higher prices for consumers.\n\"AB InBev's intention is to work with SABMiller's Board toward a recommended transaction,\" the Leuven, Belgium-based company said in a statement. \"There can be no certainty that this approach will result in an offer or agreement, or as to the terms of any such agreement.\"\nThe beer industry has seen years of consolidation as brewers seek to sustain growth amid changing tastes that have seen consumers gravitate toward craft beers and wine. AB InBev and SABMiller are themselves products of this combining trend.\nSABMiller became the world's second-biggest brewer in 2002, when South African Breweries took over Miller Brewing Co., based in Milwaukee, Wisconsin.\nBuying SABMiller would strengthen AB InBev's position in fast-growing economies in Africa and Asia. SAB Miller employs about 69,000 people in more than 80 countries, from Australia to Zambia, Colombia and the Czech Republic.\nThe company, now based in London, said Wednesday that it \"would review and respond as appropriate to any proposal which might be made.\"\nAB InBev was created in 2008 when Brazilian-Belgian brewer InBev bought U.S. icon Anheuser Busch Cos. The company has operations in 25 countries and makes more than 200 beers, including Stella Artois and Beck's.\nSABMiller sold 324 million hectoliters (8.56 billion gallons) of lager, soft drinks and other alcoholic beverages in the year ended March 31, generating group net producer revenue of $26.2 billion. AB InBev, by contrast, sold 459 million hectoliters and had revenue of $47.06 billion.\nUnder U.K. takeover rules, AB InBev has until 5 p.m. on Oct. 14 to make an offer for SABMiller or walk away.", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T19:41:46.809+03:00", "highlightTitle": ""}