{"organizations": [], "uuid": "ed605fe24e24c43a0771dd1be93c8552bf759875", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "articles.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/49061952.cms", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358311.cms", "section_title": "Finance-Banking/Finance-Industry-The Economic Times", "url": "http://articles.economictimes.indiatimes.com/2015-09-22/news/66792397_1_citrus-payment-wallet-qwikcilver", "country": "IL", "title": "Citrus pay to tie up with Woohoo for offline wallet payments", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Citrus pay to tie up with Woohoo for offline wallet payments - timesofindia-economictimes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "ed605fe24e24c43a0771dd1be93c8552bf759875"}, "author": "timesofindia.indiatimes.com", "url": "http://articles.economictimes.indiatimes.com/2015-09-22/news/66792397_1_citrus-payment-wallet-qwikcilver", "ord_in_thread": 0, "title": "Citrus pay to tie up with Woohoo for offline wallet payments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI: Payments solution provider Citrus Pay is tying up with Woohoo, a gifting and shopping portal to enable its customers to use their wallet offline at retail outlets and restaurants across the country.\nThis would allow Citrus wallet users to shop at more than 5000 stores listed with Woohoo both online as well as offline. Citrus wallet users can preload a gift card with cash from the wallet and use the card as a debit card at the point of sales at stores.\nWoohoo is the consumer usage application of Qwikcilver technology platform which has Helion, Accel partners and Amazon Venture Capital Fund as its funding partners. Woohoo manages 5 million transactions everyday. Qwikcilver powers the entire gift card business of all the major retail outlets of the country like Shoppers Stop, Lifestyle, Pantaloons and many others.\n\"Through this partnership the 17 million Citrus wallet users can buy something from a physical store and still use the citrus wallet. He can use the Woohoo application on his phone which is integrated with the Citrus wallet to generate a bar code or use the e-gift card from Woohoo at the counter to make the payment,\" said Citrus Payment Solutions managing director, Jitendra Gupta.\nGupta said that this is aimed at addressing the 95% of the transactions that still happens offline thereby making shopping experience for citrus wallet users seamless.\nCitrus, a merchant payment company, which recently missed out on getting a payments bank licence from the Reserve Bank, is planning various measures to expand its business opportunities in the payments space. Besides tying up with other online service providers, Citrus is also planning to tie up with around three banks to scale-up its operations.\n\"We have got the Woohoo application embedded with the Citrus payment system, this enables our users to choose from an additional means of payment for shopping and gifting,\" said Pratap T.P co-founder and chief marketing officer, Qwikcilver.\nThat the demand for m-wallets is growing is visible from the Reserve Bank of India data that shows that transactions in July rose to 5.36 crore from 4.73 crore a month ago while the value rose by Rs 161 crore from Rs 1268 crore last month. \n\n\n ", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-27T16:53:19.073+03:00", "highlightTitle": ""}