{"organizations": ["Calvin Klein Accessories", "Warner", "Reacquire Calvin Klein Platinum Label Accessories License", "Calvin Klein Asia Pacific", "EL Goh", "Inc", "Inc.", "CK21 Holdings Pte. Ltd.", "PVH", "PVH Corp.", "United States Calvin Klein, Inc.", "Global Communications", "Calvin Klein Asia", "Securities and Exchange Commission"], "uuid": "6d44f92709690cf746647a0f9dc229907ef3dff5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/calvin-klein-inc-reacquire-calvin-klein-platinum-label-accessories-lic/45098", "country": "US", "title": "Calvin Klein, Inc. to Reacquire Calvin Klein Platinum Label Accessories License from CK21", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Calvin Klein, Inc. to Reacquire Calvin Klein Platinum Label Accessories License from CK21", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T07:23:00.000+03:00", "replies_count": 0, "uuid": "6d44f92709690cf746647a0f9dc229907ef3dff5"}, "author": "", "url": "http://businesswireindia.com/news/news-details/calvin-klein-inc-reacquire-calvin-klein-platinum-label-accessories-lic/45098", "ord_in_thread": 0, "title": "Calvin Klein, Inc. to Reacquire Calvin Klein Platinum Label Accessories License from CK21", "locations": ["Philippines", "Taiwan", "Hong Kong", "New York", "Thailand", "Malaysia", "Singapore", "Indonesia", "Australia", "New Zealand", "China", "South Korea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alexandra Wagner", "Sean John", "MICHAEL Michael Kors", "Olga", "Van Heusen", "Kenneth Cole", "Tommy Hilfiger", "Steve Shiffman", "Calvin Klein", "Ike Behar", "Geoffrey Beene", "Calvin Klein Asia", "Ulrich Grimm", "Rod Manley"], "text": "Friday, September 4, 2015 9:53AM IST (4:23AM GMT) Calvin Klein, Inc. to Reacquire Calvin Klein Platinum Label Accessories License from CK21 New York, United States Calvin Klein, Inc., a wholly owned subsidiary of PVH Corp. (NYSE:PVH), announced its plans to reacquire the existing license agreement held by CK21 Holdings Pte. Ltd. for all production and sale of Calvin Klein platinum label men’s and women’s accessories. This agreement includes sale in free-standing Calvin Klein platinum accessories stores in China, Hong Kong, Taiwan, Singapore, Malaysia, Thailand, Philippines, Indonesia, Australia, New Zealand and South Korea. As part of the transaction, the Calvin Klein Asia business will also take over certain of CK21’s free-standing Calvin Klein Accessories stores and shop-in-shops. Additionally, Calvin Klein Asia will assume production of Calvin Klein platinum men’s and women’s accessories products for sale within CK21-operated free-standing Calvin Klein platinum label apparel stores and shop-in-shops within the Australia, Hong Kong, Indonesia, Malaysia, Singapore, Taiwan and Thailand regions. “We are excited about the long term opportunity presented by taking back this business, as it allows us to better optimize the synergies of the Calvin Klein platinum label accessories business together with our broader accessories business, under the creative direction of Ulrich Grimm, Global Creative Director of Shoes and Accessories for Calvin Klein ,” said Steve Shiffman , Chief Executive Officer of Calvin Klein, Inc. “The development also aligns with our strategy to further enhance the Calvin Klein brand in the region by leveraging our Calvin Klein Asia Pacific infrastructure. CK21 continues to be a strong partner for us with Calvin Klein platinum apparel and we look forward to continuing our relationship.” “We believe our longstanding relationship with Calvin Klein has allowed us to drive significant growth in the market over the last several years, and we feel that Calvin Klein taking over the platinum label accessories business will allow them to better leverage their existing accessories business as well as other lines of their business,” said EL Goh, Regional General Manager of CK21. Calvin Klein, Inc. is one of the leading fashion design and marketing studios in the world. It designs and markets women’s and men’s designer collection apparel and accessories, and a range of other products that are manufactured and marketed through an extensive network of licensing agreements and other arrangements worldwide. Product lines under the various Calvin Klein brands include women’s dresses and suits, men's dress furnishings and tailored clothing, men’s and women's sportswear and bridge and collection apparel, golf apparel, jeanswear, underwear, fragrances, eyewear, women’s performance apparel, hosiery, socks, footwear, swimwear, jewelry, watches, outerwear, handbags, small leather goods, and home furnishings (including furniture). For more information, please visit calvinklein.com. PVH Corp., one of the world’s largest apparel companies, owns and markets the iconic Calvin Klein and Tommy Hilfiger brands worldwide. It is the world’s largest shirt and neckwear company and markets a variety of goods under its own brands, Van Heusen , Calvin Klein , Tommy Hilfiger , IZOD , ARROW , Warner’s and Olga, and its licensed brands, including Speedo , Geoffrey Beene , Kenneth Cole New York , Kenneth Cole Reaction , MICHAEL Michael Kors , Sean John , Chaps ,and Ike Behar . SAFE HARBOR STATEMENT UNDER THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995: Forward-looking statements made in this release, including, without limitation, statements relating to the future plans, strategies, objectives, expectations and intentions of PVH Corp. and its subsidiaries (collectively, “PVH”) are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Investors are cautioned that such forward-looking statements are inherently subject to risks and uncertainties, many of which cannot be predicted with accuracy, and some of which might not be anticipated, including, without limitation, the following: (i) PVH’s plans, strategies, objectives, expectations and intentions are subject to change at any time at its discretion; (ii) in connection with the acquisition of Tommy Hilfiger B.V. and certain affiliated companies, PVH borrowed significant amounts and will have to use a significant portion of its cash flows to service such indebtedness, as a result of which PVH might not have sufficient funds to operate its businesses in the manner it intends or has operated in the past; (iii) acquisitions and issues arising with acquisitions and proposed transactions, including without limitation, the ability to integrate an acquired entity, into PVH with no substantial adverse effect on the acquired entity’s or PVH’s existing operations, employee relationships, vendor relationships, customer relationships or financial performance; and (iv) other risks and uncertainties indicated from time to time in PVH’s filings with the Securities and Exchange Commission. The Company does not undertake any obligation to update publicly any forward-looking statement, whether as a result of the receipt of new information, future events or otherwise. EDITORIAL CREDIT: calvinklein.com SOCIAL MEDIA – GLOBAL: facebook.com/calvinklein; calvinklein.tumblr.com; google.com/+calvinklein; youtube.com/calvinklein; twitter.com/calvinklein; instagram.com/calvinklein; pinterest.com/calvinklein; show yours. #mycalvins; brand handle: @calvinklein View source version on businesswire.com: http://www.businesswire.com/news/home/20150903005120/en/ For News Release background on Calvin Klein, Inc. click here Media Contact Details CONTACTS : Calvin Klein, Inc. Rod Manley, 212-292-9795 EVP, Global Communications rodmanley@ck.com or Calvin Klein, Inc. Alexandra Wagner, 212-292-9794 VP, Corporate Communications alexandrawagner@ck.com", "external_links": [], "published": "2015-09-04T07:23:00.000+03:00", "crawled": "2015-09-04T10:57:51.135+03:00", "highlightTitle": ""}