{"organizations": [], "uuid": "f3f55323ace54bfba0b858b2874b2855e71d5987", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/09/prweb12945087.htm", "country": "US", "title": "Trillium Family Services Announces Grand Opening of Oregon's New, State-of-the-Art Mental Health Treatment Center for Youth", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Trillium Family Services Announces Grand Opening of Oregon's New, State-of-the-Art Mental Health Treatment Center for Youth", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "f3f55323ace54bfba0b858b2874b2855e71d5987"}, "author": "Logan Lynn", "url": "http://www.prweb.com/releases/2015/09/prweb12945087.htm", "ord_in_thread": 0, "title": "Trillium Family Services Announces Grand Opening of Oregon's New, State-of-the-Art Mental Health Treatment Center for Youth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In 2005, the Department of Human Services (DHS) closed its Secure Adolescent Inpatient Program (SAIP) at the Oregon State Hospital (OSH) and awarded the contract to serve this population of children ages 14-17 years with intensive mental health needs to Trillium Family Services and its Children’s Farm Home campus in Corvallis. In the ten years that Trillium has been the state’s sole provider of SAIP services, outcomes for these children have dramatically improved.\nTrillium has completely eliminated the use of mechanical and chemical restraints, which were behavioral interventions routinely used at the OSH. Trillium has reduced the average length of stay by 29% since taking over the program.\nTrillium delivers SAIP at less than 40% of the cost compared to OSH, saving Oregon taxpayers about $80 million compared to the cost if the State was still providing the program during this period.\nWhile the effectiveness of Trillium’s delivery of SAIP and the exceptional outcomes it produces are unquestioned, the facilities on its Corvallis campus are no longer adequate to serve this increasingly challenging and at times violent youth population. The buildings do not provide the security and function required to keep both children and staff safe, and the need for new facilities is urgent so that Trillium may continue delivering outstanding, often life-saving treatment to teenagers at the highest level of mental health acuity in the state.\nAs such, Trillium is planning the construction of three 16-bed, state-of-the-art treatment units on its Corvallis campus, which would result in 48 beds of upgraded capacity for these youth.\nThe SAIP program is a true partnership between Trillium and the State of Oregon, since the State has a statutory responsibility to provide a hospital level of care for adolescents at this degree of mental health acuity – and that responsibility is fulfilled solely through its contract with Trillium. Due to the nature of our partnership, we believe that an equal public-private commitment is necessary and appropriate to fund the project.\nIn July of 2015 the Oregon State Legislature approved $3 million at the close of the legislative session for the second phase of Trillium’s Secure Adolescent Inpatient Program (SAIP) replacement facility project. The State will fund this commitment through lottery bonds.\nOn October 5th, 2015 Trillium Family Services will unveil phase 1 of their new, state-of-the-art treatment center for youth at the Children’s Farm Home in Corvallis. Tours will be provided and refreshments served. The Children’s Farm Home is located at 4455 NE Highway 20 in Corvallis.\n visit http://www.TrilliumFamily.org", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5UcmlsbGl1bUZhbWlseS5vcmc=", "http://t2652519.omkt.co/track.aspx?id=402|287967|8F88|0|2DC|0|3E6|1|480DA0D7&destination=http%3a%2f%2fwww.TrilliumFamily.org&dchk=27FFA8B6"], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-05T02:30:18.460+03:00", "highlightTitle": ""}