{"organizations": [], "uuid": "23139f0c661038725702b057386fb38a6eb494ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/c/p/d/b/image.related.afrArticleLead.620x365.gjd4qv.png/1441175527214.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/australians-will-still-rely-on-age-pension-actuaries-institute-report-says-20150902-gjd4qv", "country": "AU", "title": "Australians will still rely on age pension, Actuaries Institute report says", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Australians will still rely on age pension, Actuaries Institute report says | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T09:27:00.000+03:00", "replies_count": 0, "uuid": "23139f0c661038725702b057386fb38a6eb494ea"}, "author": "Ruth Liew", "url": "http://www.afr.com/personal-finance/australians-will-still-rely-on-age-pension-actuaries-institute-report-says-20150902-gjd4qv", "ord_in_thread": 0, "title": "Australians will still rely on age pension, Actuaries Institute report says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chief executive of the Actuaries Institute David Bell. Ryan Stuart Share on twitter by Ruth Liew The least wealthy sections of the Australian community will remain entirely dependent on the age pension after retirement, with single women bearing the brunt of the income gap, according to the Actuaries Institute.\nThe 'For Richer, For Poorer' report, conducted by Rice Warner on behalf of the institute, found the Age Pension comprised 93 per cent of retirement income for those with low income. There is also a 50-fold difference between wealthy Australians in the top 5 per cent income bracket who are about to retire, and those at the bottom 5 per cent.\n\"Single women are likely to experience the worst outcome in retirement compared to couples and single men, with many unable to achieve a comfortable standard of living,\" it found.\nThe report says a couple in their 30s on middle incomes, about $54,750 each now, can expect to have $1.34 million in accumulated wealth by the time they get to 60.\nThis includes an estimated $434,000 in home equity and $817,000 in superannuation. These would bring $75,000 a year in income. A single woman in similar circumstances would have a retirement income of $38,000 a year.\n\"The younger cohorts (aged 30) will be marginally better off when they reach retirement because of the Superannuation Guarantee,\" David Bell, chief executive of the Actuaries Institute, said.\nAs Australia's first wave of baby boomers begin to retire, the cost of providing the age pension has grown to become around 10 per cent of all government expenditure.\nIt now exceeds $41 billion a year and is expected to grow to $50 billion within four years, the research found.\n \"The costs will keep growing due to the increasing amount of the population living at advanced ages and the increasing average length of retirement.\"\nThe findings come as returns across Australia's $2 trillion industry falls amid volatile investment markets. Many Australians have a large bulk of their superannuation investments lumped into local equities, and the benchmark S&P/ASX200 index has lost 11 per cent in the last 12 months alone.\nThe Actuaries Institute's research found that the performance of investment markets had a significant impact on how much super will be accumulated but the Age Pension still provided \"some insurance against adverse investment oucomes.\"\n\"This means that the taxpayer is exposed to increased expenditure in times of poor investment returns due to the impact on the assets test. It is likely that this could occur at the same time that government revenue is falling due to economic downturns,\" it said.\n\"To have an informed debate that leads to a fair and sustainable pension system, policymakers need to have a much clearer overall picture of the financial position of all Australians in retirement,\" the Institute's president, Estelle Pearson, said.", "external_links": ["https://twitter.com/Ruth_LiewAFR"], "published": "2015-09-02T09:27:00.000+03:00", "crawled": "2015-09-02T14:11:01.066+03:00", "highlightTitle": ""}