{"organizations": [], "uuid": "fd4e5da2027d2cc34ea7dc45b9338124b32813e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/secret-chiltern-firehouses-mouthwatering-steak-152255372.html", "country": "US", "title": "The secret to Chiltern Firehouse's mouthwatering steak is out", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "The secret to Chiltern Firehouse's mouthwatering steak is out", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T18:22:00.000+03:00", "replies_count": 0, "uuid": "fd4e5da2027d2cc34ea7dc45b9338124b32813e2"}, "author": "", "url": "https://uk.finance.yahoo.com/news/secret-chiltern-firehouses-mouthwatering-steak-152255372.html", "ord_in_thread": 0, "title": "The secret to Chiltern Firehouse's mouthwatering steak is out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Sep 26, 2015, 16:51 BST - UK Markets closed The secret to Chiltern Firehouse's mouthwatering steak is out By Rebecca Burn-Callander | Telegraph – 28 minutes ago 0.00 \nA newfound craze for beef sourced from 14-year-old cattle now has celebrity caché \nLondon’s celebrity haunts Chiltern Firehouse and Kitty Fisher’s , alongside Michelin (Paris: FR0000121261 - news ) -starred eateries Greenhouse and Kitchen Table, share a meaty secret. They all source a rare and unusual beef from a single Marylebone-based distributor, which has wowed the market. \nUnlike almost all the other available cuts of beef, which come from cattle that have been slaughtered aged between 18 months and two years old, this meat comes from dairy cows that are up to 14 years old. \nThese free-range cows are all supplied by a distributor in the Tolosa region in San Sebastián in Spain , yielding a meat that is naturally marbled with fat by the ageing process, with a deeper flavour than standard beef. \nThe majority are retired dairy cows, or working oxen - Galician Blonds, that have been put to pasture. \nRestaurateurs Nemanja Borjanovic, 35, and Melody Adams, 31, are the UK’s sole importers of the retired dairy cows and the oxen, both of which take a minimum of 10 years to come to market. From a standing start a year ago, the pair, who own the Donostia and Lurra restaurants , have built up a beef business turning over £600,000. \nMr Borjanovic and Ms Adams first discovered the steak on a trip to the Spanish gastronomic powerhouse. \n“We found a place called Bar Nestor, which only serves steak,” said Mr Borjanovic. “We were so impressed that we spoke to Signor Nestor about where to get it and he put us in touch with the producer in the Basque Country.” \nIn the early days, Donostia would import 30 kilos each month, offering the steak as a special in the restaurant and keeping the meat in a fridge in their nearby flat. \n“It (Other OTC: ITGL - news ) did so well that people started leaving their business cards, saying, 'Next (Other OTC: NXGPF - news ) time you have the beef, give me a call.’ We had a secret mailing list,” said Ms Adams. \nThe company’s first commercial customer was the upmarket steakhouse Goodman, which began buying 20 kilos a month for each of its three sites. “Now (NYSE: DNOW - news ) , it buys half a tonne a month,” said Mr Borjanovic. \nThe business now boasts its own dry-aging room and a full-time driver for the butcher’s van. The company, which has done no advertising, recently received orders from Bristol and Manchester. “Growth has all come from word of mouth,” he said. The venture’s list of customers remains small just 14 brands but includes many of the top London eateries. \nThere is very little threat from rival beef importers, claimed the couple. “We have exclusivity agreements with the top two suppliers who can get this type of beef,” said Mr Borjanovic. “You can get Galician beef from a farmer in Galicia but it wouldn’t be available for export.” \nThis is both a blessing and a curse: the meat venture has been a runaway success but the challenge for the growing business is the shortage of 10-year-old Galician cows. \n“You can only get two fillets from each cow,” said Mr Borjanovic. “Chiltern Firehouse now takes 50 a week, so we need 25 cows that are 14 years old a week just to satisfy them.” \n“There’s no more fillet,” said Ms Adams. “We’ve stopped opening new accounts.” The business will grow a maximum of 20pc a year. \nAs word spreads, customers are seeking older and older cows to ensure a deeper flavour. “We supplied a loin from 1999 the other week,” said Mr Borjanovic. “They can only get us one of those a month because there aren’t that many old cows.” In San Sebastián, word that the British firm will pay €50,000 (£37,000) for one of these cows has spread. \n“We’ve heard of farmers bringing in their pet cows, with tears in their eyes,” said Mr Borjanovic. “But it’s had the best life a cow can, up to 18 years as a pet instead of just 18 months.” Many retired dairy cows were previously sent to factories to be turned into low-value products, such as dog food. \nThe price of this premium beef now stands at £26 per kilo at the top end, which is still a far cry from the price of the world’s priciest beef, Wagyu , which sells for £90 a kilo. \nThe couple, who met while working in finance, set up upmarket tapas restaurant Donostia, their first venture, three and a half years ago. Basque-country-inspired grill restaurant Lurra opened three weeks ago, and the couple also run a wine import business. The pair’s next venture is likely to be a boutique hotel in London: “That’s the dream.”", "external_links": [], "published": "2015-09-26T18:22:00.000+03:00", "crawled": "2015-09-26T18:51:34.613+03:00", "highlightTitle": ""}