{"organizations": [], "uuid": "f565231e4027f3736cd00af7da7666826b40ad2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/u/2/g/m/image.related.afrArticleLead.620x365.gjt7ka.png/1443074124336.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/afr-magazine/what-the-afr-magazines-2015-power-issue-says-about-australia-20150923-gjt7ka", "country": "AU", "title": "What the AFR Magazine's 2015 Power issue says about Australia", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "What the AFR Magazine's 2015 Power issue says about Australia | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T11:56:00.000+03:00", "replies_count": 0, "uuid": "f565231e4027f3736cd00af7da7666826b40ad2a"}, "author": "Katrina Strickland", "url": "http://www.afr.com/brand/afr-magazine/what-the-afr-magazines-2015-power-issue-says-about-australia-20150923-gjt7ka", "ord_in_thread": 0, "title": "What the AFR Magazine's 2015 Power issue says about Australia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The AFR Magazine Power Issue 2015. The issue also highlights the difference a change at the top can make. When the panel that decides our overt, covert and cultural power lists met mid-year to discuss power in the year just gone, Tony Abbott was still prime minister. There was a lot of debate about the combative nature of Abbott's leadership and how different it was from the more consultative style of NSW Premier Mike Baird, whom former Labor minister Martin Ferguson said was \"the outstanding political leader at present\".\nCue Malcolm Turnbull, the new Prime Minister, whose early speeches suggest he will be more akin to Baird in style than his predecessor at the Lodge. The climate of negativity that infused our power debate had changed, literally overnight. The question, of course, is whether that change will last. It's going to be a fascinating year. Bring on the 2016 Power debate.\nHow new PM affected the Power issue Monday September 14, was not only a bad day for Mr Abbott; it was also a less than ideal one for the team that produces The AFR Magazine . After months of hard slog, on the previous Thursday we had finally sent the 84-page Power issue to press. We were happy with our cover, which featured Mr Abbott flanked by Julie Bishop and Malcolm Turnbull, the latter looking at his watch.\nHow the Turnbull coup affected the AFR Magazine Power cover We had photographed them all separately, as we did most of the other people who appear in the issue, asking them to strike various poses and use different props to help avoid an issue full of men in dark suits. It was sheer luck that photographer Louie Douvis had asked Mr Turnbull to look at his iPhone and Apple Watch for his shoot. This request was made not because we had a premonition that Mr Turnbull wanted Mr Abbott to hurry up and get out of the way, but because of Mr Turnbull's well-known love of technology and then-position as Minister for Communications.\nBy Tuesday morning, with the new Prime Minister installed, our cover looked extremely prescient — but also out of date. A hasty phone call to the printers unearthed the news that the issue had been printed but not yet stapled together, and that the cover had not yet gone to press. It was too late to amend the main overt power list, which had already gone to print, and in any case painted a fascinating picture of the challenges and concerns that led to the leadership coup. But we were able to augment this with a four-page insert in which we revised the overt power list to reflect the new leadership team, and reported our panellists' views on the change.\nAfter more hasty work we had a new cover. Mr Turnbull had moved front and centre, Ms Bishop remained where she was, and Mr Baird had moved into the position previously occupied by Mr Turnbull. Mr Abbott, alas, fell to the cutting-room floor.\nAlso in the AFR Magazine Power issue: You've got plenty of followers on social media, ergo you're powerful right? Not exactly .\nFind out who are the most powerful people in Australia's Education and Technology and Sport and Property and Media and Legal and Dealmaking sectors.\nFollow AFR Mag on Twitter and Instagram\nThe AFR Magazine Power issue, out Friday September 25 inside The Australian Financial Review.", "external_links": ["https://twitter.com/afrmag", "https://instagram.com/afrmag/"], "published": "2015-09-24T11:56:00.000+03:00", "crawled": "2015-09-24T10:04:16.843+03:00", "highlightTitle": ""}