{"organizations": [], "uuid": "4a094615ce4d4939c10bb7de6b4573ec4bcb721a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/09/Tesla-Model-X-electric-SUVS.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/automobiles/tesla-delivers-model-x-electric-suv-to-take-on-luxury-carmakers/143776", "country": "IE", "title": "Tesla delivers Model X electric SUV to take on luxury carmakers", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Tesla delivers Model X electric SUV to take on luxury carmakers | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T20:17:00.000+03:00", "replies_count": 0, "uuid": "4a094615ce4d4939c10bb7de6b4573ec4bcb721a"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/automobiles/tesla-delivers-model-x-electric-suv-to-take-on-luxury-carmakers/143776", "ord_in_thread": 0, "title": "Tesla delivers Model X electric SUV to take on luxury carmakers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Buyers considering utility vehicles, mid sized cars: J D Power China cuts tax on small-engine cars to revive market Google's driverless car drivers ride a career less traveled Tesla Motors delivered the first of its long-awaited Model X electric sports-utility vehicles on Tuesday, a product investors are counting on to make the pioneering company profitable after years of losses.\nThe launch of the Model X represents a milestone for the loss-making Silicon Valley automaker during a period of high spending and modest growth, because it can now boast a second model in production beyond its Model S sedan, launched in 2012.\n“I think we got a little carried away with the X,” Chief Executive Officer Elon Musk told reporters ahead of a launch event near the company’s Fremont factory, where luxury Model Xs have been moving down the production line in recent weeks, nearly two years behind the company’s original schedule.\nMusk estimated that 25,000 customers had pre-ordered the crossover online or in its stores and that it would take 8-12 months for those ordering from now to receive the SUV.\nIn retrospect, the company may have done less, Musk said.\n“There is far more there than is really necessary to sell a car. And some of the things are so difficult, they make the car better but the difficulty of engineering those parts is so high.”\nBetween 4,000-6,000 guests filled a cavernous space for the launch. Invited to the event were Model X reservation holders, Tesla employees and Model S and Roadster owners. The Roadster sportscar, which is no longer in production, was the company’s first vehicle.\nMusk has said the all-wheel drive Model X – with two electric motors, the ability to travel about 250 miles (about 400 km) on a single charge and seating for seven people – was “the hardest car to build in the world”.\nPriced as high as $144,000, it features so-called “falcon-wing” doors that open upward rather than to the side – controlled by sensors that can modulate the height to clear garage ceilings – seats that can be adjusted separately and a panoramic windshield that extends overhead.\nMusk said the biggest challenges were making the doors open in a graceful “balletic” manner, the expansive windshield – which he said was the largest piece of glass ever used in a car – plus its sun visor and the moveable seats, which he said were deceptively tricky.\n“One of the hardest things to design is a good seat,” he said.\nAlthough global adoption of electric vehicles has been slow, Tesla has been the U.S. pioneer in luxury electric cars charged by batteries. It is betting that high-performance and stylish offerings will boost acceptance amid a sea of alternatives, such as hybrids or electric vehicles powered by hydrogen.\nTesla predicted its SUV would receive 5-star safety ratings in all categories, based on data from its crash tests, due to its low center of gravity, which helps reduce rollovers.\nThe Model X, like the Model S, will be continuously improved, Tesla said, due to software transmitted “over the air”. A highly anticipated update expected within the next month will allow for an auto-pilot function, in which cars can be driven hands-free on freeways.\nAHEAD OF PACK\nThe buzz surrounding Tesla’s Model S sedan – whose P85D variant won a top score of 100 from Consumer Reports magazine in August – has managed to preempt high-end German rivals such as Volkswagen’s Audi and Porsche, BMW and Daimler’s Mercedes-Benz.\nAt the Frankfurt Auto Show earlier this month, Audi unveiled its e-tron quattro sport-utility vehicle, and Porsche showed off its first battery-powered sports car, although neither will be available before 2018.\nBut spending on the Model X, a new Nevada battery factory and the lower-cost Model 3 due by late 2017, have all increased capital expenses, which totaled $831.2 million in the first half of the year.\nThe Model X, he said, “gives us a cashflow stream we can use to develop and facilitate” Tesla’s three vehicles either in production or development.\nSix new cars were delivered on Tuesday to a group made up of Tesla board members, investors and friends of Musk who had pre-ordered.\nIn August, Musk said Tesla would make between 50,000-55,000 Model S and Model X vehicles this year, with the capacity for 1,600-1,800 vehicles per week on its production line next year.\nTuesday’s unveiling showcased the top-of-the-line “Signature” Model X, priced between $132,000 and $144,000, with optional add-ons such as acceleration upgrades, packages for subzero weather package or towing.\nThe company has not disclosed pricing for the base model, but Musk said that in the future, there would be a “lower-cost” Model X.\n 30, 2015 12:17 pm", "external_links": [], "published": "2015-09-30T20:17:00.000+03:00", "crawled": "2015-09-30T11:52:54.769+03:00", "highlightTitle": ""}