{"organizations": ["Meggitt"], "uuid": "cc686901e7784ea5ae3e6b78cbf6e8703ce73dd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/arm-holdings-plc-easyjet-plc-080434048.html", "country": "GB", "title": "Can ARM Holdings plc, easyJet plc And Meggitt plc Continue Their Recent Recovery?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Can ARM Holdings plc, easyJet plc And Meggitt plc Continue Their Recent Recovery?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T11:04:00.000+03:00", "replies_count": 0, "uuid": "cc686901e7784ea5ae3e6b78cbf6e8703ce73dd8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/arm-holdings-plc-easyjet-plc-080434048.html", "ord_in_thread": 0, "title": "Can ARM Holdings plc, easyJet plc And Meggitt plc Continue Their Recent Recovery?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 8, 2015, 09:10 BST - UK Markets close in 7 hrs 20 mins Can ARM Holdings plc, easyJet plc And Meggitt plc Continue Their Recent Recovery? By Royston Wild | Fool.co.uk – 5 minutes ago 490.90 +7.5000 \nToday I am looking at three London-listed giants I reckon should keep punching solid share price rises. ARM Holdings \nMicrochip builder ARM Holdings (LSE: ARM) is one of a handful of FTSE 100 stalwarts to have advanced during the past week as fears over economic turbulence in China continue to reverberate. The Cambridge business is currently up 4% from levels seen at the start of last week, but I believe the tech giant still has plenty to offer savvy investors. \nOf course observers should be mindful of saturation in the critical smartphone and tablet PC markets -- researcher Gartner recently advised that global phone sales during April-June rose 13.5% during April-June, the slowest rate since 2013 and thanks to Chinese handset demand slipping for the first time. But I reckon ARM Holdings' top-tier supplier status with industry giants like Apple , not to mention diversification into other hot tech sectors like servers, makes the business a compelling growth pick. \nInvestors should also bear in mind that, even though ARM Holdings boasts chunky growth projections of 69% and 18% for 2015 and 2016 respectively, the business still trades on elevated P/E ratios of 31 times and 26.3 times for these years. These numbers leave the chip maker in danger of a sharp sell-off should investor sentiment plummet, although I reckon the stock's exceptional growth prospects should keep prices heading higher in the long-term. easyJet \nBuoyed by surging passenger numbers and the likelihood of prolonged low fuel costs, I reckon budget airline easyJet (LSE: EZJ) is also a strong stock selection for growth hunters. Shares in the business have advanced 7% during the past seven days, helped in no small part by an encouraging trading update late last week. \nThe Luton flyer announced that it transported 7.06 million suits and sun-worshippers during August, a new monthly record for the group and up 6.8% from a year earlier. This strong performance prompted easyJet to hike its pre-tax profit estimates for the year concluding September 2015, to £675m-£700m from £620m-£660m previously. \nAnd the City does not expect this to be a flash in the pan, either -- forecasted earnings growth of 15% for the current year is expected to explode a further 9% in 2016, leaving easyJet dealing on attractive P/E multiples of 13.3 times and 12.1 times for these years. And when you throw in predicted dividends of 53.4p per share for 2015 and 58.8p for the following period, chucking up chunky yields of 3.1% and 3.4%, I reckon the airline is a very decent stock selection. Meggitt \nLike easyJet, I believe aerospace engineer Meggitt (LSE: MGGT) is set to enjoy the fruits of spiralling traveller numbers in the years ahead. Even though the stock has more or less flatlined during the past seven days, it has risen 6% in two weeks as investors have cottoned onto the fact that the business appears undervalued at current levels. \nMeggitt took a massive step last month by acquiring the advanced composites businesses from Cobham for $200m, a brilliant fit for its existing composites operations that should help push the firm to the next level. With airlines the world over splashing out to improve their fleet quality and numbers, and military sales also moving in the right direction, I am convinced the stage is set for earnings to move resoundingly higher. \nThis view is shared by the number crunchers, and Meggitt is expected to enjoy bottom-line bounces of 5% and 8% in 2015 and 2016 correspondingly, resulting in very reasonable P/E ratios of 13.8 times and 12.6 times. With the plane-part specialists also anticipated to offer dividends of 15p and 16.1p per share for this year and next, yielding 3.1% and 3.3%, I believe Meggitt is a terrific engineering stock at current prices. \nBut whether or not you share my take on Meggitt, or indeed any of the stocks discussed above, I strongly recommend you check out this totally exclusive report that singles out even more FTSE 100 winners to really jump start your investment income. \nOur \" 5 Dividend Winners To Retire On \" wealth report highlights a selection of incredible stocks with an excellent record of providing juicy shareholder returns. Among our picks are top retail, pharmaceutical and utilities plays that we are convinced should continue to provide red-hot dividends. Click here to download the report -- it's 100% free and comes with no further obligation . \nRoyston Wild has no position in any shares mentioned. The Motley Fool UK has recommended ARM Holdings and owns shares in Apple. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-09-08T11:04:00.000+03:00", "crawled": "2015-09-08T11:11:02.174+03:00", "highlightTitle": ""}