{"organizations": [], "uuid": "9a4454def2691caebc3e7e3594aa7131601d750e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/9/h/b/n/image.related.afrArticleLead.620x365.gjd8tx.png/1441190474087.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/rear-window/no-one-does-corporate-governance-like-billionaire-frank-lowys-ffa-20150902-gjd8tx", "country": "AU", "title": "No one does corporate governance like billionaire Frank Lowy's FFA", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "No one does corporate governance like billionaire Frank Lowy's FFA | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T21:30:00.000+03:00", "replies_count": 0, "uuid": "9a4454def2691caebc3e7e3594aa7131601d750e"}, "author": "Will Glasgow", "url": "http://www.afr.com/brand/rear-window/no-one-does-corporate-governance-like-billionaire-frank-lowys-ffa-20150902-gjd8tx", "ord_in_thread": 0, "title": "No one does corporate governance like billionaire Frank Lowy's FFA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The state federations are not entirely thrilled with Football Federation Australia outgoing chairman Frank Lowy's instructions. Louise Kennerley Share on twitter Share on Google Plus by Will Glasgow No one does corporate governance like the billionaire outgoing chairman Frank Lowy 's Football Federation of Australia.\nAs Rear Window readers found out last week, BT Investment Management's head of equity strategies Crispin Murray is on Brian Schwartz ' short list of three Lowy-preferred FFA board members .\nThe day after we published that news, the outgoing FFA deputy chairman Schwartz (better known to many of you as a long-time confidant to Lowy and IAG's current chairman) sent a letter to the state bodies that will vote to decide the new board members at the FFA's November annual meeting.\nEven though nominations for the positions do not close until September 30, Schwartz has put the Lowy-approved list in ink. No one does corporate governance quite like football.\nRod Clement As we wrote last week, the chosen three are Frank's son Steven Lowy (to no one's surprise, the chairman apparent), CBA group executive Kelly Bayer Rosmarin (a self-described \"big ideas\" fan) and Murray ( who, coincidentally, works for a financial outfit that was crucial to the successful restructuring of Lowy's then $60 billion shopping mall empire in 2014.)\nThe state bodies were told there would be no other candidates put forward by the board lest it risked a return to the \"old days\" of football. Perhaps code for back when it wasn't a Lowy fiefdom.\nTo allay fears that the board shortlist was a bit on the stumpy side, Schwartz trumpeted that 70 candidates were identified and 50 of these were contacted. But whether that meant much more than they were sent a \"how are you going?\" email from Schwartz's PA remains unclear.\nNow, the various state federations are not entirely thrilled with their Lowy instructions. That's not a great surprise.\n As former FFA board member and Socceroo Jack Reilly has said, while the Westfield founder is an excellent businessman, some – Reilly included – think Frank has run the code as a \"one-man band\" .\nSince the Schwartz letter was sent, the Victorian branch has put forward an alternative, not-Lowy-sanctioned, candidate. We await further candidates from the other states.\nOne name pressed on us is Investors Mutual founder Anton Tagliaferro . He's the president of the Milan Soccer Academy in Australia, so he's not short of experience with the code. And, since it's apparently important, we'll note he's a market gun as well.\nAnd before we move on from the FFA, whatever happened to former board member Peter Treddinick? He departed a few months ago in mysterious circumstances. Do write in if you know more.", "external_links": ["http://www.footballtodaylibrary.com/uploads/9/8/8/1/9881717/schwartz-310815.pdf", "https://plus.google.com/https://plus.google.com/u/1/113771037534783751083/posts", "https://twitter.com/http://twitter.com/wmdglasgow", "http://www.theaustralian.com.au/sport/football/the-son-also-rises-will-anyone-challenge-lowys-grip-on-soccer/story-fn63e0vj-1227493690523?sv=4fc40cd9d008e5e80c89c436c516e936"], "published": "2015-09-02T21:30:00.000+03:00", "crawled": "2015-09-02T21:09:09.059+03:00", "highlightTitle": ""}