{"organizations": ["Volkswagen"], "uuid": "bcadbd574955f1906aed5dc54d80cd480478e5ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/miners-volkswagen-hit-europe-shares-121744665.html", "country": "US", "title": "Miners, Volkswagen hit Europe shares", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Miners, Volkswagen hit Europe shares", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T15:17:00.000+03:00", "replies_count": 0, "uuid": "bcadbd574955f1906aed5dc54d80cd480478e5ee"}, "author": "", "url": "https://uk.finance.yahoo.com/news/miners-volkswagen-hit-europe-shares-121744665.html", "ord_in_thread": 0, "title": "Miners, Volkswagen hit Europe shares", "locations": ["Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 22, 2015, 13:32 BST - UK Markets close in 2 hrs 58 mins Miners, Volkswagen hit Europe shares Reuters – 14 minutes ago \nA new all time high is displayed on the German share price index DAX board which is reflected in a DAX … \nBy Nigel Stephenson \nLONDON (Reuters) - Shares slid on Tuesday, with Europe led lower by mining companies as copper prices fell on worries over Chinese demand, while the dollar rose to its highest in almost two weeks after Federal Reserve officials signalled U.S. interest rates might rise this year. \nThe pan-European FTSEurofirst 300 stocks index fell 2.6 percent, reversing a trend that had seen stocks rise in Asia. Wall Street was expected to open lower, according to index futures. \nAn index of Europe-listed mining shares dropped 5.6 percent after copper retreated 2.5 percent. \nWorries over a slowdown in the Chinese economy have weighed on markets in recent weeks, and preliminary factory activity data for September will be a focus for investors on Wednesday. \n\"If China manufacturing numbers come in better than expected tomorrow, we could see a rebound in mining stocks for some days, but the sector's medium-term outlook remains bearish,\" Christian Stocker, equity strategist at UniCredit in Munich. \nA further fall in shares of German carmaker Volkswagen, which has admitted cheating on vehicle emission tests, also took a toll on the FTSEurofirst, as an investigation of the cheating spread to Asia. VW shares were last down 19 percent. Porsche, part of the VW group, lost 17 percent. \nMSCI's broadest index of Asia-Pacific shares outside Japan gave up earlier gains and was last down 0.3 percent. \nChinese shares rose, with the Shanghai Composite and the CSI300 index of the largest listed companies in Shanghai and Shenzhen both closing up about 0.9 percent. \nJapanese markets were closed for a holiday. \nWeakness in stock markets helped lift the yen against the dollar, though the divergence between the Fed on the one hand and the ECB and Bank of Japan on the other helped push the dollar to its highest since Sept. 10 against a basket of currencies. \nThe U.S. Federal Reserve held policy steady last week, citing risks to global growth. But Atlanta Fed President Dennis Lockhart said on Monday he still expected rates to rise this year and St. Louis Fed chief James Bullard said there was a chance of a hike next month. \nBy contrast, European Central Bank officials have been stressing monetary policy in the euro zone will remain loose for some time. Governing Council member Ewald Nowotny said on Monday ECB rates would stay low as long as growth did. \nThe euro was down 0.2 percent at $1.1155, having hit a high of $1.1459 on Friday. The dollar eased 0.5 percent to 119.96 yen per dollar but was still above Friday lows. \nExpectations of a prolonged period of low ECB rates, and the fall in stocks, pushed down yields on low-risk euro zone debt. German 10-year Bund yields hit a one-month low at 0.62 percent, down 6 basis points on the day. \nThe ECB launched a trillion-euro bond buying programme in March, but has failed to raise the market's long-term inflation expectations. \n\"I'm not too convinced that they are signalling they are ready to do something in October, but it does support our view that if nothing changes between now and December, the ECB may have to add more stimulus,\" said Elwin de Groot, senior market economist at Rabobank. \nOil prices fell as concern over global growth weakened the outlook for demand and as traders took profits from a rise of 3 to 4 percent on Monday. \nBrent crude, the global benchmark, was down 79 cents a barrel at $48.13. Gold eased with stocks and commodities. It last traded at $1,128.40 an ounce. \n(Additional reporting by Nichola Saminather in Singapore, Jemima Kelly, Marius Zaharia and Atul Prakash in London; Editing by Larry King and Susan Thomas)", "external_links": [], "published": "2015-09-22T15:17:00.000+03:00", "crawled": "2015-09-22T15:32:49.583+03:00", "highlightTitle": ""}