{"organizations": [], "uuid": "fc879f9d06ede7444cba7b7822ca1b610f77379f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/10/14/102086255-mad-money-lightning.1910x1000.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=KKR", "section_title": "Yahoo! Finance: KKR News", "url": "http://www.cnbc.com/2015/09/25/lightning-round-its-a-winner-dont-back-away.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=103027500", "country": "GB", "title": "Lightning Round: It's a winner, don't back away", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "Lightning Round: It's a winner, don't back away", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "fc879f9d06ede7444cba7b7822ca1b610f77379f"}, "author": "yahoo", "url": "http://www.cnbc.com/2015/09/25/lightning-round-its-a-winner-dont-back-away.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=103027500", "ord_in_thread": 0, "title": "Lightning Round: It's a winner, don't back away", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's that time again! Jim Cramer rang the lightning round bell, which means he gave his take on caller favorite stocks at rapid speed:\n\nBlackstone Group : \"A lot of people worry about Blackstone because the stock has acted poorly. I come back and say wait a second, the yield is fine and I want to be a buyer not a seller.\" \nKKR & Co LP : \"People feel that there is not a lot of room to be able to exit certain stocks and they want to come public. There is also a sense that they need high yield debt and the high yield market is closing. I have conviction that this stock over the long-term has been a winner and I'm not backing away.\" \nPlatform Specialty Products: \"Platform Specialty is a company that needs high yield debt to continue to make the acquisitions that would make it so that the company is a growth company. That window for that high yield debt seems to be closing and that is why people are selling that stock.\" \nWal-Mart : \"Longer term someone might be attracted to Doug Mcmillon's [CEO] turn at Wal-Mart with a 3 percent yield. I think the turn is a couple of quarters away. In the interim I would suggest why not buy Costco. It reports next week and it could have a really good quarter.\" \nAnnaly Capital Management: \"I'm not a fan of Annaly. I think that the 11 percent yield will not necessarily make it up. People think it's a bond, it's not. I'd rather own something that has growth and dividend which would be General Mills.\"\nRead more from Mad Money with Jim Cramer \nCramer Remix: Here is your Volkswagen trade \nCramer: Caterpillar pain is just beginning \nCramer's tale of horror—activism ruined this stock \nGW Pharma : \"Right now these kinds of stocks, the biotech stocks, have fallen very out of favor...At the same time we've got a lot a problems with companies that don't have dividends, don't have buybacks. Unfortunately GW Pharma has neither of those. So therefore you have to be careful even though I like it long-term.\"\nPotash Corp: \"We have seen some bad numbers out of the agriculture companies this year. We have seen really bad numbers out of the fertilizer companies. That has a 7 percent yield but I am not attracted to it because as we have been seeing, those big yields are not protecting people anymore because people feel the stocks have more room down.\"\nCelgene Corp : \"Celgene is a very difficult situation, I'll tell you why. Because the stock is up huge from last year and because all of these stocks are in for sale right now I think if we look back at Celgene, if you get it under $100 you are going to be very proud. But let's wait until it gets there.\"\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC \nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine \n\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com \nAbigail Stevenson Digital Producer Related Securities Symbol Price   Change %Change WMT ---", "external_links": [], "published": "2015-09-26T03:00:00.000+03:00", "crawled": "2015-09-26T05:18:57.466+03:00", "highlightTitle": ""}