{"organizations": [], "uuid": "f616e29b7bd8928820b19041c6c838be79551042", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.gov.ie", "main_image": "", "site_section": "http://finance.gov.ie/rss.xml", "section_title": "An Roinn Airgeadais, Department of Finance", "url": "http://finance.gov.ie/news-centre/press-releases/irish-fiscal-advisory-council-appointment-council-members", "country": "IE", "title": "Irish Fiscal Advisory Council: Appointment of Council Members", "performance_score": 0, "site": "finance.gov.ie", "participants_count": 1, "title_full": "Irish Fiscal Advisory Council: Appointment of Council Members", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T12:03:00.000+03:00", "replies_count": 0, "uuid": "f616e29b7bd8928820b19041c6c838be79551042"}, "author": "editorfinance", "url": "http://finance.gov.ie/news-centre/press-releases/irish-fiscal-advisory-council-appointment-council-members", "ord_in_thread": 0, "title": "Irish Fiscal Advisory Council: Appointment of Council Members", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Irish Fiscal Advisory Council: Appointment of Council Members 25.09.15 \nFollowing an open selection process, the Minister for Finance, Michael Noonan TD, has appointed Mr Michael G. Tutty and Mr Seamus Coffey as Members of the Irish Fiscal Advisory Council. \nMr Tutty’s appointment is effective immediately, the term of which will end on 31 December 2015, and will be followed by a second term of four years effective from 1 January 2016. Mr Coffey is appointed for a period of four years with effect from 1 January 2016. \nMinister Noonan said “I welcome the appointment of Mr Tutty and Mr Coffey as members of the Irish Fiscal Advisory Council and wish them well in this important role”. \nShort biography of new appointees \nMr Michael G. Tutty is a retired Commissioner for Energy Regulation. He was Vice President of the European Investment Bank from 2000 to 2004, immediately prior to which he served as Second Secretary General in the Department of Finance (Budget and Economic Division). Mr Tutty holds a Masters Degree in Strategic Management in the Public Sector from Trinity College Dublin and a Masters Degree in Economics from the National University of Ireland. His appointment to the Irish Fiscal Advisory Council is effective immediately and will be followed by a second term of 4 years effective from 1 January 2016. \n\nMr Seamus Coffey is a Lecturer in Economics in University College Cork. He has written and presented extensively across a broad range of topics relating to the performance and management of the economy. A lot of his work has focused on the fiscal side of the Irish economy including examining budgetary outturns, determining effective tax rates, analysing fiscal rules and exploring their possible consequences for Ireland. Mr Coffey holds a Masters Degree in Economic Science and a Bachelor of Commerce, both from University College Cork. \nSelection process \nThe selection process for this appointment was undertaken in accordance with the “Guidelines for appointments to state boards” published by the Government in November 2014. The vacancies were advertised on Stateboards.ie and were managed by the Public Appointments Service. \nDetails on the Irish Fiscal Advisory Council, including board members, are available at www.fiscalcouncil.ie", "external_links": [], "published": "2015-09-25T12:03:00.000+03:00", "crawled": "2015-09-25T15:43:12.150+03:00", "highlightTitle": ""}