{"organizations": [], "uuid": "49409ab1d93c9778b649c2d916c44fcf21a31e0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/09/23/china-economy-consumers-idUSL4N11M3IV20150923", "country": "US", "title": "INSIGHT-China consumers tighten belts, a red flag for the global economy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "INSIGHT-China consumers tighten belts, a red flag for the global economy | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T01:00:00.000+03:00", "replies_count": 0, "uuid": "49409ab1d93c9778b649c2d916c44fcf21a31e0b"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/09/23/china-economy-consumers-idUSL4N11M3IV20150923", "ord_in_thread": 0, "title": "INSIGHT-China consumers tighten belts, a red flag for the global economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Survey found China consumer confidence hit record low in August\n* Consumers putting off upgrading phones, cars\n* Sharp drop in Chinese demand would hit global economy - OECD\n* Multinational companies flag tougher conditions in China\nBy James Pomfret\nSHENZHEN, Sept 24 (Reuters) - Terry Xu considers himself one of the lucky ones.\nThe 32-year-old father-of-one invested 10 percent of his savings earlier this year in Chinese stocks. Now, with markets down around 40 percent since mid-June, he's selling off his portfolio at a loss.\nPainful, but not a catastrophe - he says his colleagues lost more, and he earns well above the average wage.\nBut the equity market turmoil, coupled with signs the economy is slowing means Xu, and millions of other middle class Chinese consumers like him, is scaling back his spending in an ominous sign for China's policymakers and the global economy.\n\"This year's economy has been uncertain,\" he said.\n\"It's not like before, where we just used to buy everything for our child. Now, we only buy and spend what we need\".\nXu earns 20,000 yuan ($3,140) a month as a product development manager for a Western headphone maker in Shenzhen.\nA flat he bought in 2012 for 900,000 yuan, which he shares with his 4-year-old daughter, wife and parents-in-law, is now worth 2.5 million.\nStill, he plans to keep his Apple iPhone 4 rather than upgrade to the latest iPhone 6S, and his next pair of trainers will be from the Chinese brand Anta Sports rather than his preferred Nike.\nXu's worries are typical of middle class families - relatively minor compared with the millions of his compatriots who get by on lower incomes.\nBut his belt-tightening jars with the Chinese government's hopes that consumers will pick up the slack as exports fall and it tries to rebalance the economy away from a long-running reliance on trade and government spending.\nDomestic consumption contributed 60 percent of China's economic growth in the first half of 2015, up from 51.2 percent in the whole of 2014, suggesting Beijing's desired rebalancing is on track.\nBut forward looking indicators and companies' experiences in China are more worrying.\nA China consumer confidence index produced by ANZ Bank and polling company Roy Morgan fell to a record low in August.\nCar sales in China could drop this year for the first time in two decades, while smartphone sales recorded their first fall in China during the second quarter, consumer research firm Gartner said.\nIf that translates into a slowdown in overall consumer spending, the impact will be felt beyond China.\nLast week U.S. Federal Reserve chair Janet Yellen said concerns over a China slowdown were partly behind the central bank's decision to hold rates.\nGlobal GDP growth, estimated by the IMF to be 3.3 percent this year, would be about half a percentage point lower if there were a sharp fall in Chinese demand, according to study released this month by the OECD.\nThe study projected that if domestic Chinese demand growth fell by 2 percentage points for two straight years, combined with a 10 percent fall in global equity markets, it would shave around 0.25 percentage points off the pace of U.S. GDP, and more than half a percentage point off Japan's already-sluggish growth by the second year.\nJapan's exports to China, its largest trading partner, are already flagging. They fell 4.6 percent in August from a year earlier, partly due to falling shipments of car parts to Chinese factories, where activity has fallen to a six-and-a-half year low.\nNO MORE FOREIGN BRANDS\nMany of the world's biggest companies are feeling the effects of weaker Chinese consumer demand.\nVolkswagen's high-end Audi brand said this month it had eased back output at its China plants. German rival BMW has reduced output of its locally produced 3 and 5 series models.\nXie Kang, 46, who runs a small plastic goods factory in Dongguan has scrapped plans to buy a Toyota Highlander for around 400,000 yuan, and will stick with his Volkswagen Polo instead.\nHis company supplies parts to the toy, electronics and bicycle industries but the number of his clients has fallen from 30 to 4.\n\"To be honest, I need a better carbut my debts are getting larger, and I've not made a profit for several months now\".\nZhao Wenke, 32, who manages an auto parts company in Shanghai, is also curbing spending, despite a monthly income of 83,000 yuan.\nThe father-of-two says he now saves 40 percent of his monthly salary given the economic uncertainty, up from 30 percent previously.\n\"For the children, we're definitely cutting back on clothes.... especially from foreign brands like Mothercare,\" he said, adding that like Xu, he won't be upgrading to Apple's iPhone 6S.\nApple shares have fallen 13 percent since July 21, partly on China worries, though chief executive Tim Cook said its third quarter performance has been \"reassuring\".\nOther Western consumer companies though flagged in their second-quarter earnings that China was turning into a tough market, before most of the recent equity market turbulence.\nXu, after getting his fingers burnt with stocks, is putting more money into bank funds or time deposits.\nThe regular foreign holidays and restaurant meals he and his wife used to enjoy are on hold.\n\"I don't want to blindly spend anymore,\" he said. ($1=6.37 yuan)\n(Additional reporting by John Ruwitch and Alexandra Harney and John Ruwitch in SHANGHAI; Writing by Rachel Armstrong; Editing by Neil Fullick)", "external_links": [], "published": "2015-09-24T01:00:00.000+03:00", "crawled": "2015-09-24T00:25:53.381+03:00", "highlightTitle": ""}