{"organizations": [], "uuid": "7e84808bbf87ba03d3c0471f7c167eff2077c3d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201509280050.html", "country": "US", "title": "Rwanda: Car-Free and Too Quiet", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Rwanda: Car-Free and Too Quiet", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T10:08:00.000+03:00", "replies_count": 0, "uuid": "7e84808bbf87ba03d3c0471f7c167eff2077c3d1"}, "author": "", "url": "http://allafrica.com/stories/201509280050.html", "ord_in_thread": 0, "title": "Rwanda: Car-Free and Too Quiet", "locations": ["Senegal"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Africa: World Maritime Day - Senegal, Here's Your Chance \nA month after it was closed, KN4 street remains quiet A month after KN4 Street in central Kigali was declared a no-go zone for motorized transport that stretch of asphalt from the new Peace Plaza to the Ecole Belge does not seem to have sprung into vigorous activity. \nDuring the day, most especially when the heat of the sun is blasting down, only a handful of walkers will be seen moving anywhere on that street. City activity can be heard from a distance, with the sound of honking cars coming either from the i&M Bank direction, or down from those passing Centenary House. \nKN4 Street most of the time looks like a dead street these days. In the last few days some street artists have began taking advantage of the car-less street to set up easels in the middle of the road and painting pictures of adjacent buildings. \nMayor Fidel Ndayisaba in announcing the closure of KN4 to cars assured residents of the capital this was in the new city master plan. \nA walkable, green city is the objective. The City of Kigali administration has plans to make pedestrian streets livelier, by planting more trees and green spaces in streets, of which KN4 is the pilot phase. That is what the Mayor as well as Alphonse Nkurunziza the city's Head of Engineering and Urban Planning have said. \nBut the businesses that operate on that street are struggling with depleted customer numbers, and many - at least the ones The Rwanda Focus has talked to - hint that moving to other places is what may save them. \nAn employee of the famous Camelia Restaurant - an eatery popular with the working, middle class of the central business district - who requested not to be named told this newspaper that they are experiencing a drop of at least over 80 percent in their customer numbers. \n\"Before the new policy, we used to have between two hundred to two hundred forty customers every day in the morning hours alone,\" he said. \"We could easily have five hundred during lunch hours and maybe two hundred in the evening. Now we are lucky if we can get one hundred eighty customers an entire day. Now the employees outnumber customers.\" \nHe said if things continue much longer like this, restaurant ownership might decide to relocate. \nTo walk into any of the banks operating on that street is to see significantly reduced numbers. The counters look much less active than in the past. Ecobank's parking space still lies idle. Bank of Kigali headquarters has an active basement parking, but its first floor level parking looks unused these days. \nAn official in one of the banks told this newspaper that they might manage the problem by converting some of the counters into other uses, and building more branches in the outskirts of the city. \"That will require some significant investments, but there is no other way,\" said the official. \nSmall businesses that sell clothes, phones, jewelry, electric gadgets and so on nowadays look mostly forlorn, with shop attendants looking like they have much more time to talk or stare in their phones than for anything else. \nMany of the people we talked with expressed support for the CofK of Kigali decision, but each and everyone running a business on that street says it took them by surprise. \nCity authorities on their part contend there was nothing rushed about the decision. \n\"These are things we had been discussing with businesses and other stakeholders and so it wasn't a rushed decision at all,\" Mayor Ndayisaba told journalists when the street was declared a car free zone last month. \nOne of the main reasons why Kigali embarked on a car-free policy was to decongest the city, Nkurunziza the chief city engineer was quoted in the media as saying. \nBuilding green spaces, more user-friendly pedestrian walkways, outside cafes and so on will attract more pedestrians to the street. The city authorities have also assured the capital's residents that there will be shuttle bus services linking the pedestrian streets to the rest of Kigali. \nCurrently there isn't much to indicate any of these things is being done. We tried to line up an interview with Mr. Nkurunziza to tell us more about plans in the offing, but hadn't yet talked to him by the time we committed this article to print. \nSo far, the one visible new innovation in place has been building a paved walkway connecting KN4 Street with the former Boulevard de la Revolution, the street on which i&M Bank, the new City Hall and other institutions are located. \nThe walkway, about a hundred or so meters of it, cuts between City Hall and the site of the old Ministry of foreign Affairs building, which has been demolished to make way for a new structure. It is already proving a big convenience for individuals conducting businesses or looking for services in offices located in one street, and then crossing over to look for others on the street across. \nCity of Kigali, according to the Mayor, is determined to build the Rwandan capital into a trend-setting, modern one that is shopping-friendly, easy to walk and characterized by convenient public transport. Ndayisaba and his team have achieved much in the time he has been in office. \nThe big challenge they face now is to as quickly as possible make that one street, KN4 live up to the objectives for which it is billed a pilot phase. Rwanda \nRwanda and DR Congo yesterday launched a fresh round of security talks, a move both countries have described as \"a new … see more » Copyright © 2015 Rwanda Focus. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-09-28T10:08:00.000+03:00", "crawled": "2015-09-28T10:21:57.293+03:00", "highlightTitle": ""}