{"organizations": [], "uuid": "4c4a740b311e5be99e9d565661b1570f60f60af4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/financing/", "section_title": "Forbes - Financing Information and Financing News - Forbes.com", "url": "http://www.forbes.com/sites/amyguttman/2015/09/28/a-successful-vc-and-founder-says-intuition-is-everything/", "country": "US", "title": "A Successful VC and Founder Says Intuition Is Everything", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "A Successful VC and Founder Says Intuition Is Everything", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T22:29:00.000+03:00", "replies_count": 0, "uuid": "4c4a740b311e5be99e9d565661b1570f60f60af4"}, "author": "Amy Guttman", "url": "http://www.forbes.com/sites/amyguttman/2015/09/28/a-successful-vc-and-founder-says-intuition-is-everything/", "ord_in_thread": 0, "title": "A Successful VC and Founder Says Intuition Is Everything", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Successful Spanish VC and founder Iñaki Arrola says intuition is everything. Arrola has had a few successes founding automotive startups, including coches.com , a classifieds site responsible for changing the car market in Spain. Now an angel investor, Arrola also founded VC firm, Vitamina K in Madrid, where he is a partner investing in local and foreign start-ups.As the Barcelona-Madrid battle gets hotter than ever, after Catalonians won a majority of seats in local elections over the weekend, and voted to achieve independence from the rest of Spain within 18 months, I spoke with Arrola to debate each city's entrepreneurial ecosystem and find out why he believes intuition is the best form of due diligence for both founders and investors.[caption id=\"attachment_489771344\" align=\"\" width=\"640\"] The Catalan flag hanging in a city near Barcelona Credit: JOSEP LAGO/AFP/Getty Images[/caption] Guttman: How has your investment philosophy changed? Arrola: I started investing with all my knowledge as an Internet entrepreneur but I found out that when you deploy funds to a start-up everything changes. You cannot know what is going to happen with the evolution of the company. We investors are not that smart but we can help our portfolio companies a lot. Guttman: What have you learned from your biggest mistakes? Arrola: You need to have money for big follow-ons. Sometimes when you’re following on from a good deal, you don’t have that power, so you need maintain your stake in your company. Some companies raise money in several rounds – if you’re one of the first investors, and you don’t have enough money to maintain your stake, you get diluted. For me, for founders, it’s more important to find the right investors and not get ruined by the investors. Guttman: What should people look for in co-investors and investors? Arrola: Years ago, there wasn’t as much money as there is now. You needed to go to certain VC’s who made the rules. Now, there’s a lot more money and you look for a nice investor. A nice investor has two main characteristics: they can help you in lots of ways; they have dealt with almost the same problems and they can help with lots of things. There are some investors who come once and check your numbers are okay and then you never see them. There are some investors who try to get non-economic rights that eventually could make them the owner of some decisions in the company and this is very dangerous for entrepreneurs. It’s tricky because we always believe the investor has the right to do due diligence on the entrepreneurs, but the entrepreneurs need to do due diligence on the investors. This is like a long marriage and this part is the wedding. Find out how they work, do they help you? What happens when things go wrong? What happens when things go right? Do they have enough money for a follow on? Guttman: What about advice for investors? Arrola: Invest in straightforward entrepreneurs. I made a total right off of an investment and my wife told me this was going to happen. Women look at the face of a founder and they can see if they’re going to take care of your money and or whether they’re going to cheat you. My wife and I had dinner with a founder and his wife because we had many things in common. After dinner, my wife said, ‘I don’t know anything about numbers or potential partners, but this guy is going to cheat you.’ It was intuition. And he did. You’re investing in people. Of course you need to analyze a lot of things, but people are at the forefront. The people you want to invest in are those who adapt to bad moments and react as if it’s their own money.I ran a 100k race and was on the same team as a founder. We were at the 98 th kilometre, with just two to go. He told me his foot was injured and hurt, that I could keep running with him, but he would need to run faster in order to finish. I decided then – I want to invest in this guy. He will fight in the face of adversity.My last piece of advice is always hire the best lawyer. Guttman: Despite the financial crisis, Spain’s ecosystem is flourishing, with plenty of funding to go around, and a few promising startups with the potential to go global. What are some of the benefits of starting up in Spain? Arrola: We have long days with lots of light and vibrant cities. When you first start a company in Spain, you can raise 200,000 Euros of government money to help with the first steps of the business. This is a very important part of our ecosystem. The funds are useful in hiring the first employees, or marketing. You don’t have to be Spanish to access the funds only the company needs to be Spanish (based in Spain). Also, we have a good talent pool of developers with lower wages than other places in Europe[/entity], like London or Berlin. Guttman: Do you recommend entrepreneurs attend pitch events with lots of investors? Arrola: The best deals are done by the best investoThe worst start-ups never raise money. Why do the best students attend Harvard and LSE? The best players will always play for Chelsea, Real Madrid, etc. And the best entrepreneurs raise money from the best investors. On average, the best entrepreneurs do not attend investor pitch events. If you are among the best entrepreneurs, you will raise money from Andreessen Horowitz and others like them. Guttman: Madrid or Barcelona? For ecosystems, not football. Arrola: Both. We have nice things in both places and super startups in both cities. We are based in Madrid. I invest in companies anywhere in the world. This is kind of like the competition between Real Madrid and Barcelona. Both are good hubs – we have good and bad. In Barcelona, it’s not easy for people who come from abroad because if you have kids, they need to learn Catalan and Spanish – this is crazy if you come from London. The language can be difficult. I love Barcelona. It’s a much prettier city than Madrid, but if you are a foreigner, living in Madrid is much easier. In Madrid, nobody asks you where you’re from. It’s a place very accepting of foreigners. Guttman: Which Spanish startups have the most potential to go global? Arrola: Wallapop is the most famous because they are growing like crazy. They are in the States. We are investors in CartoDB, which maps and analyzes location data. If I could choose two, I would choose CartoDB , which is B2B and Wallapop, which is B2C. Guttman: How does the future look for foreign investment in Spain’s startups? Arrola: Spain was out of the market a few years ago, but there were lots of people interested in investing n the country and I’m getting calls from lots of countries that want to invest in companies in Spain.", "external_links": ["https://cartodb.com/", "https://www.wallapop.com/", "http://www.coches.com/", "http://inakiarrola.com/", "http://specials-images.forbesimg.com/imageserve/489771344/640x0.jpg?fit=scale"], "published": "2015-09-28T22:29:00.000+03:00", "crawled": "2015-09-28T18:20:34.454+03:00", "highlightTitle": ""}