{"organizations": [], "uuid": "fc396734fcbffa642a40656afa4b5893f92a46e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/a/3/2/c/image.related.afrArticleLead.620x365.gjr8zf.png/1442808554024.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/portfolio-tilts-to-defensive-as-world-outlook-flatlines-20150921-gjr8zf", "country": "AU", "title": "Portfolio tilts to defensive as world outlook flatlines", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Portfolio tilts to defensive as world outlook flatlines | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T12:09:00.000+03:00", "replies_count": 0, "uuid": "fc396734fcbffa642a40656afa4b5893f92a46e6"}, "author": "Jeremy Chunn", "url": "http://www.afr.com/personal-finance/portfolio-tilts-to-defensive-as-world-outlook-flatlines-20150921-gjr8zf", "ord_in_thread": 0, "title": "Portfolio tilts to defensive as world outlook flatlines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trouble is brewing offshore and Implemented Portfolios dialed down risk. NOAA by Jeremy Chunn It's a harsh time to charge a fee for assembling portfolios. Daily volatility levels are high and investors are fearful. A long-term objective that acknowledges risk of loss but is nearly half in defensive assets might calm nerves.\nIn its neutral state, Implemented Portfolios' Number 3 fund would be 40 per cent defensive, chief investment officer Jon Reilly says. But at September 14 the fund was 48 per cent defensive and 52 per cent growth.\nThe fund's cash component is split between BetaShares' popular High Interest Cash exchange-traded fund AAA and bank deposits, but the manager is confident the 40 per cent of funds it has allocated to seven bank-issued income securities is well-timed (its neutral allocation to income securities is 30 per cent).\n\"Income securities is an area where we do look very different from mainstream balanced funds,\" Reilly says. \"And, to be frank, it is an area which has hurt us over the last 12 to 18 months [as bond yields have fallen and active bond fund managers have proven their worth].\"\nThe seven floating-rate, bank-issued notes it holds \"look like particularly good value to us,\" he says. Last week, some bank preference shares were priced to yield more than 7 per cent to maturity.\nDespite occasional hoo-ha among commentators about bank hybrids and preference shares, Reilly says he's confident they will all pay back full face value. \"You're getting margins [above the bank bill swap rate] of 5 per cent, which is similar to a long-term equity risk premium on a defensive investment.\"\nNeutral allocation The fund has a 15 per cent neutral allocation to high-yield income securities, defined as any listed security other than those issued by the big four banks, but it holds none now. Past holdings have included issues by Bendigo and Suncorp. \"At the moment we think we're getting as good or better value in the big banks, which fundamentally have a different risk characteristic, so we're happy to go to zero there.\"\n The overweight to Australian equities has been increased slightly, Reilly says. \"For a lot of last year we were taking money out of the banks and favouring the [Market Vectors] equal weight and small-cap ETFs.\" But the correction in the banks has led the fund to increase its exposure to the majors via the SDPR S&P/ASX 200 Financials ex-REITs (ASX code OZF) and SPDR S&P/ASX 50 (SFY) ETFs. \"We're gradually increasing our exposure. We're going to be pretty prudent and cautious.\" Any overweight tilt to the banks will be modest, he says.\nThe Market Vectors Small Cap Dividend Payers ETF is included to avoid some of the small-cap mining exposure that is part of the small ordinaries index, Reilly says. \"A dividend focus takes care of a lot of that.\" The fund launched only in May.\nThe Market Vectors Equal Weight fund (MVW) is largely a proxy for mid-cap exposure, he says. The equal weight fund favours the \"50 to 100\" area, where the outlook is better, he says. \"There are some gaps in the Aussie ETF landscape in that we don't have a pure mid-cap 50 ETF.\"\nReilly acknowledges there is plenty of doubling up in the Australian ETFs the portfolio holds: MVW, OZF and SFY will all hold many of the same companies. \"On a sector level we're looking at banks, miners and then everything else. Through that combination of ETFs we can manipulate those exposures.\"\nFor property the manager favours the Market Vectors Australian Property ETF.\nAnnual expected return Expected return for Portfolio 3 is 12 per cent, made up of grossed-up income at 8 per cent, earnings growth at 2 per cent and 2 per cent appreciation in valuations, \"which is our annual expected return for the next 10 years, and that looks pretty attractive\", he says.\nThe manager expects the fund to generate 4.49 per cent income.\nThe fund has been underweight in international for a long time, he says. Although the US economy is improving, there are better places to be invested. \"We like China within Asia and Asia within emerging markets.\"\nThe fund has added iShares' MSCI EAFE fund (developed markets ex-North America) as a vote of confidence for Europe and Japan.\nResisting the practice of assigning misleading names to funds, the firm runs five portfolios numbered 1 to 5, where Portfolio 1 is mainly income assets and Portfolio 5 is mainly Australian and global equities.", "external_links": [], "published": "2015-09-21T12:09:00.000+03:00", "crawled": "2015-09-21T14:54:01.684+03:00", "highlightTitle": ""}