{"organizations": [], "uuid": "6cd3463c1a30b17dc306a51590eb65f684fdbc9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-BV327_linked_MG_20140225115257.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/5-reasons-you-hate-linkedin-so-much-2015-07-28", "country": "US", "title": "5 reasons you hate LinkedIn so much", "performance_score": 0, "site": "marketwatch.com", "participants_count": 15, "title_full": "5 reasons you hate LinkedIn so much - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 14, "uuid": "67b27c4d8cc21b0038e60b2081e88595d67b0e2d"}, "author": "By     Catey Hill", "url": "http://www.marketwatch.com/story/5-reasons-you-hate-linkedin-so-much-2015-07-28#post-0", "ord_in_thread": 0, "title": "5 reasons you hate LinkedIn so much", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shutterstock Despite the fact that we spend hours poring over our exes’ posts on Facebook FB, -1.84% , tweeting snapshots of our perfectly staged meals, and trying to angle our way into a better job on LinkedIn, Americans just aren’t happy about the social media sites they frequent — particularly LinkedIn LNKD, -2.09% .\nFor the sixth year in a row, Americans say they dislike social media companies more than most other industries, including banks, discount stores and cellphone companies, according to a survey of 5,400 customers released Tuesday by the American Customer Satisfaction Index . Indeed, social media firms rank in the bottom one-third of the more than 40 industries the index measures, with a customer satisfaction score of just 74 out of 100.\nACSI managing director David VanAmburg says these low marks are likely a function of two things: privacy issues that continue to plague these sites and the plethora of advertising many of these sites have. And he says that they’ll persist as long as they continue using their current business model.\nCareer networking site LinkedIn gets the worst marks in the survey when it comes to social media companies (and, indeed, is consistently near the bottom of the social media rankings, VanAmburg notes). He says this may be due, in part, to the fact that “because it is a business social network, we tend to have higher expectations than one for just social/personal users” and also due to users having trouble using the site.\nTable: The most liked — and disliked — social media companies\nCompany\nScore (out of 100)\nPinterest\n78\nInstagram\n76\nGoogle+\n75\nFacebook\n75\nTwitter\n71\nTumblr\n69\nLinkedIn\n68\nAverage Score\n74\nWe wanted to know more, so we asked professionals from around the country — many of them frustrated about LinkedIn — what it is about the site they don’t like. Here are some of the answers we received.\nYou get too many unwanted connection requests.\nMany users among the dozens of professionals we talked with complained to us about the fact that their inboxes get clogged with connection requests (and then reminders of those connection requests) from people they don’t know, don’t want to know and/or don’t want to connect with. Talent officer Melissa Margoulis notes that she gets “totally inappropriate solicitation emails” from “some very creative people [who] have started using this platform as the next e-harmony.”\nWhat’s more, sometimes people feel these connection requests might be dangerous. Angela Copeland, a career coach at Copeland Coaching , says that “some people who contact you appear to be spammers, or scammers” and St. Paul, Minn.-based Becky Cole, who helps put in place processes to improve businesses, says she’s been contacted by two scammers.\nIt’s laborious and hard to use.\nMany users think that using the site — be it figuring out how to maximize the settings to make the site more useful, or knowing how best to promote your business — is difficult. “LinkedIn has to work on improving its user interface and making it friendlier,” says Cheyenne, Wyoming-based sales consultant Sam Carter says -- who feels that doing things like publishing articles and media and promoting your business page are “much easier” to do on Facebook.\nPrev Page 1 2 Next Page", "external_links": ["http://www.theacsi.org/"], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-07-31T06:38:32.918+03:00", "highlightTitle": ""}