{"organizations": [], "uuid": "937c09797141b944db293a736ad651b8444959be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/h/5/v/f/p/image.related.articleLeadwide.620x349.gidm85.png/1437027069678.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/25/consumer-discretionary", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/the-economy/jordan-says-theres-already-a-fresh-set-of-eyes-to-assess-small-business-disputes-20150716-gidm85.html", "country": "AU", "title": "Jordan says there's already a \"fresh set of eyes\" to assess small business disputes", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Jordan says there's already a \"fresh set of eyes\" to assess small business disputes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "937c09797141b944db293a736ad651b8444959be"}, "author": "", "url": "http://www.smh.com.au/business/the-economy/jordan-says-theres-already-a-fresh-set-of-eyes-to-assess-small-business-disputes-20150716-gidm85.html", "ord_in_thread": 0, "title": "Jordan says there's already a \"fresh set of eyes\" to assess small business disputes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tax commissioner Chris Jordan says the ATO is trying to resolve disputes with small business more quickly and fairly. Photo: Daniel Munoz\nTax commissioner Chris Jordan says small business disputes with the ATO will now be assessed by \"a fresh set of eyes\", even though the person who heads the area is answerable to him.\nBefore being elected treasurer, Joe Hockey said the Coalition might consider separating the policing and administration functions of the Australian Tax Office .\nMr Jordan's comments come ahead of any government moves to carve up the ATO or introduce an new, independent second commissioner within the ATO to hear taxpayer appeals .\nThe first assistant commissioner in charge of hearing small business disputes is Debbie Hastings. Photo: Bradley Kanaris\nThe latter recommendation has been made to the Abbott government by the Inspector-General of Taxation, Ali Noroozi, but has faced strong resistance from Mr Jordan.\nAdvertisement Speaking at the Council of Small Business Australia (COSBOA) conference in Sydney, Mr Jordan addressed concerns by small business taxpayers that they were being unfairly treated by the ATO when disputes about tax assessments arose.\nCowboy auditors The parliamentary inquiry into tax disputes earlier this year heard from individual taxpayers and small businesses who had lost their businesses and livelihoods because of \"cowboy\" ATO auditors hitting them with tax bills that were later proved to have no basis.\nThe Standing Committee on Tax and Revenue that held the inquiry recommended that the law be changed so that people and companies charged with tax fraud or tax evasion should be granted the presumption of innocence in court .\nMr Jordan said moves were afoot to reduce lengthy disputes and treat taxpayers more fairly.\n\"I'm pleased to announce that this month, we moved all of our small business objections work out of our compliance group to our separate review and dispute resolution area under a different second commissioner,\" he said.\n\"This is intended to give anyone in dispute with us a fresh set of eyes to the issue.\"\nThe first assistant commissioner in charge of small business disputes is Debbie Hastings, and she will be helped by second commissioner Andrew Mills .\nBut both commissioners still answer to Mr Jordan. This is different to the structure recommended to the government by Mr Noroozi, who says the commissioner heading disputes with taxpayers should answer to the Treasurer, not the commissioner.\nMr Jordan does not believe such a model is needed.\nLet's avoid going to court He said the ATO was offering independent in-house facilitators to bring parties together before matters went to court.\n\"Alternative dispute resolution is cheaper, faster and often a more successful path to sorting things out instead of drawn-out legal disputes,\" he said.\nThe ATO had also revised its Code of Settlement - an agreement between parties to resolve matters in dispute if one or more parties make concessions on what they consider is the legally correct position.\n\"It replaces the 1999 code and sets out the factors to be considered when deciding whether or not to settle,\" Mr Jordan said. \"Of course, not at any cost, but where it is beneficial and practical to do so.\"\nMr Jordan said the ATO would still litigate cases if there was a \"contentious or uncertain point of law which requires clarification, and it is in the public interest to seek law clarification through litigation\".\nIt would also go to court if it needed to \"send a strong message to an individual – or broadly to the community that we won't sit idly by\", where there was a longstanding unresolvable debt, or where alternative means of resolving the dispute has been unsuccessful.\nThose that \"deliberately don't register, pay cash-in-hand wages, fail to pay their employees' super and do not report all their income,\" would be pursued, he said.\nSMS can help in collecting tax debt Mr Jordan also responded to a report this week by Mr Noroozi that showed over $20 billion of tax debt is still owed, the majority (60 per cent) by small business.\nThe report found that a tougher approach to debt collection from the ATO was sending small businesses to the wall .\nMr Jordan said businesses that did not pay their tax debts were gaining an unfair financial advantage over others.\n\"Our intention is to be more active to prevent debts, to provide appropriate help and support when people are in debt, to take the right action to prevent debts from escalating, and to take legal action earlier when it is warranted,\" he said.\nThe ATO was sending SMS reminders to \"habitual late payers\" to pay up.\nThis was a \"friendlier way\" to encourage debts got paid.\nOver the past eight months, the ATO had identified key payment dates where there were more than 7 million individual and small business income tax and business activity statement obligations due.\n\"Analytics identified that around 6 million would be paid on time,\" Mr Jordan said. \"Of the remaining 1 million, 250,000 taxpayers who typically paid late with estimated liabilities worth $1.3 billion were sent an SMS reminder of the due date for payment.\n\"From this group of typical late payers, liabilities of over $830 million were paid on or near time. SMS reminders increased payments on time and the set-up of payment plans much earlier than usual.\"\n Mr Jordan said the ATO was \"working with clients in debt who habitually do not respond to our help and support approaches, or habitually default on their payment arrangements\".\nmyTax tech issues being resolved The ATO has also been under fire as \"technical difficulties\" continue to plague the myTax online tax-lodgment portal .\nThe online return - which is predicted by the ATO to be used by 5 million individuals lodging online tax returns this year – has come under criticism from some taxpayers.\nMr Jordan said \"in the first week or so we did have some teething problems\" but that this was \"expected with any new or vastly expanded service\".\nHe said the ATO had processed almost 20 per cent more online lodgements than the same time last year through our myTax and e-tax products.\nAlmost 350,000 people had lodged using the myTax service - more than double the same time last year - and the ATO had issued more than 220,000 refunds worth almost $900 million.\nNext year myTax would be available for all individuals, including those with business income, and the ATO would be dropping e-tax altogether.", "external_links": ["http://www.afr.com/it-pro/atos-new-man-andrew-mills-is-gunning-20140916-jyrsq", "https://www.ato.gov.au/General/Dispute-or-object-to-an-ATO-decision/In-detail/Avoiding-and-resolving-disputes/Settlement/Code-of-settlement/", "http://www.brw.com.au/p/business/hockey_keeps_singing_chris_split_Rmo3etbCuw2SuiGvZ832ZM"], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T20:45:51.000+03:00", "highlightTitle": ""}