{"organizations": [], "uuid": "b4cff133f303e0f0f07665de91d5089511244f61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/images/print-edition/20150704_FNP001_0.jpg", "site_section": "http://www.economist.com/rss/finance_and_economics_rss.xml", "section_title": "The Economist: Finance and economics", "url": "http://www.economist.com/news/finance-and-economics/21656721-how-china-continues-reshape-world-commodities-cornering-markets", "country": "US", "title": "Cornering the markets", "performance_score": 0, "site": "economist.com", "participants_count": 2, "title_full": "Cornering the markets | The Economist", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T03:00:00.000+03:00", "replies_count": 1, "uuid": "680b3914fb9f59ee6afd9f010ac8ca36e45ec90c"}, "author": "From the print edition", "url": "http://www.economist.com/news/finance-and-economics/21656721-how-china-continues-reshape-world-commodities-cornering-markets#post-0", "ord_in_thread": 0, "title": "Cornering the markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE world’s biggest consumer of commodities is no longer just an insatiable buyer of everything from coal to gold. A richer, slower-growing and choosier China is becoming an exporter as well as importer. It is also using its clout to change the way commodities are traded, bringing markets closer to home and drawing up rules that suit its needs instead of those of producers and Western financiers.\nThis week, for example, Chinese regulators gave the go-ahead for foreigners to trade crude-oil futures in Shanghai. When that starts—probably by November—it will be the first time that outsiders have been allowed to buy and sell a listed Chinese futures contract. This is part of a clear plan to change the way commodities are traded, says Owain Johnson of the Dubai Mercantile Exchange (DME). The exchange in Dalian, a port through which many commodities enter China, has become the biggest trading centre for iron ore in the world in less than two years. Shanghai has developed big markets in nickel and copper.\nIn this section Cornering the markets Right back where we started A Caribbean fuse Small is ugly Beautifying bankruptcy A middle-class mirage Credit where taxes are due Business Commodity markets Financial markets China Shanghai\nMany expect more gold trading to move to China too. Allegations of rigging have rocked the current hub, in London. China—the world’s largest producer of bullion—announced on June 26th that it would launch a yuan-denominated gold contract in Shanghai by the end of the year. China is reaching “critical mass” in its influence on commodity prices,” says Grant Sporre of Deutsche Bank.\nThis is a much more sophisticated way of wielding clout than in the past. An attempt by China in 2010 to corner the market in rare earths—17 exotic metals used in tiny quantities in many modern devices—failed spectacularly. China, which at the time produced 97% of the ores for rare earths, banned exports in the hope of bringing the business of processing these deposits onshore. But rare earths proved not so rare: companies elsewhere revived old mines and ramped up production; by late 2011 prices had plunged.\nThe goal now is to seize control of price formation. The main global benchmark for crude oil, Brent, relies on data compiled by price-reporting agencies about deals done during a short “window” in the middle of the trading day. State-controlled Chinese oil companies have been playing an increasingly active role in that process, but from the Chinese government’s point of view, bringing the trading closer cuts costs and reduces the impact of events in faraway places from which the country imports little oil. “They ask: ‘Why should a Norwegian oil workers’ strike affect our economy?’” says Mr Johnson.\nAs the world’s biggest importer, China wants its own benchmark instead, based on transparent and comprehensive data, priced in its own currency and governed by its own laws. The Shanghai oil-futures contract aims to achieve that goal.\nAs exchanges in mainland China grow, rivals are feeling the squeeze. The Shanghai Futures Exchange is impeding efforts by Hong Kong Exchanges and Clearing to expand its metals-trading business, following the acquisition of the London Metal Exchange in 2012. In March the Shanghai exchange threatened to sue its Singaporean counterpart for copying a futures contract.\nSeveral obstacles lie ahead, however. Outsiders will not be keen to bear the exchange-rate risk of trades denominated in yuan. The security of the English legal system in case of disputes will be hard to match. Confidence has been dented by a scandal involving Chinese commodity warehouses, in which metals were used as collateral for letters of credit to get around foreign-exchange restrictions.\nChina is putting a fresh imprint on commodity markets in other ways too. As its economy slows and investment gives way to consumption as the mainstay of growth, the country’s needs are changing. Demand for primary products used mainly in housing and infrastructure—coal, iron ore, steel and aluminium—is slowing. China has already hit “peak coal” (consumption is falling, amid worries about air pollution); peak steel is not far off, with growth of only 1-3% likely after a dip last year. Even copper is fading a bit. Consumption used to grow faster than GDP, notes Colin Hamilton of Macquarie, a bank; now it lags. A related headache is that China, once a sponge for raw materials, is becoming an exporter of things like stainless steel and aluminium, thanks to cheap and abundant power, growing technological nous and a glut of smelting capacity.\nInstead, exporters must look to other commodities for growth. Richer Chinese consumers are stoking demand for dairy products, meat, chocolate and jewellery. That has an effect both on those items directly and on the commodities used to produce them. While imports of iron ore wane, for example, demand for soyabeans, which are used mainly to feed livestock, continues to grow rapidly (see chart). That is partly because China has paved over lots of soya farms, but mainly because meat consumption is up.\nYet it is not certain that this trend will persist. The average Chinese already consumes more calories than the global average, and almost 85% of the American level. A healthy switch from pork to chicken would actually cut demand for agricultural commodities, notes Capital Economics, a consultancy. Hershey, a big confectionery company, has had to trim its forecasts for sales growth in China.\nWhether China adopts old Western habits or opts for thriftier and healthier ones will shape the commodities industry. But its impact on trading is even more immediate. As every good capitalist knows, the customer is always right. China is using its buyer’s clout to ensure that commodities are traded the way it wants.\n ", "external_links": ["http://cdn.static-economist.com/sites/default/files/imagecache/full-width/images/print-edition/20150704_FNP001_0.jpg", "http://cdn.static-economist.com/sites/default/files/imagecache/original-size/images/print-edition/20150704_FNC846.png"], "published": "2015-07-04T03:00:00.000+03:00", "crawled": "2015-07-03T21:11:59.000+03:00", "highlightTitle": ""}