{"organizations": [], "uuid": "b03b601cec5103f5d99f70b2fcb9ade67577abc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/B5Nm1HC0WaYSH95puspCyg--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/https://s1.yimg.com/os/publish-images/finance/2015-07-17/297213a0-2c61-11e5-a365-75c3fecda286_PA-6560442.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-yahoofinance/?format=rss", "section_title": "Finance News | Yahoo! Finance UK - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/david-cassidy-s-fort-lauderdale-home-headed-for-bankruptcy-auction-131819688.html", "country": "US", "title": "David Cassidy's Fort Lauderdale home headed for bankruptcy auction", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "David Cassidy's Fort Lauderdale home headed for bankruptcy auction", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T16:18:00.000+03:00", "replies_count": 0, "uuid": "b03b601cec5103f5d99f70b2fcb9ade67577abc1"}, "author": "", "url": "https://uk.finance.yahoo.com/news/david-cassidy-s-fort-lauderdale-home-headed-for-bankruptcy-auction-131819688.html", "ord_in_thread": 0, "title": "David Cassidy's Fort Lauderdale home headed for bankruptcy auction", "locations": ["Fort Lauderdale"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Cassidy"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 17, 2015, 14:33 BST - UK Markets close in 1 hr 57 mins David Cassidy's Fort Lauderdale home headed for bankruptcy auction By Jennifer Karmon - Yahoo US Homes | Yahoo Finance UK – 15 minutes ago Print The 7,000-square-foot Florida home of 1970s teen idol David Cassidy is to be auctioned off in September, as ordered by the U.S. Bankruptcy Court in South Florida. It's the culmination of several years of legal problems for the star of \"The Partridge Family.\" \nAt least we hope it's the culmination. \nSeven years ago, Cassidy made \"what may have been the most courageous on-stage appearance of his life,\" according to a local newspaper : He told a crowd of hundreds, \"Tonight, I am publicly stating that I am an alcoholic.\" That was in August 2008. He was two months sober, having just come out of the Betty Ford Center. David Cassidy performs at the Hammersmith Apollo, London, in 2008 (PA/Suzan / Suzan/EMPICS Entertainment) \nYet it wasn't the end of his slide. In November 2010, August 2013 and January 2014, he was arrested for driving under the influence. A month after the third DUI, his wife filed for divorce, telling TMZ that the split had been \"looming for some time\" but that \"I am truly heartbroken that our marriage is ending.\" He was in court-ordered rehab at the time, and Sue Shifrin Cassidy also told TMZ: \"I'm glad David is getting the help he needs and I am confident he will come back better and stronger than ever.\" She declined to say whether his alcoholism was a factor in their breakup. \nThey had been together for 28 years and married for 23. They have a son, Beau, born the year they were married. \nDavid Cassidy filed for Chapter 11 bankruptcy about five months ago, and soon after, Shifrin Cassidy sued to be considered a creditor. He reportedly has monthly expenses of $27,000 (£17k) and an income of $12,500 (£8.2k) a month. \nThey bought the property in 2001 for $1.1 million but substantially rebuilt it in 2006. They've been trying to sell it since August 2013, when they listed it at $4.5 million (£2.9m). It has undergone several price cuts and was most recently asking $2,950,000 (£1.9m). \nThe gated estate has 5 bedrooms and 7 bathrooms. The waterfront lot measures nearly half an acre. \nThe auction is scheduled for 11am September 9. But this is not the first home that Cassidy has lost: In 2010, he stopped making payments on a Fort Lauderdale condo he owned — a \"strategic default,\" his lawyer said — and his creditor started foreclosure proceedings. Cassidy fought for two years, claiming predatory lending, before finally handing over the keys in 2012 . His lawyer said Cassidy settled to protect his image and avoid the \"stigma of foreclosure.\" Around the same time as the settlement, Cassidy suffered an onstage \"meltdown\" that his publicist attributed to a bad medication combination. Former teen idol David Cassidy, star of the 1970s TV show \"The Partridge Family,\" has been entangled in a messy divorce from his wife of 23 years after a series of DUI arrests. Their home in Fort ... more Former teen idol David Cassidy, star of the 1970s TV show \"The Partridge Family,\" has been entangled in a messy divorce from his wife of 23 years after a series of DUI arrests. Their home in Fort Lauderdale, Florida, will be auctioned off in September by order of the U.S. Bankruptcy Court.   Also on Yahoo Homes:", "external_links": [], "published": "2015-07-17T16:18:00.000+03:00", "crawled": "2015-07-17T16:33:42.000+03:00", "highlightTitle": ""}