{"organizations": [], "uuid": "a459c6e0531cb378ea2a61d9b26eb644f7e6e528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static3.businessinsider.com/image/5594ea3add08959e4d8b459c/paranoia-and-distrust-are-the-new-currencies-in-athens.jpg", "site_section": "http://feedproxy.google.com/clusterstock?format=xml", "section_title": "Finance", "url": "http://www.businessinsider.com/greek-referendum-voting-paranoia-and-distrust-in-athens-2015-7", "country": "IL", "title": "Paranoia and distrust are the new currencies in Athens", "performance_score": 0, "site": "businessinsider.com", "participants_count": 1, "title_full": "Paranoia and distrust are the new currencies in Athens", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T10:55:00.000+03:00", "replies_count": 0, "uuid": "a459c6e0531cb378ea2a61d9b26eb644f7e6e528"}, "author": "Mike Bird", "url": "http://www.businessinsider.com/greek-referendum-voting-paranoia-and-distrust-in-athens-2015-7", "ord_in_thread": 0, "title": "Paranoia and distrust are the new currencies in Athens", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "print \nREUTERS/Marko Djurica Pro-Euro protestors attend a rally in front of the parliament building, in Athens, Greece, June 30, 2015. \nATHENS, Greece — With Greece's referendum just three days away and too close to call, the political situation is tense. People seem to know that whichever way the vote goes, it will be monumental for the country. \nI think there's probably less visible economic trauma than people expect, at least in Athens. \nThere are queues for banks and the vestiges of five years of depression — shuttered shops and people sleeping in the streets — but no panic. That's partly because for many people, the €60 ($ 66.41, £42.48) per day limit on cash withdrawals is more than they have . \nBut there is a clear and growing distrust between the two camps. \nWhat's notable is the lack of good faith. There was a letter in the New York Times written by a former Greek finance minister, George Papaconstantiou, which attacked Paul Krugman's approach to the referendum, and ended with this line: It is no exaggeration to say that Greece is today slowly sliding toward totalitarianism. And a “no” vote in Sunday’s referendum will be one more step in that direction. Progressives should not provide intellectual cover for this. \nIt was shared widely on my Twitter feed, and I found it a little astonishing. Is Greece really sliding towards totalitarianism? I can't see any signs of a crackdown here. The current government was democratically elected, and pursued a hard negotiating stance which (at least to begin with) most people seemed to agree with. \nThat fits with what pro-euro demonstrators told me on Tuesday. Some suggested that Greece's Prime Minister Alexis Tsipras actively wanted a return to the drachma. \nIt's not just on the pro-euro side. The Syriza supporters I've spoken to each seem to have their own potted theory, involving some combination of global banks, local oligarchs, the Greek media, and unfriendly Europeans to blame. Finance minister Yanis Varoufakis referred to the \" domestic Troika \" during May — the internal fifth column undermining the government. \nRumours that pro-European parties will try to effectively overthrow Syriza are rife: the leaders of PASOK, To Potami and New Democracy all visited Brussels during the bailout negotiations at the end of June, sparking chatter on social media that they were organising themselves for a coup, and getting approval from Europe. \nThese sort of theories aren't totally unique to Greece — someone I was at dinner with on Wednesday reminded me of how ridiculous some of the online politics was during the Scottish referendum debate. But Greece's potential exit, unlike Scotland's, would have a far less smooth transition. \nMike Bird, Business Insider This leaflet, handed out by pro-euro campaigners for a yes vote, saying that a No vote means uncertainty, humiliation, schism, isolation and the return of the drachma. \nI spoke to Mihalis Panayiotakis, a Syriza activist and member of the party's digital policy team, about the social divisions in the country: \"Civil-war era divisions are being dredged up. This is stuff we thought was ancient history in the 1990s.\" \nI also noticed that the \"Yes\" demonstration in favour of the bailout certainly looked more middle-class than the \"No\" demonstration against one. \nPanayuotakis added: \"There's certainly a class division. There are people who have lost everything, and people who are still just about making it. For the people who have seen their friends and family going hungry and sleeping on the streets, what more can you take away from them? What do they have to lose?\" \nWith Greece split by class and affiliation, there are few good outcomes from the vote on Sunday. Those who want to accept the bailout terms and turn the clock back 12 months will be disappointed — if Greece votes \"Yes\" Alexis Tsipras will still be Prime Minister, and Syriza currently has no plausible opposition. Support for New Democracy, the former governing party, has shrivelled. \nIf Greece votes \"No,\" then the rupture may mean leaving the eurozone. A narrow victory for either side also produces huge problems, since a major proportion of the population will argue that they didn't endorse this momentous decision. \nThere's a much darker side to the paranoid conspiracy theories about what's going on in Greece, too. The first person I spoke to queueing for money in Athens blamed a Rothschild-led conspiracy of Zionists for the crisis. The openly fascist Golden Dawn got 6.3% of the vote at the last election. \nIt's often said that the European project doesn't work well because there's a lack of trust and solidarity between the European nations — but it feels like that's equally as true of internal Greek politics too.", "external_links": [], "published": "2015-07-02T10:55:00.000+03:00", "crawled": "2015-07-02T11:14:54.000+03:00", "highlightTitle": ""}