{"organizations": [], "uuid": "7a9b214df256c03234470555d6529d12e2ce595a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/9/a/d/o/image.related.afrArticleLead.620x365.gi95e0.png/1436490468058.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/world/australia-in-denial-about-chinas-iron-ore-double-whammy-says-stephen-roach-20150710-gi95e0", "country": "AU", "title": "Australia in 'denial' about China's iron ore 'double whammy', says Stephen Roach", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Australia in 'denial' about China's iron ore 'double whammy', says Stephen Roach | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T09:00:00.000+03:00", "replies_count": 0, "uuid": "7a9b214df256c03234470555d6529d12e2ce595a"}, "author": "John Kehoe", "url": "http://www.afr.com/news/world/australia-in-denial-about-chinas-iron-ore-double-whammy-says-stephen-roach-20150710-gi95e0", "ord_in_thread": 0, "title": "Australia in 'denial' about China's iron ore 'double whammy', says Stephen Roach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stephen Roach, former Morgan Stanley chief economist and now a visiting fellow at Yale University, says Australia is unprepared for the way China's economy is changing. Louise Kennerley Share on twitter Share on Google Plus by John Kehoe Stephen Roach, one of Asia's most experienced bankers, has warned that commodity-exporter Australia is in \"denial\" about the \"double whammy\" hit from China's shifting economy, as the price of iron ore slumps towards a decade low.\nMr Roach, a former chairman of Morgan Stanley's Asia business, said Australians were underestimating the negative consequences of weakening commodity demand as China's economy transforms from being driven by investment in fixed assets and exports to domestic consumption.\nHe told The Australian Financial Review there would be \"huge consequences for commodity exporting nations like Australia\".\n\"For the nations that were banking on China staying the course of the old manufacturing commodity-intensive investment led growth model, I think there will be a lot of disappointment,\" said Mr Roach, now a senior fellow at Yale University's Jackson Institute of Global Affairs.\n\"The new growth dynamic is slower, services intensive and commodity-light rather than commodity heavy.\"\n\"Australia is right on the leading edge of being in denial about what this shift means for China's claim on global commodity markets.\"\n\"It's a double whammy for a country like Australia.\"\nDespite the Chinese share market rout, he brushed it off as a necessary correction and expressed confidence that Beijing's leaders would successfully navigate the tricky economic transition.\n The price of iron ore, Australia's biggest export, fell for the ten days running, including a 10 per cent dive to $US44.59 on Wednesday, before rebounding 9.9 per cent to to $48.99 on Thursday.\nThe price dive, from a peak of around $US180 in 2011, is rendering smaller miners unprofitable, hitting the share prices of major players BHP Billiton and Rio Tinto and is likely to blow out Treasurer Joe Hockey's budget.\nThe Chinese government's top steel-industry forecaster says production will fall this year for the first time in two decades, a drop that could cost the federal government more than $6 billion over the next two years .\nThe commodity bear market coincided with China's stock market plunging almost 40 per cent over the past month, before shares in Shanghai regained some ground entering the weekend.\nHigher cost smaller miners are struggling to stay afloat in the iron ore market, with several being forced to consider shutting mines and asset sales.\nBHP chief commercial officer Dean Dalla Valle said this week that China's economic growth model was shifting from investment to consumption, but that it will remain \"a significant contributor to world growth and its demand for energy and commodities continues to be within our expected range\".\nChina's economy continues to slow and economists tip it will struggle to grow at 7 per cent this year.\nMr Roach, chief economist for the bulk of his 30-year career at Morgan Stanley where he also chaired its Asian business, is not bearish on China.\nHe said the stock-market appeared to be disconnected from the economy, and that share prices had not been a reliable indicator for China's economic performance.\n\"I would draw a distinction between the bursting of a speculative stock market bubble and the more enduring structural transformation of the Chinese economy with lasting consequences for commodity exporters like Australia.\"\nMr Roach said China's economic fundamentals were better than most countries.\n\"It's not that China is slowing,\" he said.\n\"They are at the early stages of what I think will be a successful transition.\"\nThe Chinese economy is shifting from commodity-intensive construction to internal consumption, but BHP believes there will still be strong demand for steel-making commodities as China's economy matures.\nThe emerging middle class will need more vehicles for transport and BHP says China's demand for cars could reach 300 hundred vehicles per 1000 people by 2030 – less than half of the 700 per 1000 in the United States.", "external_links": ["https://twitter.com/Johnkehoe23", "https://plus.google.com/https://plus.google.com/u/2/b/117110503471959828934/105888713093633772087/posts"], "published": "2015-07-10T09:00:00.000+03:00", "crawled": "2015-07-10T06:06:51.000+03:00", "highlightTitle": ""}