{"organizations": ["Million Investment Into GroupBy Inc"], "uuid": "d62d38bdbff8bdcf8d2a81384eb57a389ad90dd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.co.uk", "main_image": "", "site_section": "http://www.prnewswire.co.uk/rss_feeds_basic/fnc/", "section_title": "PR Newswire: Financing Agreements", "url": "http://www.prnewswire.co.uk/news-releases/best-funds-announces-3-million-investment-into-groupby-inc-517522091.html", "country": "US", "title": "BEST Funds Announces $3 Million Investment Into GroupBy Inc.", "performance_score": 0, "site": "prnewswire.co.uk", "participants_count": 0, "title_full": "BEST Funds Announces $3 Million Investment Into GroupBy Inc.", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T14:30:00.000+03:00", "replies_count": 0, "uuid": "d62d38bdbff8bdcf8d2a81384eb57a389ad90dd5"}, "author": "", "url": "http://www.prnewswire.co.uk/news-releases/best-funds-announces-3-million-investment-into-groupby-inc-517522091.html", "ord_in_thread": 0, "title": "BEST Funds Announces $3 Million Investment Into GroupBy Inc.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEST Funds Announces $3 Million Investment Into GroupBy Inc. \n- Toronto -based private equity/venture capital firm confirms debt deal with award-winning Ecommerce Technology Company \nTORONTO , July 20,   Tier One Capital LP and B.E.S.T. Active 365 Fund LP, collectively known as BEST Funds, has announced a $3 million investment into GroupBy Inc., a leading ecommerce technology innovator located in Toronto, Ontario . The capital will allow GroupBy to accelerate their sales growth and expand research and development efforts in ground-breaking technologies for the B2C and B2B ecommerce market. \nThis is an exciting partnership for BEST Funds, who provides Canada's fastest growing companies with the capital needed to accelerate their growth and become industry leaders. BEST Funds' President John Richardson stated, \"GroupBy is poised to become a market leader in the ecommerce space and is the type of company that can do great things with our assistance. We are confident that with our capital, and their unique cloud offering and ecommerce pedigree, GroupBy will continue to grow at an extraordinary pace.\" \nRegarding the partnership, Roland Gossage , Managing Director & CEO of GroupBy Inc. said, \"The team here at GroupBy has used their many years of industry experience and technical prowess to create a platform that will change the way our clients interact with their clients online, we aim to create a fundamentally better user experience, by showing the right product, to the right user, at just the right moment. Creating a concrete return on investment and helping to drive our customers bottom lines.\" \nAbout BEST Funds BEST Funds is a leading Private Equity/Venture Capital firm that focuses on funding rapidly growing Canadian companies by providing them with the capital needed to execute their growth strategies and fully develop their Intellectual Property. Primarily focused on companies with recurring revenue streams in the technology, healthcare and financial services industry, BEST Funds is actively deploying capital to some of Canada's fastest growing companies. BEST Funds was established in 1996 in Toronto and works with companies across Canada .For more information, visit: www.bestfunds.ca \nAbout GroupBy Inc. GroupBy Inc. provides powerful commerce, media, and knowledge management software solutions that help companies better connect with their customers by creating a more relevant user experience. This improved experience drives more targeted site traffic, increases revenue, and boosts overall customer satisfaction. GroupBy's solutions provide industry-leading features for search, navigation, merchandising, search engine optimization (SEO), and search as you type (SAYT). Their e-commerce solution, Searchandiser powers many of the world's top retailers' online experiences. GroupBy has offices in Canada , United States , China , and Trinidad & Tobago . \nFor more information about GroupBy, visit www.groupbyinc.com or call +1-855-210-6513 \nSOURCE GroupBy Inc.", "external_links": [], "published": "2015-07-20T14:30:00.000+03:00", "crawled": "2015-07-20T17:30:22.662+03:00", "highlightTitle": ""}