{"organizations": [], "uuid": "b46c476e435ebdc022eb55cd9e0599f7162191c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/e/6/9/i/image.related.afrArticleLead.620x365.gilt09.png/1438047624037.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/personal-finance/tax/how-to-pay-no-tax-on-1m-20150728-gilt09", "country": "AU", "title": "How to pay no tax on $1m", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How to pay no tax on $1m | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T09:40:00.000+03:00", "replies_count": 0, "uuid": "b46c476e435ebdc022eb55cd9e0599f7162191c8"}, "author": "Joanna Mather", "url": "http://www.afr.com/personal-finance/tax/how-to-pay-no-tax-on-1m-20150728-gilt09", "ord_in_thread": 0, "title": "How to pay no tax on $1m", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Treasurer Joe Hockey says he will take a look at Labor's idea for a minimum income tax on higher earners. Alex Ellinghausen Share on twitter by Joanna Mather William Buck tax services director Greg Travers says it's certainly possible for someone earning over $1 million to reduce his or her tax bill to zero, or close to it.\nDebate over tax minimisation has flared after Labor's national conference last week agreed that a future government would look at a so-called Buffett rule, which would ensure everybody with income over $300,000 paid 35¢ in the dollar in tax.\nThe idea is to eliminate the limit the use of deductions so taxpayers cannot drop below an average 35 per cent tax rate, which is what a salary earner on $300,000 would pay - if they had no tax deductions.\nTax Office figures show at least 55 taxpayers earned more than $1 million but paid no tax in 2011-12 and 2012-13.\nHigh-income, low tax Travers says these are wealthy people with complex tax affairs; they're likely to be deploying multiple strategies. And legally so.\n\"These aren't usually salary and wage earners,\" he says.\n\"Your salary income goes straight into your tax return and all you can do is try to claim deductions. But $1 million is a lot of deductions to be claiming.\n\"It tends to be either investors or business owners. There might be a few executives from large corporates but that's not going to be the majority.\"\n High-income, no tax. Here are some other ways that Travers says someone with income over $1 million could reduce their tax to below the tax-free threshold, which is $18,200.\n❑Negative gearing: Borrowing to buy shares and property, and not necessarily simply into Sydney residential property. If you have a geared share portfolio yielding $300,000 in dividends (comprising $210,000 and franking credits of $90,000, you would be liable for tax of around $18,000, a 6 per cent rate.\n❑ Business losses: \"I've got people that have lost millions of dollars in business activities and it takes them quite a number of years to recoup all those tax losses,\" Travers says.\nIf losses exceed income, they pay no tax because there is no profit in a given year. Business borrowing in an individuals' name but the deduction is claimed by the entrepreneur. This means the loss would turn up in the individuals' tax affairs but tax is paid by the business.\n❑ Earn foreign income: If an individual pays income tax overseas he or she can claim a credit in Australia. Somebody who works in America for half of the year, for example, might pay income tax over there. The income is still reported in Australia but to avoid double taxation, the Tax Office gives a credit.\n❑ Capital gains tax rollover: If someone sells a business for $2 million under the concessions in the tax law they could legitimately pay no tax on that.\nThat comes from a combination of the 50 per cent capital gains tax discount and small business concessions.\n\"What those laws were intended to do is reflect the fact that is a one-off scenario for those people. Quite often they haven't taken as much income along the way because they've invested it all in the business and they haven't paid themselves superannuation.\"\n❑ Give it away. Travers has a client at the moment who plans to do just that. This gent (let's call him Jim) has owned a business for 20 years and has just sold it.\nRather than paying tax at his personal rate - 49¢ in the dollar including the Medicare and deficit levies - Jim plans to give $1 million to charity. That deduction means he will not pay any tax on that income. Then again, he won't get any other material benefit either.\nAustralian Tax Office statistics show charitable donations are the second biggest category of deduction claimed by those earning more than $1 million, at an average of $40,000 each.\n\"We're going to show a tax return that will fit absolutely into this group and the sole explanation is that he gave all the money to charity,\" Travers says.", "external_links": ["https://twitter.com/https://twitter.com/JoannaMather"], "published": "2015-07-28T09:40:00.000+03:00", "crawled": "2015-07-28T05:48:28.201+03:00", "highlightTitle": ""}