{"organizations": [], "uuid": "3092b9f4d46a30924153d821f343dd8a01e3281f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/1/8/r/p/image.related.afrArticleLead.620x365.gi2ee8.png/1435752049746.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/uber-closer-to-being-legal-in-nsw-20150701-gi2ee8", "country": "AU", "title": "Uber closer to being legal in NSW", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Uber closer to being legal in NSW | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T15:47:00.000+03:00", "replies_count": 0, "uuid": "3092b9f4d46a30924153d821f343dd8a01e3281f"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/uber-closer-to-being-legal-in-nsw-20150701-gi2ee8", "ord_in_thread": 0, "title": "Uber closer to being legal in NSW", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ridesharing service Uber may benefit from a NSW review. Share on twitter by Misa Han Controversial ride sharing app Uber could be legalised in Sydney as soon as next year after the NSW government on Wednesday launched an independent taskforce to review the taxi and ride sharing industry.\nThe independent taskforce will examine the future sustainability of taxis and ride sharing apps and report back to the NSW government by the end of October.\n\"We know cities around the world are grappling with these changes and in particular, the introduction of new unregulated ride sharing apps. I have made it a priority to get to the bottom of these issues, no matter how complex,\" Minister for Transport and Infrastructure Andrew Constance said.\nThe taskforce will be also looking at customer safety, the burden of current taxi regulations and sustainability of the industry in regional NSW.\nThe announcement follows NSW Opposition Leader Luke Foley's move last week to introduce a bill this year to regulate the ride sharing app .\n\"The new regulatory regime we must develop must in some ways mirror the sector it seeks to regulate,\" he wrote in The Sydney Morning Herald last Thursday.\nThe taskforce will be headed by Professor Gary Sturgess, one of the architects behind NSW's Independent Commission Against Corruption and Independent Pricing and Regulatory Tribunal (IPART).\nIn Victoria, Taxi Services Commissioner Graeme Samuel has cleared the way for the Victorian government to legalise Uber by striking a confidential deal with the ride sharing company to bring 2500 Victorian UberX drivers into the regulatory regime as accredited hire car drivers . This model requires private drivers to pass criminal and medical checks, and a knowledge test to carry UberX passengers.\n 'Victory for competition' Uber Australia, whose chief executive is David Rohrsheim, labelled the NSW government announcement a \"victory for competition, consumers and choice.\n\"The announcement is a recognition of the overwhelming popular support for ride sharing, and the need for outdated regulation to catch up with changing customer choices,\" the company said in a statement.\nThe taxi industry will be resisting any move by the government to legalise ride sharing. \"We would not be supporting a taxi system that has private drivers faring passengers in private vehicles,\" NSW Taxi Council chief executive Roy Wakelin-King said.\nRide sharing in private vehicles is currently illegal in NSW. But one in 10 Sydneysiders are using illegal ride sharing services like UberX, the NSW IPART found last year. IPART chairman Dr Peter Boxall called for a review of all ride sharing arrangements to improve the competitiveness of the taxi industry.\nThe Harper review found the laws needed to be changed to allow entrants into the taxi industry like Uber .\nMany states in the US have passed laws legalising Uber covering vehicle standards, insurance, accreditation of drivers and how ride sharing services can pick up passengers.", "external_links": ["https://twitter.com/misahan", "http://www.smh.com.au/nsw/luke-foley-endorses-uber-will-introduce-ridesharing-bill-into-parliament-20150624-ghwhaw.html", "http://www.brw.com.au/p/business/victoria_inches_closer_to_legalising_Lb5KHSn5vDst8JWHaB9sEL"], "published": "2015-07-01T15:47:00.000+03:00", "crawled": "2015-07-02T05:57:27.000+03:00", "highlightTitle": ""}