{"organizations": [], "uuid": "3e4ee7cf9b1c9c07ed2cca19102099aa19289670", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/marks-spencer-clothing-boss-john-174952601.html", "country": "US", "title": "Marks & Spencer clothing boss John Dixon quits", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Marks & Spencer clothing boss John Dixon quits", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T20:49:00.000+03:00", "replies_count": 0, "uuid": "3e4ee7cf9b1c9c07ed2cca19102099aa19289670"}, "author": "", "url": "https://uk.finance.yahoo.com/news/marks-spencer-clothing-boss-john-174952601.html", "ord_in_thread": 0, "title": "Marks & Spencer clothing boss John Dixon quits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Dixon"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 16, 2015, 19:15 BST - UK Markets closed Marks & Spencer clothing boss John Dixon quits By Ashley Armstrong | Telegraph – 25 minutes ago 8.58 0.00 \nJohn Dixon, who is in charge of all Marks & Spencer (Other OTC: MAKSF - news ) 's non-food business, is understood to have quit the high street retailer \nMarks and Spencer's head of clothing, John Dixon, has quit the high street retailer. \nHis departure comes on the back M&S's struggles to turnaround its general merchandise division, which Mr Dixon has responsibility for \nM&S toasted an improvement in clothing sales in the first quarter of 2015 but then suffered a blow when sales fell on the back of wet weather. \nMr Dixon, an M&S lifer, is understood to have been keen to be the next chief executive of the retailer, the Financial Times said, which first reported his departure. \nIt is thought that Steve Rowe, who is the head of M&S' food division, which has been the major growth driver of the retailer, is now the frontrunner to be current chief executive Marc Bolland's successor when the time comes for him to step down. \nLaura Wade-Gery, who has overseen a £100m revamp of the M&S website and was last year handed control of the company’s high street shops, is also seen as another contender for the top job. \nMr Dixon’s family has a long history with the High Street retailer. His father worked for M&S in middle management for a number of years. \nJohn Dixon, who joined the retailer in 1986, has quit Marks & Spencer \nMr Dixon worked his way up the company's corporate ladder after starting in 1986 as a store management trainee and later becoming a food buyer. \nIn 2004 he was promoted to be executive assistant to Lord Rose, the then chief executive, and gained a reputation as being his right hand man. Mr Dixon joined the board in September 2009 as head of food and became executive director of general merchandise in October 2012. \nMarks & Spencer the general merchandise division suffered drooping sales every quarter for four years as shoppers felt alienated by earlier attempts to make the brand more fashionable. Its attempts to revive general merchandise sales were thwarted last year by website teething problems as it overhauled its website. \nRecently, the division showed signs of a recovery after investing significantly in womenswear design and improving its gross margins , which led to the group reporting its first increase in profits for four years. \nThe pick-up meant that senior Marks & Spencer executives were handed bonuses for the first time in two years, although Mr Dixon was awarded the smallest bonus of £217,000, worth around 36pc of his total salary. \nMarc Bolland has faced numerous questions about his tenure at M&S \nMr Bolland said in May that he \"absolutely\" could see himself being with the retailer for another year despite repeated questions about whether he would use a turnaround in the group's general merchandise as a good opportunity to leave. \nMarks & Spencer declined to comment while Mr Dixon did not return calls.", "external_links": [], "published": "2015-07-16T20:49:00.000+03:00", "crawled": "2015-07-16T21:15:54.000+03:00", "highlightTitle": ""}