{"organizations": [], "uuid": "2de99c12f7cfb3e3aad0e1fac73d6fa59db64a0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/fishbrain-facebook-fishers-raises-8m-060004429.html", "country": "US", "title": "FishBrain, 'Facebook for fishers', raises $8m in round led by Spotify backer", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "FishBrain, 'Facebook for fishers', raises $8m in round led by Spotify backer", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T09:00:00.000+03:00", "replies_count": 0, "uuid": "2de99c12f7cfb3e3aad0e1fac73d6fa59db64a0c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/fishbrain-facebook-fishers-raises-8m-060004429.html", "ord_in_thread": 0, "title": "FishBrain, 'Facebook for fishers', raises $8m in round led by Spotify backer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 22, 2015, 08:28 BST - UK Markets close in 8 hrs 2 mins FishBrain, 'Facebook for fishers', raises $8m in round led by Spotify backer By Lauren Davidson | Telegraph – 1 hour 28 minutes ago 33.125 +0.255 \nThe social network for avid anglers netted itself another investment from Northzone, Spotify's biggest external stakeholder, to fuel its international expansion \nA social network for fishing fanatics has reeled in $8m in a funding round that will help its international expansion. \nFishBrain, the app for avid anglers, is the largest and fastest-growing online community for the world’s most popular hobby: recreational fishing . \nThe round was led by Northzone, the technology investment firm that is Spotify’s largest stakeholder after its founders, which also led a $2.5m funding round for the fishing app last year. \n• How Sweden became the startup capital of Europe \nOther participants in this round include previous backers Industrifonden, Active Venture Partners, GP Bullhound and Edastra Venture Capital, as well as newcomers Recruit Strategic Partners No.6, based in Tokyo, and New York’s Novel TMT Ventures. \nFishBrain launched in Sweden in 2013, and recently hooked its millionth user. \nThe app allows users to log trips, share catches and browse crowd-sourced information about weather, sightings and fishing hot-spots. Premium users can also access data analysis to improve their performance. \nFishBrain allows users to search for information, browse tips and share their catches \nThe Stockholm-based start-up, which currently operates in Sweden, the US, Canada, Australia and the UK, will use the new funds to grow its presence in North America, establish a US office and expand into Japan. \nThe UK is estimated to have 4m sport fishers, who spend £3.5bn on the pastime each year. \nIn the US, 60m people spend their spare time fishing, making the hobby almost twice as popular as golf and tennis combined. \nRecreational fishing in the US FishBrain’s biggest market, accounting for 75pc of its users contributes more than $115bn in economic output and generates $48bn in angling-related sales. That makes the sport fishing industry in the US around three times larger than the global music industry , which recorded revenues of $15bn last year. \nJean-Claude Bel, chief executive of the European Fishing Tackle Trade Association, told the BBC in 2012 that angling is the most important sporting or outdoor activity in terms of its economic contribution not only in Europe but in the US and Japan as well. \nWhile the US has the largest concentration of fishing enthusiasts, the angling market is estimated to be worth $3.4bn in Japan, which is home to 9.4m recreational rod-casters. \nFishBrain founder Johan Attby speaking in Stockholm last month \n\"We want to expand into Japan not only because fishing is one of the biggest sports and has a long tradition there, but also because smartphone penetration is very high, and conversion rates (from free to pay) are typically very good,” FishBrain founder and chief executive Johan Attby told The Telegraph. “Equally, two of the world’s largest sport fishing manufacturers, Shimano (Other OTC: SHMDF - news ) and Daiwa, are Japanese.” \nSpeaking in Stockholm last month, Mr Attby suggested that future versions of FishBrain could step into e-commerce, charging a commission on sales of fishing-related equipment sold through the app. \nHe also identified Brazil, which has 25m angling fans, and China, where sport fishing is growing in popularity , as potential future target markets for FishBrain's expansion. \nLast year, Netscape founder and serial venture capitalist Marc Andreessen came to the defence of fishing-related start-ups when Fishing Booker, a website that allows anglers to charter boats for their angling excursions, became the subject of Twitter (Xetra: A1W6XZ - news ) -based derision.", "external_links": [], "published": "2015-07-22T09:00:00.000+03:00", "crawled": "2015-07-22T10:29:05.690+03:00", "highlightTitle": ""}