{"organizations": [], "uuid": "f736e81d3218753c8393f3d6b62913cd8f155096", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/7/8/l/v/image.related.afrArticleLead.620x365.gi9nfz.png/1436510885776.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/banks-rewrite-the-rules-in-interest-rate-game-20150710-gi9nfz", "country": "AU", "title": "Banks rewrite the rules in interest rate game", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Banks rewrite the rules in interest rate game | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T14:48:00.000+03:00", "replies_count": 0, "uuid": "f736e81d3218753c8393f3d6b62913cd8f155096"}, "author": "Michael Smith", "url": "http://www.afr.com/business/banking-and-finance/banks-rewrite-the-rules-in-interest-rate-game-20150710-gi9nfz", "ord_in_thread": 0, "title": "Banks rewrite the rules in interest rate game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lifting deposit rates for a limited time is one of the strategies the big banks have been deploying as they juggle the need to protect profit margins against winning new customers. Sam Bennett Share on twitter by Michael Smith The banks have been a little cheeky in the way they quietly unwound a bump-up in deposit account interest rates offered to consumers earlier this year.\nThe May decision to lift rates on some deposit accounts was a trade-off from a public relations perspective for not passing on the latest official interest rate cuts in full. It emerged this week that both Commonwealth Bank and Westpac were no longer offering those promotional discounts.\nBut times are tougher than usual for the banks and both CBA and Westpac can argue those discounts were only ever going to be in place for a short time. The promotional offer simply expired and the banks chose not to renew them.\nLifting deposit rates for a limited time is one of the strategies the big banks have been deploying as they juggle the need to protect profit margins against winning new customers.\nThe rules changed when the Reserve Bank cut rates in May. The impact of that cut will be significant in the next round of bank earnings and executives are already spending a lot of time strategising around their response to the next reduction in official rates that economists are tipping for the second half.\nANZ Banking Group threw everyone out by moving first with the decision to pass on in full the RBA's interest rate cut in May. That abruptly ended a move 2½ years earlier to break with tradition and take a more independent approach by reviewing rates on the second Friday of each month.\nCustomer feedback prompts decision Times have changed since then and funding markets are no longer as tough. ANZ also said it made the decision in response to customer feedback.\n National Australia Bank's chief Andrew Thorburn has also chosen not to adopt his predecessor's approach to undercutting the other banks by offering the best interest rate. ANZ's standard variable rate of 5.38 per cent is currently the lowest of the four banks.\nLow interest rates cost the banks a lot of money and they have to provision for the impact. The next cut will come at time the banks are implementing new funding requirements and trying to meet the banking regulator's push to slow investor loan growth. It is unlikely they will pass on further cuts, even if that risks attracting another telling off by Treasurer Joe Hockey.\nJPMorgan says banks must be careful in the way they manage competition, warning against a blanket repricing of the mortgage portfolio.\n\"Blanket repricing of the mortgage portfolio, [such as] out-of-cycle rate rises during the GFC, is a lazy response and may be detrimental to longer-run return prospects for the portfolio,\" JPMorgan analyst Scott Manning says.\nThe more pressing issue for banking executives is how to respond to regulatory pressure to manage the boom in housing prices and curb investor lending. Home buyers are already noticing the difference as discounts and promotions for investor loans dry up, while the conditions for owner-occupier loans are sweetened.\nBanks curb investor loans Banks are in the odd position of curbing their investor loans books following a push by the Australian Prudential Regulatory Authority (APRA) to keep investor loan growth under 10 per cent.\nThere are early signs it is working, although there are questions about whether targeting people buying investment properties is really taking the risk out of the market. First home owners who do not have existing properties to use as collateral will face the biggest challenge.\nMortgage brokers also believe the current sharemarket rout in China will see more foreign investors parking their money into the Australian housing market.\nFigures out on Friday showed the number of home loan approvals fell 6.1 per cent in May. Investment lending on a seasonally adjusted basis fell by 3.2 per cent.\nThese numbers do not reflect the drastic move announced by Westpac this week to introduce an 80 per cent loan-to-valuation cap on investor loans. This means people wanting to borrow money from the bank for an investment property will have to pay a 20 per cent deposit. That could amount to as much as $200,000 for a home in Sydney, where the median price is approaching a ludicrous $1 million. The deposit required is 10 per cent for ANZ and Westpac compared with 5 per cent previously.\nBroker Mortgage Choice has data showing investment loan approvals fell from 33 per cent 29 per cent to June but overall lending is not coming off.\nPacker plays odds While odds are in favour of Echo Entertainment winning its latest stoush with James Packer in Brisbane, there are whispers the Crown Resorts camp has some last-minute tricks up its sleeve.\nOne carrot being offered to the Queensland government is a proposal to abolish the existing buyback arrangement for poker machine licences, which has been in place since 2001. Casino operators, clubs, pubs and hotels are not allowed to buy licences off each other at the moment, although there is a tender process for each industry group to sell to each other.\nWhile hotels are paying as much as $130,000 per licence, prices are volatile and the clubs are more strapped for cash and are offering a lot less than that. The industry associations do not want Crown to win, fearing it will lead to an influx of new competition that will hurt their businesses.\nCrown will try and sell the buyback idea as a solution for struggling pubs or clubs who can make some money and get rid of the dusty poker machine sitting in the corner without increasing the overall number of licences in the state.\nIt is only one factor in the high-stakes game that will be played out in Brisbane this week, although some believe the decision has already been made. Taxes, employment opportunities, reputations and benefits to the community are all issues the working panel assessing the bids will have to look at. As Echo knows, Crown is a formidable opponent and it could still go either way. But if I had to put money on an outcome I would pick Echo.\nMichael.smith@fairfaxmedia.com.au\nTwitter @MikeSmithAFR", "external_links": ["https://twitter.com/https://twitter.com/MikeSmithAFR"], "published": "2015-07-10T14:48:00.000+03:00", "crawled": "2015-07-11T02:05:54.000+03:00", "highlightTitle": ""}