{"organizations": ["Signature Financial", "Signature Bank"], "uuid": "68e32b944b4f31e203c050b8ec97e84e24dde6b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.equipmentfa.com", "main_image": "", "site_section": "http://www.equipmentfa.com/rss/feeds/latestnews.xml", "section_title": "Equipment Finance Advisor", "url": "http://www.equipmentfa.com/news/4491/signature-expands-into-new-specialty-finance-expands-business-lines", "country": "US", "title": "Signature Expands Into New Specialty Finance; Expands Business Lines", "performance_score": 0, "site": "equipmentfa.com", "participants_count": 0, "title_full": "Signature Expands Into New Specialty Finance; Expands Business Lines", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T14:16:00.000+03:00", "replies_count": 0, "uuid": "68e32b944b4f31e203c050b8ec97e84e24dde6b5"}, "author": "", "url": "http://www.equipmentfa.com/news/4491/signature-expands-into-new-specialty-finance-expands-business-lines", "ord_in_thread": 0, "title": "Signature Expands Into New Specialty Finance; Expands Business Lines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Signature Expands Into New Specialty Finance; Expands Business Lines July 17, 2015, 07:16 AM Related: Dealer Finance , Signature Bank , Signature Financial , Specialty Finance , Vehicle Leasing \nSignature Financial LLC, the wholly owned specialty finance subsidiary of New York-based Signature Bank announced it will begin offering direct commercial vehicle finance and also appointed several new sales professionals to roles across other specialty finance areas. Signature Financial will begin offering direct vehicle finance loans through a network of approved commercial vehicle dealerships in New York’s Tri-State area (New York, New Jersey and Connecticut). Loans will be targeted toward small and mid-size business borrowers that are acquiring income-producing commercial vehicles and fleets, including trucks, work vans and the like. To lead its dealer finance business, Signature Financial appointed a seasoned five-person team, all of whom previously worked together at Bank United and earlier, Capital One/North Fork Bank. James E. Collins was named Vice President and Director of Commercial Dealer Vehicle Finance; Thomas W. Hedge, Regional Sales Manager; Matthew W. Capobianco, Senior Underwriting Officer; Michael J. Rubenstein, Senior Underwriting Officer; and, Raul Caraballo, Senior Documentation Specialist. Collins is a veteran of the commercial vehicle lending arena, and brings more than three decades of finance experience to Signature Financial. Most of his career was focused primarily on commercial vehicle and automotive finance. Before joining Signature Financial, Collins was Senior Vice President, Northeast Regional Sales Director – Indirect and Specialized Lending for Bank United in Melville, where he managed the startup of the indirect auto and specialized commercial lending business. Prior he was Vice President, Mid Atlantic Regional Manager - Dealer Commercial Services at TD Bank in Melville. He also led the automotive retail finance business at First State Bank and North Fork Bank. Hedge brings more than 20 years of automotive business management and lending expertise to his new role. He spent the past 10 years at NFB Funding, Inc., a subsidiary of North Fork Bank and Capital One Auto Finance. In this capacity, he was hired to turnaround an underperforming territory in Northern New Jersey, which was achieved under his direction. Capobianco, with 30 years of lending experience, most recently was Vice President of Indirect and Special Lending at Bank United, also part of the startup business for indirect lending to auto financing. Rubenstein joins from Nassau Financial Federal Credit Union where he was a lending specialist for the indirect vehicle lending program. Previously, he worked at Bank United and Capital One Bank in auto finance and specialized lending positions. Caraballo also worked in several vehicle finance-related roles at both Capital One/North Fork and Bank United. Most recently, he was a loan member services representative at Nassau Financial Federal before joining Signature Financial. Signature Financial also added several new Executive Sales Officers to its national direct finance team, which focuses on equipment and franchise finance. These additions bring the total number of direct sales executives to 25 throughout the country. Several of these finance sales professionals join from GE Capital. John A. Turck spent nearly 20 years at GE Capital in a range of finance-related roles, most recently in the commercial equipment finance area, where he held a direct originator role throughout New York State. He also worked in GE Capital’s Enterprise Client Group, Real Estate and Commercial Equipment Finance areas. His office is in Buffalo, N.Y. Jerry Mathew’s 15-year career was spent in various roles with GE Capital. Most recently, he was Assistant Vice President – Sales, Northern California where he worked with Northern California and Nevada businesses, offering equipment financing solutions. Earlier he held roles with increasing responsibility at GE Energy and in GE Capital’s Information Technology Leadership program. Mathew will work from an office in the Sacramento, Calif. region. Steven Smallwood, a finance expert with more than two decades of experience, joins Signature Financial from BB&T Equipment Finance, where he was responsible for originating loan and lease transactions for middle market companies. Smallwood also spent seven years at GE Capital as Senior Account Manager, Vice President, Middle Markets, in a loan origination role and as Regional Sales Manager, managing six market managers that covered middle market commercial and industrial accounts for Texas, Louisiana, Oklahoma and Arizona. Smallwood is based in Dallas. Michael Jones has also joined Signature Financial covering southern Texas. He has 17 years of experience in consumer and commercial lending through direct and vendor channels. Before joining Signature Financial, Jones was Vice President Finance Sales at BancorpSouth Equipment Finance. He has held similar roles at Peoples Capital and Leasing, Key Equipment Finance and CitiCapital Commercial Corp. Jones’ office will be in Houston. Further personnel expansion continued within Signature Financial’s Franchise Finance business. David Stansbery and Joseph M. (Trey) Grimm III were each named Executive Sales Officers for Franchise Finance. Stansbery spent 17 years at GE Capital in the franchise finance area, most recently as Managing Director, Strategic Accounts, where he maintained and generated new loans within a franchise restaurant loan portfolio consisting of strategic restaurant customers. He also held a range of other roles with increasing responsibility at GE Capital over his career. He will be based in Scottsdale, Ariz. Grimm III spent 10 years at United Capital Business Lending and previously was a Vice President and Business Development Officer, where he generated considerable loan originations in the franchise sector. During his career, he cultivated and managed relationships with some of the nation’s largest franchise concepts. Grimm will work out of an office in Towson, Md. Kevin J. Hahn was appointed Senior Underwriting Officer, and has more than 25 years experience in franchise finance, bringing significant knowledge of the restaurant industry. He joins from The National Bank of Waupun in Waupun Wis., where he was Vice President and Chief Credit Officer. Prior, he served as Vice President and Franchise Finance Credit Manager at Sovereign Bank in Wyomissing, Pa. He will be based in the Milwaukee area. “In the three years since the inception of Signature Financial, we have grown this business by capitalizing on opportunities for launching new specialty finance products and services as well as attracting finance professionals who bring knowledge, relationships and books of business to the institution. Our continued expansion is evidence of our ability to leverage the foundation we have built to date from which Signature Financial now provides nine specialty commercial finance offerings,” stated Walter Rabin, President and Chief Executive Officer at Signature Financial. “Similar to Signature Bank’s founding philosophy of hiring veteran bankers who join as teams to deliver true relationship banking, Signature Financial is building its relationship-based business by identifying veteran lenders who bring decades of finance experience to their roles. We are fortunate the strong reputation of both Signature Bank and Signature Financial is continually increasing, and these types of lenders are seeking Signature Financial as a preferred place to work. We look forward to the contributions all these new professionals will make to the overall growth of our specialty finance business, and believe Signature Financial will continue to attract entrepreneurial talent,” said Joseph J. DePaolo, President and Chief Executive Officer at Signature Bank. Today's Other News", "external_links": [], "published": "2015-07-17T14:16:00.000+03:00", "crawled": "2015-07-17T20:25:49.000+03:00", "highlightTitle": ""}