{"organizations": [], "uuid": "91538654851325381718f27a7a8b50327876382f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.crainsnewyork.com", "main_image": "http://www.crainsnewyork.com/apps/pbcsi.dll/storyimage/CN/20150715/ECONOMY/150719925/AR/0/Janet-Yellen.jpg?maxw=800&imageversion=widescreen&q=70&cci_ts=20150715103839", "site_section": "http://feeds.crainsnewyork.com/crainsnewyork/finance", "section_title": "Finance - Crain's New York Business News Feed", "url": "http://www.crainsnewyork.com/article/20150715/ECONOMY/150719925", "country": "US", "title": "Janet Yellen: Fed could raise rates by the end of the year", "performance_score": 0, "site": "crainsnewyork.com", "participants_count": 1, "title_full": "Janet Yellen: Fed could raise rates by the end of the year", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T18:09:00.000+03:00", "replies_count": 0, "uuid": "91538654851325381718f27a7a8b50327876382f"}, "author": "Associated Press", "url": "http://www.crainsnewyork.com/article/20150715/ECONOMY/150719925", "ord_in_thread": 0, "title": "Janet Yellen: Fed could raise rates by the end of the year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Associated Press Janet Yellen delivered the Fed's mid-year economic outlook to Congress on Wednesday \nFederal Reserve Chair Janet Yellen sees a number of encouraging signs that the economy is reviving after a brutal winter and says if the improvements stay on track, the Fed will likely start raising interest rates later this year. \nDelivering the Fed's mid-year economic outlook to Congress, Ms. Yellen said Wednesday the importance of the first rate hike should not be over-emphasized because interest rates are likely to remain at very low levels \"for quite some time after the first increase.\" The Fed's benchmark rate has been at a record low near zero since December 2008, meaning that borrowing rates for consumers and businesses have been at historic lows. \nMany economists believe the Fed's first rate hike will occur in September, but they see at most only two quarter-point moves this year. \n\"If the economy evolves as we expect, economic conditions likely would make it appropriate at some point this year to raise the federal funds target,\" Ms. Yellen said in prepared remarks. The funds rate, the Fed's key policy lever, has not been lifted in nearly a decade. \nMs. Yellen stressed that her outlook is based on the expectation that the labor market will continue to improve and inflation will begin to move closer to the Fed's 2% target for annual price gains. Inflation is currently running lower than the pace the Fed believes is optimal for a healthy economy. \nA decision to raise rates, Ms. Yellen said, \"will signal how much progress the economy has made in healing from the trauma of the financial crisis.\" \nMs. Yellen noted a number of areas that had improved. \nThe unemployment rate dropped in June to a seven-year low of 5.3%. She also cited \"noticeable declines\" over the past year in the number of long-term unemployed—people who have been out of work six months or longer—and in the number of people working part-time because they can't find full-time jobs. But she said problems with the labor market remained, including anemic wage growth. \nMany of the problems that sent the economy into reverse in the January-March quarter appeared to be waning, she said. \n\"Consumer spending has picked up and sales of motor vehicles in May and June were strong,\" Ms. Yellen said, also noting recent improvements in home construction. \nBut she described business investment and export sales as weak. Investment has been hurt by spending cutbacks by energy companies responding to falling energy prices, and exports have suffered by the rising value of the dollar, which makes U.S. goods less competitive in foreign markets. \nMs. Yellen listed foreign developments as one of the key uncertainties that could weigh on U.S. growth in coming months. \n\"The situation in Greece remains difficult,\" she said. \"And China continues to grapple with the challenges posed by high debt, weak property markets and volatile financial conditions.\" \nAnticipating tough questions from Republican lawmakers over the Fed's powers and what critics see as excessive secrecy, Ms. Yellen described a number of steps the central bank has taken in recent years to become more transparent. She said the Fed holds press conferences after four of its eight meetings each year and has increased the frequency that it updates its economic forecasts. \n\"The Federal Reserve ranks among the most transparent central banks,\" Ms. Yellen said. \nBut she added that efforts to increase openness \"no matter how well intentioned must avoid unintended consequences\" that could undermine the Fed's ability to conduct policy. \nThe Fed, responding to the 2008 financial crisis and the worst economic downturn in seven decades, expanded its balance sheet by purchasing trillions of dollars in bonds and took other aggressive actions to lower interest rates and battle high unemployment. \nThe moves triggered criticism that the Fed has become too powerful and is too secretive and unaccountable. Lawmakers in both the House and Senate have introduced legislation to rein in the Fed's independence, measures that the central bank have warned could damage the independence the Fed needs to maintain its credibility with financial markets.", "external_links": [], "published": "2015-07-15T18:09:00.000+03:00", "crawled": "2015-07-15T19:51:40.000+03:00", "highlightTitle": ""}