{"organizations": [], "uuid": "51cf3fd2f383f3477be089432319be9203a3591b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/2/6/5/l/image.related.afrArticleLead.620x365.gi256i.png/1435731647981.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/market-data/bonds/bill-gross-of-janus-adds-his-voice-to-bond-market-liquidity-concerns-20150701-gi256i", "country": "AU", "title": "Hold cash to avoid panic selling, Bill Gross says", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Hold cash to avoid panic selling, Bill Gross says | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T08:51:00.000+03:00", "replies_count": 0, "uuid": "51cf3fd2f383f3477be089432319be9203a3591b"}, "author": "Mark Mulligan", "url": "http://www.afr.com/markets/market-data/bonds/bill-gross-of-janus-adds-his-voice-to-bond-market-liquidity-concerns-20150701-gi256i", "ord_in_thread": 0, "title": "Hold cash to avoid panic selling, Bill Gross says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Aside from the obvious drop in trading volumes . . . the obvious risk – perhaps better labelled the 'liquidity illusion' – is that all investors cannot fit through a narrow exit at the same time,\" says Bill Gross of Janus. Scott Eells Share on twitter by Mark Mulligan Greece's debt woes, a shock in China or a US Federal Reserve misstep could trigger a bond sell-off that would expose built-up shortage of global liquidity, according to fixed-income guru Bill Gross.\nMr Gross, portfolio manager at Janus and co-founder of bond giant Pimco, said in his latest Investment Outlook paper that a regulatory clampdown on proprietary trading at investment banks in recent years had shifted risk to the \"shadow banking\" world of mutual, index and exchange-traded funds.\nThese were not subject to the same capital allocation rules as banks, so were susceptible to sudden liquidity squeezes in the event of mass selling.\nA lack of buyers when investors all sell at once drives down prices and can lead to massive losses. Those funds which use derivatives to hedge the risk of sudden price movements were some times just creating future liquidity problems, he said.\n\"The fact is that derivatives on a systemic basis represent increased leverage and therefore increased risk – presenting possible exit and liquidity problems in future months and years,\" Mr Gross said.\nHe identifies the repercussions of Greek default and exit from the eurozone as one possible trigger for an exodus from higher-risk bonds, along with a surprise in China, which is grappling with slowing growth and credit, property and equity bubbles.\nAn emerging market crisis which started in countries with heavy US dollar debt exposure could also spark a rush for the exits, he says, as would geopolitical risks which are \"too numerous to mention and too sensitive to print\".\nHe said secondary market turnover in high-yielding emerging market and corporate bonds had declined sharply in recent years, despite a steady increase in issuance and investment. The same had happened in investment grade bonds.\n \"Aside from the obvious drop in trading volumes . . . the obvious risk – perhaps better labelled the 'liquidity illusion' – is that all investors cannot fit through a narrow exit at the same time,\" he said, adding that the best protection for investors is to \"hold an appropriate amount of cash so that panic selling ... is off the table\".\nMr Gross's comments add to a welter of warnings in the past few years that reduced market-making by banks, low policy interest rates and the aggressive hunt for returns had crowded fund managers into asset classes that would be hard to exit in the event of a shock.\nReserve Bank of Australia Glenn Stevens, in a speech in London on Tuesday, said the pressure on central banks to supply financial market liquidity during, and in the recessionary aftermath, of the global financial crisis had made them partly responsible for creating new risks, according to some interpretations.\n\"Central banks' balance sheet actions have become dominant forces in a wider range of financial markets,\" he told the Official Monetary and Financial Institutions Forum.\n\"Some would argue that the market's normal functions of pricing for risk have been distorted or overwhelmed by central bank actions.\n\"To those critics, the search for yield is an artificial and dangerous phenomenon caused by central bank interventions,\" he said.\nThe response to this would be that central banks \"had little choice but to pursue these actions and that, in any event, there are likely to have been some real factors at work in holding down real interest rates\", he said.\n\"Either way, some central banks seem likely to be large players in markets for quite some years,\" he told the forum.", "external_links": ["https://twitter.com/@MulliganMark"], "published": "2015-07-01T08:51:00.000+03:00", "crawled": "2015-07-01T10:10:48.000+03:00", "highlightTitle": ""}