{"organizations": [], "uuid": "d7aa746487d7d388d88f2048e35f356f127f32b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/6/9/v/9/image.related.articleLeadwide.620x349.gi69kh.png/1436171404441.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4020/financials/diversified-financials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/property-pooling-reaches-new-heights-in-melbourne-20150706-gi69kh.html", "country": "AU", "title": "Property pooling reaches new heights in Melbourne", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Property pooling reaches new heights in Melbourne", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "d7aa746487d7d388d88f2048e35f356f127f32b0"}, "author": "Simon Johanson", "url": "http://www.smh.com.au/business/property-pooling-reaches-new-heights-in-melbourne-20150706-gi69kh.html", "ord_in_thread": 0, "title": "Property pooling reaches new heights in Melbourne", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An artists impression of the six towers in Normanby Road.\nSix Melbourne property owners have taken the idea of pooling neighbouring properties to make one large development site to a new level by banding together to create a masterplan for half a dozen 40-level skyscrapers.\nThe individual owners of the six adjoining sites in Fishermans Bend employed architects Hayball to design an integrated $600 million project and submitted plans for the six towers, all 40 storeys tall, with 1578 apartments last week.\nPlanning & Property Partners director Mark Naughton said the owners, who had held the land for long periods, felt they could get a better design outcome by working together.\nEach owner had applied separately for a planning permit for their portion of the \"coordinated\" project, Mr Naughton said.\nThe resulting six-tower masterplan will stretch across a 13,000 square metre site on both sides of Normanby Road in the suburb's recently-rezoned Montague precinct.\nThe Montague area covers about 50 hectares and will accommodate Fishermans Bend's tallest buildings after planning minister Richard Wynne introduced lower height limits for the other pockets Lorimer, Sandridge and Wirraway.\nIn May Mr Wynne approved three towers rising to 46 levels in nearby Johnson Street.\nHayball architect Tom Jordan said the integrated approach had improved the public spaces between the proposed buildings by adding laneways, pocket parks and plazas.\nMr Naughton said at least one apartment in each tower would be contributed to the Port Phillip Housing Trust.\nThe proposed towers cover sites currently used by businesses that include South Melbourne Toyota, City Mitsubishi, Kennards Hire and Nisbets Express Catering Equipment.", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-06T18:59:14.000+03:00", "highlightTitle": ""}