{"organizations": [], "uuid": "6cd5482913e9aecaeb049440a6c46db410d13d71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-pensions-retirement/?format=rss", "section_title": "Pensions & Retirement News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/three-ways-budget-failed-generation-154538411.html", "country": "GB", "title": "Three ways the Budget failed my generation", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Three ways the Budget failed my generation", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T18:45:00.000+03:00", "replies_count": 0, "uuid": "6cd5482913e9aecaeb049440a6c46db410d13d71"}, "author": "", "url": "https://uk.finance.yahoo.com/news/three-ways-budget-failed-generation-154538411.html", "ord_in_thread": 0, "title": "Three ways the Budget failed my generation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 14, 2015, 01:43 BST - UK Markets open in 6 hrs 17 mins Three ways the Budget failed my generation By Katie Morley | Telegraph – 8 hours ago \nIn an open letter to George Osborne, Katie Morley asks the Chancellor for fair treatment of young people \nDear George Osborne, \nI’m writing because your Summer Budget has left me feeling very uneasy about the financial future of young people in the UK. \nOur country is experiencing a dangerous and growing imbalance of wealth between the generations which poses a serious long-term threat to the economy. It should therefore be of great concern to all of us. \nIn your speech last Wednesday you said inequality in our society is improving - but you didn’t mention the widening chasm between old and young. \nIt is one of the biggest financial dilemmas of our time, yet I am worried that a number of the recent decisions made by you and the Conservatives will exacerbate the problems facing my generation. \nMr Osborne, we have all observed how successful you have become at addressing older generations’ financial concerns. Many of the policies designed to do this I wholeheartedly support. \nFor example the pension freedoms recently introduced by the Coalition rightly give people the responsibility to spend their retirement fund exactly how they like, rather than being forced to buy a poor-value lifetime income. \nHiring Ros Altmann as Pensions Minister is also fantastic for pensioners she has a steely track record of campaign success and will continue to zealously champion their interests. \nBut it is their children and grandchildren who now require your attention. They urgently need someone to fight their corner. \nIn a better Britain young people would be able to achieve financial independence and build wealth of their own - without relying on parents. It is well within your power to offer fair treatment to teens and twenty-somethings who are willing to work hard to acheive this. \nThat is precisely what I ask for now. \nYours sincerely, \nKatie \n= Please don't cut our tax relief on pensions = \nOne of the suggestions on the table is to scrap or limit tax relief on pension contributions, perhaps to replace the perk with a tax break or bonus when people take their retirement fund as income. This is short-termist and potentially dangerous. \nMessing with pensions has the potential to hugely disadvantage younger generations. In a worst case scenario we could end up with no tax relief on pensions at all. \nIf you delay tax breaks now and say people can have them several decades in the future instead, you open them up to a very real risk of a future government removing them. \nThankfully experts do not believe this will be the most likely result of your consultation. However, their prediciton still has a bleak outcome. They believe higher rate tax relief on pensions will be scrapped, a move which would prevent young workers with good jobs from building retirement funds anywhere near as big as the nest-eggs their parents have already had the chance to build. \nTory-backed think tanks such as the Centre for Policy Studies have already warned the young to plan for a retirement without the state pension. They expect it to have become unaffordable by the time we retire meaning we will need every penny of pension money we can get. \n= Is university no longer a place for the poor? = \nSecond, the move to scrap student maintenance grants is regressive and sends out all the wrong messages. \nBy saddling the poorest students with extra debt you are actively encouraging students from modest backgrounds to compromise their education. Perhaps they will now choose shorter courses, or study nearer home. \nIt is sad that bright 17-year-olds will now limit their potential by selecting \"any old course\" if it is close to home, and overlook the best courses at top universities (the only ones that offer good value for money, anyway) just because they are hundreds of miles away. \nThe general direction of student finance is also likely to fail in its aim of shifting the cost from taxpayers. Britain is encouraging an unlimited number of students to rack up vast debts which most of them will never repay in full, leaving taxpayers with the bill. \n= Young people no closer to owning a home = \nAnd finally, you say you will not stand by while people who want to get on the housing ladder cannot do so. But your housing policies in their current state will do little to solve the crisis, and might even make worse the problems caused by our grossly overpriced property market. \nUntil now your policy ideas - Help to Buy and others - have increased demand for home ownership without addressing the real problem - supply. This has ended up inflating prices even more. Previously you had promised 200,000 new starter homes at 20pc below market price for first time buyers, but disappointingly there was no mention of this in the Budget. \nBut you have announced new planning laws which experts say will generate 200,000 planning permissions a year by 2020. That sounds like a breakthrough until you consider that last year (2014) planning permission was granted for 195,000 homes in England and Wales. Adding an extra 5,000 to this is hardly much to get excited over. And it is still well below the 300,000 homes a year we actually need to meet demand over the next five years. \nPolicies to improve conditions for the 11 million private renters in the UK were also noticeably absent from the Budget. Renting in Britian is a miserable experience for millions. It offers little security and conditions are too often poor and deteriorating, despite rents rising. You have rightly removed of some tax perks for higher-rate taxpaying landlords but it now looks likely rents could rise as they seek to cover their costs - causing more pain for renters. \nWhat's needed now is a much bigger focus on housing supply as well as regulation and new minimum quality standards to protect renters. \nkatie.morley@telegraph.co.uk", "external_links": [], "published": "2015-07-13T18:45:00.000+03:00", "crawled": "2015-07-14T03:43:23.000+03:00", "highlightTitle": ""}