{"organizations": [], "uuid": "99871995653b60bfe23ac57d7cb68f3c75a24dfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/traders/SpeedDesk-13-front-lead.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.thestreet.com/story/13222871/1/will-gm-stock-be-affected-by-cuts-to-german-factory-production.html?puc=yahoo&cm_ven=YAHOO", "country": "GB", "title": "Will GM Stock Be Affected by Cuts to German Factory Production?", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Will GM Stock Be Affected by Cuts to German Factory Production?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T23:52:00.000+03:00", "replies_count": 0, "uuid": "99871995653b60bfe23ac57d7cb68f3c75a24dfc"}, "author": "", "url": "http://www.thestreet.com/story/13222871/1/will-gm-stock-be-affected-by-cuts-to-german-factory-production.html?puc=yahoo&cm_ven=YAHOO", "ord_in_thread": 0, "title": "Will GM Stock Be Affected by Cuts to German Factory Production?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["U-Jin Lee"], "text": "Will GM Stock Be Affected by Cuts to German Factory Production? By U-Jin Lee | 07/17/15 - 04:52 PM EDT Reprint \nNEW YORK ( TheStreet ) -- General Motors ( GM - Get Report ) said today that its Opel division will reduce output at two of its factories in Germany, Reuters reports. \nSince the car maker saw Russian sales plunge, inventories and related costs will be minimized at Ruesselsheim and Eisenach factories, the company stated. \nOriginally, GM's Opel division planned to sell more than 80,000 cars in Russia this year however, sales tumbled 73% to about 9,000 cars in the first quarter, Reuters noted. \nThis decision comes as General Motors said in March that it would wind down the Opel brand in Russia, as falling oil prices, weaker currency, and Western sanctions over the Ukraine crisis impacted the economy, according to Reuters. \nOn Friday, GM shares closed up 0.13% to $30.65. \nSeparately, TheStreet Ratings team rates GENERAL MOTORS CO as a Buy with a ratings score of B. TheStreet Ratings Team has this to say about their recommendation: \n\"We rate GENERAL MOTORS CO (GM) a BUY. This is driven by a number of strengths, which we believe should have a greater impact than any weaknesses, and should give investors a better performance opportunity than most stocks we cover. The company's strengths can be seen in multiple areas, such as its increase in net income, impressive record of earnings per share growth, notable return on equity and largely solid financial position with reasonable debt levels by most measures. We feel its strengths outweigh the fact that the company has had lackluster performance in the stock itself.\" \nHighlights from the analysis by TheStreet Ratings Team goes as follows: The net income growth from the same quarter one year ago has significantly exceeded that of the S&P 500 and the Automobiles industry. The net income increased by 343.7% when compared to the same quarter one year prior, rising from $213.00 million to $945.00 million. GENERAL MOTORS CO reported significant earnings per share improvement in the most recent quarter compared to the same quarter a year ago. This company has reported somewhat volatile earnings recently. But, we feel it is poised for EPS growth in the coming year. During the past fiscal year, GENERAL MOTORS CO reported lower earnings of $1.64 versus $2.35 in the prior year. This year, the market expects an improvement in earnings ($4.45 versus $1.64). The return on equity has improved slightly when compared to the same quarter one year prior. This can be construed as a modest strength in the organization. Compared to other companies in the Automobiles industry and the overall market on the basis of return on equity, GENERAL MOTORS CO has outperformed in comparison with the industry average, but has underperformed when compared to that of the S&P 500. Regardless of the drop in revenue, the company managed to outperform against the industry average of 6.3%. Since the same quarter one year prior, revenues slightly dropped by 4.5%. The declining revenue has not hurt the company's bottom line, with increasing earnings per share. Even though the current debt-to-equity ratio is 1.33, it is still below the industry average, suggesting that this level of debt is acceptable within the Automobiles industry. Regardless of the somewhat mixed results with the debt-to-equity ratio, the company's quick ratio of 0.79 is weak. You can view the full analysis from the report here: GM Ratings Report Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-07-17T23:52:00.000+03:00", "crawled": "2015-07-18T00:04:11.000+03:00", "highlightTitle": ""}