{"organizations": [], "uuid": "7f0d37153de1da334f76756e4476b228a4a1ddac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/2005/feed#", "section_title": "The Hill: Finance Regulation", "url": "http://thehill.com/regulation/finance/248016-consumer-watchdog-fends-off-republican-attacks", "country": "US", "title": "Consumer watchdog fends off Republican attacks", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Consumer watchdog fends off Republican attacks", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T19:51:00.000+03:00", "replies_count": 0, "uuid": "7f0d37153de1da334f76756e4476b228a4a1ddac"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/finance/248016-consumer-watchdog-fends-off-republican-attacks", "ord_in_thread": 0, "title": "Consumer watchdog fends off Republican attacks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Consumer watchdog fends off Republican attacks By Tim Devaney - 07/15/15 12:51 PM EDT The Consumer Financial Protection Bureau (CFPB) has returned more than $10 billion to consumers who were scammed since the watchdog agency opened its doors four years ago. CFPB Director Richard Cordray revealed the results of the relief the agency has provided to more than 17 million consumers on Wednesday in his semi-annual report to Congress. “Congress created this agency in response to the financial crisis with the purpose and sole focus of protecting consumers in the financial marketplace,” Cordray told lawmakers. “We understand our responsibility to stand on the side of consumers and ensure they are treated fairly.” Cordray is on the hill this week defending the CFPB from Republicans who are seeking to weaken the consumer watchdog. He testified Wednesday before the Senate Banking Committee. The creation of the CFPB stems from the Dodd-Frank financial reform laws passed five years ago this month. The Obama administration and Democrats defend the agency’s work, but Republicans have long decried its “lack of accountability.\" GOP lawmakers would like to create a board to oversee the CFPB, rather than a single director. They would also like more authority over the agency’s budget. Senate Banking Chairman Richard Shelby (R-Ala.) warned Wednesday at the hearing that “the time will come” for Congress to restructure the CFPB. “Unfortunately, Congress does not have control over how the bureau spends its funds because the CFPB operates outside of the appropriations process,” Shelby said at the hearing. “Because Congress cannot tighten the financial reins when budgeting issues arise, the bureau’s current structure makes meaningful congressional oversight very difficult,” he continued. “By putting the bureau through the appropriations process and establishing a board of directors, it would resemble other independent agencies and provide Congress with the ability to conduct meaningful oversight,” Shelby added. But Sen. Sherrod Brown (Ohio), the top Democrat on the committee, warned such moves would “cripple” the CFPB. \"I will continue to fight all of these attempts to destabilize the CFPB,” Brown said at the hearing. \"Our consumers deserve a strong watchdog that can do its job independently, and it’s my job to make sure that happens.\" Past: 1 day Trump tops national poll for... Trump gets 17 percent compared to 14 percent for Jeb Bush. Court: Nuns must comply with... An appeals court dealt another blow to challengers of the controversial... ISIS has threatening words for... How did ISIS proliferate so rapidly — in a single year — despite U.S.-led... Republicans seize on Planned... A Planned Parenthood executive discusses the transfer of aborted fetal... Trump on Cartel prison break: ‘I... \"I told you so!” Trump declared. Trump calls in FBI after death... \"Keep f--king around, and I’ll make you eat all of your goddamn words,\"... Feds issue travel warning ahead of... The Kenya summit could attract terrorists, the State Department warned. Katie Pavlich: Barack Obama’s... OPINION | The man identified as Kathryn Steinle’s killer didn’t “slip... Chief Justice Roberts broke his... He now acts more like a senator than a judge. Trump tweet features Nazi imagery The campaign blamed the image — which was quickly deleted — on a \"young... Oil prices plunge after Iran... Some crude oil prices fell by more than a dollar per barrel. Sanders challenges Clinton on... Democratic presidential candidate Sen. Bernie Sanders challenged his rival... White House reaches historic... The deal is a significant victory for President Obama. A closer look at Wisconsin’s... Walker has implemented a failed economic strategy that has left Wisconsin... Bernie Sanders hails Iran pact as... He said he would review the Iran deal \"to make sure that it is effective... Pelosi wins leverage as GOP,... Pelosi and the Democrats are in a unique position to influence spending... Planned Parenthood: Anti-abortion... The group fiercely disputes that the conversation involved selling \"fetal... House Republican says he's victim... Rep. Alex Mooney (R-W.Va.) tells McCarthy he was excluded as bill's co-... What's in the Iran nuclear deal The 159-page document covers nuclear disarmament, sanctions relief and... Sanders rains on Hillary's parade Sanders grabs the mic as Clinton visits Democrats on Capitol Hill. Sanders courting postal worker... The union president called Sen. Bernie Sanders (I-Vt.) a “champion” of the... Report: One-third of vets on... About a third of veterans waiting for medical care have already died. Financial adviser: Clinton won't... Liberals have called for the return of the banking law, repealed by... Trump leads GOP presidential field... Trump was the preferred GOP presidential nominee for 15 percent of...", "external_links": [], "published": "2015-07-15T19:51:00.000+03:00", "crawled": "2015-07-16T00:53:13.000+03:00", "highlightTitle": ""}