{"organizations": [], "uuid": "666d3dc47186a9cf8b90dd83855db49e2d90a851", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/13/blackrock-fund-flows-idUSL2N0ZT1RL20150713", "country": "US", "title": "UPDATE 1-BlackRock unconstrained bond fund posts $1.7 bln Q2 inflow; category lags", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-BlackRock unconstrained bond fund posts $1.7 bln Q2 inflow; category lags | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T00:28:00.000+03:00", "replies_count": 0, "uuid": "666d3dc47186a9cf8b90dd83855db49e2d90a851"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/13/blackrock-fund-flows-idUSL2N0ZT1RL20150713", "ord_in_thread": 0, "title": "UPDATE 1-BlackRock unconstrained bond fund posts $1.7 bln Q2 inflow; category lags", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(adds detail on flows and analyst commentary)\nBy Jessica Toonkel\nJuly 13 (Reuters) - BlackRock Inc's unconstrained bond fund, its $31 billion Strategic Income Opportunities Fund , posted second quarter inflows of $1.7 billion, more than half of the $3.1 billion the firm's U.S. mutual funds brought in for that period, Morningstar data showed on Monday.\nMeanwhile, unconstrained bond funds overall saw $1.9 billion in outflows over the same period, according to Morningstar.\nUnconstrained bond funds have become popular over the last year because they have the flexibility to invest in all types of bond securities globally and often choose credit rather than interest-rate sensitive assets.\nBlackRock's Strategic Income Opportunities Fund's three- and five-year returns rank the fund among the top quartile of its peers, but this year, the performance has leveled.\nSo far this year, the fund has returned 0.69 percent, which is slightly below its category average, according to Morningstar.\n\"It's not a huge surprise that they saw big inflows since the fund has a great track record, a seasoned team and it is one of the high priority funds at BlackRock in terms of sales and distribution,\" said Todd Rosenbluth, head of exchange traded fund and mutual fund research at S&P Capital IQ.\n\"The question is why are people pulling money out of unconstrained bond funds as a category at a time when you would think they would want them,\" he added, referring to an expected U.S. rate hike later this year which could boost uncertainty for bonds, thus making flexible funds more appealing.\nBlackRock has been one of the biggest beneficiaries of outflows from bond manager Pacific Investment Management Co following the sudden resignation of its co-founder and star manager Bill Gross. Investors have pulled more than $54.6 billion from Pimco funds in the second quarter, according to Morningstar data.\nA Pimco spokeswoman declined to comment.\nA BlackRock spokeswoman also declined to comment, citing the firm's quiet period before earnings, which are scheduled to be released Wednesday.\nOverall investors poured $4.2 billion into BlackRock's fixed-income funds during the second quarter. The firm's equity funds, which it is trying to revive, saw $1 billion in outflows during the quarter, according to Morningstar.\nSince 2012, BlackRock has replaced five of its nine U.S. equity teams.\nMeanwhile, investors poured $14.7 billion into BlackRock's exchange-traded funds during the quarter.\nThe firm's iShares MSCI EAFE ETF brought in the most new money of all of its ETFs in the quarter at $4.2 billion, according to Morningstar. (Reporting By Jessica Toonkel; Editing by Meredith Mazzilli and Christian Plumb)", "external_links": [], "published": "2015-07-14T00:28:00.000+03:00", "crawled": "2015-07-13T23:32:15.000+03:00", "highlightTitle": ""}