{"organizations": [], "uuid": "c5870f31739a1af7847524978685cb39ec3d193a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "http://a.abcnews.com/images/Business/RT_mattel_barbie_2_jt_150717_16x9_992.jpg", "site_section": "http://abcnews.go.com/Business", "section_title": "Business News, Personal Finance and Money News - ABC News", "url": "http://abcnews.go.com/Business/moms-call-barbies-retirement-diverse-competition-steps/story?id=32516949", "country": "US", "title": "Some Moms Call for Barbie's Retirement as Diverse Competition Steps in", "performance_score": 0, "site": "go.com", "participants_count": 1, "title_full": "Some Moms Call for Barbie's Retirement as Diverse Competition Steps in - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "c5870f31739a1af7847524978685cb39ec3d193a"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Business/moms-call-barbies-retirement-diverse-competition-steps/story?id=32516949", "ord_in_thread": 0, "title": "Some Moms Call for Barbie's Retirement as Diverse Competition Steps in", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With Barbie sales past their golden years, a more ethnically-diverse group of dolls are taking some of her market share in the toy industry, say some parents and toy experts. Global sales of Barbie dolls fell 19 percent to $130.3 million in the second quarter, compared to the same quarter a year ago. However, 8 percentage points of that decline is attributed to a stronger U.S. dollar, according to Barbie's manufacturer, Mattel Inc.\nBarbie's website claims that one of the dolls is sold every three seconds somewhere in the world, or about 10.5 million a year. But sales of Barbie dolls have declined for at least a half dozen consecutive quarters. Mattel reported yesterday an earnings loss of $11.4 million in its second quarter, compared to a profit of $28.3 million a year ago in the same period.\nPart of Barbie's problem is that some parents favor dolls that their daughters can relate to more, such as the American Girl line, instead of conforming to what they term an impossible standard of beauty.\nIn Photos: Barbie Through the Years\n\"Now that I'm older, I think it's time for Barbie to retire. She isn't good for our daughters,\" Michelle Combs, 52, of Cincinnati, Ohio, a blogger with four children, told ABC News. \"We have enough to deal with when it comes to body image.\"\nJim Silver, CEO and editor-in-chief at toy review website TTPM, said that although orders of Barbie dolls have decreased over time, point-of-sale data show people are still buying the iconic doll. Of note last year, the Disney \"Frozen\" dolls also took a chunk out of Barbie's market, Silver said.\nMattel did not respond to a request for comment.\nMonica Bielanko, 38, of State College, Pennsylvania, said she chooses not to buy dolls for her daughter, 6. While there are a few dolls in the house that are gifts from relatives and friends, her daughter isn't interested and chooses to play with a fishing pole instead.\n\"Call me crazy, but I can’t get on board with a doll that has proportions befitting the very images I try so hard to shield my daughter from, even if it is iconic and loved by millions of little girls and their mothers,\" Bielanko wrote in a blog for the parenting website Babble . ABC News and Babble are owned by The Walt Disney Company.\nWhile Barbie's popularity is down for girls ages 6 to 9, Silver said, the demand still exists for girls ages 3 to 6.\n\"The fashion doll market used to be the ages 3 to 9 market,\" Silver said. \"That used to be the market for Barbie. But kids are growing up so much quicker.\" Instead, dolls like the ethnically-ambiguous Monster High line, also by Mattel, are growing in popularity for girls ages 6 to 9.\nshop.mattel.com PHOTO: Monster High® Freak Du Chic? Frankie Stein® Doll\n\"I definitely like the idea of racially ambiguous dolls or dolls of all sizes and colors,\" Bielanko said. \"Barbie isn't just preposterously shaped, but perpetuating the whole blonde hair, blue-eyed standard of beauty is ridiculous as well.\"\nMattel has also diversified the Barbie line by introducing nameless friends in the last year with different color hair, skin and eyes, called the \"Fashionista\" line, without ethnic labels.\n\"This line looked entirely different and I think they’re much more conscious of showing diversity in all their doll lines,\" Silver said.\nBarbie.com PHOTO: Barbie® Fashionistas® Doll\nAndra Watkins, 46, from Charleston, South Carolina, refuses to buy a Barbie for her niece, Cayleigh, 12.\nPage 1 | 2 View Single Page", "external_links": ["http://www.rubbershoesinhell.com/", "http://www.babble.com/mom/barbie-designer-defends-proportions-and-i-aint-buying-it-or-a-barbie-for-my-daughter/", "http://a.abcnews.com/images/Business/HT_mattel_monster_high_frankie_stein_doll_jt_150717_4x3_992.jpg", "http://a.abcnews.com/images/Business/HT_mattel_barbie_fashionista_jt_150717_4x3_992.jpg"], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-18T00:35:50.000+03:00", "highlightTitle": ""}