{"organizations": ["Telford Homes plc", "CVS Group Plc"], "uuid": "bcf2960f1e5fb812ba211184a139411c6b5ee005", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/3-aim-stocks-d-buy-150151611.html", "country": "US", "title": "3 AIM Stocks I’d Buy Before Monitise Plc: James Halstead PLC, Telford Homes plc And CVS Group Plc", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "3 AIM Stocks I’d Buy Before Monitise Plc: James Halstead PLC, Telford Homes plc And CVS Group Plc", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T18:01:00.000+03:00", "replies_count": 0, "uuid": "bcf2960f1e5fb812ba211184a139411c6b5ee005"}, "author": "", "url": "https://uk.finance.yahoo.com/news/3-aim-stocks-d-buy-150151611.html", "ord_in_thread": 0, "title": "3 AIM Stocks I’d Buy Before Monitise Plc: James Halstead PLC, Telford Homes plc And CVS Group Plc", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Halstead PLC"], "text": "0.152 -0.012 \nToday's news that mobile payments specialist Monitise (LSE: MONI) has released another revenue warning is perhaps not a major surprise. Certainly, the company's shares have fallen by only 3% today and, with it being the fourth such warning since the start of last year, it is not completely out of the blue. \nClearly, Monitise is still struggling to turn a great product into a highly profitable business. And, looking ahead, there is a danger that Monitise runs out of time on this front, since technological change is as fast as ever. Certainly, there is the potential for a bid approach, but with it having reviewed its strategic options and found no realistic buyer, Monitise is left trying to turn a red bottom line into a black one. \nAs a result, it may be prudent to stick to highly profitable businesses that are also in the AIM 50 list. For example, Telford Homes (LSE: TEF) has grown its pretax profit in each of the last five years and, looking ahead, is set to post a 20% rise in earnings in the current year. Furthermore, its long term future is very bright, with it set to benefit from increasing demand near to planned Cross Rail sites in the south east of England. As such, its price to earnings (P/E) ratio of 10.7 indicates excellent value for money - especially with the monetary policy outlook being favourable for the house building sector. \nAlso benefitting from lower interest rates (via a weak sterling) is flooring company, James Halstead (LSE: JHD). It has an excellent track record of profitability and is a relatively consistent and robust performer. Furthermore, it also offers a yield of 2.7%, which is covered 1.4 times by profit and this provides more evidence that the company's financial standing is relatively sound. Certainly, it is not as cheap as it was a year ago, owing to a share price gain of 35%, but its consistency means that investor sentiment should remain upbeat moving forward. \nLikewise, veterinary services provide, CVS (LSE: CVS), has a bright future ahead of it. That's because it is expected to post earnings growth of 25% this year, followed by 13% next year. This puts it on a price to earnings growth (PEG) ratio of just 1.1, which indicates that share price appreciation is very much on the cards. Furthermore, CVS is a very robust performer, with the pet care sector being a very defensive space in which to operate. In fact, even during downturns and recessions, pet owners rarely cut back on looking after their animals and, as such, CVS's long term earnings outlook is strong and very transparent. \nSo, while Monitise does have a great product, there are a number of great businesses on offer within the AIM 50. Furthermore, there are a number of other small-cap stocks that could be worth buying right now and, with that in mind, the analysts at The Motley Fool have written a free and without obligation guide called 1 Top Small-Cap Stock From The Motley Fool. \nThe company in question may have flown under your investment radar until now, but could help you to build a great income from your investments and retire early, pay off the mortgage, or simply enjoy a more abundant lifestyle. \nClick here to find out all about it - it's completely free and comes without any obligation. \nPeter Stephens has no position in any shares mentioned. The Motley Fool UK owns shares of Monitise. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-06T18:01:00.000+03:00", "crawled": "2015-07-06T18:58:58.000+03:00", "highlightTitle": ""}