{"organizations": [], "uuid": "a264b0cc397958f7e47428cbc5c4560ff7ae55d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/hochbergfred_060415fr.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/248285-ex-im-chairman-says-hes-following-the-law", "country": "US", "title": "Ex-Im chairman says he’s following the law", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ex-Im chairman says he’s following the law", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T02:06:00.000+03:00", "replies_count": 0, "uuid": "a264b0cc397958f7e47428cbc5c4560ff7ae55d2"}, "author": "dweaver@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/248285-ex-im-chairman-says-hes-following-the-law", "ord_in_thread": 0, "title": "Ex-Im chairman says he’s following the law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ex-Im chairman says he’s following the law By Kevin Cirilli - 07/16/15 07:06 PM EDT \nExport-Import Bank chairman Fred Hochberg is pushing back on conservative critics in Congress, saying that he's following the law by continuing the bank's operations despite the expiration of its charter.House Financial Services Committee chairman Jeb Hensarling (R-Texas) had pressed Hochberg in a letter about plans to wind down the bank, noting that lawmakers did not renew its charter by the June 30 deadline. ADVERTISEMENT Hochberg in response said that bank officials had been \"working very diligently to prepare for a potential lapse in authority to approve new transactions,\" which became reality once the charter expired.\"The bank's current focus is making sure that the bank's staff and the thousands of exporters that we are currently supporting understand the operating limits that apply after June 30,\" Hochberg wrote in a response to Hensarling that was first obtained by The Hill.\nBefore the expiration of its charter, Ex-Im \"notified all parties that do business with the bank that the bank is no longer able to approve any new transactions or renew transactions.\"Conservatives like Hensarling argue that the bank only uses its federally-backed funds to finance big businesses like Boeing and that it's a form of \"corporate welfare.\" The business community has rallied moderate Republicans and Democrats to support reauthorizing it. They say its financing helps sustain thousands of U.S. jobs.The Senate is expected to attach an Ex-Im amendment to an infrastructure spending bill. The House moved the transportation bill earlier this week without an Ex-Im amendment. \nIn the meantime, Hochberg wrote that the \"bank has been assessing its options for determining the optimal path for an orderly restructuring.\"", "external_links": [], "published": "2015-07-17T02:06:00.000+03:00", "crawled": "2015-07-17T09:37:47.000+03:00", "highlightTitle": ""}