{"organizations": [], "uuid": "47138f47843abc0dc1ffa294539e6a2bd1870ab7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/08/eurozone-greece-valls-idUSL8N0ZO3GV20150708", "country": "US", "title": "UPDATE 1-France says 'No' to Greek euro exit - PM Valls", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-France says 'No' to Greek euro exit - PM Valls | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T19:44:00.000+03:00", "replies_count": 0, "uuid": "47138f47843abc0dc1ffa294539e6a2bd1870ab7"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/08/eurozone-greece-valls-idUSL8N0ZO3GV20150708", "ord_in_thread": 0, "title": "UPDATE 1-France says 'No' to Greek euro exit - PM Valls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds further Quote: s)\nBy Mark John\nPARIS, July 8 (Reuters) - France will do all it can to keep Greece in the euro zone, Prime Minister Manuel Valls said on Wednesday, saying a \"Grexit\" could have major geopolitical consequences for Europe and damage the world economy.\nHis keynote speech to the French parliament on the Greek crisis was the strongest statement of intent from Paris so far that it will fight to avoid the departure of Greece from the single currency zone.\n\"Keeping Greece in the euro and therefore in the heart of Europe and the EU is something of the utmost geostrategic and geopolitical importance,\" said Valls.\n\"Allowing Greece to exit the euro zone would be an admission of impotence - France refuses that,\" Valls said, adding that a deal between Athens and creditors remained \"within grasp\".\nWhile calling on Alexis Tsipras' government to make reforms to its tax and pensions systems, Valls said Athens also needed to have a \"clear perspective\" on how its creditors intended to handle its debt.\nIn contrast to many German counterparts, French officials have repeatedly said that talks on Greek debt, including a possible re-alignment of maturities, should not be taboo.\nIn his speech, Valls sketched out more than a century of political and cultural ties linking France and Greece, which he described as a \"great European nation\".\nA stable Greece was strategically important for Europe's ties with Turkey and given the continued fragility of the Balkans and tensions on Europe's eastern border, Valls said in reference to the Ukraine conflict.\nHe described Greece as Europe's outpost to the Middle East and as a front-line player in the growing immigration crisis as Europe struggled to deal with thousands of migrants fleeing poverty and conflict in Africa and the Middle East.\n\"Weaken Greece and we are all weakened. It would weaken Europe and have repercussions for the world economy,\" he said.\nValls announced that, in the event of a deal between Greece and its creditors, France would put it to parliament to secure its backing.\nThe socialist government of President Francois Hollande has long portrayed itself in a mediation role between Tsipras' leftist administration and the rest of a euro zone increasingly alienated by his rejection of austerity policies.\nBut Paris is equally keen not to burn bridges with Germany, where ruling conservatives have taken a much tougher line on Greece and in some cases publicly evoked the possibility of a \"Grexit\".\n\"France's role, notably with Germany, is to build the future of Europe together. When the chips are down ... it's France and Germany together with a duty to rise to the occasion.\"\nValls said the Greek crisis showed among other things the need to speed up efforts to improve governance of the euro zone, for example by forging common policies to nurture social and economic convergence in the region. (Additional reporting by Yves Clarisse; and Andrew Callus; Editing by Digby Lidstone)", "external_links": [], "published": "2015-07-08T19:44:00.000+03:00", "crawled": "2015-07-08T18:52:01.000+03:00", "highlightTitle": ""}