{"organizations": [], "uuid": "cdb8b7b450165abbaacc845fa8768115f9b0e3a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/o/x/e/c/image.related.afrArticleLead.620x365.gi5cgy.png/1436075204712.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/senate-push-to-review-submarine-option-j-20150705-gi5cgy", "country": "AU", "title": "Senate push to review submarine 'option J'", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Senate push to review submarine 'option J' | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T13:46:00.000+03:00", "replies_count": 0, "uuid": "cdb8b7b450165abbaacc845fa8768115f9b0e3a3"}, "author": "John Kerin", "url": "http://www.afr.com/news/politics/senate-push-to-review-submarine-option-j-20150705-gi5cgy", "ord_in_thread": 0, "title": "Senate push to review submarine 'option J'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Collins class submarine may be replaced by the Japan-made Soryu class. Petty Officer Damian Pawlenko by John Kerin Senior Abbott government officials could be hauled before a Senate inquiry to explain their role in the push for a Japanese submarine and the process that led to the downfall of Defence Minister David Johnston.\nThe development follows a paper circulated to a tight-knit defence community by a former confidante of Senator Johnston and submariner Rex Patrick, which attempts to lay out intimate details on the push for \"Option J\" as it has been labelled, and the part it played in Johnston's downfall as Defence Minister in December.\nThe competitive evaluation process has also been drawn to the attention of the Australian National Audit Office, which reviews the country's top 30 defence projects annually.\nMr Patrick's insider account alleges Senator Johnston, who promised submarines would be built in Adelaide prior to the election, was progressively shut out of the process by the Prime Minister's office – a fate that has also befallen the government weapons purchaser the Defence Materiel Organisation and the Defence Department itself.\nJapan wants to avoid being dragged into further domestic brawling in Australia given sensitivities around its emergence from post-World War II pacifism, according to defence sources.\nA controversial competitive evaluation process was set up in February after it appeared a tie-up with Japan to build the submarines offshore was all but a certainty as part of efforts to strengthen strategic ties.\nThree submarines are being considered in the 10 month process, the 4000 tonne Japanese Soryu class built by Mitsubishi/Kawasaki, the French DCNS non-nuclear version of its 4700 tonne Barracuda class and German builder TKMS's 4000 tonne Type 216.\nAll three bidders have been asked to propose offshore build, hybrid build and Australia build options and Mr Abbott has promised whoever triumphs in the contest there will be at least 500 more jobs in Adelaide.\n More defensible Ironically Mr Patrick argues had Mr Abbott chosen Japan outright it would have been more defensible then the current process.\n\"I am not alleging a conspiracy, no one is engaging in illegal acts or seeking to deliberately cause harm,\" Mr Patrick said.\n\"But there are grounds to call his process a sham. It misrepresents what is supposed to be a fair and open acquisition process … and it could mean the Navy does not get the best submarine,\" Mr Patrick said.\n\"If the Japanese pick has already been made, European companies will suffer the reputational damage of losing in what is being presented internationally as a fair and open competition,\" he said.\nOpposition defence spokesman Stephen Conroy said the matters raised by Mr Patrick should be referred immediately to a Senate shipbuilding inquiry for thorough investigation.\nHe said the Competitive Evaluation Process (CEP) had been \"exposed as a political fix designed to save the Prime Minister's job and deliver on his secret deal to send the construction of our future submarines to Japan\".\n\"Any additional evidence of Tony Abbott's efforts to undermine our shipbuilding industry should be referred to the committee and thoroughly investigated.\"\nSouth Australian Independent Senator Nick Xenophon said the Senate inquiry \"simply wanted to get to the bottom of whether the CEP was a fair dinkum process\".\n\"For the life of me I can't see why the government did not stipulate a local build, because that was the pre-election promise.\n\"I have no problem with Japanese submarines, Japan is one of our closest friends and allies but we need to be sure the CEP is a fair and transparent,\" Senator Xenophon said.\nBut Australian Strategic Policy Institute capability analyst, Dr Andrew Davies, said the concern about the process was \"overblown\".\n\"I can tell you that defence is dealing with the three contenders in the CEP with the utmost thoroughness and due diligence,\" Dr Davies said.\nA spokesman for Defence Minister Kevin Andrews said on Sunday: \"The government was determined to get Australia's future submarine program back on track after Labor for six years sat on their hands and did nothing.\"\nHe said the evaluation process would \"provide the best opportunity for Australian industry to participate in this program. It is a robust process being overseen by a panel of independent experts\".\nThe government has appointed an expert panel to oversee the process, including Professor Donald Winter, who was co-author of a report into the troubled $8 billion air warfare destroyer project, former Federal Court justice Julie Anne Dodds-Streeton, infrastructure specialist Ron Finlay and former BAE Australia chief executive Jim McDowell.\nMr Patricks' paper is expected to be published by Asia Pacific Defence Reporter online on Monday.", "external_links": [], "published": "2015-07-05T13:46:00.000+03:00", "crawled": "2015-07-05T08:58:37.000+03:00", "highlightTitle": ""}