{"organizations": [], "uuid": "2bab89f46a4de8ca18779fc72abd36d1063e300f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2014-01/30/full/1391089545-525.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss#", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/bank-of-india-goes-to-rbi-against-its-auditors-115071400134_1.html", "country": "IN", "title": "Bank of India goes to RBI against its auditors", "performance_score": 0, "site": "business-standard.com", "participants_count": 1, "title_full": "Bank of India goes to RBI against its auditors | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "2bab89f46a4de8ca18779fc72abd36d1063e300f"}, "author": "Manojit Saha", "url": "http://www.business-standard.com/article/finance/bank-of-india-goes-to-rbi-against-its-auditors-115071400134_1.html", "ord_in_thread": 0, "title": "Bank of India goes to RBI against its auditors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Irked over stringent auditing of its financial results for the quarter ended March, 2015, state-run lender Bank of India (BoI) has dashed off a letter to the Reserve Bank of India (RBI) saying auditors have not allowed the bank to treat the loan given to Essar Steel as standard like most other lenders. \nBank of India, which reported loss in Jan-March quarter, classified the loan as non-performing as repayment was due for more than 90 days. \nAccording to sources, the borrower paid its due to most the lenders on the 92nd or 93rd day – which technically becomes non-performing assets. According to RBI’s asset classification norms, if the interest and/or principle is due for more than 90 days, a bank has to classify the loan as non-performing. Sub-standard assets, the first level of NPAs, attract 15% provisioning, as compared to 0.4% provisioning required for standard assets. \nHowever, most of banks that has an exposure to Essar Steel have treated the account as standard as the loan was serviced before the Jan-March earnings were finanlised, and it was only a marginal delay. \nHowever, Bank of India’s auditors wanted to go strictly by the books and reasoned that the loan should be treated as non-performing. Bank of India’s exposure (fund and non-fund based) to the steel major was around Rs 250 crore. More than 20 banks and financial institutions have an exposure to the steel company, which is to the tune of Rs 50,000 crore. \nBank of India had reported a net loss of Rs 56 crore during the Jan-March quarter as compared to a net profit of Rs 558 crore during the same period of the previous year. This was due to doubling of provisions towards bad and doubtful assets, which was Rs 2,240 crore during the period under review. Its gross NPAs doubled to Rs 22,193.24 crore in March 2015 from Rs 11,868.6 crore in the same period last year. \nBank of India’s auditors were Issac & Suresh, MM Nissim & Co, D Singh & Co, JK Kapur & Uberai, Grover Lalla & Mehta, B Rattan & Associates. \nThough the auditors are appointed by the banks, the central bank keeps discussing various issues and sensitises them on issues that deserves attention.", "external_links": [], "published": "2015-07-14T03:00:00.000+03:00", "crawled": "2015-07-14T12:04:52.000+03:00", "highlightTitle": ""}