{"organizations": [], "uuid": "64cbaf5d91b48a4883b71e3815e97618be802dc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-07/KI_315106_skill-india-logo-launched-16-7-15.jpg", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business_Finance", "url": "http://www.menafn.com/1094283318/Skill-India-Mission--Sarvada-Vigyata-Vijaya&src=RSS", "country": "US", "title": "Skill India Mission - 'Sarvada Vigyata Vijaya'", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Skill India Mission - 'Sarvada Vigyata Vijaya' | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "64cbaf5d91b48a4883b71e3815e97618be802dc1"}, "author": "KNN India", "url": "http://www.menafn.com/1094283318/Skill-India-Mission--Sarvada-Vigyata-Vijaya&src=RSS", "ord_in_thread": 0, "title": "Skill India Mission - 'Sarvada Vigyata Vijaya'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - KNN India) During the launch of Skill India Mission on Wednesday, Prime Minister Narendra Modi unveiled the Skill India logo and launched four landmark initiatives of the Ministry of Skill Development and Entrepreneurship: National Skill Development Mission, National Policy for Skill Development and Entrepreneurship 2015, Pradhan Mantri Kaushal Vikas Yojana (PMKVY) scheme and the Skill Loan scheme. \n\nThe Skill India logo depicts a clenched hand in which a spanner and pencil are firmly held, exemplifying the empowerment of the individual through skilling. The spanner and pencil are held together, suggesting that both skill and general education are at parity and aspirational for India's youth.\n\nThe tagline, 'Kaushal Bharat, Kushal Bharat' suggests that skilling Indians ('Kaushal Bharat') will result in a happy, healthy, prosperous and strong nation ('Kushal Bharat.') A short film unveiling the logo was shown, which featured the Sanskrit chant 'Sarvada Vigyata Vijaya,' meaning 'Skill Always Wins.' \n\nThe Pradhan Mantri Kaushal Vikas Yojana (PMKVY), the Ministry's flagship, demand-driven, reward-based skill training scheme will incentivise skill training by providing financial rewards to candidates who successfully complete approved skill training programmes.\n\nOver the next year, PMKVY will skill 24 lakh youth, across India. For the first time, the skills of young people who lack formal certification, such as workers in India's vast unorganised sector, will be recognised. Through an initiative known as 'Recognition of Prior Learning' (RPL), 10 lakh youth will be assessed and certified for the skills that they already possess. \n\nPrime Minister also launched the Skill Loan scheme. Loans ranging from Rs 5,000-1.5 lakhs will be made available to 34 lakh youth of India seeking to attend skill development programmes over the next five years. Sanction letters for the first ever Skill Loans were handed out by the Prime Minister to aspiring trainees. \n\nDuring the function, Modi awarded Skill Cards and Skill Certificates to trainees who had recently completed training through the Pilot Phase of PMKVY, which started in May 2015. Such Skill Cards and Skill Certificates will allow trainees to share their skill identity with employers. Each Skill Card and Skill Certificate features a Quick Response Code (QR Code), which can be read through a QR reader on mobile devices. Trainees can use these to share their skill qualifications with employers in a quick and reliable way during the job search process. \n\nThe Prime Minister addressed the audience, articulating a clear overarching vision for Skill India. He highlighted the centrality of skills to India's development and called on government, private sector and India's youth to work together to make this vision a reality. The Prime Minister also highlighted the potential for skilled Indian youth to be recognized around the world. He congratulated six award winners from World Skills Oceania, an international skill competition and wished them success as they go on to compete at the World Skills Competition in Sao Paolo next month. \n\nAcross the country, 2,33,000 youth were awarded certificates from ITIs, and 18,000 plus graduating students received job offer letters on the occasion of World Youth Skills Day. The Prime Minister personally presented industry job offer letters to five female ITI graduates at the event. \n\nAcross India, special PMKVY mobilization camps are being organized at 100 locations with Nehru Yuva Kendra Sangathan (NYKS). A national SMS campaign is being rolled out to build awareness of the program, reaching about 40 crore subscribes. Fresh PMKVY training was initiated in 1,000 centres across all States and Union Territories in India today, covering 50,000 youth in 100 job roles across 25 sectors. In New Delhi, Shri Rajiv Pratap Rudy flagged off 150 Skill Vans to create awareness among people of Delhi and NCR region on government's policies and initiatives on skill development. He said that the government has set a target to provide skill training to 40.02 crore people by 2022. (KNN Bureau)", "external_links": [], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T19:54:27.000+03:00", "highlightTitle": ""}