{"organizations": [], "uuid": "97cbab07d3661e5ba810571c771f7f4475f1f44b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/litchfield-county-times/rss/627", "section_title": "Litchfield County Times : Personal Finance", "url": "http://business-news.thestreet.com/litchfield-county-times/story/cutting-medical-costs-could-rely-on-continuity-of-care/13208294", "country": "US", "title": "Cutting Medical Costs Could Rely on Continuity of Care", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Cutting Medical Costs Could Rely on Continuity of Care", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T16:18:00.000+03:00", "replies_count": 0, "uuid": "97cbab07d3661e5ba810571c771f7f4475f1f44b"}, "author": "", "url": "http://business-news.thestreet.com/litchfield-county-times/story/cutting-medical-costs-could-rely-on-continuity-of-care/13208294", "ord_in_thread": 0, "title": "Cutting Medical Costs Could Rely on Continuity of Care", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["S.Z. Berg"], "text": "Cutting Medical Costs Could Rely on Continuity of Care Written by: S.Z. Berg 07/06/15 - 9:18 AM EDT \nNEW YORK ( MainStreet ) — It used to be that when people got sick they saw their family physician. Nowadays, health care is often split among primary care doctors and various specialists, especially for the elderly. This fractured system leaves room for overuse of medical services, which is costly. \nA study by Johns Hopkins University found that the average Medicare beneficiary has 13 medical visits split among four practices, and in doing so sees, on average, two primary care doctors and five specialists on an annual basis, according to lead researcher Max Romano, M.D., M.P.H, a medical student at the Johns Hopkins University School of Medicine and the Johns Hopkins Bloomberg School of Public Health. \nThe researchers examined Medicare fee-for-service claims for more than 1.2 million patients over age 65 in 2008 and found that 14.7% of patients had experienced at least one potentially overused screening, diagnostic, monitoring, or treatment procedure. In general, continuity in medical care was associated with a lower chance of having an overused procedure. More Headlines Generation Angst: Younger Americans Starting to 'Freak Out' About Retirement \n“Conservative estimates suggest that 30% of all health care spending nationwide — roughly $600 billion annually — could be eliminated without any decrease in health care quality,” Romano said in a release. “This research is important, because it suggests that fractured patient care is related to this massive amount of overuse.” \nOveruse of medical services was defined by the researchers as services, such as prescribing unnecessary antibiotics, provided without a clear medical basis, when the risk exceeds likely benefit. \n“The direct physical risks of unnecessary medical procedures include superfluous blood draws, excessive radiation exposure, and in some cases unneeded surgeries with the accompanying possibility of complications such as bleeding, infection and damage to surrounding organs,” Romano tells TheStreet . “More insidious indirect risks include additional worry for patients, loss of confidence in one’s health care providers and the possibility that one unnecessary test will lead to another unnecessary procedure, which could lead to another unnecessary procedure, etc., with each procedure carrying its own risks.” \nThe problem for patients is that it’s difficult for them to know when unnecessary medical services are being ordered. \nPatients can find an extensive list of unnecessary procedures at the American Board of Internal Medicine’s Choosing Wisely Campaign website, choosingwisely.org. “Perhaps more importantly, patients should get in the habit of asking their providers about the intended benefit and potential harm of recommended procedures,” Romano says. \nAllen Kamrava, an attending physician at Cedars Sinai Medical Center’s division of colorectal surgery, and who is not affiliated with the Johns Hopkins study, says unnecessary medical tests are ordered for several reasons, including financial gain, marketing gain – using a surgical robot, for example, which generally lacks studies showing improved outcomes – to set themselves apart, defensive medicine, patient expectations, and a third party payer system. 1", "external_links": [], "published": "2015-07-06T16:18:00.000+03:00", "crawled": "2015-07-06T17:21:31.000+03:00", "highlightTitle": ""}