{"organizations": [], "uuid": "7e1440d497722f139328f388ec672ee80049d89f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DP618_greece_ZG_20150708063014.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/european-stocks-slip-with-vote-on-greek-deal-ahead-2015-07-15", "country": "US", "title": "European stocks advance with vote on Greek deal ahead", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "European stocks advance with vote on Greek deal ahead - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 1, "uuid": "5661c23790a5116e2276817f41549e02594e6c63"}, "author": "By     Carla Mozee", "url": "http://www.marketwatch.com/story/european-stocks-slip-with-vote-on-greek-deal-ahead-2015-07-15#post-0", "ord_in_thread": 0, "title": "European stocks advance with vote on Greek deal ahead", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "European stocks moved higher Wednesday as focus shifted to Greece, where lawmakers face a deadline to approve creditors’ austerity measures or risk losing much-needed bailout aid.\nThe Stoxx Europe 600 SXXP, +0.41% turned up 0.3% to 399.43, with only the consumer goods and industrial sectors edging lower.\nEquities began to advance as the European Commission proposed extending a €7 billion ($7.71 billion) bridge loan to Greece from an emergency-funding program run by the European Union. If approved by the 28 members of the EU, Greece could meet its immediate funding needs, including a repayment of €3.5 billion due Monday to the European Central Bank.\nRead: European Commission proposes €7 billion bridge loan for Greece\nA missed payment to the ECB could prompt the central bank to stop providing emergency funding to Greece’s cash-starved banks.\nGreece crisis: Still, it is likely to be another rough day for Greek Prime Minister Alexis Tsipras, as he will have to battle with hard-line members of his Syriza party who object to the bailout agreement reached with eurozone leaders.\nOn Tuesday, the International Monetary Fund criticized that deal, questioning Greece’s ability to implement the tough fiscal measures involved. It warned the eurozone must commit to debt restructuring in order for the bailout program to work. If the currency union fails to assure the IMF it will reduce Greece’s debt burden to sustainable levels, the fund signaled it may consider withdrawing from the program.\nEquity trading in Greece GD, +2.03% remains closed, as do the country’s banks.\nOther benchmarks: In Frankfurt, the DAX 30 DAX, +0.36% rose 0.2% to 11,550.23, and in Paris, the CAC 40 PX1, +0.39% was up 0.3% to 5,046.99.\nSpain’s IBEX 35 IBEX, +0.80% shed 0.4% to 11,304.10, but Italy’s FTSE MIB FTSEMIB, +1.09% rose 0.7% to 23,257.67. The U.K.’s FTSE 100 UKX, -0.03% tacked on 0.3% to 6,775.14.\nThe euro EURUSD, -0.5723% was trading at $1.1017 versus around $1.1009 late Tuesday.\nData: France’s consumer prices fell 0.1% in June, compared with the previous month. Outside Europe, China said its gross domestic product grew 7% in the second quarter, despite signs Beijing’s policies to jump-start the country’s economy haven't taken hold.\nIn the U.K., unemployment rose by 15,000 during the three months to May, the first quarterly increase in more than two years .\nCorporates: Burberry Group PLC BRBY, -2.16% BURBY, -2.45% fell 1.7% after the retailer posted a low single-digit decline in sales in the Asia-Pacific region, hurt by “further deceleration in Hong Kong,” and a “challenging” luxury market.\nASML Holding NV ASML, +3.28% shares rose 2.7% after the Dutch semiconductor-equipment maker posted higher-than-expected second-quarter profit\nFiat Chrysler Automobiles NV FCA, +2.73% rose 1.5% as Credit Suisse said the company is its top pick in the European auto sector because of its market exposure and upside potential with Ferrari. The broker began coverage of the sector “with a cautious view, as China and Europe provide downside risk.”\nMore from MarketWatch", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-15T17:27:56.000+03:00", "highlightTitle": ""}