{"organizations": ["Barclays Fires Group"], "uuid": "8393e3bbf7608d983fee8818cd2d438c1f3f3abb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507080780.html", "country": "US", "title": "South Africa: Barclays Fires Group CEO Anthony Jenkins", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Barclays Fires Group CEO Anthony Jenkins", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T13:22:00.000+03:00", "replies_count": 0, "uuid": "8393e3bbf7608d983fee8818cd2d438c1f3f3abb"}, "author": "", "url": "http://allafrica.com/stories/201507080780.html", "ord_in_thread": 0, "title": "South Africa: Barclays Fires Group CEO Anthony Jenkins", "locations": ["Nigeria", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Anthony Jenkins"], "text": "Nigeria: Number of Out-of-School Children Rises As Aid to Education Falls - Unesco \nSouth African bank Absa [JSE:ABSP] is a part of Barclays Africa [JSE:BGA], which is a part of the British bank. \nBusiness journalist Bruce Whitfield tweeted on Wednesday: \"Whoa! This is big. What implications for Barclays Africa AKA Absa and SA operations under Maria Ramos?\" \nIn a full statement on its website, Barclays announced the departure of Jenkins as chief executive and the appointment of John McFarlane as executive chairperson pending the appointment of a new chief executive. \nRake said \"it became clear to all of us that a new set of skills were required for the period ahead\". \n\"This development does not signal any major change in strategy,\" the bank said on Wednesday. \nAhmed wrote that Jenkins was told in the last few days that the board no longer had confidence that he was the right man to lead the organisation. \n\"Senior sources have told me that... Rake approached... McFarlane to say that a number of board members were unhappy with the speed of change at the bank. \n\"They wanted cost cutting to go further and more attention paid to the investment bank, which is seen as under-performing,\" he wrote on BBC. \nUnder Jenkins, the bank pledged to eliminate some 7 000 jobs at the investment bank, cut the division's share of group assets to 30% from about 50% and set up a bad bank to sell assets including complex derivatives, according to Bloomberg. \n\"His efforts failed to have a quick impact, with the securities unit reporting a 2.7% return on equity in 2014, down from 8.2% a year earlier and below Jenkins's group target of 12%. It also made it the least profitable of four units. \n\"Barclays shares have increased about 3.6% this year, making them the third-worst performers among major British lenders,\" Bloomberg reported. \nJenkins will continue to receive massive pay \nJenkins is entitled to 12 months' notice from the company under his contract of employment and will therefore continue to receive his current salary (£1 100 000 per annum), role based pay (delivered in Barclays shares) (£950 000 per annum), pension allowance (£363 000 per annum) and other benefits until July 7 2016, Barclays said. \nThis is a total package of R46.6m for the year. \nBarclays said \"the committee has determined that Jenkins will remain eligible to be considered for a pro rated 2015 bonus for time in role as Group Chief Executive, subject to an assessment of the relevant performance measures relating to his 2015 bonus and the general discretion of the Committee. Jenkins will not be eligible to be considered for a 2016 incentive award or a 2016-18 LTIP award.\" \nLooking back on his tenure since 2012, Jenkins said \"it is easy to forget just how bad things were three years ago both for our industry and even more so for us\". \n\"While the external environment has continued to be, and will remain, challenging the group now has the resilience to overcome these challenges.\" \nSource: Fin24", "external_links": [], "published": "2015-07-08T13:22:00.000+03:00", "crawled": "2015-07-08T14:23:22.000+03:00", "highlightTitle": ""}