{"organizations": [], "uuid": "1617e2eb90a201545a00dabbde85c5b5be8913c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/m/0/g/d/image.related.afrArticleLead.620x365.gim1kd.png/1438078556197.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/national/adem-somyurek-mp-quits-cabinet-after-bullying-probe-20150728-gim1kd", "country": "AU", "title": "Adem Somyurek MP quits cabinet after bullying probe", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Adem Somyurek MP quits cabinet after bullying probe | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T11:31:00.000+03:00", "replies_count": 0, "uuid": "1617e2eb90a201545a00dabbde85c5b5be8913c9"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/politics/national/adem-somyurek-mp-quits-cabinet-after-bullying-probe-20150728-gim1kd", "ord_in_thread": 0, "title": "Adem Somyurek MP quits cabinet after bullying probe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Adem Somyurek: A report found the evidence provided to the inquiry by the complainants was \"far more reliable\" than that of the minister. by Lucille Keen Former Victorian minister Adem Somyurek has blamed his enemies in the Labor Party after he was forced to quit from Daniel Andrews' ministry after a bullying complaint by his former chief of staff.\nA report by former judge Michael Strong found the evidence against Mr Somyurek by complainant Dimity Paul was \"far more reliable\" than that of the minister.\nThe report detailed an incident in which Mr Somyurek \"took Ms Paul by the arm to prevent her from leaving his office then took her chin in his hand and shook it gently from side to side as a form of admonition whilst telling Ms Paul [to] 'calm down and put a filter on it'\".\nThe report said the incident could be referred to Victoria Police but it would require Ms Paul to make a formal complaint, which she has said she will not do.\nMs Paul broke down in tears as she spoke about the incident on Tuesday and the harassment she had faced after making the complaint.\n\"I did not want to think of myself as a victim,\" said Ms Paul, who is not seeking compensation.\nMr Somyurek, who defected from the powerful Shop, Distributive and Allied Employees' Association and is now part of the Centre Unity faction, was stood down in May when the allegations became public.\nMr Andrews said the report found Mr Somyurek caused distress to staff and adversely affected their sense of wellbeing.\n \"Mr Strong's findings against the minister are deeply concerning,\" Mr Andrews said.\n\"The minister's behaviour, as outlined by Mr Strong, is unacceptable.\"\nDenied allegations Mr Somyurek has denied the allegations and said the decision for him to resign came from Michael Donovan, the \"boss\" of the SDA.\n\"Now my resignation should not be taken as omission of guilt, I maintain my innocence,\" Mr Somyurek said.\n\"When my colleagues and I left the SDA faction we knew there would be payback. We had no idea that this payback would be so extreme.\"\nMr Somyurek took swing at the Mr Andrews comments when the investigation was announced and called for Deputy Premier James Merlino and Mr Andrews' chief of staff, John McLindon to be sacked.\nHe said the Premier needed to be \"liberated\" from the pair because they were serving the interests of others and not the Labor government.\nMs Paul's lawyer, Maurice Blackburn head of employment law Josh Bornstein said there was no reason why his client should not be reinstated in her role.\n\"The allegations of factional issues at play have been part of a public relations exercise by factional troglodytes in the Labor Party,\" Mr Bornstein said.\n\"The second complainant alongside Dimity Paul was a member of Adem Somyurek's subfaction.\"", "external_links": [], "published": "2015-07-28T11:31:00.000+03:00", "crawled": "2015-07-28T14:47:18.284+03:00", "highlightTitle": ""}