{"organizations": [], "uuid": "83e5d5ef9fa760f356ae8a1a05a1c2fe5fe82bf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.gov.ie", "main_image": "", "site_section": "http://finance.gov.ie/rss.xml", "section_title": "An Roinn Airgeadais, Department of Finance", "url": "http://finance.gov.ie/what-we-do/banking-financial-services/financial-services-division-2-eu/central-bank/public-call", "country": "IE", "title": "Public Call for Expressions of Interest- Governor of Central Bank of Ireland", "performance_score": 0, "site": "finance.gov.ie", "participants_count": 1, "title_full": "Public Call for Expressions of Interest- Governor of Central Bank of Ireland", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T11:46:00.000+03:00", "replies_count": 0, "uuid": "83e5d5ef9fa760f356ae8a1a05a1c2fe5fe82bf1"}, "author": "editorfinance", "url": "http://finance.gov.ie/what-we-do/banking-financial-services/financial-services-division-2-eu/central-bank/public-call", "ord_in_thread": 0, "title": "Public Call for Expressions of Interest- Governor of Central Bank of Ireland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Public Call for Expressions of Interest- Governor of Central Bank of Ireland 23.07.15 \nPublic Call for Expressions of Interest \n\nGovernor of Central Bank of Ireland \n\nThe Minister for Finance, Michael Noonan T.D., invites expressions of interest from suitably qualified candidates in the position of Governor of the Central Bank of Ireland. This position arises from the stated intention of Professor Patrick Honohan to retire towards the end of the year. \n\nUnder the Central Bank Act 1942, the Governor of the Central Bank of Ireland is appointed by the President of Ireland on the advice of the Government for a term of seven years. Given this office holder position is of unique importance to the Irish financial system and the Irish economy, the Minister has decided to undertake a comprehensive search process to fill the position To ensure as broad a search as possible, this call for expressions of interest will be accompanied by an extensive national and international executive search process to identify suitably qualified candidates in Ireland and abroad. \n\nRole of the Governor of the Central Bank of Ireland \nThe position of Governor of the Central Bank of Ireland has extensive functions and powers in relation to safeguarding macro financial stability and consumer protection. These include specific powers around financial stability, financial regulation and the governance and supervision of the broader financial sector. The Governor is also a member of the Governing Council of the European Central Bank and so also has a wider impact on the euro-area economy, mainly in the sphere of monetary policy and price stability. Further details of the roles, responsibilities, functions, and powers of the Governor are set out in the attached Appendix I. \n\nThe successful candidate \nThe successful candidate for the role of Governor of the Central Bank must demonstrate an extensive range of skills, knowledge and experience, including many of the following: \n\nCompetencies Excellent influencing, organisational and leadership skills that will build and maintain effective relationships with stakeholders inside and outside the Central Bank Excellent policy making skills, particularly in economic and financial matters, so as to ensure price stability, financial stability, the protection of consumers, and the efficient operation of the financial and payments system Excellent interpersonal and communication skills Proven ability to think and operate strategically and to execute strategy Proven operational planning and management skills \nFinancial and economic policy-making experience Extensive experience in managing/overseeing the management of a large organisation Senior experience of working in a central bank or financial institution or in a financially significant organisation \nDetailed financial sector, financial regulation and supervisory knowledge A deep understanding of the Irish economy and financial sector Extensive knowledge of the European economic and financial environment, including the operation of the European Union and the European Central Bank A strong understanding or an ability to quickly acquire an understanding of the Irish public sector \n\nPersonal Qualities The credibility and integrity to lead the Central Bank and inspire confidence in the Irish financial services sector The capacity to bring direction and focus to the organisation, establishing clear objectives, whilst harnessing and leveraging the inherent experience within \n\n\nApplication Process \nAll expressions of interest will be treated with strictest confidentiality. The Department of Finance is partnering with executive search firm MERC Partners who will screen all expressions of interest. \n\nFor a confidential discussion and further information, you may contact Ruth Curran Managing Partner or John Glenny, Partner at MERC Partners, at +353 1 206 6700. \n\nCandidates are invited in strict confidence to email comprehensive curriculum vitae together with a cover letter, explaining how they meet the requirements of the role to: CentralBank@merc.ie MERC Partners, Richview Office Park, Clonskeagh, Dublin 14, Ireland. \n\nThe closing date for expressions of interest is 1st September 2015. \n\nThe Government values diversity and welcomes a broad range of applications. \n\nAppendix I \nRoles, Responsibilities, Functions and Powers of the Central Bank Governor The roles and responsibilities of the Governor are set out by the EU Treaties, the ESCB Statute and the Central Bank Act 1942. The functions and powers of the Central Bank are primarily set out in Part II of the Central Bank Act 1942. Section 19A of the Central Bank Act 1942 outlines the responsibilities and powers of the Governor. The Governor's responsibilities and powers include: holding and managing by the Central Bank of the foreign reserves of the State, promoting the efficient and effective operation of payment and settlement systems, and performing such other functions as are imposed on the Governor by or under the Central Bank Act 1942 or by or under another law. The Governor discharges his/her ESCB functions independently of the Central Bank Commission and has sole responsibility for the performance of the functions imposed, and the exercise of powers conferred, on the Central Bank by or under the EU Treaties or the ESCB Statute. The independence of the role in this regard is enshrined in the EU Treaties and takes precedence over Irish law. In carrying out or exercising the Governor's powers and responsibilities, the Governor shall ensure that the resources of the Central Bank allocated for carrying out those responsibilities and powers are used effectively, efficiently and economically. The Governor acts as Chairperson of the Central Bank Commission. The Central Bank Commission may delegate any of its statutory functions to the Governor, a Deputy Governor or an employee of the Central Bank. The Central Bank Commission comprises the Governor, the two Deputy Governors, the Secretary General of the Department of Finance and at least six, but no more than eight, other members appointed by the Minister for Finance. Section 18B of the Central Bank Act 1942 outlines the functions of the Central Bank Commission including: the activities and affairs of the Central Bank (other than ESCB functions) are managed and controlled by the Central Bank Commission the Central Bank Commission ensures the integration of the Central Bank's central banking and financial regulation functions the Central Bank Commission ensures that the functions and powers conferred on the Central Bank are properly exercised and discharged. the Central Bank Commission has the power to do whatever is necessary for or in connection with, or reasonably incidental to, the performance of its functions. The Minister for Finance may, from time to time, request the Governor to consult with the Minister as regards the performance by the Central Bank of any of its functions (other than one imposed by the Rome Treaty or the ESCB Statute). Subject to the requirements of the Maastricht Treaty and the confidentiality provisions imposed by law, the Governor will appear before Joint Committees of the Oireachtas on request. The Governor is an ex-officio member of the Governing Council of the ECB. The Governor, or a substitute, must attend all meetings of the Governing Council. The Governor holds the position of Alternate Governor for Ireland on the IMF’s Board of Governors. Further information on the Central Bank and the role of the Governor are available on the Central Bank’s website: www.centralbank.ie", "external_links": [], "published": "2015-07-23T11:46:00.000+03:00", "crawled": "2015-07-23T16:09:19.365+03:00", "highlightTitle": ""}