{"organizations": [], "uuid": "f71de747a03712ff0f2470b9de098ce3aa612f6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/15/markets-stocks-usa-idUSL2N0ZV29G20150715", "country": "US", "title": "US STOCKS-Wall Street dips after Fed's Yellen as energy weighs", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "US STOCKS-Wall Street dips after Fed's Yellen as energy weighs | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T23:24:00.000+03:00", "replies_count": 0, "uuid": "f71de747a03712ff0f2470b9de098ce3aa612f6b"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/15/markets-stocks-usa-idUSL2N0ZV29G20150715", "ord_in_thread": 0, "title": "US STOCKS-Wall Street dips after Fed's Yellen as energy weighs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Turmoil abroad unlikely to hit U.S. economy - Yellen\n* Bank of America rises after profit more than doubles\n* Macy's rises after Starboard announces stake\n* Indexes off: Dow 0.18 pct, S&P 0.23 pct, Nasdaq 0.24 pct (Updates to late afternoon, changes byline, adds Beige Book)\nBy Tanya Agrawal\nJuly 15 (Reuters) - U.S. stocks dipped on Wednesday after Federal Reserve Chair Janet Yellen said the central bank was ready to raise interest rates if the economy remains on track, with turmoil abroad unlikely to affect the U.S. economy.\nThe energy sector, off 1.9 percent, also weighed as oil prices retreated on concerns increased exports will add to a global supply glut. Brent settled down $1.46 at $57.05 while U.S. crude settled down $1.63 at $51.41 a barrel.\nFinancials, up 0.9 percent, helped curb declines. The group was buoyed by a 3.4 percent rise in Bank of America to $17.72 and a 3.7 percent gain in U.S. Bancorp to $45.51 after their quarterly results.\nThe declines put the S&P on track to snap a four-session winning streak, its longest run of gains since January.\n\"We have hit one of those points again where people are a little tired, a little exhausted,\" said Keith Bliss, senior vice-president at Cuttone & Co in New York.\n\"We are exhausted by all the stories, we are exhausted by Greece, we are exhausted by watching China so intently, we are exhausted by the Iranian nuclear talks.\"\nCelgene climbed 6.7 percent to $131.05 after touching a record high of $135.98. The company said it would buy Receptos to get a potential multibillion-dollar drug.\nYellen said she expects the economy to grow steadily for the rest of the year, allowing the Fed to hike rates, but gave no direct hint on the timing or pace of a hike. The Fed is broadly expected to hike rates in September or December.\nThe Fed's Beige Book showed U.S. economic activity continued to expand from mid-May through June, with lower energy prices helping to boost consumer spending but remaining a drag on manufacturing.\nThe Dow Jones industrial average fell 32.14 points, or 0.18 percent, to 18,021.44, the S&P 500 lost 4.82 points, or 0.23 percent, to 2,104.13 and the Nasdaq Composite dropped 12.30 points, or 0.24 percent, to 5,092.59.\nCorporate America is expected to report its worst sales decline in nearly six years in the second quarter, while profit is expected to have fallen 2.9 percent, according to Thomson Reuters estimates. The effect of the uncertainty in the Chinese markets and the strong dollar will also be in focus.\nYum Brands fell 2.8 percent to $89.01. The owner of Pizza Hut and KFC reported its fourth straight quarter of falling sales, indicating it is still struggling to regain lost ground in China after a food scandal last year.\nMacy's jumped 7.9 percent to $72.02 after investment firm Starboard Value said it had taken a stake in the retail chain.\nDeclining issues outnumbered advancing ones on the NYSE by 1,886 to 1,145, for a 1.65-to-1 ratio; on the Nasdaq, 1,810 issues fell and 988 advanced for a 1.83-to-1 ratio favoring decliners.\nThe S&P 500 posted 30 new 52-week highs and 16 new lows; the Nasdaq recorded 132 new highs and 58 new lows. (Reporting by Chuck Mikolajczak ; Editing by Nick Zieminski)", "external_links": [], "published": "2015-07-15T23:24:00.000+03:00", "crawled": "2015-07-15T22:30:48.000+03:00", "highlightTitle": ""}