{"organizations": ["Royal Mail", "Questor"], "uuid": "37007119bad9bfe3241e350b4f40ef966d37a7e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/questor-share-tip-royal-mail-190337284.html", "country": "US", "title": "Questor share tip: Royal Mail reports solid start", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Questor share tip: Royal Mail reports solid start", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T22:03:00.000+03:00", "replies_count": 0, "uuid": "37007119bad9bfe3241e350b4f40ef966d37a7e9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/questor-share-tip-royal-mail-190337284.html", "ord_in_thread": 0, "title": "Questor share tip: Royal Mail reports solid start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "510.00 -1.50 \nThere is no escaping the fact that the UK postal market is incredibly tough but Royal Mail (LSE: RMG.L - news ) enjoyed a steady start to trading in the new financial year, says Questor \nRoyal Mail 510p-1.5p Questor says HOLD \nROYAL Mail [LON:RMG] announced a good start to its new financial year, as it continues to deal with people sending fewer letters by focusing on growth in the parcel delivery business. \nThe company has always said it expects the letter market to decline at a rate of about 4pc to 6pc a year. With that in mind, the 5pc decline in letters and 4pc fall in revenue in the three months to June 28 was exactly in line. \nThe parcel deivery business is faring better, with deliveries up 3pc and revenues in the division moving 2pc higher. The European parcel delivery operation, General Logistic Systems (GLS), enjoyed 9pc revenue growth. \nOverall, this meant revenue for the entire company was flat on the same period last year. \nInvestors should be careful not to read too much into this steady start to the year. The most important trading period for Royal Mail is always Christmas, when a surge in letters and parcels brings a jump in revenues and profits. \nThe UK parcel delivery market is fiercely competitive, and while competitors such as CityLink have collapsed, rivals such as Amazon are increasing the amount of packages they can handle. \nRoyal Mail position in UK parcels (based on revenue). Source: Royal Mail prospectus \nThis increase in handling capacity is pushing down the prices that Royal Mail can charge for the increasing number of parcels being sent through the post as people order goods online. \nOfcom, the communications watchdog, is also taking a look at Royal Mail’s dominant position in the letter delivery market after Whistl halted its loss-making door-to-door delivery operations. \nRoyal Mail is proving to be a steady operator. The share price is underpinned by the ownership of eight acres of prime London property at Mount Pleasant near King’s Cross and 14 acres at Nine Elms, opposite the new Battersea power station development. \nAnalysts from Berenberg estimate the property portfolio could be worth up to £1bn, or about £1 per share. \nThe stock has had a strong year and is now up 18pc after the company reported underlying operating profit up 6pc to £740m. \nMarket consensus is for pre-tax profits to fall 18pc to £427m in the year to March 2016, giving 35.3p in earnings per share. That leaves the shares trading on 20 times the forecast earnings, and offering a prospective dividend yield of 4.3pc. \nFor a company under invsetigation by the market regulator and facing challenges, that looks like a reasonable price. \nWe still think the shares are worth holding on to for the long-term income.", "external_links": [], "published": "2015-07-21T22:03:00.000+03:00", "crawled": "2015-07-21T22:10:45.930+03:00", "highlightTitle": ""}