{"organizations": ["IMF"], "uuid": "aef05e01ab75e87e2df19bf9c518c871ab85108a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507231194.html", "country": "US", "title": "Congo-Brazzaville: IMF Executive Board Concludes 2015 Article IV Consultation With the Republic of Congo", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Congo-Brazzaville: IMF Executive Board Concludes 2015 Article IV Consultation With the Republic of Congo", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T13:58:00.000+03:00", "replies_count": 0, "uuid": "aef05e01ab75e87e2df19bf9c518c871ab85108a"}, "author": "", "url": "http://allafrica.com/stories/201507231194.html", "ord_in_thread": 0, "title": "Congo-Brazzaville: IMF Executive Board Concludes 2015 Article IV Consultation With the Republic of Congo", "locations": ["Congo-Brazzaville", "Republic of Congo Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya: Where Will Obama Spend the Night? \nThe fiscal deficit amounted to 8.5 percent of GDP in 2014, a near doubling from 2013, owing mostly to increased spending and the lower oil revenues. The fiscal deficit was mainly financed by borrowing from the regional central bank and by drawing on government deposits held abroad. The current account deficit widened by one percent of GDP to 5½ percent of GDP in 2014. However, official reserves held at the BEAC increased by CFAF 189 billion to CFAF 2,698 billion at end-2014, owing to the repatriation of commercial banks' deposits and government deposits held abroad. \nAs a consequence, the Republic of Congo's international reserves and government deposits at the regional central bank remain at about 9½ months of prospective imports and 20 percent of GDP, respectively, both the highest among members of the Central African Economic and Monetary Community (CEMAC). Public debt now amounts to about 36½ percent of GDP, up from 32 percent of GDP in 2013 and from 20 percent of GDP in 2010, following the HIPC Completion Point. The authorities are taking corrective fiscal measures by reining in investment expenditure in a supplementary 2015 budget. \nRobust growth in recent years has not resulted in a broad-based improvement in living standards. Growth averaged 5 percent over the last 5 years as government spending was ramped up, financed mostly by rising oil revenues. This translated into increased activity in the agriculture, industry and services sectors. Nevertheless, the Republic of Congo continues to suffer from high rates of poverty and inequality, large infrastructure gaps, and important development challenges. \nThe near- and medium-term outlook will be shaped by developments in the oil sector and the path and quality of fiscal adjustment. Oil production is expected to decline in 2015 mainly due to the delay in the coming on stream of a new oil field. GDP growth in 2015 is projected at 1 percent and to average about 3 percent per annum during 2015-20. The lower international oil price is projected to lead to deterioration in the current account and continued pressure on the budget. Over the period to 2018, the expected increase in oil production from the coming on stream of new oil fields should improve fiscal and external balances. \nFrom 2018, this trend is likely to reverse as oil production declines. Non-oil growth is projected to slow to about 3 percent in 2015-16, as public investment spending contracts and mining projects are delayed due to the uncertain global outlook for iron ore. Inflation is projected at 2½ percent over the medium term, underpinned by the pegged exchange rate regime. Risks to the outlook relate to oil price volatility, persistently low oil prices, accumulation of domestic payment arrears, and domestic instability. \nExecutive Board Assessment \nGrowth was strong and inflation moderated in 2014. Growth rose to 6.8 percent in 2014, driven by a rebound in oil production. Inflation eased to 0.5 percent at end-2014 (year-on-year), driven mainly by lower global food prices. \nBut Congo has been hit hard by the oil price shock. The fiscal deficit amounted to 8.5 percent of GDP in 2014, a near doubling from 2013, owing mostly to increased spending and the lower oil receipts. The current account balance also deteriorated. \nThe economy is projected to expand by about 3 percent per annum during 2015-20 as new oil fields come on stream. Though necessary, the fiscal consolidation implied by the supplementary budget is expected to result in growth slowing to 1 percent in 2015. \nRisks to the outlook relate to oil price volatility, persistently low oil prices, accumulation of domestic payment arrears, and domestic instability. While Congo's real effective exchange rate is broadly in line with macroeconomic fundamentals, the performance of non-oil exports is weak and points to competitiveness concerns. \nThe 2015 supplementary budget should be passed swiftly and its implementation monitored closely. The authorities should weigh carefully their response to revenue shortfalls and expenditure overruns. Maintaining deposits at the regional central bank would provide a buffer in the event of additional adverse shocks. Contingency plans should be prepared to address downside risks. \nSafeguarding fiscal and debt sustainability will require a coherent medium-term fiscal adjustment strategy. In view of the limited remaining lifetime of oil reserves, and continued low prices, fiscal policy should be anchored on a gradual multi-year reduction in the non-oil primary deficit. \nThe rise in government debt since the 2010 HIPC/MDRI relief in addition to the drawdown of oil reserves, underscores the importance of continued adherence to a prudent borrowing policy that keeps the NPV of net debt below indicative DSA thresholds. This should also be coordinated within the context of a revised CEMAC macroeconomic surveillance framework (See CEMAC Staff Report). \nPublic expenditure should increasingly be oriented towards policies to support inclusive growth and pro-poor programs. The link between the actions in the NDP and the annual budgets should be clearly established during budget preparation, with a stronger focus on economic diversification. \nThe selection, evaluation, and monitoring of investment projects, as well as the budgeting of their operating and maintenance costs, need to be strengthened. More broadly, the authorities are encouraged to follow up on the recommendations from the PEFA and PEMFAR to strengthen budget execution, procurement and disbursement processes and improve the efficiency and quality of spending. \nFiscal adjustment should be underpinned by improved revenue policies and PFM reforms. There is scope to boost non-oil revenues by limiting the use of reduced VAT rates and tax exemptions whilst reinforcing tax and customs administration. PFM reforms should focus on improving the quality of investment, resolving the accumulation of arrears, and ensuring comprehensive fiscal reporting that consolidates off-budget spending, possibly with IMF technical assistance. \nFinancial sector reforms are essential to underpin growth, diversification and reduce inequality. The financial sector should benefit from the authorities' plans to revise its strategy in this sector with a view to covering recent innovations and consistency with regional objectives. \nKey priorities remain the improvement of the credit registry, establishing a property registry and a unique window to register land titles, and strengthening the judicial framework. Promoting broader usage of microfinance and mobile banking should also enhance financial access. \nExternal sustainability should aim at maintaining a level of reserves above five months of imports to support the exchange rate peg. \nThe decline in oil prices, and its impact on foreign exchange reserves, reinforces the importance of compliance with CEMAC reserves pooling requirements to underpin the pegged exchange rate arrangement. In this regard, staff welcomes the repatriation of part of Congo's overseas deposits and recommends a continuation of this policy. \nThe quality and timeliness of macroeconomic statistics needs urgent strengthening, to help improve macroeconomic analysis and policymaking and ensure compliance with obligations under Article VIII. Progress needs to be made in improving capacity and operationalizing the NSSD. In particular, macroeconomic statistics should be unified across government agencies and the national statistics agency should have adequate funding. \nIt is recommended that the next Article IV consultation take place on the standard 12-month cycle. \n1 Including grants. \n2 Revenue (excluding interest income and grants) minus total expenditure (excluding interest payments and foreign-financed investment). \n3 HIPC completion point reached in January 2010. In March 2010, the Paris Club granted 100 percent debt relief. \n1 Under Article IV of the IMF's Articles of Agreement, the IMF holds bilateral discussions with members, usually every year. A staff team visits the country, collects economic and financial information, and discusses with officials the country's economic developments and policies. On return to headquarters, the staff prepares a report, which forms the basis for discussion by the Executive Board. \n2 The lapse-of-time procedure is proposed for article IV consultations where the following conditions apply: (i) there are no acute or significant risks, or general policy issues requiring Board discussion; (ii) policies or circumstances are unlikely to have significant regional or global impact; (iii) in the event a parallel program review is being completed, it is also being completed on a lapse-of-time basis; and (iv) the use of Fund resources is not under discussion or anticipated. Congo-Brazzaville \nPresident John Mahama has held talks with a former Prime Minister of Israel, Mr. Shimon Peres, in Brazzaville, Congo. see more » Copyright © 2015 International Monetary Fund. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-23T13:58:00.000+03:00", "crawled": "2015-07-23T14:42:03.663+03:00", "highlightTitle": ""}