{"organizations": [], "uuid": "dad745d99ef671ad51521d81797ce4b9fa3e0ed2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507132704.html", "country": "US", "title": "Africa: Understanding Sub-Saharan Africa's Mobile Financial Services Ecosystem", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Understanding Sub-Saharan Africa's Mobile Financial Services Ecosystem", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T18:12:00.000+03:00", "replies_count": 0, "uuid": "dad745d99ef671ad51521d81797ce4b9fa3e0ed2"}, "author": "", "url": "http://allafrica.com/stories/201507132704.html", "ord_in_thread": 0, "title": "Africa: Understanding Sub-Saharan Africa's Mobile Financial Services Ecosystem", "locations": ["Africa", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa: Gumtree Ups Safety of Online Car Classifieds \nNew players have sprung up in various market segments and there is growing international interest from various types of investors. Tracking this growth is far from easy but &innovation, a South African consultancy - in partnership with Balancing Act - has taken 9 months for 2 analysts to produce what is almost certainly the most detailed report on the Mobile Financial Services market available. The data were collected from the end of 2014 up until July 2015 and so is as up-to-date as you can get. \nSylvain Béletre interviewed the report's authors about what's in this report. \n«This analysis probably offers the single most detailed and up-to-date data source for the Sub-Saharan Africa's Mobile Financial Services sector. Decision markers - banks, operators, governments, analysts, investors, internet entrepreneurs, etc. - looking to understand and expand in this field, prepare a business plan and convince partners will find valuable insights in this report. It will save research time, cut costs and is essential reading for anyone involved» explains Nevo Hadas, CEO of &Innovation. \n«Africa's growth projection of GDP and population offers long term potential for Mobile Financial Services. In Kenya alone, there are more Mpesa agents than ATM per capita in the US, and Mobile Financial Services cost less to operate than traditional bank services. We are seeing multiple basic payment services, but credit, insurance, or health covers' services are still under-represented. The opportunities for banks and insurance services are still massive as there is still very limited infrastructure in place. This is what is called the unbanked opportunity» adds Hadas. \n«We've read most of the what is available on the web and interviewed many key executives, and have identified results so far, identifying innovations and best practices that have worked. Our research describes almost 200 players in this market segment. The good news is that those players are predominantly African companies, about 80%, while the rest are from Europe. The rapid growth has already led to a few acquisitions with the latest being Commonwealth Bank buying TYME bank, a leading mobile only banking provider, to emulate its model in South East Asia. \nAmong our conclusions, we believe that the 340 millions unbanked across Africa will grow dramatically with population trends. As basic services like mobile money are inherently based on a network effect, value will skyrocket» highlights the report's co-author, Jordan Gilham-Law, consultant at &Innovation, adding that «in 2014, around USD 650 million net revenues were generated by Mobile Financial Services companies in Africa. The total global transaction volume sums up to USD 6.2 bn. Experts believe that revenues will amount to between USD 1.3 and 1.5 bn in SSA by 2019.» \nThe 90-page report is split into three sections: a sector's description (the market, Mobile device penetration, key players : Operators, Banks, Devices and Aggregators ; services pictured on a Lumascape); Industry trends and the evolution of adoption; A directory of Companies and Services in the Mobile Financial Services Ecosystem. It is illustrated with charts, tables, and maps. \nAfrica is a huge and compelling market for potential investors, three times the size of China, home to six out of the world's 10 fastest-growing economies, and to over a billion people, more than half of who have a mobile phone and 40% of who are living in urban areas. A large part of its young population is incredibly adept at figuring out new technologies and eager to use it. \nThe report, priced at GBP 500, can be purchased online and is delivered to clients with a 15 minutes phone brief. It is part of standard market intelligence for banks, telecoms professionals and entrepreneurs getting into this sector. It will be released in August 2015. Custom research looking at deeper research and analysis can also be commissioned. \nTo order the report, send an email to Sylvain Béletre, at Balancing Act \nEssential reading for those interested in new start-ups and innovation that will change Africa. If you would like to subscribe, just send an email to info@balancingact-africa.com with Innovation in Africa in the title line. \nFor breaking news, follow us on Twitter: @BalancingActAfr Africa Development Finance Talks Open With Call for 'Reboot' \nAt a critical moment in what the United Nations has dubbed \"a year for global action,\" the Third International … see more » \nBalancing Act publishes a wide range of video and other resources, which can be found on the original of this article on their website. Copyright © 2015 Balancing Act. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-13T18:12:00.000+03:00", "crawled": "2015-07-13T18:55:28.000+03:00", "highlightTitle": ""}