{"organizations": [], "uuid": "02326d59cdcf00e070e3325682452864015923c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/k/1/e/0/image.related.afrArticleLead.620x365.gii9cr.png/1437723203029.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/100women/advice-on-building-a-career-or-a-business-overseas-20150724-gii9cr", "country": "AU", "title": "Advice on building a career or a business overseas", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Advice on building a career or a business overseas | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T22:15:00.000+03:00", "replies_count": 0, "uuid": "02326d59cdcf00e070e3325682452864015923c4"}, "author": "Claire Stewart", "url": "http://www.afr.com/brand/100women/advice-on-building-a-career-or-a-business-overseas-20150724-gii9cr", "ord_in_thread": 0, "title": "Advice on building a career or a business overseas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Westpac's chief risk officer Alexandra Holcomb says to look for where the growth is. Louise Kennerley. by Claire Stewart Want to make a go of your business or career overseas? Know what your proposition is, do your homework and follow your calling, according to two American women who left the United States to live and work in Australia.\nMolly Harriss Olson went from being an environmental science student on a research trip in Australia, to working on Bill Clinton's presidential campaign, to the White House. After her tenure as chair of Fairtrade International, which facilitates about $US7 billion ($9.4 billion) of direct trade from producers to consumers annually, she took the job as executive director of Fairtrade Australia New Zealand.\nWestpac's Alexandra Holcomb​ started out in credit and credit audit in the US, focused on multinational management and finance in her postgraduate studies, then moved into Third World bank restructure work in South Asia. Now, she's Westpac's chief risk officer, and before that, group general manager of Global Transactional Services.\nBoth women say international growth, on a personal level and at a business level can work whether it is serendipitous and unplanned, or strategic and focused.\n\"You do make a conscious decision about whether you want to work internationally,\" Ms Harriss Olson says. \"I did, as an undergraduate when I decided I wanted to work on the Great Barrier Reef.\"\nMs Harriss Olson says offshore opportunities won't always be the more lucrative option financially. \"I never plotted a career path… I have always just done what mattered to me. Sometimes that meant I wasn't paid [but] sometimes it's the things you're not paid to do that have the most influence.\"\nAs for succeeding in foreign countries, she says you can't beat experience. \"Australians, particularly Australian women, have such a unique perspective on the world… part of the global south but actually not a poor country, and so far away… we have a lot of original ideas because of that.\"\n\"[But] working in Australia, I found that what seems like the same culture and the same language has remarkable subtleties and differences, and it takes time to really understand those and navigate them.\"\n Ms Holcomb's international experience enables her to advise businesses considering offshore expansion.\n\"We are constantly looking at how we can support the companies we work with offshore, either through our own capability or through those of correspondent banks, and also how we actually catch business coming into Australia that plays to our strengths – for example, infrastructure and infrastructure investment.\"\nIf you're looking for opportunities and new regions, watch what some of Australia's big trade partners are doing. \"Think about what China is concerned about. They're shifting reliance on government funding to consumers, flipping their economy; they're shoring up raw materials; agriculture. Think about some of the corridors they're focused on, and that changes your thinking about where the people, capital and trade flows actually are,\" Ms Holcomb says.\nShe says anyone thinking of operating in international environments should know the rules and regulations of the country and do their research. \"Learn from experience. Talk to people in business forums in the sector or region you're going into,\" she says.\n\"It is good business to constantly be reviewing your options and looking at strategic markets and where growth will come from. Always keep an eye out.\"", "external_links": [], "published": "2015-07-24T22:15:00.000+03:00", "crawled": "2015-07-25T05:07:20.512+03:00", "highlightTitle": ""}