{"organizations": [], "uuid": "943907ac6bd865d109ad190b84850876a0df10bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2013/05/21/12833894/JimHitt.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/07/prweb12833894.htm", "country": "US", "title": "Jim Hitt, CEO of American IRA-A National Self-Directed IRA Services Provider, Announces This Week's American Wealth Radio Broadcast With Guest Speaker Vincent Gahren", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Jim Hitt, CEO of American IRA-A National Self-Directed IRA Services Provider, Announces This Week's American Wealth Radio Broadcast With Guest Speaker Vincent Gahren", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "943907ac6bd865d109ad190b84850876a0df10bc"}, "author": "PRWEB", "url": "http://www.prweb.com/releases/2015/07/prweb12833894.htm", "ord_in_thread": 0, "title": "Jim Hitt, CEO of American IRA-A National Self-Directed IRA Services Provider, Announces This Week's American Wealth Radio Broadcast With Guest Speaker Vincent Gahren", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This show will be packed with great information as Vincent Gahren, a financial planner from Trinity Asset Partners, delves deeply into the information everyone wishes they knew about investing. Tune in this Thursday, July 9th at 9:30 a.m. Charlotte, NC\nAmerican IRA, a national Self-Directed IRA services provider, is proud to be the sponsor or American Wealth Radio. This week's show will be packed with great information as Vincent Gahren, a financial planner from Trinity Asset Partners, delves deeply into the information everyone wishes they knew about investing. Tune in this Thursday, July 9th at 9:30 a.m. to hear about the many investment options available.\nSean McKay, co-host of American Wealth Radio, will be asking Vincent Gahren about REITs (Real Estate Investment Trusts) including what they are and whether they are a good investment option. They will speak extensively about this investment strategy including pay out ratios and the many variations available within REITs. Further conversation will delve into whether the investor has control when they invest in REITs.\nJim Hitt will ask about 'alternatives' and how Vincent Gahren defines 'alternative investments' such as exchange rated notes, exchange rated funds, and more.\nAnother interesting topic that will be covered is that you 'make money when you buy an asset not when you sell it'. Sounds incorrect right? Tune in to hear why that is exactly correct.\nAbout American IRA, LLC:\nAmerican IRA is committed to providing every client with gold-level service, regardless of account size. Experience their expertise through their certified IRA services professionals. Enjoy the value with one low annual fee of $285 with unlimited assets and unlimited account values. American IRA clients love the benefit of no charge for \"All Cash\" accounts. The performance of the American IRA staff is unmatched, with quick and efficient processing within 48 hours.\nAmerican IRA services thousands of clients and has over $300 million in assets under administration.\nAmerican IRA was built by investors for investors, and brings their successful investment experience to the table, providing excellent educational material showing the public that their self-directed IRA account can invest in a variety of assets such as real estate, private lending, limited liability companies, precious metals and much more.\nAmerican IRA is conveniently located in Asheville, NC and Charlotte, NC, and serves clients nationwide.\nAmerican IRA is the sponsor of American Wealth Radio. Click here for more information.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5BbWVyaWNhbldlYWx0aFJhZGlvLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy53Z2l2Y2hhcmxvdHRlLmNvbS9hbWVyaWNhbi13ZWFsdGgtcmFkaW8uaHRtbA=="], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T23:46:33.000+03:00", "highlightTitle": ""}