{"organizations": [], "uuid": "174d84ccd24b3931842f9a756741ef24079d596e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DL441_gergic_MG_20150507113933.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/6-best-part-time-jobs-for-retirees-2015-07-01", "country": "US", "title": "6 best part-time jobs for retirees", "performance_score": 0, "site": "marketwatch.com", "participants_count": 4, "title_full": "6 best part-time jobs for retirees - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 3, "uuid": "a2ec392c785563bef2c549809ebc72405698a46e"}, "author": "By     Catey Hill", "url": "http://www.marketwatch.com/story/6-best-part-time-jobs-for-retirees-2015-07-01#post-0", "ord_in_thread": 0, "title": "6 best part-time jobs for retirees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you’re retired and the golf/beach/travel rotation is beginning to get old — and you’d love a little extra dough — you may be considering something your younger, cubicle-bound self never thought you would: going back to work (though only part-time). And now is a better time to do this than it has been in years, as an increasing number of employers plan to hire part-time help this year — and many of these jobs offer good pay and other perks that retirees desire.\nYou’re not alone in your want — or need -- to work in retirement: 72% of adults age 50 and older say they want to keep working after they retire, and nearly half (47%) of current retirees say they either have worked or plan to work during retirement, according to a survey of more than 7,000 adults conducted by Merrill Lynch Bank of America Corp. released last year . And it isn’t just lip service to the notion of working in retirement: While just 32% of people 55 and up were working in 2000, 40% were in 2014, according to data from the Bureau of Labor Statistics.\nWorking in retirement isn’t just about the money (though, let’s be serious, most of us could use a little extra). The most popular reason for working in retirement is to “stay mentally active” for 62% of retirees and 51% of older adults cite it as one of the top reasons they are working in retirement, according to the Merrill Lynch Bank of America survey. Earning extra money is the second most popular answer, with 31% of retirees and 51% of older adults citing it as a top reason.\nOf course, most of us don’t want to re-enter that 9 to 5 grind (after all, retirement is about taking it down a notch — or two), so here’s the good news: the number of employers looking for part-time workers will grow this year. Nearly one in four employers say they expect to hire part-time workers over the next year, up six percentage points from last year, according to CareerBuilder.com’s 2015 U.S. Job Forecast survey of more than 2,100 hiring managers . And because retirees often don’t need health care thanks to Medicare, part-time and project-based jobs, which don’t tend to have health benefits associated with them, have an appeal to this group that they won’t for many other groups.\nNot only do retirees tend not to want to work full-time, they also want good pay that reflects their years of experience, flexibility so they can travel, and/or jobs that allow them to give back. With that in mind, MarketWatch asked leading career experts to tell us what some of the best part-time jobs are for retirees.\nAdjunct professor\nThere are more jobs than ever for non-tenure track, or adjunct, professors. In 1969, just 21.7% of college faculty were adjuncts; now more than two-thirds are -- and you don’t always need a Ph.D. to get these positions. In fact, retirees’ decades of workplace experience can lend itself well to the position of adjunct professor. While the pay for these jobs is mediocre (the median, per-course pay for part-time faculty is just $2,700, according to a study by the Coalition on the Academic Workforce), Lauren Griffin, a senior vice president with Adecco Staffing, notes that many retirees will find this kind of work rewarding. Plus, the hours you’re required to be on campus are typically few, and once you’ve taught a course once or twice, your workload will decrease as you don’t have to spend quite as much time developing the materials. To get this job, look at the career section of the websites of universities in your area; now that online education is becoming much more popular, you may also want to explore that avenue.\nProject-based consultant\nStill gun shy about hiring full-time help, many companies are looking for consultants to help with projects in fields ranging from law to HR to marketing and project management. Thanks to their decades of work experience, retirees are a good fit for this position, says Griffin. Pay is good -- sometimes upward of $50 or even $100 an hour for those with lots of relevant experience -- and once the project is over, you’re completely off duty and free to travel or relax. To find jobs like this, Griffin says that networking (in person and online) -- with old colleagues, alumni associations, industry groups, etc. -- is key, because sometimes these jobs aren’t posted; if you’re near retirement but still working full time, talk to your current employer about making a transition like this one, says Griffin.\nAccountant/bookkeeper\nWhile this may not be the most exciting job on earth, there are lots of freelance and part-time positions in this field (many small businesses simply don’t need someone doing this full time) and the pay is decent, says Niki Badminton, Freelancer.com’s regional director for North America. Roughly one in four bookkeepers, accountants and auditing clerks work part-time, the median pay is nearly $17 an hour (more for those with more experience and experience doing more complicated types of accounting) and the number of jobs in the field through 2022 is projected to grow 11%, according to the Bureau of Labor Statistics. Some of these jobs will be posted online, but it’s important to go to small-business networking and related events, as well as tap your online network, to find jobs like this.\nEvent coordinator/planner\nWhile you may not have had a career as an event planner, by the time you’re 50-plus, you’ve probably planned dozens of events in your life -- family weddings, birthday parties, and more -- with the photos to prove it. You can use this wealth of event-planning knowledge to find work or even start your own event coordinating/planning business. To find a job, you’ll need to tap your network of friends and family (use social media to let people know the services you’re now offering) and may even consider doing an event for a friend pro bono to build up your portfolio. You can also sign up for a site like TaskRabbit.com, which has an entire section on party and event planning. Pay may be low at first, but it does rise with experience, and the median hourly wage isn’t bad, at $22 an hour.\nPatient advocate\nThe patient care and home health care fields are growing rapidly, says Mary Lorenz, the corporate communications manager at CareerBuilder -- and if you know where to look, this job might be a good option for retirees. While home health aide jobs may require too much physical labor for a retiree and nursing jobs require that plus a lot of additional certification, patient advocate positions don’t require either -- and these jobs can be rewarding because you get to help sick people navigate the daunting world of medical care. A patient advocate will make appointments for clients, fill out insurance and other paperwork, negotiate costs for medical care and generally make sure the patient is informed about his care and is getting good care. While there are programs to help you get certified as a patient advocate, they aren’t always required, especially if you work for an individual or family that you know already (if you’re retired, you likely know at least a few families who could use your help). Median pay is $15 an hour, more if you have hospital administration or related experience.\nTutor\nBecoming a tutor is a great option for retirees, says Nicole Williams , founder of career firm WORKS -- thanks to flexible hours, the ability to work near your home and the chance to help young people. You can teach any number of subjects from math to writing to piano (whatever you are good at) and pay can be decent (sometimes it’s as low as around $9/$10 an hour, sometimes upward of $20 an hour, depending on your knowledge base and experience). Retirees hoping to start up this business should see if their children’s friends might have young children in need of some tutoring help, as well as doing some in-person networking at family-focused events.\nMore from MarketWatch", "external_links": ["http://nicolewilliams.com/", "http://agb.org/trusteeship/2013/5/changing-academic-workforce", "https://mlaem.fs.ml.com/content/dam/ML/Articles/pdf/MLWM_Work-in-Retirement_2014.pdf", "http://careerbuildercommunications.com/pdf/careerbuilder-q1-2015-forecast.pdf"], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-01T15:06:39.000+03:00", "highlightTitle": ""}