{"organizations": [], "uuid": "80210f440c6ff2614c856f3ce21614881fc639d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.simplyhired.com", "main_image": "", "site_section": "http://www.simplyhired.com/a/job-feed/rss/o-13205", "section_title": "Finance jobs | Simply Hired", "url": "http://www.simplyhired.com/job/mh4dh7gdt5", "country": "US", "title": "R&D Fixed Income Matching - Developer Consultant at Genesis10 (New York, NY)", "performance_score": 0, "site": "simplyhired.com", "participants_count": 0, "title_full": "R&D Fixed Income Matching - Developer Consultant at Genesis10 (New York, NY)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T02:47:00.000+03:00", "replies_count": 0, "uuid": "80210f440c6ff2614c856f3ce21614881fc639d4"}, "author": "", "url": "http://www.simplyhired.com/job/mh4dh7gdt5", "ord_in_thread": 0, "title": "R&D Fixed Income Matching - Developer Consultant at Genesis10 (New York, NY)", "locations": ["North America", "New York City", "New York", "NY"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Source: Dice Genesis10 is seeking an RD Fixed Income Matching - Developer. This is for a consulting position in New York, NY. Description Our client is seeking a driven and dedicated consultant developer to join their entrepreneurial team as it builds a high performance fixed income matching engine in the sales and trading space. The ideal candidate has excellent object oriented programming skills and a proven ability to design and build front-end and back-end software components that can scale as the product grows. Their developers contribute to the team by putting forth their own ideas regarding product features, UI screens and design decisions. We are looking for both a self-starter and a good communicator who will work with the product managers and sales teams to understand our clients39 workflow. Requirements 2+ years of software development experience (Java or C++ or C or equivalent object oriented experience) Demonstrated experience in building intuitive user interfaces that enhance and optimize client workflow Demonstrated experience in hands-on project management Demonstrated knowledge of data structures and algorithms Knowledge of the institutional capital markets domain is a plus If you have the described qualifications and are interested in this exciting opportunity, please apply! About SWATT The Genesis10 Software and Technology Team (SWATT) is a specialized recruiting service focused on helping accomplished software developers, programmers, platform engineers and elite technology professionals find once-in-a-lifetime career opportunities in New York City with the world39s most advanced technology organizations. Whether local to New York or relocating from across North America, we take an authentic approach to helping people make life-changing technology career decisions. For more information go to httpswatt.genesis10.com \"Genesis10 is an Equal Opportunity Employer, MFDV\" Start Date 08032015 Algorithms, C++, C#, Consultant, Developer, Development, Java, Management, Project, Project Management, Software", "external_links": [], "published": "2015-07-31T02:47:00.000+03:00", "crawled": "2015-07-31T07:22:33.971+03:00", "highlightTitle": ""}