{"organizations": [], "uuid": "4dbfb0900234e927833d0a2b1ad0151e4a365fbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/247517-yellen-fed-still-on-track-for-rate-hike-later-in-2015", "country": "US", "title": "Yellen: Fed still on track for rate hike later in 2015", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Yellen: Fed still on track for rate hike later in 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T20:11:00.000+03:00", "replies_count": 0, "uuid": "4dbfb0900234e927833d0a2b1ad0151e4a365fbb"}, "author": "pschroeder@thehill.com (Peter Schroeder)", "url": "http://thehill.com/policy/finance/247517-yellen-fed-still-on-track-for-rate-hike-later-in-2015", "ord_in_thread": 0, "title": "Yellen: Fed still on track for rate hike later in 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yellen: Fed still on track for rate hike later in 2015 By Peter Schroeder - 07/10/15 01:11 PM EDT \nFederal Reserve Chairwoman Janet Yellen gave no indication Friday that economic drama abroad would slow down the central bank’s next interest rate hike. \nYellen said she that she still thinks it will be right for the Fed to raise rates sometime later this year, for the first time in nearly a decade. She couched her prediction with the usual caveats about economic uncertainty, but it appears as if the drama surrounding Greece and Europe was not weighing significantly on the Fed’s outlook. ADVERTISEMENT “Based on my outlook, I expect that it will be appropriate at some point later this year to take the first step to raise the federal funds rate and thus begin normalizing monetary policy,” she said in remarks delivered in Cleveland. “But I want to emphasize that the course of the economy and inflation remains highly uncertain, and unanticipated developments could delay or accelerate this first step.”\nYellen largely dismissed the economic debate gripping Europe and captivating financial markets, referring to it only briefly in her remarks. \n“Although the economic recovery in the euro area appears to have gained a firmer footing, the situation in Greece remains unresolved,” she said. \nIn her outline of the U.S. economy, Yellen sounded a similar tone to what she has in the past. She was cautiously optimistic about the trajectory of the U.S. economy, largely dismissing the nonexistent growth in the first quarter as temporary, while highlighting the factors that suggest stronger growth is on the way. In fact, Yellen suggested some at the Fed were skeptical of that data, noting that there is some question about whether the way economic data is measured skews first-quarter economic numbers. \n“This is not the first time in recent years that real GDP has been reported to decline, or grow unusually slowly, in the first quarter of the year. There is a healthy debate among economists — many within the Federal Reserve System — about some of the technical factors that may lie behind this pattern,” she said. \nWhile the jobless rate has steadily dropped, Yellen said she still believes there is a large untapped amount of potential workers in the U.S., as many Americans have either dropped out of the job hunt or are working part-time when they would prefer full-time employment. From her perspective, that means the economy has room to grow on the employment front, and justifies the Fed’s lengthy efforts to keep interest rates as low as possible. \nBut with the central bank preparing to raise rates for the first time in nearly a decade later this year, Yellen described the U.S. economy as one prepared to hit a new level of growth sometime in the near future. \n“I think that many of the fundamental factors underlying U.S. economic activity are solid and should lead to some pickup in the pace of economic growth in the coming years,” she said. Tags:", "external_links": [], "published": "2015-07-10T20:11:00.000+03:00", "crawled": "2015-07-11T14:12:13.000+03:00", "highlightTitle": ""}