{"organizations": [], "uuid": "995e048249dc16bd9cd4f796674f911106d9b28d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/3/p/1/l/image.related.articleLeadwide.620x349.gi3otz.png/1435966053965.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/property/cosmetics-wars-heat-up-20150702-gi3otz.html", "country": "AU", "title": "Cosmetics war: Lipsticks at ten paces", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Cosmetics war: Lipsticks at ten paces", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "995e048249dc16bd9cd4f796674f911106d9b28d"}, "author": "", "url": "http://www.smh.com.au/business/property/cosmetics-wars-heat-up-20150702-gi3otz.html", "ord_in_thread": 0, "title": "Cosmetics war: Lipsticks at ten paces", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Makeup at Mecca Cosmetica. Photo: Helen Nezdropa\nIt's lipsticks opened and ready at 10 paces as the cosmetics world takes on the traditional department stores.\nJust like the fashion industry, having a stand-alone site is proving powerful for consumers, the brands and landlords.\nIn an age where pampering is one of the biggest revenue-generating tenants, more space is being allocated in shopping centres and suburban strips.\nCrowds at the opening of Sephora in Pitt Street Mall in December, 2014. Photo: Dallas Kilponen\nIn Sydney and Melbourne, leading brands are fighting for stores, which has led to healthy rental competition for landlords.\nAdvertisement It is also eating into the heartland of the department stores where cosmetics account for more than 20 per cent of the total sales at Myer and David Jones nationally, making up 25 per cent of their gross profit.\nThey are high margin products and ones that the chains are keen to keep under their domain.\nThe biggest splash has been made by the overseas giant, Sephora, which has opened in Pitt Street Mall, Sydney, and is scouring Melbourne for a flagship location.\nMecca, the Australian-owned business, led the way, and it too is expanding. . It was founded by Jo Horgan in 1997 with the first Mecca Cosmetica store in Toorak Road, Melbourne. Mecca Brands has 62 stores across Australia and New Zealand.\nHorgan said 2014 was a big year of expansion for Mecca Brands. \"We opened 14 new doors around the country,\" she said. \"This year we have plans to open around 10 new stores with an end goal of 90 stores in total.\n\"We believe there's still a lot of opportunity for Mecca Cosmetica in high streets around the country. Our other key focus is the opportunity for further growth with our Mecca Maxima retail concept predominantly in shopping centres over the next two years.\"\nThere is also the L'Oreal-owned Kiehls, which has a strong presence in Australia, as do the Estee Lauder-run Jo Malone and Mac brands – all of which are looking to expand.\nThe CBRE head of retail brokerage leasing Australia, Leif Olson, said the competition was strong among the cosmetic retailers, all of whom want a bigger exposure to Australia.\n\"The pedestrianisation of George Street, Sydney, will provide a bonanza for these stand-alone stores, and we have been fielding many inquiries,\" he said.\nKnight Frank's leasing agents secured Cosmo Cosmetic at 460 George St next to Topshop in 2010 and in early 2015 secured MD Ranking at 630 George Street, which sells \"budget\" cosmetics and beauty products.\nKnight Frank's Alex Alamsyah, senior director, leasing also secured skin care beauty products Forever Flawless at 413 George St in 2014 and said there would be more and more similar concepts entering, such as Oro Gold at 323 George Street and Origani, which is also coming.\nCBRE head of Melbourne retail leasing Zelman Ainsworth said the Melbourne CBD retail market continued to draw international attention from some of the world's biggest retailers looking to enter a new and safe retail market.\n\"Melbourne is now home to a number of global retailers' best trading stores, these encouraging retail success stories is what is driving the vacancy rate in the Melbourne CBD down and rental levels up,\" he said.\nCBRE Melbourne retail leasing team member Stephanie Smith said there is definitely an increased demand from cosmetic brands wanting to occupy stand-alone retail shops in the CBD, with the brand awareness and record turnover levels in the CBD as the main drivers.\n\"Gone are the days that cosmetic brands are restricted to department stores and online,\" Smith said.\n\"Consumers cannot get enough and are happy to pay a premium to buy locally, drawing international cosmetic retailers into the Australian market.\n\"Sephora is the brand the consumers want in Melbourne. In April 2015 the international cosmetic brand announced their plans to roll out up to 20 stores in Australia, consisting of two flagship stores in both Sydney and Melbourne.\"\nCBRE's Samantha Hunt said there was a market beyond department stores in the $3-billion beauty industry and Flagship and department stores could successfully coexist in international markets.", "external_links": [], "published": "2015-07-03T03:00:00.000+03:00", "crawled": "2015-07-04T16:15:29.000+03:00", "highlightTitle": ""}