{"organizations": [], "uuid": "311e51229bb475570369a130e918f61000138213", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/PropertyManagement", "section_title": "Yahoo! Finance: Property Management Industry News", "url": "http://finance.yahoo.com/news/resaas-joins-forces-max-network-100000833.html", "country": "GB", "title": "RESAAS Joins Forces with RE/MAX Network as Social Learning Platform Vendor", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "RESAAS Joins Forces with RE/MAX Network as Social Learning Platform Vendor", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T13:00:00.000+03:00", "replies_count": 0, "uuid": "311e51229bb475570369a130e918f61000138213"}, "author": "", "url": "http://finance.yahoo.com/news/resaas-joins-forces-max-network-100000833.html", "ord_in_thread": 0, "title": "RESAAS Joins Forces with RE/MAX Network as Social Learning Platform Vendor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RESAAS Joins Forces with RE/MAX Network as Social Learning Platform Vendor RESAAS Services Inc. 3 hours ago  Content preferences Done \nVANCOUVER, BC --(Marketwired - July 14, 2015) - RESAAS Services Inc. (CSE:RSS) ( RSASF ) , a cloud-based social business platform for the real estate services industry, is pleased to announce that it has signed an agreement with RE/MAX, LLC, the franchisor of the global RE/MAX network, to be its preferred Social Learning Platform vendor for the Global Development department. \nBuilding on the existing relationship that RESAAS and RE/MAX previously announced in early 2014, where RESAAS provides a private referral network to the entire roster of RE/MAX agents, RESAAS will now deliver a file storage and sharing solution exclusively for RE/MAX agents across the globe. This new platform is the only multilingual-capable file share solution available for global real estate franchises. \nUnder the terms of the agreement, this platform will allow for various file types (PDFs, Word documents, videos, PowerPoint presentations, webinars, etc.) to be uploaded and available for download by RE/MAX agents only. Each piece of content can be organized by category names and labeled by tags that will be user-generated and defined by the original content publisher. The multilingual component is unique in its entirety, allowing RE/MAX agents to provide additional, translated versions of original content. To-date, RESAAS has translated its platform into 17 different languages in an effort to service the RE/MAX network's global reach of nearly 100 countries. Although the referral network is available to all agents within the RE/MAX network, the Social Learning Platform will only be available for RE/MAX agents located outside of the US and Canada. \n\"RESAAS has been an incredible resource for RE/MAX, particularly in efforts to connect our far-reaching global network through technology,\" said Larry Oberly, Vice President, Global Development of RE/MAX, LLC. \"We're thrilled to be able to offer users additional capabilities, like multilingual file-sharing, training and proprietary content through the new Social Learning Platform.\" \nBuilding on the functionality of the existing RESAAS Platform, private groups for Regional Managers and Broker Owners allow for private communication, file storage and sharing amongst these groups of individuals inside the Platform, making communication of franchise direction and strategy much simpler. \n\"We've seen RE/MAX take great strides forward in their technology offering to agents since beginning our relationship around this time last year,\" said Tom Rossiter, President at RESAAS. \"We all know agents are bombarded with offerings from different vendors, so to be able to consolidate RESAAS' multilingual file-sharing component into the solution many RE/MAX agents receive will simplify their workflow.\" \nThe agreement for the Social Learning Platform between RE/MAX and RESAAS is in place for 2015 and 2016, showing the commitment from both companies to provide RE/MAX agents with a beneficial and consistent experience. It also showcases the long-term strategy, providing agents with a fewer number of different vendors to have to visit to perform their everyday real estate tasks. \nAbout RESAAS Services Inc. RESAAS, a cloud-based social business platform for the real estate services industry, is designed specifically for the real estate professional to connect and communicate in real-time. Known as real estate broadcasts, RESAAS' powerful reblasts® engine automatically generates all of your real estate workflow into invaluable social content that is instantly pushed out to the RESAAS platform and other social networks. Visit www.resaas.com . \nAbout the RE/MAX Network RE/MAX was founded in 1973 by Dave and Gail Liniger, with an innovative, entrepreneurial culture affording its agents and franchisees the flexibility to operate their businesses with great independence. Over 100,000 agents provide RE/MAX a global reach of nearly 100 countries. Nobody sells more real estate than RE/MAX. \nRE/MAX, LLC, one of the world's leading franchisors of real estate brokerage services, is a wholly-owned subsidiary of RMCO, LLC, which is controlled and managed by RE/MAX Holdings, Inc. ( RMAX ) . \nWith a passion for the communities in which its agents live and work, RE/MAX is proud to have raised more than $150 million for Children's Miracle Network Hospitals ® and other charities. \nFor more information about RE/MAX, to search home listings or find an agent in your community, please visit www.remax.com . For the latest news about RE/MAX, please visit www.remax.com/newsroom . \nThe CSE has not reviewed, nor approved or disapproved the content of this press release. \nForward-Looking Information: \nThis press release and the company's website referenced herein may include forward-looking information within the meaning of Canadian securities legislation, concerning the company's technology platform. Forward-looking information is based on certain key expectations and assumptions made by RESAAS' management, including future plans for the design and development of the company's technology platform. Although RESAAS believes that the expectations and assumptions on which such forward-looking information is based are reasonable, undue reliance should not be placed on the forward-looking information because RESAAS can give no assurance that they will prove to be correct. Forward-looking statements contained in this press release are made as of the date of this press release. RESAAS disclaims any intent or obligation to update publicly any forward-looking information, whether as a result of new information, future events or results or otherwise, other than as required by applicable securities laws. Contact:", "external_links": [], "published": "2015-07-14T13:00:00.000+03:00", "crawled": "2015-07-14T16:21:55.000+03:00", "highlightTitle": ""}