{"organizations": [], "uuid": "d3fa4fbd0dd40668ead826e21a8bf26dbd26ad13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/u/q/k/k/image.related.afrArticleLead.620x365.1muqhv.png/1437019440286.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/top-tier-second-tier-labels-redundant-in-ma-says-danny-gilbert-20150716-1muqhv", "country": "AU", "title": "Top tier, second tier labels redundant in M&A, says Danny Gilbert", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Top tier, second tier labels redundant in M&A, says Danny Gilbert | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T11:18:00.000+03:00", "replies_count": 0, "uuid": "d3fa4fbd0dd40668ead826e21a8bf26dbd26ad13"}, "author": "Misa Han", "url": "http://www.afr.com/news/top-tier-second-tier-labels-redundant-in-ma-says-danny-gilbert-20150716-1muqhv", "ord_in_thread": 0, "title": "Top tier, second tier labels redundant in M&A, says Danny Gilbert", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Managing Partner Danny Gilbert from Gilbert + Tobin says the classification of law firms into 'first-tier' and 'second-tier' is now redundant. Peter Braig Share on twitter by Misa Han The nation's top tier law firms are ceding territory in the multi-billion dollar mergers and acquisition space as mid-tier firms take on big ticket deals, making their mark in the league tables.\nIt's part of a trend that lends support to claims that traditional labels such as \"top tier\" and \"second tier\" are redundant, including from Gilbert + Tobin managing partner Danny Gilbert who argues a firm does not have to be full-service to sit in the so-called top tier.\n\"The labels 'top-tier' and 'second-tier' are unsophisticated; we're a top tier law firm in the areas we focus on, in high-end transactional business,\" Mr Gilbert said .\n\"If you go back 10 or 15 years, the [Gilbert + Tobin] brand was still built around communications, media and technology. That is no longer the case. The centrepiece of the firm now is corporate practice; by that I mean M&A, private equity, capital markets and banking and finance.\"\nA number of law firms who traditionally fell outside the top tier bracket have recently gained ground. In the 2014 Mergermarket M&A league table, Gilbert + Tobin came seventh in Australasia by deal value at $US12.9 billion, ahead of some of traditional top tier law firms including Ashurst ($US11.7 billion) and Clayton Utz ($US3.8 billion).\nIn the 2015 first quarter Gilbert + Tobin fell behind in ranking at $US85 million, but other mid-tier firms caught up. K&L Gates came tenth for handling $US1.2 billion, while Arnold Bloch Leibler took eleventh place at $US1.1 billion after handling Slater & Gordon's acquisition of Quindell's professional services division .\nArnold Bloch Leibler's head of corporate practice Jonathan Wenig said the firm's independence has helped to grow its M&A practice.\n\"A theme in the marketplace that has helped both of us [Gilbert + Tobin and Arnold Bloch Leibler] is our independence,\" he said.\n \"In the last 18 months we have seen large-scale Australian deals. Those who have done really well in the Australian market – we've held their hands and ventured offshore with them.\"\nTraditional top tier law firms remain defensive about their labels.\nKing & Wood Mallesons managing partner in M&A and tax, Mike Barker, said large clients still sought top tier law firms with full service. The law firm topped the league table last year with total earnings of $US34.3 billion, but in the first quarter it has dropped to ninth with $US2.6 billion.\n\"It doesn't mean second tier firms are not good-quality lawyers. But larger clients see the value of a one-stop shop for ease of communication and ease of relationship.\n\"Australia's also a small market, and if you get two or three firms acting for you, there can be clear conflicts.\"\nTargeting the Chinese outbound deals also required companies to have a well-established property practice, he said. \"The property practice is fundamental for China outbound at the moment.\"\nClayton Utz head of corporate practice Rory Moriarty said M&A clients wanted a depth of advice that includes expertise in specialist areas such as environment law and employment law. In 2014 Clayton Utz did not make the M&A league table, but it re-entered in the first quarter of this year at fifth place, after advising Japan Post in the $6.5 billion takeover offer of Toll alongside Japanese law firm Nishimura & Asahi.\n\"It's very instructive that traditional names are on the league table and that's a very strong indicator that for those very large deals, clients are still turning to Australia's top tiers,\" Mr Moriarty said.\nMergermarket analyst Davide​ Schiappapietra​ said law firms' success in the M&A market often depended on their ability to snatch large deals. All the top four firms on the Q1 league table worked on the $11 billion Novion and Federation merger deal.\n\"More often than not it reflects who has the ability to jump on board on those macro-deals,\" he said.", "external_links": ["https://twitter.com/misahan"], "published": "2015-07-16T11:18:00.000+03:00", "crawled": "2015-07-16T10:10:23.000+03:00", "highlightTitle": ""}