{"organizations": [], "uuid": "cc55960d555ef332c2845bcaab0ecc616423fdcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/06/23/102782207-450238822.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss/rss.html", "section_title": "Finance", "url": "http://www.cnbc.com/2015/07/31/high-end-cycling-chain-soulcycle-files-to-go-public.html", "country": "US", "title": "High-end cycling chain Soulcycle files to go public", "performance_score": 0, "site": "cnbc.com", "participants_count": 3, "title_full": "High-end cycling chain Soulcycle files to go public", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T03:00:00.000+03:00", "replies_count": 2, "uuid": "542391ee31b10906271322950d43fd16ed582cf6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2015/07/31/high-end-cycling-chain-soulcycle-files-to-go-public.html#post-0", "ord_in_thread": 0, "title": "High-end cycling chain Soulcycle files to go public", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images An event at SoulCycle in Malibu, California SoulCycle, the high-end indoor cycling chain, is gearing up for Wall Street.\nThe New York company filed for an initial public offering Thursday, hoping to raise as much as $100 million. SoulCycle didn't say how many shares it plans to offer, or at what price, so that number may change.\nIt announced that it named chief operating officer Melanie Whelan as CEO last month, replacing co-founders Elizabeth Cutler and Julie Rice. SoulCycle said Cutler and Rice will remain involved with the company, which they launched in 2006 with one New York studio.\nRead More Retail investors should invest in IPOs: Expert\nSoulCycle charges about $35 for each hour-long class. Classes take place in small candlelit rooms with loud music playing. The company also sells $54 T-shirts, $78 sweat pants and $58 tote bags with the SoulCycle logo stamped on them.\nThe company is credited with fueling the fast-growing boutique fitness industry. Small gyms have been opening in cities around the country, offering yoga, cycling and other fitness classes. Boutique fitness studios are the fastest growing part of the gym industry, according to the International Health, Racquet and Sportsclub Association, and they made up 21 percent of the fitness industry in 2013.\nThere are currently 38 SoulCycle studios around the country, and the company plans to expand to as many as 250. Each studio generates about $4 million a year in revenue, the company said.\nRead More Square confidentially files for IPO: Report\nSoulCycle said it earned $25.3 million last year, up 42 percent from 2013. It had revenue of $112 million in 2014, up 49 percent from the previous year.", "external_links": [], "published": "2015-07-31T03:00:00.000+03:00", "crawled": "2015-07-31T17:20:05.418+03:00", "highlightTitle": ""}