{"organizations": [], "uuid": "cf884b68410a5550301af7c740463d619db723aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/48247915.cms", "site_section": "http://timesofindia.indiatimes.com/news/economy/finance/articlelist/1286551815.cms", "section_title": "News on Government Finance, Public Financing, Indian Finance | Economy News - Economic Times", "url": "http://timesofindia.indiatimes.com/tech/tech-news/Almost-1-billion-Android-phones-at-risk-can-be-hacked-by-text/articleshow/48247629.cms", "country": "IL", "title": "Almost 1 billion Android phones at risk, can be hacked by text", "performance_score": 1, "site": "indiatimes.com", "participants_count": 6, "title_full": "Almost 1 billion Android phones at risk, can be hacked by text - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T19:04:00.000+03:00", "replies_count": 5, "uuid": "9621001a755ec8467f110484ce7deb1433a5af64"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/tech/tech-news/Almost-1-billion-Android-phones-at-risk-can-be-hacked-by-text/articleshow/48247629.cms#post-0", "ord_in_thread": 0, "title": "Almost 1 billion Android phones at risk, can be hacked by text", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO: Cyber security firm Zimperium has warned of a flaw in the world's most popular smartphone operating system that lets hackers take control with a text message.\n\"Attackers only need your mobile number, using which they can remotely execute code via a specially crafted media file delivered via MMS (text message),\" Zimperium Mobile Security said in a blog post.\n\"A fully weaponized successful attack could even delete the message before you see it. You will only see the notification.\"\nAndroid code dubbed \"Stagefright\" was at the heart of the problem, according to Zimperium.\nStagefright automatically pre-loads video snippets attached to text messages to spare recipients from the annoyance of waiting to view clips.\nHackers can hide malicious code in video files and it will be unleashed even if the smartphone user never opens it or reads the message, according to research by Zimperium's Joshua Drake.\n\"The targets for this kind of attack can be anyone,\" the cybersecurity firm said, referring to Stagefright as the worst Android flaw discovered to date.\n\"These vulnerabilities are extremely dangerous because they do not require that the victim take any action to be exploited.\"\nMalicious code executed by hackers could take control of smartphones and plunder contents without owners knowing.\nStagefright imperils some 95 percent, or an estimated 950 million, of Android phones, according to the security firm.\nZimperium said that it reported the problem to Google and provided the California Internet firm with patches to prevent breaches.\n\"Google acted promptly and applied the patches to internal code branches within 48 hours, but unfortunately that's only the beginning of what will be a very lengthy process of update deployment,\" Zimperium said.\nIt did not appear as though hackers had taken advantage of the Stagefright vulnerability, according to Zimperium.\nUpdating Android software powering mobile devices is controlled by hardware makers and sometimes telecommunication service carriers, not Google.\nWhile Apple controls the hardware and software in iPhones, iPads, and iPods powered by its mobile operating system, Google makes Android available free to device makers who customize the code and update it as they see fit.\nMore about Drake's research was to be disclosed at a Black Hat computer security conference taking place in Las Vegas early in August.\nFollow TOI Tech on Twitter >>> @ toi_tech\nLike TOI Tech on Facebook >>> TOI_tech http://timesofindia.indiatimes.com/followceleb.cms?alias=android,zimperium,joshua drake,Apple Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://www.facebook.com/TOItech", "https://twitter.com/toi_tech", "https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-07-28T19:04:00.000+03:00", "crawled": "2015-07-28T19:42:53.209+03:00", "highlightTitle": ""}