{"organizations": [], "uuid": "30348df527e87449f1f75c45604bdb2798bc5511", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-01/asian-stocks-advance-after-steepest-monthly-drop-since-september", "country": "US", "title": "Asian Stocks Advance After Steepest Monthly Drop Since September", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Asian Stocks Advance After Steepest Monthly Drop Since September - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T08:05:00.000+03:00", "replies_count": 0, "uuid": "30348df527e87449f1f75c45604bdb2798bc5511"}, "author": "Sarah McDonald", "url": "http://www.bloomberg.com/news/articles/2015-07-01/asian-stocks-advance-after-steepest-monthly-drop-since-september", "ord_in_thread": 0, "title": "Asian Stocks Advance After Steepest Monthly Drop Since September", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Asian stocks rose, after the regional benchmark gauge posted its biggest monthly drop since September, as energy and materials shares led gains.\nThe MSCI Asia Pacific Index climbed 0.1 percent to 146.38 as of 9:01 a.m. in Tokyo. The measure slid 3.4 percent in June, leaving it little changed for the quarter, as Chinese equities in Hong Kong slumped. The city’s stock market is closed Wednesday for a holiday.\nAn official report on China’s manufacturing industry for June will show the quickest expansion since October, while a private factory gauge will signal a fourth month of contraction, according to economists surveyed by Bloomberg before data Wednesday. Greece missed a deadline for repaying $1.7 billion to the IMF after bailout talks with its creditors imploded, with investors now awaiting a July 5 vote by its people on whether they support austerity measures.\n“The extreme wariness toward Greece does seem to be fading,” said Hiroichi Nishi, a manager at SMBC Nikko Securities Inc. in Tokyo. “But until the referendum, it’s like annoyingly having a tiny fish bone stuck in the back of your throat.”\nJapan’s Topix index added 0.3 percent after posting a fifth straight quarterly gain. A survey of sentiment among the nation’s large manufacturers beat estimates. Australia’s S&P/ASX 200 Index lost 0.1 percent after capping a 7.3 percent slide from March through June, its steepest such drop since 2011. The Kospi index gained 0.1 percent in Seoul, while New Zealand’s NZX 50 Index rose 0.5 percent.\nChicago futures trading on the Standard & Poor’s 500 Index is delayed until 8:45 p.m. New York time to account for the leap second. The underlying measure rallied 0.3 percent in New York on Tuesday, following its steepest one-day slump since April 2014. The gauge slid 0.2 percent in the quarter.", "external_links": [], "published": "2015-07-01T08:05:00.000+03:00", "crawled": "2015-07-01T03:27:06.000+03:00", "highlightTitle": ""}