{"organizations": [], "uuid": "48feadebe5ae6b41d92c193e54404efec6aea8ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/h/2/m/m/q/image.related.articleLeadwide.620x349.gin12i.png/1438158650848.jpg", "site_section": "http://www.canberratimes.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/comment-and-analysis/big-department-stores-forced-to-axe-the-runts-of-the-brand-litter-20150729-gin12i.html", "country": "AU", "title": "Big department stores forced to axe the runts of the brand litter", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Big department stores forced to axe the runts of the brand litter", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T16:30:00.000+03:00", "replies_count": 0, "uuid": "48feadebe5ae6b41d92c193e54404efec6aea8ab"}, "author": "", "url": "http://www.canberratimes.com.au/business/comment-and-analysis/big-department-stores-forced-to-axe-the-runts-of-the-brand-litter-20150729-gin12i.html", "ord_in_thread": 0, "title": "Big department stores forced to axe the runts of the brand litter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "These stores have been cramming in too many small brands in a quest to convince the shopping public that they are a one-stop shop. Photo: Eddie Jim EJZ\nMoves by Myer and David Jones to spring clean their stable of brands is a breath of fresh air – and one that is long overdue if the full service department store format is to undergo any sort of renaissance.\nMyer revealed this week that 100 mainly fashion labels will be axed – the vast majority of which will not be replaced by new ones.\nTime has run out for department stores to offer the often-cited excuses for lacklustre performance – such as the poor retail environment or online competition.\nMyer revealed this week that 100 mainly fashion labels will be axed. Photo: Luis Ascui\nThe retail landscape is not fabulous but nor is it depressed.\nThe department stores have shown their capacity to invest in technology to improve their online offerings.\nThere are clear signs that David Jones sales are picking up and Myer's new management team now needs to pull something out of a hat when it unveils its new strategy in a couple of months.\nThere are plenty of customers that will walk out into the mall and buy from the specialty shop that houses the full range. Photo: Sasha Woolley\nFor too long these stores have been cramming in too many small brands in a quest to convince the shopping public that they are a one-stop shop for fashion.\nThere are plenty of things wrong with this strategy.\nFirst, it is doesn't result in any particular competitive sales advantage to have small racks or shelves with relatively unknown brands.\nThis won't drive foot traffic into the store. David Jones and Myer are relatively large companies with lots invested in their properties and need foot traffic though the stores.\nIndeed, the space that is often taken to accommodate smaller brands that have little volume take the in-store real estate from the bigger brands that do attract shoppers.\nThe biggest competitive threat to department stores over the past few decades has been the rise of the specialty retailers.\nDepartment stores have kept a taste of product from the likes of Seed and Witchery but there's nowhere near a full selection of inventory. There are plenty of customers that will walk out into the mall and buy from the specialty shop that houses the full range.\nTo the extent that Australia can support one 'house of brands' (unfortunately for Myer) this will be David Jones.\nWhen David Jones is being managed well – and under the new ownership this appears to be happening now – it is better positioned to work the upmarket brand story better.\nHaving said that David Jones looks to be culling some 180 smaller brands and giving more space to labels that sell bigger volumes and have wider appeal – a couple of which it owns, Country Road, Trenery and Mimco.\nThe need to overhaul brands is even more compelling for Myer – it has more stores across more geographies and needs to appeal to a wider base of customers.\nThere is no advantage to cramming in small, less popular bands on the shelves when the likes of H&M, Zara or Uniqlo are next door with a better offering.\nMyer chief executive Richard Umbers recognises he needs to get the right brands into the stores but confesses it can be a challenge.\nIn June, Myer announced it had secured a few new additions to its brand bank including widely recognised new brands Seed (womenswear and childrenswear), Nine West (footwear and accessories) and French Connection (womenswear and menswear).\nMyer says it plans to give the appropriate space and range to the brands to ensure a credible offering for those that bring its best customers into stores and admits that brand churn had not been managed well enough in the past.\nIn other countries such as Britain and to a lesser extent the US there are examples of the uber franchises like Zara and Topshop being housed inside large department stores likes Selfridges and Nordstrom\nSuch a move would revolutionise full service department store retailing in Australia – but there is no suggestion this is a rabbit that Umbers would pull out of Myer's hat.\nInstead, the latest batch of labels coming to a Myer near you will include Aje, Jack and Jones, Calvin Klein White Label, Daniel Avakian and Oscar de la Renta. They are not big selling labels.\nThe role that these department stores have played as incubators for emerging brands has been an important one. They can still fulfil that function as long as they remain strict about much grace newcomers get before they need to pay their way.\nHowever, there needs to a ruthless focus on returns and productivity alongside publicity and prestige.", "external_links": [], "published": "2015-07-29T16:30:00.000+03:00", "crawled": "2015-07-29T14:40:40.458+03:00", "highlightTitle": ""}