{"organizations": [], "uuid": "54e494e23ff69a6ec4b7294a1a939ae22dd99522", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/7/c/8/x/image.related.afrArticleLead.620x365.gi8agy.png/1436419796542.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/commodities/15-billion-wiped-of-mining-stocks-in-past-month-as-iron-ore-price-collapses-20150709-gi8agy", "country": "AU", "title": "Miners recover from iron ore price collapse", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Miners recover from iron ore price collapse | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T11:18:00.000+03:00", "replies_count": 0, "uuid": "54e494e23ff69a6ec4b7294a1a939ae22dd99522"}, "author": "Stephen Cauchi", "url": "http://www.afr.com/markets/commodities/15-billion-wiped-of-mining-stocks-in-past-month-as-iron-ore-price-collapses-20150709-gi8agy", "ord_in_thread": 0, "title": "Miners recover from iron ore price collapse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With Rio, 85 per cent of its earnings are iron ore related. Reuters Share on twitter by Stephen Cauchi Iron ore miners have shaken off Wednesday's collapse in the bulk commodity's price, but have still lost billions in value over the past month.\nThe bulk commodity lost 10 per cent to $US44.60 a tonne in one single session on Wednesday, its biggest one-day decline since spot markets were established more than six years ago.\nBut mining stocks have had a relatively benign session so far on Thursday, with the market having effectively priced in a sub-$US50 iron ore price, analysts said.\nMost miners opened lower, but there was no sign of a bloodbath and by midday, the sector was actually leading a rebound in the overall market, with most mining stocks posting gains.\nBHP Billiton was up 0.8 per cent at $25.64, Rio Tinto had gained 0.4 per cent to $50.27 and pureplay iron ore miner Fortescue was up 3 per cent at $1.725, after earlier in the session plumbing a new six-year low of $1.61.\nMorgans senior dealer Luke McElwaine said miners did not plunge as dramatically on Thursday as some might have expected because a sub-$US45 price had been largely priced in.\n\"You have to give the market some credit that it foressess a few of these things,\" he said.\n\"The falls in the market that it's had in the last week or two have been predicting where iron ore prices are going.\n \"BHP is probably the quality in the stable, it's more diversified, but it's hit them all.\nWith Rio, 85 per cent of its earnings are iron ore related. Yes, it's the lowest cost producer but it's really going to feel it from an earnings perspective.\"\nOffering some support, iron ore futures in China shot nearly 6 per cent higher in early trade, signalling the selloff in spot prices may take a break tonight.\nHowever, for the month Rio Tinto was still down about 12 per cent for the month, BHP 9 per cent and Fortescue nearly 30 per cent.\nThe materials index of the ASX200 was worth $168 billion a month ago but was on Thursday morning down to $153 billion.\nAmong the most bearish analysts, Goldman Sachs earlier this year reduced its 12-month price target for Fortescue to just 50 cents, flagging a further slump in the iron ore price.\nRio Tinto's price target was $47 and BHP's $27.\nIron ore was trading around $US65 a month ago but touched fresh six-year lows of $US44.60 after the overnight plummet in the price, its tenth straight day of losses.", "external_links": ["https://twitter.com/@cauchis"], "published": "2015-07-09T11:18:00.000+03:00", "crawled": "2015-07-09T10:05:47.000+03:00", "highlightTitle": ""}