{"organizations": [], "uuid": "76c2da504161178971e106dc41ec7a18323b51a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business/Finance", "url": "http://www.menafn.com/1094291538/Central-Floridas-Got-Talent-is-Back-in-Orlando-Auditions-2015-are-Over?src=RSS", "country": "US", "title": "Central Floridas Got Talent is Back in Orlando! Auditions 2015 are Over!", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Central Floridas Got Talent is Back in Orlando! Auditions 2015 are Over! | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "76c2da504161178971e106dc41ec7a18323b51a9"}, "author": "Press", "url": "http://www.menafn.com/1094291538/Central-Floridas-Got-Talent-is-Back-in-Orlando-Auditions-2015-are-Over?src=RSS", "ord_in_thread": 0, "title": "Central Floridas Got Talent is Back in Orlando! Auditions 2015 are Over!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Central Florida’s Got Talent is back in Orlando Florida on September 5 2015 with High Caliber Vocalists and Dancers! \nThe amazing 110 contestants who auditioned gave the audition-judges a huge challenge in choosing only 19 finalists.\nThey will be hitting the stage for not only the opportunity to win the First Prize of 1500.00 or the People’s Choice Award of 500.00 but also to champion our mission to enrich the lives of children and young adults with special needs.  Go to  for more details.  \nThis is a must see Benefit Award Show.  Join our Host Jim Payne from WESH 2 News and our Co-Host  singer/actor Noah Schnacky on Saturday September 5 2015 at the Rosen Shingle Creek Orlando FL. Buy your tickets on line at http://www.centralfloridasgottalent.com.\nFlorida’s Vocalists and Dancers will provide a fantastic show while all participants share in Dream Big’s mission to enrich the lives of individuals with varying exceptionalities.  All proceeds benefit Dream Big Inc. a non-profit 501 C-3 Charitable Organization.  Visit http://www.centralfloridasgottalent.com for an introduction to “Our Story” and mission to help families with children with special needs.  This Event aims to raise funds to launch Dream Big’s Respite/Therapeutic Program for children and young adults with special needs.  \nOur local celebrity judging panel will determine the First Place winner but your votes will determine the People’s Choice winner – come be part of this high energy and high impact event.\nThe President of Dream Big Inc. Antonia Llull (most know her as “Tonina”) shares “Dream Big Inc. is reaching for higher goals to help hundreds of families with children and young adults who have special needs. We are confident that the upcoming benefit award show will be our largest and most impactful event to date. We recognize that in order to launch Central Florida’s Got Talent and achieve a growing momentum towards increased awareness and recognition we need our community’s help and support in the fight against the institutionalization of our young adults and the lowering of expectations for children with special needs”.\nFor more information visit or email \nDate: June 15 2015\nContact: Antonia Llull\nContact E-mail Address (auditions): \nContact E-mail Address (general): \nContact Phone Number: 407-615-6022\n\n\nAbout PRBuzz.com \nPRBuzz.com is a press release distribution service that distributes press releases to online news sites and blogs to help customers with search engine optimization and create buzz about their web site, news or business.", "external_links": [], "published": "2015-07-26T03:00:00.000+03:00", "crawled": "2015-07-27T13:39:01.843+03:00", "highlightTitle": ""}