{"organizations": [], "uuid": "c351e5c8bb9acce3a35ec729e5d56f589d43faf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/b/l/l/3/image.related.socialLead.620x349.gi73v4.png/1436832974725.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/15/materials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/property/private-buyers-maintain-their-patch-20150707-gi73v4.html", "country": "AU", "title": "Private buyers maintain their patch", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Private buyers maintain their patch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "c351e5c8bb9acce3a35ec729e5d56f589d43faf7"}, "author": "Nicole Lindsay", "url": "http://www.smh.com.au/business/property/private-buyers-maintain-their-patch-20150707-gi73v4.html", "ord_in_thread": 0, "title": "Private buyers maintain their patch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mike Fitzpatrick paid $9.8 million for 175 Flinders Lane.\nMelbourne's wealthy families and syndicates acting for high net worth individuals have been active players in this year's market, competing keenly with offshore investors for a piece of the CBD.\nWhile some families and investors have cashed in on the rising values, boosted by Chinese and Singaporean investors, others are quietly moving in or trading up.\nThe wealthy Bardas family, through Acland Investments, has emerged as the $25.5 million buyer of barristers' chambers Melbourne Chambers at 235 Queen Street.\nThe wealthy Bardas family bought Melbourne Chambers at 235 Queen Street.\nPhilanthropist Helen Sykes and businessman Mike Fitzpatrick paid $9.8 million for a boutique office building at 175 Flinders Lane.\nAdvertisement And Peachtree Capital, through an investment vehicle, paid $28.25 million for 410 Collins Street after offloading 456 Lonsdale Street for $37.5 million in 2013.\nEarly last year, the Liberman family-backed syndicate Impact Investment Group paid $32 million for 401 Collins Street.\nA string of sub-$70 million deals, many of them on Collins Street, totalling about $650 million has added ballast to the hot market in the past 18 months, according to research by CBRE.\nLow interest rates and flat investment returns are driving the interest despite the upswing in values. Average property values have more than doubled to $7000 to $9000 a square metre from $3000 to $4000 a square metre in 2013.\nCBRE agent Mark Wizel​ said: \"It has become clear that a lot of private groups expected the market to effectively collapse after the global financial crisis and this simply didn't play out.\n\"As a result, many groups who are cash rich are now aggressively looking to get into the market because they are underexposed in commercial property and largely overexposed in other markets,\" Mr Wizel said.\nANZ banker Eddie Law said there was a strong increase in the appetite of local investors for both office and retail investments.\n\"It has been a culmination of improved tenant and trading conditions as well as the current cost of debt which are the big drivers of this renewed interest,\" Mr Law said.\nSavills agent Clinton Baxter is fielding strong interest from private family groups – both local and offshore – for the historic buildings at 12 and 14-16 Collins Street which the Rotstein family is selling.\n\"They are as active as ever. They see the city as a going through a growth phase and offering plenty of value,\" Mr Baxter said.\n\"You just need to take your chances when these buildings come up because it might be years if not decades between opportunities,\" he said.\nCBRE agent Josh Rutman said the competition was driving yields from primary and secondary buildings down to pre-GFC levels of between 4 and 6 per cent.\n\"They're still seeing value. There's such pent-up demand and they're not earning anything in the bank,\" Mr Rutman said.\n\"The breadth of interest out there is demonstrated by 247 Collins Street, which was a vacant building that saw a sale of just under $12,000 a square metre,\" he said.\nThat building was offloaded by racing identity Ken Biddick and bought by a Singaporean investor.\nThe market will be tested with the sale of the Halim family's historic 425 Collins Street, which is expected to sell for about $40 million. Expressions of interest on that building, marketed by CBRE, close tomorrow.", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T05:07:35.000+03:00", "highlightTitle": ""}