{"organizations": [], "uuid": "58b433634e46726e503b11ee4c228a54e5e5d400", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DP774_voat_0_MG_20150709140137.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/voat-creator-speaks-on-reddit-refugees-plans-for-future-2015-07-10", "country": "US", "title": "Creator of surging Reddit rival Voat: We will avoid same mistakes", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "Creator of surging Reddit rival Voat: We will avoid same mistakes - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 1, "uuid": "ea434cec1463d3d2caaa31ffaaf93dee76820129"}, "author": "By     Therese Poletti", "url": "http://www.marketwatch.com/story/voat-creator-speaks-on-reddit-refugees-plans-for-future-2015-07-10#post-0", "ord_in_thread": 0, "title": "Creator of surging Reddit rival Voat: We will avoid same mistakes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (MarketWatch) — Voat, a small social news and forum site that promises no censorship, has become a refuge for angry Reddit users, but the site’s creator says he plans to avoid the mistakes made by others, including the so-called “front page of the Internet.”\nVoat, which has an “alpha” stamp (for early testing) in one corner, received such a flood of new users amid the recent controversy at Reddit that its servers were experiencing outages. Reddit and interim Chief Executive Ellen Pao — known for her unsuccessful lawsuit against Kleiner Perkins Caufield & Byers — have been at the center of a firestorm since the firing of popular employee Victoria Taylor, who ran the popular Reddit forums called “Ask Me Anything,” or AMAs.\nAtif Colo, the creator of Voat (pronounced like goat, which is also the site’s mascot), said that in the last 30 days, Voat has had almost two million unique visitors and almost 30 million page views, up from 138,717 unique visitors and 1.8 million page views the month before. According to Amazon.com Inc.’s AMZN, +2.10% Alexa ranking data , the biggest driver of new visitors is Reddit.\n“We don’t want to speculate, but for the last several months there has been a noticeable influx of new users, which came just around the time when Reddit would announce a change,” Colo told MarketWatch in an email interview. “The same trend was noticeable when Reddit banned certain subreddits which were used to discuss legal subjects which some people may have found offensive.”\n“It is clear that there is a correlation, but this may also just be a coincidence,” Voat’s creator wrote.\nColo said he started Voat as a student side-project while studying at the University of Lund, Sweden. He received so much feedback from new users about their concerns with Reddit that he was inspired “to keep developing Voat and providing an alternative platform where users would not be censored and still say whatever they want.”\nPerhaps in anticipation of comments that it has a remarkably similar look and feel to Reddit, the site notes that even though it may look like “that other site,” it is written in a completely different programming language, C#. Colo said he has learned from the problems of others, notably the issues at Reddit and likely the past problems at Digg, which launched a new version with disastrous results.\n“We are also very careful with introducing major changes as we have learned from mistakes made by other similar platforms where changes were disastrous,” Colo said. “We are listening to what our users are requesting, they are an endless pool of ideas.”\nVoat Atif Colo (L) and Justin Chastain (R), co-founders of Voat Voat says that it accepts donations only in Bitcoin for now after a battle with PayPal , and that it will “never sell your data.” It is suddenly receiving interest from investors while being run by just two people: Colo, who recently graduated from the University of Zurich in Switzerland, and co-founder Justin Chastain.\n“We’re currently two people working part-time, but since Voat is open-source, many more people volunteered their time to help improve Voat,” Colo said. “We’ve received quite a few investment offers, but we haven’t had the time to talk.”\nThe emergence of another young social news/forum/aggregator is not a surprise given the turmoil at Reddit and the ephemeral history of Internet forums. Now Voat’s founders, suddenly in the spotlight of media attention, are in an interesting position as they ponder whether or not to accept financing should the site’s current momentum continue.\nWhen asked if he had any need to create a decentralized media platform, as some have suggested is the best way to run a censorship-free forum, Colo said creating a truly distributed system would not be feasible unless Voat forced users to install software on their end.\n“For now, we will have to be satisfied with hosting our infrastructure in whichever country in the world offers the most freedom,” he said. “We don’t support and don’t allow illegal content such as child pornography, but as far as freedom of speech goes — we strongly believe that people should be free to say whatever they want.”\nIf Voat becomes a real corporate entity, it too may be beholden to competing interests of investors, employees, advertisers and its community, just as Reddit is today. Voat’s founders, though, appear to be trying to go against the grain, accepting donations and development help from programmers in the global open-source community.\nWhile Bitcoin has been effective, Colo noted that Voat has received hundreds of donation inquiries from users who then could not be bothered to deal with Bitcoin.\n“Before Voat became popular and, perhaps, for some, a threat, I used to believe that anyone could create their own community and exercise their right to freedom of expression,” he wrote. “Reality is that this is a costly operation and that community has to sustain itself through, for example, donations.”\nColo responded to several Facebook messages and emails in the middle of the night in Switzerland, and said he has not been talking to the media while working long stretches to maintain the site.\n“We have been pulling 40+ hours with no sleep so working this late has become the norm,” Colo said, without expanding much on future plans. “Every beginning is hard and we are pretty determined.”\nMore from MarketWatch", "external_links": ["http://www.alexa.com/siteinfo/voat.co", "https://voat.co/v/announcements/comments/161711", "http://recode.net/2015/07/05/fred-wilson-the-next-reddit-will-likely-be-built-on-the-bitcoin-blockchain/"], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-11T01:57:07.000+03:00", "highlightTitle": ""}