{"organizations": [], "uuid": "76e6f02b4ff290f6c1ebcba3b2c874df808dde79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/48038606.cms", "site_section": "http://timesofindia.indiatimes.com/news/economy/finance/articlelist/1286551815.cms", "section_title": "News on Government Finance, Public Financing, Indian Finance | Economy News - Economic Times", "url": "http://timesofindia.indiatimes.com/sports/tennis/wimbledon-2015/top-stories/Federer-looks-to-follow-Serena-and-rock-the-ages/articleshow/48038600.cms", "country": "IL", "title": "Federer looks to follow Serena and rock the ages", "performance_score": 0, "site": "indiatimes.com", "participants_count": 5, "title_full": "Federer looks to follow Serena and rock the ages - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T16:10:00.000+03:00", "replies_count": 4, "uuid": "15efa82a900e0433687fa351c6afc03946f4efe2"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/tennis/wimbledon-2015/top-stories/Federer-looks-to-follow-Serena-and-rock-the-ages/articleshow/48038600.cms#post-0", "ord_in_thread": 0, "title": "Federer looks to follow Serena and rock the ages", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON: Roger Federer looks to follow Serena Williams as a Wimbledon record breaker when he faces world number one Novak Djokovic in Sunday's eagerly-anticipated men's singles final.\nNovak Djokovic vs Roger Federer - 10 facts\nA day after Williams became the oldest woman to win a Grand Slam title when she swept to a sixth Wimbledon, fellow 33-year-old Federer will bid to become the oldest men's champion at the All England Club in the Open Era.\nIn a repeat of last year's final, which Federer lost in five sets, the Swiss will look to capture a record eighth Wimbledon title and the 18th major of his career.\nHis demolition of Andy Murray in Friday's semifinals was a throwback to his years of Grand Slam dominance when he captured 16 of his 17 majors in a seven-year spell between 2003 and 2010.\nNow he has reached a 10th Wimbledon final, the oldest man to do so since 39-year-old Ken Rosewall in 1974, and his 26th Grand Slam final overall.\nA win on Sunday would break the tie of seven Wimbledon titles he shares with Pete Sampras and which he levelled with his most recent Slam, the 2012 All England Club crown.\nAhead of their 40th career meeting, Federer and defending champion Djokovic are equally-matched.\nFederer has a 20-19 career edge in their head-to-heads but they are locked at 6-6 in the Grand Slams.\nIn finals at the majors they are 1-1 with Djokovic's Wimbledon triumph of 12 months ago following Federer's straight sets victory in the 2007 US Open.\n\"It's great to play Novak anywhere these days because he's a great player. He's had unbelievable success throughout his career,\" said Federer.\n\"He's become very tough. He always shows up. He's been good for the game.\"\nThe pair have already met three times in 2015 -- Djokovic winning the finals at Indian Wells and Rome after Federer had come out on top in the Dubai final.\nThat loss in the UAE was just one of three for Djokovic all year with the third coming at the worst possible time at the hands of an inspired Stan Wawrinka in the final of the French Open, the only Slam still to elude him.\nDjokovic is 47-3 in 2015 after collecting a fifth Australian Open as well as Masters titles at Indian Wells, Miami, Monte Carlo and Rome.\nDjokovic will be playing in his fourth Wimbledon final and chasing his ninth Grand Slam title.\nHe has an admirable record of consistency at the highest level having made at least the semifinals 19 times at the last 20 Grand Slams.\nVictory on Sunday for the 28-year-old would have an interesting symmetry -- it was 30 years ago that coach Boris Becker won his first Wimbledon title as a 17-year-old.\n\"Boris goes through the emotions with me like when he was playing,\" said 2011 and 2014 champion Djokovic who can match Becker's record of three trophies should he beat Federer.\nDjokovic said last year's win over Federer also helped put his career back on track after he had gone five majors without adding to his tally which stood at six at the time.\n\"To win that match in five sets against Roger on grass was definitely something that gave me a lot of confidence,\" he said.\nFollow TOI Sports on Twitter >>> @TOISportsNews http://timesofindia.indiatimes.com/followceleb.cms?alias=Wimbledon,Serena Williams,Roger Federer,Pete Sampras,Novak Djokovic Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities", "https://twitter.com/TOISportsNews"], "published": "2015-07-12T16:10:00.000+03:00", "crawled": "2015-07-12T10:58:39.000+03:00", "highlightTitle": ""}