{"organizations": ["Fed"], "uuid": "6bef52c484743db707e3d8eda570e22b4ed7fef9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/emerging-market-currencies-crash-fed-214845731.html", "country": "US", "title": "Emerging market currencies crash on Fed fears and China slump", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Emerging market currencies crash on Fed fears and China slump", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T00:48:00.000+03:00", "replies_count": 0, "uuid": "6bef52c484743db707e3d8eda570e22b4ed7fef9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/emerging-market-currencies-crash-fed-214845731.html", "ord_in_thread": 0, "title": "Emerging market currencies crash on Fed fears and China slump", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Jul 25, 2015, 00:08 BST - UK Markets closed Emerging market currencies crash on Fed fears and China slump By Ambrose Evans-Pritchard | Telegraph – 1 hour 20 minutes ago 214.50 0.00 \nBrazil faces a 'perfect storm' as the country as the country slides deeper into recession, the politics go haywire and the Fed prepares to raise rates \nThe currencies of Brazil, Mexico, South Africa and Turkey have all crashed to multi-year lows as investors flee emerging markets and commodity prices crumble. \nThe drastic moves came as fears of imminent monetary tightening by the US Federal Reserve combined with shockingly weak figures from China, which stoked fears that the country may be sliding into a deeper downturn and sent tremors through East Asia, Latin America and Africa. \nThe Caixin/Markit (NasdaqGS: MRKT - news ) manufacturing survey for China fell to a 15-month low of 48.2 in July, with a sharp drop in new export orders. Danske Bank (Copenhagen: DANSKE.CO - news ) said the slide “pours cold water” on hopes of a quick recovery from the slump seen earlier this year. \nBrazil's real plummeted to a 12-year low of 3.34 to the dollar, reflecting the country's heavy reliance on exports of iron ore and other raw materials to China. \nThe devaluation tightens the noose on Brazilian companies saddled with $188bn in dollar debt taken out during the glory days of the commodity boom. The oil group Petrobras alone raised $52bn on the US bond markets. \nMexico’s peso hit a record low of 16.24 against the dollar. The country’s foreign exchange commission is mulling emergency action to defend the currency, despite the extreme reluctance of the Mexican authorities to meddle with market forces. \nColombia’s peso collapsed 5.2pc to a historic low on Friday, a huge move in a single day. Similar dramas played out in Chile and a string of countries deemed vulnerable to the combined spill-overs from China and the US. The MSCI index of emerging market equities fell to 1.8pc to 36.92 and may soon test four-year lows. \nBernd Berg, from Societe Generale (Paris: FR0000130809 - news ) , said Brazil faces a “perfect storm” as the economy slides into deeper recession and corruption scandals spread. New (KOSDAQ: 160550.KQ - news ) worries about political risk may soon push the real to 3.60, a once unthinkable level. \nThere is mounting concern that President Dilma Rousseff could be impeached for her failure to stop pervasive malfeasance at Petrobras. \nBrazil’s travails come just as the US nears full employment and the Fed prepares to raise interest rates for the first time in eight years. issuing what amounts to a \"margin call\" for emerging markets that have borrowed $4.5 trillion in dollars . \nMr Berg said Brazil’s debt may be cut to junk status over coming months. This would be a humiliating blow for a country that thought it had escaped the endless cycle of debt booms and populist misrule, and saw itself as a pillar of a new BRICS-led global order. \nIn South Africa, the rand plummeted to a record low of 12.68 to the dollar on Friday despite moves by the central bank to defend the currency. It raised rates a quarter point to 6pc on Thursday. \nSouth Africa is one of a growing number of emerging market states that has lost its room to manoeuvre and is being forced to tighten monetary policy into the downturn, compounding the effects of the commodity slump. \nSuch countries cannot ease policy or resort to stimulus to cushion the blow because this would risk capital flight - and potentially a classic rush for exits. Such synchronized “pro-cyclical” tightening is hazardous for the world as a whole since the emerging markets now make up roughly half global GDP and until this year - four-fifths of extra growth. \nStephen Jen, from SLJ Macro Partners, said China’s downturn is proving to be “hard on the outside, soft on the inside”. It may be manageable for China itself as the country shifts from heavy industry to service-led growth, but it is brutal for those countries that have been feeding on the Chinese construction boom. \n“China can handle the soft landing; it is the other countries that rely on China’s growth that we worry about,” he said. \nGrowth in emerging markets excluding China has fallen to 0.1pc. These countries are on the brink of recession. They are now being hit on two fronts at once since the Fed shows no signs so far of backing away from a rate rise in September, probably the first of many. \nThe complicated “feedback loops” that created an interwoven American-Chinese boom in the last decade and greatly flattered the emerging markets nexus - are now going into reverse with a vengeance. Mr Jen said the weaker countries face “acute risks of a ‘sudden stop’ in capital flows” when the Fed pulls the trigger. “We expect a violent sell-off in some EM currencies this year,” he said. \nTraders say Turkey may be first in the firing line. Turkish companies and banks have $120bn of short-term foreign funding that must be rolled over within a year. When combined with the country’s stubborn current account deficit still 5.7pc of GDP the funding gap is $170bn. This is more than six times larger than the central bank’s foreign reserves. \nTurkey was able to get away with this as long as the political system was stable. But a spate of terrorist attacks and a splintered electoral landscape have exposed the underlying dangers. Aberdeen Asset Management (Other OTC: ABDNF - news ) said it is slashing its holding of Turkish debt. “The risks surrounding the country are now much too high,” it said. \nThe lira weakened sharply to 2.75 against the dollar on Friday and looks likely to test record lows. Yields on 10-year Turkish bonds have jumped 50 basis points this week to 9.48pc. \nIlan Solot, from Brown Brothers Harriman, said the geopolitical temperature is rising fast and the Turkish lira is likely to take the strain. “We think the tail-risks emanating from Turkey may be greater than many appreciate,” he said.", "external_links": [], "published": "2015-07-25T00:48:00.000+03:00", "crawled": "2015-07-25T02:10:43.320+03:00", "highlightTitle": ""}