{"organizations": [], "uuid": "511300113c7769ed75623196a06471c39a3778d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://www.modernghana.com/logo/final_log.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/629501/1/tax-education-intensified-in-yendi.html", "country": "US", "title": "Tax education intensified in Yendi", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Tax education intensified in Yendi", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T01:00:00.000+03:00", "replies_count": 0, "uuid": "511300113c7769ed75623196a06471c39a3778d0"}, "author": "", "url": "http://www.modernghana.com/news/629501/1/tax-education-intensified-in-yendi.html", "ord_in_thread": 0, "title": "Tax education intensified in Yendi", "locations": ["Yendi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  13 July 2015 23:00 CET Tax education intensified in Yendi By GNA \nYendi (N/R), July 13, GNA - The Yendi Small Tax Office of the Ghana Revenue Authority (GRA) has organised a tax education seminar for over 100 stakeholders drawn for the Yendi Municipality and other districts in the Northern Region. \nTopics discussed include VAT Act 870, filing of returns, sanctions under Act 592 and 870, rent tax, record keeping, registration and re-registration and withholding taxes. \nMr Alfred Annang Mensah, the Manager of Yendi Small Tax Office, said it is their mission to demystify tax issues by creating an enabling environment and maintaining a friendly atmosphere. \nHe said the tax education seminars have afforded them the opportunity to meet their stakeholders and engage them in a fruitful discussion on matters relating to tax. \nMr Emmanuel Owusu Sekyere, Senior Revenue Officer, said a person engaging in any taxable activity must register that activity, and that, such a person is required to register and apply for registration as prescribed on the form. \nMr Victor Jiagge, a Revenue Officer, said in accordance with the Internal Revenue Act 2000 (Act 592) every individual with taxable income is obliged to furnish returns on his income to the Commission-General of Ghana Revenue Authority each year, for assessment. \nHe said in accordance with the Internal Revenue Act 2000 (Act 592), employers are also requested to furnish various returns to the Commissioner-General on behalf of their employees on the specific income tax form on specific date. \nMr Jiagge said where a person fails to furnish a return income, penalties shall be imposed on both the company and individual. \nGNA", "external_links": [], "published": "2015-07-14T01:00:00.000+03:00", "crawled": "2015-07-14T00:51:19.000+03:00", "highlightTitle": ""}