{"organizations": ["AAPL"], "uuid": "4d75604a537c249d407cbb17ce064c4d49949539", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-technology/?format=rss", "section_title": "Technology News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/global-markets-stocks-sour-apple-111748827.html", "country": "GB", "title": "GLOBAL MARKETS-Stocks sour as Apple results leave bitter aftertaste", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "GLOBAL MARKETS-Stocks sour as Apple results leave bitter aftertaste", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T14:17:00.000+03:00", "replies_count": 0, "uuid": "4d75604a537c249d407cbb17ce064c4d49949539"}, "author": "", "url": "https://uk.finance.yahoo.com/news/global-markets-stocks-sour-apple-111748827.html", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks sour as Apple results leave bitter aftertaste", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Apple (NasdaqGS: AAPL - news ) drags global shares lower \n* Gold resumes fall \n* Greek parliament vote, ECB eyed \nBy Jamie McGeever \nLONDON, July 22 (Reuters) - Shares (Frankfurt: DI6.F - news ) fell on Wednesday, dragged down by disappointment over U.S. and European corporate earnings, most notably at Apple Inc, the world's largest company. \nRetrenchment and caution dominated trading in other assets, with the dollar struggling to gain ground and commodities such as gold and oil resuming their downturn. \nMeanwhile, the European Central Bank could decide on providing extra liquidity to Greek banks, while the parliament in Athens will vote on reforms it must undertake for talks on a multi-billion euro bailout to start this week. \nBoth could help determine broader investor sentiment. \n\"Overnight losses in the U.S. and Asia, and the failure of the U.S. tech sector to provide earnings fireworks -- of the good kind -- is weighing on Europe,\" said Brenda Kelly, head analyst at London Capital Group. \nU.S. futures pointed to a fall of around 0.5 percent at the open on the S&P 500. and 1 percent on the Nasdaq. Apple (Swiss: AAPL.SW - news ) shares were down almost 6 percent in pre-market trading as brokers started to cut their price targets. \nThe FTSEuroFirst 300 index of leading European shares was down a third of one percent at 1,591 points. Germany's DAX fell 0.4 percent to 11,560 points and France's CAC 40 was down 0.3 percent at 5,091 points. \nBritain's FTSE 100 was down 1.1 percent, hit by weakness in the mining and energy sectors, and the latest Bank of England policy minutes which showed \"a number\" of policymakers edging towards raising rates. \nEuropean bourses were also weighed down by a 4 percent fall in chip maker Arm Holdings (LSE: ARM.L - news ) . Although ARM posted a 32 percent rise in second-quarter profit, the results from Apple, a major customer, hit hard. \nIn Asia, MSCI (NYSE: MSCI - news ) 's broadest index of Asia-Pacific shares outside Japan slid 0.9 percent, its biggest decline in two weeks. \nJapan's Nikkei stock index ended down 1.2 percent, snapping its six-day rising streak and pulling away from Tuesday's nearly four-week closing high as the Apple news reverberated across related tech shares. \nSTERLING EFFORT \nFollowing its tumble to a five-year low on Monday, investors remained wary of gold. It reversed Tuesday's rebound to trade down 0.7 percent on the day to $1,090.95 per ounce. \n\"We believe gold should range trade around current levels, but do not dismiss the possibility of further price falls, given the lack of safe-haven interest,\" Barclays (LSE: BARC.L - news ) commodities analysts wrote in a note to clients. \nCrude oil futures were still under pressure too, as investors worried about ample supply. U.S. crude was down 1.1 percent at $50.30 and Brent shed 0.7 percent to $56.66. \nIn currencies, the euro was steady at $1.0935, consolidating its rebound from Monday's three-month low of $1.0808, and the dollar index was flat at 97.380. On Tuesday, it rose as high as 98.151, a level not seen since late April. \nSterling was the biggest mover among major currencies, lifted by the BoE (Shenzhen: 000725.SZ - news ) minutes. It was up 0.5 percent against the dollar at $1.5630 and 0.6 percent higher against the euro, pushing the single currency back below 70.00 pence . \nStandard & Poor's upgraded Greece's sovereign credit rating on Tuesday by two notches and revised its outlook to stable from negative, citing euro zone countries' initial agreement to start negotiations with Athens on a third bailout. \nEuropean bond markets awaited the Greek parliament vote, sticking to narrow ranges. Benchmark 10-year Bund yields fell a basis point to 0.77 percent, and Italian yields were steady at 1.96 percent. \n\"The news flow since last week's deal does not fill us with great hope about the design of the pending deal, which is one reason we retain a fairly pessimistic view about what has been solved in Greece,\" said Michael Michaelides at RBS (LSE: RBS.L - news ) . \nThe yield on 10-year U.S. Treasuries slipped a basis point to 2.33 percent. (Reporting by Jamie McGeever; Editing by Catherine Evans; To read Reuters Global Investing Blog click on http://blogs.reuters.com/globalinvesting; for the MacroScope Blog click on http://blogs.reuters.com/macroscope; for Hedge Fund Blog Hub click on http://blogs.reuters.com/hedgehub )", "external_links": [], "published": "2015-07-22T14:17:00.000+03:00", "crawled": "2015-07-22T14:24:03.674+03:00", "highlightTitle": ""}