{"organizations": [], "uuid": "4b4b101cbea75f720bd24ec0eac4d813f9be2ea3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://specials-images.forbesimg.com/imageserve/37637865/640x434.jpg?fit=scale", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/jamiehopkins/2015/07/01/workplaceinequalitiesforcewomentoretire/", "country": "US", "title": "Workplace Inequalities Force Women To Plan For Retirement Differently", "performance_score": 1, "site": "forbes.com", "participants_count": 2, "title_full": "Workplace Inequalities Force Women To Plan For Retirement Differently - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T13:06:00.000+03:00", "replies_count": 1, "uuid": "aa027c544fdfe086ad0e552845eb5255adb18b98"}, "author": "Jamie Hopkins", "url": "http://www.forbes.com/sites/jamiehopkins/2015/07/01/workplaceinequalitiesforcewomentoretire/#post-0", "ord_in_thread": 0, "title": "Workplace Inequalities Force Women To Plan For Retirement Differently", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With over sixty million baby boomers reaching age 65 in the next twenty years, many people are just beginning to plan for the vast challenges and opportunities presented in retirement. While proper retirement income planning is crucial to a dignified and secure retirement, planning will not look the same for everyone. One’s gender and demographics will shape when, how, and why he or she plans for retirement. While an individual’s savings, profession, family, and education are all important factors when planning for retirement, gender is often under represented as a crucial factor impacting retirement.\nWomen planning for retirement often face difficult challenges not faced by their counterparts. Maybe the most important is that women, on average, live longer than men , meaning that retirement will require more resources for women. In addition, the average woman will have a shorter work life, earn less over her career, and, according to the Women’s Institute for A Secure Retirement (WISER), are less likely to have access to an employer sponsored retirement plan . Jocelyn Wright , the Director of The State Farm® Center for Women and Financial Services, states that “the gender pay gap is much more than just a women’s issue, it is also a significant planning issue. Women currently earn 78¢ for each dollar earned by men. And for women of color, particularly Black and Hispanic, that number is even lower, 64¢ and 56¢, respectively. If you factor that disparity over the course of a women’s working years it can be the difference in living out one’s retirement comfortably.”\nThe gender pay gap and the lack of employer sponsored retirement plans makes it harder to save, and means that women are likely to have lower Social Security benefits and smaller benefits from company sponsored retirement plans. One struggle for women to remain in the workforce is that they are typically the primary family caregivers. This can have significant emotional, physical, financial, and career implications. Furthermore, women tend to experience require long-term care for significantly longer than men. For instance, the average woman needs roughly 3.7 years of long-term care, while men only require on average 2.2 years.\nWomen push shopping carts filled with groceries after shopping at Pandorou street market in Athens, Greece, on Wednesday, June 24, 2015. Photographer: Simon Dawson/Bloomberg\nWhile identifying the unique challenges women face is important, more critical is identifying what women can do to improve their retirement readiness. Let’s review some practical steps every woman can take to secure her retirement.\nThe first step is to develop a retirement plan, and the right time to do that is now. Planning cannot start early enough; however, it’s also never too late to improve your situation. A plan starts with a vision of retirement. Ask yourself: When will I start? What will my spending needs be? Where will I be living? From there, you can develop an estimate of costs and craft a plan for building the required resources. The plan must address the uncertainties or risks of retirement, and for women, the most important are longevity, health care and long-term care costs, and the potential loss of a spouse. “It goes without saying that I believe working with a Financial professional can lead to a greater sense of retirement readiness,” says Wright, as “the road to retirement is a marathon, not a sprint, and having someone you trust help chart and navigate the course goes a long way.” Working with an advisor is crucial, as a well-qualified professional can offer alternatives, help keep the plan on track, and make adjustments as circumstances change.\nPlanning for the loss of a spouse begins with making sure that women understand family finances and have open discussions about retirement planning with their spouses. It also means planning for sources of income after the loss of a spouse. Many people are unaware that Social Security income will decrease, typically by one-third or one half, at the death of the first spouse. Planning is required to make up that shortfall. Alternatives include life insurance, annuity income, or other assets set aside for this contingency.\nMaking the correct Social Security decisions are crucial as women tend to rely upon Social Security more than men. They are also more likely to be widowed. Roughly 45 percent of men over age 65 are widowed as compared to 85 percent of women. With a married couple, assuming that her husband has the larger Social Security benefit, the woman inherits his benefit when he dies. If the husband had started benefits at age 62, the spouse inherits a much lower benefit than if he had begun benefits at age 70. If the husband dies young, a widow who is still working may be able to take a survivor benefit at full retirement age, continue to work, and switch to her worker’s benefit (assuming it is larger than the survivor benefit) as late as age 70 and receive deferral credits. Single women should consider their Social Security options carefully as well. Since Social Security benefits are calculated using the highest thirty-five years of wage history, a worker with fewer than 35 years has lower average earnings. In this case, working several more years can mean significantly higher benefits.\nPage 1 / 2 Continue ", "external_links": ["http://specials-images.forbesimg.com/imageserve/37637865/640x0.jpg?fit=scale", "http://longtermcare.gov/the-basics/how-much-care-will-you-need/", "https://www.wiserwomen.org/images/imagefiles/2014-risks-process.pdf", "http://www.ssa.gov/planners/lifeexpectancy.htm", "http://womenscenter.theamericancollege.edu/staff"], "published": "2015-07-01T13:06:00.000+03:00", "crawled": "2015-07-01T17:02:43.000+03:00", "highlightTitle": ""}