{"organizations": [], "uuid": "64d74215371e8d7a391b9abd7820e7bfcf8646f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/4/3/2/3/image.related.afrArticleLead.620x365.gi0yf4.png/1435865491950.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/legal/firms-fight-for-market-growth-in-lawyer-talent-war-20150702-gi0yf4", "country": "AU", "title": "Firms fight for market growth in lawyer talent war", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Firms fight for market growth in lawyer talent war | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T15:50:00.000+03:00", "replies_count": 0, "uuid": "64d74215371e8d7a391b9abd7820e7bfcf8646f6"}, "author": "afr.com", "url": "http://www.afr.com/business/legal/firms-fight-for-market-growth-in-lawyer-talent-war-20150702-gi0yf4", "ord_in_thread": 0, "title": "Firms fight for market growth in lawyer talent war", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"The business market remains hugely competitive – as one client said, 'flat is the new growth',\" King & Wood Mallesons managing partner in Australia Sue Kench says. Ryan Stuart by Katie Walsh Edmund Tadros Interactive | Explore the Law Partnership Survey database\nThe nation's leading law firms are fighting for talent in a bid to strengthen the engine room as they chase slim pockets of growth in a difficult market.\nIt's a vicious – or virtuous – cycle as opportunities to attract and promote staff come to those firms that can tap growth and it's a trend reflected in the dramatic ups and downs in the The Australian Financial Review's Partnership Survey results on lawyer levels.\nFor all the movement at individual firms, the headline numbers show there has been a slight overall reduction in the number of fee-earners (excluding partners) at the major firms, down 2 per cent in the past six months and 3 per cent over the past year.\n\"The business market remains hugely competitive – as one client said, 'flat is the new growth',\" said King & Wood Mallesons managing partner in Australia Sue Kench.\nIt's forcing law firms to strategically target opportunities - critical not only for the health of a firm's bottom line but sustainability in a strong workforce and fostering the next generation of leaders.\n\"We really do need to get that growth, to make investment in training and skills that our people need but also to give them the opportunities they will look for in the future,\" said Ms Kench.\n\"You need to be attracting people, they need to see where the growth opportunities are.\"\n Senior associate and fee-earner numbers at KWM are slightly down for the year, but in the most recent six months the change for fee-earners is negligible and senior associates have risen by 10 per cent.\n\"The focus for us is growth, but not growth in numbers for the sake of growth by numbers – it is about smart growth, and growth that delivers opportunities for our people,\" said Ms Kench.\nKWM is among firms to book revenue growth in the past year despite the contracting local market. Upside pockets were found in infrastructure, government work and real estate; and, critically, looking offshore especially to Asia.\nLooking beyond our borders for growth is a theme among the firms, even for the defiantly domestic for whom it's about creating strong global networks and relationships with other local firms in strategic cities.\nThis week Herbert Smith Freehills announced a 12 per cent profit jump globally for the financial year ending April 30, taking profit per equity partner up 8 per cent to $1.6 million (£801,000). The revenue leap was softer at 2 per cent.\nThe global firm remains the largest locally with 876 fee-earners and 279 senior associates on staff; numbers that are down 1.8 per cent and 8.5 per cent respectively over the past year.\nAustralian managing partner Jason Ricketts said that the firm's approach was to ensure \"the right number and mix of partners and other lawyers to deliver the best results for our clients now and into the future\".\nHWL Ebsworth Lawyers, which now has the most partners of any surveyed firm, had the most aggressive growth with the number of fee-earners up 31 per cent to 547 in the past year but senior associate figures that remained almost unchanged.\nClayton Utz had a healthy increase in its total number of fee-earners, up 40, or 6 per cent, in the past year, to 687.\nThe total number of senior associates on staff has increased to 185 on last year, up 37, or 25 per cent. But the firm says that the number of senior associates is actually flat and the variation is due to a reporting change.\nThe number of fee-earners at Norton Rose Fulbright is down 23, or five per cent, to 476 in the past year.\nThe firm also had the biggest reduction in the number of senior of associates during the same time, down 28, or 18 per cent, to 128. Managing Partner in Australia Wayne Spanner said that the firm continued to \"elevate talented lawyers into senior positions\", including 25 new promotions to the senior associate and senior counsel level from July 1.\nAnother firm that has grown rapidly is Corrs Chambers Westgarth which has increased the number of fee-earners on staff to 623, up 96, or 18 per cent, in the past six months, but a slight contraction in senior associates.\nAll headline figures are based on comparing movement in firms who supplied information across all survey periods.\nA key challenge for law firms is providing opportunities for talented staff when growth is so patchy.\nBaker & McKenzie managing partner Chris Freeland said there was no doubt that it took longer to progress to partner than it did 15 years ago.\n\"While that is partly the business environment, it also reflects the increasing number of people who take varied paths to get to partner, or consciously decide ... not to pursue partnership for a period or at all,\" he said.\nAllens created a new role of \"managing associate\" last year – not, it attests, as a consolation prize for those languishing at the senior associate level, but as valuable training ground for would-be partners.\n\"The role gave me a mandate and confidence to really market and build my practice ... I felt more ownership and control,\" said now-partner Emin Altiparmak, who was among the first to gain the title in July 2014.\n\"[It] is a genuine elevation.\"\nThe firm appointed 14 new managing associates from July 1.\nThe flux at the top end is creating opportunities for mid-tier firms that are eager to absorb talented lawyers - especially in the younger brackets.\nM+K Lawyers national managing partner Damian Paul has an optimistic outlook.\n\"We feel the tide is turning and that there's a lot more activity coming in to the commercial and property parts of our firm. We just get the feeling the economy is picking up a bit for those services,\" he said.\n\"We've brought a number of good people on, mainly from other firms.\"\nwith Marianna Papadakis", "external_links": [], "published": "2015-07-02T15:50:00.000+03:00", "crawled": "2015-07-03T00:08:44.000+03:00", "highlightTitle": ""}