{"organizations": [], "uuid": "92d69ef0646b4f584870e21b0f9c225458033f5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/0/2/g/5/image.related.afrArticleLead.620x365.gi01yl.png/1435743481276.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/real-estate/fivestar-wanda-vista-hotel-to-grace-circular-quay-20150701-gi01yl", "country": "AU", "title": "Five-star Wanda Vista hotel to grace Circular Quay", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Five-star Wanda Vista hotel to grace Circular Quay | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T22:00:00.000+03:00", "replies_count": 0, "uuid": "92d69ef0646b4f584870e21b0f9c225458033f5b"}, "author": "Su-Lin Tan", "url": "http://www.afr.com/real-estate/fivestar-wanda-vista-hotel-to-grace-circular-quay-20150701-gi01yl", "ord_in_thread": 0, "title": "Five-star Wanda Vista hotel to grace Circular Quay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At the future Wanda Vista at 1 Alfred Street, guests will have 5 star views of Sydney city and its harbour Anna Kucera Share on twitter Share on Google Plus by Su-Lin Tan \"Wanda Vista\" would soon be just as much of a household name in Sydney as Sheraton or Westin after China's Dalian Wanda Group confirmed it would build its own brand of five-star hotel at Circular Quay.\nThe Chinese property giant unveiled plans for Gold Fields House at 1 Alfred Street, Sydney, which it bought last year for $415 million, in a development approval submission lodged with the City of Sydney Council on Friday.\nThe group, led by one of China's richest men, Wang Jianlin, has confirmed it would turn the site which incorporates Fairfax House in Pitt Street and the Rugby Club into a hotel and residential two-tower complex worth about $1 billion.\nWhile new to Sydney, Wanda Vista has made its entrance into Australia via the group's $1 billion Gold Coast Jewel project.\nThe company has an established record in building hotels. It has six hotel projects internationally including London and Madrid, and used to operate the Hilton and Sofitel groups in China.\n\"Sydney could do with another five-star hotel. The tourism industry will continue to grow. Sydney is on the top with London and New York because it has a unique location,\" Wanda Sydney managing director Charlie Li said.\n\"This brings something fresh to the city. In Australia, I don't think there are enough star brands.\"\nThe group plans to build the hotel on the east side of the site and the residential tower on the west.\n The original plans would have included 185-metre-high and 45-metre-high buildings at Gold Fields House and a 110-metre residential building at the Fairfax House site.\nWanda, with architect Crone Partners, has sought to have the properties considered as a single holding so it can have a bigger floor space. The hotel tower could also be considered separately as state significant development. The new works have an estimated construction cost of $290 million.\nThere will be a 110-metre hotel tower across Fairfax House and the Rugby Club land, increasing floor space by about 20 per cent. The luxury residential tower will be 185 metres high and there will be a high-end retail precinct on the bottom floors.\nThe mixed use building will also have four to five levels of car parks, with no offices. The group also has a voluntary agreement with the council to improve the footpath, parks and recreational areas in Circular Quay.\nHowever, Mr Li said Dalian Wanda had no plans to put a cinema in the Gold Fields complex, even after the group's Cinema Line Corp purchased Hoyts Group in early June for close to $1 billion .\nThe group's foray into entertainment is not surprising as it also owns North American cinema chain AMC Entertainment after a 2012 takeover.\nMr Li said the group was focusing on four areas globally: tourism, property development, financial services banking and shopping centres.\n\"We are not targeting just the Chinese market but the international market overall. Wanda wants to become a leisure brand. We have a combination of businesses and don't want to specialise in just the one thing.\"", "external_links": ["https://plus.google.com/103218209259241103549", "https://twitter.com/SuLin_Tan"], "published": "2015-07-01T22:00:00.000+03:00", "crawled": "2015-07-01T18:04:01.000+03:00", "highlightTitle": ""}