{"organizations": [], "uuid": "d882fa48743ef67452427bab19695d83ac085fe2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507311785.html", "country": "US", "title": "Egypt: History Repeats Itself", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Egypt: History Repeats Itself", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T18:46:00.000+03:00", "replies_count": 0, "uuid": "d882fa48743ef67452427bab19695d83ac085fe2"}, "author": "", "url": "http://allafrica.com/stories/201507311785.html", "ord_in_thread": 0, "title": "Egypt: History Repeats Itself", "locations": ["Egypt"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Egypt: Egyptian-U.S. Strategic Dialogue Kicks Off On Sunday \nThe only government celebration was an untelevised commemoration held four days earlier at Cairo's Police Academy attended by president and former general, Abdel Fattah al-Sisi. For the first time in the history of the national holiday, the president did not deliver a Labour Day address. \nWorkers at Egypt's state-owned petroleum company posted a Labour Day statement on Facebook: \"We are not celebrating Labour Day this year because there is no cause for celebration. This is the fifth Labour Day since the January 25th revolution, and none of the revolution's demands have been achieved yet, nor has social justice been realised.\" \nMore than four years after an upheaval that was propelled by the country's labour movement, government critics say worker grievances have been brushed aside. But as the country's newest administration seeks to attract private and foreign investment, unending strikes, sit-ins and labour action could scuttle these plans and lead to further unrest. \n\"In the second half of [former President Hosni] Mubarak's rule, labour rights began to disappear,\" said Mohammed Refaat, a labour activist and veteran lawyer, as he sat sipping tea in the offices of the Egyptian Commission for Rights and Freedoms, a Cairo-based NGO. \"But now labour rights are even worse than under Mubarak.\" \nAccording to state officials and government figures, unemployment remains high, workplace conditions have not improved and demands for better pay and benefits have not been met. May figures from the state-run statistics body CAPMAS showed Egypt's unemployment rate at 12.8% for the first quarter of 2015, compared to 13.4% during the same period in 2014, with 3.5m of Egypt's 27.7m labor force unemployed. \nMr Sisi removed subsidies in July 2014 and fuel prices skyrocketed 78% and electricity costs climbed 30%. \"Wages are low and there is a large increase in the cost of living,\" said Mohammed Eldesouky, vice-president of the state-controlled Egyptian Trade Union Federation. \"The law governing the relationship between employers and workers needs to be amended and the safety of workers should be taken into consideration.\" \nThe federation will present proposals to reform these laws, which date back to the Mubarak era, when the country's parliament is elected, Mr Eldesouky said. But these elections remain uncertain. Polls for a new legislative body have been delayed repeatedly. In April Mr Sisi said that Egyptians could expect to vote before the end of the year. \nSuccessive governments have failed to reform these Mubarak-era laws, said Mr Refaat, who represents employees from several economic sectors. Mr Sisi's government has \"completely neglected\" workers' rights, he added. Some amendments have worsened the situation for workers. \nFor instance, on the eve of an international economic conference in March, the government announced it would give private and foreign investors immunity for crimes of embezzlement and corruption. This reinforces the perception that workers cannot challenge their employer in court, as the government too often sides with the company. \nAs Mr Refaat sat in the human rights office, the phone rang. Mohammed Ali Nasr, a fellow labour lawyer, was on the line. Mr Nasr represents workers from the Egyptian mineral company Crystal Asfour, and had called to express his concerns for them, Mr Refaat explained after their ten-minute phone conversation. Working conditions at the factory are poor and many of the workers are sick, Mr Nasr had told Mr Refaat. \nSome have been exposed to high levels of lead and now have cancer, but the company has not paid any medical bills. Now the company is having financial problems and may lay off employees. But if the company has been unwilling to pay medical costs, it is unlikely to pay unemployment benefits either. \nThe current law, which dates back to 2004, requires the company to pay an unemployment salary. But critics of this law say it is still easy for employers to dismiss workers without reason or justification. \"There is so much anger, but they have no capacity to release it,\" Mr Refaat said. \nSince the country's 2011 revolution, much of that rage has been discharged in street rallies and strikes that have surged in the last three years. Nearly 400 labour demonstrations were documented across Egypt in the first three months of 2015, according to an April report by the El Mahrousa Center for Socioeconomic Development, an Egyptian think-tank. Unpaid salaries, poor working conditions and no bonuses were among the top reasons cited for the protests. \nBut the government is not reforming Mubarak-era policies that are seen as the root of the workers' woes. Instead, it is trying to attract foreign investment while responding with a heavy hand to local employees. But this strategy to jump-start the economy, ravaged by more than four years of unrest, may backfire and lead to even more protests. \nThe week before Labour Day, Egypt's Supreme Administrative Court issued a judicial decree declaring that all public sector employees who strike will be forced into early retirement. The judges cited a 2011 military order and sharia law as grounds for banning labour strikes. \nThis decree followed a controversial protest law passed by the interim government in 2013 following the ouster of Muhammad Morsi as president. It made unsanctioned public demonstrations punishable by up to three years in jail and was used to quell worker protests. \nThe Mubarak-era law stipulated the conditions for industrial action, but all \"strikes now are against the law,\" said Mr Eldesouky, who admitted he had not read the court decision nearly two weeks after it was issued. \"The strikes and protests are being used to cause instability in the country.\" \nWhen asked why workers would seek to cause instability, Mr Eldesouky, a former Member of Parliament under Mr Mubarak's political party, accused Mr Morsi's supporters in the Muslim Brotherhood of using protests to wreak havoc and cause problems for the new government. \nMr Refaat, who opposed the Muslim Brotherhood government, scoffed at Mr Eldesouky's claims that Islamists, out to sabotage the government, were behing the protests and not disgruntled workers. \nAccording to Ian Hartshorn, an expert on labour movements in Egypt and Tunisia at the University of Pennsylvania: \"The current government has prioritised stability and order above all else, including answering the demands of many Egyptians. This in some ways mirrors the Mubarak era. Regimes in Egypt have two main modes with regards to workers: attempts at control and attempts of co-opting. Very few have shown a willingness to engage on equal footing.\" \nMr Sisi's inability to address workers' woes and part from the ways of past governments has propelled mass uprisings. History could be repeating itself. \nWorker discontent, some of it channelled into trade unions and some not, produced an unprecedented strike wave in the years before the 2011 uprising, Mr Hartshorn said. This dissatisfaction continued during the revolution, and was one of many factors that forced out Mr Mubarak. \nMr Refaat agrees. \"It is a threat to the country, a threat of an explosion of anger,\" he says. It may take a long time, \"but the workers will rise up again. A stable country needs a fair system and without social justice, there will be no stability.\" \nKristen McTighe is a Cairo-based journalist covering north Africa. Her work appears in the International New York Times and GlobalPost, an online news site. Egypt \nPresident Abdel Fattah El Sisi on Thursday asserted support for Bahrain's efforts to maintain stability and fight … see more » Copyright © 2015 Africa In Fact. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-31T18:46:00.000+03:00", "crawled": "2015-07-31T19:45:38.355+03:00", "highlightTitle": ""}