{"organizations": [], "uuid": "e3c2b8515092f85bd0e0cd5e5c23b3b1986c90db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/7/2/a/m/image.related.afrArticleLead.620x365.gi6rav.png/1436311490070.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/productivity-commission-superannuation-report-highlights-older-workers-dilemma-20150707-gi6rav", "country": "AU", "title": "Productivity Commission superannuation report highlights older workers' dilemma", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Productivity Commission superannuation report highlights older workers' dilemma | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T07:24:00.000+03:00", "replies_count": 0, "uuid": "e3c2b8515092f85bd0e0cd5e5c23b3b1986c90db"}, "author": "Sally Rose", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/productivity-commission-superannuation-report-highlights-older-workers-dilemma-20150707-gi6rav", "ord_in_thread": 0, "title": "Productivity Commission superannuation report highlights older workers' dilemma", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Raising the superannuation preservation age is a neccessary policy reform but raises some gnarly socio-economic questions, Challenger's Jeremy Cooper. Rob Homer Share on twitter Share on Google Plus by Sally Rose New research from the Productivity Commission highlights the need for the government to raise the age at which Australians can start accessing their superannuation savings, while exposing the dilemma of how to make it possible for older employees to stay in the workforce longer, superannuation industry experts have said.\nIn research released on Tuesday, the Productivity Commission finds that raising the age at which people can access their super to 65 years could boost federal coffers mid-century by about $7 billion a year in today's money . Productivity Commissioner Karen Chester, who oversaw the report titled Superannuation Policy for Post-Retirement, warned that if the government acts to lift the preservation age it must also be careful to design appropriate arrangements for early access to super balances for those people who can't work longer.\n\"The problem with pushing up the retirement and preservation ages as incentive to keep older people in the workforce longer is that it becomes a purely hypothetical exercise if there are no jobs for them,\" Rice Warner chief executive Michael Rice said.\nForced into retirement Almost one half of men and around one third of women who retire between the ages of 60 and 64 do so involuntarily, either because of their own ill-health, need to care for a family member, or through losing thier job and being unable to find another one, the report found. People in lower paid jobs were more likely to be forced into early retirement.\nAustralian Institute of Superannuation Trustees chief executive Tom Garcia said more work must be done to address the problem of involuntary retirement before any changes are made to super preservation age levels.\n\"The Productivity Commission acknowledges that changing the preservation age won't help those who currently retire involuntarily and will lead to only a marginal 2 per cent increase in the overall workforce participation rate. We question the benefit of such a policy change that will only make it harder for a significant number of vulnerable older Australians to access their own super savings.\"\nReforms to lift the minimum age at which Australians are allowed to retire and access their superannuation, known as the preservation age, are already in motion.\n As of 1 July 2015 the preservation age was lifted from 55 to 56 years of age for people retiring this financial year, and it is set to gradually rise by another 5 years over the next decade. The preservation age for people born after 1 July 1964 is currently set at 60 years of age, coming into effect from 2024.\nChallenger Ltd chairman of retirement income Jeremy Cooper, who chaired the government's 2010 Super System Review, is a supporter of raising the preservation age further in the future.\nGnarly questions \"That said there are some gnarly socio-economic questions to get to grips with. It is one thing for a well paid white collar professional to choose to work past 65 years of age and another to place the same expectation on a labourer,\" Mr Cooper said.\n\"Nevertheless letting people access their superannuation many years before the age pension eligibility threshold sends a mixed policy signal\".\nThe Abbott government plans to lift the pension eligibility age to 70 effective from 2035, this follows the former Rudd government raising the pension eligibility age from 65 to 67 years effective from 2023.\nMs Chester has urged the government to keep the gap between the preservation and pension age as narrow as possible.\nThe Association of Superannuation Funds of Australia has called for the preservation age to be linked to the age pension eligibility age, with people entitle to access their superannuation five years before they become eligible for the age pension age, but capped at 62 years of age.\nThe Financial Services Council wants the superannuation preservation age raised to 65 years, but also made more flexible by allowing early access to accommodate the needs of those unable to work to retirement.\nPolicies needed \"More policies which encourage older workforce participation, like the government's 'Restart' program, will be needed,\" FSC chief executive Sally Loane said.\nHouseholds that can delay their retirement by as little two years will have superannuation balances around 10 per cent larger in real terms when they retire, the commission found.\nMr Rice said this was consistent with his own firm's internal modelling.\n\"Every year someone defers retirement means an extra year of super contributions, an extra year of compound interest, and one less year of drawing down an income. Working just a couple of years longer can make a big difference to someone's financial situation in retirement\".", "external_links": ["https://twitter.com/sallymrose", "https://plus.google.com/115164720240377561218/about?hl=en"], "published": "2015-07-08T07:24:00.000+03:00", "crawled": "2015-07-08T04:07:54.000+03:00", "highlightTitle": ""}