{"organizations": [], "uuid": "2e4e50624125011f3cad1e5d124b8895d8fe298e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/h/3/6/b/image.related.afrArticleLead.620x365.gi7w16.png/1436342622783.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/mining/coal/hunt-ticks-chinas-watermark-coal-project-20150708-gi7w16", "country": "AU", "title": "Hunt ticks China's Watermark coal project", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Hunt ticks China's Watermark coal project | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T15:34:00.000+03:00", "replies_count": 0, "uuid": "2e4e50624125011f3cad1e5d124b8895d8fe298e"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/mining/coal/hunt-ticks-chinas-watermark-coal-project-20150708-gi7w16", "ord_in_thread": 0, "title": "Hunt ticks China's Watermark coal project", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Watermark might have federal approval, but an actual mine remains a way off. by Matthew Stevens The Commonwealth has ticked-off on the first of two line-in-the-coal contests between miners and the anti-carbon lobby, with formal approval offered to Shenhua Group's $1.5 billion Watermark coal project.\nWatermark stands with Adani Group's much bigger and more challenging Carmichael project at the top of the list of the projects the national coalition of pastoralists and environmentalists would like to kill off.\nCarmichael is the more vulnerable carbon rogue because Adani has plans to make it the nation's biggest single coal complex and then to export its product through an expanded port that feeds its coal boats through one of the shipping channels through Great Barrier Reef.\nOpponents paint this as bad because it introduces coal mining to the previously untouched (and unloved) Galilee Basin, because it requires a 700-kilometre train line and because the coal that lands in India will contribute to the climate change that is killing the reef.\nWatermark, on the other hand, is controversial because it is a proposed new coal mine and because it sits on one of the Permian outcrop hills that fringe the fecund Liverpool Plains.\nThere is grave local sensitivity about the encroachment of coal on to the Liverpool Plains. To be fair to Watermark and its proponent from Beijing, the root of that concern rests far more with BHP Billiton and its shelved plans to mine underneath the black soil that has played host to generations of farmers. As a result, Caroona inspired its own eponymous protest group and its work proved so effective that BHP is unlikely to revisit any time soon development options for what is supposed to be some of the best-quality coal yet identified in NSW.\nBut the fact that Watermark sits on relatively high breccia rather than fertile lowland soil has not spared the Shenhua proposition its share of contest. Watermark has been the target of furious contest by local farmers, less local environmentalists and some very high-profile voices, the most powerful being Sydney radio's most venomous host, Alan Jones.\nConsiderable surprise That is why news of the Commonwealth approval of Watermark under the Environment Protection and Biodiversity Act was welcomed on Wednesday with some considerable surprise across the mining sector. And that is why, as one close to the process suggested immediately after ministerial confirmation was posted on the departmental website, \"the farmers will go bat shit crazy\".\nDon't doubt for a second that this has been a challenging decision for Environment Minister Greg Hunt and his department. Watermark earned its state planning approval in January and that triggered a Commonwealth environmental approval process that has 30 days as its statutory deadline.\nUnder that regime Hunt's decision should have landed on March 13. But the process allows too for ministerial discretion on deadline extensions. Hunt used that discretion liberally both because developing an understanding of the technical pressure points here (the risks to biodiversity and aquifers being primary among them) is no mean feat and because the local member in this case was New England's own Barnaby Joyce.\nAs you might imagine, Joyce is a leading voice in the campaign to protect the agricultural legacy of the black soil of his electorate.\nTo those farmers that might be tempted to go guano crazy, I would urge patience. Because there remains plenty of room here for serious slippage between approval cup and final investment lip. Sure, Shenhua has invested $700 million over eight years to get to a point where a final investment decision can be sensibly debated. But that does not guarantee that the mine will proceed.\nLast piece in puzzle The approval signed by Hunt on Saturday is the last major piece in a regulatory puzzle that has so befuddled and frustrated Shenhua. But there remains maybe another year's worth of regulatory formalities and government box-ticking to complete before Shenhua might be in a position to turn anything like the first sod at what it wants to be a 10-million-tonnes-a-year, high-quality thermal coal mine.\nAnd, before that can happen, the world's second-biggest coal producer, after India's state-owned miner India Coal, has to find a way, too, of making the capital investment numbers make sense. This would have been easier in 2010, when Shenhua's progress on approvals started in earnest. But the economics and politics of coal have changed dramatically since then.\nThe thermal coal price has halved over the past five years in the face of stagnating demand and increasing supply, while the first world's growing intolerance of coal's contribution to climate change has likely loosed more tectonic changes to the seaborne marketplace.\nIt is estimated that Shenhua will need to pump another $800 million into the construction of a mine at Watermark and on the logistics infrastructure that will support it. As well, the requirements of its successful 2008 tender for the Watermark lease include the payment of $200 million to the state government on the delivery of a mining licence for the project.\nThe Watermark tender stands a moment of boom time legend in Australian coal. Just two years after BHP stumped up with $100 million and a promise of $115 million more in milestone payments for its Caroona exploration rights, Shenhua arrived with an even bigger bucket.\nChina's coal company won the rights to Watermark by paying a staggering $300 million upfront and that yet-triggered promise of another $200 million on getting its mining licence.\nSeeds of doubt Now, from what we hear, this second payment hangs heavy on Shenhua and there might be some effort to negotiate a new timetable for the state's success fee. So some might be tempted to ponder whether the seeds of doubt about the viability of proceeding with Watermark are being sown with this future discussion firmly in mind.\nCertainly there would be confronting irony in Shenhua getting this far down the approvals track, only to find that its project was unaffordable. I mean, as recently as February the chairman of Shenhua Australia, Liu Xiang, made unusual public note of his company's frustration at the lack of progress at Watermark.\nHe told The Australian Financial Review it was \"easy to be sceptical about a process which had entered his eighth year will little tangible progress to show for this investment in NSW\".\n\"As international investors, we have found this experience to be inconsistent with the often proclaimed enthusiasm for offshore investment in this country, particularly in the mining sector,\" Liu said.\nThe $1 billion question now is whether the enthusiasm that encouraged our potential international investor through this interminable process has been suddenly drained by coal's increasingly opaque outlook.\nRoot of uncertainty To understand the root of that uncertainty you only have to consider last week's commentary on the carbon-heaviest fossil fuel that was offered by the secretary-general of the OECD, Angel Gurria.\nGurria is the leader of an organisation that promotes free trade as a route to global economic enfranchisement. And yet in the wake of a landmark climate speech delivered in London last week, Gurria was reported as promoting the potential of trade barriers, tariffs and taxes as a means of weaning both the old and the emerging economies from coal.\nGurria's comments were received as \"particularly strange\" by the chief executive of one of our biggest coal exporters. \"Are you sure [he said that]?\" he asked. Well, yes he did.\nAfter noting that \"coal is usually the least heavily taxed of all fossil fuels\", the secretary-general said: \"Coal is also generally subject to very low or no import tariffs all over the world – unlike renewables, which are often subject to import tariffs of 10-20% or higher. The 'reality' for policy makers is that without a concerted change in these facts, the 2-degree target will slip from our reach. Again, it is policies that will determine the outcome.\"", "external_links": [], "published": "2015-07-08T15:34:00.000+03:00", "crawled": "2015-07-08T13:03:17.000+03:00", "highlightTitle": ""}