{"organizations": [], "uuid": "87205599085aec7048bc73023855f38733ebe017", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-01/greece-saga-thwarts-german-five-year-debt-sale-as-demand-slumps", "country": "US", "title": "Greece Saga Thwarts German Five-Year Debt Sale", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "Greece Saga Thwarts German Five-Year Debt Sale - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T19:15:00.000+03:00", "replies_count": 0, "uuid": "87205599085aec7048bc73023855f38733ebe017"}, "author": "Eshe Nelson", "url": "http://www.bloomberg.com/news/articles/2015-07-01/greece-saga-thwarts-german-five-year-debt-sale-as-demand-slumps", "ord_in_thread": 0, "title": "Greece Saga Thwarts German Five-Year Debt Sale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Germany’s sale of five-year sovereign debt couldn’t have come at a worse time.\nJust as the nation auctioned notes due in October 2020, news broke that Greece’s government was prepared to accept proposals from its creditors to release more funding. German bond yields climbed in the secondary market and the nation failed to get enough bids to cover its 5 billion-euro ($5.6 billion) sales goal at the sale. Germany allotted 3.21 billion euros of the securities.\n“The volatility was really quite high at the time of the auction, which is responsible for these auction metrics,” said Christoph Rieger, head of fixed-income strategy at Commerzbank AG in Frankfurt. “The market is tired of this whole crisis and is still hoping and looking for a positive resolution. It’s hard to take any large risk positions in either direction. Most participants are just keeping very light exposure.”\n\\r The Bundesbank retained 35.9 percent of the notes auctioned, climbing from 20.3 percent at a sale last month. The average of the previous four auctions was about 18 percent. The securities were sold with an average yield of 0.17 percent, the highest since September.\nAccording to calculations by Gianluca Ziglio, executive director of fixed-income research at Sunrise Brokers LLP in London, this is the worst five-year auction of German debt ever.\n“German auction went surprisingly badly uncovered,” he said, measuring the actual bid-to-cover ratio, which gauges demand by comparing total bids with the amount of bonds on offer, at 0.66, and the ratio including securities retained by the Bundesbank at just 1.", "external_links": ["http://assets.bwbx.io/images/iFd9sp2YcwFo/v1/460x260.png\\"], "published": "2015-07-01T19:15:00.000+03:00", "crawled": "2015-07-01T15:17:13.000+03:00", "highlightTitle": ""}