{"organizations": [], "uuid": "efe0ef5a82de0aa2f0b15e0ababfdd22ec6d537b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/natural-gas-partners-announces-hiring-132900538.html", "country": "US", "title": "Natural Gas Partners Announces the Hiring of Patrick McWilliams as Managing Director", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Natural Gas Partners Announces the Hiring of Patrick McWilliams as Managing Director", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T16:29:00.000+03:00", "replies_count": 0, "uuid": "efe0ef5a82de0aa2f0b15e0ababfdd22ec6d537b"}, "author": "", "url": "https://uk.finance.yahoo.com/news/natural-gas-partners-announces-hiring-132900538.html", "ord_in_thread": 0, "title": "Natural Gas Partners Announces the Hiring of Patrick McWilliams as Managing Director", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Patrick McWilliams"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 28, 2015, 15:00 BST - UK Markets close in 1 hr 30 mins Natural Gas Partners Announces the Hiring of Patrick McWilliams as Managing Director Press Release : Natural Gas Partners – 31 minutes ago Related Content \nIRVING, Texas--(BUSINESS WIRE)-- \nNatural Gas Partners (“NGP”), a leading private equity firm in the natural resources industry, today announced that Patrick McWilliams will join the firm as a Managing Director in its Houston office effective immediately. \nMr. McWilliams was previously a Managing Director with JP Morgan Chase in its Houston office. He joined the firm in 2012 to launch its Middle Market Oil and Gas Finance (“MMOG”) platform, focused on providing debt capital and other financial services to private oil and gas companies. In his role Mr. McWilliams also covered top regional, energy-focused private equity firms. \nTony Weber, Managing Partner of NGP, commented, “We are delighted to welcome Patrick to the firm. Patrick brings a wealth of experience in advising and financing private equity backed companies in the energy industry. Over the years we have established a great relationship with Patrick and we have been impressed with the way he served his clients while building strong long-term relationships.” \nChris Carter, Managing Partner of NGP, added, “Over the past decade we have had the opportunity to work with Patrick as he helped finance many of our successful portfolio companies, including Hibernia Resources, Crimson Pipeline and Bravo Natural Resources. We have consistently benefited from Patrick’s understanding of the energy debt markets and have considered him a trusted advisor. We are excited to have Patrick join us and help lead our Houston office.” \nMr. McWilliams said, “I am thrilled to have the opportunity to be a part of the NGP franchise. I have long admired the firm and have always been impressed with the way NGP partners with management teams to build great businesses. I look forward to working with the professionals at NGP to continue to build upon one of the strongest franchises in the energy private equity industry.” \nAbout Natural Gas Partners \nFounded in 1988, Natural Gas Partners (“NGP”) is a family of private equity investment funds, with approximately $16.5 billion of cumulative equity commitments, organized to make investments in the natural resources sector. NGP is part of the investment platform of NGP Energy Capital Management, a premier investment franchise in the natural resources industry. In addition to NGP, NGP Energy Capital Management’s investment platform includes NGP Global Agribusiness Partners and NGP Energy Technology Partners. \nFor Information: www.naturalgaspartners.com or www.ngpenergycapital.com View source version on businesswire.com: http://www.businesswire.com/news/home/20150728006047/en/ Contact:", "external_links": [], "published": "2015-07-28T16:29:00.000+03:00", "crawled": "2015-07-28T17:01:30.515+03:00", "highlightTitle": ""}