{"organizations": [], "uuid": "0f946fb2483f64573bff5bff9182db77346906da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "", "site_section": "http://globenewswire.com//Rss/industry/8773/Consumer%20Finance", "section_title": "GlobeNewswire: Industry News on Consumer Finance", "url": "http://globenewswire.com/news-release/2015/07/29/756099/10143758/en/Credit-Acceptance-Announces-Second-Quarter-2015-Earnings.html?f=22&fvtc=3&fvtv=8773", "country": "US", "title": "Credit Acceptance Announces Second Quarter 2015 Earnings", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Credit Acceptance Announces Second Quarter 2015 Earnings", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T23:02:00.000+03:00", "replies_count": 0, "uuid": "0f946fb2483f64573bff5bff9182db77346906da"}, "author": "", "url": "http://globenewswire.com/news-release/2015/07/29/756099/10143758/en/Credit-Acceptance-Announces-Second-Quarter-2015-Earnings.html?f=22&fvtc=3&fvtv=8773", "ord_in_thread": 0, "title": "Credit Acceptance Announces Second Quarter 2015 Earnings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(3) Annualized \nFloating Yield Adjustment The purpose of this non-GAAP adjustment is to modify the calculation of our GAAP-based finance charge revenue so that favorable and unfavorable changes in expected cash flows from loans receivable are treated consistently. To make the adjustment understandable, we must first explain how GAAP requires us to account for finance charge revenue, our primary revenue source. The finance charge revenue we will recognize over the life of the loan equals the cash inflows from our loan portfolio less cash outflows to acquire the loans. Our GAAP finance charge revenue is based on estimates of future cash flows and is recognized on a level-yield basis over the estimated life of the loan. With the level-yield approach, the amount of finance charge revenue recognized from a loan in a given period, divided by the loan asset, is a constant percentage. Under GAAP, favorable changes in expected cash flows are treated as increases to the yield and are recognized over time, while unfavorable changes are recorded as a current period expense. The non-GAAP methodology that we use (the \"floating yield\" method) is identical to the GAAP approach except that, under the \"floating yield\" method, all changes in expected cash flows (both positive and negative) are treated as yield adjustments and therefore impact earnings over time. The GAAP treatment results in a lower carrying value of the loan receivable asset, but may result in either higher or lower earnings for any given period depending on the timing and amount of expected cash flow changes. We believe the floating yield adjustment provides a more accurate reflection of the performance of our business, since both favorable and unfavorable changes in estimated cash flows are treated consistently. Senior Notes Adjustment On January 22, 2014, we issued $300 million of 6.125% senior notes due 2021 (the \"2021 notes\") in a private offering exempt from registration under the Securities Act of 1933. On February 21, 2014, we used the net proceeds from the 2021 notes, together with borrowings under our revolving credit facilities, to redeem in full the $350.0 million outstanding principal amount of our 9.125% senior notes due 2017 (the \"2017 notes\"). The purpose of this non-GAAP adjustment is to modify our GAAP financial results to treat the issuance of the 2021 notes as a refinancing of the 2017 notes. Under GAAP, the redemption of the 2017 notes was considered an extinguishment of debt. For the quarter ended March 31, 2014, our GAAP financial results included a pre-tax loss on extinguishment of debt of $21.8 million and additional interest expense of $1.4 million as a result of the one month lag from issuance of the 2021 notes to the redemption of the 2017 notes, which collectively reduced consolidated net income by $14.6 million or $0.62 per diluted share. Under our non-GAAP approach, the loss on extinguishment of debt and additional interest expense that was recognized for GAAP purposes for the quarter ended March 31, 2014 was deferred as a debt issuance cost and is being recognized ratably as interest expense over the term of the 2021 notes. In addition, for adjusted average capital purposes, the impact of additional outstanding debt related to the one month lag from the issuance of the 2021 notes to the redemptions of the 2017 notes was deferred and is being recognized ratably over the term of the 2021 notes. We believe the senior notes adjustment provides a more accurate reflection of the performance of our business, since we are recognizing the costs incurred with this transaction in a manner consistent with how we recognize the costs incurred when we periodically refinance our other debt facilities. \nCautionary Statement Regarding Forward-Looking Information We claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995 for all of our forward-looking statements. Statements in this release that are not historical facts, such as those using terms like \"may,\" \"will,\" \"should,\" \"believe,\" \"expect,\" \"anticipate,\" \"assume,\" \"forecast,\" \"estimate,\" \"intend,\" \"plan,\" \"target\" and those regarding our future results, plans and objectives, are \"forward-looking statements\" within the meaning of the federal securities laws. These forward-looking statements represent our outlook only as of the date of this release. Actual results could differ materially from these forward-looking statements since the statements are based on our current expectations, which are subject to risks and uncertainties. Factors that might cause such a difference include, but are not limited to, the factors set forth in Item 1A to our Form 10-K for the year ended December 31, 2014, filed with the Securities and Exchange Commission on February 12, 2015, other risk factors discussed herein or listed from time to time in our reports filed with the Securities and Exchange Commission and the following: Our inability to accurately forecast and estimate the amount and timing of future collections could have a material adverse effect on results of operations. We may be unable to execute our business strategy due to current economic conditions. We may be unable to continue to access or renew funding sources and obtain capital needed to maintain and grow our business. The terms of our debt limit how we conduct our business. A violation of the terms of our asset-backed secured financing facilities or revolving secured warehouse facilities could have a materially adverse impact on our operations. The conditions of the U.S. and international capital markets may adversely affect lenders with which we have relationships, causing us to incur additional costs and reducing our sources of liquidity, which may adversely affect our financial position, liquidity and results of operations. Our substantial debt could negatively impact our business, prevent us from satisfying our debt obligations and adversely affect our financial condition. Due to competition from traditional financing sources and non-traditional lenders, we may not be able to compete successfully. We may not be able to generate sufficient cash flows to service our outstanding debt and fund operations and may be forced to take other actions to satisfy our obligations under such debt. Interest rate fluctuations may adversely affect our borrowing costs, profitability and liquidity. Reduction in our credit rating could increase the cost of our funding from, and restrict our access to, the capital markets and adversely affect our liquidity, financial condition and results of operations. We may incur substantially more debt and other liabilities. This could exacerbate further the risks associated with our current debt levels. The regulation to which we are or may become subject could result in a material adverse effect on our business. Adverse changes in economic conditions, the automobile or finance industries, or the non-prime consumer market could adversely affect our financial position, liquidity and results of operations, the ability of key vendors that we depend on to supply us with services, and our ability to enter into future financing transactions. Litigation we are involved in from time to time may adversely affect our financial condition, results of operations and cash flows. Changes in tax laws and the resolution of uncertain income tax matters could have a material adverse effect on our results of operations and cash flows from operations. Our dependence on technology could have a material adverse effect on our business. Our use of electronic contracts could impact our ability to perfect our ownership or security interest in Consumer Loans. Reliance on third parties to administer our ancillary product offerings could adversely affect our business and financial results. We are dependent on our senior management and the loss of any of these individuals or an inability to hire additional team members could adversely affect our ability to operate profitably. Our reputation is a key asset to our business, and our business may be affected by how we are perceived in the marketplace. The concentration of our dealers in several states could adversely affect us. Failure to properly safeguard confidential consumer and team member information could subject us to liability, decrease our profitability and damage our reputation. A small number of our shareholders have the ability to significantly influence matters requiring shareholder approval and such shareholders have interests which may conflict with the interests of our other security holders. Reliance on our outsourced business functions could adversely affect our business. Natural disasters, acts of war, terrorist attacks and threats or the escalation of military activity in response to these attacks or otherwise may negatively affect our business, financial condition and results of operations. Other factors not currently anticipated by management may also materially and adversely affect our results of operations. We do not undertake, and expressly disclaim any obligation, to update or alter our statements whether as a result of new information, future events or otherwise, except as required by applicable law. Description of Credit Acceptance Corporation Since 1972, Credit Acceptance has offered automobile dealers financing programs that enable them to sell vehicles to consumers, regardless of their credit history. Our financing programs are offered through a nationwide network of automobile dealers who benefit from sales of vehicles to consumers who otherwise could not obtain financing; from repeat and referral sales generated by these same customers; and from sales to customers responding to advertisements for our product, but who actually end up qualifying for traditional financing. Without our financing programs, consumers are often unable to purchase a vehicle or they purchase an unreliable one. Further, as we report to the three national credit reporting agencies, an important ancillary benefit of our programs is that we provide a significant number of our consumers with an opportunity to improve their lives by improving their credit score and move on to more traditional sources of financing. Credit Acceptance is publicly traded on the NASDAQ under the symbol CACC. For more information, visit creditacceptance.com. CREDIT ACCEPTANCE CORPORATION", "external_links": [], "published": "2015-07-29T23:02:00.000+03:00", "crawled": "2015-07-30T12:53:29.876+03:00", "highlightTitle": ""}