{"organizations": [], "uuid": "bd9558f5d99d17e8b9c65e3a7ac4fdb71584d850", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/2/b/v/d/8/image.related.afrArticleLead.620x365.giev09.png/1437125636697.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/brand/chanticleer/history-shows-the-australian-sharemarket-is-undervalued-20150717-giev09", "country": "AU", "title": "History shows the Australian sharemarket is undervalued", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "History shows the Australian sharemarket is undervalued | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T16:56:00.000+03:00", "replies_count": 0, "uuid": "bd9558f5d99d17e8b9c65e3a7ac4fdb71584d850"}, "author": "Tony Boyd", "url": "http://www.afr.com/brand/chanticleer/history-shows-the-australian-sharemarket-is-undervalued-20150717-giev09", "ord_in_thread": 0, "title": "History shows the Australian sharemarket is undervalued", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michel O'Sullivan Share on twitter by Tony Boyd\nIt is well known that past performance is no guarantee of future returns but analysis of the share market over the past 20 years suggests share prices are undervalued.\nMark Hancock, an actuary who runs Precept Investment Actuaries, says his 20 year analysis of the S&P ASX200 up to June 30, 2015 found that the average annual long run return on a pre-tax basis was 9.6 per cent a year, excluding franking and 11.1 per cent including estimated franked dividends.\n\"This return of 9.6 per cent exceeded the average cash rate applicable over the last 20 years of 4.9 per cent a year which meant that the Australian sharemarket outperformed cash by about 4.5 per cent a year, excluding any benefit from franking credits.\nPrecept said the average market return was 9.7 per cent during the last five year period from June 30, 2010 to June 30, 2015.\n\"We estimate that about 50 per cent of share market returns over the last 20 years have been sourced from dividends and associated franking credits, measured on a pre-tax basis,\" Hancock wrote in the report.\n\"Actual after tax returns vary depending on each investor's tax status. This highlights the importance of dividends and franking as a source of investor return.\"\nHancock says there appear to be two pieces of evidence that suggests the Australian market is relatively undervalued.\n\"First, using a mean reversion model and over 20 years of data we calculate that at June 30, 2015, the S&P ASX200 appears 12 per cent below its estimated long term trend value of 6,250 and currently remains at the lower end of the forecast trading range,\" he says.\n \"Second, given the significant depreciation of the Australian dollar we consider the Australian sharemarket currently appears to be relatively more undervalued in US dollar terms than in Australian dollar terms.\"\nHancock estimates that about a quarter of earnings before interest and tax in Australia come from overseas. That suggests that Australian corporations should be four to five per cent more valuable now than they were before the depreciation in the currency.\nHancock says his analysis takes a different tack to those of most equity strategists because he removes the distortions caused by the \"exponential drift created by the compound interest.\nHe says the equity prices are computed on a natural logarithm scale and fitted using linear regression.\n\"This regression suggests a long-term share price growth rate of approximately 5.3 per cent annually, excluding dividends and franking,\" his report says.\n\"The model assumes that ultimately share price growth is consistent over long periods of time and across economic and market cycles.\n\"The model makes no allowance for nominal returns potentially dropping due to a decline in inflation, which could tend to overstate fair value. However there is no compelling evidence that ex-post returns have declined in recent years.\"\nWhen Hancock did a similar analysis in the three years leading up to the global financial crisis, the results showed the share market traded above fair value.\n\"Since the GFC, the market has generally been trading below the long term trend value,\" he says.\nThe Precept analysis shows that $1000 invested in Australian shares 20 years ago on June 30, 1995 would be worth $6266 today excluding franking credits and assuming all dividends were reinvested.\nHancock warns that his analysis \"should not be read to be indicative of how the share market or other asset classes may perform in any future periods including the next 12 months, 5 years, 10 years or even 20 years.\"\nOver and over and over and…..\nWhen it comes to Australia's retirement incomes policy, the post retirement part is the missing link that few politicians want to touch.\nThe Productivity Commission confirmed this in its 273-page two volume report released this month called Superannuation Policy for Post-Retirement.\nA chart in volume one on page 26 shows that out of the eight key changes to the superannuation system since 1992 only one related to post retirement. That was the increase in the preservation age from 55 to 60.\nAssistant treasurer Josh Frydenberg has an opportunity to change this wilful neglect of the post retirement phase when he responds to the Financial System Inquiry.\nThe inquiry chaired by David Murray found that there were tax, regulatory and other impediments to developing innovative retirement income products. The inquiry found that the provision of a wider range of retirement income products would better meet the varied needs of retirees.\nIf Frydenberg recommends change he will break a pattern of constant reviews of post retirement income policies.\nThose in the industry have responded to 14 separate government processes over the past seven years: in 2008 there was the Henry Review terms of reference plus the second and third submissions; in 2009 and 2010 the Cooper Review called for first and second submissions; in 2011 there was the tax reform statement of reform priorities; in 2014 the Murray Inquiry called for initial submissions plus it asked for a submission on the review of retirement income stream regulation as well as a second submission in response to the interim report; in 2015 there has been Treasury's targeted consultation for review of retirement income stream regulation, an initial submission to the Tax White Paper plus extended submissions on retirement incomes as per agreement with the Greens; and finally the second targeted consultation for review of retirement income stream regulation.\nSmoking hypocrisy\nThe law exempting the gaming areas in James Packer's Barangaroo casino from the Smoke-free Environment Act 2000 stands out like a sore thumb given developments in NSW and overseas.\nMacau, which is the largest gaming market in the world, introduced a mass market smoking ban in October last year. But after it caused monthly gaming revenues to slump by about 30 per cent the ban is being reviewed by the special administrative region's government.\nIn NSW, smoking is banned inside buildings and within 4 metres of a pedestrian access point to a building. From July 6 commercial outdoor dining areas were made smoke free.\nTony Boyd\nTwitter: @TonyBoydAFR\nTony.boyd@afr.com.au", "external_links": ["https://twitter.com/TonyBoydAFR"], "published": "2015-07-17T16:56:00.000+03:00", "crawled": "2015-07-17T14:03:35.000+03:00", "highlightTitle": ""}