{"organizations": [], "uuid": "8ff90804e1923690747f65fa8e7f199739f8c732", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/1/8/o/r/y/image.related.afrArticleLead.620x365.gim8x4.png/1438078237056.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/asx-dances-to-beat-of-chinas-drum-20150728-gim8x4", "country": "AU", "title": "ASX dances to beat of China's drum", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "ASX dances to beat of China's drum | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T16:39:00.000+03:00", "replies_count": 0, "uuid": "8ff90804e1923690747f65fa8e7f199739f8c732"}, "author": "afr.com", "url": "http://www.afr.com/markets/asx-dances-to-beat-of-chinas-drum-20150728-gim8x4", "ord_in_thread": 0, "title": "ASX dances to beat of China's drum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China is under weighted globally in investment portfolios, according to Andrew Clifford of Platinum Asset Management. Reuters by Vesna Poljak Matthew Smith Volatility in China's equity markets spilled over into Australian stocks that slid in early trade chasing Chinese shares down as much as 1 per cent before staging a firm recovery locally on talk of China's state fund buying to support Shanghai and Shenzhen.\nThe turn of events in Asia's markets follows the worst day for Chinese stocks since 2007 on Monday, when Shanghai-listed shares shed 8.5 per cent . Losses were pared to less than 2 per cent on Tuesday in what has become the world's most watched equity market.\nShanghai was down as much as 5.05 per cent before reported fresh interventionist measures, believed to include liquidity injections, settled nerves. The events of the past 48 hours underscore that sentiment towards China's sharemarket is still fragile and that officials have not yet succeeded in controlling the sell-off, which began last month.\nIn Australia, the S&P/ASX 200 Index closed 0.1 per cent lower on Tuesday after dipping as much as 1.06 per cent earlier in the day. On Monday, Australian stocks shrugged off the savage selling in China convincingly, closing 0.4 per cent ahead .\nAFR Graphic The Shanghai Composite Index is still 68 per cent higher over the past 12 months.\nThe correction in China has rattled financial markets and asset prices but China bulls are unmoved. One of the best known such investors is Andrew Clifford, the chief investment officer of Sydney-based Platinum Asset Management.\n\"It's one part of the world where in the long term, [China] still has strong growth prospects and we are able to buy at a reasonable price,\" Mr Clifford said.\n\"The message we are taking out to people with respect to the China part of the story is there are some known negatives: the place has slowed down. It's not going to slow down, it already has slowed down and we can see that in the iron ore price.\n \"There will be bad debts and they're yet to show up. And indeed, we wouldn't be recommending investing in cement, for example.\"\nBrief trajectory tracking The Australian dollar also tracked the trajectory of Shanghai's market briefly, declining to US72.57¢ when Chinese futures indicated losses of around 4 per cent were ahead.\nThe currency recovered quickly to above US73¢ and was fetching US73.13¢ heading into the start of European trading .\nLong-term China observer Mark Wills, from asset manager State Street Global Advisers, said that the origins of the China equity market rout can be traced to the third plenum released in 2013, the most significant document to come out of boom-era China.\n'Spider's web of reform' This is where policymakers outlined their commitment to state-owned enterprise reform through the framework of Communist rule.\n\"It's like a spider's web of reform and you can't just move one bit without moving another bit,\" explained Mr Wills of the interconnectedness of the reform agenda and the equity market crash. This saw risk capital encouraged to move out of property and into shares.\n\"It's an annoyance and a sideshow rather than a major sideshow,\" he said of the sell-off, arguing that policymakers would probably consider the headlines and foreign interest in China's falling markets undesirable.\nHe is of the view that the Chinese economy will be untroubled by the sharemarket crash because equity investing is such a small component of financial markets activity.\nAs a crude guide, of the estimated 30 million new trading accounts that have been opened in China, \"Let's assume the average person has two. That's only 15 million people,\" Mr Wills said.\nMore importantly, speculative activity in the sharemarket was preferable over speculative behaviour in the property market, he emphasised.\n\"If you think about all the major central banks around the world, they don't give a hoot about the equity market.\"\nMr Clifford of Platinum, which on Tuesday embarked on raising up to $600 million for a new listed investment company that will have a focus on China and India , said that global fund managers were grossly underweight of China in their share portfolios.\n\"What people are missing is they are treating Asia like it's a side show. The fact is the market caps of Chinese companies is about 13 to 14 per cent of the global investment universe. But because of the index-led investment philosophy Chinese companies are only 1 or 2 per cent of global portfolios.\n\"They're under represented based on the size of the opportunity they present.\"\nEarlier this year MSCI, which administers global indices, declined to admit China's A-shares (shares traded in China priced in renminbi) into its regional benchmarks. MSCI left the door open to future entry if market access can be improved.\n\"While we all like to say we don't know what's going on in the China A-shares market, we don't really know what's going on the in S&P/ASX 500 either, that's just a pretense we all live under,\" Mr Clifford said.", "external_links": [], "published": "2015-07-28T16:39:00.000+03:00", "crawled": "2015-07-28T14:08:05.922+03:00", "highlightTitle": ""}