{"organizations": [], "uuid": "866499bd19ceeab988608ea510788b00bd918d5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/glc4frq1dx_fake.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/627417/1/agi-calls-for-fight-against-counterfeiting.html", "country": "US", "title": "AGI Calls For Fight Against Counterfeiting", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "AGI Calls For Fight Against Counterfeiting", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T14:11:00.000+03:00", "replies_count": 0, "uuid": "866499bd19ceeab988608ea510788b00bd918d5e"}, "author": "", "url": "http://www.modernghana.com/news/627417/1/agi-calls-for-fight-against-counterfeiting.html", "ord_in_thread": 0, "title": "AGI Calls For Fight Against Counterfeiting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  3 July 2015 12:11 CET AGI Calls For Fight Against Counterfeiting By Daily Guide \nThe Association of Ghana Industries (AGI) has called on government and private institutions to make conscious effort to tackle counterfeiting in the country. \nAccording to the Association, counterfeiting impacts negatively on manufacturing, industry and the competitiveness of the economy, hence the need to curb it. \nJames Asare-Adjei, President of AGI, who was speaking at the World Anti-counterfeiting Day seminar held in Accra, said counterfeiting is increasingly becoming complex, especially with modern-day technology. \nHe said counterfeiting is estimated to account for not less than 10 percent of trade in Africa and reduces governments' revenue and causes serious fiscal drain in most economies. \nMr. Asare-Adjei said counterfeiting negatively affects government's revenue, stating that 'many operators of counterfeit products want to evade taxes, and these are things that the AGI thinks should be highlighted so that with concerted effort, we can be able to fight against it.' \nHe said fighting counterfeiting must be a long-term and persistent goal, adding that the menace poses serious health and safety risks to consumers of all categories of goods. \n'We are an import-oriented economy and we are already disadvantaged by the influx of imports into our economy compared to other economies. \n'This puts much pressure on our regulatory bodies to scale up efforts towards fighting counterfeiting, smuggling and the ill-effects of this illicit trade on consumers,' Mr. Asare-Adjei said. \n'Admittedly, it is expensive to fight counterfeiting and we have a difficult task to sustain the fight against counterfeit without resources. \n'But I believe we can strategize as a country by identifying the major sources and entry points for counterfeited products and those at risk of counterfeiting and piracy. \n'The paradox of the situation is that the less we commit to this fight, the more the counterfeiters try to outpace enforcement,' he said. \nBy Cephas Larbi", "external_links": [], "published": "2015-07-03T14:11:00.000+03:00", "crawled": "2015-07-03T14:07:05.000+03:00", "highlightTitle": ""}