{"organizations": [], "uuid": "7542450d5e9715ca1fdd17ebec72c0e1d736fb51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/15/australia-economy-consumersentiment-idUSS9N0ZF00I20150715", "country": "US", "title": "Australia consumer confidence hit by global gloom-survey", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Australia consumer confidence hit by global gloom-survey | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T04:31:00.000+03:00", "replies_count": 0, "uuid": "7542450d5e9715ca1fdd17ebec72c0e1d736fb51"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/15/australia-economy-consumersentiment-idUSS9N0ZF00I20150715", "ord_in_thread": 0, "title": "Australia consumer confidence hit by global gloom-survey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY, July 15 A measure of Australian consumer sentiment fell for a second straight month in July with households seemingly spooked by gloomy media coverage of events in China and Greece, underlying how volatile the mood has become.\nThe survey of 1,200 people by the Melbourne Institute and Westpac Bank showed its index of consumer sentiment fell a seasonally adjusted 3.2 percent in July, from June.\nThe index reading of 92.2 was 2.8 percent lower than in June 2014 and the weakest since December.\nThe drop has more than wiped out the May bounce that followed a cut in interest rates to record lows and a government budget that included a surprise tax break for small businesses.\nWestpac chief economist, Bill Evans, attributed the latest decline to economic instability in Europe and \"sensational coverage\" of the recent slump in Chinese shares.\nWith shares in China now having steadied and progress made on a debt deal for Greece, it was likely that sentiment could bounce back in coming weeks, said Evans.\nIndeed, it was notable that a survey of businesses out this week showed no such concerns with confidence at its highest in nearly two years as sales and profits improved markedly in June.\n\"Further evidence that this headline impact from overseas news is unlikely to be sustained can be found in the response of households to the outlook for the unemployment rate,\" said Evans, noting that fears of unemployment had declined.\nThe details of the survey also proved a very mixed bag. While the measure of family finances compared to a year ago dived 10.4 percent, the outlook for the next 12 months actually improved by 6.9 percent.\nThe survey's measure of economic conditions for the next 12 months dropped 10.4 percent, while that for the next 5 years eased 4.4 percent.\nYet the index for whether it was a good time to buy a major household item edged up 0.2 percent.\nRespondents were also torn on the outlook for housing. While the index for whether it was a good time to buy a home tumbled 16.7 percent in the month, consumers still expected house prices to continue to rise. (Reporting by Wayne Cole ; Editing by Shri Navaratnam)", "external_links": [], "published": "2015-07-15T04:31:00.000+03:00", "crawled": "2015-07-15T03:46:21.000+03:00", "highlightTitle": ""}