{"organizations": ["Microsoft", "AAPL"], "uuid": "e471d1531d992b837a498b843ee41b9f23ebfe56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-construction-materials/?format=rss", "section_title": "Construction & Materials News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/treasuries-prices-rise-disappointing-u-144948394.html", "country": "GB", "title": "TREASURIES-Prices rise after disappointing U.S. corporate reports", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "TREASURIES-Prices rise after disappointing U.S. corporate reports", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T17:49:00.000+03:00", "replies_count": 0, "uuid": "e471d1531d992b837a498b843ee41b9f23ebfe56"}, "author": "", "url": "https://uk.finance.yahoo.com/news/treasuries-prices-rise-disappointing-u-144948394.html", "ord_in_thread": 0, "title": "TREASURIES-Prices rise after disappointing U.S. corporate reports", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Apple (NasdaqGS: AAPL - news ) , Microsoft (NasdaqGS: MSFT - news ) corporate reports spur safety bid \n* 10-, 30-year yields hit nearly two-week lows \n* Uncertainty over next week's Fed statement caps gains \nBy Sam Forgione \nNEW YORK, July 22 (Reuters) - Benchmark and long-dated Treasury yields hit their lowest levels in nearly two weeks on Wednesday after another round of disappointing U.S. corporate reports drove safe-haven buying, while uncertainty ahead of next week's Federal Reserve meeting capped gains. \nU.S. shares edged lower after results from technology giants including Apple and Microsoft. Yields on benchmark 10-year notes and 30-year bonds hit their lowest levels since July 9 of 2.31 percent and 3.04 percent, respectively. \n\"The weakness in the stock market over the last two days has helped push Treasuries prices higher,\" said Shyam Rajan, U.S. rates strategist at Bank of America Merrill Lynch in New York. He also said corporate issuance has been slightly lower than expected. Corporate supply typically weighs on Treasuries prices. \nAnalysts said traders' caution ahead of next week's Fed meeting limited price gains, since traders will be watching the central bank's statement closely for signs of whether the Fed will hike rates in September or later. Rate hikes are expected to hurt bond prices, which move inversely to yields. \n\"We're looking at the Fed next week. That's keeping a lot of people ambiguous and not wanting to take that big a position one way or another,\" said Robbert van Batenburg, director of market strategy at Societe Generale (Paris: FR0000130809 - news ) in New York. \n\"If the Fed is still hell-bent on hiking rates in September, it's probably going to shine through the statement,\" van Batenburg said. \nFed Chair Janet Yellen repeated the view last week that the central bank would likely raise rates this year. \nTreasuries prices advanced despite data showing home resales rose in June to their highest level in nearly 8-1/2 years. Societe Generale's van Batenburg said weakness in oil prices helped boost Treasuries prices despite the housing data, since the weak oil prices signaled lower inflation. Inflation tends to erode the value of bond interest rate payouts. \nBenchmark 10-year Treasury notes were last up 7/32 in price to yield 2.32 percent, from a yield of 2.34 percent late Tuesday. U.S. 30-year yields were last up 21/32 to yield 3.05 percent, from a yield of 3.08 percent late Tuesday. \nPrices on three-year notes, meanwhile, were little changed to yield 1.06 percent. On Wall Street, the benchmark S&P 500 stock index was last down 0.12 percent, while the Dow Jones industrial average was off 0.14 percent. The Nasdaq Composite was down 0.64 percent. (Reporting by Sam Forgione; Editing by Meredith Mazzilli)", "external_links": [], "published": "2015-07-22T17:49:00.000+03:00", "crawled": "2015-07-22T18:43:39.464+03:00", "highlightTitle": ""}