{"organizations": [], "uuid": "85322655d6c75ae433e30bc1167f2a6b15636438", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/why-bp-plc-truly-compelling-090049649.html", "country": "GB", "title": "Here’s Why BP plc Is A Truly Compelling Buy Right Now", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Here’s Why BP plc Is A Truly Compelling Buy Right Now", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T12:00:00.000+03:00", "replies_count": 0, "uuid": "85322655d6c75ae433e30bc1167f2a6b15636438"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-bp-plc-truly-compelling-090049649.html", "ord_in_thread": 0, "title": "Here’s Why BP plc Is A Truly Compelling Buy Right Now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Jul 6, 2015, 10:46 BST - UK Markets close in 5 hrs 44 mins Here’s Why BP plc Is A Truly Compelling Buy Right Now By Alessandro Pasetti | Fool.co.uk – 45 minutes ago 433.55 -0.8500 \nHere's why buying BP (LSE: BP) at 431p a share today could be one of your best investment decisions ever -- particularly if you are after a balanced mix of growth and yield. \nEarnings Per Share \nBP is expected to report earnings per share (EPS) of $0.37, $0.52, $0.63 over the next three years, which says a lot about its growth potential, and implies forward earnings multiples of 18x, 12.9x and 10.6x in 2105, 2016 and 2017, respectively, on a recurring basis. \nThis is based on a constant number of shares outstanding, and net income rising from $7.7bn in 2015 to $12bn in 2017, which is a realistic economic performance assuming BP 's net margin stands at 3.5% over the period -- a level of net profitability after taxes that would be consistent with its normalised trailing figures. \nBetween 2014, when BP reported basic and diluted EPS at $0.20, and 2017, EPS from core operations will very likely grow at 85%, 41% and 21% annually, delivering a declining growth rate over the period. \nHere's where the opportunity lies. \nDoes BP Actually Trade In Bargain Territory? \nIn the good years, BT's net margin was much higher at 6.7%/6.9%, and now Brent prices are more likely to rise than to fall from $60 a barrel. \nFurthermore, 2014 impairment and losses on the sale of businesses and fixed assets stood at $8.9bn -- that's a multi-year high. \nCurrency risk looks manageable, too. \nI won't bore you with the math behind the net present value estimates for cash flows, but under a base-case scenario, a small rise in BP's profitability could render its shares much cheaper than forward trading multiples suggest -- some 20% to 30% cheaper! \nFree Cash Flow & Divvy \nBased on BP's reduced capex projections, its free-cash-flow (FCF) yield is likely to hover around 4% and 6% in 2015, for an implied 2015 FCF of between $4.9bn and $7.3bn, which is a rather realistic FCF target range -- and indicates that its dividend policy is conservative in spite of a 5.9% forward yield. \nIf anything, such an attractive yield signals that BP trades well below fair value. \nFinally, the oil spill. \n\" Drawing a line in the sand on Macondo ,\" was the subject of an email from a big commodity house last week. \nThere's nothing more to fear on this front following the announcement that BP had agreed to settle for up to $18.7bn, with payments spread over 18 years, while currency risk still worries me a bit (BP reports in US dollars but has worldwide operations), but should not bring any particular surprise over the next 18 months. \nObviously, BP is also a bet on rising prices for the black gold. \nIn its Q1 results on 28 April, BP noted that \"o il and gas prices in the quarter were sharply lower than a year earlier. Brent crude averaged $54 per barrel compared with $108 in 1Q 2014. This was the lowest quarterly average Brent price since 1Q 2009. \" Interim 2015 results will be released on 28 July, and you may well be tempted to snap up its shares before then. \nIf rising EPS and stellar dividends are are the backbone of your investment strategy, I strongly recommend a report from our Motley Fool analysts . \nUnlike BP, many of the stocks mentioned in this free report are defensive and they tend to be much less cyclical than those of major oil producers. Similarly, however, these stocks could be cheaper than their forward trading multiples suggest. \nOutstanding returns over the long-term can be achieved, and this free report will help you assess the risk of several value candidates only in a few clicks! \nAlessandro Pasetti has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-06T12:00:00.000+03:00", "crawled": "2015-07-06T12:51:07.000+03:00", "highlightTitle": ""}