{"organizations": ["Valeant Pharmaceuticals International, Inc", "Zacks Ranks", "Novartis", "Novartis NVS", "Amgen Inc", "Alcon", "AMGN", "Zacks Consensus Estimate", "Exelon", "Medicines Company MDCO"], "uuid": "391cc0444b87d0f93d21dd9f7e5d75ebc843f7df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=NVS", "section_title": "Yahoo! Finance: NVS News", "url": "http://finance.yahoo.com/news/novartis-nvs-disappoint-q2-earnings-175505138.html", "country": "US", "title": "Will Novartis (NVS) Disappoint Q2 Earnings due to Generics? - Analyst Blog", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Will Novartis (NVS) Disappoint Q2 Earnings due to Generics? - Analyst Blog", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T20:55:00.000+03:00", "replies_count": 0, "uuid": "391cc0444b87d0f93d21dd9f7e5d75ebc843f7df"}, "author": "", "url": "http://finance.yahoo.com/news/novartis-nvs-disappoint-q2-earnings-175505138.html", "ord_in_thread": 0, "title": "Will Novartis (NVS) Disappoint Q2 Earnings due to Generics? - Analyst Blog", "locations": ["U.S.", "Galvus", "Tasigna", "ESP"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gilenya", "Jakavi"], "text": "Content preferences Done Novartis NVS, one of the leading players in the health care sector, will report second-quarter 2015 results on Jul 21, 2015. Novartis’ track record was mixed in the last four trailing quarters. The company beat estimates in two of the last four trailing quarters with a positive average earnings surprise of 6.26%. Let’s see how things are shaping up for this announcement. Factors Influencing This Quarter The top line at Novartis is expected to be driven by key drugs including Gilenya, Afinitor, Tasigna, Galvus, Lucentis, Xolair, Jakavi and the chronic obstructive pulmonary disease portfolio. Net sales at the Alcon division are also expected to grow year over year, despite unimpressive performance by intraocular lenses, to be driven by strong sales of surgical and ophthalmic pharmaceuticals products. However, the loss of patent protection for some key drugs including Diovan, Exforge and Exelon in Novartis’ portfolio is concerning as these drugs will continue to face generic competition going forward. In addition, strengthening of the U.S. dollar against most currencies may cause foreign exchange fluctuation to affect sales negatively. Meanwhile, we expect investor focus to remain on the launch of the recently FDA-approved heart failure drug Entresto. What Our Model Indicates Our proven model does not conclusively show that Novartis will likely beat the Zacks Consensus Estimate in second-quarter 2015. That is because a stock needs to have both a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold) to be able to beat estimates. Unfortunately, this is not the case as you will see below. Zacks ESP : The Earnings ESP for Novartis stands at -2.50%, as the Most Accurate estimate currently is $1.17, while the Zacks Consensus Estimate is $1.20. Zacks Rank : Although Novartis’ Zacks Rank #3 increases the predictive power of ESP, we need a positive ESP to be confident of an earnings beat. We caution against stocks with Zacks Ranks #4 and #5 (Sell-rated stocks) going into the earnings announcement, especially when the company is seeing a negative estimate revision momentum. Stocks That Warrant a Look Here are some health care stocks that you may want to consider, as our model shows that these have the right combination of elements to post an earnings beat this quarter: The Medicines Company MDCO has an Earnings ESP of +125% and carries a Zacks Rank #2. It is scheduled to release second-quarter results on Jul 29. The Earnings ESP for Valeant Pharmaceuticals International, Inc. VRX is +0.41% and it carries a Zacks Rank #3. The company is scheduled to release second-quarter results on Jul 23. Amgen Inc. AMGN has an Earnings ESP of +1.65% and carries a Zacks Rank #3. It is scheduled to release second-quarter results on Jul 30. \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report >> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report", "external_links": [], "published": "2015-07-17T20:55:00.000+03:00", "crawled": "2015-07-18T00:26:51.000+03:00", "highlightTitle": ""}