{"organizations": [], "uuid": "77cab33825b25b67739a1481e6725812190a3620", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/b/k/i/f/image.related.articleLeadwide.620x349.gic929.png/1436929351678.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/comment-and-analysis/debt-forgiveness-is-the-missing-link-in-greeces-bailout-20150714-gic929.html", "country": "AU", "title": "Debt forgiveness is the missing link in Greece's bailout", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Debt forgiveness is the missing link in Greece's bailout", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "77cab33825b25b67739a1481e6725812190a3620"}, "author": "", "url": "http://www.smh.com.au/business/comment-and-analysis/debt-forgiveness-is-the-missing-link-in-greeces-bailout-20150714-gic929.html", "ord_in_thread": 0, "title": "Debt forgiveness is the missing link in Greece's bailout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Business Week: China counts\nBailout ball in Greece's court\nChina's share market turmoil explained\nGreek banks running out of cash\nGreek celebrations leave Germans fuming\nReplay video Return to video Video settings Please Log in to update your video settings\nMal Maiden: The vote is crucial With the IMF stating that Greece is in a tailspin and the EU not budging on debt forgiveness, the Greek parliament is set to vote on the new bailout.\nPT5M5S 620 349 Autoplay On Off Video feedback Video settings Australian market stages $30 billion relief rally The thing that is missing from the bailout deal that Greek Prime Minister Alexis Tsipras has to steer through Parliament is debt forgiveness. Without it, Greece cannot be rescued. Here's how it might emerge.\nIf Greece does what is being asked of it, it will deserve the break.\nWEDNESDAY NIGHT: Anti-EU protesters hold Greek flags in front of Parliament during a demonstration of about 500 people in Athens. Photo: YANNIS BEHRAKIS\nTsipras gets parliamentary approval for the deal he struck on Monday with German Chancellor Angela Merkel, French President Francois Hollande, other European leaders, the European Central Bank and the International Monetary Fund.\nAgreement in principle is required on Wednesday before bailout money flows, and the Greek Parliament must also pass laws that implement some of the bailout package's measures, including an expansion of Greece's goods and services tax, and an agreement to automatic spending cuts if deficit reduction targets are missed.\nTsipras' coalition does not unite behind the deal, which is tougher on Greece than the earlier one the government and then Greek voters rejected.\nGerman Chancellor Angela Merkel listens to questions during a news conference at the end of a euro zone leaders summit in Brussels. Photo: Reuters\nOpposition parties vote in favour of the deal, however, setting the bailout in motion, and laying the ground for the emergence of a new coalition government, and, probably, a new prime minister.\nLATER THIS WEEK: Talks between Greece, the ECB, the IMF and the European Commission about how the bailout will work in practice begin.\nEmergency funding from the ECB and money from Europe's special-purpose bailout fund enables Greek banks to re-open. Deposit withdrawal restrictions are eased but not removed until the risk of a deposit run is gone.\nGreek banks begin advancing funds to businesses again, reversing a decline in Greece's economic output caused by their closure that increased Greece's debt-to-GDP ratio from an already dangerous 175 per cent.\nJULY 20: The European Commission swings €3 billion to Greece from Europe's bailout fund, enabling Greece to meet a repayment to the ECB that would have been calamitous if missed.\nJULY 22: The Greek Parliament meets Europe's deadline for the implementation of the rest of the conditions for the bailout package. They include the deregulation of protected industries including ferry transportation and manufacturing, tighter controls on pension payments, an extension of retail trading hours, and labour market reform.\nParliament also agrees to put Greece's privatisation program into the hands of an independent fund, overseen by the European Commission. This was a sticking point in the talks – the annexation of Greek sovereignty for some – but it follows Greece's failure to undertake privatisations itself, despite committing to do so in 2012 when its first bailout was extended.\nThe 2012 renegotiation resulted in Greek government debt held by private sector banks and investors being written down by 50 per cent and passing to European governments, the IMF and the ECB. With the new privatisation fund in place, they are creditors in possession, in effect. The optimistic privatisation sale target is €50 billion euro: €12.5 billion euro will go to repay loans, €25 billion will cover Europe's recapitalisation of the Greek banking system, and €12.5 billion will be available to the Greek government.\nLATER THIS YEAR: As Greece continues to implement the package, the missing link emerges. European leaders rejected Greece's request for a 30 per cent debt write-off in the bailout talks, suggesting only that terms for repayment could be extended if Greece does implement economic reform.\nNow, with Greek committed to the program, doubts about its willingness and ability to pay its way begin to dissolve. European leaders say for the first time that if Greece continues to stay the course, it might also get a debt write-down.\nGreece owes the equivalent of about $380 billion. Its gross domestic product was only about $US238 billion last year, and will be lower again this year. Excluding debt costs the government was close to balancing its budget last year, however. A 30 per cent debt write-off could set the stage for a sustained recovery.\nIt's a topic that would need to be carefully marketed to Europeans outside Greece. Greece's gain would be Europe's loss. A 30 per cent write-off would equal about 1.1 per cent of Europe's GDP. The main lenders are Germany, France, Italy and Spain, and they would be writing off about €31 billion, €23 billion, €21 billion and €14 billion respectively.\nWithout forgiveness Greece is doomed to remain buried by its debt and the cost of servicing it, however. Europe has to lighten the debt load if it wants to keep Greece in the European Union and the euro: and if Greece does what is being asked of it, it will deserve the break.", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-15T20:07:27.000+03:00", "highlightTitle": ""}