{"organizations": [], "uuid": "da290d961c767dd99185fbe98962485261d3fb91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/72", "section_title": "Artipot: Finance > Investing Articles", "url": "http://www.artipot.com/articles/1915089/how-much-do-you-need-to-invest-for-etf-in-401k.htm", "country": "US", "title": "How much do you need to invest for ETF in 401K (Matthew Stromberg)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "How much do you need to invest for ETF in 401K (Matthew Stromberg)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T10:03:00.000+03:00", "replies_count": 0, "uuid": "da290d961c767dd99185fbe98962485261d3fb91"}, "author": "", "url": "http://www.artipot.com/articles/1915089/how-much-do-you-need-to-invest-for-etf-in-401k.htm", "ord_in_thread": 0, "title": "How much do you need to invest for ETF in 401K (Matthew Stromberg)", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matthew Stromberg", "Harry Browne"], "text": "By Matthew Stromberg Jul 23, 2015 In the year 2009, U.S. stock markets witnessed crash and lost many of the investors. These investors withdrew out $66 billion from the stock market and invested the same in ETF market. ETFs are one of the most low cost and tax efficient mode for investment that now people are trusting on ETF more than the investment on stock. Now as ETF providers noticed that investments are getting increased each day so they are planning to make the investors contribute in their ETF in 401k plan.In case of adding ETF as your investment plan, there are some charges that you need to take care of. Some narrators such as Harry Browne have made this easy by explaining two ways through which you will be charged for investing in ETF.Asset Based FeeIf you have a record keeper for the maintenance of your ETF or some other similar items, then there is a chance that you may have to incur amount in the form of asset based fee. Whatever assets you are having in your plan, depending on it, the record keeper would plan up a cost that you may have to pay. This can be a way through which you may invest higher than needed on your ETF plan.It entirely depends on the asset that is there on the list, about how much asset fee you will be spending on the ETF investment that you make. Talk to your record keeper and he will be able to describe you in details about the asset fee that will be charged on the investment made. If you are not sure about the fee taken, you can also consult some other experts and also research and take help of the internet any time.Transaction Commissions per stockApart from the asset fee, the record keeper may also charge you for per transaction fee. This is the fee that is charged by your record keeper any time when you sell or purchase a share. Generally the record keeper debits the fee at the time when the transaction is made, but there may be other rules also depending upon the record keeper. Also some of the record keeper may offer some kind of discounts to the clients on the per transaction fee charged.If such charge is being charged, make sure that this type of charge is deducted only on any type of purchase of sale of share. There may be also times when the record keeper may charge high rate per transaction. For such details, obviously the record keeper will offer you a plan according to which the fees and charges will be deducted each time. So, before you start transactions, you should go through the plans of the record keeper to be aware of the various details.Thus, ETF is altogether a great addition to the 401k plan and hence considering it can be a real way to invest with low cost. There are though various charges that are imposed while you are investing in this plan, but these are much lesser in compared to other investment ideas. Also it is important that you get in touch with a good record keeper to have a comfortable investment in ETF. About the Author Harry Browne is a well know narrator and writer who has described a number of things about investment in ETF. The author in this article has described some important points about ETF in 401k plan. Rating:", "external_links": [], "published": "2015-07-23T10:03:00.000+03:00", "crawled": "2015-07-24T00:16:52.561+03:00", "highlightTitle": ""}