{"organizations": [], "uuid": "055ea405b0635d9e225d5a5169c53c72d77a5b12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/04/rbi-pti-T.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/bank-recapitalisation-govt-spending-can-help-growth-deutsche/98852", "country": "IE", "title": "Bank recapitalisation, govt spending can help growth: Deutsche", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Bank recapitalisation, govt spending can help growth: Deutsche | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T04:37:00.000+03:00", "replies_count": 0, "uuid": "055ea405b0635d9e225d5a5169c53c72d77a5b12"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/bank-recapitalisation-govt-spending-can-help-growth-deutsche/98852", "ord_in_thread": 0, "title": "Bank recapitalisation, govt spending can help growth: Deutsche", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More than monetary policy easing, government spending and bank recapitalisation are needed to help sustain the revival in growth which is currently tepid, says foreign brokerage Deutsche Bank Research.\n“… the burden cannot only be on monetary policy; a wide range of actions would have to lend support, starting from recapitalisation of the banking system to public sector expenditure programme to support economic activities,” the brokerage said in a note today.\nIt also said that with inflation being a concern, the space for the Reserve Bank to help revive growth by cutting interest rates is limited.\nPointing out to the findings of a recent survey by the Centre for Monitoring Indian Economy, the brokerage said on the stalled projects that there is a moderation in the investible amounts which are stuck but the number of projects stuck has gone up.\nThis points out that big-ticket project backlogs are slowly easing, resulting in a lower cost of stalled projects, while smaller projects are still struggling to take off, it said.\nThe cost of stalled projects decreased to Rs 79,300 crore at the end of June quarter as against Rs 1.1 trillion in the year ago period, it said, pointing to the CMIE findings.\nAccording to official data, projects worth Rs 19.5 trillion are stuck for want of clearances and funds.\nIt said the April-June period marked the fourth straight quarter of growth in announcement of new projects and the pick-up in investment intentions is good news.\nIt can be noted that the government has already hinted at putting in more money into banks beyond the budgetary allocation, which was Rs 7,000 crore.\nFinance Secretary Rajiv Mehrishi had last month said that the government might almost double the amount of recapitalisation to USD 3 billion.\nDue to high bad loans in the system, which may touch 10.5 per cent by March next as per RBI estimate, the amount of lendable funds comes down for banks, which in turn will impact growth revival.\nThe Budget has also made a strong case for shifting the focus of expenditure to capital-intensive one which will help the economy.\n 10, 2015 8:37 pm", "external_links": [], "published": "2015-07-11T04:37:00.000+03:00", "crawled": "2015-07-11T01:39:19.000+03:00", "highlightTitle": ""}