{"organizations": [], "uuid": "c0aded609ad024cf5096eb4eaac944e94d340e2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/socialsecurity_031815gn.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/248816-social-security-projected-to-hit-insolvency-by-2034", "country": "US", "title": "Social Security projected to hit insolvency by 2034", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Social Security projected to hit insolvency by 2034", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T20:36:00.000+03:00", "replies_count": 0, "uuid": "c0aded609ad024cf5096eb4eaac944e94d340e2a"}, "author": "dweaver@thehill.com (Rebecca Shabad)", "url": "http://thehill.com/policy/finance/248816-social-security-projected-to-hit-insolvency-by-2034", "ord_in_thread": 0, "title": "Social Security projected to hit insolvency by 2034", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Social Security projected to hit insolvency by 2034 Greg Nash By Rebecca Shabad - 07/22/15 01:36 PM EDT \nSocial Security and Medicare are inching slowly toward insolvency, according to annual trustees reports on the entitlement programs released Wednesday.Social Security’s retirement and disability trust funds, combined, are on track for insolvency in 2034 — one year later than the entitlement program’s trustees predicted one year ago. \nTreasury Secretary Jack Lew told reporters at a briefing that the funds are “secure today and will remain secure in the years to come,” but warned that they are also “facing challenges that need to be addressed” by Congress. ADVERTISEMENT Still, the trustees warned that the Social Security Disability Insurance Trust Fund could run dry by late 2016. If Congress does not act to close that shortfall, the fund would only be able to pay out 81 percent of benefits.The Medicare Hospital Insurance Trust Fund, meanwhile, is expected to be able to cover its obligations through 2030, the reports said. That’s 13 years later than what was projected before Congress passed ObamaCare.\nThe trustees reports are released only once a year, providing a glimpse of the financial health of the entitlement programs that budget experts warn are on an unsustainable path.Changing demographic trends, Lew said, are the driving force behind the insolvency projections. The baby boomers generation, the largest in U.S. history, is now reaching retirement age, he noted. \nCongress should act soon to address the imbalances, Lew and the other trustees urged at the briefing. \nThe other trustees are Labor Secretary Thomas Perez, Health and Human Services Secretary Sylvia Mathews Burwell, Acting Commissioner of Social Security Carolyn Colvin, Robert Reischauer and Charles Blahous III. “Lawmakers should take action sooner rather than later to address these structural shortfalls, so that the uncertainty now facing disability beneficiaries will not eventually be experienced by other programs’ participants,” they wrote in their report. \nThe most pressing issue for lawmakers is the disability fund, which will be underwater in the \"fourth quarter of 2016\" if Congress doesn’t take action, Colvin said. \nWhile the trustees did not provide a more exact date, the nonpartisan Congressional Budget Office recently predicted insolvency would be reached around the beginning of fiscal 2017, or October 2016. Nearly 11 million people received benefits in 2014 from the disability fund, Colvin said, and people who are not able to work depend on them. “Our DI beneficiaries deserve better than this,” Reischauer said, referring to disability insurance.President Obama proposed in his latest budget blueprint that Congress approve a small reallocation of the payroll tax for the next five years as a temporary fix for the disability fund. That move would extend the reserve depletion date by nearly 20 years, Colvin said. Democrats on Capitol Hill have called for reallocating the payroll tax, as Congress has done multiple times before, to put money into the disability fund. \n“Social Security Disability Insurance represents an essential lifeline for millions of Americans; Americans who worked hard, who paid into Social Security and now have a serious disability that prevents them from working,” House Minority Leader Nancy Pelosi (D-Calif.) said in a statement. \n“Congress must not allow the Trust Fund to be exhausted.” \nRepublicans, however, adopted new rules earlier this year that would make such a move more difficult. They say the crisis in the disability fund should force Obama and the Democrats to embrace major changes. \nSen. Orrin Hatch (R-Utah.), the chairman of the Senate Finance Committee, said the administration should bring together a bipartisan coalition to propose reforms to the entitlement programs. \n\"Sadly, we have yet to see such an effort,\" Hatch said in a statement. \"The President simply advocates kicking the can down the road to confront the impending disability trust fund depletion, by taking funds out of the retirement trust fund, which, itself, is headed toward depletion.\"All of the trustees emphasized that Congress should consider long-term solutions to shore up Social Security as a whole. Last year, more than 48 million people received retirement benefits, and nearly 54 million were covered under Medicare. \nSenior government officials attributed the slight improvement in the projections to higher average wage growth, higher than average mortality improvements and technical changes in projection methods. \nThe report was compiled with the assumption that Obama’s 2014 executive actions on immigration would be in effect by 2016, but a federal court order put those actions on hold in February, and they remain in legal limbo for now.Officials said the immigration factor accounted for a modest portion of overall improvement. \nAn official also noted there is a “better than 50 percent chance” that the Social Security cost of living adjustment (COLA) will not occur in 2016 due to inflation projections. Social Security benefits rose by 1.7 percent this year, which is well below pre-recession averages and the third consecutive year in which the COLA was less than 2 percent. When that COLA was announced, the National Committee to Preserve Social Security and Medicare said the tiny increase would only amount to about $20 a month for the average senior. \n— Last updated at 4:04 p.m.", "external_links": [], "published": "2015-07-22T20:36:00.000+03:00", "crawled": "2015-07-23T02:29:11.686+03:00", "highlightTitle": ""}