{"organizations": [], "uuid": "c8c5c8dc876596fc9e68314baee789f424c5be80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507272302.html", "country": "US", "title": "Kenya: GES - Kenyan Firm That Makes Solar-Powered Bikes", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: GES - Kenyan Firm That Makes Solar-Powered Bikes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T16:32:00.000+03:00", "replies_count": 0, "uuid": "c8c5c8dc876596fc9e68314baee789f424c5be80"}, "author": "", "url": "http://allafrica.com/stories/201507272302.html", "ord_in_thread": 0, "title": "Kenya: GES - Kenyan Firm That Makes Solar-Powered Bikes", "locations": ["U.S.", "Kenya", "Zambia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zambia: U.S. to Set Up Entrepreneurship Centre in Zambia \nCharles Ogingo, one of the co-founders of Pfoofy said plans are underway to install two ten-kilowatt charging stations, which will be used to charge 40 motorcycles. \n\"Electricity is not available to everyone. Therefore, solar energy is viable in Kenya. These solar-powered bikes can ride for 60 kilometers before switching to reserve fuel and their next recharge. Therefore, they can get fully charged batteries from the stations at only Sh200.\" \nUnlike Tesla Motors whose charging systems rely on electricity from the grid, Pfoofy Power is tapping solar energy to drive the revolution. The innovation has the potential to transform rural transport in ways never seen before. \nThe University of Nairobi Mechanical Engineering Graduate says a bodaboda is rented out for Sh300 per day and they have already trained nearly 40 motorbikes drivers. \nDAILY CHALLEGES \n\"I have seen the daily challenges that farmers face in bringing their produce to market. This cheaper, safer and more sustainable bodaboda is changing how people conduct business,\" he added. \nHe spoke Sunday during the just concluded 2015 Global Entrepreneurship Summit in Nairobi. The convening offered an avenue for Kenya's innovation to be put on global display. \nOther exhibitors included Mibawa Suppliers Limited who also have a weekly or monthly rechargeable household solar system using a scratch card similar to the airtime credit cards. Another was M-Kopa. \nThese are some of the projects that won last years Power Africa off-grid Energy Challenge grant to expand their businesses by President Obama's project called Power Africa. They each got about Sh10 million. \nPower Africa is an initiative that seeks to increase access to reliable, affordable, cleaner and more sustainable power in Sub-Saharan Africa. The first phase has been concluded and plans are underway for the next. \nThe Project's Regional Program Director Tom Coogan said Sunday: \"The funding allows these entrepreneurs to make better their ideas which were hindered due to lack of funds. Watch out for great products from these great Kenyans.\" \nTherefore, President Obama endorsement of the country's cutting-edge products such M-Pesa, Ushahidi did not come as a surprise to many during the opening of the Summit on Saturday, July 24. \nHe said: \"Here in Nairobi, startup incubators are nurturing new businesses every day, each with the potential to be the next great Kenyan innovation.\" Kenya \nEmbassava Sacco has struck out 314 matatus from its fleet of 733 vehicles saying it no longer owns them. see more » Copyright © 2015 The Nation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-27T16:32:00.000+03:00", "crawled": "2015-07-28T00:55:42.920+03:00", "highlightTitle": ""}