{"organizations": [], "uuid": "94b1fae3417497499c821063a8f43e046591013a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-07/Pro_757x468_1-1261040258_b326f44bb2_o_55b719f78529404520da7-362a-4f87-9602-44dc57653165.jpg", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business/Finance", "url": "http://www.menafn.com/1094293321/In-the-papers--FTSE100-sees-2015-gains-wiped-out?src=RSS", "country": "US", "title": "In the papers - FTSE100 sees 2015 gains wiped out", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "In the papers - FTSE100 sees 2015 gains wiped out | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "94b1fae3417497499c821063a8f43e046591013a"}, "author": "ProactiveInvestors  UK", "url": "http://www.menafn.com/1094293321/In-the-papers--FTSE100-sees-2015-gains-wiped-out?src=RSS", "ord_in_thread": 0, "title": "In the papers - FTSE100 sees 2015 gains wiped out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - ProactiveInvestors)The Times FTSE gains for the year wiped out after China shares collapse Britain's blue-chip stocks have lost all the ground made this year after a five-day rout capped by a catastrophic collapse in Chinese shares yesterday. The FTSE 100 has slumped almost 10 per cent from its record high in April of 7103.98 and is now 1 per cent below where it opened the year. Reckitt Benckiser beats first-half profit predictions with a bang A 'supercharged' first-half performance by Reckitt Benckiser has helped the maker of Cillit Bang and Nurofen to beat expectations and push up its guidance for the full year. The consumer goods group which also makes Durex condoms Dettol and Vanish stain remover said that its like-for-like revenue was up by 5 per cent at 4.3 billion during the first half. Basel lending rules 'threaten to derail growth in Britain' The chancellor has been warned that Britain's economic recovery could be derailed by a new credit squeeze on small companies if proposals from a Swiss committee that sets global lending standards are implemented. Groups including the Federation of Small Businesses and the British Bankers' Association have written to George Osborne urging him to intervene to lobby for a 'rethink' over plans that could significantly increase the cost of lending to businesses. The Telegraph UK investors see 2015 gains wiped out as markets fall Chinese stock markets lead a global retreat in share prices suffering their worst day since 2007 Investors in the shares of Britain's biggest companies have been nursing losses of more than 150bn over the past two months and are now in the red for the year after the FTSE 100 index dropped to its lowest level in 2015. The index of the largest London-listed companies has fallen 8.4pc since its record high in April. ECB warned to pump more money to save eurozone as Varoufakis denies hacking into Greek tax system The European Central Bank should stand ready to use the full force of its financial firepower to stop the eurozone from falling into renewed turmoil in the wake of the Greek crisis according to the International Monetary Fund. It its annual health-check of the eurozone the IMF made a controversial claim for the ECB to extend its unprecedented programme of quantitative easing beyond a provisional September 2016 end date. Barclays 'may have to raise 5bn to keep up with rivals' Barclays may have to ask investors for more money to bolster its capital levels just two years after last tapping shareholders for funds. The bank could need as much as 5bn analysts at Bernstein Research said as it has fallen behind rivals. Chief executive Antony Jenkins was fired earlier this month with John McFarlane taking the reins as executive chairman. A changeover at the top is a traditional time to raise capital and Mr Jenkins himself undertook a 5.8bn rights issue in 2013 within a year of taking over at the bank. The Daily Mail Number of house hunters hits highest level for a decade thanks to record low mortgage deals – but property supply is thinning There was a rapid surge in the number of people searching for a property last month meaning demand reached its highest level for more than a decade data suggests. The amount of home hunters registered per estate agent branch has swelled to 439 up from 383 in May according to the National Association of Estate Agents. Diesel tipped to be cheaper than petrol across the board as supermarkets cut prices for second time in a week Supermarket giants have once again led the charge towards lower diesel prices with Morrisons Sainsbury's and Tesco all revealing another 2p a litre cut. Last week's price drop meant for the first time in 15 years diesel was cheaper than petrol at supermarket forecourts. From today diesel at Morrisons and Tesco will be 2p a litre cheaper with Sainsbury's making the same reduction tomorrow morning. On average diesel remains more expensive than petrol but RAC expert Simon Williams forecast prices to flip in coming days - leading to cheaper diesel across the board.", "external_links": [], "published": "2015-07-28T03:00:00.000+03:00", "crawled": "2015-07-28T19:36:06.800+03:00", "highlightTitle": ""}