{"organizations": [], "uuid": "1101a9083e9b4bb1040e425b9d393e75de74bf97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-29/vimpelcom-hutchison-said-to-near-deal-to-merge-italian-assets", "country": "US", "title": "VimpelCom, CK Hutchison Said Close to Merging Italian Assets", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "VimpelCom, CK Hutchison Said Close to Merging Italian Assets - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T22:18:00.000+03:00", "replies_count": 0, "uuid": "1101a9083e9b4bb1040e425b9d393e75de74bf97"}, "author": "Manuel Baigorri", "url": "http://www.bloomberg.com/news/articles/2015-07-29/vimpelcom-hutchison-said-to-near-deal-to-merge-italian-assets", "ord_in_thread": 0, "title": "VimpelCom, CK Hutchison Said Close to Merging Italian Assets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VimpelCom Ltd. and CK Hutchison Holdings Ltd. are close to combining their wireless businesses in Italy to create the country’s largest mobile-phone company by customers, according to people familiar with the matter.\nMore than two months after saying they’re negotiating an equal joint venture , the companies are putting final touches on a deal, with an announcement possible in the next week at the earliest, said the people, asking not to be identified because the talks are private. The owners are discussing a possible capital increase of 2 billion euros ($2.2 billion) for the enlarged entity, two of the people said. Bringing in a private-equity investor is also an option, one person said.\nNo final agreement has been reached and a transaction could still fall apart. Other issues to be finalized include possible asset sales and the treatment of debt, the people said. VimpelCom is scheduled to release earnings Aug. 6.\nIf completed, a combination of VimpelCom’s Wind Telecomunicazioni SpA and 3 Italia, which is closely held by billionaire Li Ka-shing’s CK Hutchison, would create a carrier with more than 30 million customers and 6.4 billion euros in 2014 revenue.\nThe businesses had about 2 billion euros in combined 2014 earnings before interest, taxes, depreciation and amortization. Applying an average multiple of eight times earnings for western European wireless companies, the assets could be valued at as much as $18 billion.\nShares Surge VimpelCom shares jumped as much as 8 percent in New York. Telecom Italia SpA, the nation’s biggest carrier that’s widely seen as a beneficiary in a deal, rose as much as 3 percent. The stock closed 0.4 percent higher at 1.20 euros in Milan.\nItaly is the last major European telecommunications market that hasn’t seen consolidation as competition weighs on call and data prices. A merger of Wind and 3 Italia would reduce the number of national wireless networks to three from four, following similar moves in Germany, Ireland and Austria.\nBobby Leach, a spokesman for Amsterdam-based VimpelCom, declined to comment. A representative for Hong Kong-based CK Hutchison couldn’t immediately be reached outside regular office hours.\nAssets that may come up for sale as a result of the deal include Wind’s fixed-line network, called Infostrada, as well as some wireless-towers. In March, Rome-based Wind agreed to sell a controlling stake in the company that owns more than 7,300 towers to Spain’s Abertis Infraestructuras SA .\n“Should 3 Italia and Wind really be interested in disposing wireless towers, we’d really really be interested,” Oscar Cicchetti, chief executive officer of Telecom Italia’s wireless-tower unit Inwit SpA, said on a conference call with analysts on Wednesday.\nVimpelCom’s largest shareholders include Russian billionaire Mikhail Fridman and Telenor ASA of Norway. In Italy, CK Hutchison also manages container ships at the port of Taranto in the south, and operates a chain of about 130 Marionnaud Parfumeries SA stores.", "external_links": ["http://www.ckh.com.hk/en/global/home.php\\"], "published": "2015-07-29T22:18:00.000+03:00", "crawled": "2015-07-29T19:21:21.151+03:00", "highlightTitle": ""}