{"organizations": [], "uuid": "d0632dc6d545ffb05c72f304ef309b2513b71b65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/3/1/d/g/image.related.thumbnail.320x214.gi31ak.png/1436915682762.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/3510/health-care/health-care-equipment-and-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/small-business/smallbiz-tech/the-17-billion-caravan-bonanza-20150701-gi31ak.html", "country": "AU", "title": "The $17 billion caravan bonanza", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "The $17 billion caravan bonanza", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "d0632dc6d545ffb05c72f304ef309b2513b71b65"}, "author": "Caroline James", "url": "http://www.smh.com.au/small-business/smallbiz-tech/the-17-billion-caravan-bonanza-20150701-gi31ak.html", "ord_in_thread": 0, "title": "The $17 billion caravan bonanza", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jethro Batts and Kate Reynolds: their business answers the questions: which van do you hire and where do you park it? Photo: Jeremy Greive\nCaravan holidays are not everyone's cup of billy tea. But visit one of Australia's major caravan shows and you'll quickly get a taste of Australia's unsated appetite for self-guided Aussie touring.\nExisting businesses confirm there is a long way to go before this booming $17 billion industry boils over.\n\"Australia's caravanning industry is currently experiencing a golden trifecta with all three sectors – manufacturing, retail and accommodation – reporting strong growth,\" Stuart Lamont, chief executive of the Caravan Industry Association of Australia, says.\nLatest data shows recreational vehicle (RV) production led by Jayco Australia, which produces a new RV every 12 minutes, reached its second-highest level in 25 years in 2014 with 21,300 caravans and motorhomes; a 4.4 per cent increase on 2013 and 26 per cent more than in 2004.\nAdvertisement \"Data also shows caravans and motorhomes are the fastest-growing vehicles by registration in Australia,\" Lamont says.\n\"The accommodation sector is growing with about 67.8 million site nights spent in the caravanning and camping sector in 2012 and the National Visitors Survey by Tourism Research Australia showed caravanning and camping had the largest growth by accommodation type, with growth of 7 per cent in 2014.\"\nTim Bos, founder and general manager of peer-to-peer rental web site MyCaravan, agrees latest stats are encouraging for start-ups like his, which connects owners who don't use their RVs regularly with those looking to rent caravans, motorhomes and camper-trailers.\nIt relaunched in June after initially launching as caramavan.com in 2013.\nBos' business earns two percentage-based revenue streams per booking – one from the booker and one from the van owner – totalling 18 per cent of each booking's value.\n\"At the moment we have about 50 caravans, mostly along the east coast,\" he says.\n\"Eventually we want 100 as that is where we will have reached critical mass but it is also important to have them in the right locations and the right mix of modern, vintage and motorhomes.\"\nBos sees Western Australia as offering the biggest commercial opportunities in the next few years.\n\"We are looking at ways to manage cross-country logistics so that you may be able to pick up (a caravan) in one location and return in another.\n\"Reducing the risk to caravan owners is critical to the success of this business so first, we are doing extensive market research.\"\nRival business, Camplify, is another of a new crop of caravanning entrants with business models similar to bricks-and-mortar accommodation rental giant Airbnb.\nFounded by Justin Hales after development via the NRMA's Jumpstart innovation program, its chief executive is encouraged by latest research estimating most camping vehicles and equipment are used for only six weeks a year on average and that there are more than 500,000 caravans across Australia.\nJethro Batts, chief executive of Park My Van is similarly buoyed by market trends.\nAussies pay on average between $100,000 and $150,000 to buy an RV and about 63 per cent of buyers are aged 55 or older.\nBatts' online RV comparison, hire and book business launched last year after joining forces with company director Kate Reynolds to fund the venture.\nToday it compares more than 34 RV hire companies and 5300 parks including national, low cost and free parks.\n\"We launched to solve two of the biggest problems in the industry. Which van do you hire and where do you park it? And we wanted to bring a predominately offline industry stuck in yesteryear paradigms online,\" Batts says.\n\"It is an industry that we felt was under-marketed and needed some new blood and, although the RV industry is close to a massive $20 billion market in Australia and $2 trillion globally, it has yet to face technological disruption (like the rest of the travel industry).\"\nBatts and Lamont see consumer spending on caravanning expanding until at least 2020.\nRetiring Baby Boomers, the value of the Aussie dollar and the growth of Asian markets, particularly China, will fuel this boom.\n\"Manufacturing output is expected to be steady, at worst,\" Lamont says.\n\"We don't see the market's appetite decreasing in any way.\"\nBut this doesn't mean the caravanning industry is without its challenges, stresses the peak body boss who is concerned some new e-businesses will struggle to comply with Australia's caravan business rules: \"For example, the private hire of a caravan in WA must have some licensing attached to it.\"\nHe sees technology compelling some traditional bricks-and-mortar retail operators to adjust their business models: \"Having said that, it also opens up opportunities for savvy operators who are early adopters.\"\n\"But our major issue is lack of enforcement of government regulations around product standards, which have not kept pace with industry changes due to new technologies.\n\"We see some importers get products on the road below standards and if we do not maintain these standards across the board to protect consumers it will lead to commercial anarchy.\"\nLamont wants new entrants forced to operate under the same rules and regulations as the existing commercial entrants.\n\"If there needs to be a piece of regulations loosened, then we are very much in favour of this as long as the consumer and natural environment are part of that conversation.\n\"We are all for an open economy to encourage new entrants to enter but it has to be a fair and level playing field.\"", "external_links": [], "published": "2015-07-20T03:00:00.000+03:00", "crawled": "2015-07-20T12:14:43.004+03:00", "highlightTitle": ""}