{"organizations": ["CET Vivo Energy Ghana", "Vivo Energy Ghana"], "uuid": "ba3795d07def79a741c8934a8409fdb1171e96e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/d2xk054ba7_2199885903443_2898899671207.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/631092/1/vivo-energy-ghana-trains-lube-bay-and-oil-speciali.html", "country": "US", "title": "Vivo Energy Ghana trains lube bay and oil specialists", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Vivo Energy Ghana trains lube bay and oil specialists", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T19:06:00.000+03:00", "replies_count": 0, "uuid": "ba3795d07def79a741c8934a8409fdb1171e96e9"}, "author": "", "url": "http://www.modernghana.com/news/631092/1/vivo-energy-ghana-trains-lube-bay-and-oil-speciali.html", "ord_in_thread": 0, "title": "Vivo Energy Ghana trains lube bay and oil specialists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  21 July 2015 17:06 CET Vivo Energy Ghana trains lube bay and oil specialists By Joy Business \nVivo Energy Ghana, the company that distributes and markets Shell branded fuels and lubricants, has organised a capacity building workshop for over 75 oil specialists and lube bay attendants to enable them carry out their duties efficiently. \nParticipants for the workshop were selected from various Shell service stations from the Southern sector including Accra, Volta, Koforidua and Takoradi. \nThe one-day training was developed to equip lube bay attendants in product knowledge and upgrade the expertise of oil specialists. \nThe content of the training included lubrication, lubricant product knowledge, merchandising, stock management and customer service. \nThe Retail Lubricants Category Manager for Vivo Energy Ghana, Mr. Emmanuel Ocran, said: “The changing needs and growing awareness of motorists about their vehicles were some of the reasons we decided to run the capacity building workshop for our lube bay attendants and oil specialists.” \n“Customers have become aware of the needs of their vehicles and will go the extra mile to ensure proper maintenance. Vivo Energy Ghana constantly trains its forecourt staff on modern trends in oil changing to meet the growing needs of motorists, and provide the best possible service” says Mr. Ocran. \nMr. Ocran added that Shell’s range of high-quality lubricants are well-tailored to meet the requirements for high-end, middle and lower tier vehicles. Over 40 scientists in Shell laboratories across the world, work to deliver the very best in engine oils to ensure customers get value for the money when they use Shell lubricants. \nThe training will be replicated for lube bay attendants and oil specialists from the Northern sector.", "external_links": [], "published": "2015-07-21T19:06:00.000+03:00", "crawled": "2015-07-22T02:59:53.750+03:00", "highlightTitle": ""}