{"organizations": [], "uuid": "ccdab562c600588a1c659bf7a2f96debb6434e68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/2pqBc.kscyV2kcXTARB6pw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/38cca86a749c3448e76689b6cc228b463da88b3f_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/week-greek-debt-crisis-174355175.html", "country": "GB", "title": "A week in the Greek debt crisis", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "A week in the Greek debt crisis", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T20:43:00.000+03:00", "replies_count": 0, "uuid": "ccdab562c600588a1c659bf7a2f96debb6434e68"}, "author": "", "url": "https://uk.finance.yahoo.com/news/week-greek-debt-crisis-174355175.html", "ord_in_thread": 0, "title": "A week in the Greek debt crisis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Jul 20, 2015, 19:10 BST - UK Markets closed A week in the Greek debt crisis AFP – 26 minutes ago \n\nKey dates in the Greek crisis since July 13: \nJuly 13: Greece reaches agreement with eurozone creditors on terms for a third rescue package after 17 hours of negotiations. Greek Prime Minister Alexis Tsipras agrees to tough reforms in return for talks on a three-year bailout worth up to 86 billion euros ($93 billion). \nMore than 60 percent of Greeks had rejected such cuts in a July 5 referendum called by Tsipras himself. \n- EU Commission President Jean-Claude Juncker rules out Greek withdrawal from eurozone, saying \"Grexit has gone\". \n- German Chancellor Angela Merkel warns Greece and its European partners still face serious challenges before the bailout is sealed. \nJuly 16: Tsipras gets bailout terms adopted by parliament, despite mutiny by dozens of ruling party lawmakers and violent protests in Athens. \n- The European Central Bank (ECB) raises cap on emergency funding for Greek banks by 900 million euros. \n- Eurozone finance ministers formally approve launch of talks with Greece. \nJuly 17: EU members approve a seven-billion-euro bridging loan for Athens, enabling it to meet looming debt payments to ECB and International Monetary Fund (IMF). \n- German lawmakers give green light to negotiate a new bailout deal. \n- Tsipras reshuffles government, axing ministers who rebelled against the bailout terms. \nJuly 19: Merkel again rules out forgiving some of Greece's debt but says Germany is open to flexible repayment. \nJuly 20: Greek banks reopen after three-week shutdown estimated by Kathimerini newspaper to have cost at least three billion euros. \n- The head of Greece's bank association says around 40 billion euros have been withdrawn from Greek banks since December. \n- Taxes on a wide range of goods and services rise from 13 percent to 23 percent, but decline slightly on medicines, books and newspapers. \n- Greece receives bridging loan from the EU and begins paying 4.2 billion euros owed to the ECB as well as outstanding sums to the IMF.", "external_links": [], "published": "2015-07-20T20:43:00.000+03:00", "crawled": "2015-07-20T21:10:50.204+03:00", "highlightTitle": ""}