{"organizations": [], "uuid": "cc62599565a34c07307f65d0bfbea43bf6ead608", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507110235.html", "country": "US", "title": "Nigeria: Agip Facility Explosion Kills 12 in Bayelsa", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Agip Facility Explosion Kills 12 in Bayelsa", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T16:32:00.000+03:00", "replies_count": 0, "uuid": "cc62599565a34c07307f65d0bfbea43bf6ead608"}, "author": "", "url": "http://allafrica.com/stories/201507110235.html", "ord_in_thread": 0, "title": "Nigeria: Agip Facility Explosion Kills 12 in Bayelsa", "locations": ["Nigeria", "Bayelsa Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ghana: Govt Hands Over ICT Centres to Communities \nThey were said to be carrying out a Joint Investigation Visit (JIV) on a previous oil spill incident on the facility when the explosion occurred and resulted in a huge fire. \nIt was gathered that the ruptured point on the pipeline was being clamped by members of the JIV team, using welding machines and other clamping tools when it sparked off an explosion. \nTen persons were said to have been burnt beyond recognition in the inferno while two gave up the ghost shortly after. \nThree others were said to have survived the fire incident at the company's pipeline with varying degrees of injury. \nTwo of them were rushed to the Niger Delta University Teaching Hospital, Okolobiri, near Yenagoa, the state capital, while the other was taken to another unnamed health facility. \n\"Because the fire was big, it was difficult for anybody to go into the fire and rescue them,\" a source that pleaded anonymity said. \n\"You know, when clamping the ruptured point on a pipeline they use welding machine and other clamping tools to soda the hole on the pipeline,\" the source added. \nThe state Commissioner for Environment, Inuro Wills, confirmed the incident and said that a representative of the ministry on the JIV team was missing. \nHowever, an Eni spokesperson, Filipo Cotalini , the parent company of NAOC, said in a statement via email that the cause of the explosion was being investigated. \n\"Eni informs that an explosion occurred yesterday, July 9 late afternoon, at the site of the repair works of the Tebidaba-Clough Creek line, an oil pipeline in Nigeria's onshore Niger Delta, previously damaged by acts of sabotage. \n\"The explosion resulted in the death of 12 members of the maintenance team of a local company of services, with three others being injured. \n\"The causes of the incident are still under investigation by both Eni and the local authorities. \n\"The company expresses its deepest condolences to the families involved in this tragic accident,\" the company said. \nPolice Public Relations Officer, Bayelsa Command, Asinim Butswat, said the police have received report on the incident but that details were sketchy. Nigeria \nThe naira yesterday hit a record low of 237 to the dollar on the black market, the traders confirmed to Daily Trust. see more » Copyright © 2015 Daily Independent. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-11T16:32:00.000+03:00", "crawled": "2015-07-11T17:44:30.000+03:00", "highlightTitle": ""}