{"organizations": [], "uuid": "d95392bf27b419ed40de06c6196a28b8a73fbc15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/betting-on-blockchain-firms-seek-fortune-in-bitcoins-plumbing/105740", "country": "IE", "title": "Betting on blockchain: firms seek fortune in bitcoin’s plumbing", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Betting on blockchain: firms seek fortune in bitcoin’s plumbing | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T07:10:00.000+03:00", "replies_count": 0, "uuid": "d95392bf27b419ed40de06c6196a28b8a73fbc15"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/betting-on-blockchain-firms-seek-fortune-in-bitcoins-plumbing/105740", "ord_in_thread": 0, "title": "Betting on blockchain: firms seek fortune in bitcoin’s plumbing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Deutsche Bank CEO to present strategy ideas to board: Source Forex: US dollar stabilizes after drop, sterling rises Bank of India to raise Rs 6,000 crore from bonds A year ago, bitcoin was widely dismissed as little more than a way for drug-dealers and terrorists to move money around anonymously. Now, some of the world’s biggest banks and companies are buying into the technology behind it.\nUnderlying the controversial web-based “cryptocurrency” is the blockchain – a massive ledger of every bitcoin transaction ever made that is verified and shared by a global network of computers.\nBut the data that can be secured by the blockchain is not restricted to bitcoin transactions. Any two parties could use it to exchange other information, including stock deals, legal contracts and property records, within minutes and with no need for a third party to verify it.\nBackers say it could cut out the middleman and help fight corruption, as the process by which the data is secured makes it virtually impossible to tamper with. Banks reckon it could save them money by making their operations faster, more efficient and more transparent.\nBut these are early days – bitcoin was invented just six years ago – and the blockchain is still being experimented with. As is often the case with new technology, as when Apple released the iPad, it is not clear what problem it solves.\nPeter Kirby, CEO of Texas blockchain-focused start-up Factom, likened the technology’s stage of development to that of the internet in the early 1990s, when it was seen as little more than a way to send emails.\n“Here we are again in the email for the internet era, and everyone’s like, ‘Oh, it’s all about moving money through the world.’ No. It’s about a giant distributed ledger that you can write anything to and never unwrite it.”\nFactom is using the blockchain to build a permanent and secure land title record in Honduras, one of the poorest countries in Latin America, where land-grabbing and corruption are rife.\nSHARED LEDGER\nEvery 10 minutes, a “block” of bitcoin transactions is verified by thousands of computers, mainly in places where the substantial energy needed to power them is cheap, such as China and Iceland. That block of data is then layered on top of the previous one to form a “chain”.\nBecause the ledger thus created is shared by all of them, if anyone wants to go back and change any of the data, they would have to change every single copy of it, making the blockchain all but tamper-proof.\nThat also solves the problem of money being spent more than once, something that has plagued earlier attempts to create digital currencies. This is an advance that makes the blockchain a “key technological innovation”, according to the Bank of England, which has a dedicated team looking into the technology.\nIn June, U.S. exchange operator Nasdaq said it was exploring new ways for shares to be issued and transferred, while Reuters disclosed earlier this year that IBM was looking at creating a digital cash and payment system using the blockchain.\nBANKING ON THE BLOCKCHAIN\nIn recent months, major banks such as UBS, Barclays, ING, Goldman Sachs and BNY Mellon have announced ventures into blockchain technology.\nThe potential for transactions to be settled in minutes, rather than days, with fraud or hacking almost impossible, is drawing banks in. That, and the desire not to be left behind.\n“We’d rather disrupt ourselves before somebody else does,” said ING’s global head of transaction services, Mark Buitenhek.\n“Our approach … is just to start doing it, and in a year’s time, we’ll see,” he said. “If it takes off, it takes off, and if it doesn’t, it doesn’t.”\nWith banks under increased regulatory scrutiny, the ability to prove via an immutable record that their trillions of dollars of daily transactions have been carried out in clients’ best interests, not just their own, could prove invaluable.\n“The spin-offs from bitcoin are limitless,” said Adam Vaziri, a board member of the UK Digital Currency Association. “Using the blockchain (will) avoid any manipulation of records.”\n 22, 2015 11:10 pm", "external_links": [], "published": "2015-07-23T07:10:00.000+03:00", "crawled": "2015-07-23T05:59:13.848+03:00", "highlightTitle": ""}