{"organizations": [], "uuid": "b451e6392d69a850556f486debcd9a3ab0b74c41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-BQ939_credit_MG_20131213153556.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/6-outrageous-credit-card-fees-you-shouldnt-have-to-pay-2015-07-16", "country": "US", "title": "6 outrageous credit card fees you shouldn’t have to pay", "performance_score": 0, "site": "marketwatch.com", "participants_count": 4, "title_full": "6 outrageous credit card fees you shouldn’t have to pay - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 3, "uuid": "d6ca1bbd8fe1c2aeaaf10b7976d5022ea783bef9"}, "author": "By     Catey Hill", "url": "http://www.marketwatch.com/story/6-outrageous-credit-card-fees-you-shouldnt-have-to-pay-2015-07-16#post-0", "ord_in_thread": 0, "title": "6 outrageous credit card fees you shouldn’t have to pay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bloomberg Credit card companies are taking a page from the airlines playbook — and piling on outrageous fees for some account holders.\nThe average credit card now charges six different fees, according to an analysis of 100 U.S. credit cards released by CreditCards.com on Thursday — and some cards (ahem, First Premier Bank Credit Card and First Premier Bank Secured MasterCard) charge a whopping 12 fees, the analysis, which looked at credit card terms in June, revealed.\n“Credit card companies are tacking on more fees in recent years,” says Charles Tran, the founder of credit card comparison site CreditDonkey.com .\nWhile most cards charge fees for things like late payments (99% of cards charge this, fees typically go up to about $35, though some cards do charge more) and cash advance fees (98% of cards charge this, and most common fee structure is $10 or 5% of each cash advance, whichever is greater) — others charge for more outrageous things. Here are six to watch out for, according to the analysis.\nCredit limit increase fee. While credit card companies should want consumers who pay at least the minimums on their bills to up their credit limit, some penalize you for getting a higher limit. The Credit One Visa Platinum charges up to $49 for a request like this, depending on the length of your account history.\nAccount reopening fee. Should you close your account, but then decide you’d like to reopen it, you may want to prepare to pay for that — despite that fact that it means you’re giving the card issuer your business again. Indeed, a number of American Express-branded cards charge you $25 to reopen your account.\nOne-time processing fee. First Premier Bank Credit Card and First Premier Bank Secured MasterCard both charge a one-time processing fee — an upfront fee that you must pay before you’re allowed to use your card — of $95.\nAuthorized user participation fee. Want to add an authorized user to your account? Usually that’s free — except with some cards like the Credit One Visa Platinum, which hits you with a $19 annual fee for that.\nCopy fee. Some consumers should get prepared to cough up cash should they want a copy of their monthly statement. The L.L. Bean Visa, Barclaycard Visa with Apple Rewards and the Barnes & Noble MasterCard for example, charges $5 for each request for a copy of monthly statements less than 25 months old, and $10 per copy for statements older than 25 months.\nAlternative payment method fee. Should you feel the need to make your payment by phone, you may get slapped with a hefty fee. The Meijer Platinum MasterCard, for example, will hit you with a $15 charge for that.\nWhile no one likes to do this, it’s important to read the fine print to avoid paying fees of any kind, says CreditCards.com’s senior analyst, Matt Schulz.\nYou may also opt for one of the cards with few fees like the PenFed Promise Visa Card which has no fees ; or the Exxon Mobil SmartCard from Citi, the Spark Classic from Capital One, the Capital One Spark Cash Select for Business and the Spark Miles Select by Capital One, which have just three fees.\nFees are only one part of the equation in selecting a credit card. If you carry a balance, the interest rate on your card could be even more costly than the fees you might rack up. And if you’re careful, you can avoid many of these fees by doing things like setting up autopay (so you avoid late fees and fees for calling to pay your bill) and never taking out cash advances.\nMore from MarketWatch", "external_links": ["https://www.penfed.org/Penfed-Promise/"], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T20:15:00.000+03:00", "highlightTitle": ""}