{"organizations": [], "uuid": "f7b384dc8ae2fa746389dab2dff17a7623357044", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/7/c/8/x/image.related.afrArticleLead.620x365.gi8830.png/1436420560414.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/mining/iron-ore/which-iron-ore-miners-are-most-at-risk-at-us45-20150709-gi8830", "country": "AU", "title": "Which iron ore miners are most at risk at $US45?", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Which iron ore miners are most at risk at $US45? | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T11:26:00.000+03:00", "replies_count": 0, "uuid": "f7b384dc8ae2fa746389dab2dff17a7623357044"}, "author": "Amanda Saunders", "url": "http://www.afr.com/business/mining/iron-ore/which-iron-ore-miners-are-most-at-risk-at-us45-20150709-gi8830", "ord_in_thread": 0, "title": "Which iron ore miners are most at risk at $US45?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The stunning plunge in iron ore overnight to below $US45 a tonne has put most of the sector's production underwater, and puts the \"third force\" in Pilbara iron ore, Fortescue Metals Group, under fresh pressure. Reuters Share on twitter by Amanda Saunders The stunning plunge in iron ore overnight to below $US45 a tonne has put most of the sector's production underwater, and puts the \"third force\" in Pilbara iron ore, Fortescue Metals Group, under fresh pressure.\nMajors BHP Billiton and Rio Tinto break even at an iron ore price of about $US31 to $US32 a tonne so are still making solid margins at current prices.\nFortescue says its breakeven is $US39 a tonne, so it is still making decent cash, but some analysts dispute that figure, with UBS putting it at $US44.\nThe brutal fall of 10.1 per cent overnight on Wednesday to a fresh six-year low of $US44.59 a tonne, puts production for most of the sector in the red.\nAtlas Iron, which is trying to drum up support for a $180 million company-saving capital raising this week, is one of the juniors most at risk at current prices.\nIts breakeven is $US52.50 to $US53.50 - but the miner has said that should fall to $US50 by December.\nOther miners in the danger zone, according to UBS' latest numbers, are BC Iron, with a breakeven of $US52 a tonne, and steel group Arrium, which also mines iron ore and has a breakeven of $US51 a tonne.\nMount Gibson Iron, with a breakeven estimated at $US49 a tonne, and Grange Resources, which is pegged at $US48 a tonne, are also on the list.\n Gina Rinehart's Roy Hill, which expects to ship its first ore in September, has an assumed breakeven price of $US41 a tonne.\nFund managers have questioned whether Australia's second and third-tier iron miners can sustain the massive cost cuts they have made in the past 12 months .\nTim Schroeders, resources fund manager at Melbourne-based Pengana Capital, said the market needed to be cynical about how much of the cost cutting would stick, and warned some miners were reducing the lives of their mines as they scrambled to slash.", "external_links": ["https://twitter.com/mandaksaunders"], "published": "2015-07-09T11:26:00.000+03:00", "crawled": "2015-07-09T10:14:36.000+03:00", "highlightTitle": ""}