{"organizations": [], "uuid": "83ee4bbcfa87191c7524109e3e08bca94d4e8a60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/0/e/o/z/8/image.related.articleLeadwide.620x349.gi5v6w.png/1436158587329.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4020/financials/diversified-financials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/mining-and-resources/rinehart-brawl-with-rio-tinto-bound-for-high-court-20150706-gi5v6w.html", "country": "AU", "title": "Rinehart brawl with Rio Tinto bound for High Court", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Rinehart brawl with Rio Tinto bound for High Court", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "83ee4bbcfa87191c7524109e3e08bca94d4e8a60"}, "author": "Peter Ker", "url": "http://www.smh.com.au/business/mining-and-resources/rinehart-brawl-with-rio-tinto-bound-for-high-court-20150706-gi5v6w.html", "ord_in_thread": 0, "title": "Rinehart brawl with Rio Tinto bound for High Court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The dispute hinges on an agreement struck by the womens' fathers in 1970. Photo: ABC TV\nGina Rinehart's legal brawl with Rio Tinto over royalties is set for a third bout, with the iron ore joint venture partners bound for the High Court next month.\nThe case is the continuation of a battle that in May 2013 saw Rio Tinto ordered by a court to pay $200 million in unpaid royalties to companies owned by Mrs Rinehart and her fellow mining heiress, Angela Bennett.\nThe dispute hinges on an agreement struck by the women's fathers in 1970, when they sold two iron ore tenements to Rio, which temporarily lost control of them, only to regain them for mining later on.\nGina Rinehart ... The High Court is expected to hear appeals by her and Angela Bennett against Rio Tinto and Sinosteel in Perth during August. Photo: Tony Ashby\nRio and its modern-day partner in one of the mines, Sinosteel, unsuccessfully argued in 2013 that the temporary loss of control of the tenements voided the need to pay royalties to the two heiresses.\nAdvertisement Mrs Rinehart's and Ms Bennett's original victory was partly overturned by the New South Wales Supreme Court in 2014; it declared that Rio was required to pay royalties on one of the tenements (Eastern Range) but not the second tenement (Channar).\nThe finding was believed to save Rio and Sinosteel about $80 million, but has prompted an appeal in the High Court, which was granted in recent weeks.\nThe High Court is expected to hear the cases in Perth during August, with Rio and Sinosteel pushing for the Eastern Range royalty claim to be abolished along with the Channar royalty, while Mrs Rinehart and Ms Bennett are expected to revive their push for royalty payments on both tenements.\nIn a recent filing to the Australian Securities and Investments Commission, Sinosteel did not sound confident of its chances in the High Court.\n\"The directors have concluded that presently it is probable that Sinosteel will be required to repay this amount,\" the Chinese-owned company said.\nOf the original $200 million ordered to be paid to Mrs Rinehart and Ms Bennett in 2013, Sinosteel's share was approximately $33 million.\nSinosteel's Australian subsidiary made a provision for the royalty repayment in its financial statements for the 2014 calendar year.\nMrs Rinehart will make a rare public appearance on Monday evening when she appears on ABC's Australian Story program.", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-06T19:04:45.000+03:00", "highlightTitle": ""}