{"organizations": [], "uuid": "a5d4b899f6bc0b4748a283acd5a439f5201ded68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507101179.html", "country": "US", "title": "Africa: 2015 Economic Development in Africa Report Launched in Accra", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: 2015 Economic Development in Africa Report Launched in Accra", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T13:50:00.000+03:00", "replies_count": 0, "uuid": "a5d4b899f6bc0b4748a283acd5a439f5201ded68"}, "author": "", "url": "http://allafrica.com/stories/201507101179.html", "ord_in_thread": 0, "title": "Africa: 2015 Economic Development in Africa Report Launched in Accra", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: Four Brilliant Nigerian Girls Win 2015 Global Technovation Challenge \nAccording to the Report, the services sector in Africa required more regionally-coherent services policies to help achieve sustainable economic development on the continent. \nThe report underscores the importance of infrastructure services to achieving the sustainable development goals being set by the United Nations for 2016-2030 and identifies infrastructural services such as water and sanitation as having a direct impact on the sustainable development goals and targets central to achieving social development outcomes, while services such as electricity, telecommunications and transport contribute to productivity and determine the competitiveness of African firms. \nThe report notes that from 2009 to 2012, the services sector in Africa grew at a rate of 4.6 per cent and that in the developing world, the fastest growing services subsectors are transport, storage and communication. \nAccording to the report, some African economies have developed their services industries with relative success and are even sourcing services to African markets, citing as examples the financial and banking services industries of countries such as Mauritius and Nigeria, the commercial and cargo air transport industries of Ethiopia, Kenya, and South Africa, educational services industries of Uganda, telecommunications services of Egypt and the port services industries of Djibouti and Kenya. \nThe Report, therefore, urges Africa to tap the huge potential of its services sector and build on the established intra-African trade which has a more sophisticated composition than its commodity exports to the rest of the world and a higher intensity of the services component. \nIn his remarks at the launch, Dr Yao Graham, Co-ordinator of Third World Network-Africa (TWN-Africa), a pan-African research and advocacy organisation which works for economic and social equity within Africa and for an equitable place for Africa in the global order, noted that the Report represented a giant leap in creating the knowledge base needed for understanding the relationship between services and all economic activity in Africa. \nDr Graham said the report also showed the need for better regulatory and institutional frameworks in Africa's infrastructure services sector, and contained key data to demonstrating how the services sector could enable African countries to boost the prosperity of their peoples. Africa \nNewspapers reported that 1-in-3 South Africans is obese. This, they said, makes the country the most obese in the … see more » Copyright © 2015 Government of Ghana. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-10T13:50:00.000+03:00", "crawled": "2015-07-10T16:24:46.000+03:00", "highlightTitle": ""}