{"organizations": [], "uuid": "af3d6edde3f3635c48c6abaff923307edd6957cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/cd/f8/cdf860d4219ea110c1710054f56dc76e.jpg?itok=d1Fc79l9", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/gil-hilleary-awarded-top-tomato-upon-retiring-from-purveyors-kitchen?cid=rss", "country": "US", "title": "Gil Hilleary awarded Top Tomato upon retiring from Purveyors KItchen", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Gil Hilleary awarded Top Tomato upon retiring from Purveyors KItchen", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T21:08:00.000+03:00", "replies_count": 0, "uuid": "af3d6edde3f3635c48c6abaff923307edd6957cd"}, "author": "John Foley, SF Restaurant Business Examiner", "url": "http://www.examiner.com/article/gil-hilleary-awarded-top-tomato-upon-retiring-from-purveyors-kitchen?cid=rss", "ord_in_thread": 0, "title": "Gil Hilleary awarded Top Tomato upon retiring from Purveyors KItchen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gil Hilleary awarded Top Tomato upon retiring from Purveyors KItchen Use your key for the next article Comment JF \nGil Hilleary knows tomatoes. No really, he really knows tomatoes. He knows more about tomatoes than any man I have ever met and I have met a lot of men. None know as much about tomatoes as Gil. Gil knows about Veeroma and that it takes 72 days to harvest and should weigh 2 to 3 ounces. Mention San Marzano and his eyes light up and a story about those particulates meanders into the conversation. By the way, they harvest in 80 days, just like the Viva Italia. Gil told me.Both Karen and I have learned a lot from Gil over the last six months. Since purchasing Mad Wills and transforming it into Purveyors Kitchen Gil has offered the knowledge and guidance new business owners thirst for in order to accomplish a smooth transition and re-purposing.It’s not easy to change a company’s course, to redirect the focus of a team while increasing business. Add those tasks and goals to an office and warehouse expansion and the work is immense.Gil retired from Purveyor’s Kitchen on Tuesday. The celebration was held at The Ridge Golf Course in Auburn, Ca. During the celebration Gil was awarded The Top Tomato Trophy by the Purveyors Kitchen team. The award symbolizes Gil's career with a can of different styled tomatoes depicting his journey to becoming the Top Tomato. It was easy for Hilleary to achieve this milestone as he lives his work. As an example to others, this award will now become an annual presentation for the company’s yearly Top Tomato employee in honor of Gil.His path began at Del Monte Foods almost 30 years ago. He became a plant manager, implemented practices and procedures that can be directly attributed to cost savings and had a few stops along the way before taking over the reins at Mad Wills Food Company.When we were negotiating the purchase of Mad Wills everyone on the Absinthe Group team had the highest praise for Gil. His knowledge of the food business, especially the co-packing and private label part of the industry is beyond amazing.As Gill floats down the Feather, lure in the water, rod in hand, he will still be consulting with Purveyors Kitchen, so we will still be privy to his knowledge, his friendship and his stories.At Gil’s retirement celebration last week he couldn’t have praised the team at Mad Will’s and now Purveyors Kitchen more. Having worked with them for ten years, they became family to Gil. It was his guidance and leadership and knowledge sharing that helped make that team what it is today.Gil should be proud of his accomplishments knowing that the knowledge he shared will continue to be utilized daily and passed on to future employees.And because of that, Gil Hilleary will always be Top Tomato. If you happen to see Gil, on the river, on the course, on the bike trail, or in the Tomato section of your local grocery store, please tell him to not forget to yell, Fore.", "external_links": [], "published": "2015-07-03T21:08:00.000+03:00", "crawled": "2015-07-03T21:34:58.000+03:00", "highlightTitle": ""}