{"organizations": [], "uuid": "12e7dfee77792030623359b056c1ecfa70c8c6cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-06/world-s-biggest-currency-trader-favors-selling-euro-versus-yen", "country": "US", "title": "World’s Biggest Currency Trader Favors Selling Euro Versus Yen", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "World’s Biggest Currency Trader Favors Selling Euro Versus Yen - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T13:17:00.000+03:00", "replies_count": 0, "uuid": "12e7dfee77792030623359b056c1ecfa70c8c6cb"}, "author": "Netty Idayu Ismail", "url": "http://www.bloomberg.com/news/articles/2015-07-06/world-s-biggest-currency-trader-favors-selling-euro-versus-yen", "ord_in_thread": 0, "title": "World’s Biggest Currency Trader Favors Selling Euro Versus Yen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Citigroup Inc., the world’s biggest currency trader, said it prefers to bet the euro will decline against the yen, rather than against the dollar, as traders seek haven assets amid the turmoil in Greece and China.\nThe yen has strengthened 3.6 percent versus the euro in the past month, outpacing all its major peers. Japan’s currency advanced to the strongest in six week against the euro on Monday after Greek voters rejected austerity measures and China’s stock market rout spurred demand for safer assets.\n“There are better places to play your shorts than euro dollar,” Todd Elmer, a Singapore-based strategist at Citigroup said in an interview on Monday. The yen “is well positioned on the domestic front,” he said.\nThe euro declined 1.3 percent to 134.62 yen as of 6:15 a.m. in Tokyo after declining to 133.70, the weakest level since May 26. The 19-nation currency dropped 0.9 percent to $1.1017 per dollar after sliding as much as 1.3 percent.\nThe euro is set to fall to around 130 yen in the next month or so, Elmer said.\nHedge funds and other large speculators have been cutting bearish positions on both the euro and the yen in the past month, data from the Commodity Futures Trading Commission show. This is a positive for traders seeking to bet against the euro as it means there is less chance there will be an increase in short covering.\nImproving Sentiment The Bank of Japan is unlikely to add to record monetary stimulus “for the time being,” Elmer said. Sentiment among large Japanese manufacturers improved for the first time in three quarters in June and other data have been strong, providing some comfort to the central bank, he said.\n“The politics around yen weakness has really changed where the government is no longer going to be cheerleading for the yen to sell off,” he said.\nCitigroup also favors selling the euro against the pound amid speculation the Bank of England will raise interest rates, Elmer said. The single currency weakened 0.8 percent to 70.79 pence on Monday, having tumbled 8.8 percent this year.\nSixty-one percent of Greek voters backed Prime Minister Alexis Tsipras’s rejection of further spending cuts and tax increases in an unprecedented referendum. German Chancellor Angela Merkel and French President Francois Hollande called for an emergency leaders’ summit on Tuesday.\n“The news flow over the next several days is likely to be negative,” Elmer said. “The euro’s going to underperform.”", "external_links": [], "published": "2015-07-06T13:17:00.000+03:00", "crawled": "2015-07-06T09:13:36.000+03:00", "highlightTitle": ""}