{"organizations": [], "uuid": "7acc29e9e87bcf2fbfece93282ecdca88942ab10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-30/deutsche-bank-legal-tab-passes-12-billion-with-bills-to-follow", "country": "US", "title": "Deutsche Bank Legal Tab Passes $12 Billion With Bills to Follow", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Deutsche Bank Legal Tab Passes $12 Billion With Bills to Follow - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T18:14:00.000+03:00", "replies_count": 0, "uuid": "7acc29e9e87bcf2fbfece93282ecdca88942ab10"}, "author": "Nicholas Comfort", "url": "http://www.bloomberg.com/news/articles/2015-07-30/deutsche-bank-legal-tab-passes-12-billion-with-bills-to-follow", "ord_in_thread": 0, "title": "Deutsche Bank Legal Tab Passes $12 Billion With Bills to Follow", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deutsche Bank AG’s bill for fines and legal settlements since the financial crisis has surpassed 11 billion euros ($12.1 billion) and the company said costs probably won’t let up in coming quarters.\nThe bank recorded 1.23 billion euros of legal expenses in the second quarter, primarily related to “legacy” U.S. mortgage matters, Deutsche Bank said in a statement on Thursday. “We anticipate litigation to remain a burden in the coming quarters,” the company said.\nBanks are paying record fines for manipulating markets, helping some clients break the law and not adequately disclosing the risk of financial products. While Deutsche Bank has settled some of the biggest known cases against the company, future costs may make it harder for co-Chief Executive Officer John Cryan to build the lender’s capital levels.\n“This litigation isn’t going to end any time soon, it’s going to stretch on for years,” said Lutz Roehmeyer, who counts Deutsche Bank shares among the $1.1 billion he manages at LBB Invest in Berlin. “The bank wants to get this off the table and they can be more radical in their approach.”\nDeutsche Bank’s litigation reserves fell to 3.8 billion euros at the end of June from 4.8 billion euros three months earlier after it paid a record $2.5 billion in fines over its role in benchmark interest rate manipulation. The company also faced 3.2 billion euros of contingent legal liabilities at the end of June, according to the filings.\nRussia Probe Deutsche Bank on Thursday acknowledged for the first time that it is investigating a “ significant ” volume of suspicious Russian and U.K. equities trades, adding that it has already taken disciplinary action against a number of people.\nThe firm also has yet to resolve investigations into its role in attempts to manipulate foreign exchange markets as well as a probe of whether it broke U.S. laws on processing payments for countries subject to trade sanctions. It also faces lawsuits which allege the company didn’t make adequate disclosure of U.S. mortgage-backed securities. The bank said it is cooperating with regulators in these matters.\nDeutsche Bank’s legal costs between the beginning of 2012 and the end of June this year amounted to 9.87 billion euros, including provisions, its filings show. The company paid at least 1.2 billion euros of fines and settlements in the three years through 2011, according to calculations by Bloomberg based on its filings and court documents.", "external_links": [], "published": "2015-07-30T18:14:00.000+03:00", "crawled": "2015-07-30T13:49:33.458+03:00", "highlightTitle": ""}