{"organizations": ["Econet"], "uuid": "8bd28904b4b7482ffc757c3fdf5e0bba9989a83d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507250092.html", "country": "US", "title": "Zimbabwe: Infrastructure Sharing - Govt, Econet On a Collision Course", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Infrastructure Sharing - Govt, Econet On a Collision Course", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T10:52:00.000+03:00", "replies_count": 0, "uuid": "8bd28904b4b7482ffc757c3fdf5e0bba9989a83d"}, "author": "", "url": "http://allafrica.com/stories/201507250092.html", "ord_in_thread": 0, "title": "Zimbabwe: Infrastructure Sharing - Govt, Econet On a Collision Course", "locations": ["Ethiopia", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mugabe", "Obama"], "text": "Zimbabwe: Mugabe to Meet Obama in Ethiopia \n\"You may also be pleased to know that first approach to government on the need to share was from Econet,\" reads Mandiwanzira's tweet. \nMandiwanzira was responding to a tweet by local British-based journalist Lance Guma whose Twitter handle is @LanceGuma who had asked: \"Should telecoms companies in Zimbabwe be forced to share infrastructure like what minister Mandiwanzira is advocating.\" \nThe ICT minister then sought to clarify government's position by saying: \"No one is being forced. Government has been clear that those who want out must stay out. But they should not cry foul when the train leaves them behind. All risks considered, all want in.\" \nThe tweet, however, contradicts Econet's recent press statement clarifying its position on infrastructure sharing. In the statement, Econet states that it is of the view thas it was unfair to have infrastructure sharing where one party does not have the infrastructure the other needs. \nAsked to comment on Mandiwanzira's tweet on its reported proposal to government on infrastructure sharing, Econet, in an e-mailed response on Wednesday, said: \"Econet Wireless continues to engage with the relevant stakeholders on the issue and is therefore unable to provide any material updates at present.\" \nMandiwanzira could not be reached for comment as his mobile went unanswered, and later became unreachable. \nIn its statement on March 29, Econet said: \"Our understanding of infrastructure sharing entails parties who have invested in infrastructure in different geographic areas entering into arrangements to share their respective infrastructure on an equitable and reciprocal basis to avoid infrastructure duplication. \n\"Econet is the youngest mobile operator, having entered the market when others already had a head start. We had to raise funding through various channels, including the Zimbabwe Stock Exchange, to develop our own network to the level where we now hold approximately 80% of the telecommunications infrastructure in the market. \n\"The tone that the current debate on infrastructure sharing has taken appears aimed at compelling Econet Wireless to make its infrastructure available for the use of others who chose other investment priorities.\" \nICT specialists believe that if approached correctly, infrastructure sharing could help develop the country as it has helped other nations globally develop. Zimbabwe \nTHE seizure of MDC-T leader Mr Morgan Tsvangirai's property was yesterday halted after the party made an urgent chamber … see more » Copyright © 2015 Zimbabwe Independent. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-25T10:52:00.000+03:00", "crawled": "2015-07-25T19:08:38.188+03:00", "highlightTitle": ""}