{"organizations": ["Federal Reserve", "Fed", "Increase Capital Positions   Fed"], "uuid": "67869862193456df12f739e47b4acbed5194558f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.equipmentfa.com", "main_image": "", "site_section": "http://www.equipmentfa.com/rss/feeds/latestnews.xml", "section_title": "Equipment Finance Advisor", "url": "http://www.equipmentfa.com/news/4506/fed-directs-biggest-banks-to-increase-capital-positions", "country": "US", "title": "Fed Directs Biggest Banks to Increase Capital Positions", "performance_score": 0, "site": "equipmentfa.com", "participants_count": 0, "title_full": "Fed Directs Biggest Banks to Increase Capital Positions", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T14:06:00.000+03:00", "replies_count": 0, "uuid": "67869862193456df12f739e47b4acbed5194558f"}, "author": "", "url": "http://www.equipmentfa.com/news/4506/fed-directs-biggest-banks-to-increase-capital-positions", "ord_in_thread": 0, "title": "Fed Directs Biggest Banks to Increase Capital Positions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Fed Directs Biggest Banks to Increase Capital Positions July 21, 2015, 07:06 AM Related: Federal Reserve , Systemic Risk \nThe Federal Reserve Board on Monday approved a final rule requiring the largest, most systemically important U.S. bank holding companies to further strengthen their capital positions. Under the rule, a firm that is identified as a global systemically important bank holding company, or GSIB, will have to hold additional capital to increase its resiliency in light of the greater threat it poses to the financial stability of the United States. The final rule establishes the criteria for identifying a GSIB and the methods that those firms will use to calculate a risk-based capital surcharge, which is calibrated to each firm's overall systemic risk. Eight U.S. firms are currently expected to be identified as GSIBs under the final rule: Bank of America Corporation; The Bank of New York Mellon Corporation; Citigroup, Inc.; The Goldman Sachs Group, Inc.; JPMorgan Chase & Co.; Morgan Stanley; State Street Corporation; and Wells Fargo & Company. \"A key purpose of the capital surcharge is to require the firms themselves to bear the costs that their failure would impose on others,\" Chair Janet L. Yellen said. \"In practice, this final rule will confront these firms with a choice: they must either hold substantially more capital, reducing the likelihood that they will fail, or else they must shrink their systemic footprint, reducing the harm that their failure would do to our financial system. Either outcome would enhance financial stability.\" Like the proposal issued in December 2014, the final rule requires GSIBs to calculate their surcharges under two methods and use the higher of the two surcharges. The first method is based on the framework agreed to by the Basel Committee on Banking Supervision and considers a GSIB's size, interconnectedness, cross-jurisdictional activity, substitutability, and complexity. The second method uses similar inputs, but is calibrated to result in significantly higher surcharges and replaces substitutability with a measure of the firm's reliance on short-term wholesale funding. As seen during the crisis, reliance on this type of funding left firms vulnerable to runs and fire sales, which may impose additional costs on the broader financial system and economy. Under the final rule and using the most recent available data, estimated surcharges for the eight GSIBs range from 1.0 to 4.5 percent of each firm's total risk-weighted assets. Because the final rule relies on individual GSIB data that will change over time, the currently estimated surcharges may not reflect the surcharges that would apply to a GSIB when the rule becomes effective. \"A set of graduated capital surcharges for the nation's most systemically important financial institutions will be an especially important part of the strengthened regulatory framework we have constructed since the financial crisis,\" Governor Daniel K. Tarullo said. \"Like the higher leverage ratio requirements we will apply to these firms, they reflect the relatively new, but very significant, principle that the stringency of prudential standards should vary with the systemic importance of regulated firms.\" In response to comments, the Board modified several aspects of the proposal's second method to more accurately reflect a GSIB's systemic importance. Additionally, the Board released a white paper on Monday describing how the surcharges were calibrated. The paper details the methodology used to set a GSIB's surcharge at a level that would reduce the impact of its failure to near the impact of the failure of a large bank holding company that is not a GSIB. The surcharges will be phased in beginning on January 1, 2016, becoming fully effective on January 1, 2019. Today's Other News", "external_links": [], "published": "2015-07-21T14:06:00.000+03:00", "crawled": "2015-07-21T20:04:11.117+03:00", "highlightTitle": ""}