{"organizations": [], "uuid": "e89bbdbe8809ade4848861152aa31a54e93c4f61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/ea/73/ea73ff119faeb6edfc41c7437881ef9c.jpg?itok=pIpOkH5F", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/congress-pushing-bills-to-strengthen-controls-over-national-cybersecurity?cid=rss", "country": "US", "title": "Congress pushing bills to strengthen controls over national cybersecurity", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Congress pushing bills to strengthen controls over national cybersecurity", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T04:45:00.000+03:00", "replies_count": 0, "uuid": "e89bbdbe8809ade4848861152aa31a54e93c4f61"}, "author": "Linda Foley, Identity Theft Examiner", "url": "http://www.examiner.com/article/congress-pushing-bills-to-strengthen-controls-over-national-cybersecurity?cid=rss", "ord_in_thread": 0, "title": "Congress pushing bills to strengthen controls over national cybersecurity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Congress pushing bills to strengthen controls over national cybersecurity Use your key for the next article Comment Play \"The alarm [over cyber attacks] is not cause for alarm but a call to action,\" Deputy Secretary Alejandro Mayorkas said Wednesday at a Washington Post Live Cybersecurity Summit. on.aol.com \nAccording to several internal reports at least nine major cyber attacks against federal and private computer networks succeeded in compromising the personal data of millions of Americans. The lastest Office of Personnel Management (OPM) breach has spurred both the Senate and House of Representatives to search for solutions and as a result several bills appear to be pushing their way to the forefront. \nOn July 22 a bipartisan group of Senators i ntroduced legislation that would give the Secretary of the Department of Homeland Security (DHS) the power to detect intrusion on (dot).gov domains. The purpose of the FISMA Reform Act is to update the 12-year-old Federal Information Security Management Act (FISMA) and formalize the DHS role in protecting government networks and websites. \n“While the Department of Homeland Security has the mandate to protect the .gov domain, it has only limited authority to do so,” Sen. Susan Collins (R-Maine), the lead Republican on the bill, told reporters at a press conference. The FISMA Reform Act would lower some of the barriers preventing the DHS from inspecting other agencies’ networks and kicking out hackers . Currently, it needs permission to come in and investigate or monitor networks. Legal hurdles have also stymied the agency, said Sen. Mark Warner (D-Va.), the measure’s lead Democrat. \n“There is no minimum standard,” he said. “This is all done on a voluntary basis. And every agency has got their reason why they, in particular, can’t comply. This voluntary system has resulted in an inconsistent patchwork of security across the whole federal government.” \nThe bill’s co-sponsors include Republican Sens. Dan Coats (Ind.) and Kelly Ayotte (N.H.), and Democratic Sens. Claire McCaskill (Mo.) and Barbara Mikulski (Md.). The bill’s intent is that DHS would do risk assessments on all .gov domains without exception. Currently agencies like the FDA and IRS have not allowed DHS access to their computer networks. \nAdditionally, and perhaps most importantly, DHS would have the power to issue binding directives if the assessment identifies problems. Currently most agencies have Inspectors General that do risk assessments along with evaluations but lack sufficient mandates to demand compliance. Another advantage is that this bill will encourage more cybersecurity information sharing. \nThe IRS and OPM breaches have exposed ineffective and outdated computer systems, unencrypted sensitive data, outdated antimalware programs, and a gigantic tangle of intertwined networks run by IT personnel that doesn’t know what the other hand is doing. Additionally the large amounts of money thrown at cybersecurity seems to be unbalanced in terms of agency need. \n\"This cyberattack points to a broader problem,” Collins said, “the glaring gaps in the process for protecting sensitive personal and economic information in federal agencies.” Since the OPM breach the DHS has speeded up a government-wide implementation of software meant to protect federal data. Einstein, a program that detected the smaller OPM breach, is just one tool the agency is using. Other software searches for hackers once they’ve already penetrated the networks. \nThe Senators backing the bill believe that DHS has the tools, personnel and technology to protect federal databases. The legislation builds on a bill authorized last year setting up the DHS cyber information sharing hub known as NCCIC, National Cybersecurity and Communications Integration Center. Its goal is to collect and analyze digital threat information from around the world in both the government and private sectors. \nNot everyone is convinced that the DHS can make headway through the tangle of interconnected agencies sharing information at division-levels, with outdated and unprotected network programs, and with poor central oversight. After the OPM breach the Office of Management and Budget (OMB) gave agencies 30 days to take immediate and specific actions over the next month to further improve the security of their systems and data. The idea of a “ cybersecurity 30-day sprint ” left many security experts shaking their heads. \nID911’s founder and CEO Adam Levin expressed his opinion about what is needed to fortify our nation’s efforts. “I don't believe we need yet another federal agency. We need the agencies that exist to step up and act responsibly. We need more aggressive oversight and greater accountability with a zero tolerance policy for those who don't demand rigorous security protocols. There will only be change when our leaders stop finger pointing and political maneuvering. The government launched a 30 day cyber security sprint in response to breaches, but when it comes to cybersecurity and protecting consumer data, this is clearly a marathon.” Suggested Links", "external_links": [], "published": "2015-07-23T04:45:00.000+03:00", "crawled": "2015-07-23T05:20:12.400+03:00", "highlightTitle": ""}