{"organizations": [], "uuid": "ca1e9e7f88a89bfdf2cc5930640131cec1206b23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/d/a/w/i/image.related.afrArticleLead.620x365.gijhmf.png/1437910923003.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/before-the-bell/asx-tipped-to-fall-a-lower-after-global-shares-fall-commodities-slump-20150726-gijhmf", "country": "AU", "title": "ASX tipped to fall, $A lower after global shares fall, commodities slump", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "ASX tipped to fall, $A lower after global shares fall, commodities slump | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T19:42:00.000+03:00", "replies_count": 0, "uuid": "ca1e9e7f88a89bfdf2cc5930640131cec1206b23"}, "author": "Elise Shaw", "url": "http://www.afr.com/brand/before-the-bell/asx-tipped-to-fall-a-lower-after-global-shares-fall-commodities-slump-20150726-gijhmf", "ord_in_thread": 0, "title": "ASX tipped to fall, $A lower after global shares fall, commodities slump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Global equities dropped on Friday and local shares are tipped to fall on Monday. BRENDAN MCDERMID Share on twitter Share on Google Plus by Elise Shaw Local shares are tipped to fall at the open on Monday after global stocks capped the worst week of the year last week as commodities slumped and the dollar strengthened amid fresh signs of a slowdown in China and the US housing market.\nThe commodity collapse that sent gold to a five-year low and pulled crude oil into a bear market isn't showing any signs of slowing down. The Bloomberg Commodities Index dropped 1.2 per cent and the Bloomberg Dollar Spot Index climbed 0.2 per cent. The MSCI All-Country World Index and the Standard & Poor's 500 Index both fell more than 1 per cent. Emerging market stocks retreated 1.5 per cent.\n\"We're seeing commodities and energy sink very low, and you're seeing profit-taking in some high-multiple health-care names,\" Tim Ghriskey, who helps oversee $US1.5 billion as managing director and chief investment officer at Solaris Asset Management, said. \"There's a bit of fear there's going to be more to this selloff.\"\nThe Bloomberg Commodity Index fell 4.4 per cent last week, extending a drop to a 13-year low. The measure has tumbled about 28 per cent over the past 12 months amid expanding gluts. Shares of Freeport-McMoRan, the biggest publicly traded copper producer, had the worst week since 2008 as the metal dropped to a six-year low in New York. Brent oil completed its longest run of weekly declines since January.\nTreasuries gained for a second week as sliding commodity prices kept the market's inflation outlook at almost its lowest since March.\nFederal Reserve chair Janet Yellen told the Senate Banking Committee last week that she expects to raise rates this year for the first time since 2006, with a gradual pace for subsequent increases. The central bank holds a policy meeting July 28-29.\nLonger-dated government bonds across the euro area advanced as the selloff in commodities knocked inflation expectations. Germany's 30-year yield slipped 7 basis points to 1.38 per cent, while France's dropped 8 basis points to 1.89 per cent, touching a seven-week low. The Spanish 10-year yield declined four basis points to 1.90 per cent.\nThe dollar gained against 15 of 16 major counterparts. Commodity currencies tumbled, with the Brazilian real and Canada's dollar touching the lowest in more than a decade.\n The MSCI Emerging Markets Index lost 1.5 per cent, extending this week's decline to 3.4 per cent. Hong Kong's Hang Seng China Enterprises Index sank 1.3 per cent, falling for a sixth week in the longest losing streak since October. The Shanghai Composite Index also slid 1.3 per cent.\nThe Stoxx Europe 600 Index fell 0.9 percent, capping its first weekly decline in three.\nThe dollar climbed as economic reports from the US to Germany and China underlined the relative strength of the American economy versus the rest of the world.\nThe greenback advanced to a four-month high as a US manufacturing gauge rose, supporting Federal Reserve moves toward higher interest rates.\n\"There's been some positive signs in the US data,\" said Vassili Serebriakov, a New York-based foreign-exchange strategist at BNP Paribas. The sliding price of commodities also \"creates a generally risk-off environment so the dollar benefits against those higher-risk currencies\".\nThe Bloomberg Dollar Spot Index, which tracks the greenback versus 10 of its peers, added 0.2 per cent to 1209.50, after touching 1212.78, its highest since March. The gauge had its longest streak of gains since December.\nThe Canadian dollar weakened as much as 0.5 per cent to $C1.3103, its lowest since September 2004, while Brazil's real dropped to 3.3567 per dollar, the lowest since March 2003.\nThe dollar rose versus most of its 16 major counterparts as a manufacturing purchasing managers' index compiled by Markit Economics rose for the first time in four months.\nReports on durable goods and gross domestic product may show further economic progress this week. Growth in GDP, which is forecast to expand at a 2.6 per cent annual rate after declining in the first quarter, may help bolster the Fed's case for tightening monetary policy as the central bank meets.\nThis Week's Agenda Monday : US durable goods\nTuesday : Australia weekly consumer confidence; US Case Shiller home prices, consumer confidence, Richmond Fed Manufacturing index\nWednesday : US pending home sales, Federal Reserve meeting\nThursday : Australia import and export prices, building approvals; US Federal Reserve meeting, economic growth\nFriday : Australia producer price indexes, private sector credit\nMarket Highlights The Dow Jones Industrial Average was down 160.05 points (0.90 per cent) at 17,571.87. The broad-based S&P 500 dropped 22.24 (1.06 per cent) to 2079.91, while the tech-rich Nasdaq Composite Index lost 57.78 points (1.12 per cent) at 5088.63. London's benchmark FTSE 100 index of top companies shed 1.13 per cent to end Friday at 6,579.81 points, the CAC 40 in Paris retreated 0.58 per cent to 5,057.36 points, and Frankfurt's DAX 30 fell 1.43 per cent to 11,347.45 points. The Australian dollar is trading around US72.75¢, compared with US73.54 early Friday. The SPI futures was at 5467, down 49 points. From Today's Financial Review Back-door listings to spike ahead of ASX deadline : Advisers expect a spike in the number of back-door listings on the Australian Securities Exchange in the next six months, before the window for the popular manouevre closes. Flinders Investment Partners looks to smaller companies for growth : Retail investors in the Australian sharemarket need to turn to small caps. That's the pitch from Richard Macdougall and his new funds management business Flinders Investment Partners.\nChina stock market woes far from over : At first glance, Beijing appears to have enjoyed a spectacular success in staving off a potentially disastrous collapse in its sharemarket, writes Karen Maley.\nUnited States US stocks closed sharply lower as weak Chinese factory data and tumbling commodity prices overtook Amazon's 10 per cent gain after an unexpected swing into profit. At the closing bell on Friday, the Dow Jones Industrial Average was down 160.05 points (0.90 per cent) at 17,571.87. The broad-based S&P 500 dropped 22.24 (1.06 per cent) to 2079.91, while the tech-rich Nasdaq Composite Index lost 57.78 points (1.12 per cent) at 5088.63. Biogen more than halved its revenue growth forecast for 2015 and its stock lost 22 per cent to close just above $US300. Amazon was the bright spot on Friday, rising more than 20 per cent at one point and closing up 10 per cent at $US530.50. The online retailer posted an unexpected quarterly profit and its market cap ballooned to $US247 billion, making it the 10th-largest US company by market value. Second-quarter S&P 500 earnings have been mixed, with 74 per cent of companies beating analysts' profit expectations but just 52 per cent surpassing revenue expectations, according to Thomson Reuters data. New home sales unexpectedly declined in June, bucking a trend of recent positive news in the housing sector. The Commerce Department said Friday that sales of new single-family homes fell 6.8 per cent from May to a seasonally adjusted annual rate of 482,000. Wall Street had expected sales to rise to a 548,500 annual rate, according to FactSet. The new home sales report tends to be volatile because of its small sample size. Other recent data points have shown the housing market is improving. Last Wednesday, the National Association of Realtors said sales of previously owned homes - the largest sector of the market - hit the highest level in more than eight years. Economists say sustained job growth has given more families the confidence to make significant purchases. And some real estate agents say people are rushing to close a deal. That's because the Federal Reserve is expected to raise its benchmark short-term interest rate later this year.\nEurope Pearson is in talks to sell its 50 per cent stake in The Economist Group , the publisher of the international news and business magazine. UK stocks snapped a three-day losing streak as gains in Vodafone offset a decline in mining stocks. Vodafone Group added 3.4 per cent after reporting service revenue that topped estimates. Anglo American shares rose for the first time in six days, thanks to better-than-expected profit and a promise to accelerate cost cuts. Pearson rallied for a second day, gaining 3.3 per cent, after repeating its full-year earnings forecast. The education company yesterday sold the Financial Times to Japanese publisher Nikkei Inc. A surprise drop in a Chinese manufacturing gauge threatened to worsen a commodity rout, hurting shares of BHP Billiton, Glencore and Antofagasta. Diageo fell 1.3 per cent after saying the Securities and Exchange Commission is looking into its distribution practices in the US. London's benchmark FTSE 100 index of top companies shed 1.13 per cent to end Friday at 6,579.81 points, the CAC 40 in Paris retreated 0.58 per cent to 5,057.36 points, and Frankfurt's DAX 30 fell 1.43 per cent to 11,347.45 points. In foreign exchange, the euro slipped to $US1.0967 from $US1.0985 late in New York on Thursday. Asia Tokyo stocks closed 0.67 per cent lower, as tumbling commodities prices and weak Chinese manufacturing data aggravate worries about the global economy. The Nikkei 225 index at the Tokyo Stock Exchange slipped 139.42 points to close Friday at 20,544.53, while the Topix index of all first-section shares eased 0.54 per cent, or 9.02 points, to 1,655.86. Nikkei's purchase of the Financial Times, which publishes the British daily the Financial Times, will allow it to \"provide better quality and richer global information\" to its readers, Nikkei President Naotoshi Okada said at a press conference on Friday. Okada also said the company hoped to make use of the FT's digital publishing know-how, as well as bolster its own service, which provides information on Asian companies. The deal for £844 million (about $US1.3 billion) is expected to be concluded before year-end. The acquisition does not include the FT Group's 50 per cent stake in the British magazine The Economist nor its London headquarters building. The FT's management and senior editorial staff will likely be kept in place. China The H ang Seng China Enterprises Index slumped 1.3 per cent Friday to 11,679.01, taking its retreat this week to 1.4 per cent. The preliminary Purchasing Managers' Index from Caixin Media and Markit Economics was at 48.2 for July, down from 49.4 the previous month. The median estimate in a Bloomberg survey was for an increase to 49.7. The Shanghai Composite Index dropped toward the end of trading to close 1.3 per cent lower, erasing a gain of 1.5 per cent. Currencies ANZ writes: \"G4 risk appetite is improving and EM deteriorating, which fits with our characterisation of the global cycle. Further peripheral (Asia and NZ) currency underperformance seems likely. In China, the shift to an easy policy stance has finally begun to show through in the data. While this hasn't yet had much apparent impact on commodity prices or currencies, our expectation is that rates of decline here will be more modest. This should also be reflected in continued Asian currency underperformance, particularly KRW, THB, MYR, TWD, and more stable G4 currencies. The maintenance of the recent (unusual) conjunction of low volatility and a stronger USD could well be upset if US bond yields take another leg higher.\" Commodities\nGold turned higher after sliding more than 1 per cent to its lowest since early 2010 on Friday, as the dollar fell from its highs and US stocks extended losses. Spot gold hit the lowest since February 2010 at $US1077.00 an ounce but was up 0.5 percent at $1,096.29. US gold futures for August delivery settled down 0.8 per cent at $US1085.50 an ounce. ANZ analysts forecast Australia's LNG export volumes will rise rapidly over the next few years as the extra capacity created by the LNG investment boom comes on-stream. \"By 2018 Australia will rival Qatar as the largest exporter of LNG in the world. The long term global outlook for LNG is strong. We expect international prices to increase over the next five years due largely to the rise of Asia, where clean energy demand and overall increases in energy consumption are outstripping supply. As a result, Australia's LNG exports could more than triple over the next five years (overtaking iron ore as the key export driver), substantially lifting Australia's GDP growth and playing a decisive role in restoring Australia's trade balance to positive territory. However, the growth of Australia's LNG export industry will put a strain on domestic supply, which in turn will lead to substantial price increases for Australian industry and households over the next two years. While wholesale prices could nearly double on the east coast between now and 2017, not all of that price increase will flow onto households. We expect retail prices to rise by approximately one-third on the east coast. A range of Australian manufacturers will be impacted by the increase in the gas price, especially in the chemicals and metals industries, where natural gas use is heavy and the capacity to pass on price increases is limited. In the absence of mitigation strategies, Australia's heaviest gas-consuming companies could see their aggregate profitability drop by a fifth and their return on equity halved.\" US corn futures posted their biggest weekly decline in a year on improving prospects in the Midwest during the crop's key growth phase, raising expectations for a bumper harvest. Soybean and wheat futures also fell on chart-based selling and spillover pressure from outside commodity markets, including metals and crude oil. \"It's now making it into the headlines of the financial press, the degree to which commodities are declining. That is a significant headwind for the grains,\" said Rich Feltes, director of research for R.J. O'Brien in Chicago. At the Chicago Board of Trade, September corn settled down 10-3/4 cents at $US3.92-1/2 per bushel, dropping below its 200-day moving average. The contract had not settled below $US4 since June 29. For the week, corn fell more than 6 per cent, the biggest slide for a front-month contract since July 2014. Brent crude dropped below $US55 a barrel for the first time in more than three months while US prices traded in a bear market amid a global supply glut. Brent lost 1.2 per cent in London. West Texas Intermediate is down more than 20 per cent from the peak reached in June, meeting the common definition of a bear market. US crude supplies are almost 100 million barrels above the five-year average after a gain last week, and drillers added 21 oil rigs last week across the US. Oil capped a fourth-straight weekly drop on signs a global surplus will persist. Prices have been swept up in a broad selloff of raw materials, which have fallen to a 13-year low over concerns that economic growth will stagnate in China, the biggest consumer of energy, metals and grains. \"We're exhibiting the classic characteristics of a bear market,\" Bill O'Grady, chief market strategist at Confluence Investment Management in St. Louis, which oversees $US3.4 billion, said by phone. \"Every rally you see is an opportunity to sell. We make new lows, rise at night and can't sustain the gain.\" Brent for September settlement fell 65 cents to end the session at $US54.62 a barrel on the London-based ICE Futures Europe exchange. It was the lowest close since March 19. WTI for September delivery fell 31 cents, or 0.6 per cent, to close at $US48.14 a barrel on the New York Mercantile Exchange. It was the lowest settlement since March 31. The US benchmark oil closed at a $US6.48 discount to Brent. Three-month copper on the LME slid to $US5191.50 a tonne, its cheapest since July 2009, before paring losses. It failed to trade in closing open outcry activity and was bid down 0.2 percent at $US5,260. Copper lost about 4 per cent this week, its biggest weekly fall in about a month. Nickel fell 1.2 per cent to end at $US11,310 a tonne amid disappointment over stubbornly high nickel inventories. LME nickel stocks have failed to show steady declines as forecast by some investors, who have been counting on an Indonesian ban on ore exports last year to cause shortages. Zinc closed down 1.3 per cent at $US1,955 a tonne while lead shed 0.8 percent to $US1719, bringing weekly losses to 5.2 per cent and 6.8 per cent respectively, the deepest weekly falls since late 2012. Thinly-traded tin j umped 3.4 per cent on short-covering to finish at $US15,450. Australian Sharemarket Five days of solid l osses in the mining sector have pulled the local sharemarket deep into the red for the week, and turned last week's relief rally into a distant memory. Stocks in Focus Morningstar writes in its quarterly outlook for the Australian share market that Australia's financial sector is in good health , with increasing earnings momentum, solid balance sheets, and growing dividends. \"But headwinds are mounting with economic growth sub-trend and increasing global uncertainty weighing on investor confidence. Despite the challenges, the wide moat-rated major banks continue to benefit from strong competitive advantages underpinning increasing profits and attractive dividends. The search for yield continues and the recent share price pullback sees a number of financial stocks trade below long-term valuations and look attractive. Our best ideas are Goodman Group, National Australia Bank, Platinum Asset Management, Veda Group and Westfield Corporation . The medium-term outlook for the general insurers is broadly positive, but slower premium growth and increasing claims costs are making earnings growth more difficult. Strong price competition is weighing on premium rates and is likely to continue. Narrow moat-rated QBE Insurance and no-moat-rated Insurance Australia Group are undervalued.\" Street Talk High-profile Sydney accountant Anthony Bell's Bell Partners has expanded its national footprint, opening an office in Melbourne. Phoenix Gold's takeover battle took another twist on Friday, when Evolution Mining was believed to have snapped up another 49 million Phoenix shares worth almost 10 per cent of the company. AusNet Services shares should trade at a 5 per cent discount to rivals given its inability to raise equity without shareholder consent. Broker Watch Intelligent Investor's Graham Witcomb has a \"sell\" recommendation on Austbrokers . Warren Buffett's Berkshire Hathaway Specialty Insurance is shaking up the commercial insurance market after opening a Sydney office in April. Insurance Australia Group has formed a strategic relationship with Warren Buffett's investment giant Berkshire Hathaway that will see the US group take a 3.7 per cent stake in IAG via a $500 million placement. \"Until now, we felt that Austbrokers would be relatively protected due to the complexity of insuring a business compared to an individual or car. However, Berkshire's decision to offer Internet-based, direct-to-customer commercial insurance suggests technology is now at a standard where policies can be priced and written entirely online. In fact, nearly a fifth of small businesses buying property, general and professional liability insurance already initiate their purchase online, with more than half willing to do so if they have previously purchased personal insurance. While Berkshire is the first major insurer to move aggressively into online commercial insurance, Australian insurers will inevitably follow, and they're already seeing success with internet sales for personal lines: IAG, for example, had a 24 per cent increase in online sales in the six months to December. With profits already under pressure due to falling premiums, the stock has fallen to a forward price-earnings ratio of 15, but if online competition starts to bite, this would still prove expensive.\" This article contains general investment advice only. Patersons has \"buy\" recommendation on Valence Industries and a price target of 51¢. \"Valence Industries (VXL) has seen its share price fall dramatically during the past 12 months from a high of 85¢ a share. This occurred despite the progress that has been made in bringing its Uley Graphite Plant into production, materially increasing Ore Reserves and Mineral Resources at Uley and completing a Feasibility Study into a substantial expansion in production, including a downstream beneficiation plant in Adelaide. We view VXL achieving nameplate capacity and specification on schedule by September as a key catalyst, as well as finalising all conditions precedent for receipt of the full debt funding facility and commencement of expansion facility construction both at Uley and Adelaide.\" Breakaway Research rates Carnavale Resources as a \"speculative buy\" , with short-term price movers being positive results from the imminent drilling. \"Carnavale is commencing drilling on shear hosted poly-metallic targets at their Red Hills Project, where they are earning up to 75 per cent through an earn-in agreement. The Project is located in Nevada, a well-known and relatively mining friendly jurisdiction. Sampling and mapping by Carnavale over historic workings has confirmed the high grade nature of the mineralisation, and a mid-point exploration target (100 per cent basis) of 12Mt has been estimated over the two targets. Our calculations indicate a zinc equivalent grade of around 22 per cent based on the recent sampling. Red Hills is also prospective for Carlin-style mineralisation – soil sampling at Viper has returned a Carlin-style geochemical signature, and is situated in a similar structural and lithological setting as that for both the Kinsey and multimillion ounce Long Canyon deposits located to the north.\" Fortescue Metals Group remains a \"sell\" at Citi with a target price of $1.50 . \" FMG delivered a strong operating performance to ship 165.4mt in FY15, with costs down 14 per cent to US$22 a tonne in 4Q15 and below our estimate. Realised price was also ahead of our estimate, driving a modest FY15 earnings upgrade. Citi's Commodity team remains bearish on iron ore due to weak demand and increasing supply with prices expected to fall below $US40 a tonne by end-15.\" JPMorgan has an \"underweight\" recommendation on the iron ore producer and a price target of $1.65, because despite \"impressive production and cost management, the iron ore price outlook remains bearish\". Deutsche Bank rates FMG a \"sell\" with a price target of $1.45, while Credit Suisse rates the company as an \"outperform\". Ex Dividends Countplus Market Movers The biggest gains of the week were made by OzForex, up 11.8 per cent recovering from a significant dip in May to close at $2.27, and Fisher & Paykel Healthcare, up 8 per cent to $6.85. The biggest losers of the week were Newcrest Mining, down 14.6 per cent to close at $11.27, while Paladin Energy lost 14.6 per cent and Evolution Mining lost 11.45 per cent. The big banks all finished the week down: the Commonwealth Bank by 2.5 per cent to $85.81; the ANZ Bank by 1.2 per cent to $32.15; the National Australia Bank by 1.25 per cent to $33.91; and Westpac Banking Group by 0.95 per cent to $32.24. Australian Economy Citi economists don't think the Reserve Bank of Australia will alter either its inflation or its growth forecasts in the August Statement on Monetary Policy. \"We will have more to say on these forecasts, but with unchanged economic and inflation forecasts, the cash rate is likely to stay unchanged until at least the RBA's next forecast review in November.\" How the RBA's growth bombshell will hit | Glenn Stevens says the economy's ideal cruising speed may be slower than thought. If he's right, it will have big consequences for governments, businesses and individuals.\nDebt Markets The RBNZ cut the OCR by 25bps to 3.00 per cent. Moreover, it concluded its policy assessment with an easing bias, suggesting that \"some further easing seems likely\". Credit Suisse comments: \"We continue to expect an additional 25bps cut at the September 10 MPS, followed by a further 25bps reduction at the October 29 OCR Review, taking the OCR back to its historical low of 2.50 per cent and completely reversing the 100bps tightening in rates which occurred over 2014.\" In the US, benchmark 10-year Treasury notes were up 5/32 in price to yield 2.260 percent, compared with 2.275 percent late on Thursday. Yields earlier fell to 2.255 percent, the lowest since July 9. U.S. 30-year bonds were up 12/32 in price to yield 2.960 per cent, compared with 2.971 per cent on Thursday. Yields earlier fell to 2.95 per cent, the lowest since June 2. U.S. seven-year notes were up 4/32 in price, yielding 2.003 per cent, from Thursday's 2.023 per cent. Earlier, seven-year yields fell to a two-week low of 2.001 per cent. Germany's 30-year yield slipped 7 basis points to 1.38 per cent, while France's dropped 8 basis points to 1.89 per cent, touching a seven-week low. The Spanish 10-year yield declined four basis points to 1.90 per cent. with Reuters, Bloomberg, AAP, AFP\nComments? Questions? Let us know what you think of Before the Bell.\nElise Shaw eshaw@afr.com.au 02 9282 3501", "external_links": ["https://www.google.com.au/url?sa=t&rct=j&q=&esrc=s&source=web&cd=6&cad=rja&uact=8&ved=0CDoQFjAFahUKEwjm7uDFufbGAhUD5aYKHQa0Dyk&url=http%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2015-07-25%2Fpearson-confirms-talks-with-economist-on-sale-of-50-stake-icj0m2zt&ei=YpezVea1NIPKmwWG6L7IAg&usg=AFQjCNEEvksXFgBfprgijGq21F0rgd74iw&sig2=NbraltkRra18fmk95Cz48A&bvm=bv.98717601,d.dGY", "http://landing.intelligentinvestor.com.au/afr-before-the-bell", "https://plus.google.com/https://plus.google.com/u/0/104280172644175237870", "https://twitter.com/https://twitter.com/Washseile"], "published": "2015-07-26T19:42:00.000+03:00", "crawled": "2015-07-26T15:09:28.523+03:00", "highlightTitle": ""}