{"organizations": [], "uuid": "5723af13b9c561339e202337dc110f4c54b615d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/theres-ray-hope-greece-cure-163511569.html", "country": "US", "title": "There's a ray of hope that Greece can cure itself of the rat poison of austerity", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "There's a ray of hope that Greece can cure itself of the rat poison of austerity", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T19:35:00.000+03:00", "replies_count": 0, "uuid": "5723af13b9c561339e202337dc110f4c54b615d3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/theres-ray-hope-greece-cure-163511569.html", "ord_in_thread": 0, "title": "There's a ray of hope that Greece can cure itself of the rat poison of austerity", "locations": ["Greece"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 28, 2015, 18:10 BST - UK Markets closed There's a ray of hope that Greece can cure itself of the rat poison of austerity By Hugo Dixon | Telegraph – 34 minutes ago 17.86 +0.05 \nGreece's prime minister needs to embrace much-needed reforms and bring in some competent ministers to implement them \nGreece can stay in the euro and probably will. This prognosis may disappoint British eurosceptics who want the single currency to go down in flames. But it will be largely up to the Greeks whether the country sticks to the euro or brings back the drachma. And despite five years of agony, the people still overwhelmingly want to stay in the eurozone. \nThis is not to deny that joining the single currency was a terrible error. Greece wasn’t competitive enough to endure the straitjacket it imposed. Nor is it to deny that some of the policies Athens has had to impose on its people in recent years were both unnecessary and debilitating. \nThe country’s eurozone creditors and the International Monetary Fund have also made mistakes: they have insisted on excessive austerity and been slow to accept that Athens’ huge debt load needs to be lightened. \nBut the lion’s share of the blame for the Greek tragedy belongs to the country’s own prime ministers, most spectacularly the current incumbent, Alexis Tsipras. Before he took office in January, the European Commission predicted the economy would grow 2.5pc this year. Now (NYSE: DNOW - news ) , after Mr Tsipras engaged in half a year of disastrous brinkmanship with his creditors, which has led to the imposition of capital controls, the EC thinks the economy will shrink by 2pc-4pc. \nGiven all this, why is there any basis for hope? Even though Mr Tsipras did agree a last-minute deal, doesn’t that simply involve more austerity? Isn’t it just a matter of time before Greece is kicked out of the euro, as Wolfgang Schaeuble, Germany’s powerful finance minister, wants? \nWell, not quite. \nStart with the people. They don’t want to bring back the drachma. They think a new currency, which would immediately trade at a big discount to the euro, would consign the country permanently to second-class status in Europe. It might even fall into Russia’s sphere of influence, something Britain and America narrowly averted at the end of the Second World War. \nWithout the discipline of euro membership, Greek governments could resort to printing money whenever they fancied it fuelling high inflation, perhaps even hyperinflation and social unrest. What’s more, the transition from euro to drachma would be chaotic: banks would go bust; salaries and pensions would be paid in IOUs; and even more people would lose their jobs. \nOne only has to look at the cock-eyed Plan Bs of Mr Tsipras’s former ministers to see that the Greeks have good reason to be afraid. One scheme, devised by Yanis Varoufakis, the ex-finance minister, involved hacking the tax system’s computers in a bid to create a parallel banking system. The other, advocated by the former energy minister, consisted of raiding the national mint and arresting the central bank governor. \nAlexis Tsipras \nOne reason to be mildly optimistic is that Mr Tsipras has removed these two ministers from their posts. Another is that, in order to receive a cash injection from the eurozone and avoid imminent disaster, he had to abandon his wildly unrealistic pre-election promises. The prime minister did a kolotoumba a somersault. \nIt may be true that Mr Schaeuble would like Greece to leave the euro. But the hardline German finance minister is only one voice. His boss, Angela Merkel, doesn’t want it. Nor do the French or Italian leaders. Nor, crucially, does Mario Draghi, the European Central Bank’s president and arguably the most powerful person in the eurozone. \nSome commentators have argued that the ECB deliberately provoked a bank run in its zeal to force Greece to its knees. In fact, Mr Draghi has been doing pretty much anything he can, within the ECB’s rules, to keep the country in the euro. \nMr Varoufakis admitted on a recent conference call chaired by Norman Lamont, the eurosceptic former Chancellor of the Exchequer, that Mr Draghi “has handled himself as well as he could, and he tried to stay out of this mire, the political mire, impressively” saying even God couldn’t have avoided being political. \nThe ECB has a critical role to play in the next few months, too. The central bank has already made clear that, provided Mr Tsipras keeps to his side of the bargain, it could start buying Greek government bonds, including Athens in its so-called quantitative easing programme. Such a move would drive down Greece’s borrowing costs and help prepare the way for it to access the bond markets again. \nMr Draghi will also be the main voice in deciding when Athens can lift the capital controls strangling the economy. The government will first need to recapitalise its banks with cash from the creditors. But after that, the ECB should be ready to halt the curbs. \nAnother reason to be optimistic is that the creditors now admit that Greece will need debt relief. Even the Germans reluctantly agree to this. But it will, again, be conditional on Mr Tsipras fulfilling his side of the deal. \nSo the ball is really in the prime minister’s court. Will he try to wriggle out of what he has agreed, which will lead to failure and maybe even Greece’s exit from the euro? Or will he implement the new bailout programme vigorously, which could get the economy growing again? \nDespite Mr Tsipras’s kolotoumba, he still lacks a narrative for this change of direction. It is unrealistic to expect him to say he likes austerity. As US President Barack Obama reportedly told Mr Varoufakis, “austerity sucks”. But equally it is no good for Mr Tsipras to say he doesn’t believe in the deal. That just makes his creditors think he is going to go wobbly on them. \nThe key is to distinguish between austerity and the structural reforms, such as pushing up retirement ages and clamping down on tax evasion, that are needed to boost Greece’s competitiveness. As Amartya Sen, the Nobel prize-winning economist, says, austerity is like rat poison, reforms are similar to an antibiotic. Greece is like a patient with a fever who has been forced to take a pill that mixes both the healing drug and the poison. \nGreece, unfortunately, is in a situation where some further austerity is unavoidable. Mr Tsipras does not have to pretend he likes that. But he does need to embrace much-needed reforms and bring in some competent ministers to implement them. If he does that, Greece will stay in the euro and the effects of the rat poison will wear off. \nHugo Dixon is the author of ‘The In/Out Question: Why Britain should stay in the EU and fight to make it better’", "external_links": [], "published": "2015-07-28T19:35:00.000+03:00", "crawled": "2015-07-28T20:10:52.122+03:00", "highlightTitle": ""}