{"organizations": [], "uuid": "8c2467bd08963a014e03b9bdd74428a87cc807a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-CT419_car_sa_ZG_20140904141644.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/when-is-the-best-time-to-buy-a-car-2015-07-07", "country": "US", "title": "When is the best time to buy a car?", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "When is the best time to buy a car? - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 1, "uuid": "21404c9f1ac575e2d442be3728957b4af08e6082"}, "author": "By     Claudia Assis", "url": "http://www.marketwatch.com/story/when-is-the-best-time-to-buy-a-car-2015-07-07#post-0", "ord_in_thread": 0, "title": "When is the best time to buy a car?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New cars are selling briskly and at higher prices than ever, but buyers may have time on their side: the best time to buy a new car is around the corner.\nLate summer seems to be the sweet spot for bargain hunters. Most car makers have rolled out next-year’s models by late August or early September. Meanwhile, there are still plenty of current-year models on dealers’ lots, making dealers more willing to work out a deal on their older inventory simply because they need the space.\nThose deals come generally in the form of incentives, such as cash back deals or low interest rates which don’t appear to devalue their cars, said Phil Reed, a senior editor with Edmunds.com.\nHere’s a chart showing the sell-down rate for current-year models.\nCurrent-year models typically come with heavier discounts as the year draws to a close, but then selection becomes an issue. By year-end, getting a bargain may also mean getting stuck with an unpopular color or having little choice of trim, for example.\nHere’s how current-model savings compare with next year-model cars. Discounts to a manufacturer’s suggested price begin to emerge in August and keep on rising through the rest of the year.\nMeanwhile, new cars are becoming ever more expensive. Prices are up on average 2.5% this June from a year ago, according to Kelley Blue Book.\nAmong manufacturers, Ford Motor Co. F, +0.41% reported the biggest price gains, thanks in part to its heavily revamped F-150 truck, which is 6.6% more expensive than the previous year’s model, KBB said.\nOverall, easier access to financing is the main driver behind the higher prices, with longer-term loans — now up to 6 and 7 years — becoming more common, spurring buyers to consider more expensive cars.\nExperts are quick to say that the best time to buy a car is when you need one, but here are some tips for those who have the luxury of timing their purchases, alongside some strategies to get the most for your money.\nPrev Page 1 2 Next Page", "external_links": [], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T23:24:09.000+03:00", "highlightTitle": ""}