{"organizations": [], "uuid": "62dafb15d48f417e6167f35bcfb4cdf412a370d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/nL8JQ6DpxPZVWzr0SPkioQ--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/FIN_ANZ_AAP_ART_FTP_LIVE_1/2944405_20150709_Force_1280x720_original.jpg", "site_section": "https://au.finance.yahoo.com/news/category-currencies/?format=rss", "section_title": "Currency & Forex News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/unemployment-6-0-031815581.html", "country": "US", "title": "Unemployment at 6.0%", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Unemployment at 6.0%", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T06:18:00.000+03:00", "replies_count": 0, "uuid": "62dafb15d48f417e6167f35bcfb4cdf412a370d6"}, "author": "", "url": "https://au.finance.yahoo.com/news/unemployment-6-0-031815581.html", "ord_in_thread": 0, "title": "Unemployment at 6.0%", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Unemployment remains relatively steady at 6.0 per cent, but economists warn it is yet to peak. \nThe June jobless rate was better than the 6.1 per cent expected by the market, and was up from a revised 5.9 per cent in May. \nThe total number of people with jobs rose 7,300 in June, the Australian Bureau of Statistics said, better than expectations of a fall of 5,000. \nMacquarie senior economist James McIntyre expects the unemployment rate to rise, as business investment remains weak and the economy takes some time to benefit from a falling currency. \n\"We still see the unemployment rate pushing up to about 6.5 per cent by the middle of 2016, that's why we're forecasting one more rate cut and there's a risk of further rate cuts,\" he said. \n\"What the month on month job data doesn't change is the investment outlook for the economy, and it doesn't change the income hit from the slide in the iron ore price.\" \nMr McIntyre said his job forecast may change if there is a depreciation in the Australian dollar, a swift resolution to the Greek financial crisis and a response to China's effort to stimulate its economy. \n\"The currency is going to be helpful but even at 74 US cents, the RBA thinks that a further depreciation is likely and necessary,\" he said. \nJP Morgan economist Ben Jarman said recent jobs numbers suggest the non-mining sector is doing some heavy lifting for the economy. \n\"We've been sitting here with sub-trend growth still continuing but the labour market is doing better,\" he said. \n\"The non-mining economy gradually improving might be having a bigger bearing on the labour market than people have realised.\" \nBut Mr Jarman said the figures don't reflect the recent Chinese stock market meltdown or the uncertainty over Greece's future, which are having international repercussions. \n\"Things are evolving pretty quickly on the global front, so this data doesn't reflect the impact of what's going on in Europe and what's unraveling in China at the moment,\" he said. \n\"It's probably too early to say the unemployment rate has peaked because you've still got the impact of that shock moving through the system.\" @y7finance on Twitter, become a fan on Facebook", "external_links": [], "published": "2015-07-09T06:18:00.000+03:00", "crawled": "2015-07-09T06:27:40.000+03:00", "highlightTitle": ""}