{"organizations": [], "uuid": "9fe256bf879d04e6ee1565fc22e61d9b0ec1cbf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/e/p/l/r/image.related.articleLeadwide.620x349.giory5.png/1438319140342.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2530/consumer-discretionary/consumer-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/energy/oil-heads-for-biggest-monthly-drop-this-year-amid-global-glut-20150731-giory5.html", "country": "AU", "title": "Oil heads for biggest monthly drop this year amid global glut", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Oil heads for biggest monthly drop this year amid global glut", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "9fe256bf879d04e6ee1565fc22e61d9b0ec1cbf7"}, "author": "Ben Sharples", "url": "http://www.smh.com.au/business/energy/oil-heads-for-biggest-monthly-drop-this-year-amid-global-glut-20150731-giory5.html", "ord_in_thread": 0, "title": "Oil heads for biggest monthly drop this year amid global glut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US crude inventories have been bolstered by the fastest pace of production in more than three decades. Photo: Jessica Shapiro\n Oil headed for its biggest monthly drop this year amid speculation a global supply glut that drove prices into a bear market will persist.\nFutures slid as much as 0.8 per cent in New York and are down 19 per cent in July. US crude stockpiles are almost 100 million barrels above the five-year seasonal average, while exports from southern Iraq rose to a record this month. Producers from BP to Royal Dutch Shell have started a new round of cost cutting as prices decline.\nOil's worst month since December paces a slump across raw materials amid expanding surpluses and concern slower economic growth in China will crimp demand. Commodities also dropped as the dollar gained on signals from Federal Reserve chair Janet Yellen that the US central bank may increase rates.\n\"The supply situation is adequate and that's why we've seen oil drift lower,\" David Lennox, an analyst at Fat Prophets in Sydney, said. \"The fall in Chinese equities shook investor confidence and that's why we saw a lot of retracement in commodity prices.\"\nAdvertisement West Texas Intermediate for September delivery lost as much as 40 US cents to $US48.12 a barrel in electronic trading on the New York Mercantile Exchange and was at $US48.22 at 2pm in Sydney. The contract decreased 27 US cents to $US48.52 on Thursday. Total volume was about 35 per cent below the 100-day average. Prices have lost more than 20 per cent from their closing peak this year on June 10, meeting a common definition of a bear market.\nGlobal supplies Brent for September settlement was 17 US cents lower at $US53.14 a barrel on the London-based ICE Futures Europe exchange. Prices are down 16 per cent for the month. The European benchmark crude traded at a premium of $US4.85 to WTI.\nUS crude inventories have been bolstered by the fastest pace of production in more than three decades. Output averaged 9.6 million barrels a day through June 5, the most in weekly data compiled by the Energy Information Administration since January 1983.\nOil's global surplus is also getting a boost from leading OPEC members that are pumping record volumes as they defend market share. Exports from the south of Iraq, the second-largest producer in the Organisation of Petroleum Exporting Countries, climbed to 3.06 million barrels a day, a spokesman at state- owned South Oil Co said on Monday.\nThe Bloomberg Commodity Index of 22 raw materials is down 9.8 per cent this month, the most since September 2011, after falling to a 13-year low this week.\nBloomberg", "external_links": [], "published": "2015-07-31T03:00:00.000+03:00", "crawled": "2015-07-31T18:26:07.503+03:00", "highlightTitle": ""}