{"organizations": [], "uuid": "dc7aa0d959419a3b959acf853484cae64ee784c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/cost-living-eye-beholder-033457551.html", "country": "GB", "title": "Cost of living in the eye of the beholder", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Cost of living in the eye of the beholder", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T06:34:00.000+03:00", "replies_count": 0, "uuid": "dc7aa0d959419a3b959acf853484cae64ee784c3"}, "author": "", "url": "https://au.finance.yahoo.com/news/cost-living-eye-beholder-033457551.html", "ord_in_thread": 0, "title": "Cost of living in the eye of the beholder", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wed, Jul 29, 2015, 2:06 PM AEST - Australia Markets close in 1 hr 54 mins Cost of living in the eye of the beholder AAP – 31 minutes ago Print \nPoliticians frequently talk about the cost-of-living pressures facing Australians but new figures suggest the reality could be something quite different. \nIndeed, if you thought the latest inflation figures were benign, actual cost of living pressures are even more subdued. \nThat's according to the Australian Bureau of Statistics \"selected living cost indexes\" released on Wednesday which gauge how much after tax incomes need to change to allow different types of households to purchase the same quantity of consumer goods in a given period. \nFor workers the cost of living rose 0.4 per cent in the June quarter for a mere 0.9 per cent over the year. \nLast week's consumer price index rose 0.7 per cent in the same three months for an annual rate of 1.5 per cent. \nFor aged pensioners the living cost index was a tad higher than workers, rising 0.6 per cent in the June quarter. \nThe report assumes this group was more affected by higher transport costs over the quarter, while bearing a greater burden of rising health costs. \nHowever, on an annual basis costs rose 0.9 per cent, the same as workers. \nSelf-funded retiree households endured a more subdued 0.4 per cent as they are seen benefiting more from a decline in the costs of recreational and cultural activities, but over the year living costs were the highest at 1.2 per cent growth, but still below inflation. \nHowever, at the end of the day cost-of-living pressures are in the eyes of the beholder. \nAnd it's unlikely that any politician is about to quote the words of former British prime minister Harold Macmillan, who said in a 1957: \"Let us be frank about it, most of our people have never had it so good.\" @y7finance on Twitter, become a fan on Facebook Qld government open to Uber operating AAP \nQueensland's government hasn't made its mind up about what to do about Uber, but has hinted the controversial ride-sharing …", "external_links": [], "published": "2015-07-29T06:34:00.000+03:00", "crawled": "2015-07-29T07:08:00.863+03:00", "highlightTitle": ""}