{"organizations": [], "uuid": "71b238d59faa25324c412a15fbb4bf56bad96fad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/28/space-spaceshiptwo-accident-idUSL1N1081W020150728", "country": "US", "title": "UPDATE 1-U.S. investigators blame Virgin Galactic crash on lax pilot training", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-U.S. investigators blame Virgin Galactic crash on lax pilot training | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T23:57:00.000+03:00", "replies_count": 0, "uuid": "71b238d59faa25324c412a15fbb4bf56bad96fad"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/28/space-spaceshiptwo-accident-idUSL1N1081W020150728", "ord_in_thread": 0, "title": "UPDATE 1-U.S. investigators blame Virgin Galactic crash on lax pilot training", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Quote: s, statement from spaceship's developer)\nBy Irene Klotz\nCAPE CANAVERAL, Fla., July 28 (Reuters) - Federal investigators cited inadequate training of test pilots by a Northrup Grumman Corp subsidiary on Tuesday as a leading factor behind last year's fatal crash of an experimental Virgin Galactic passenger spaceship over the Mojave Desert.\nThe premature unlocking of the hinged tail section on Virgin Galactic's SpaceShipTwo triggered a midair breakup of the ship during its fourth powered test flight on Oct. 31, the National Transportation Safety Board said.\nBlame for the accident falls to Scaled Composites, the Northrop Grumman unit that developed the craft and employed its test crew, the NTSB said.\nThe accident was a setback in billionaire entreprenuer Richard Branson's more than decade-old quest to ferry space tourists beyond Earth's atmosphere.\n\"Scaled did not consider that a pilot would induce that kind of failure,\" said lead investigator Lorenda Ward.\nThe NTSB also faulted the Federal Aviation Administration, which oversees commercial spaceflight in the United States and approved the test flight, for failing to recognize the potential danger.\nScaled provided inadequate training to co-pilot Michael Alsbury, who unlocked the tail section, and pilot Peter Siebold, and the other members of SpaceShipTwo's flight crews and engineering staff over the past 10 years, the NTSB said during a webcast hearing in Washington, D.C.\nScaled should have trained its pilots to understand what could happen to the craft when the tail section was unlocked prematurely, before atmospheric forces built up to hold it into place, the board said.\n\"Scaled will incorporate learning from this accident into its flight procedure review and safety assessment in future projects,\" Scaled Composites said in a statement posted on NTSB's website after the hearing.\n\"Scaled will expand the documentation of training and testing further to promote safety, including with emphasis on the challenges inherent in rocket flight,\" the statement added.\nScaled designed and built the two-pilot, six-passenger vehicle for Virgin Galactic, an offshoot of Branson's London-based Virgin Group.\nThe craft was the first of a planned fleet of five vehicles that Virgin eventually expects to use to fly passengers on short, suborbital flights into space at altitudes of about 62 miles (100 km). It has already sold about 700 tickets for rides that cost $250,000 each.\nTest flights of Virgin Galactic's new ship are scheduled to begin before the end of the year.\nThe Spaceship Company, a Virgin-owned operation based in Mojave, has taken over construction of SpaceShipTwo vehicles from Scaled, a transition that began before last year's accident.\nAlsbury, 39, an experienced test pilot, died in the accident, while Siebold, 43, managed to parachute to safety. Both pilots worked for Scaled Composites.\nThe tail section of the SpaceShipTwo vehicle is designed to rotate to allow the craft to re-enter the atmosphere with its heat-shielded belly down, regardless of its original orientation.\nThe tail is intended to be unlocked by one of the pilots after the ship is supersonic, traveling at about Mach 1.4, or 1.4 times the speed of sound. Alsbury unlocked the tail section when the spaceship was traveling at less than Mach 1.\nVirgin's spaceships will now include a mechanism to prevent pilots from unlocking tail sections too early, the company said.\nWhile Scaled flew under an experimental flight permit, Virgin Galactic will need full FAA licensing before the start of commercial passenger spaceflight services.\n(Editing by Frank McGurty and Tom Brown )", "external_links": [], "published": "2015-07-28T23:57:00.000+03:00", "crawled": "2015-07-28T23:10:27.241+03:00", "highlightTitle": ""}