{"organizations": [], "uuid": "816af6c7ad41e40659ce74c0df746a5912a951b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/opposition-parties-must-join-hands-to-oppose-biometric-id-and-aadhaar-says-cfcl/42575.html", "country": "IN", "title": "Opposition parties must join hands to oppose biometric ID and Aadhaar, says CFCL", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Opposition parties must join hands to oppose biometric ID and Aadhaar, says CFCL", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T15:39:00.000+03:00", "replies_count": 0, "uuid": "816af6c7ad41e40659ce74c0df746a5912a951b6"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/opposition-parties-must-join-hands-to-oppose-biometric-id-and-aadhaar-says-cfcl/42575.html", "ord_in_thread": 0, "title": "Opposition parties must join hands to oppose biometric ID and Aadhaar, says CFCL", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Opposition parties must join hands to oppose biometric ID and Aadhaar, says CFCL 42575 Opposition parties must join hands to oppose biometric ID and Aadhaar, says CFCL 0 Comments, Be the first to comment According to Citizens Forum for Civil Liberties, Aadhaar has intended consequences impacting monetary and non-monetary aspects of citizens' life and opposition parties should join during the hearing of a PIL in SC later this month The Citizens Forum for Civil Liberties (CFCL) has asked opposition parties to join hands to oppose biometric ID and Aadhaar during the next hearing on the public interest litigation (PIL) in the Supreme Court later this month. \"Opposition parties should note that all this information (about Aadhaar) will be in the hands of a few trustworthy people in the government and few select companies. Such a situation is fraught with both unintended and intended consequences impacting monetary and non-monetary aspects of citizens' life,\" CFCL said in a release. Meanwhile, following a legal notice sent by the Forum, the Delhi government has instructed all its departments to ensure that Aadhaar is not made mandatory for any work. The order issued by the Delhi government on 24 March 2015, states, \"All concerned are requested to ensure strict compliance of the orders of the Supreme Court (on Aadhaar). Any administrative instructions in violation of the order of Supreme Court will have no validity.\" CFCL says there is a need for other State Governments to do so as well. The apex court is likely to hear the matter concerning and illegality of 12-digit biometric Aadhaar number on 21 July 2015. Earlier in March 2015, a bench of Justice J Chelameswar, Justice SA Bobde and Justice C Nagappan reiterated it was incumbent upon the central government to ensure that the states complied with the Supreme Court's order of not making Aadhaar mandatory for availing social benefits under various schemes. The apex court by its 23 September 2013 order, had said \"no person should suffer for not getting the Aadhaar in spite of the fact that some authorities had issued a circular making it mandatory and when any person applies to get the Aadhaar voluntarily, it may be checked whether that person is entitled for it under the law and it should not be given to any illegal immigrant.\" According to the Forum, biometric identification and related schemes are an attempt to convert Indian residents into a number, Indian population into a market and then citizens in to subjects of transnational biometric technology companies. It says, \"This situation creates is a compelling need to initiate a political movement to stop the use of Aadhaar before opposition parties, dissenting voices and democratic rights gets imprisoned in the Database State.\" Karnataka High Court's former judge K S Puttaswamy had moved the court in 2012 contending that the entire Aadhaar scheme was unconstitutional as the biometric data collected under it was an incursion and transgression of individual privacy.", "external_links": [], "published": "2015-07-02T15:39:00.000+03:00", "crawled": "2015-07-02T15:44:36.000+03:00", "highlightTitle": ""}