{"organizations": [], "uuid": "beb28f01f29e9924420e11861d3c1e75ffa549d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15100_5215.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/anti-discrimination-housing-laws-86025/", "country": "US", "title": "Anti-Discrimination Housing Laws Tackled by U.S. Supreme Court", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Anti-Discrimination Housing Laws Tackled by U.S. Supreme Court", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T04:48:00.000+03:00", "replies_count": 0, "uuid": "beb28f01f29e9924420e11861d3c1e75ffa549d0"}, "author": "Best Best &amp; Krieger LLP", "url": "http://www.jdsupra.com/legalnews/anti-discrimination-housing-laws-86025/", "ord_in_thread": 0, "title": "Anti-Discrimination Housing Laws Tackled by U.S. Supreme Court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Anti-Discrimination Housing Laws Tackled by U.S. Supreme Court more+ </iframe> \non twice before only to see both cases settle, the United States Supreme Court recently concluded that claims alleging a disparate impact on minorities are proper under the Fair Housing Act. In Texas Department of Housing and Community Affairs v. The Inclusive Communities Project , a sharply divided Court agreed with nine courts of appeals that the FHA encompasses disparate-impact claims. In federal anti-discrimination law, the disparate-impact theory holds that employment, housing and other practices may be discriminatory and illegal if they have a disproportionate, adverse effect on minorities, and are unsupported by a legitimate rationale. This differs from disparate-treatment cases, in which discriminatory intent must be proven. \nInclusive Communities, decided on June 25, may spur litigation against public agencies, plaintiffs still face significant hurdles. Initially, a plaintiff must prove that the challenged practice has caused, or will cause, a discriminatory effect. Importantly, the Court imposed safeguards to limit disparate-impact liability. For instance, a plaintiff cannot prevail simply by pointing to racial imbalance, but must also identify the policy responsible for it. \npublic agencies need not reorder their priorities in the wake of Inclusive Communities . Even if a policy having a discriminatory effect is identified, a housing authority can maintain the policy by proving it necessary to achieve a valid interest. If a valid interest exists, the plaintiff must show that an available alternative would serve the agency’s needs, but have a less discriminatory effect. Several cities, including Los Angeles and San Francisco, supported extension of disparate-impact liability to the FHA. \ngives priority to certain criteria such as tenants’ income levels. The Inclusive Communities Project alleged that HCA disproportionately allocated tax credits—granting too many for housing in mostly black urban areas and too few in mostly white suburban areas—perpetuating segregation. The ICP brought a disparate-impact claim under the FHA, which the Court found proper without reaching its merits.", "external_links": [], "published": "2015-07-17T04:48:00.000+03:00", "crawled": "2015-07-17T05:08:16.000+03:00", "highlightTitle": ""}