{"organizations": [], "uuid": "04343932a17f673b681ddeb5e804518f2f7cce4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/248515-ex-budget-leaders-challenge-congress-to-rethink-spending-process", "country": "US", "title": "Former budget leaders push Congress to revamp process", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Former budget leaders push Congress to revamp process", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T21:31:00.000+03:00", "replies_count": 0, "uuid": "04343932a17f673b681ddeb5e804518f2f7cce4b"}, "author": "rshabad@thehill.com (Rebecca Shabad)", "url": "http://thehill.com/policy/finance/248515-ex-budget-leaders-challenge-congress-to-rethink-spending-process", "ord_in_thread": 0, "title": "Former budget leaders push Congress to revamp process", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former budget leaders push Congress to revamp process By Rebecca Shabad - 07/20/15 02:31 PM EDT Two former leaders in the congressional budget process are laying out their recommendations for reforming a 40-year-old process that say “urgently needs repair.” Former Sen. Pete Domenici (R-N.M.), a former chairman of the Senate Budget Committee, and Alice Rivlin, a former director of the Office of Management and Budget (OMB) and Congressional Budget Office, presented their proposals in 29-page report through the Bipartisan Policy Center. “It is time to rethink the objectives of the budget process and redesign 'regular order' to deal with the budget situation Congress faces now and in the future,” they wrote. To prevent Congress from lurching “from one budget crisis to another,” the two budget experts say lawmakers should consider rewriting the Congressional Budget Act of 1974, which has long guided the modern-day budget process. They outlined 10 specific recommendations. ADVERTISEMENT Domenici and Rivlin, for example, said Congress should enact long-term budgets for Medicare, Medicaid, Social Security and other mandatory programs and set limits on automatic spending. Congress should enact legislation to establish a two-year budget cycle, they said, in order to ensure passage of a budget and spending bills by the deadlines and to free up time in the second session for authorization bills. Former Rep. Leon Panetta (D-Calif.), also a former Defense secretary, authored the first biennial reform bill in 1977. If Congress were to then adopt a biennial budget, Congress should automatically send a proposed increase to the debt limit to the president’s desk, Domenici and Rivlin said. But if lawmakers fail to adopt the budget by the April 15 deadline, the two former budget leaders said all planned congressional recesses should be cancelled until a blueprint is adopted. To prevent government shutdowns, Domenici and Rivlin called for a trigger whereby if Congress fails to pass two-year spending packages in the first session of each Congress, then the government should be automatically funded at the previous year’s level. They also recommended a restructuring of the budget committees in Congress and to eliminate the “vote-a-rama,” which allows senators to offer an unlimited number of amendments to their budgets. The last recommendation, among others, is to establish a presidential and congressional commission on budget concepts, which would both report to OMB and Congress on their recommendations. House Budget Committee Chairman Tom Price (R-Ga.) has expressed support for reforming the budget process, but has not yet offered a specific reform proposal.", "external_links": [], "published": "2015-07-20T21:31:00.000+03:00", "crawled": "2015-07-21T03:22:42.002+03:00", "highlightTitle": ""}