{"organizations": [], "uuid": "e3d993aceb35a283b6603fab1e503e8de52cac91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance-commerce.com", "main_image": "http://finance-commerce.com/files/2015/07/Highland9x-200x200.jpg", "site_section": "http://finance-commerce.com/feed/", "section_title": "Finance & Commerce", "url": "http://finance-commerce.com/2015/07/top-projects-highland-park-community-center/", "country": "US", "title": "Top Projects: Highland Park Community Center", "performance_score": 0, "site": "finance-commerce.com", "participants_count": 1, "title_full": "Top Projects: Highland Park Community Center", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T15:03:00.000+03:00", "replies_count": 0, "uuid": "e3d993aceb35a283b6603fab1e503e8de52cac91"}, "author": "Frank Jossi", "url": "http://finance-commerce.com/2015/07/top-projects-highland-park-community-center/", "ord_in_thread": 0, "title": "Top Projects: Highland Park Community Center", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home / News / Construction & Development / Top Projects: Highland Park Community Center The renovated and expanded Highland Park Community Center features a perforated metal sign depicting the neighborhood's place on the Mississippi River. The structure is hard to miss on a drive up Ford Parkway in St. Paul. (File photo: Bill Klotz) Top Projects: Highland Park Community Center By: Frank Jossi July 29, 2015 7:03 am 0 \nAddress: 1970 Ford Parkway, St. Paul \nProject cost: $7.9 million \nProject size: 18,000 square feet (6,000 square feet of new construction) Owner: St. Paul Public Library \nContractor: Sheehy Construction Architect: Lawal Scott Erickson \nEngineer: Clark Engineering Corp. \nEditor’s note: This is the seventh installment of Finance & Commerce’s Top Projects of 2014 series. Previous installments are available here . \nThe Highland Park Community Center is a beacon of activity overlooking Highland Village in St. Paul. The modern window-filled structure — with a perforated metal sign depicting Highland Park’s place on the Mississippi River — is hard to miss on a drive up Ford Parkway. \nLawal Scott Erickson fundamentally transformed the building, mainly the city library, in several ways. First, it replaced an underground parking lot with a first-floor entrance, check-out area, teen center and conference room. \n“That was a really big change,” said St. Paul Public Library director Kit Hadley. “People told us they couldn’t even find the door of the old building.” \nThe architecture firm’s education and public sector director Jennifer Anderson-Tuttle considers the “re-imagining” of the parking garage as an entrance as the key to the entire project. “What was missing was a connection between Ford Parkway and the fabric of the neighborhood and the library,” she said. “The entrance and first floor created that connection.” \nThe first floor’s teen center follows the library’s policy to create space specifically for that demographic. The nearby express center offers a convenient spot where patrons can unload books and materials and pick up items they reserved without having to enter the main upstairs library, Anderson-Tuttle said. \nThe sprawling second-floor library has an open floor plan with two conference rooms for community meetings. “We had heard community meeting rooms were really needed in that neighborhood and these are in locations where they can still be used even when the library is closed,” Hadley noted. \nTo accommodate the digital age, the library offers 20 computer terminals and a shared table where patrons can plug in devices. Five private study rooms rarely go unfilled, said Hadley. Large windows deliver natural light to a children’s area with birdhouses created by Amanda Lovelee. \nThe results still impress Hadley, who admires the architect’s attention to details and budget. “I think the design is brilliant,” she said. “I admire their creativity, design and their business skills.” \nCheck out additional images of the Highland Park Community Center by Staff Photographer Bill Klotz: Pause Play Play Prev | Next The children’s area of the second-floor library in the community center includes birdhouses created by Amanda Lovelee. \nLike this article? Gain access to all of our great content with a month-to-month subscription. SPECIAL: Start your subscription with our low intro rate of just $9.99.", "external_links": [], "published": "2015-07-29T15:03:00.000+03:00", "crawled": "2015-07-29T15:45:16.480+03:00", "highlightTitle": ""}