{"organizations": [], "uuid": "f0e94d2197dba8106481e0b44b6ff2f47f7ebacc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/1/o/2/v/l/image.related.afrArticleLead.620x365.giadp7.png/1436688022152.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/business/banking-and-finance/climate-change-a-risk-to-financial-system-says-cameron-clyne-20150712-giadp7", "country": "AU", "title": "Climate change a risk to financial system, says Cameron Clyne", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Climate change a risk to financial system, says Cameron Clyne | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T22:15:00.000+03:00", "replies_count": 0, "uuid": "f0e94d2197dba8106481e0b44b6ff2f47f7ebacc"}, "author": "Joanna Mather", "url": "http://www.afr.com/business/banking-and-finance/climate-change-a-risk-to-financial-system-says-cameron-clyne-20150712-giadp7", "ord_in_thread": 0, "title": "Climate change a risk to financial system, says Cameron Clyne", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dark cloud: Cameron Clyne says climate change is a threat to the financial system. Louise Kennerley by Joanna Mather The global shift to renewable energy is a sizeable risk that the financial system needs to confront, former National Australia Bank chief executive Cameron Clyne says.\nClimate-related risks to banking, insurance, superannuation, capital markets and infrastructure are highlighted in a new discussion paper by the Climate Institute.\nThe institute is calling for a review of Australia's preparedness for a climate-related crisis and a plan to manage the risks.\nMr Clyne agreed that, regardless of one's view on the science, the risks were real.\n\"The whole basis of financial services is the assessment, analysis and consequent determination of risk factors,\" he said.\n\"Even if you do not subscribe to the overwhelming scientific consensus that climate change is a clear and present threat you have to acknowledge that fossil fuels are a finite resource.\n\"On that basis alone there is a major move globally to renewable energy and with that shift a huge risk that needs to be confronted by the financial system. The Climate Institute discussion paper is an excellent start to provoke that debate.\"\nThe institute suggests the Council of Financial Regulators might be the appropriate body to spearhead a review of the capacity of the financial system to deal with shocks brought about by climate change itself, or the policy and investment decisions being made in response.\n The Council of Financial Regulators comprises the Reserve Bank, Australian Prudential Regulation Authority, the Australian Securities and Investments Commission and Treasury.\nMost vulnerable The Climate Institute's discussion paper says the financial system could be destabilised by climate events directly. For example, Australia's banks are heavily concentrated in residential property and much of that property lies in coastal areas vulnerable to storm surges.\nBut there are also potential secondary effects, such as slump in demand for carbon-intensive exports. \"The carbon intensive nature of Australia's economy and stock market indicates our pensions are exposed to higher carbon risks than the international mean,\" the report says.\nThe institute provided a written comment by Mr Clyne as well as a statement by former Treasury secretary Martin Parkinson, who said Australia was the advanced economy most vulnerable to climate change.\n\"Climate change will result in risks to our food and water supplies and damage from severe weather events, while other countries' response to changing conditions may threaten our industries, with consequent effects on jobs, exports and living standards,\" he said.\nFormer Liberal leader John Hewson, now a professor at the Australian National University, told The Australian Financial Review on Sunday that the \"risk of climate-induced financial crisis is very real\".\nDr Hewson chairs the Asset Owners Disclosure Project, which rates the world's biggest asset-holding entities, such as pension funds, according to how well they have accounted for climate-related risk.\nHe said one possible response in Australia could be to require compulsory reporting of climate risk exposure by banks and super funds.\n\"A lot directors and trustees of super funds are breaching their fiduciary responsibilities because they are ignoring these risks and yet they have a responsibility to maximise the value of somebody's pension,\" he said.\n\"The whole system does need a substantial review. The history of financial markets is they don't understand risk and they certainly underprice it.\"", "external_links": [], "published": "2015-07-12T22:15:00.000+03:00", "crawled": "2015-07-13T10:58:19.000+03:00", "highlightTitle": ""}