{"organizations": [], "uuid": "47ee8959b862e5b1923f9815014999d19c20544b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/d/g/2/o/image.related.articleLeadwide.620x349.gideww.png/1437007114604.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/15/materials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/motley-fool/bellamys-growth-spurt-continues-20150716-gideww.html", "country": "AU", "title": "Bellamy's growth spurt continues", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Bellamy's growth spurt continues", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "47ee8959b862e5b1923f9815014999d19c20544b"}, "author": "Matt Joass", "url": "http://www.smh.com.au/business/motley-fool/bellamys-growth-spurt-continues-20150716-gideww.html", "ord_in_thread": 0, "title": "Bellamy's growth spurt continues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Motley Fool\nNew Zealand dairy giant Fonterra estimates China's baby formula market could hit over $30 billion within the next three years – more than 20 times bigger than the size of the Aussie market. Photo: Supplied\nIs there a line out the door at that new restaurant chain? Are all your friends talking about some hot new product? You might have just stumbled upon the next big ASX growth stock.\nIf you'd been paying attention to the empty shelves at your local chemist six months ago you could have unearthed one of the ASX's biggest winners , Bellamy's Australia (ASX:BAL) – its share price has more than tripled in the past 12 months.\nInsatiable growth Tasmania-based Bellamy's simple brand message of pure, Australian-made organic food has let it gobble up market share from its much larger international rivals such as Nestle and Danone at an astonishing rate.\nAdvertisement When Bellamy's listed on the ASX in August last year its baby formula market share in Australia was 10 per cent. Less than six months later that market share grew to 14.1 per cent, and shows no signs of slowing down.\nTo say Bellamy's was growing quickly would be a monumental understatement. In the last half-year results, Bellamy's blew past its own prospectus forecasts, reporting revenue growth of a staggering 141 per cent, and net profit growth of 137 per cent. The company looks set to continue the trend with full-year net profit guided to surge by a whopping 500 per cent over the prior year.\nAn asset-light model There is a lot to like about Bellamy's capital-light business model. Unlike most food companies, Bellamy's does not run its own processing and manufacturing operations. Instead, it outsources this production to a long time trusted partner, Tatura Milk Industries.\nJust like Coca-Cola does with sugar water, that model frees Bellamy's up to focus on what it does best – building a world-class brand. It also means that Bellamy's returns on capital are even healthier than its top-notch organic products – I estimate Bellamy's returns on net assets in the last half to be 25 per cent.\nChina's white gold rush Bellamy's is also rapidly expanding into a huge new market that puts Australia in the shade: China.\nBellamy's exports to Asia (of which China makes up 80 per cent) were up 30 per cent in the last half-year result, but that is just a drop in the bucket next to Bellamy's potential opportunity.\nChina has a voracious appetite for baby formula. Limited maternity-leave policies have led millions of working Chinese mothers to use baby formula even more than Aussie mums, and the country's nightmarish pollution makes imported formula from clean and green places like Tasmania a hot commodity.\nNew Zealand dairy giant Fonterra estimates China's baby formula market to already be a $17 billion industry, and estimates that the market could hit over $30 billion within the next three years – that's more than 20 times bigger than the size of the Aussie market.\nSupply risk The trade-off to Bellamy's asset-light model is that it does not own the assets used to create its products. Bellamy's must count on its suppliers to deliver on quality and quantity (Bellamy's selling out at stores is a first-class problem, but still a problem).\nTatura, which is owned by Bega Cheese (ASX:BGA) supplies all of Bellamy's baby formula. But the recent announcement that the pair have signed a long-term supply agreement significantly reduces the chance of Tatura upping prices or curtailing supply.\nFoolish takeaway Bellamy's is a world-class business with an asset-light model and formidable brand power that is growing at lightning speed. Bellamy's share price may have already more than tripled, but the next great winning idea is just around the corner. Notice anything on the way in to work today? At the supermarket? You could be looking at a huge stock market winner and not even realise it.\nMatt Joass is a Motley Fool analyst. He owns shares of Bellamy's, as does The Motley Fool. You can follow Matt on Twitter @TMFMattJoass . The Motley Fool's purpose is to educate, amuse and enrich investors. This article contains general investment advice only (under AFSL 400691). Authorised by Bruce Jackson.", "external_links": ["http://twitter.com/TMFMattJoass", "http://www.fool.com.au/2015/06/10/why-bellamys-australia-ltd-surged-another-10-6-today/)"], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T05:10:18.000+03:00", "highlightTitle": ""}