{"organizations": [], "uuid": "9b0a95d0e276c8d223b9f9eabb457c91e5d16b58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/f/x/9/x/image.related.articleLeadwide.620x349.gifwkc.png/1437362286595.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/3510/health-care/health-care-equipment-and-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/world-business/greek-debt-crisis-prices-for-everyday-items-shoot-up-in-greece-20150719-gifwkc.html", "country": "AU", "title": "Greek debt crisis: Prices for everyday items shoot up in Greece", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Greek debt crisis: Prices for everyday items shoot up in Greece", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "9b0a95d0e276c8d223b9f9eabb457c91e5d16b58"}, "author": "Takis Tsafos", "url": "http://www.smh.com.au/business/world-business/greek-debt-crisis-prices-for-everyday-items-shoot-up-in-greece-20150719-gifwkc.html", "ord_in_thread": 0, "title": "Greek debt crisis: Prices for everyday items shoot up in Greece", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Mick Fanning's frantic shark escape\nSun slammed for Queen's 'Nazi salute' image\nNorth Koreans cast ballots\nAussie surfer Mick Fanning attacked by shark\nAngela Merkel reduces migrant girl to tears\nReplay video Return to video Video settings Please Log in to update your video settings\nGreece prepares to reopen banks amid protests Sunday working and pension cuts: Greece prepares to reopen banks but its people are divided over the terms of an aid package.\nPT1M16S 620 349 Autoplay On Off Video feedback Video settings Eurozone clinches deal with Greece Greek banks to reopen Athens: Greeks, many already struggling with the cost of living, will on Monday begin to pay substantially more for everyday items. Prices have been pushed up by increases in value-added tax, one of the conditions imposed on the country by its creditors before talks began on Greece's third bailout in five years.\nThe taxes have pushed up the prices of a long list of items, including fresh and frozen meat, fish, coffee, tea, juices, eggs, sugar, cocoa, rice, flour, dairy products such as ice cream and yoghurt, fertiliser, condoms and toilet paper and even funerals.\nShopping in Athens before the prices shoot up on Monday. Photo: Bloomberg\nThe tax increases, from 13 to 23 per cent, will also apply to products and services such as processed foods and drinks and dishes served in restaurants and bars.\nA sharp increase in consumer taxes on many Greek islands is also set to take effect on Monday.\nThe tax increases are forecast to bring in $US867 million ($1.1billion) by year-end, Greek financial media said.\nA customer, right, buys fresh fish from a vendor at Varvakeios fish and meat market in Athens last week. Photo: Bloomberg\nParliament approved the increases on Thursday as part of a package of austerity and reform measures Greece's international creditors required before talks would begin on a new, three-year bailout package the country needs to stave off bankruptcy.\nOnce the new austerity program was approved, the European Central Bank agreed to allow more emergency funding to flow to Greek banks, which were nearly out of cash. As a result, they will reopen Monday after being closed for three weeks.\nTransactions, however, will still be limited. Customers will not be able to withdraw money at bank counters but must do so from ATMs as in the previous three weeks, according to a government decree.\nValue-added tax increases will push up the cost of living in Greece from Monday. Photo: Bloomberg\nAccount holders will be allowed to withdraw up to €420 per week ($616). For the past three weeks, depositors have been allowed to take out €60 ($88) a day from ATMs.\nRestrictions on transfers abroad and other capital controls remain in place because the banks' financial health remains critical. Transfers of money to other countries are allowed only with permission from the Greek central bank and the finance ministry.\nGreek credit cards will be able to be used abroad again, but only for purchases and payments of bills, not for cash withdrawals.\nBanks will reopen in Greece on Monday, Photo: Bloomberg\nEurozone finance ministers also provided Greece with a $US7.6 billion bridge loan so it could meet a $US3.8 billion loan repayment due on Monday to the European Central Bank and limp through the next few weeks until the new bailout is approved.\nDPA", "external_links": [], "published": "2015-07-20T03:00:00.000+03:00", "crawled": "2015-07-20T12:18:41.043+03:00", "highlightTitle": ""}