{"organizations": [], "uuid": "ab23455ae45a76661dcfec55eb9aba63425e58fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/323096?filename=323096.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/17/Financing%20Agreements", "section_title": "GlobeNewswire: Financing Agreements", "url": "http://globenewswire.com/news-release/2015/06/30/748756/10140244/en/FTI-Consulting-Inc-Announces-550-0-Million-Senior-Secured-Revolving-Line-of-Credit.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "country": "US", "title": "FTI Consulting, Inc. Announces $550.0 Million Senior Secured Revolving Line of Credit", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "FTI Consulting, Inc. Announces $550.0 Million Senior Secured Revolving Line of Credit", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T23:30:00.000+03:00", "replies_count": 0, "uuid": "ab23455ae45a76661dcfec55eb9aba63425e58fc"}, "author": "", "url": "http://globenewswire.com/news-release/2015/06/30/748756/10140244/en/FTI-Consulting-Inc-Announces-550-0-Million-Senior-Secured-Revolving-Line-of-Credit.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "ord_in_thread": 0, "title": "FTI Consulting, Inc. Announces $550.0 Million Senior Secured Revolving Line of Credit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FTI Consulting, Inc. Announces $550.0 Million Senior Secured Revolving Line of Credit June 30, 2015 16:30 ET | Source: FTI Consulting, Inc. \nWASHINGTON, June 30,   FTI Consulting, Inc. (NYSE: FCN ) (the \" Company \"), the global business advisory firm dedicated to helping organizations protect and enhance their enterprise value, today announced that it has entered into a five-year, $550.0 million senior secured revolving line of credit (the \" Credit Facility \"). The Credit Facility effectively amends and extends the maturity date of the Company's existing $350.0 million credit facility from November 27, 2017 to June 26, 2020. Borrowings under the Credit Facility may be used as permitted under the terms of the Credit Facility to finance working capital, for capital expenditures and for other general corporate purposes, to repay or redeem existing debt, including under the Company's existing credit facilities or senior notes, and for permitted acquisitions. \nBorrowings under the credit agreement will bear interest at a rate equal to LIBOR plus an applicable margin or at an alternative base rate plus an applicable margin. The applicable margin for LIBOR borrowings will range between an annual rate of 1.375% and 2.00% and the applicable margin for alternative base rate borrowings will range between an annual rate of 0.375% and 1.00%. The applicable margin will initially be set at an annual rate of 1.75% for LIBOR borrowings and 0.75% for alternative base rate borrowings and will subsequently vary according to the Company's Consolidated Total Leverage Ratio. The Company will also pay a commitment fee on unused amounts of the credit line initially set at an annual rate of 0.30% and subsequently ranging from an annual rate of 0.25% to 0.35% according to the Company's Consolidated Total Leverage Ratio. \nThe obligations of the Company under the Credit Facility are guaranteed by substantially all of the Company's domestic subsidiaries and secured by substantially all of the Company's and its domestic subsidiaries' existing and after-acquired assets, subject to certain exceptions set forth in the definitive debt and security documentation. \nBank of America, N.A. is acting as the administrative agent for the Credit Facility. J.P. Morgan Chase Bank, N.A. and HSBC Bank USA, N.A. acted as joint lead arrangers and joint book running managers of the credit agreement. \nIntended Use of Proceeds \nThe Company currently intends, on or before October 1, 2015 and subject to market conditions and other factors, to retire its $400.0 million of 6.75% Notes due 2020 (the \" 2020 Notes \"), funded by a combination of approximately $275.0 million of borrowings under the Credit Facility and approximately $140.0 million of cash on hand. While this is its current intention, the Company is not providing a notice of redemption or otherwise making an irrevocable commitment to retire the 2020 Notes as described above, and any such decision will, among other things, be subject to further review and final approval by the Company's Board of Directors. There can be no assurance that the Company will decide to retire the 2020 Notes in the manner described above or at all. Should the Company retire the 2020 Notes, on or before October 1, 2015, it estimates it would incur a charge for early retirement of debt, including remaining unamortized issuance expenses of approximately $19.0 million before taxes. \nSecond Quarter 2015 Earnings Conference Call and 2015 Guidance \nThe Company will announce its second quarter 2015 earnings results and, consistent with its historic practice, speak to full year 2015 guidance on July 30, 2015. \n\"FTI Consulting's ability to generate free cash available to fund debt retirement, share repurchases or acquisitions supports our confidence that we can deliver results within our guidance range for 2015 and also meet or exceed our 2016 Adjusted EPS goal of $2.50,\" said David Johnson , Chief Financial Officer of FTI Consulting. \"So while the retirement of our 2020 Notes would clearly be financially beneficial to us, we view it as supportive in meeting our financial targets rather than additive and, accordingly, we do not anticipate changing our 2015 guidance or our 2016 Adjusted EPS goal solely as a result of closing the Credit Facility.\" \nAs described in the Company's prior filings, press releases and below, the Company has historically excluded losses from early extinguishment of debt from its definition of Adjusted EPS, which is a Non-GAAP financial measure. The Company's Adjusted EPS guidance range for 2015 of between $1.95 and $2.20 does not include any charges for early extinguishment of debt and will not be updated for any charge for the early retirement of debt if the Company were to retire the 2020 Notes. \nAbout FTI Consulting \nFTI Consulting, Inc. is a global business advisory firm dedicated to helping organizations protect and enhance enterprise value in an increasingly complex legal, regulatory and economic environment. With more than 4,400 employees located in 26 countries, FTI Consulting professionals work closely with clients to anticipate, illuminate and overcome complex business challenges in areas such as investigations, litigation, mergers and acquisitions, regulatory issues, reputation management, strategic communications and restructuring. The company generated $1.76 billion in revenues during fiscal year 2014. More information can be found at www.fticonsulting.com . \nUse of Non-GAAP Measures \nNote: We define Adjusted Earnings per Diluted Share (\"Adjusted EPS\") as net income (loss) and earnings per diluted share, excluding the impact of remeasurement of acquisition-related contingent consideration, special charges, goodwill impairment charges and losses on early extinguishment of debt. Management uses Adjusted EPS to assess total Company operating performance on a consistent basis. We believe that this measure, when considered together with our GAAP financial results, provides management and investors with a more complete understanding of our business operating results, including underlying trends, by excluding the effects of remeasurement of acquisition-related contingent consideration, special charges, goodwill impairment charges and losses on early extinguishment of debt. Non-GAAP financial measures are not defined in the same manner by all companies and may not be comparable to other similarly titled measures of other companies. Non-GAAP financial measures should be considered in addition to, but not as a substitute for or superior to, the information contained in our Consolidated Statements of Comprehensive Income. \nSafe Harbor Statement \nThis press release includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which involve uncertainties and risks. Forward-looking statements include statements concerning our plans, objectives, goals, strategies, future events, future revenues, future results and performance, expectations, plans or intentions relating to potential refinancing transactions and other matters, and other information that is not historical, including statements regarding earnings goals for 2016 and expectations for full year 2015 results. When used in this press release, words such as \"estimates,\" \"expects,\" \"anticipates,\" \"projects,\" \"plans,\" \"intends,\" \"believes,\" \"forecasts\" and variations of such words or similar expressions are intended to identify forward-looking statements. All forward-looking statements, including, without limitation, those regarding the possible retirement of our 2020 Notes, are based upon our expectations at the time we make them and various assumptions. Our expectations, beliefs and projections are expressed in good faith, and we believe there is a reasonable basis for them. However, there can be no assurance that management's expectations, beliefs and estimates will be achieved, and the Company's actual results may differ materially from our expectations, beliefs and estimates. The Company has experienced fluctuating revenues, operating income and cash flow in prior periods and expects that this will occur from time to time in the future. Other factors that could cause such differences include declines in demand for, or changes in, the mix of services and products that we offer, the mix of the geographic locations where our clients are located or where services are performed, adverse financial, real estate or other market and general economic conditions, which could impact each of our segments differently, the pace and timing of the consummation and integration of past and future acquisitions, the Company's ability to realize cost savings and efficiencies, competitive and general economic conditions, retention of staff and clients and other risks described under the heading \"Item 1A Risk Factors\" in the Company's most recent Form 10-K filed with the SEC and in the Company's other filings with the SEC, including the risks set forth under \"Risks Related to Our Reportable Segments\" and \"Risks Related to Our Operations\". We are under no duty to update any of the forward looking statements to conform such statements to actual results or events and do not intend to do so. FTI Consulting, Inc. 1101 K Street NW Washington, DC 20005 +1.202.312.9100 Investor & Media Contact: Mollie Hawkes +1.617.747.1791 Related Articles", "external_links": [], "published": "2015-06-30T23:30:00.000+03:00", "crawled": "2015-07-01T03:36:44.000+03:00", "highlightTitle": ""}