{"organizations": [], "uuid": "9936c31ccab8e82881ccae0d04989627be68f475", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/10/idUSFit92822720150710", "country": "US", "title": "Fitch Affirms Luxembourg at 'AAA'; Outlook Stable", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Fitch Affirms Luxembourg at 'AAA'; Outlook Stable | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T00:07:00.000+03:00", "replies_count": 0, "uuid": "9936c31ccab8e82881ccae0d04989627be68f475"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/10/idUSFit92822720150710", "ord_in_thread": 0, "title": "Fitch Affirms Luxembourg at 'AAA'; Outlook Stable", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(The following statement was released by the rating agency) LONDON, July 10 (Fitch) Fitch Ratings has affirmed Luxembourg's Long-term foreign and local currency Issuer Default Ratings (IDRs) at 'AAA'. The Outlooks are Stable. The issue ratings on Luxembourg's senior unsecured foreign and local currency bonds have also been affirmed at 'AAA'. The Short-term foreign currency IDR has been affirmed at 'F1+' and Country Ceiling at 'AAA'. KEY RATING DRIVERS Luxembourg's 'AAA' IDRs reflect the following key rating drivers: Luxembourg is a small, very wealthy economy with strong governance and stable institutions. Its small manufacturing and agriculture sectors and strong focus in the financial services are reflected in the Grand Duchy's high degree of trade openness. Economic growth in Luxembourg has been robust with real GDP growth estimated to be 3.1% in 2014, against a euro area average of 1.7% and a 'AAA' median of 2.0%. Although growth is volatile due to the small size of the economy, five-year average growth is strong at 2.2%. Inflation was a weak 0.7% in 2014, and is forecast to remain weak at 0.8% in 2015 due to lower oil prices offsetting a 2pp VAT rate hike and the effects of the ECB's accommodative monetary policy. Luxembourg's external position is a key rating strength, with a large net external creditor position of 2,570% of GDP in 2015. This has resulted from the accumulation of persistent current account surpluses over more than two decades, largely due to the services account, and is largely attributable to the international banks and investments funds industries. Public finances are strong with gross general government debt/GDP low at 23.4%, and further supported by a large government portfolio of financial assets totalling 38.5% of GDP. Fitch estimates that a possible recapitalisation of the central bank could contribute roughly 4.7pp to government debt. However plans for this, including the size and the funding sources, are not yet finalised. The general government balance is forecast to be balanced in 2015, driven by a central government deficit of 1.5% of GDP and a large social security surplus of 1.7% of GDP. Fiscal policy is characterised by the government's consolidation programme 2015-19 to offset loss of e-commerce VAT revenues due to a change in the EU treatment of these revenues (around 2.2% of GDP by 2019). The consolidation effort planned for 2015-19 is estimated at 1.7% of GDP in structural terms, with 1% of GDP of the effort taken in 2015 (roughly half of which was through the VAT rate hike measure in January 2015). The measures are expected to be front-loaded in 2015-16 and initially focussed on revenue-measures before shifting to a more balanced mix by 2019. Public finance sustainability remains a challenge for Luxembourg despite the 2013 pension reforms, in the context of high fiscal costs of ageing. The European Commission's May 2015 ageing report projects ageing costs to increase by 6.2% of GDP by 2060, a downward revision from an increase of 11.7% of GDP during the 2012 exercise. This improvement is largely due to optimistic revisions to demographic assumptions (and hence potential growth). A further independent assessment of the need for reforms to mitigate ageing costs in Luxembourg is expected in early 2016, but Fitch considers it unlikely that significant reforms will be passed before the 2018 elections. The economy is very dependent on the performance of the financial services sector, which accounts for roughly 27% of Luxembourg's GDP and 12% of employment. The sector is dominated by international banks and investment funds that expose the small open economy to exogenous shocks from the international financial markets. The domestically-oriented banks are fairly insulated from the internationally-oriented banks as linkages tend to be limited to the interbank funding market. Luxembourg's investment funds' assets under management grew by a robust 18.3% in 2014 to a record EUR3,095bn, and are likely to see similar strong growth in 2015 due to support from the ECB's quantitative easing programme. RATING SENSITIVITIES The Stable Outlook reflects Fitch's assessment that downside risks to the rating are currently moderate. However, the main factor that could result in negative rating action is: A severe sudden negative shock to financial sector activity in Luxembourg could have adverse ramifications for the macro-economy, resulting in worsening labour market conditions and public finances. KEY ASSUMPTIONS Fitch assumes that there will not be an exodus of Luxembourg-based multi-national corporations or a migration of their operations arising from the impact of the Base Erosion Profit-Sharing (BEPS) initiative. Fitch assumes that new structural reforms will be taken to offset the costs of ageing on the pension system and other ageing related policies. Failure to do so could result in Luxembourg's rating gradually coming under pressure over the next decade. Fitch assumes that the sovereign's financial sector contingent liabilities will be limited to the domestically-oriented banks, even in the event of a systemic shock to the wider financial sector. In the event of a Greek exit from the eurozone, Fitch assumes this would be unlikely to trigger a systemic crisis like that seen in 2012, or another country's rapid exit. However, it would increase financial market volatility and dent economic confidence. Contact: Primary Analyst Eugene Chiam Associate Director +44 20 3530 1512 Fitch Ratings Limited 30 North Colonnade London E14 5GN Secondary Analyst Ed Parker Managing Director +44 20 3530 1176 Committee Chairperson Andrew Colquhoun Senior Director +852 2263 9938 Media Relations: Peter Fitzpatrick, London, Tel: +44 20 3530 1103, Email: peter.fitzpatrick@fitchratings.com. Additional information is available on www.fitchratings.com Applicable Criteria Country Ceilings (pub. 28 Aug 2014) here Sovereign Rating Criteria (pub. 12 Aug 2014) here Additional Disclosures <a href=\"https://www.fitchratings.com/creditdesk/press_releases/content/ridf_frame. cfm?pr_id=987767\">Dodd-Frank Rating Information Disclosure Form Solicitation Status here <a href=\"https://www.fitchratings.com/jsp/creditdesk/PolicyRegulation.faces?context =2&detail=31\">Endorsement Policy ALL FITCH CREDIT RATINGS ARE SUBJECT TO CERTAIN LIMITATIONS AND DISCLAIMERS. PLEASE READ THESE LIMITATIONS AND DISCLAIMERS BY FOLLOWING THIS LINK: here . IN ADDITION, RATING DEFINITIONS AND THE TERMS OF USE OF SUCH RATINGS ARE AVAILABLE ON THE AGENCY'S PUBLIC WEBSITE 'WWW.FITCHRATINGS.COM'. PUBLISHED RATINGS, CRITERIA AND METHODOLOGIES ARE AVAILABLE FROM THIS SITE AT ALL TIMES. FITCH'S CODE OF CONDUCT, CONFIDENTIALITY, CONFLICTS OF INTEREST, AFFILIATE FIREWALL, COMPLIANCE AND OTHER RELEVANT POLICIES AND PROCEDURES ARE ALSO AVAILABLE FROM THE 'CODE OF CONDUCT' SECTION OF THIS SITE. FITCH MAY HAVE PROVIDED ANOTHER PERMISSIBLE SERVICE TO THE RATED ENTITY OR ITS RELATED THIRD PARTIES. DETAILS OF THIS SERVICE FOR RATINGS FOR WHICH THE LEAD ANALYST IS BASED IN AN EU-REGISTERED ENTITY CAN BE FOUND ON THE ENTITY SUMMARY PAGE FOR THIS ISSUER ON THE FITCH WEBSITE.", "external_links": ["HTTP://FITCHRATINGS.COM/UNDERSTANDINGCREDITRATINGS", "https://www.fitchratings.com/creditdesk/reports/report_frame.cfm?rpt_id=752194", "https://www.fitchratings.com/creditdesk/press_releases/content/ridf_frame.", "https://www.fitchratings.com/creditdesk/reports/report_frame.cfm?rpt_id=754428", "https://www.fitchratings.com/gws/en/disclosure/solicitation?pr_id=987767", "https://www.fitchratings.com/jsp/creditdesk/PolicyRegulation.faces?context"], "published": "2015-07-11T00:07:00.000+03:00", "crawled": "2015-07-10T23:10:32.000+03:00", "highlightTitle": ""}