{"organizations": [], "uuid": "1f207fd957f9988dc8ec6879ea81d9d761d14ca0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2013-02/06/full/1360122732-4641.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss#", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/kotak-bank-launches-debit-card-for-book-lovers-115063000905_1.html", "country": "IN", "title": "Kotak Bank launches debit card for book lovers News", "performance_score": 0, "site": "business-standard.com", "participants_count": 1, "title_full": "Kotak Bank launches debit card for book lovers | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "1f207fd957f9988dc8ec6879ea81d9d761d14ca0"}, "author": "B Dasarath Reddy", "url": "http://www.business-standard.com/article/finance/kotak-bank-launches-debit-card-for-book-lovers-115063000905_1.html", "ord_in_thread": 0, "title": "Kotak Bank launches debit card for book lovers News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trying first time ever to fire up book reading habit of its customers, Kotak Mahindra Bank has launched a themed debit card featuring the cover of 'Scion of Ikshvaku' written by emerging literary figure, Amish, while partnering with the writer, here on Tuesday.\nWith this debit card a Kotak customer can avail 15% discount on any book purchased at Crossword. After launching a Marathon Card in Chennai last year the bank has come up with this novel offering to its customers as part of its effort to engage with a more personal and emotional facets of the account holders, a senior Kotak official said.\n\"The special themed debit card is a unique addition in our cards portfolio, and a prized possession for any book lover. We will continue offering exclusive propositions in areas of lifestyle and passion, and make banking with us more delightful,\" senior executive vice president Sumit Bali said.\n\nALSO READ:  Kotak Mahindra Bank launches Jifi Saver \n\nAlong with the discount offer the bank also launched 'tweet to order' where its customers registered for Hashtag banking can order Amish's new book via Twitter.\nAs the digital initiative was in the forefront of banking, it enabled the bank to be present across all platforms, including the social media, according to Sumit.\nSpeaking at the launch, author Amish said he was a banker himself for 14 years before deciding to pursue his passion of writing and now he has partnered with a bank which is looking at ways of tying into the passions customers.\nIntegration to take another 6-8 months\nResponding to a question on the merger of ING Vysya bank with Kotak, Sumit Bali said it would take another 6-8 months to complete the integration process though it has already become a merged entity from the first quarter of the current financial year. He said they expect a 10-15% credit growth in the first quarter while hoping to see full recovery by the end of this year.", "external_links": [], "published": "2015-06-30T03:00:00.000+03:00", "crawled": "2015-07-01T03:47:14.000+03:00", "highlightTitle": ""}