{"organizations": [], "uuid": "be3644881bbd268a706b9e56036f4d1ab83a64ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/87/42/8742b631fab7797cda57b4f75f888171.jpg?itok=58QEvzQV", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/ceo-jean-charles-naouri-is-shaking-up-casino-group-s-latam-strategy-and-strength?cid=rss", "country": "US", "title": "CEO Jean-Charles Naouri is shaking up Casino Group’s LATAM strategy and strength", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "CEO Jean-Charles Naouri is shaking up Casino Group’s LATAM strategy and strength", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T15:01:00.000+03:00", "replies_count": 0, "uuid": "be3644881bbd268a706b9e56036f4d1ab83a64ef"}, "author": "Parker Robinson, San Francisco Business &amp; Finance Examiner", "url": "http://www.examiner.com/article/ceo-jean-charles-naouri-is-shaking-up-casino-group-s-latam-strategy-and-strength?cid=rss", "ord_in_thread": 0, "title": "CEO Jean-Charles Naouri is shaking up Casino Group’s LATAM strategy and strength", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jean-Charles Naouri, CEO Groupe Casino Groupe Casino \nIt is not alway easy to diversify on emerging markets and take control of a new territory, especially such a large one as Latin America. When Casino Group first forayed into the market back in 2005, few could have prophesied that it would account for over half of the group’s revenue just a few years down the line. Today however, we are not talking solely about Brazil, but the whole of the Latin American region. Under CEO Jean-Charles Naouri everything has not always been seemless but the results are here: Casino Group are the number 1 retailer in Brazil, Colombia and Uruguay, with Argentina also being a huge market. It is now time to move on to a consolidation strategy, and a new organisation has been announced recently by headquarters in order to foster synergy between countries. \nFrom clusters of continental activity to international supervision \nThus, in a recent press release Casino Group have announced that their Colombian subsidiary Exito will acquire 50% of Brazil’s Grupo Pao de Azucar (GPA) and 100% of Argentina’s Libertad (both entities being already controlled by Jean-Charles Naouri’s firm). The whole transaction amounts to €1.7 billion. \nWhat this means in layman's terms is that Exito will be in charge of driving the Group’s growth over the next few years. The Colombian subsidiary will control a large market consisting of over 280 million people with €26.5 billion in sales and 2500 stores, and will be in charge of coordinating the activity over the southern part of the continent. Casino, which owns 54.8% of Exito are set to buy more shares in the near future. \nSynergies and cooperation as a counter-measure to declining results \nThe LATAM market is crucial to Casino as it represents nearly half of its global sales. Analysts are confident that the operation would help insulate Casino from the recent underperformance in some of the South American countries. \nThe main slowdown comes from Brazil: the largest country in the region is suffering from a major growth slowdown to the point of recession, hindering not only sales but also lowering the value of the Real, which has a direct impact on revenue as the conversion to the euro wipes out a large chunk of the end result. CEO Jean-Charles Naouri therefore hopes to foster synergies between the countries in order to bring down costs but also to instigate a new managerial culture based on skill transfer and cooperation. \nA strategy for the long run? \nThe reasons to the recent downturns are mainly out of Casino Group’s control and are mostly due to macroeconomic factors. Yet Jean-Charles Naouri has decided to act on what he can control: strategy. Only time will tell whether this restructuration, driven by outside elements, will be for the better. In the meantime, shares in Casino surged 2.37% in Paris trading on news of the deal. Suggested Links", "external_links": [], "published": "2015-07-31T15:01:00.000+03:00", "crawled": "2015-07-31T15:31:32.211+03:00", "highlightTitle": ""}