{"organizations": [], "uuid": "c92df01f1357c062bc3ea88fccd5dd187886b06b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/u-stocks-decline-china-shares-133305836.html?l=1", "country": "GB", "title": "Wall Street slides in wake of China crash", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Wall Street slides in wake of China crash", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T23:10:00.000+03:00", "replies_count": 0, "uuid": "c92df01f1357c062bc3ea88fccd5dd187886b06b"}, "author": "", "url": "http://finance.yahoo.com/news/u-stocks-decline-china-shares-133305836.html?l=1", "ord_in_thread": 0, "title": "Wall Street slides in wake of China crash", "locations": ["U.S.", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joseph Ciolli"], "text": "U.S. Stocks Slide After China Crash By Joseph Ciolli 50 minutes ago  Content preferences Done \nU.S. stocks fell, with equities headed for their longest losing streak since January, after the biggest slump in eight years for Chinese shares amid concern over the nation’s economic growth. \nApple Inc. slipped 1.3 percent after its worst week in six months. Baidu Inc., China’s largest search engine, lost 4.7 percent. Alibaba Group Holding Ltd. retreated 2.1 percent. Energy shares dropped as oil sank into a bear market. Teva Pharmaceutical Industries Ltd. surged 14 percent after agreeing to buy Allergan Plc’s generic-drug business for $40.5 billion. Allergan added 5.8 percent. \nThe Standard & Poor’s 500 Index slid 0.6 percent to 2,067.69 at 3:03 p.m. in New York, after touching its average price during the past 200 days. The Dow Jones Industrial Average lost 142 points, or 0.8 percent, to 17,426.53, reaching its lowest level since February. The Nasdaq Composite Index fell 1 percent. \n“The situation in China is causing concern, particularly for international companies that get a good portion of their sales from overseas,” said Matt Maley, an equity strategist at Miller Tabak & Co. in Newton, Massachusetts. “We’re already starting to see cracks in the earnings picture, so if global growth is going to slow, that will make the cracks bigger.” \nA report today showed industrial profits in the world’s second-biggest economy fell in June, sending Chinese shares tumbling on speculation a government intervention to stem a market selloff can’t be sustained amid weak growth. Data Friday showed a private manufacturing gauge unexpectedly declined in July to a 15-month low. Rally Fatigue\nThe S&P 500 has declined for four weeks out of five, taking it 2.4 percent away from its May record through Friday. The benchmark measure is still up 0.3 percent for the month. The bull market that already rivals anything since World War II in duration is showing signs of fatigue , as U.S. equities are being pushed along by the fewest stocks in more than 15 years. \nMore than 100 percent of this year’s increase in the S&P 500 is attributable to two sectors, health-care and retail. That’s the tightest clustering for an advancing year since at least 2000, data compiled by Bloomberg show. \nInvestors continue to assess data to gauge the economy’s strength and when the Federal Reserve might raise borrowing costs. A report today showed orders for business equipment rose in June for just the second time this year as U.S. factories start to regain their footing after a weak spell. Fed Meeting\nThe Fed begins a two-day meeting Tuesday as policy makers debate the timing for higher interest rates. Economists surveyed by Bloomberg continued to put the odds for a September rate increase at 50 percent. Fed Chair Janet Yellen has recently signaled that the central bank is likely to raise rates this year, while emphasizing a gradual pace for subsequent increases. \n“There’s a number of indicators such as the commodity prices and China showing a slowing global growth,” said Stewart Richardson, chief investment officer at RMG Wealth Management LLP in London. “Any further deterioration in the financial markets that could be triggered by China would push back a rate hike.” \nInvestors are also watching the earnings season, with more than 170 members of the S&P 500 due to report this week. Of the firms that have already done so, about three-quarters beat profit estimates and more than half topped sales projections. Analysts have moderated projections for a drop in second-quarter earnings to 4 percent, from 6.4 percent on July 10. Sector Moves\nThe Chicago Board Options Exchange Volatility Index rose 16 percent to 15.97, a two-week high. The gauge, know as the VIX, rose 15 percent last week, its fifth gain in six weeks. \nEight of the S&P 500’s 10 main groups retreated, led by energy, technology and raw-material shares. Banks slumped as Treasury yields fell to two-week lows. The KBW Bank Index had rallied 7.3 percent in the two weeks through last Wednesday amid lenders’ better-than-estimated earnings and improved prospects for profits as yields rose. Comerica Inc. and JPMorgan Chase & Co. decreased more than 1.4 percent Monday. \nMiner Freeport-McMoRan Inc. declined 5 percent and shares are down 26 percent in the last four sessions, the worst such stretch in more than six years. Copper slid to the lowest in six years amid concerns about China’s economy. Newmont Mining Corp. lost 2.6 percent to a 14-year low, falling in 10 of the last 12 sessions. Mylan Plunges\nFacebook Inc. fell 3 percent, the most since January, to weigh on the tech group ahead of the social network’s earnings report Wednesday. Shares had rallied 15 percent in nine sessions through July 21. Chipmakers Skyworks Solutions Inc. and Qorvo Inc. sank at least 2.9 percent, while Microsoft Corp. slumped 1.3 percent. \nMylan NV plunged 15 percent, its biggest slide in six years, after Teva abandoned its hostile takeover bid for the company upon finding a friendlier merger partner. The Nasdaq Biotechnology Index fell 1.1 percent to a more than two-week low. The gauge has slipped for five straight days, the longest such streak since April. Xoma Corp. lost 13 percent, while Incyte Corp. decreased 3.6 percent. \nEnergy stocks in the S&P 500 fell along with the price of crude oil. The resource, which has declined in eight out of the last nine trading sessions, slid 1.6 percent, extending its loss for the period to 11 percent. Phillips 66, Marathon Petroleum Corp. and Valero Energy Corp. paced the drop, retreating more than 1.7 percent. China Concerns\nCompanies reliant on China for sales declined on the day. Yum! Brands Inc., the third most-exposed U.S.-listed company with 52 percent of revenue coming from the emerging nation, decreased 0.7 percent. Apple, which got 17 percent of sales from China in 2014, lost 1.3 percent. \nChina-based companies trading in the U.S. also saw declines, with Sohu.com Inc., Baidu and Alibaba falling more than 2 percent. Yahoo! Inc., which is a major shareholder in Alibaba, dropped 2.8 percent. \nMcGraw Hill Financial Inc. lost 5.3 percent, the biggest drop in two years, after agreeing to buy SNL Financial for about $2.2 billion to add content on the banking and insurance industries. \nRepublic Airways Holdings Inc. plummeted 54 percent, the most ever, after saying a worsening pilot shortage may create more disruptions in flights the carrier makes for larger airlines. A Bloomberg index of U.S. airlines still increased for the fourth time in five days as American Airlines Group Inc. and United Continental Holdings Inc. added at least 1 percent. Beacon, Biogen\nUtility companies in the S&P 500 added 1.7 percent, as the drop in Treasury yields makes the groups dividend payout look more attractive. PG&E Corp. and American Electric Power Co. gained more than 2.4 percent. \nBeacon Roofing Supply Inc. jumped 9.7 percent, the most in more than four years, after agreeing to buy Roofing Supply Group for $1.1 billion from buyout firm Clayton, Dubilier & Rice. \nBiogen Inc. rose 2.4 percent, and earlier as much as 8.3 percent, following its biggest drop in almost seven years Friday after the drugmaker cut its 2015 outlook . Shares climbed Monday as analysts speculated the company could become the industry’s next takeover target. Stocks & Offerings", "external_links": [], "published": "2015-07-27T23:10:00.000+03:00", "crawled": "2015-07-27T23:19:36.484+03:00", "highlightTitle": ""}