{"organizations": ["Toronto Stock Exchange Operator Parts With Head of Equities Toronto Stock Exchange Operator Parts With Head of Equities Toronto Stock Exchange Operator Parts With Head of Equities Canadian company TMX Group", "Bloomberg"], "uuid": "783df6a73c80eb90cf803b2add0aa009825faaf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/executives/wp-content/uploads/sites/11/2015/04/HFT_880-400.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/executives/move/toronto-stock-exchange-operator-parts-with-head-of-equities/", "country": "US", "title": "Toronto Stock Exchange Operator Parts With Head of Equities", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Toronto Stock Exchange Operator Parts With Head of Equities", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:57:00.000+03:00", "replies_count": 0, "uuid": "783df6a73c80eb90cf803b2add0aa009825faaf7"}, "author": "", "url": "http://www.financemagnates.com/executives/move/toronto-stock-exchange-operator-parts-with-head-of-equities/", "ord_in_thread": 0, "title": "Toronto Stock Exchange Operator Parts With Head of Equities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevan Cowan"], "text": "Toronto Stock Exchange Operator Parts With Head of Equities Toronto Stock Exchange Operator Parts With Head of Equities Canadian company TMX Group has announced that it parted with Kevan Cowan as he proceeded to pursue other opportunities Advertising Print This Post Photo: Bloomberg \nThe operator of the Toronto Stock Exchange amongst many others has announced that the TMX Group Limited is undergoing an executive restructuring. The company announced that the former President of TSX Markets and the Group’s Head of Equities, Kevan Cowan, left his positions to pursue different opportunities. \nThe company’s CEO Lou Ecclestone, commented on the announcement, “Kevan’s accomplishments at TMX Group are both numerous and significant, and I would like to thank him for his contributions.” \n“The Board of Directors and the entire TMX team join me in wishing Kevan all of the very best in the future,” he added. \nTMX Group which is operating across multiple asset classes. The company runs the TSX Venture Exchange, TMX Select, Alpha, The Canadian Depository for Securities, Montréal Exchange, Canadian Derivatives Clearing Corporation, NGX, BOX Options Exchange and others. The firm announced that it will be appointing a successor to Mr. Cowan shortly. \nThroughout the interim period, the equities business will be reporting directly to the CEO of TMX Group, Mr. Eccleston. Mr Cowan served at the company for seven years. \nUnder Cowan’s tenure, the TMX has been successfully competing with a number of more prominent exchanges. Currently the TMX Group constitutes an exchange group focused on multi-asset class trading including equities, fixed income and energy. Got a news tip? Let Us Know FOUND A MISTAKE How do you feel about the article? Educated 0", "external_links": [], "published": "2015-07-14T03:57:00.000+03:00", "crawled": "2015-07-14T01:16:52.000+03:00", "highlightTitle": ""}