{"organizations": [], "uuid": "5a01ebe2db792ecccd3e738d3c28d2eb7592ec57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/06/eurozone-greece-italy-gozi-idUSL8N0ZM17V20150706", "country": "US", "title": "UPDATE 1-Italy urges compromise to keep Greece in euro zone", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Italy urges compromise to keep Greece in euro zone | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T13:55:00.000+03:00", "replies_count": 0, "uuid": "5a01ebe2db792ecccd3e738d3c28d2eb7592ec57"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/06/eurozone-greece-italy-gozi-idUSL8N0ZM17V20150706", "ord_in_thread": 0, "title": "UPDATE 1-Italy urges compromise to keep Greece in euro zone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comments, background)\nROME, July 6 (Reuters) - Italy on Monday called for Greece and its creditors to resume negotiations with a greater willingness to compromise in order to resolve Greece's debt crisis and ensure Athens is not pushed out of the euro zone.\nThe comments by Sandro Gozi, Italy's top EU Affairs official, contrast with remarks from northern European capitals which appear to have lost patience with Athens after Greeks rejected the lenders' latest terms in a referendum on Sunday.\nGozi, cabinet undersecretary for European Affairs, told Sky Italia television that talks had so far been \"a dialogue of the deaf\", for which all sides bore responsibility.\n\"If everyone thinks they are totally right and the others are totally wrong we will not make progress,\" he said. \"We have to make an effort to understand the others' point of view.\"\nGozi's comments also appear to indicate a shift in Italy's position. Before the referendum Prime Minister Matteo Renzi had pinned the blame on Greece for the breakdown of talks and said if Greeks voted against the lenders' proposal in the referendum they would be opting to leave the euro.\nItaly, with the euro zone's second highest public debt after Greece's, is considered one of the countries most vulnerable to financial market turmoil if Athens should exit the euro.\nRenzi met Economy Minister Pier Carlo Padoan on Monday to discuss the possible repercussions of the Greek referendum.\n\"We have to work for Greece to remain in the euro zone,\" said Gozi, who is seen as close to Renzi. \"I don't believe it is in the interests of anyone to push it into a no-man's land.\"\nWith Renzi under fire from anti-euro opposition parties which criticise him for being too close to German Chancellor Angela Merkel, Gozi denied that Rome was now shifting its position.\n\"Right from the start Renzi radically opposed the austerity policies of these past years and said it was an approach that had to be left behind,\" he said. (Reporting by Gavin Jones ; Editing by Crispian Balmer )", "external_links": [], "published": "2015-07-06T13:55:00.000+03:00", "crawled": "2015-07-06T13:01:59.000+03:00", "highlightTitle": ""}