{"organizations": [], "uuid": "7db45999765ccb022004aecd6d17cbb10d0aad24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iYPHHyYkzLJE/v3/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-03/schindler-to-strengthen-buyout-rules-amid-sika-s-deal-woes", "country": "US", "title": "Schindler Kills Opt Out Clause to Avoid ‘Soap Opera’ of Sika", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Schindler Kills Opt Out Clause to Avoid ‘Soap Opera’ of Sika - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T17:52:00.000+03:00", "replies_count": 0, "uuid": "7db45999765ccb022004aecd6d17cbb10d0aad24"}, "author": "Andrew Marc Noel", "url": "http://www.bloomberg.com/news/articles/2015-07-03/schindler-to-strengthen-buyout-rules-amid-sika-s-deal-woes", "ord_in_thread": 0, "title": "Schindler Kills Opt Out Clause to Avoid ‘Soap Opera’ of Sika", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Alfred Schindler, chairman of elevator maker Schindler Holding AG said he’s looking to strengthen company statutes against certain takeover scenarios after seeing a “soap opera” of a situation arise at Sika AG.\nShareholders at an extraordinary meeting on Aug. 11 will be asked to vote on introducing an opting-in clause that would ensure any acquirer of the family’s 42 stake with majority voting rights would have to bid for the rest of the company. Cie. de Saint-Gobain SA is trying to use a similar clause after agreeing to buyout the Burkard family’s interest in adhesives maker Sika, setting in motion a lengthy legal battle.\n“The Sika case is highly politicized, it is a soap opera,” Schindler told reporters. “I never want to see a Sika case at Schindler, this is why we are killing this opting out.”\nIt’s an outspoken comment by an influential industrialist who predicted other companies will follow suit. The 66-year-old chairman said it’s important for his legacy to remove the clause before standing down. Under the proposed change, anyone acquiring a stake of at least 50 percent would have to make an offer for the rest of the elevator and escalator maker.\nMoreover, any bid would have to be in line with the stock’s price at the time of the offer and couldn’t be less than 10 percent of the high of the previous 12 months, the Ebikon-based manufacturer said in a statement .\nLegal Wrangle The move is an indication that the unrelated takeover battle over Sika is sending ripples through Swiss companies’ corporate and legal structures. Sika is embroiled in a deepening legal wrangle after founding-family members opted to sell their 16 percent equity stake with majority control to Saint-Gobain.\nSchindler’s proposal is “a further step towards the introduction of a single-share category in the future,” Christian Arnold, an analyst at Vontobel, said in a note Friday. The Schindler-Bonnard family pool owned 70 percent of the voting rights and 42 percent of the capital at the end of last year, according the elevator maker’s annual report .\nSchindler fell as much as 1 percent and was trading down 0.7 percent at 153.60 Swiss francs as of 12:54 p.m. in Zurich. The stock has gained 7.3 percent this year, valuing the company at 17.2 billion francs ($18.3 billion).\nThe Burkard family were custodians of Sika for more than a century before they struck a deal with Saint-Gobain behind closed doors, without involving the Swiss company’s executives. Management and shareholders left out of the deal are resisting the takeover. The family holds a class of stock giving it 52 percent of the voting rights.\n“I want to be sure that this company is waterproof when I hand over,” Schindler said, adding that he doesn’t expect to be in the role for that much longer.", "external_links": ["http://www.schindler.com/content/dam/web/com/pdfs/reports-factsheets/2014/SchindlerAR2014_Group_Review_EN.pdf\\", "http://www.schindler.com/com/internet/en/media/press-releases-german/press-releases-2015/schindler-verankert-angebotspflicht-bei-kontrollwechsel.html\\"], "published": "2015-07-03T17:52:00.000+03:00", "crawled": "2015-07-03T14:52:00.000+03:00", "highlightTitle": ""}