{"organizations": [], "uuid": "eb5511b29bef690bf5ead4be1f37128374717bad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/36", "section_title": "Artipot: Business > Financing Articles", "url": "http://www.artipot.com/articles/1915413/how-to-gain-tax-assistance-in-johannesburg.htm", "country": "US", "title": "How to gain tax assistance in Johannesburg (Richard Mathhews)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "How to gain tax assistance in Johannesburg (Richard Mathhews)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T10:03:00.000+03:00", "replies_count": 0, "uuid": "eb5511b29bef690bf5ead4be1f37128374717bad"}, "author": "", "url": "http://www.artipot.com/articles/1915413/how-to-gain-tax-assistance-in-johannesburg.htm", "ord_in_thread": 0, "title": "How to gain tax assistance in Johannesburg (Richard Mathhews)", "locations": ["Johannesburg"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Richard Mathhews"], "text": "By Richard Mathhews Jul 23, 2015 Are you looking to secure assistance for tax preparation? There are people you can reach out to like tax companies in Johannesburg as well as computer programs that can come to your aid. People often need support in order to compute their tax returns, whether they are working, self employed or they run businesses. From websites, software programs to tax preparation firms, there are many ways to seek tax assistance in Johannesburg.When you are looking at the different services that come for tax filing assistance, these can be classified into free or chargeable services. There are reliable tax firms who can be approached when you wish to get your personal taxes filed. The tax preparer needs to get some information about yourself and paperwork to show evidence of your earnings from service and other places like bank interest, rental income and others. When all the necessary details are present, he or she will be able to provide guidance as per the local norms.Preparation for filing personal taxes can seem cumbersome. There are different directives that are given by the government in case of personal taxes. These include showing of bank balances, of earning made in a year, other sources of income and so forth. Many people are unable to compute all the necessary figures. Again, some of the guidelines that need to be followed for the filing of personal taxes might get confusing for some. For all these reasons, filing of taxes even for personal income might become a cumbersome and confusing affair.When one seeks tax assistance in Johannesburg, there are tax companies in Johannesburg who can be of assistance. These firms usually employ lawyers who can handle taxation matters in the personal tax category as well as other tax computation matters. When one seeks consultation with a law firm, their case and the nature of it is first understood and a lawyer is assigned accordingly. Many wish to get routine tax filing done while others might face charges or other complications for which they need legal assistance. One can also seek the assistance of freelance lawyers in town. These services come cheaper and are more appropriate for simpler personal tax filing cases. The freelance lawyers are easily found on online directory listings. Every city around the world has a specific business directory and the legal professionals also list their services separately. As a result, one can look up these directories and find lawyers who are in their area. One should seek initial consultation with a lawyer before he or she is employed. The initial consultation session helps one to understand whether the lawyer can help him or her out and has expertise in the area. Only then should one take up the services of the lawyer. In this case the lawyer signs a contract of confidentiality with the client to assure of protecting the information of the client as per his personal earnings details. One can rest assured that the lawyer will not divulge these details to anyone and will be able to help one to compute his or her returns and file them on time. About the Author Taxdoers is a fast growing, dynamic firm providing professional tax companies in Johannesburg and discrete financial services, Corporate Income Tax solutions and tax assistance in Johannesburg . Taxdoers provide Personal Tax Planning schemes for all types of businesses with the perspective to reduce tax liabilities. Rating:", "external_links": [], "published": "2015-07-23T10:03:00.000+03:00", "crawled": "2015-07-23T16:51:12.615+03:00", "highlightTitle": ""}