{"organizations": [], "uuid": "5940a1d36cd3d6ce467719c6b8f3a15a17f6870d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507290560.html", "country": "US", "title": "Africa: Illicit Financial Flow - African Labour Unions to Pressure Big Businesses", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Illicit Financial Flow - African Labour Unions to Pressure Big Businesses", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T12:10:00.000+03:00", "replies_count": 0, "uuid": "5940a1d36cd3d6ce467719c6b8f3a15a17f6870d"}, "author": "", "url": "http://allafrica.com/stories/201507290560.html", "ord_in_thread": 0, "title": "Africa: Illicit Financial Flow - African Labour Unions to Pressure Big Businesses", "locations": ["Nigeria", "Buratai", "Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boko Haram"], "text": "Nigeria: Troops Rout Boko Haram in Buratai's Hometown \nThey said in a communique which was presented at the end of their meeting on Tuesday that the issue of financing Africa's structural transformation was key and needed urgent attention. \n\"We wish to reiterate our commitment to support our governments and the African Union in their fight to defeat illicit financial flows from our continent,\" the unions said. \nThey further added: \"We shall continue to pressure big businesses and multinational companies to pay their fair and true share of tax in countries where their production and profit activities take place. \nThe financial hemorrhage as a result of Illicit Financial Flows (IFF) continues to harm our economies and people as monies for social spending on education, potable water, health and sanitation, food and nutrition that are real drivers of development are lost because businesses continue to find ways to manipulate tax rules and administrations.\" \n\"We therefore say stop the bleeding, which is our on-going campaign on halting Illicit Financial Flows from Africa,\" they said. Africa \nDEMO Africa has announced a list of the thirty technology start-ups from across Africa that will pitch at the 2015 … see more » Copyright © 2015 This Day. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-29T12:10:00.000+03:00", "crawled": "2015-07-29T13:54:09.316+03:00", "highlightTitle": ""}