{"organizations": [], "uuid": "068c57087ed9f7ff0087ade202dcc54ba2fdd308", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/w/e/i/w/image.related.afrArticleLead.620x365.gi3wm6.png/1436089700206.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/retail/hardware/woolworths-sliding-doors-moment-could-turn-out-to-be-the-illfated-masters-20150705-gi3wm6", "country": "AU", "title": "Woolworths' sliding doors moment could turn out to be the ill-fated Masters", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Woolworths' sliding doors moment could turn out to be the ill-fated Masters | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T22:15:00.000+03:00", "replies_count": 0, "uuid": "068c57087ed9f7ff0087ade202dcc54ba2fdd308"}, "author": "Sue Mitchell", "url": "http://www.afr.com/business/retail/hardware/woolworths-sliding-doors-moment-could-turn-out-to-be-the-illfated-masters-20150705-gi3wm6", "ord_in_thread": 0, "title": "Woolworths' sliding doors moment could turn out to be the ill-fated Masters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Woolworths' turning point came in 2008, when the board decided to dive headlong into the home-improvement market, taking on market leader Bunnings. supplied Share on twitter by Sue Mitchell Every company has a \"sliding doors\" moment at some point in its history.\nAt David Jones it was former chief executive Mark McInnes' decision in 2003 to close prematurely the retailer's loss-making online gift shop. It would take seven years for David Jones to relaunch its online store, during which time it missed out on millions of dollars of sales and struggled to maintain its relevance in a fast-changing retail market.\nMyer's sliding doors moment came in 2007, a year after a consortium of private equity investors bought the struggling department store for $1.4 billion. They sold Myer's flagship Melbourne store for $600 million, giving themselves a nice little dividend and capital return but leaving the retailer with massive lease liabilities and mountains of debt. Myer would arguably not be in the trouble it is now – facing its fifth consecutive annual decline in earnings and needing to raise capital to strengthen a stretched balance sheet – if the Melbourne store had not been sold.\nWoolworths' turning point came in 2008, when the board decided to dive headlong into the home-improvement market, taking on market leader Bunnings.\nAccording to one account a Bain and Co partner asked to assess the strategy advised the board against opening a chain of big-box home-improvement stores. But the board, desperate to find a new source of growth, or \"oxygen\", outside food, liquor and general merchandise disregarded his advice and pressed ahead.\nWhile outgoing Woolworths chief executive Grant O'Brien insists the rationale for entering the $45 billion home-improvement market remains valid, there would be more than a few Woolworths executives and directors, past and present, wondering if Australia's largest retailer would not be in the trouble it is now if it had decided against going into home improvement.\nThe strategy has not only cost the company more than $2 billion in capital and racked up losses of more than $600 million over the past four years, it has been a big distraction for management and the board and has contributed directly to the problems in supermarkets.\nConsensus view The consensus view among analysts and investors is that Woolworths pushed up supermarket margins to record levels – despite increased competition from Coles and Aldi – to fund the home-improvement strategy.\nNow supermarket sales and earnings are under pressure and the losses continue to mount at Masters.\nMasters is forecast to lose between $200 million and $250 million in the 12 months ending June 2015 and some believe losses will be even higher this financial year.\nMr O'Brien is convinced Masters will contribute to profit at some stage in the future, but analysts are almost unanimous in believing that Woolworths should pull the plug, either before the appointment of a new chief executive or after.\nWhen it happens it's not going to be pretty.\nWoolworths might be able to extract some value from selling the still-profitable Home Timber and Hardware business to rivals such as Metcash's Mitre 10 or Natbuild.\nBut analysts believe that Masters cannot be sold as a going concern, at least in its present form.\nShould be liquidated Merrill Lynch analyst David Errington, one of the few analysts with a buy recommendation on Woolworths, believes Masters should be liquidated and the assets – the stores, undeveloped sites and inventory – sold for cash.\nThis would be a big humiliation for Woolworths, particularly after the embarrassing sale of the Dick Smith chain to private equity almost three years ago at a fraction of the price at which it was floated 18 months later.\nHowever, liquidating the Masters business could raise much-needed cash to reinvest in supermarkets and bring an end to the huge cash drain on the company.\nIn a report last week, Mr Errington estimated that exiting Masters could cost about $1 billion in non-cash write-downs but realise net cash of $1 billion.\nWoolworths could sell about 20 of its 50-odd Masters stores to competitors such as Bunnings and Mitre 10 for about $30 million each, which is close to the cost of developing the stores.\nAnother 30-odd stores might fetch about 40¢ in the dollar, or about $14 million per store, taking total proceeds to about $1.02 billion.\nMasters has about $600 million in inventory, which could be sold off for at least $500 million cash, while Home Timber and Hardware could be worth $150 million.\nPut option Woolworths would have to pay about $1 billion to its joint-venture partner Lowes, which has a put option for its one-third stake and can give notice to exercise after October 2015.\n\"The company would need to take a $1 billion non-cash charge, as the book value of Masters is around $3 billion,\" Mr Errington said. \"However, this could open the door for future advantages in tax [because a tax loss would be realised].\"\nMerrill Lynch's numbers are higher than those of other analysts such as Citigroup's Craig Woolford. In a report in April, Mr Woolford estimated it would cost Woolworths $1.6 billion to exit leases and buy the Lowe's put option.\nHowever, Woolworths could recoup at least $700 million and as much as $970 million selling sites and stock, so the net loss would be between $300 million and $900 million.\nWhatever the final cost, exiting Masters would bring an end to the large operating losses, ease the cash drain on the company and enable Woolworths to focus its attention on its core business, supermarkets.\nMr Errington suggests Woolworths should clear the decks and sell the BIG W discount department store chain, where earnings have almost halved over the past few years.\nWoolworths has previously ruled out selling BIG W, saying the chain is integral to its growth strategy.\nHowever, Merrill Lynch argues that Woolworths would be better off without it if the sale proceeds, which could be as much as $1.5 billion, and the cash from inventory were directed towards food and liquor.\nUpside value \"Even if Woolworths was able to turn BIG W around and return earnings to $200 million the upside value would be minor compared to the value to Woolworths shareholders if supermarkets could be turned around,\" Mr Errington said.\nUnlike Masters, BIG W has some value and could be attractive to private equity investors or trade buyers.\nAfter being critical of Woolworths for the past few years, Merrill Lynch believes the market is overly negative now about the retailer's prospects and is overestimating the investment required to restore same-store sales and earnings growth in supermarkets.\nCommentators such as former Woolworths executive Bill Wavish and several analysts believe Woolworths will have to invest more than $1 billion into prices and service to lure shoppers back to stores and overcome perceptions its prices are too high.\nHowever, Mr Errington believes the investment required to get same-store sales growing at 2 or 3 per cent again could be more like $400 million to $500 million.\nAnything more would be a waste of money because Coles, the second player in a strong duopoly, is unlikely to put its earnings at risk by getting involved in a price war.\nIt was only a year ago that Woolworths was achieving same store food and liquor sales growth of more than 3 per cent and the future looked reasonably bright.", "external_links": ["https://twitter.com/suemitchellafr"], "published": "2015-07-05T22:15:00.000+03:00", "crawled": "2015-07-05T18:08:05.000+03:00", "highlightTitle": ""}