{"organizations": [], "uuid": "50201cea170add1f841230bdc174c7516197fe71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/pepsitruck2.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=COTY", "section_title": "Yahoo! Finance: COTY News", "url": "http://www.thestreet.com/story/13214409/1/brands-that-pepsico-and-general-mills-should-get-rid-of.html?puc=yahoo&cm_ven=YAHOO", "country": "US", "title": "Brands That PepsiCo and General Mills Should Get Rid Of", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Brands That PepsiCo and General Mills Should Get Rid Of", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T17:09:00.000+03:00", "replies_count": 0, "uuid": "50201cea170add1f841230bdc174c7516197fe71"}, "author": "", "url": "http://www.thestreet.com/story/13214409/1/brands-that-pepsico-and-general-mills-should-get-rid-of.html?puc=yahoo&cm_ven=YAHOO", "ord_in_thread": 0, "title": "Brands That PepsiCo and General Mills Should Get Rid Of", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint \nNEW YORK ( TheStreet ) -- Breaking up is suddenly not hard to do if you are a huge consumer products company. \nExecutives are now looking at divestitures as the right thing to do to generate value for shareholders, as well as to prevent activist investors from knocking at the front door. \nOn Thursday, consumer products giant Procter & Gamble ( PG - Get Report ) said it would sell 43 beauty brands to fragrance and cosmetics maker Coty ( COTY - Get Report ) in a deal valued at about $15 billion. \nP&G, the maker of Tide laundry soap, Crest toothpaste and a plethora of other packaged goods, will sell Coty well-known hair care and cosmetics brands such as Miss Clairol, CoverGirl and Max Factor. The deal also includes P&G's retail hair color and fine fragrance businesses. \nMust Read: Places to Never Use a Debit or Credit Card to Make a Payment \nThe deal marks a striking reversal in strategy for P&G, which is led by its long-time executive A.G. Lafley, who returned in 2013 after serving as chairman and CEO from 2000 to 2009. Lafley has been with P&G since 1977. It was mostly under Lafley's watch that P&G shelled out roughly $80 billion over the past two decades to buy an array of businesses that dominate supermarket shelves, such as Gillette razors, Duracell batteries and Iams pet food. \nNow, the company is reversing course to focus on lifting sales of Tide detergent and Pampers diapers. The plan is to divest from about 100 brands, leaving about 65 in the P&G portfolio. \nA few other mainstays of supermarket and big-box store shelves could also be slimming down vast product portfolios to bulk up profits and reallocate money to faster-growing businesses. \nWith many consumers increasingly preferring to buy fresh organic produce, General Mills ( GIS - Get Report ) , maker of Yoplait yogurt and Cheerios cereal, may be poised to divest of its Green Giant frozen and canned vegetable business. \nIn the most recent quarter, General Mills execs made the decision to redirect resources that supported Green Giant's operations in the U.S. to other businesses. As a result, the company reduced its future sales and profitability projections for Green Giant, triggering a steep $260 million impairment charge. \n\"You have already heard about a number of opportunities that we have around the world in cereal, yogurt and snacks, and you will hear more about it in July,\" said General Mills chairman and CEO Ken Powell to an analyst on the company's July 1 earnings call . 1 of 3", "external_links": [], "published": "2015-07-10T17:09:00.000+03:00", "crawled": "2015-07-10T17:15:15.000+03:00", "highlightTitle": ""}