{"organizations": [], "uuid": "dcc3ce18ed6b2932fbab3c8f83e3c449e5d5c615", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/oDcEPpQdZRYYZzmPB1bLmA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/osborne-legacy-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-skynews/?format=rss", "section_title": "Finance News | Sky News - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/budget-slow-pace-welfare-cuts-183703595.html", "country": "GB", "title": "Budget To Slow Pace Of Welfare Cuts: Sky Sources", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Budget To Slow Pace Of Welfare Cuts: Sky Sources", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T02:58:00.000+03:00", "replies_count": 0, "uuid": "dcc3ce18ed6b2932fbab3c8f83e3c449e5d5c615"}, "author": "", "url": "https://uk.finance.yahoo.com/news/budget-slow-pace-welfare-cuts-183703595.html", "ord_in_thread": 0, "title": "Budget To Slow Pace Of Welfare Cuts: Sky Sources", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nThe Budget will reveal the timetable for £12bn welfare cuts by 2017/18 has been extended by at least a year, Sky News understands. \nGeorge Osborne has already said he has found the £12bn, but Sky (Other OTC: BSYBF - news ) sources say the full amount will now be delivered over a longer timeframe than announced in the March Budget and envisaged before the election. \nThis is partly because buoyant tax revenues and new Office of Budget Responsibility projections mean the Chancellor can meet his fiscal mandate without making the welfare cuts within two years. \nBut there is also some pushback in Whitehall and internationally against too rapid a pace in cuts. \nThe Organisation for Economic Co-operation and Development (OECD) warned the two-year timetable would have an \"impact on growth\" this month. \nMr Osborne will set out his plans in a \"bold\" Budget, in which he is expected to use the Greek crisis as an argument for keeping borrowing under control. \nThe rationale for slowing the pace of cuts is clear - a slower timetable on withdrawal of tax credits, for example, will allow for more fundamental reforms to raise low pay. \nOn housing benefit too, extra time will allow housebuilding to increase and temper the rise in rents and housing benefits. \nSenior sources in Whitehall suggested that the welfare cuts by 2017/18 would amount to around £8bn - still substantial and focused on housing benefit and tax credits. \nThe move also raises the prospect of a prolonged cash freeze in working age benefits beyond the two years announced by Mr Osborne at the last Conservative Party conference. \nThe already announced cut to welfare budgets arising from the BBC taking responsibility for free licence fees for the over-75s will only save money after 2018. \nMr Osborne has ceased to mention the 2017/18 date in relation to welfare cuts. \nThe Conservative manifesto seemed to imply a commitment to 2017/18, but the IFS points out the wording was a little vague. \nThe Government is still expected to meet its fiscal targets for debt to keep falling as a share of GDP and the current budget to be balanced by 2017/18, because of buoyant tax revenues and growth. \nOn tax, the Chancellor is expected to defy calls from Tory MPs to cut the 45p top rate of income tax and announce action on increasing the £10,600 threshold when workers start paying tax. \nThere is also likely to be action on increasing the level at which the 40p rate of tax kicks in. \nIn his Budget speech, Mr Osborne is expected to say: \"Our long-term economic plan is working. \n\"But the greatest mistake this country could make would be to think all our problems are solved. \n\"You only have to look at the crisis unfolding in Greece to realise that if a country's not in control of its borrowing, the borrowing takes control of the country.\" \nThe Chancellor is also expected to promise to be \"bold in transforming education, bold in reforming welfare, bold in delivering infrastructure, bold in building the Northern Powerhouse, bold in backing the aspirations of working people… it is a Budget that sets the way to secure Britain's future\".", "external_links": [], "published": "2015-07-08T02:58:00.000+03:00", "crawled": "2015-07-08T03:12:21.000+03:00", "highlightTitle": ""}