{"organizations": [], "uuid": "f6cb479204424491240800b16dd2c6ea4da3126c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/m/t/m/9/image.related.afrArticleLead.620x365.gims6u.png/1438158917640.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/opinion/columnists/childcare-subsidies-not-essential-for-getting-women-back-to-work-20150729-gims6u", "country": "AU", "title": "Childcare subsidies not essential for getting women back to work", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Childcare subsidies not essential for getting women back to work | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T11:59:00.000+03:00", "replies_count": 0, "uuid": "f6cb479204424491240800b16dd2c6ea4da3126c"}, "author": "Jennifer Hewett", "url": "http://www.afr.com/opinion/columnists/childcare-subsidies-not-essential-for-getting-women-back-to-work-20150729-gims6u", "ord_in_thread": 0, "title": "Childcare subsidies not essential for getting women back to work", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "David Jones female employees lining up to clock on at the bundy machine in Sydney in December 1930. Canada has higher rates of female participation in the workforce because of a host of reasons. Share on twitter by Jennifer Hewett Joe Hockey often cites Canada's high level of female participation in the workforce as the model for Australia to emulate. If only, he says, Australia could equal that it would add $25 billion to the country's annual gross domestic product. The Treasurer uses this figure as the economic justification for the budget's increased spending on childcare . The additional subsidies, he insists, will help more Australian mothers back into the workforce .\nAnd there's no doubt ever more taxpayer funds for childcare is politically popular and would help many Australian families.\nThere's only one problem: Canada's high female participation rate seems to have very little if anything to do with government childcare assistance. The Canadian system, almost everywhere, is actually far less generous than Australia's $8 billion of subsidies worth a year – even before the Abbott government's latest increases in payments. And while female labour force participation has increased significantly in both countries from about 50 per cent in the late 1970s, it has been higher in Canada for about four decades.\nThe latest OECD figures show that rate was 70.5 per cent in Australia in 2013, compared to 74.6 per cent in Canada for women aged between 15 and 64.\nProductivity Commissioner Peter Harris says it's not obvious on first principles why Canada leads Australia on this, and has for decades, given the similarity of the societies otherwise.\n\"Factors like subsidised childcare may have some role, but female participation appears to have out-performed in Canada for longer than the ready availability of childcare,\" he says. \"Perhaps [higher] levels of tertiary education, where Canada has had an advantage, or cultural factors in the workplace, despite these being much harder to demonstrate objectively, are involved.\"\nDifferent attitude That sounds like a polite way of suggesting that women in Canada, as in North America generally, were earlier beneficiaries of a less-male-dominated culture and the flow-on effects of the women's revolution of the 1960s. Having worked in Canada in the 1990s, Harris postulates a personal view that he found a different attitude there to women in the workplace.\n Yet Canada also has higher levels of female participation overall than the US, which is almost 70 per cent. Even so, it's the difference in female participation between otherwise remarkably parallel economies, political cultures and wage rates in Canada and Australia that is so striking. And out-of-pocket costs for childcare in Australia – about 27 per cent of average wages – might be above the Organisation for Economic Co-operation and Development average but they are still well below those in Canada.\nClearly there is no one factor involved. The Productivity Commission points out the long-term rise in female participation in the workforce, as in most developed economies, reflects increased levels of education, greater social acceptance of working mothers, declining fertility rates, better access to childcare services and part-time work and more flexible working arrangements.\nBut it also reports a key reason for Australia's lower rate appears to be the Australian system of various tax and family welfare benefits. The reduction in these payments as family incomes increase means it often makes little financial sense for women to work more in households of lower and middle-income levels.\nThat also helps explain why Australian women who do return to paid work after having children find it is more feasible to work at most three days a week. The combination of losing benefits plus paying Australian income tax means their effective marginal tax rate is just too high otherwise, particularly in families with household income of less than $75,000 a ear.\nOne obvious result is the percentage of employed mothers working only part-time is one of the Australian statistics that do really stand out internationally. Compared to Canada, or any other Western country, it is much higher.\nAbout 38 per cent of Australian couple families have one parent working full-time and one parent working part-time, compared to the OECD average of 24 per cent.\nIncreasing political focus It's true there is increasing political focus from opposition parties in Canada on providing more government support for formal childcare, particularly in the lead-up to the election in October.\nBut Canada's taxpayer-funded contributions remain relatively modest. The big exception is Quebec, where the provincial government heavily subsidises those attending formal childcare centres at a cheap flat rate of $C7 ($7.38) a day. Otherwise, Canada's national record has mainly been on providing additional funds to families with dependent children, whether or not the mothers work, and leaving how to spend it largely up to them.\nThus there is a means-tested childcare benefit for children, similar to Australian family tax benefits, although it is worth far less money.\nIn 2006 the then new conservative Harper government added a \"universal childcare benefit\" paid to parents regardless of work. This income is taxable and has just increased from $100 to $160 a month for each child under six and up to $60 a month for each child between six and 17 years. Even with increases, that monthly rate is hardly enough to pay for a day's childcare in Australia. It's also more like a non-means-tested family benefit, rather than additional direct assistance for the cost of childcare.\nLike Australia, Canada has complicated maternity and parental leave provisions. The Canadian system usually allows a few months paid by the employer at close to full pay, with several more months by the government at a percentage of average weekly income. There's certainly no political interest in following the Abbott government's attempt to prevent \"double dipping\".\nBut Hockey's hopes more money for childcare will raise female participation rates to Canadian levels seem more likely to end up in the nappy bin.\nJennifer Hewett was in Canada to attend the Australia Canada Economic Leadership Forum.", "external_links": ["https://twitter.com/http://twitter.com/jennifer_hewett"], "published": "2015-07-29T11:59:00.000+03:00", "crawled": "2015-07-29T16:36:46.228+03:00", "highlightTitle": ""}