{"organizations": [], "uuid": "c6916712014fede2ddc00a57db9ea6c5f58de438", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/08/markets-forex-idUSL8N0ZO0PC20150708", "country": "US", "title": "FOREX--Yen hits six-week high as Chinese turmoil saps risk appetite", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "FOREX--Yen hits six-week high as Chinese turmoil saps risk appetite | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T11:58:00.000+03:00", "replies_count": 0, "uuid": "c6916712014fede2ddc00a57db9ea6c5f58de438"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/08/markets-forex-idUSL8N0ZO0PC20150708", "ord_in_thread": 0, "title": "FOREX--Yen hits six-week high as Chinese turmoil saps risk appetite", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Yen gains across board as Asian stocks slide\n* Euro up a touch as Greece gets new deadline\n* Commodity currencies sink broadly\nBy Jemima Kelly\nLONDON, July 8 (Reuters) - The yen climbed to a six-week high against the dollar on Wednesday, after Chinese stocks struggled to pull out of a tailspin, pushing investors already shaken by Greece's debt crisis to seek out safe havens.\nThe euro managed to inch up against the dollar, having been boosted a little late on Tuesday after member states gave Athens until the end of the week to come up with a proposal for sweeping reforms in return for loans.\nWith the turmoil in China rattling investors, the yen gained 0.9 percent versus the dollar to 121.45, its strongest since late May. The Swiss franc, another safe haven, gained only slightly, with speculation the Swiss National Bank was again intervening to stem the currency's gains.\n\"The yen continues to be the safe-haven currency of choice. The Swiss franc is not doing too badly but of course we have the SNB trying to hold it up, so it doesn't move as smoothly,\" said Alvin Tan, FX strategist at Societe Generale in London.\nRiskier high-yielding commodity currencies sank across the board, with the Australian dollar -- often used as a China proxy -- hitting a six-year low. Oil-rich Norway's crown also sank to a six-month low as crude prices fell.\nChinese stocks plunged again on Wednesday after the securities regulator warned investors were in the grip of \"panic sentiment\" and the market showed signs of freezing up as firms scrambled to escape the rout by having their shares suspended.\n\"In Asia the chief concern is how far Chinese shares could fall. Another factor to watch as a barometer of sentiment is sliding commodities, particularly copper,\" said Masafumi Yamamoto, senior strategist at Monex in Tokyo.\nThe euro also fell against the yen, trading down 0.7 percent on the day at 133.99. Against the dollar, it edged up 0.1 percent against the dollar to $1.1026\nAt an emergency summit in Brussels on Tuesday, representatives of the 19-country euro zone said all 28 European Union leaders would meet on Sunday to decide Greece's fate.\nAnalysts at BNP Paribas said there was no reason to be particularly optimistic at this stage and warned that even a full resolution of Greek stress would still leave the door open for renewed euro weakness.\nHowever, \"price action does suggest scope for more short-covering if markets begin to anticipate a deal,\" they wrote in a note to clients. (Additional reporting by Shinichi Saoshiro in Tokyo and Ian Chua in Sydney; Editing by Catherine Evans )", "external_links": [], "published": "2015-07-08T11:58:00.000+03:00", "crawled": "2015-07-08T11:07:09.000+03:00", "highlightTitle": ""}