{"organizations": [], "uuid": "3efd4f4eed138147af0a00dfc70dd5aa5870c172", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/maruti-benz-300.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/automobiles/mercedes-benz-launches-3-luxury-models-in-india-priced-up-to-rs-2-60-cr/110860", "country": "IE", "title": "Mercedes Benz launches 3 luxury models in India, priced up to Rs 2.60 cr", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Mercedes Benz launches 3 luxury models in India, priced up to Rs 2.60 cr | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T01:12:00.000+03:00", "replies_count": 0, "uuid": "3efd4f4eed138147af0a00dfc70dd5aa5870c172"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/automobiles/mercedes-benz-launches-3-luxury-models-in-india-priced-up-to-rs-2-60-cr/110860", "ord_in_thread": 0, "title": "Mercedes Benz launches 3 luxury models in India, priced up to Rs 2.60 cr", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Pininfarina says still hoping to agree sale to Mahindra and Mahindra Hyundai Creta vs Maruti Suzuki S-Cross: 6 power points Fiat Chrysler raises outlook as Q2 profits jump 70 percent German carmaker Mercedes-Benz today launched three ultra luxury vehicles — S500 Coupe, S63 AMG Coupe and SUV G63 AMG ‘Crazy Colour’ edition — priced between Rs 2 crore and Rs 2.60 crore (ex-showroom Delhi).\nThe company also introduced its exclusive ‘designo’ platform that allows customers to choose exclusive paints, high quality interiors, trims and features.\n“The fully customized S-Class Coupe is priced at Rs 2 crore, the top end AMG S 63 Coupe at Rs 2.60 crore and the AMG G63 ‘Crazy Colour’ edition at Rs 2.17 crore (all prices ex-showroom Delhi),” the company said in a statement.\nMercedes-Benz India Managing Director & CEO Eberhard Kern said: “It is never before that Mercedes-Benz has launched three exclusive luxury cars in a day. These three supremely exclusive cars live up to our claim of ‘Best or Nothing’ in the most detailed and compelling fashion.”\nHe said the company will be targeting high net worth individuals in India with the new products and expand the top end segment of the luxury car market which is about a few hundred units a year.\nThe S500 Coupe and AMG S 63 Coupe feature optionally available unique headlamps with a total of 94 Swarovski crystals, while the AMG G 63 ‘Crazy Colours’ will be available in solar beam, sunset beam and alien green for enhanced personalisation, the company said.\nOn ‘designo’ platform, Kern said: “We have seen an increasing demand for exclusivity and customisation from our customers and the launch of the ‘designo’ range will further reinforce Mercedes-Benz’s customer focused approach, transforming customer delight to the next level.”\nMercedes Benz plans to introduce 15 new products this year. It has now introduced nine in the Indian market so far.\nThe company had posted a 43 per cent sales growth in India at 3,093 units in the second quarter of 2015. During the quarter Mercedes-Benz sold 3,566 units, overtaking rival Audi, which sold 3,139 units.\nIn January-June, the company’s sales grew 41 per cent at 6,659 units compared with 4,717 units in the year-ago period.\nIn the first six months of 2015, it had sold almost as many cars as it did in the entire year of 2012.\nIn the remaining months of the year, the company will open 12 more dealerships to add to its 73 dealers in 39 cities, he added.\n 5:12 pm", "external_links": [], "published": "2015-07-31T01:12:00.000+03:00", "crawled": "2015-07-31T18:05:29.825+03:00", "highlightTitle": ""}