{"organizations": [], "uuid": "f20e8888741166e491f5931668551b2857034082", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/w/v/r/6/image.related.afrArticleLead.620x365.gi6mlc.png/1436264876823.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/mining/iron-ore/atlas-irons-david-flanagan-keeps-the-faith-as-critical-capital-raising-looms-20150707-gi6mlc", "country": "AU", "title": "Atlas Iron's David Flanagan keeps the faith as critical capital raising looms", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Atlas Iron's David Flanagan keeps the faith as critical capital raising looms | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T15:18:00.000+03:00", "replies_count": 0, "uuid": "f20e8888741166e491f5931668551b2857034082"}, "author": "Tess Ingram and Amanda Saunders", "url": "http://www.afr.com/business/mining/iron-ore/atlas-irons-david-flanagan-keeps-the-faith-as-critical-capital-raising-looms-20150707-gi6mlc", "ord_in_thread": 0, "title": "Atlas Iron's David Flanagan keeps the faith as critical capital raising looms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Atlas Iron founder David Flanagan: 'Two weeks ago, [the iron ore price] was $US10 a tonne higher. Is it likely to do that sort of stuff again? Yes, because it is going to cycle around.' by Tess Ingram and Amanda Saunders Atlas Iron founder David Flanagan insists the struggling iron ore miner can come back from the brink of collapse to pull off a $180 million capital raising in the next week, despite the iron ore price plunging back down towards $US50 a tonne .\nAtlas could not have picked a worse time to undertake a capital raising. After a few months of minor relief for the sector, where iron ore clung to the $US60 mark, Australia's juniors are again under pressure. Iron ore has staged a steep, three-day decline to $US52 a tonne and has now fallen 20 per cent from its recent peak in June.\nAtlas is rattling the tin on the east coast of Australia this week, after a roadshow in Asia and London. It is has so far raised $15 million from existing investors, and its contractors have committed $43 million.\nMr Flanagan told Fairfax Media on Tuesday that the iron ore price fall presented a challenge. But he insisted that the company-saving $180 million equity raising, at 5¢ a share, was achievable.\nHe said the $15 million already sourced from existing investors was \"unusual\" given that the majority of commitments traditionally arrive in the final days of a shareholder offer.\n\"It either means this is an unusual roadshow or we are going to get absolutely swamped in the last few days, or not, because the iron ore price has been doing different things – we will see what happens,\" he said.\n'\"When the iron ore price was $US10 a tonne higher, it was a bit easier, but that's all right; it is all part of it.\n\"It makes it easier for there to be no elephant in the room, you just say, 'right, the iron ore price is volatile'. You know, two weeks ago it was $US10 a tonne higher. Is it likely to do that sort of stuff again? Yes, because it is going to cycle around.\"\n Fundies doubtful Mr Flanagan continues his 21-day roadshow this week, targeting brokers and retail investors in Sydney and Melbourne to commit to the raising ahead of meetings with domestic institutional investors next week, before the offer closes on Wednesday. He has until Monday for the retail component.\nFund managers told The Australian Financial Review that Atlas has had some trouble lining up meetings, and they have niggling doubts about how the junior can make its planned recapitalisation work.\n\"This is not your classic blue-chip investment, that's for sure,\" Mr Flanagan said. \"But I would say there is definitely going to be strong institutional support. A large number of the instos in the northern hemisphere have said they are going to participate, but I haven't met the Aussie ones yet, so we don't know.\"\nAt current prices, many of the country's iron ore players are in a precarious position. On Monday night, Atlas was forced by the Australian Securities and Investments Commission to issue a supplementary prospectus to clarify its cost position. The miner said its break-even was $US52.50 to $US53.50, but that would fall to about $US50 by December.\nWhile that puts Atlas's production under water at current spot prices, Mr Flanagan said the company was making money on the ore it shipped because it had locked in prices for its cargos to China as far ahead as December at around $US57 to $US58 a tonne.\nAtlas had temporarily suspended its operations, but the junior is now back in production at all three of its Pilbara mines.\nThe industry is in a race to cut costs, and Tim Schroeders, resources fund manager at Melbourne-based Pengana Capital, says the threshold for higher-cost players to fall out of the market is being pushed lower.\nMr Flanagan returned as managing director of Atlas in June , replacing Ken Brinsden, who moved to the role of executive director. The issue price of 5¢ a share for its $180 million raising is lower than its shares have ever traded.\nAtlas shares have been in a trading halt since April. The stock last traded at 12¢ – a 58 per cent premium on its capital raising issue price.", "external_links": [], "published": "2015-07-07T15:18:00.000+03:00", "crawled": "2015-07-07T18:04:48.000+03:00", "highlightTitle": ""}