{"organizations": [], "uuid": "f85d614a5c1f7d57103b5374f150c1621decf3a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/b/a/7/r/image.related.articleLeadwide.620x349.gibd8g.png/1436780092128.jpg", "site_section": "http://www.canberratimes.com.au/business/carbon-economy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/comment-and-analysis/greece-debt-crisis-third-bailout-is-a-deal-at-last--if-it-is-locked-20150713-gibd8g.html", "country": "AU", "title": "Greece debt crisis: Third bailout is a deal at last - if it is locked", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Greece debt crisis: Third bailout is a deal at last - if it is locked", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T17:05:00.000+03:00", "replies_count": 0, "uuid": "f85d614a5c1f7d57103b5374f150c1621decf3a9"}, "author": "", "url": "http://www.canberratimes.com.au/business/comment-and-analysis/greece-debt-crisis-third-bailout-is-a-deal-at-last--if-it-is-locked-20150713-gibd8g.html", "ord_in_thread": 0, "title": "Greece debt crisis: Third bailout is a deal at last - if it is locked", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended MH17 anniversary - sewing solace\nMH17 - Sunflowers growing in the Netherlands\nChina airs vision of 'jihad' recruits\nBailout ball in Greece's court\nGreek Parliament votes in favour of bailout plan\nReplay video Return to video Video settings Please Log in to update your video settings\nEurozone clinches deal with Greece An agreement is reached with Greece after 17 hours of negotiations, allowing the near-bankrupt country to stay in the Eurozone.\nPT1M39S 620 349 Autoplay On Off Video feedback Video settings Is this it? Have months of negotiation, threat and counter-threat finally delivered a deal that stops Greece tumbling out of the euro and into a crisis far worse than the one it and Europe have already endured?\nIt's more than possible, perhaps even probable. Marathon talks in Brussels ironed out the final differences between the two sides on the architecture of a new financial lifeline, in return for fresh commitments to rein in government spending and bear down on deficits.\nWhether the Greek parliament and the Greek people agree still remains to be seen.\nAs German chancellor Angela Merkel said after the talks concluded, however, it is still going to be a long and difficult road.\nThe Tsipras government has agreed to even tougher terms, including an accelerated €50 billion privatisation programme. Photo: AP\nA long road because the bailout, Greece's third, has the same basic formula as the first bailout in 2010, and the second in 2012: budget cuts in Greece, in return for continued funding from Europe.\nThe first two bailouts have not prevented a 25 per cent contraction in Greece's economic output, and in the opinion of many, have contributed to it. There is no guarantee that the new deal will do any more to get Greece growing.\nA difficult road because even though the Greek government, European leaders, the International Monetary Fund and the European Central Bank have reached agreement, the rescue has to be implemented.\nThe first two bailouts have not prevented a 25 per cent contraction in Greece's economic output. Photo: Getty Images\nGreece's parliament agreed to the compromise proposal that Greece took to Brussels, but in the wake of a strong referendum vote against compromise only a week earlier, there was unhappiness inside the Greek parliament, and anger outside it.\nNow, the Tsipras government has agreed to even tougher terms, including an accelerated €50 billion ($75 billion) privatisation programme.\nEuropean leaders say they are confident that Greece can politically commit to the new austerity measures and make an agreement in principle an agreement in fact, but emotions in Greece will be running high.\nThe alternative looks to be even more fraught for Greece, however.\nThe agreement in Brussels sets the stage for a rescue that begins with a €25 billion recapitalisation of Greece's banks, which have run out of money.\nWithout that bank lifeline, Greece would need to refinance the banks itself, and to do that it would need to issue some kind of government IOU that would immediately become a de-facto new currency - a new drachma.\nGrexit - Greece's exit from the European Monetary Union - would have begun and a new currency would have only a fraction of the value of the euros it replaces.\nThe value of all Greek assets including bank deposits would then be heavily devalued.\nThe Tsipras government is seeking to avoid that outcome by agreeing to tough bailout terms. Whether the Greek parliament and the Greek people agree still remains to be seen.", "external_links": [], "published": "2015-07-13T17:05:00.000+03:00", "crawled": "2015-07-13T18:27:58.000+03:00", "highlightTitle": ""}