{"organizations": [], "uuid": "71a46c07e75f0224120c6e29fe7fac57eafc203d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialdirector.co.uk", "main_image": "http://www.financialdirector.co.uk/IMG/165/323165/tushar-mozaria.jpg", "site_section": "http://www.financialdirector.co.uk/feeds/rss/maxcontentwords/75/category/corporate-finance", "section_title": "Corporate finance - financial_director", "url": "http://www.financialdirector.co.uk/financial-director/news/2419713/investors-to-pour-cold-water-on-morzaria-s-chances-as-next-barclays-ceo", "country": "GB", "title": "Investors to pour cold water on Morzaria’s chances as next Barclays CEO", "performance_score": 0, "site": "financialdirector.co.uk", "participants_count": 1, "title_full": "Investors to pour cold water on Morzaria’s chances as next Barclays CEO", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T12:28:00.000+03:00", "replies_count": 0, "uuid": "71a46c07e75f0224120c6e29fe7fac57eafc203d"}, "author": "Richard Crump", "url": "http://www.financialdirector.co.uk/financial-director/news/2419713/investors-to-pour-cold-water-on-morzaria-s-chances-as-next-barclays-ceo", "ord_in_thread": 0, "title": "Investors to pour cold water on Morzaria’s chances as next Barclays CEO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "People business Investors to pour cold water on Morzaria’s chances as next Barclays CEO Leading investors expected to urge Barclays to overlook highly regarded CFO Tushar Morzaria as next boss 29 Jul 2015 More from this author \nINVESTORS in Barclays are expected to tell the bank that it should overlook its highly regarded chief financial officer Tushar Morzaria as a successor to chief executive Antony Jenkins, according to reports. \nMorzaria, who joined Barclays as CFO in 2013 , was installed by bookmakers as one of the favourites to replace Jenkins, who was unceremoniously ousted from the bank earlier this month after less than three years in the job. Further reading Mike Rake holds Barclays post - for now \nIn a market statement announcing Jenkins' departure, Barclays said Mozaria, a key figure within the bank's hierarchy, would work \"particularly closely\" with John McFarlane, Barclays' new executive chairman. \nHowever, a number of leading investors will tell McFarlane that the bank's next boss should be an external appointment, Sky News reported. A number of sources suggested to Sky News that Morzaria has told friends that he does not wish to be considered for post. \nThe City believes that Morzaria is doing an effective job, but have questioned whether he has the profile and skills necessary to steer the bank through a major restructuring. \n\"He is a great CFO, but if he were to move up, it would only leave them with the issue of having to find another competent CFO, which is hardly straightforward,\" one investor told Sky News . \nFormer KPMG chairman Sir Mike Rake will continue in his deputy chairman role at Barclays - until a new chief executive is appointed. Related topics:", "external_links": [], "published": "2015-07-29T12:28:00.000+03:00", "crawled": "2015-07-29T13:29:45.287+03:00", "highlightTitle": ""}