{"organizations": [], "uuid": "8301911c2d89cc03b2b5f1f6854a8c430188d6c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/lifestyle/health/younger-people-more-analytical-while-addressing-health-problem-on-google/109983", "country": "IE", "title": "Younger people more ‘analytical’ while addressing health problem on Google", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Younger people more ‘analytical’ while addressing health problem on Google | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T20:58:00.000+03:00", "replies_count": 0, "uuid": "8301911c2d89cc03b2b5f1f6854a8c430188d6c3"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/health/younger-people-more-analytical-while-addressing-health-problem-on-google/109983", "ord_in_thread": 0, "title": "Younger people more ‘analytical’ while addressing health problem on Google", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles 'Men are more prone to mouth cancer, women breast cancer' Increased coffee intake ups mild cognitive impairment risk Can this 'Innovative' new drink make hangovers history? A new study claims that younger people are more likely to use an analytical approach in search engines until they have achieved the desired results, compared to older people.\nJoseph Sharit of University of Miami said that this type of sustained online information-seeking could be more cognitively taxing for users than simple search tasks because they must find, filter, comprehend, and integrate health information that was often distributed across multiple sources.\nIn the research, Sharit and fellow human factors researchers Jessica Taha, Ronald Berkowsky, Halley Profita, and Sara asked 60 adults between the ages of 18 and 85 to complete cognitive ability tests that measured skills such as processing time, reasoning ability, and executive function.\nThe participants were asked to use the internet to research and answer a series of questions related to a complex health information problem. Their responses were evaluated based on age, internet experience, and cognitive test results.\nIt was found that younger participants and those who scored higher on the cognitive tests were more likely to use an analytical approach by manipulating key words in search engines until they achieved the desired results.\nHowever, older participants took longer to complete their tasks, their searches were more efficient and their responses were just as accurate as those of the younger respondents.\nSharit said that despite the increasing power of search engines, it should not be underestimated how difficult health-related problem solving using the internet could be for many individuals.\nHe said that consideration should be given to new ways of supporting consumers of health information, especially older adults, who were susceptible to normal age-related declines in cognitive abilities.\nThe study is published in the Journal of Cognitive Engineering and Decision Making.\n 29, 2015 12:58 pm", "external_links": [], "published": "2015-07-29T20:58:00.000+03:00", "crawled": "2015-07-30T22:37:34.266+03:00", "highlightTitle": ""}