{"organizations": [], "uuid": "1a0c6ff2489b3d4981092001a575558baf092973", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-27/italy-luxury-stocks-targeted-by-short-sellers-on-asia-pessimism", "country": "US", "title": "Italy Luxury Stocks Targeted by Short Sellers on Asia Pessimism", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Italy Luxury Stocks Targeted by Short Sellers on Asia Pessimism - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T15:33:00.000+03:00", "replies_count": 0, "uuid": "1a0c6ff2489b3d4981092001a575558baf092973"}, "author": "Andrew Roberts", "url": "http://www.bloomberg.com/news/articles/2015-07-27/italy-luxury-stocks-targeted-by-short-sellers-on-asia-pessimism", "ord_in_thread": 0, "title": "Italy Luxury Stocks Targeted by Short Sellers on Asia Pessimism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Traders who bet on declining stock prices are targeting Italian luxury-goods companies, a sign that some investors expect disappointing earnings next month.\nAbout 25 percent of the shares of Brunello Cucinelli SpA, a maker of 2,010-euro ($2,223) cashmere sweaters, have been sold short, the most of any Italian company, according to data compiled by Markit Ltd. Shoemakers Salvatore Ferragamo SpA and Tod’s SpA rank sixth and seventh, at 19 percent and 18 percent respectively. The “short interest” in luxury stocks globally averages about 1.3 percent.\nThe pessimism is linked to Asia, where spending on luxury goods is moderating, and the Italian stocks’ above-average valuations after a surge in share prices, said Deborah Aitken, a Bloomberg Intelligence analyst in London.\n“The whole sector has rallied over the last year,” said Aitken. Short sellers “are picking one stock against another, focusing on geographical exposure above everything else.”\nAQR Capital Management has the biggest short position in Tod’s and Ferragamo, while JPMorgan Asset Management is the biggest bear on Cucinelli. Short sellers seek to make money by borrowing shares and then selling them, with the goal of repurchasing them at a lower price.\nSome of the short positions may not be pure bets on the Italian companies. Some investors sell short as part of strategies such as pair trades, where they buy stock in one company while selling shares in another in a bet on diverging performance between the two securities. AQR and JPMorgan Asset Management didn’t respond to requests for comment.\nGovernment Clampdown Ferragamo, Cucinelli and Tod’s declined to comment.\nOne of the biggest risks is China, where luxury demand is slowing as the economy cools and government clamps down on graft and largesse. While wealthy Chinese are still spending, they’re making fewer trips to Hong Kong amid a backlash by residents, and they’re getting fussier about what they buy.\nCucinelli surged the most in six months on July 17 after reporting first-half sales that beat estimates. While the company generated only 5.9 percent of sales in China last year, the stock is the most expensive of the three Italian companies at 31.5 times next year’s estimated earnings compared with the sector average of 20.6 times.\nGlobal growth of at least 10 percent at constant exchange rates, or twice the market rate, may be hard for Cucinelli to maintain, according to Aitken. Margins may come under pressure due to increases in rental costs, according to Citigroup.\nLeather Goods Tod’s has advanced 24 percent this year and trades at 23.3 times estimated 2016 earnings. But the company has one of the weakest growth profiles among luxury peers, with its two main businesses, shoes and leather goods, set to grow at half the pace of the industry through 2020, estimates Hermine de Bentzmann, an analyst at Raymond James.\n“We are skeptical about the recovery” of Tod’s leather goods, de Bentzmann wrote in a note Tuesday, initiating coverage with an underperform rating. The company’s footwear, meanwhile “suffers from a lack of diversification.” Tod’s depended on China for 23 percent of revenue last year.\nThe pessimism surrounding Ferragamo is harder to explain with only two of 25 analysts surveyed by Bloomberg recommending selling the stock, compared with 18 sell ratings at Tod’s and 5 at Cucinelli. One of the analysts who is bearish on Ferragamo, Societe Generale’s Thierry Cota, declined to comment. The other, Neil Fonseca at EVA Dimensions, didn’t respond to an e-mail seeking comment.\nStill Bullish Raymond James’s de Bentzmann remains bullish. She says Ferragamo, based in Florence, has the flexibility to respond to more volatile demand, and expects the company’s profit to grow faster than all peers bar Moncler SpA though 2017. She has a strong buy rating on the stock, which trades at 22.7 times next year’s forecast profit.\nInvestors may get further clues to the strength of demand for luxury goods in China this week -- Gucci owner Kering SA reports earnings today, while LVMH Moet Hennessy Louis Vuitton SE announces first-half results tomorrow.\nOther analysts are concerned about the effect of the Asian slowdown on luxury companies’ profitability. Christopher Walker, an analyst at Nomura in London, doesn’t recommend buying shares of Cucinelli, Tod’s or Ferragamo.\n“The overall weakness in Asia and negative geographic mix has so far had a significant impact on margins for luxury companies,” he wrote in a note to clients last week previewing first-half earnings.", "external_links": [], "published": "2015-07-27T15:33:00.000+03:00", "crawled": "2015-07-27T12:54:33.546+03:00", "highlightTitle": ""}