{"organizations": [], "uuid": "706316dffd2eccada81a42cc0fe660be3d53a20a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/15/markets-global-idUSL4N0ZV01820150715", "country": "US", "title": "GLOBAL MARKETS-Asian shares tread cautiously before key events", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "GLOBAL MARKETS-Asian shares tread cautiously before key events | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T04:21:00.000+03:00", "replies_count": 0, "uuid": "706316dffd2eccada81a42cc0fe660be3d53a20a"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/15/markets-global-idUSL4N0ZV01820150715", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asian shares tread cautiously before key events", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* China data, BOJ decision, Greek vote, Yellen speech on tap\n* Downbeat U.S. sales data quell some Fed hike expectations\n* Crude futures extend gains after details of Iran deal reassure\nBy Lisa Twaronite\nTOKYO, July 15 (Reuters) - Asian stocks inched cautiously higher on Wednesday, taking their cue from Wall Street ahead of key events including Chinese economic data, a Bank of Japan policy decision and congressional testimony by the U.S. Federal Reserve chief.\nMSCI's broadest index of Asia-Pacific shares outside Japan edged up 0.1 percent, while Japan's Nikkei stock index advanced 0.5 percent in early trade.\nGreece remained in the news as Athens will vote on a sweeping austerity package to secure the funding it needs to stem its fiscal crisis and remain in the euro zone.\nAhead of that, China's second quarter gross domestic product will be the main Asian spotlight, expected to be released around 0200 GMT.\nThe Chinese data will be followed by the Bank of Japan's regular policy decision, likely to be out between 0230-0500 GMT, with no shift expected. Governor Haruhiko Kuroda will speak at 0630 GMT.\n\"The market median (for China growth) is 6.8 percent. Nominal GDP however could improve a touch with the weak price environment producing a negative deflator,\" said strategists at Westpac.\n\"A steady outcome would help support sentiment after the recent volatile price action in equities,\" they added, referring to the savage correction that shaved about 30 percent off share market value since last month, before Beijing's support steps stemmed the freefall.\nCongressional testimony by Federal Reserve Chair Janet Yellen on Wednesday will be closely monitored for any further hints regarding the timing of a U.S. interest rate hike, particularly after a surprise fall in U.S. retail sales on Tuesday.\nCore retail sales slipped 0.1 percent, much worse than economists' forecasts for a 0.4 percent rise.\nThe unexpected drop backed the view that the Fed might hold off on hiking rates, which gave Wall Street a lift. All three major indexes ended higher.\nThe downbeat data pushed down Treasury yields, which in turn weighed on the dollar. The yield on benchmark 10-year notes was last at 2.390 percent, down from its U.S. close of 2.399 percent on Tuesday.\nThe dollar edged down 0.1 percent on the day to 123.32 yen , while the euro was steady at $1.1006.\nCrude futures were higher after it became apparent that a nuclear deal between Tehran and six global powers will not immediately remove sanctions placed on Iranian crude exports.\nU.S. crude was up about 0.5 percent at $53.28 a barrel. (Editing by Shri Navaratnam)", "external_links": [], "published": "2015-07-15T04:21:00.000+03:00", "crawled": "2015-07-15T03:46:32.000+03:00", "highlightTitle": ""}