{"organizations": [], "uuid": "850006525ad7dab67828040ef6bfbb1c940145e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Varanasievent017715.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/rs17-crore-goes-down-the-drain-at-modis-washed-out-varanasi-event/42800.html", "country": "IN", "title": "Rs.17 crore goes down the drain at Modi's washed out Varanasi event", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Rs.17 crore goes down the drain at Modi's washed out Varanasi event", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T11:56:00.000+03:00", "replies_count": 0, "uuid": "850006525ad7dab67828040ef6bfbb1c940145e5"}, "author": "IANS", "url": "http://www.moneylife.in/article/rs17-crore-goes-down-the-drain-at-modis-washed-out-varanasi-event/42800.html", "ord_in_thread": 0, "title": "Rs.17 crore goes down the drain at Modi's washed out Varanasi event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Rs.17 crore goes down the drain at Modi's washed out Varanasi event 42800 Rs.17 crore goes down the drain at Modi's washed out Varanasi event 0 Comments, Be the first to comment + COMMENT IANS | 17/07/2015 02:26 PM | As rains led to the cancellation of Prime Minister Narendra Modi's visit to his parliamentary constituency on Thursday, for the second time in the past one month, a staggering Rs.17 crore of the tax payer's money also has gone down the drain. Literally! If local district and protocol officials are to be believed, washed out trip has cost the exchequer more than Rs.17 crores. While VVIP visits do cost a fortune, the amount spent on Modi's now-cancelled visit is stunning for more than one reason. First, while this is in stark contrast to the austerity Modi often speaks of, secondly, if one breaks down the expense of the visit, which was to last four hours and 35 minutes, the per-minute expense was to be Rs 6.18 lakh and the per-second averaging Rs 10,333. With heavy rains ruining Modi's programme on June 28, the organizers this time had done their homework well and six special 'German Hanger' like marquees were erected for the public rally at Dereka grounds. These gigantic marquees were both fire and water proof and are estimated to have cost Rs 9 crore. Three air-conditioned mobile toilets were requisitioned from New Delhi for use of Modi and his entourage. The organizers, on condition, of anonymity told IANS that air-conditioners totalling 100 tonnes were in place at Dereka, keeping in mind the humid and sultry weather. Ten special generators to provide 125 KVA electricity were also installed, adding a major expense to the budget. While the VVIP's were to be provided AC's to give them respite from the humid conditions, 100 coolers and 2,000 fans were in place for the public. These generators, along with ten 6 KVA and two 5 KVA gensets would have produced 1.4 MW of electricity that, in ordinary conditions, could have powered more than 1,000 households, an official mused. This apart, over Rs.4 crore rupees has been sent on boarding, lodging, transport and other expenses of the the prime minister's security and SPG detail. A Wi-Fi enabled mini-PMO was also raised behind the hanger in which Modi was to be present during the launch of the developmental projects. Fifteen LED screens that would have telecast the prime minister's address live to almost 20,000 people amd a high- quality sound system at the rally venue also burnt a hole in the common man's pocket. More in Moneylife", "external_links": [], "published": "2015-07-17T11:56:00.000+03:00", "crawled": "2015-07-17T12:11:57.000+03:00", "highlightTitle": ""}