{"organizations": ["Amur Minerals Corporation"], "uuid": "c7d34586798256c6ad8bd8de94028844e11d9548", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/buy-amur-minerals-corporation-recent-124557309.html", "country": "US", "title": "Should You Buy Amur Minerals Corporation After Its Recent Crash?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Should You Buy Amur Minerals Corporation After Its Recent Crash?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T15:45:00.000+03:00", "replies_count": 0, "uuid": "c7d34586798256c6ad8bd8de94028844e11d9548"}, "author": "", "url": "https://uk.finance.yahoo.com/news/buy-amur-minerals-corporation-recent-124557309.html", "ord_in_thread": 0, "title": "Should You Buy Amur Minerals Corporation After Its Recent Crash?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Jul 6, 2015, 14:22 BST - UK Markets close in 2 hrs 8 mins Should You Buy Amur Minerals Corporation After Its Recent Crash? By Rupert Hargreaves | Fool.co.uk – 36 minutes ago 21.00 -1.7500 \nSmall-cap miner Amur Minerals (LSE: AMC) has seen its share price slump by around 50% during the past two weeks, after rising by as much as 250% in five-and-a-half months to 12 June. \nAnd as the saying goes, the time to buy is when there's blood on the streets... so, do Amur's recent declines present an opportunity to buy? Or should investors sell up ahead of further declines? \nAttractive figures \nAt the end of May, when Amur's shares were trading at 20p, I wrote that it was difficult to value Amur without an appropriate valuation assessment of the company's world-class Kun-Manie mine. \nAdditionally, there were other uncertainties ahead. At the time, it was unclear as to how Amur would find the cash to begin development of the project. \nA month after I wrote the above article, Amur released its forward-looking operational blueprint for Kun-Manie mining project. Initial projections look extremely promising. \nThe net present value for the mine is estimated to be between $0.71bn and $1.44bn. Initial construction costs will be in the region of $1.4bn over a two-year period. It's estimated that Kun-Manie will have an operating cost of $34.86 per ore tonne. \nThis estimate makes the economics of the project look highly attractive. However, the current estimate is 74% higher than the operating cost of $20 per ore tonne initially anticipated during 2007. I wouldn't rule out further cost increases as the project progresses. \nPlenty of uncertainty \nUnfortunately, there are still plenty of questions that Amur's management needs to provide the answers to before the company can push ahead. For example, Amur needs to provide details on how the project will be financed. \nAmur reported a cash balance of $1.4m at the end of 2014, which is only enough to keep the lights on for around six months -- based on historic cash burn figures. During 2014, Amur burned through just under $2.8m in cash. \nMoreover, before Amur can begin the construction of a mine at Kun-Manie, the company is going to have to construct a permanent access road to the project. The road to the nearest suitable rail line, would cost an estimated $312m and stretch across 320km. \nAnd as I wrote before, with a market cap. of only £93m, Amur is facing the prospect of taking on a near-crippling amount of debt just to fund the construction of the access road. \nWith this being the case, Amur's only realistic option is to seek a partner for Kun-Manie, but even this option will take time to organise. \nAmur still needs to conduct further metallurgical testing at the Kun-Manie project to determine the exact quality of the reserves. It's unlikely that any potential partner will come forward to work with Amur before this stage of exploration is complete. \nThe bottom line \nOverall, it remains difficult to place a value on Amur's shares and judge if they're overvalued or not at present. Although it's clear that there are plenty of risks ahead. \nIf you're looking for a company with a more predictable outlook, The Motley Fool's top analysts have recently identified a company that they consider to be one of the market's \"top small caps\" . \nAll is revealed in our new free report entitled \"Is This Stock Tomorrow's Big Winner?\" \nDon't delay, download the free report today -- but hurry, it's only available for a limited time. \nRupert Hargreaves has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-06T15:45:00.000+03:00", "crawled": "2015-07-06T16:23:19.000+03:00", "highlightTitle": ""}