{"organizations": [], "uuid": "66602e95af875ad3a96c502102dcc86dc573e194", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/2/n/v/s/image.related.afrArticleLead.620x365.ginyug.png/1438246358899.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/energy/shell-channels-16b-via-luxembourg-bermuda-20150730-ginyug", "country": "AU", "title": "Shell channels $1.6b via Luxembourg, Bermuda", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Shell channels $1.6b via Luxembourg, Bermuda | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T16:00:00.000+03:00", "replies_count": 0, "uuid": "66602e95af875ad3a96c502102dcc86dc573e194"}, "author": "Neil Chenoweth", "url": "http://www.afr.com/business/energy/shell-channels-16b-via-luxembourg-bermuda-20150730-ginyug", "ord_in_thread": 0, "title": "Shell channels $1.6b via Luxembourg, Bermuda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Labor senator Sam Dastyari has led the attack on corporate tax avoidance. Daniel Munoz by Neil Chenoweth Shell Australia restructured its offshore debt in the past four years to pay $1.6 billion to related companies in Bermuda and Luxembourg, the company's submission to the Senate inquiry into corporate tax avoidance reveals.\nThe payments include $995 million paid to Shell Treasury Luxembourg Sarl for cross-currency interest rate swaps from 2011 to 2014, with a further $611 million paid to a Bermuda associate for \"interest and pensions\", Shell told the Senate committee.\nThe totals show a very different borrowing structure to 2010, when Shell listed interest payments of $162.7 million to a UK subsidiary but none to Luxembourg or Bermuda.\nShell is one of seven energy companies including ExxonMobil and Caltex which made submissions this week about their related-party transactions to the committee, which is chaired by Labor's Sam Dastyari .\nChevron Australia has yet to respond to questions by the committee about its Singapore operations.\n​The committee is due to make an interim report on its hearings this year, which have focused on Singapore earnings by the big US technology companies as well as miners BHP Billiton and Rio Tinto.\nThe committee is considering calling further hearings which would focus on energy companies after the next sitting of Parliament concludes, in three weeks' time.\nShell's submission filed on Thursday show that related-party payments jumped from $671 million in 2010 to average $922 million in the four years, with most of the increased payments going to Bermuda and Luxembourg.\n A further $2.4 billion was paid to Netherlands associates as payments for interest, project support and services and fees for intellectual property over the five years.\nShell reported sales of exports from the North-West Shelf to a Singapore associate which dropped from $711 million in 2010 to $512 million in 2014.\nBP did not detail payments but said in the past five years it paid on average $154 million a year in services to UK associates and $32 million a year to an undisclosed country in royalties for use of brand names.\nCaltex Australia provided no totals for its Singapore turnover but listed turnover of 10 of its competitors including Shell Eastern Trading ($148 billion), BP Singapore ($67 billion) and ExxonMobil Asia Pacific ($43 billion).\n\"Frankly there's a lot of questions we have to get to the bottom of,\" Senator Dastyari told The Australian Financial Review on Thursday evening.\nDastyari was critical of the lack of detail provided in many of the submissions.\n\"It's hard not to suspect that there is a pattern of behaviours designed to minimise their Australian tax liabilities,\" he said.\n\"You would be hard pressed justifying why sums of money of that magnitude would have any legitimate reason to be going to Luxembourg and Bermuda.\"\nThe committee has been seeking to identify the unnamed energy company referred to in a redacted report by the Australian Tax Office, which is said to have transferred $11 billion to its Singapore operations in 2011-12.", "external_links": [], "published": "2015-07-30T16:00:00.000+03:00", "crawled": "2015-07-30T14:11:38.403+03:00", "highlightTitle": ""}