{"organizations": [], "uuid": "22094b0200fb857e22f25322cc23c862cc31a74e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Indiragandhi004072015.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/90-per-of-hindi-voters-sealed-indira-gandhis-fate/42603.html", "country": "IN", "title": "90 percent of Hindi voters sealed Indira Gandhi's fate", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "90 percent of Hindi voters sealed Indira Gandhi's fate", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T10:29:00.000+03:00", "replies_count": 0, "uuid": "22094b0200fb857e22f25322cc23c862cc31a74e"}, "author": "Praveen Chakravarty (IANS)", "url": "http://www.moneylife.in/article/90-per-of-hindi-voters-sealed-indira-gandhis-fate/42603.html", "ord_in_thread": 0, "title": "90 percent of Hindi voters sealed Indira Gandhi's fate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » 90 percent of Hindi voters sealed Indira Gandhi's fate 42603 90 percent of Hindi voters sealed Indira Gandhi's fate 0 Comments, Be the first to comment Praveen Chakravarty (IANS) | 04/07/2015 12:59 PM | \nThe Congress party has never won in Tamil Nadu since. Ironically, a decade later, it was this “Hindi voter” that dealt the Congress party its first national defeat in parliamentary elections in 1977, after the emergency was lifted \n“If the majority rule were to apply, the crow should be our national bird, not the peacock”. A quote attributed to the Tamil leader C.N. Annadurai during a protest speech in 1962 against the imposition of Hindi as a national language, 13 years before the imposition of emergency by Indira Gandhi. Annadurai went on to become the chief minister of Madras in 1967, galvanising support through the anti-Hindi movement, defeating the Congress party in Tamil Nadu for the first time and forever. The Congress party has never won in Tamil Nadu since. Ironically, a decade later, it was this “Hindi voter” that dealt the Congress party its first national defeat in parliamentary elections in 1977, after the emergency was lifted. Twelve states accounted for 90 percent of all votes cast in the 1977 election. Using a loose definition of “Hindi” and “Non-Hindi” states, six “Hindi” states accounted for 65 percent of votes and the six “Non-Hindi” states, the remaining 35 percent. Our loose categorisation of Hindi states include Uttar Pradesh, Bihar, Madhya Pradesh, Maharashtra, Gujarat and Rajasthan. The non-Hindi states are Andhra Pradesh, Tamil Nadu, Karnataka, Kerala, West Bengal and Orissa. One hundred and twenty million voters in these twelve states had a direct choice to express their anger against the emergency by voting against the Congress candidate on their ballot. Seventy million (63 percent) did. But 90 percent of all these angry voters were confined to the six “Hindi” states. Further, there were 376 constituencies in which there was a Congress candidate under Indira Gandhi’s leadership in both the 1971 and 1977 elections. Fifty-two percent of these voted for the Congress candidate in the 1971 elections vs 38 percent only in the 1977 elections represented an absolute loss of 4.3 million voters for the Congress between 1971 and 1977. Incredulously however, 6.3 million incremental voters voted AGAINST the Congress in 1977 in the six “Hindi” states while 2 million voters incrementally voted FOR the Congress in the “non-Hindi” states. Overall, in the “non-Hindi” states, roughly the same percentage of voters that voted for the Congress in 1971 did so in 1977. One state, Uttar Pradesh, accounted for 73 percent of all angry voters that treated the Congress with contempt while ironically, the voter in Tamil Nadu seemed nonchalant and even marginally happier with the Congress in 1977 vis-a-vis 1971. Ninety percent of all anger (vote share swing vis-a-vis 1971) was concentrated in three “Hindi” states of Uttar Pradesh, Bihar and Rajasthan. The Congress lost 167 seats across these twelve states in 1977 from the 1971 elections, of which 168 seats were lost in the six “Hindi” states and a gain of one seat in the six “non-Hindi” states. It is of telling significance that 40 million voters in the six “non-Hindi” states did not deem Indira Gandhi worthy of punishment for masterminding arguably independent India’s most heinous crime. While one can nitpick over whether Maharashtra and Gujarat can truly be defined as “Hindi”, the larger point of this analysis is the massive diversion in reaction to what is generally considered a terrible action by any standards. To the ardent observer of Indian society and its history, this is rightly no big revelation or surprise. However, we still miss a scholarly narrative about why the “non-Hindi” citizen was not alarmed by the Emergency vis-a-vis her fellow “Hindi” citizen. Was it the perceived positive impact of the 20-point programme? Was it the absence of a strong opposition in these “non-Hindi” states to galvanise support against the Emergency? Was it the lack of a credible alternative for people to vent their anger with? Was it the notion that local governance mattered much more than any suspension of civil liberties? While Annadurai got his wish granted of Hindi not being imposed, has that inadvertently exacerbated and prolonged this chasm in voting behaviour between the “Hindi” states and “non Hindi” states, as was evident even in the 2014 Lok Sabha elections?", "external_links": [], "published": "2015-07-04T10:29:00.000+03:00", "crawled": "2015-07-04T10:39:20.000+03:00", "highlightTitle": ""}