{"organizations": [], "uuid": "10736e9b4e1bc15febeed1c4f4dac1d6b02d5784", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/23/590x/carbon-free-591650.jpg", "site_section": "http://express.co.uk//posts/rss/23/personalfinance", "section_title": "Daily Express :: Personal Finance Feed", "url": "http://www.express.co.uk/finance/personalfinance/591650/Britain-s-home-of-the-future-First-carbon-free-energy-positive-home-built", "country": "", "title": "Is this Britain's home of the future? First 'bill-free and energy-positive' house built", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Is this Britain's home of the future? First 'bill-free and energy-positive' house built", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T18:50:00.000+03:00", "replies_count": 0, "uuid": "10736e9b4e1bc15febeed1c4f4dac1d6b02d5784"}, "author": "", "url": "http://www.express.co.uk/finance/personalfinance/591650/Britain-s-home-of-the-future-First-carbon-free-energy-positive-home-built", "ord_in_thread": 0, "title": "Is this Britain's home of the future? First 'bill-free and energy-positive' house built", "locations": ["Britain", "BRITAIN", "Wales"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is this Britain's home of the future? First 'bill-free and energy-positive' house built Is this Britain's home of the future? First 'bill-free and energy-positive' house built BRITAIN'S first completely 'energy-positive' home that is capable of generating more energy than it uses and exporting it the National Grid has been built in Wales. PUBLISHED: 16:50, Thu, Jul 16, 2015 | UPDATED: 17:14, Thu, Jul 16, 2015 SOLCER Is this how homes in Britain will look in the future? \nIt is the first time reduced energy demand, renewable energy supply and energy storage have been combined into one home, according to the experts who designed it from Cardiff University. The home would be completely free of energy bills and could be the future for British housing, after it was been built as a prototype to meet new targets for zero carbon housing set by the UK Government.Experts have said that design could be a \"game-changer\" for the buildings industry. First, the home reduces energy demand through high levels of thermal insulation and reduced air leakage. Related articles British homes overcharged £1.2bn by Big Six energy giants: The... \nThe design is also energy efficient design with low carbon cement, structural insulated panels (SIPS), external insulated render, transpired solar collectors and low emissivity double glazed aluminium clad timber frame windows and doors. At the same time the renewable energy supply, as well as electrical and thermal storage, allows energy generated at the house to be used directly by those living there. The property combines solar generation and battery storage to power both a combined heating, ventilation, hot water system, as well as its electrical power systems, including appliances, LED lighting and a heat pump. SOLCER The sitting room could be any new-build home in Britain SOLCER The windows of the bedroom conserve heat \nThe roof is south-facing and features integrated glazed solar panels that allow the roof space below to be naturally lit - this has also been designed to reduce the cost of bolting on solar panels to a standard roof. \nThe SOLCER project was designed by Professor Phil Jones and his team based at the Welsh School of Architecture. Professor Jones said: “The UK Government – and governments across the world – has set a target of achieving zero carbon housing by 2019. \"This means that as an academic community we have to rise to that challenge and come-up with innovative new ways to build houses of the future.“Through this project we have risen to this challenge and used the latest design and technology to build a smart energy positive house.\" SOLCER The home as seen from the back SOLCER The kitchen with systems linked to the home's energy storage \nKevin Bygate, chief executive of SPECIFIC innovation and knowledge centre, said: “Buildings that can generate, store and release their own renewable energy could be a game-changer. \"The SOLCER House is intentionally built with the best off-the-shelf, affordable technologies, so it proves what’s possible even now – and there’s plenty more technology in the pipeline.”The projected was designed and constructed as part of the Wales Low Carbon Research Institute’s (LCRI) SOLCER project.Professor Jones added: “Now the house has been built our key task is to ensure that all of the measures that we have put in place are monitored to ensure the most energy efficient use.\"We will use this information to inform future projects with the aim of ensuring that Wales remains at the heart of the development of a zero carbon housing future.” Related articles", "external_links": [], "published": "2015-07-16T18:50:00.000+03:00", "crawled": "2015-07-17T08:26:54.000+03:00", "highlightTitle": ""}