{"organizations": [], "uuid": "360c41dbf35d5cf613dc103ef7154ac02b411c9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/us-stocks-wall-street-ends-203359950.html", "country": "GB", "title": "US STOCKS-Wall Street ends sharply higher as China jitters ebb", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "US STOCKS-Wall Street ends sharply higher as China jitters ebb", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T23:33:00.000+03:00", "replies_count": 0, "uuid": "360c41dbf35d5cf613dc103ef7154ac02b411c9a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/us-stocks-wall-street-ends-203359950.html", "ord_in_thread": 0, "title": "US STOCKS-Wall Street ends sharply higher as China jitters ebb", "locations": ["US", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Some say December rate hike now more likely \n* Focus on corporate results eclipses China worry \n* Twitter (Xetra: A1W6XZ - news ) and Gilead up after the bell; Yelp (Xetra: Y9L.DE - news ) drops \n* Indexes close up: Dow 1.09 pct, S&P 1.24 pct, Nasdaq 0.98 pct (Updates to close) \nBy Noel Randewich \nJuly 28 (Reuters) - U.S. stocks ended sharply higher on Tuesday, breaking a five-day losing streak as attention shifted from trouble in Chinese equities to U.S. corporate earnings and to speculation the first Federal Reserve interest rate hike may not come until December. \nThe Dow Jones industrial average and S&P 500 chalked up gains of more than 1 percent, while the Nasdaq Composite lagged slightly. \nAfter the S&P sank over the past week toward the low end of a range it has traded in since February, some investors wagered the market was primed for a technical bounce-back. \n\"The S&P has had five down days in a row and a lot of people are starting to nibble,\" said Michael Matousek, head trader at U.S. Global Investors Inc in San Antonio, which manages about $1 billion. \nMarket sentiment also reflected expectations the Fed would wait until December, rather than September, to raise interest rates for the first time since 2006, Matousek added. \nWith a two-day Fed policy meeting ending on Wednesday, investors are looking for hints about the timing of that rate increase. No move on rates is expected this week. \n\"September is possible but the probability for a December rate hike is increasing,\" said Terry Sandven, chief equity strategist at U.S. Bank Wealth Management in Minneapolis. \nThe Dow Jones industrial average rose 1.09 percent, to end the session at 17,630.27. The S&P 500 gained 1.24 percent to 2,093.25 and the Nasdaq Composite added 0.98 percent to finish at 5,089.21. \nAll the 10 major S&P 500 sectors rose, with the energy index leaping 2.99 percent as oil prices recovered from near six-month lows. \nU.S. consumer confidence weakened in July to its lowest level since September, due in part to a less optimistic outlook on the labor market. \nOngoing uncertainty related to China's stock market, which closed lower again on Tuesday, took a backseat to U.S. corporate earnings. \nWith second-quarter reports well under way, analysts now expect overall earnings of S&P 500 companies to edge up 0.3 percent and revenue to decline 4.0 percent, according to Thomson Reuters data. \n\"Earnings are growing but very slowly. The market's biggest concern is the lack of top-line growth and where that growth is going to come from,\" said Tim Courtney, chief investment officer of Exencial Wealth Advisors, which oversees $1.3 billion. \nAfter the bell, Twitter jumped 5.2 percent and Gilead Sciences (NasdaqGS: GILD - news ) rose 3 percent after both companies posted their second-quarter results. Yelp slumped 13 percent after its report. \nDuring Tuesday's session, SuperValu (NYSE: SVU - news ) jumped 10.60 percent. It said it was exploring a spinoff of its discount grocery chain Save (Milan: SAVE.MI - news ) -A-Lot into a publicly-traded company. \nAdvancing issues outnumbered declining ones on the NYSE by 2.7 to 1. On the Nasdaq, 1.67 stocks gained for each that declined. \nThe S&P 500 racked up 15 new 52-week highs and 12 lows. The Nasdaq Composite posted 36 new highs and 163 lows. \nSome 7.3 billion shares changed hands on U.S. exchanges, above the daily average of 6.7 billion so far this month. (Additional reporting by Tanya Agrawal; Editing by Don Sebastian and Nick Zieminski)", "external_links": [], "published": "2015-07-28T23:33:00.000+03:00", "crawled": "2015-07-28T23:48:25.289+03:00", "highlightTitle": ""}