{"organizations": ["GM"], "uuid": "b293259b50f9966b43e77ff52479c4ba887e590c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/could-gm-china-operations-repeat-130636737.html", "country": "GB", "title": "Could GM’s China Operations Repeat the Splendid Performance?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Could GM’s China Operations Repeat the Splendid Performance?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T16:06:00.000+03:00", "replies_count": 0, "uuid": "b293259b50f9966b43e77ff52479c4ba887e590c"}, "author": "", "url": "http://finance.yahoo.com/news/could-gm-china-operations-repeat-130636737.html", "ord_in_thread": 0, "title": "Could GM’s China Operations Repeat the Splendid Performance?", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark O'Hara"], "text": "Could GM’s China Operations Repeat the Splendid Performance? By Mark O'Hara 36 minutes ago  \n( Continued from Prior Part ) GM’s China operations \nPreviously, we saw that General Motors’ (GM) North American operations delivered higher profits in 2Q15. In this part, we’ll take a look at GM’s China operations. \nResults for GM’s China operations came in as a positive surprise to markets. While GM lost its global (ACWI) market share in 2Q15, it managed to increase its market share in China (FXI) during this period. \nGM operates in China through joint ventures as well as wholly owned subsidiaries. Ford (F) and Honda Motor Company (HMC) also have operations in China. Higher shipments \nGM had record sales of 1.7 million units in China in the first half of 2015, which is a record for the company. GM’s China joint ventures generated equity income of more than $1 billion in the first half of 2015 at an impressive net profit margin of 10.1%. The above graph shows the net income margin of GM’s China joint ventures. \nHowever, GM’s International Operations, which also includes its wholly owned China subsidiary, generated a loss in 2Q15. Higher share of SUVs \nGeneral Motors’ SUV (sport utility vehicle) sales jumped sharply in China in 2Q15. In the first six months of 2015, GM’s SUV sales in China jumped 83% compared to last year. As we’ve already seen, SUVs tend to have a higher profit per vehicle. Higher SUV sales boosted the 2Q15 equity income from GM’s China joint ventures. \nGM has a strong presence in Tier 1 and Tier 2 Chinese cities, which gives it a competitive advantage over its peers. \nGM expects the strong performance of its Chinese joint ventures to continue in the second half of 2015. There are significant headwinds in terms of pricing pressure and sputtering vehicle sales in China. But GM expects to tide over these challenges with new launches and a better product mix with a rising share of SUVs in total sales. \nIn the next part, we’ll look at the performance of GM’s South American and European operations.", "external_links": [], "published": "2015-07-31T16:06:00.000+03:00", "crawled": "2015-07-31T16:44:35.557+03:00", "highlightTitle": ""}