{"organizations": [], "uuid": "7718338072f158d89d938a1661f4029dbab19b6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/06/how_do_annuities_work.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/annuities-work/", "country": "US", "title": "How Do Annuities Work?", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "How Do Annuities Work?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T12:00:00.000+03:00", "replies_count": 0, "uuid": "7718338072f158d89d938a1661f4029dbab19b6d"}, "author": "Lou Carlozo", "url": "http://www.gobankingrates.com/personal-finance/annuities-work/", "ord_in_thread": 0, "title": "How Do Annuities Work?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Lou Carlozo July 5, 2015 \nIn simple terms, annuities are financial products you can use to save money that is later paid out to you, either in one lump sump or in installments. An annuity allows you to establish a steady stream of income in retirement or after windfall. With a variety of annuities to choose from, this type of financial product offers you additional options for managing your finances. Learn more about annuities, the types you can take out and how they benefit you. Annuities: Frequently Asked Questions 1. Why do people take out annuities? \nAnnuities have a variety of uses. For those planning for retirement , you can put away extra money into an annuity after maxing out tax-advantaged retirement accounts, like your 401(k). If you come upon windfall, such as an inheritance, you can buy an annuity to not only grow your money, but establish a pension plan that helps you ensure you’ll have a steady cash stream. 2. What are the primary benefits of annuities? \nAnnuities are “income guarantees that fit into four categories: principal protection, income for life, legacy planning and long-term care,” says Stan Haithcock, an annuity specialist based in Ponte Vedra Beach, Fla., in his book, “The Annuity Manifesto.” He outlines the following benefits of annuities: Principle protection: Fixed annuities are backed by the faith and credit of the issuing carrier. States also offer guarantees to protect your investments. Income for life: If you are afraid of outliving retirement funds, you can use annuities to pad your income stream, whether through an immediate lump sum payment or through regular payments. Legacy: Fixed annuities offer you guaranteed growth on your investments. Because you can use annuities to help you save for retirement after maxing out other tax-advantaged plans, you can safely save up a legacy for your family. Long-term care: An annuity can help you establish a fund for your long-term care. Even if you do not end up needing long-term care, an annuity allows you to use your funds toward other expenses. 3. Why should I get an annuity? \nThirty-eight million working-age households in the United States have no retirement savings , according to a study conducted by the National Institute on Retirement Security. The average American who has savings and is near retirement age has roughly $100,000 saved, an inadequate amount for long-term financial security. \nIf you are nearing retirement or planning ahead, an annuity can help you get caught up on savings. Annuity rates rose in 2014, according to Barron’s, a financial magazine. In 2013, the top rate on a fixed annuity with a five-year guaranteed rate was 2.3 percent. That rate rose to 3.05 percent in 2014. With growing rates on fixed annuities, you can earn greater returns on investments guaranteed to grow. 4. Where do you get an annuity? \nAnnuities are offered by a variety of financial institutions and third parties. Annuities are offered by insurance companies, brokers, banks, mutual fund companies and independent agents. 5. What are the types of annuities? \nDepending on your financial situation and individual needs, any number of annuity types can support your long-term goals. Consider the following common annuities you can use to grow or catch up retirement savings . \nQualified and Non-Qualified Annuities \nQualified annuities exist inside of retirement accounts, and are subject to traditional retirement account rules. You contribute pre-tax dollars to your annuity. When you make withdrawals after the age of 59.5, your money is taxed. You are also required to start making withdrawals by age 70.5. \nNon-qualified annuities — immediate or deferred — are owned outside retirement accounts. There are no limits on your annual contributions. You pay taxes up front on the money you put in. You can make withdrawals from your annuity after age 59.5, but there are no restrictions on how long you can wait. \nFixed Annuity \nFixed annuities guarantee your money will grow at a minimum interest rate. This type of annuity is a safe, predictable way to save for retirement. Fixed annuities are considered conservative investments. \nVariable Annuity \nVariable annuities invested in securities are exposed to market trends, meaning the rate you receive on your savings can rise and fall. Unlike fixed annuities, you can lose money on your variable annuities. \nRead: 28 Retirement Mistakes People Make \nImmediate Annuity \nAfter you buy an immediate annuity, you instantly start receiving payments. The money you receive each month is based off the lump sum you put into your annuity. You can use online calculators to estimate how much money you will earn each month on an immediate annuity. Only the interest on your annuity is taxed. \nDeferred Annuity \nA deferred annuity begins to pay out on a preset date you choose. Deferred annuities build savings on a tax-deferred basis, meaning you don’t get taxed until you start making withdrawals. \nIndexed Annuity \nAn indexed annuity is linked to an index, such as the S&P 500. The money you invest is protected against down markets. While this type of annuity can offer competitive returns, they are traditionally seen as complex investments. \nAs you research annuities, consider your short- and long-term financial goals. You can speak with financial planners and other experts to help you determine the types of annuities that work best for your needs. With opportunities to grow your retirement savings and establish pension plans, annuities are reliable investments for older Americans. \nShare This Article", "external_links": [], "published": "2015-07-05T12:00:00.000+03:00", "crawled": "2015-07-05T13:20:15.000+03:00", "highlightTitle": ""}