{"organizations": [], "uuid": "c09f2b25a42160f14fd8a47ea00481f39371771f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/27/china-economy-profits-idUSL3N10719T20150727", "country": "US", "title": "UPDATE 1-China June industrial profits fall 0.3 pct y/y", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-China June industrial profits fall 0.3 pct y/y | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T07:31:00.000+03:00", "replies_count": 0, "uuid": "c09f2b25a42160f14fd8a47ea00481f39371771f"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/27/china-economy-profits-idUSL3N10719T20150727", "ord_in_thread": 0, "title": "UPDATE 1-China June industrial profits fall 0.3 pct y/y", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* June profits -0.3 pct y/y, vs +0.6 pct in May\n* H1 profits -0.7 pct y/y, vs -0.8 pct in Jan-May\n* Interest rate cuts lower firms' financial costs (Adds details)\nBEIJING, July 27 (Reuters) - Chinese industrial profits, which rose on an annual basis in April and May, dropped in June, adding to pressures on a economy that is struggling to regain momentum.\nProfit at China's industrial firms dropped 0.3 percent in June from a year earlier, the National Bureau of Statistics (NBS) said on Monday.\nThat reversed a 0.6 percent rise in May and 2.6 percent gain in April, the first month since September 2014 in which industrial profits were higher than a year earlier.\nThe bureau said falling prices pulled down firms' profit margins in June even though recent interest rate cuts were lowering companies' financial costs.\nIn June, China's producer price index (PPI) fell 4.8 percent on an annual basis, its 39th straight month of declines, official data showed.\nFor the first six months of 2015, industrial profits were 0.7 percent lower than a year earlier, the bureau said.\nAmong 41 industrial sectors, 30 sectors had year-on-year growth in the first half of this year, while 11 recorded drops.\nProfits in mining sector fell 58.8 percent in the first six months from a year earlier, while earnings of crude oil and natural gas producers tumbled 68.4 percent.\nOn the upside, oil processing, coking coal and nuclear fuel processing industries combined saw profits jumping 78.7 percent in January-June while the bureau said computers, telecommunications and electronics firms together had a 19 percent increase.\nAccording to the bureau, interest payments by industrial firms in June were 6.2 percent less than a year earlier, the biggest drop this year.\nChina's central bank has cut interest rates for three times this year, in a bid to support an economy headed for its poorest performance in a quarter of a century.\nFor the first six months, China has reported a growth rate of 7 percent, in line with Beijing's full-year target. (Reporting by Xiaoyi Shao and Koh Gui Qing; Editing by Richard Borsuk)", "external_links": [], "published": "2015-07-27T07:31:00.000+03:00", "crawled": "2015-07-27T06:40:06.409+03:00", "highlightTitle": ""}