{"organizations": ["Autochartist", "Delkos Research"], "uuid": "afbb05f349a3a1d7fced08358b22a455b0d1f2de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/forex/wp-content/uploads/sites/8/2015/07/delkos-Wall-Logo-MockUp.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/forex/products/autochartist-enters-futures-analysis-sector-with-delkos-launch/", "country": "US", "title": "Autochartist Enters Futures Analysis Sector with Delkos Launch", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Autochartist Enters Futures Analysis Sector with Delkos Launch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T13:14:00.000+03:00", "replies_count": 0, "uuid": "afbb05f349a3a1d7fced08358b22a455b0d1f2de"}, "author": "", "url": "http://www.financemagnates.com/forex/products/autochartist-enters-futures-analysis-sector-with-delkos-launch/", "ord_in_thread": 0, "title": "Autochartist Enters Futures Analysis Sector with Delkos Launch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Autochartist Enters Futures Analysis Sector with Delkos Launch Autochartist Enters Futures Analysis Sector with Delkos Launch With their eyes on the futures market, Autochartist has launched a new unit named Delkos Research to provide technical analysis for futures. Advertising Print This Post \nAutochartist, a provider of automated technical analysis for the online forex and CFD market is entering new terrain with its launch of Delkos Research . Using underlying technology from Autochartist, Delkos is a trading analysis offering designed for the futures industry. Similar to Autochartist, Delkos creates both daily reports and real time analysis for futures contracts. Included in the research is analysis on interest rates, equity indexes, energy, FX, agriculture and metals products. \nConnecting with Autochartist CEO, Ilan Azbel, he explained to Finance Magnates that Autochartist and Delkos Research have their similarities, but also include differentiators which make them specific to their respective trading industries. In regards to Delkos, Azbel cited that analysis is offered down to one minute data intervals. He explained that “this is primarily because we find the futures traders are a little more sophisticated than the average retail forex trader and can handle a faster stream of information”. \nAzbel also added that the marketing of the product differs. With Autochartist, the firm typically markets the service to brokers, who then provide it to their end-user customers. This is in contrast to Delkos where the product’s initial target of customers are introducing brokers (IB). Azbel explained that unlike forex brokers, in the futures industry, IBs tend to have relationships with customers, as opposed to the larger brokers. As such, Delkos created the product where it can be distributed directly from IBs to their customer base to provide a value add for their trading. \nIn regards to working with brokers, Azbel stated that their goal is to provide the offering as an embeddable solution within broker trading platforms. Azbel explained that futures brokers use trading platform features as competitive advantages when competing against fellow firms for customers. As such, Delkos views the ability for firms to add the research via an API on their platforms as a potential differentiator for brokers. \nOverall, Azbel explained that the trend he is seeing is that assets such as stocks and futures have become commoditized. As such, pricing is less of a battle between brokers. In replace, firms have begun to focus on initiatives that provide big-data and analysis services to their customers to provide added value for their trading. In that regard, Delkos is aiming to fit its offering to meet this demand. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-07-06T13:14:00.000+03:00", "crawled": "2015-07-06T10:25:52.000+03:00", "highlightTitle": ""}