{"organizations": [], "uuid": "2ba32db80dd6e54994cbe352caec1273b3bbc4c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/vFM704jNXfK9jJCs9iNu3g--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/3e9b675b00619826139f3992edb50005b9528137_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/greece-reform-plan-stay-euro-115150375.html", "country": "GB", "title": "New Greece reform plan to stay in euro cheers France, Italy", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "New Greece reform plan to stay in euro cheers France, Italy", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T15:21:00.000+03:00", "replies_count": 0, "uuid": "2ba32db80dd6e54994cbe352caec1273b3bbc4c5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/greece-reform-plan-stay-euro-115150375.html", "ord_in_thread": 0, "title": "New Greece reform plan to stay in euro cheers France, Italy", "locations": ["France", "New Greece", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 10, 2015, 13:36 BST - UK Markets close in 2 hrs 54 mins New Greece reform plan to stay in euro cheers France, Italy By Marc Burleigh in Athens, Danny Kemp in Brussels | AFP – 14 minutes ago View Photo \n\nFresh Greek reform proposals submitted to eurozone partners were cheered by France and Italy on Friday, raising hopes that a last-ditch compromise could be reached to prevent a dreaded \"Grexit\". \nThe plan delivered by Prime Minister Alexis Tsipras's administration was to be submitted Friday to a vote by lawmakers in Greece and was being examined by the EU, IMF and European Central Bank. \nTsipras has conceded ground on major sticking points including tax and pensions, drawing encouragement from his biggest ally, French President Francois Hollande. \n\"The Greeks have shown a determination to want to stay in the eurozone because the programme they are presenting is serious and credible,\" Hollande said. \nHe cautioned, though, that \"nothing is decided yet\". Any new Greek bailout package needs to be approved unanimously by eurozone members. \nItalian Prime Minister Matteo Renzi declared himself \"more optimistic\" that a deal would be done. \nBut Germany, leading a bloc of sceptical eurozone nations, said the outcome of crisis talks this weekend was \"completely open\". \nSlovak Finance Minister Peter Kazimir -- one of the staunchest opponents to extending more bailout funds to Greece without it accepting more austerity measures -- tweeted \"it seems we have progress on Greece\" after the new proposals were submitted. \nHe cautioned however: \"It's still not clear whether this will be enough.\" \nAn EU source said there was \"a margin for manoeuvre to negotiate and avoid Grexit\". \nA make-or-break summit summit bringing together leaders of all 28 EU nations, not just the 19 that use the euro, is scheduled for Sunday. It could be cancelled if an agreement is reached beforehand. \nEurozone countries must decide whether to accept Greece's reform plan in exchange for another huge bailout -- its third in five years -- amounting to tens of billions of euros, or force a \"Grexit\" from the eurozone. \n\"We have to make a major decision. Whichever way,\" said Jeroen Dijsselbloem, head of the Eurogroup of eurozone finance ministers. \nThe euro surged more than 1.3 percent on the Greek plan, to $1.12. European stock markets all also leapt higher. \nIn a bid to head off a possible challenge to the measures within his hard-left party Syriza, Tsipras urged his lawmakers \"to stand united and firm in front of these important decisions.\" \nThe Greek offer, set out in a 13-page document, concedes to Greece's paymasters on several key points that Tsipras's ruling coalition -- and the Greek voters, in a referendum last weekend -- had previously fiercely opposed. \n\"Greece has come across on almost all issues and has clearly shown its willingness to compromise,\" said Carsten Brzeski, of the German bank ING-DiBa. \nWith caveats , he said the \"chances for a deal and another bailout for Greece have increased again\". \nCurrenciesDirect dealer Davide Ugolini said: \"Greece has finally managed to flip the ball into Europe's court. Crisis-watchers can look forward to an interesting weekend.\" \n- Tsipras's gamble - \nThe reforms agree to creditors' demands to overhaul pensions, increase sales taxes, and commit to privatisations. But they seek to limit changes on other thorny issues, including tax breaks for Greece's islands and cuts to military spending. \nThe proposal aims to procure financing \"for three years, debt adjustment and a front-loaded investment package of 35 billion euros ($38 billion),\" a Greek government source said. \nTsipras is taking a political gamble by making any concessions to creditors' demands. \nHardliners in Syriza and coalition partner the Independent Greeks have obstinately rejected further austerity. \nAnd 60 percent of Greek voters last Sunday roundly voted 'No' to accepting tough conditions attached to the last bailout that expired June 30. \nBut the alternative for Greece is grim. Nearly two weeks of capital controls limiting daily ATM withdrawals to 60 euros ($67) have alarmed the public and underlined how close they are to seeing their economy collapse. \nGreeks overwhelmingly want to keep the euro. \"The government has to find a deal with its European partners no matter what. We didn't vote 'No' to leave the eurozone,\" said a pensioner in Athens, Nikos Eftekidis. \nBut another pensioner, Giorgos, said the \"government's proposed measures are very tough, I wasn't expecting that. That's not what the Greeks voted for.\" \nGermany leads a bloc of eurozone nations saying that, after two bailouts over the past five years totalling 240 billion euros, and 107 billion euros in debt forgiveness in 2012, Greece is looking like an irredeemable moneypit. \nTsipras hopes his new offer will pass muster with those hostile eurozone countries, and open the door to the creditors discussing another round of relief from Greece's suffocating 320-billion-euro ($350-billion) mountain of debt. \nBut Germany has ruled out forgiving more of Greece's debt. Chancellor Angela Merkel has said \"a classic 'haircut' is out of the question for me\". \nBut her careful choice of words, and an acknowledgement from German Finance Minister Wolfgang Schaeuble that Greece was in need of debt restructuring, hinted Berlin might yet consider a different form of relief, perhaps involving pushing back repayments or lowering interest on loans.", "external_links": [], "published": "2015-07-10T15:21:00.000+03:00", "crawled": "2015-07-10T15:37:03.000+03:00", "highlightTitle": ""}