{"organizations": [], "uuid": "2bc67c126610b6b021f0186bd7963b8ae3992f0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/fintech/wp-content/uploads/sites/10/2015/05/technology.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/fintech/payments/xero-and-midpoint-partner-to-connect-fx-transfers-and-invoices-for-smes/", "country": "US", "title": "Xero and Midpoint Partner to Connect FX Transfers and Invoices for SMEs", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Xero and Midpoint Partner to Connect FX Transfers and Invoices for SMEs", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T17:32:00.000+03:00", "replies_count": 0, "uuid": "2bc67c126610b6b021f0186bd7963b8ae3992f0d"}, "author": "", "url": "http://www.financemagnates.com/fintech/payments/xero-and-midpoint-partner-to-connect-fx-transfers-and-invoices-for-smes/", "ord_in_thread": 0, "title": "Xero and Midpoint Partner to Connect FX Transfers and Invoices for SMEs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Xero"], "text": "Xero and Midpoint Partner to Connect FX Transfers and Invoices for SMEs Xero and Midpoint Partner to Connect FX Transfers and Invoices for SMEs Midpoint and Xero are partnering to make available Midpoint's FX transfer platform to Xero's 500,000 cloud accounting software customers. Advertising Print This Post \nOne of the noticeable trends taking place in the fintech sector is the partnering of startup financial firms with firms facing small and medium size business (SMEs). Specifically, P2P lenders have been active in securing partnerships with businesses such as accounting and consulting firms who work with SMEs and can refer their customers to their lending platforms. \nContinuing on the trend of fintech firms partnering with SME solution providers is announcement today between Midpoint and Xero. A provider of international currency transfers, Midpoint uses P2P technology to connect buyers and sellers of currency to secure more efficient ‘midpoint’ exchange rates for users of their platform. In a partnership that opens up their services to an additional 500,000 customers, Midpoint’s payment transfer platform is being made available to Xero’s client base. \nXero’s customers include SMEs who use the firm for its cloud based accounting software. By partnering with Midpoint, Xero’s customers will be able to issue foreign currency invoices and send and receive payments using the money exchange platform. The deal is part of Midpoint partnership business model which allows them to provide their platform as co-branded or white label offering. Overall, \nJohn Booth, Chairman and CEO of Midpoint commented that “Businesses are becoming much more effective at sourcing goods and services internationally which can help reduce costs. Xero’s clients will benefit from this integrated platform, where all supplier data is available in the cloud-based system and, with little more than a click, these invoices can now be paid.” \nGary Turner, Managing Director of Xero, added “This partnership is great for many of our small business customers dealing with international payments around the globe. These businesses can now seamlessly use the Midpoint platform to avoid paying banks and brokers those hidden fees.” Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-07-06T17:32:00.000+03:00", "crawled": "2015-07-06T14:32:33.000+03:00", "highlightTitle": ""}