{"organizations": [], "uuid": "dc316bc4b64c25c87e9d1fd35ab379e1d01d4a12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-20/grocer-a-p-files-for-bankruptcy-for-second-time-in-five-years", "country": "US", "title": "Grocer A&P Files for Bankruptcy for Second Time in Five Years", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Grocer A&P Files for Bankruptcy for Second Time in Five Years - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T15:44:00.000+03:00", "replies_count": 0, "uuid": "dc316bc4b64c25c87e9d1fd35ab379e1d01d4a12"}, "author": "Dawn McCarty", "url": "http://www.bloomberg.com/news/articles/2015-07-20/grocer-a-p-files-for-bankruptcy-for-second-time-in-five-years", "ord_in_thread": 0, "title": "Grocer A&P Files for Bankruptcy for Second Time in Five Years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Great Atlantic & Pacific Tea Co. filed for bankruptcy for the second time in five years as upstart supermarket chains ate into the 156-year-old company’s market share.\nA&P, as it’s known, said it will enter into an agreement to get $100 million in debtor-in-possession financing, according to a Chapter 11 filing late Sunday in New York. The company operates Waldbaum’s, Food Emporium, Super Fresh, Pathmark and Food Basics, as well as its namesake stores. It has more than 300 stores, according to its website .\nA&P has struggled of late to compete with newcomers including Whole Foods Market Inc. and Trader Joe’s Co. Its stores came to seem dated, and the company sagged under high pension costs and other labor expenses.\nThe Montvale, New Jersey-based company listed assets and debt of more than $1 billion each in its bankruptcy filing. Among the largest unsecured A&P creditors listed in court papers were C & S Wholesale Grocers and McKesson Drug Co.\nThe grocer previously filed for bankruptcy in 2010 and emerged in 2012 as a closely held company owned by an investor group that included Ron Burkle’s Yucaipa Cos.\nA&P was founded in lower Manhattan in 1859 as a mail-order tea and spice business by merchants George Huntington Hartford and George Gilman.\nHorse-drawn carts soon spread the business north, south and west, turning A&P into the largest grocer in the U.S. By 1929, the company had more than 15,000 stores and $1 billion in sales, and its Eight O’Clock Breakfast Coffee helped take the edge off Americans’ morning grind.\nThe case is in re The Great Atlantic & Pacific Tea Co., 15-23007, U.S. Bankruptcy Court, Southern District of New York (Manhattan).", "external_links": ["http://aptea.com/our-company/our-history.html\\"], "published": "2015-07-20T15:44:00.000+03:00", "crawled": "2015-07-20T16:22:18.245+03:00", "highlightTitle": ""}