{"organizations": [], "uuid": "ba879baf6800db3ad651ca2ffb0fb50cb0878a79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/binary-options/wp-content/uploads/sites/6/2015/04/football-880x400.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/binary-options/brokers/smg-facilitates-deal-between-24option-com-and-olympique-lyonnais/", "country": "US", "title": "SMG Facilitates Deal Between 24Option.com and Olympique Lyonnais", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "SMG Facilitates Deal Between 24Option.com and Olympique Lyonnais", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T01:14:00.000+03:00", "replies_count": 0, "uuid": "ba879baf6800db3ad651ca2ffb0fb50cb0878a79"}, "author": "", "url": "http://www.financemagnates.com/binary-options/brokers/smg-facilitates-deal-between-24option-com-and-olympique-lyonnais/", "ord_in_thread": 0, "title": "SMG Facilitates Deal Between 24Option.com and Olympique Lyonnais", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print This Post \nSports Media Gaming (SMG) has undergone a two-year partnership with France’s Olympique Lyonnais and 24Option.com, through the club’s marketing affiliate Sportfive, according to an SMG statement. \nSMG is no stranger to sponsorship deals, having worked with a number of key entities previously . The deal is noteworthy given that its the first such deal for France with a major broker, namely in the aftermath of a number of recent regulatory edicts against fraudulent binary options entities operating domestically. \nIndeed, the country’s paramount regulator, Autorité des marchés financiers (AMF) has had an eventful H1 2015, issuing a number of warnings to the public against unregulated binary options brokers. \nHowever, as a result of the sponsorship deal, 24Option.com now stands out as the singular and exclusive trading partner of Olympique Lyonnais, having recently unveiled its arrangement previously in a match vs. AC Milan earlier this month. \nAccording to Emma Morris, Director of Partnerships at 24Option in a recent statement on the sponsorship deal, “We are proud to achieve another milestone in our short history by partnering with a top club like Olympique Lyonnais. The club offers us a unique platform to target the French market and we’re anticipating a successful partnership.” \nPer the deal, beginning on August 8, 2015, the 24Option.com brand is also slated to appear inside the club’s stadium, as well as being featured on the Olympique Lyonnais’ communication materials. \n“24Option.com is one of the most ambitious sports business stakeholders in Europe and a real leader in the online trading market. They share the same ambitions as Olympique Lyonnais, and we are delighted they chose us to be partnered with.” added Jean-Michel Aulas, Olympique Lyonnais President in an accompanying statement. \n“This is the first ever online trading partnership in the French market and we are of course delighted to have been responsible for this deal and working alongside Sportfive,” noted Stephen Pearson, CEO of Sports Media Gaming. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-07-28T01:14:00.000+03:00", "crawled": "2015-07-27T22:43:51.877+03:00", "highlightTitle": ""}