{"organizations": [], "uuid": "9b75d48b1025d900d2b4acbe1f8289992a5969be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/3/y/p/y/image.related.thumbnail.320x214.gicl5k.png/1437031621210.jpg", "site_section": "http://www.canberratimes.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.canberratimes.com.au/business/banking-and-finance/why-australias-banks-are-still-well-placed-to-fend-off-apple-pay-20150715-gicl5k.html", "country": "AU", "title": "Why Australia's banks are still well placed to fend off Apple Pay", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Why Australia's banks are still well placed to fend off Apple Pay", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T15:27:00.000+03:00", "replies_count": 0, "uuid": "9b75d48b1025d900d2b4acbe1f8289992a5969be"}, "author": "Shaun Drummond", "url": "http://www.canberratimes.com.au/business/banking-and-finance/why-australias-banks-are-still-well-placed-to-fend-off-apple-pay-20150715-gicl5k.html", "ord_in_thread": 0, "title": "Why Australia's banks are still well placed to fend off Apple Pay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From left, Glen Williams and David Gunn, global payments experts at Bain & Co. Photo: James Brickwood\nApple Pay and a host of online payments players are steadily taking customers and profits from the banks, according to Bain & Co's payments gurus – but Australia's lenders are still in a good position to fend them off.\nOn Tuesday, Britain became the second market outside the US where Apple switched on its mobile payment option on its new iPhone and Apple Watch . As in the US, the world's biggest company negotiated a cut of the fees that banks are paid by merchants for accepting Visa and MasterCard, albeit a lesser amount.\nIn Australia, bank sources say Apple is still insisting on a cut of their fees of about 0.15 per cent a transaction, a similar amount to what it achieved in the US despite Australian banks arguing Apple has far less room to negotiate. One reason is the Reserve Bank has capped interchange fees at much lower levels than in the US. In Australia, they now amount to about $2 billion, out of total card income of about $7 billion.\nAnother reason the Australian banks are pushing back is that the big four dominate card transactions and tap-and-go payments are already approaching 60-70 per cent of all transactions – the highest in the world – so there is no gap for Apple to fill. In comparison, magnetic stripe credit and debit cards, and cheques, are still commonplace in the US.\nAdvertisement But Britain's experience, where virtually every big lender has signed up to work with Apple Pay, appears to overturn the banks' defence, because fees in Britain are at a similar level and they will more than halve by next year. The Reserve Bank is considering following suit in its present review of payments regulation.\nBain's London-based global head of cards and payments, Glen Williams, said individuals and small businesses were the biggest source of banks' payments revenue via fees and interest. But, more importantly, losing control of the \"interface\" with those customers – be it via a start-up payment portal or giant smartphone-maker – threatens to rob banks of the means to sell them more profitable products such as loans and investment products.\n\"The king pin, the thing that you have to maintain control of with business customers, is the interface,\" he said. \"That might be the gateway that is used to capture transaction details, it might be the merchant terminal.\n\"The profit pools in payments very closely follows who owns those interfaces. Those interfaces are where the greatest innovations occur. Accepting cards and issuing cards, that's easy. The hard bit is that so many revenue streams are associated with getting payments into and out of the banks.\"\nBain's head of payments for Europe, the Middle East and Africa, David Gunn, said in the purely online area, a host of players had also got in between banks and other card-processing businesses and their merchant customers by helping them make more money rather than just being transaction processors. Many of these have yet to push into the Australian market.\n'A lot of confusion and complexity' \"It is a lot broader than cards, and includes PayPal and many other account-to-account solutions for merchants that is creating a lot of confusion and complexity for retailers,\" he said.\n\"What they want to do is have someone who can demystify all this, but really act as the intermediary that allows consumers to use whatever payment they choose. If you can act as that intermediary that makes that really simple and allows the retailer to focus on making profit, then you provide a valuable role.\"\nHe agrees with the banks here, however, that they have built a stronger negotiating position with the likes of Apple, and others following them such as Samsung Pay and Android Pay, because they and the supermarkets spent big to roll out contactless payments and are investing heavily in technology, denying Apple a gap to fill.\n\"What's certainly true – partially driven by contactless payments – is that mobile [point of sale] offerings provided by the banks in Australia are much more significant than you have seen in the US and UK,\" Mr Gunn said.\n\"In the US and the UK, Apple Pay is creating something that pretty much doesn't exist within the market. It has a strong and loyal consumer base [and] it is Apple providing that.\"\nApple Pay has also had much higher fraud rates than cards in the US and big retailers such as Walmart have, until recently, refused to accept it because the deal with the banks does not include passing on transactional data they can use for their loyalty programs. Apple's pitch adds to pressure on the loyalty programs in Australia from the RBA's payments review.\n\"The flipside of that of course is if Apple is able to agree a deal with the banks, the fact that you have such prevalent contactless infrastructure here means it could be very successful very quickly.\"\nMost big and regional banks declined to comment on the progress of their negotiations with Apple. But some bankers and industry experts privately said there were still many barriers in the way of deal. Some said Apple was making unrealistically high demands for a slice of interchange as high as it had achieved in the US.\nOthers said technical issues still needed to be ironed out.\nWestpac and Commonwealth Bank also already offer contactless payments via Android phones and many other banks in Australia have launched their own smartphone payment options.\nA Westpac spokesman said it wanted to work with Apple to \"open up the solution to our mobile banking application\", but little had changed since the start of the year.\nAnother possibility raised by banks is that Apple will do a deal with one of the smaller regional banks because it would give them an advantage against the big banks and push others to follow suit.\nIt is believed that Visa, although keen to see Apple boost its contactless transactions in the US, is taking a different approach in Australia because it does not need the tech giant to force the hand of banks and merchants. It is therefore siding with lenders at the negotiating table.\nVisa declined to comment and Apple did not return calls in time for publication.", "external_links": ["http://www.afr.com/technology/lack-of-detail-on-apple-watch-sales-performance-fuels-questions-about-level-of-demand-20150715-gicxi5", "http://www.afr.com/technology/high-hopes-as-apple-pay-launches-in-britain-20150714-gichcu", "http://www.afr.com/business/banking-and-finance/financial-services/qantas-virgin-revenue-threatened-by-payment-reforms-20150630-gi1bb7"], "published": "2015-07-16T15:27:00.000+03:00", "crawled": "2015-07-16T17:32:43.000+03:00", "highlightTitle": ""}