{"organizations": [], "uuid": "8137dd471855a5cdb0e7973520830b264d60b067", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/oil-firms-jostle-india-orders-211208639.html", "country": "US", "title": "Oil service firms jostle for India orders amid global spending cuts", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Oil service firms jostle for India orders amid global spending cuts", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T00:12:00.000+03:00", "replies_count": 0, "uuid": "8137dd471855a5cdb0e7973520830b264d60b067"}, "author": "", "url": "https://uk.finance.yahoo.com/news/oil-firms-jostle-india-orders-211208639.html", "ord_in_thread": 0, "title": "Oil service firms jostle for India orders amid global spending cuts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 8, 2015, 22:19 BST - UK Markets closed Oil service firms jostle for India orders amid global spending cuts Reuters – 7 minutes ago Print \nBy Rujun Shen and Nidhi Verma \nSINGAPORE/NEW DELHI (Reuters) - Oilfield services firms are scrambling for contracts from India, which has emerged as a rare bright spot for the sector hardest hit by a slump in global crude oil prices that has driven most countries to slash spending on exploration and production. \nThis fiscal year, state-run Oil and Natural Gas Corp (ONGC) (ONGC.NS) plans to boost its capital spending by more than a fifth to 362.49 billion rupees ($5.7 billion), in stark contrast to analysts' forecasts for energy firms globally to cut spending by a fifth in 2015. \nThese prospects have attracted scores of bidders for Indian contracts as an increase in supply from U.S. shale oil producers and slower demand growth have halved crude prices (LCOc1) since June 2014. \nIndia's government has made boosting domestic energy a priority to end chronic current account deficits. \nWinners of ONGC's recent oil services tenders include Transocean Ltd (RIG.N), one of the world's top offshore drilling companies, Southeast Asia's largest oilfield service firm SapuraKencana Petroleum (SKPE.KL), Indian conglomerate Larsen & Toubro (LART.NS) and mid-sized Singapore-based offshore construction services company Swiber Holdings (SWBR.SI). \n\"We are getting better participation in our tenders both from Indian and overseas players due to current market conditions where exploration activity is low because of lower oil prices,\" said an ONGC official. \n\"We are getting offers for better vessels and rigs at lower rates,\" the official added, declining to be identified as he is not authorised to speak to the media. \nThe Indian contracts are especially attractive given the dearth of business from the majority of European and North American energy firms. \nWith prospects for a rebound in oil prices and overall spending by the industry slim for the next few years at least, competition for Indian business is fierce, hurting service firms' margins, but alternatives are few and far between. \nSwire Pacific Offshore, part of Hong Kong-based conglomerate Swire Pacific Ltd , says the low rates in India are a challenge, but it is still bidding for projects there. \n\"Even though there might be relatively more activity in the Indian market, I think you'll find that that's no boom town,\" said Duncan Telfer, commercial director of Swire Pacific Offshore. \nDISCOUNTS AND DEMAND \nState-owned ONGC's spending spree is part of efforts by Prime Minister Narendra Modi's government to reduce India's reliance on imports, which account for nearly 80 percent of its energy requirements. \nCrude oil prices are critical to India's current account deficit (INCURA=ECI), which just two years ago widened to a record high 4.8 percent of GDP as oil prices soared, triggering the worst currency crisis since 1991. \nThe low global crude prices have helped narrow the current account deficit to just 0.2 percent of GDP in the previous January-March quarter, but the government has said its reliance on imports is unsustainable in the long-term. \nONGC accounts for about 70 percent of India's overall oil production. \nA recent tender by the state-owned firm for 20 offshore service vessels attracted a record 26 bidders who offered 168 vessels, the ONGC official said, largely at favourable rates. \nONGC is now able to contract offshore support vessels for about $14,000 a day, a 20 percent discount from last year's $20,000 a day, the official said. It is also hiring vessels for five years now compared to three years earlier to benefit from the lower rates, he added. \nEven with these discounts, the oil services firms are flooding in. Singapore's Swiber, which bagged three contracts from ONGC worth a total of nearly $800 million this year, says profit is its main driver. \n\"In the short term, I strongly believe that India will be one of our anchor regions for us to focus on,\" said Darren Yeo, deputy group chief executive officer of Swiber. \n(Additional reporting by Henning Gloystein in SINGAPORE and Rafael Nam in MUMBAI; Editing by Muralikumar Anantharaman and Miral Fahmy)", "external_links": [], "published": "2015-07-09T00:12:00.000+03:00", "crawled": "2015-07-09T00:19:48.000+03:00", "highlightTitle": ""}