{"organizations": [], "uuid": "425852e9ee0976eb677a438e03fedc12bcc2e8f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/03/eurozone-greece-idUSL8N0ZJ3KH20150703", "country": "US", "title": "WRAPUP 8-Greeks deeply divided heading into crucial vote", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "WRAPUP 8-Greeks deeply divided heading into crucial vote | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T02:05:00.000+03:00", "replies_count": 0, "uuid": "425852e9ee0976eb677a438e03fedc12bcc2e8f9"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/03/eurozone-greece-idUSL8N0ZJ3KH20150703", "ord_in_thread": 0, "title": "WRAPUP 8-Greeks deeply divided heading into crucial vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Tens of thousands attend rival rallies\n* Three polls put 'Yes' vote marginally ahead\n* PM Tsipras urges vote for \"dignity in Europe\"\n* Court rejects complaint against referendum\nBy Michele Kambas and Lefteris Papadimas\nATHENS, July 3 (Reuters) - Tens of thousands of Greeks took to the streets on Friday in rival rallies that laid bare the deep divide heading into a referendum that may decide the country's future in Europe's single currency.\nPrime Minister Alexis Tsipras, elected in January on a promise to end years of austerity, urged people packing Syntagma square in central Athens to spurn the tough terms of an aid deal offered by international creditors to keep the country afloat.\nHis European partners say a 'No' vote will jeopardise Greece's membership of the euro.\nTsipras says they are bluffing, fearing the fallout for Europe and the global economy. A 'Yes' vote may bring him down, ushering in a new period of political instability for a country reeling from five days of shuttered banks and rationed cash withdrawals.\nFraming Sunday's ballot as a battle for democracy, freedom and European values, the 40-year-old left-wing leader told Greeks to \"turn your backs on those who terrorise you daily\".\n\"On Sunday, we are not just deciding that we are staying in Europe, but that we are deciding to live with dignity in Europe,\" he told the crowd of at least 50,000.\nHis opponents accuse Tsipras of gambling Greece's future on a rapid-fire plebiscite that a major European rights watchdog says falls short of international standards of fairness.\nFour opinion polls published on Friday had the 'Yes' vote marginally ahead; a fifth put the 'No' camp 0.5 percent in front, but all were well within the margin of error.\n\"We know that the lenders will close the door if we say no, but we must fight,\" said 65-year-old pensioner Irini Stavridou, who attended the 'No' rally.\n\"We must fight not only for Greece but all the people in Europe, for those who just have a different opinion.\"\nODE TO JOY\nOn Syntagma, patriotic songs blared out over loudspeakers. At the 'Yes' camp, thousands rallied in front of the old Olympic Stadium to Beethoven's \"Ode to Joy,\" the anthem of the European Union. There appeared to be fewer people than in the 'No' crowd.\n\"I prefer to vote 'Yes', have a few more years austerity and give my child a better future,\" said unemployed economist Marina Peppa, 45. \"It's not going to be easy, but if 'No' prevails we'll have Armageddon, total poverty.\"\nWith tension building, police fired stun grenades and briefly scuffled with a few dozen black-clad people carrying red flags, often carried by anti-establishment radicals. The violence appeared to be isolated.\nIn a televised address earlier in the day, Tsipras seized on a report by the International Monetary Fund - which argued that Greece's massive public debt could not be sustained without significant writedowns - as vindication of his rejection of the lenders' terms.\nFinance Minister Yanis Varoufakis called the IMF report \"music to our ears\". Regardless of the outcome of the referendum, Greece will need some 50 billion euros as well as a massive debt writedown, the report said.\nEuropean policy makers, however, issued fresh warnings of the costs of a 'No' vote in a plebiscite called with just eight days' notice after the breakdown of talks with the European Commission, the IMF and the European Central Bank.\nCommission President Jean-Claude Juncker and German Finance Minister Wolfgang Schaeuble dismissed Tsipras' argument that his government would be able to move smoothly to negotiate more favourable terms if Greeks backed his rejection.\n\"If the Greeks will vote 'No', the Greek position is dramatically weakened,\" Juncker told a news conference.\nBRINKMANSHIP\nTsipras is betting Europe will compromise rather than let Greece slip out of the euro zone. But behind the rhetoric, there were more concrete signs of the pressure Europe can exert on Greece.\nThe euro zone's rescue fund, Greece's largest creditor, said it was reserving the right to call in 130.9 billion euros of debt ahead of time after Athens defaulted on an IMF loan.\nWith banks shuttered all week, cash withdrawals rationed and commerce seizing up, Sunday's ballot could decide whether Greece gets another last-ditch financial rescue in exchange for more harsh austerity measures or plunges deeper into economic crisis.\nOne in four Greek workers are jobless; the economy has shrunk by a quarter since 2009.\nTsipras' opponents have pointed to the fact that the referendum is on a deal that is no longer on the table, accusing him of recklessly endangering the country's future.\nGreece's top administrative court, however, rejected an appeal against the referendum by two Greek citizens, who argued that the constitution bars plebiscites on fiscal issues and that the question is too complex.\nThe 'No' campaign has directed much of its venom at Germany, the euro zone's dominant power and Greece's biggest creditor.\nOne poster plastered in central Greece shows a picture of German Finance Minister Wolfgang Schaeuble with the slogan: \"For five years he's been sucking your blood. Tell him NO now.\"\nBut fuelling fears of worse to come, the Financial Times reported that Greek banks were making contingency plans to possibly \"bail in\" depositors, a prospect Greek leaders have repeatedly denied.\nThe report said plans to shave off at least 30 percent on deposits above 8,000 euros were \"an increasingly likely scenario for at least one bank\", as part of a restructuring of the bank sector once Greek is back in a bailout programme.\nLouka Katseli, head of Greece's Bank Association and chair of the National Bank of Greece, dismissed the report as \"completely baseless\".\nShe told Skai TV: \"There are no such scenarios at any Greek bank, not even as an exercise on paper.\" (Additional reporting by James Mackenzie in Athens, Julien Ponthus and Ingrid Melander in Paris and David Chance in Washington; Writing by James Mackenzie and Matt Robinson; editing by Anna Willard)", "external_links": [], "published": "2015-07-04T02:05:00.000+03:00", "crawled": "2015-07-04T01:25:23.000+03:00", "highlightTitle": ""}