{"organizations": ["Noor Bank", "Thomson Reuters"], "uuid": "b51e1d3557e3756d3723de41f76ffc8fd680b16e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/pr/images/2015/8fb8g_2015_07_07.jpg", "site_section": "http://www.zawya.com/rssfeeds/islamic_finance.xml", "section_title": "Zawya.com - Islamic Finance News", "url": "http://www.zawya.com/story/Noor_Bank_Thomson_Reuters_host_cash_management_seminar_in_Dubai-ZAWYA20150707120452/", "country": "AE", "title": "Noor Bank, Thomson Reuters host cash management seminar in Dubai", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Noor Bank, Thomson Reuters host cash management seminar in Dubai", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T22:31:00.000+03:00", "replies_count": 0, "uuid": "b51e1d3557e3756d3723de41f76ffc8fd680b16e"}, "author": "", "url": "http://www.zawya.com/story/Noor_Bank_Thomson_Reuters_host_cash_management_seminar_in_Dubai-ZAWYA20150707120452/", "ord_in_thread": 0, "title": "Noor Bank, Thomson Reuters host cash management seminar in Dubai", "locations": ["Dubai Dubai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dubai plans new sukuk channels as listings top other centres Dubai-UAE: 07 July, 2015 Noor Bank, in conjunction with Thomson Reuters , hosted an engaging seminar on 'Cash Management Innovative Solutions' for the bank's corporate clients. \nHeld at the Ritz Carlton - Dubai International Financial Centre, the seminar saw experts share their insights on the region's changing cash management landscape, as well as best global practices and evolving requirements of the industry. \nAs part of the agenda, Ehsaan Ahmed, Head of GTS and Corporate Strategy, Noor Bank moderated a panel discussion on key payment trends in the UAE and cash management solutions offered by banks in the region. The panel discussion drew the perspectives of Rajeev Kumar, General Manager, Middle East & Africa, MasterCard and Jean Philippe Sarthar, CFO, Axiom Telecom . Commenting on the seminar, Ehsaan Ahmed said: \"We hosted this seminar in partnership with Thomson Reuters as part of Noor Bank's continued commitment to delivering cutting-edge banking solutions. Enabling industry leaders to network and discuss best industry practices, the seminar served as a valuable platform for Noor Bank to forge stronger relationships with our clients. We aim to host similar sessions in future as part of our ongoing strategy to consolidate our status as the preferred bank of choice for our customers.\"\nDuring the panel discussion, the participants examined areas where banks need to focus more to fulfill corporate client requirements as well as the key payment trends regionally, adoption of alternative payment solutions involving mobile wallet, contactless schemes and card based value propositions. The general consensus was that cash management solutions offered by banks need to further leverage technology to deliver efficiencies, such as seamless integration with corporate enterprise resource planning (ERP) systems to increase operational efficiency. The panel also discussed how payment innovation, emerging on the back of digital wallets, are presenting new opportunities for market players. Rajeev Kumar observed that the payment scenario in the region has witnessed a large change in recent years with payments going digital. He further noted that the retail space would eventually translate a greater impact on larger corporates. \nHighlighting the numerous transactions that Axiom makes while managing its vast client base, Jean Phillippe highlighted the importance of banks offering auto-reconciliation capabilities to help them save time, money and security costs. He also shared perspectives on future regional trends, and said that in the next 10 years he anticipates greater penetration of digital solutions to make payments easier and more secure. \nAs a moderator, Ehsaan Ahmed illustrated the positive initiatives within the region that are set to ensure market maturity. He projected that Dubai would move towards more cashless and electronic technology transactions in the years to come given the 'smart initiative' strategies already in place, as well as the ongoing efforts of the UAE Central Bank to promote new payment solutions. \nDeloitte also participated during the seminar, showcasing a presentation on spending habits in the region buoyed by rising income levels and resurgent economies. It also outlined the many regional growth opportunities and shed light on cash flow forecasting and working capital cycles. \nThe seminar was conducted as a follow-up to a similar session in November 2014 on trade and supply chain finance also co-hosted by Noor Bank and Thomson Reuters . \n-Ends- \nAbout Noor Bank Noor Bank began operations, in Dubai, in 2008, as Noor Islamic Bank. It is a full service bank delivering the broadest range of products for its customers, with an emphasis on unique and personalised service. Noor Bank is governed by a Shari'a board, comprising leading Islamic scholars with extensive experience and expertise in legal, financial and banking-related matters. Noor Bank is rated \"A-\" IDR with a stable outlook by Fitch Ratings. The corporate shareholders of the Bank are The Office of the Crown Prince of Dubai (25.73%), the Investment Corporation of Dubai (22.71%) and the Emirates Investment Authority (4.7%). The remaining shares are beneficially held by individuals who each own less than 5% of Noor Bank. \nFor further details, please visit: www.noorbank.com or call 800 6667. \nFor media enquiries, please contact:Gaurav Ghose", "external_links": [], "published": "2015-07-07T22:31:00.000+03:00", "crawled": "2015-07-09T03:28:47.000+03:00", "highlightTitle": ""}