{"organizations": [], "uuid": "64ca67d78a1900b389556101bef1cda0f73bf51d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DQ791_carmel_ZG_20150724151549.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/is-it-normal-to-resent-my-working-spouse-this-much-2015-07-27", "country": "US", "title": "Is it normal to resent my working spouse this much?", "performance_score": 0, "site": "marketwatch.com", "participants_count": 4, "title_full": "Is it normal to resent my working spouse this much? - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T03:00:00.000+03:00", "replies_count": 3, "uuid": "b0d7f46b599f70bd1239a30d7fc467fb48e2a3a1"}, "author": "By     Catey Hill", "url": "http://www.marketwatch.com/story/is-it-normal-to-resent-my-working-spouse-this-much-2015-07-27#post-0", "ord_in_thread": 0, "title": "Is it normal to resent my working spouse this much?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It sounded like a dream when you started your family — you’d take a step back from your career, ask the boss for flexible or fewer hours, begin working from home, even quit your job entirely. But pretty soon, you noticed something unsettling: a feeling of jealousy toward your spouse for getting to go off to a demanding job each day.\nIt’s a familiar and growing — though little-talked about — problem, as more women (and a growing number of men) are giving up or stepping back their careers to raise their family. While the number of women ages 25-54 in the workforce from 2000 to 2013 grew steadily in most Western countries, in the U.S. it fell from 74% in 2000 to 69% in 2013. And women in this country work part-time jobs at nearly double the rate that men do.\nPart of the reason for these numbers is that women leave the workforce or take a step back to focus on their families — many are glad to do it, dreaming of days that don’t involve long hours at the office, but instead revolve around the home.\nFully 61% of non-working women ages 25 to 54 say that family responsibilities were the reason they weren’t working (just 37% of non-working men in that age group said the same thing ), according to a Kaiser Family Foundation/New York Times/CBS News poll released last year. And the main reason women work part-time instead of full-time is for so-called noneconomic reasons like raising a family, the Center for Economic and Policy Research notes; indeed, when asked why they work part-time, women cite child-care issues at more than seven times the rate men do.\nBut while we dream of stepping back (fewer than 1 in 3 moms say that working full time is ideal for them , with millennial women even more likely than their older counterparts to want to pause their careers for kids), it doesn’t always make us happy. Women working part time say they experience more family guilt and career regret than either working moms or stay-at-home moms, according to a study published in the journal Advances in Communication Theory and Research . And stay-at-home moms feel more anger, sadness and other emotions than do working moms and working women without kids.\nSometimes, some of that anger, resentment and other negative emotions is directed toward our spouse’s careers. While we — at least on paper — have the golden ticket (no more going into the office or fewer hours in the office), the harsh realities of parenthood have left us feeling jealous of our spouses’ jobs, even with the long hours and demands those jobs come with.\n“It’s a common feeling,” says Chicago-area clinical psychologist Nancy Molitor, who says she sees plenty of couples in her practice facing these issues.\nTwenty-five-year-old mom-to-be Tiffany Mason, who transitioned from a demanding job in the entertainment field to a work-from-home job as a life coach in anticipation of parenthood, told us that she “can’t help but to feel jealous that my husband works full time outside the house and gets to have that in-person interaction.” Others feel upset about the fact that while their world (at least in some ways) has gotten smaller and more mundane with its focus on the kids and household, their spouse’s has gotten larger and more exciting — as his job allows him to travel, make money and move up the career ladder. “There’s a glamorization of working life — even though you know it’s hard,” says psychologist Elizabeth Lombardo, author of Better Than Perfect .\nWhile, on the plus side, having a stay-at-home spouse enables the working spouse to do more professionally (travel, work longer hours, etc.), on the flip side, the breadwinning spouse may gets even more entrenched at work as she feels the need to work harder and harder to make sure the family has enough money — and that can make the spouses feel even further apart.\nJealousy and resentment of a spouse’s career may also stem from the fact that the spouse with the stepped-down career may feel less important and that they are contributing less than the spouse who works more, thanks to the fact that our society puts a high value on working for pay, says Lombardo. It can also stem from the fear of missing out. One 43-year-old, Atlanta-based mother, who began working in public relations part-time when her children were small, says she feels “anxiety that I could potentially be missing out on career advancement due to the fact that I haven’t worked in a full-time capacity in a decade.”\nAnd, of course, there’s the harsh reality of how difficult being a full-time parent is. When Atlanta resident Sarah Hosseini, 30, quit her job as a TV producer in 2010 to become a stay-at-home mom, she and her husband thought it would be the best thing for the family. “We were so wrong,” she says. “I never factored in that working was/is my sanity…I never factored in that I don’t like staying home with small children.”\nPrev Page 1 2 Next Page", "external_links": ["http://www.cepr.net/blogs/cepr-blog/choosing-to-work-part-tim", "http://www.k-state.edu/actr/2009/12/20/the-paradox-of-flexibility-guilt-regret-and-worklife-balance-for-today_25e2_2580_2599s-mother-esther-otis/default.htm", "http://elizabethlombardo.com/perfect/", "http://kff.org/other/poll-finding/kaiser-family-foundationnew-york-timescbs-news-non-employed-poll/", "http://www.pewsocialtrends.org/2013/03/14/chapter-1-changing-views-about-work/"], "published": "2015-07-27T03:00:00.000+03:00", "crawled": "2015-07-27T16:05:57.123+03:00", "highlightTitle": ""}