{"organizations": [], "uuid": "dc06830f214f37078a1db3bad73ab0d4247dcc56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-travel-leisure/?format=rss", "section_title": "Travel Industry News | Leisure Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/ladbrokes-leverage-betting-shops-boost-195956679.html", "country": "US", "title": "Ladbrokes to leverage betting shops to boost online punters", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Ladbrokes to leverage betting shops to boost online punters", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T22:59:00.000+03:00", "replies_count": 0, "uuid": "dc06830f214f37078a1db3bad73ab0d4247dcc56"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ladbrokes-leverage-betting-shops-boost-195956679.html", "ord_in_thread": 0, "title": "Ladbrokes to leverage betting shops to boost online punters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 1, 2015, 06:33 BST - UK Markets open in 1 hr 27 mins Ladbrokes to leverage betting shops to boost online punters By Ben Martin | Telegraph – 9 hours ago 25.59 +0.22 \nIt is understood that the bookmaker's delayed business review will outline plans to use its in-shop Wi-Fi to encourage punters to use its digital products \nLadbrokes (LSE: LAD.L - news ) will unveil plans to leverage its 2,194-strong, Wi-Fi equipped betting shop estate to boost the number of recreational punters who wager with it online as part of its long-awaited business review. \nNew (KOSDAQ: 160550.KQ - news ) boss Jim Mullen was due to present his strategy to the City on Tuesday , but postponed after the bookmaker’s merger talks with Gala Coral leaked last week . Irrespective of whether that deal goes through, it is understood Mr Mullen will implement the turnaround plan drawn up since he took the helm in April and is expected to unveil the contents of the review soon. \nLadbrokes wants to bolster its market share in sports betting, particularly in football, where it has fallen behind its rivals in recent years. A key area of focus will be increasing the number of recreational punters who bet with Ladbrokes both in its shops and online, especially on mobile devices. \nTo do that, it is understood that the bookie will invest in staff training so that shops in areas where it faces strong competition from the likes of William Hill (Other OTC: WIMHY - news ) have a resident sports expert, who can engage punters and encourage them to sign-up for Ladbrokes’s online offerings on the spot using Wi-Fi. \nThe bookie will identify employees who are particularly enthusiastic about sport to take on the roles, in what will form part of a broader push to bring its staff culture more in line with that of its customers. \nIt will also bolster investment in those shops it deems particularly competitive and improve marketing of its digital products. The in-shop Wi-Fi will be upgraded to cope with large numbers of users. \nLadbrokes rocked the gambling world last week when it emerged that it was in talks about combining with Gala Coral’s betting business to create the country’s biggest bookie , with more than 4,000 shops. \nThe two companies are yet to agree terms, however, and the merger could fall apart. A deal would also attract prolonged scrutiny from competition authorities. Given the uncertainty, Ladbrokes will press ahead with Mr Mullen’s plans whether or not the Coral merger completes.", "external_links": [], "published": "2015-06-30T22:59:00.000+03:00", "crawled": "2015-07-01T08:36:13.000+03:00", "highlightTitle": ""}