{"organizations": [], "uuid": "fbb7d2a30d0503934c5fd76514df13e5c0932235", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/4/6/v/y/image.related.articleLeadwide.620x349.gi46wv.png/1435881332554.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/are-you-suffering-from-lifestyle-creep-20150702-gi46wv.html", "country": "AU", "title": "Are you suffering from lifestyle creep?", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Are you suffering from lifestyle creep?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "fbb7d2a30d0503934c5fd76514df13e5c0932235"}, "author": "Suzanne Woolley", "url": "http://www.smh.com.au/business/are-you-suffering-from-lifestyle-creep-20150702-gi46wv.html", "ord_in_thread": 0, "title": "Are you suffering from lifestyle creep?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Champion savers watch their expenses to keep their lifestyle spending stable even when their income rises.\nWhen you get a raise, especially after a long spell of puny or no hikes in pay, it's a time to celebrate.\nSo it's easy to tell that voice telling you not to waste money on a morning brew and a muffin to shut up for a minute. You've earned that treat.\nAnd you have. But you may be standing on the precipice, or already be in the grips of, a dangerous and pernicious trend: lifestyle creep.\nThe downside of using a credit card is it's easy to spend too much. Photo: Louise Kennerley\nIt sounds creepily fungal, and for good reason. It's a sort of self-generated inflation rate, something no one needs when wages growth just had a poor showing in the economic data. Once our incomes go up, we often incorporate new little treats into our routine and hardly notice. There's that morning coffee, and then there are more lunches out, and then there's upgrading the smartphone, having your home cleaned more often, leasing a fancier car.\nSo if you're lucky enough to get a pay rise, have that coffee and muffin today, and then again maybe tomorrow. Then think about ways to head off little lifestyle upgrades that add up to big lost opportunities to save.\nIf you're not one of the lucky few getting raises, being smarter about saving is a way basically to give yourself a raise, or at least more financial flexibility. Since studies have shown that we get most of our raises in our 20s and 30s, fending lifestyle creep can pay off big over the long run. Here are a few ways to combat lifestyle creep and be a smarter saver:\n1. Increase your superannuation contributions. For many people, money removed from a paycheck before it's even seen has a remarkable way of not being missed.\n2. Set up automatic deductions to a savings account. If you already have automatic deductions funneling money into savings sight unseen, increase the amount, even if by just a little bit. Watching the money add up over time is inspiring.\n3. Start tracking your expenses on a site such as ASIC's Moneysmart's budget planner , which makes setting and tracking a budget almost fun. If you use a credit card for most purchases (cash back, preferably, and only if you pay off the balance each month), you can at least get a better sense of how much you're spending each month or quarter and if you're spending more without realising it.\n4. The downside of using a credit card or a debit card is that behavioural finance research shows using cash causes us more pain than using plastic. That can be a good deterrent if you're prone to impulse purchases. If you're so inclined, leaving your credit cards at home and taking only the cash you want to spend might be a better idea.\n5. Set a savings challenge. Every six months, go over your monthly charges and see how much you can cut or renegotiate for a better deal. Think of it as a fun way to save more without actually having to cut anything. You'd be surprised at the special offers that materialise when you call to cancel a digital subscription or pay TV package. Share your savings wins on social media and ask friends for advice on getting better deals. Getting a good deal is a point of pride, and crowdsourcing savings strategies is a great way to make peer pressure work in your favour.\nBloomberg with BusinessDay", "external_links": ["http://www.bloomberg.com/news/articles/2015-06-09/how-peer-pressure-can-help-you-save-for-retirement", "https://www.kitces.com/blog/big-raises-and-lifestyle-creep-why-its-crucial-to-establish-good-spending-habits-early/", "https://www.moneysmart.gov.au/tools-and-resources/calculators-and-apps/budget-planner", "http://www.bloomberg.com/news/articles/2015-06-25/the-downside-to-higher-consumer-spending"], "published": "2015-07-03T03:00:00.000+03:00", "crawled": "2015-07-04T16:10:23.000+03:00", "highlightTitle": ""}