{"organizations": [], "uuid": "6815efb038a93ce7505a41541eecdb3c1ed647c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/pcOhLIEeSxy50vYZqGFXSg--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/FIN_ANZ_AAP_ART_FTP_LIVE_1/2945913_20150706001152549443-original_1280x720_original.jpg", "site_section": "https://au.finance.yahoo.com/news/category-commodities/?format=rss", "section_title": "Commodities Market News - Yahoo!7 Australia Finance", "url": "https://au.finance.yahoo.com/news/joyce-backed-over-stopping-mine-070011329.html", "country": "US", "title": "Joyce backed over stopping mine", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Joyce backed over stopping mine", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T10:00:00.000+03:00", "replies_count": 0, "uuid": "6815efb038a93ce7505a41541eecdb3c1ed647c2"}, "author": "", "url": "https://au.finance.yahoo.com/news/joyce-backed-over-stopping-mine-070011329.html", "ord_in_thread": 0, "title": "Joyce backed over stopping mine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joyce"], "text": "View Photo \n\nA second minister has come out against a controversial Chinese coal mine as Barnaby Joyce rebuffs Tony Abbott and is pressing the NSW government to stop the project. \nAssistant Health Minister Fiona Nash is rallying behind the agriculture minister amid the furore over the government's approval of the $1 billion Shenhua-operated Watermark mine near Gunnedah, which Mr Joyce has labelled \"ridiculous\". \nThe NSW Nationals senator told AAP she \"completely\" supported Mr Joyce in stating what was \"absolutely obvious\". \n\"Mining should not occur on prime farmland,\" Senator Nash said in a statement on Friday. \nFellow Nationals senator John Williams said he was also concerned about the project, which should have been taken to federal cabinet. \n\"(Environment Minister) Greg Hunt's made his decision, but I think the main thing here is about food sustainability,\" he told AAP. \nAll three Nationals are now at odds with Prime Minister Abbott, who argues that agriculture and mining can co-exist on the land. \nMr Abbott has excused Mr Joyce's anger by saying the Nationals deputy leader was speaking as a local member on behalf of his constituents. \nBut Mr Joyce contradicted that on Friday, saying his criticisms were being made as a minister, not as a member. \nMr Abbott acknowledged Mr Joyce was expressing \"some disappointment\" over the mine. \n\"I really do respect his passion and commitment, both as a local member and as a minister,\" Mr Abbott told reporters on the Gold Coast on Friday. \nMr Joyce has now written to NSW Premier Mike Baird asking him to stop the project, saying it is in the state's hands for final approval. \nHowever, it is understood the NSW government has no intention of halting the mine. \nThe approval of a mining lease, which Shenhua needs, is a relative formality and legally cannot be refused except in very exceptional circumstances. \n\"In NSW, major projects are determined on their merits, not on their politics, and this will remain the case,\" a spokesman for state Energy Minister Anthony Roberts told AAP. \nBoth federal and NSW farmer lobby groups have come out against the mine. \nThe National Farmers Federation joined the NSW Farmers Association on Friday by saying the decision of the state and federal governments shows they are unwilling to balance the interests of farmers and the mining industry. \nFarmers are also appealing the NSW decision through the courts, using koala protection as the basis for their case. \nLocal community group Upper Mooki Landcare argues the project could put the local koala population at risk of extinction. \nNicola Chirlian, the group's chairwoman, said it was \"about bloody time\" to see Mr Joyce coming out swinging against the project. \n\"He could have done something about it a lot earlier than he has,\" she told AAP. \nThe community group's lawyer, Sue Higginson, said both governments have given Shenhua the legal right to proceed. \n\"It is too late for Mr Joyce to be saying somebody else should do something, because the time to do something is before it's made,\" she told AAP. \n\"These are legal decisions, they are binding.\" \nMr Joyce's disagreement with the government has prompted calls for his resignation as a cabinet minister. @y7finance on Twitter, become a fan on Facebook Joyce backed over stopping mine AAP \nA second minister has come out against a controversial Chinese coal mine as Barnaby Joyce rebuffs Tony Abbott and …", "external_links": [], "published": "2015-07-10T10:00:00.000+03:00", "crawled": "2015-07-10T11:56:16.000+03:00", "highlightTitle": ""}