{"organizations": [], "uuid": "b68a3ad6f558b76e4cf09de3da179481b0c348e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/05/07/102658998-472361578.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss/rss.html", "section_title": "Finance", "url": "http://www.cnbc.com/id/102801848", "country": "US", "title": "What we need to move markets to new highs in second half", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "What we need to move markets to new highs in second half", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "b68a3ad6f558b76e4cf09de3da179481b0c348e4"}, "author": "Bob Pisani", "url": "http://www.cnbc.com/id/102801848", "ord_in_thread": 0, "title": "What we need to move markets to new highs in second half", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images Traders work on the floor of the New York Stock Exchange. Let's face it. It's been a pretty crummy first half of the year for earnings, and worse for revenues.\nRight now, analysts are expecting declines in both earnings and revenues for the second quarter, though earnings will likely move into positive territory as the companies begin to report.\nAnd there are similar problems for the second half. Earnings are facing two significant headwinds:\n1) No revenue growth\nUnfortunately, the trend in the second half is depressingly similar to the trend in the first half: a modest, low-single digit increase in earnings, but revenues continue to veer between flat to declining.\nThe fourth quarter, for example, is expected to see earnings gains of 3.4 percent, but revenues are expected to be roughly flat, up only 0.7 percent, according to S&P Capital IQ.\nRead More Economy on the mend, but profit drivers look weak: Strategist\nBlame it on the slow growth in the economy, if you want.\nRegardless, better than expected earnings, weaker than expected sales. That is a problem.\nIt's a problem because if you really want to kick start a second half rally and move stocks to new highs, you will need to see sales pick up. You will need to see capital spending pick up. You will need to see less emphasis on cost cutting and share buybacks.\n2) Stocks never corrected\nThe S&P 500 is only 3 percent from its May historic highs. You might think that is good news, and it is, but it is also a problem.\nWe never had a correction. We never had a drop in prices to reflect the slower economic growth environment.\nAnd that, I believe, is limiting the upside for stocks. There are many traders entering the second half with a \"buy the dips, sell the rallies\" mentality.\nRead More Dow has 90% chance of rebound this month: Chart\nHowever, it's not all gloom and doom. There are several tailwinds for earnings:\n1) The U.S. economy is slowly improving, and the worst of the earnings revisions appear to be behind us. Earnings expectations are low for the second half, but are not dropping as much as it did going into 2015.\nThe improving economy is prompting optimism among analysts who cover consumer stocks. Consumer Discretionary, in particular, is expected to be strong, up roughly 14 percent in both Q3 and Q4, according to S&P Capital IQ, because of improvement in home building and autos and expected modest gains by retailers.\nFinancials and health care are also expected to see earnings gains of roughly 10 percent over the same period last year. Banks are expected to do better due to improving loan growth and higher rates, while health care is expected to remain a market leader because all segments are strong, including biotech and pharmaceuticals. Health care providers like HMOs and hospitals are also expected to remain strong due to the boost to HMOs and hospitals from the Supreme Court ruling on Obamacare.\nUnfortunately, hopes for a turnaround in energy earnings have now faded, with analysts again expecting a roughly 50-percent decline in earnings. They are also starting to take down numbers for 2016.\nInterest rate sensitive sectors like utilities and telecom will also likely remain under pressure.\nRead More Cramer: A stock so bad I won't say its name\nThe bottom line: the second half will see improvement, but it will be choppy.\n2) Central banks around the world are on the side of the markets. Forget about Don't Fight the Fed. How about, Don't Fight the Fed, or the ECB, or the People's Bank of China, or the Bank of England, or the Bank of Japan?\nEvery time the data deteriorates, central banks step in and cut rates. China just did it. That puts a floor under the markets. The Yellen Put is very real.\nFinally, there's one wildcard: the dollar. The strong dollar has been a major problem for earnings. The U.S. dollar reached its peak March 13, about the time management teams provided guidance for the second quarter. Understandably, that guidance was very conservative, particularly for multinationals. Since then the dollar has come down; if it comes down more, that will be a major tailwind for stocks.\nAnother reason to hope for a resolution to the Greek issue!", "external_links": [], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-01T15:38:29.000+03:00", "highlightTitle": ""}