{"organizations": ["IMF"], "uuid": "32402cd777c5db2309718b9ad9d2e3fda9b717ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507040119.html", "country": "US", "title": "Mozambique: IMF Wants \"Stronger Controls\" Over State Companies", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Mozambique: IMF Wants \"Stronger Controls\" Over State Companies", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T16:38:00.000+03:00", "replies_count": 0, "uuid": "32402cd777c5db2309718b9ad9d2e3fda9b717ad"}, "author": "", "url": "http://allafrica.com/stories/201507040119.html", "ord_in_thread": 0, "title": "Mozambique: IMF Wants \"Stronger Controls\" Over State Companies", "locations": ["Mozambique", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa: Tutus Renew Wedding Vows On 60th Anniversary \nIn other words, Mozambique is no longer asking for or receiving IMF loans. Nonetheless the IMF approval for Mozambique's economic policies is still regarded as useful, since it sends positive signals to other donors and funding agencies. \nA brief Thursday IMF press release cites the Deputy Managing Director and Acting Chair, Min Zhu, as prising Mozambique's growth and inflation record saying, while warning that low commodity prices increase the risks associated with the country's coal and natural gas projects for the immediate performance. \nHe described Mozambique's performance under the PSI as “mixed”, claiming that “While structural reforms have been proceeding, there were macroeconomic policy slippages and reserve losses in late 2014”. \nNonetheless the IMF was optimistic that “With a strong fiscal adjustment envisaged in the current budget and a recent tightening of liquidity conditions, needed steps to maintain macroeconomic stability are now in place. The decline in international reserves has largely been reversed, and greater exchange rate flexibility will help the economy to better respond to external shocks in the period ahead”. \n“The strong fiscal adjustment in the budget appropriately calls for revenue mobilization and expenditure restraint, while safeguarding social programs”, the release adds. “Recent fiscal reforms have strengthened the policy framework but more needs to be done to improve public financial management, including by stronger controls over state-owned enterprises and enhanced management of fiscal risk”. \nThe IMF does not say which state-owned enterprises it has in mind, but it is reasonable to assume that the Mozambican Tuna Company (EMATUM) is among them, given the fact that this year it must start repaying the 850 million US dollar loan it obtained on the Eurobond market in 2013. \nThe press release concludes that “Ongoing progress on a broad range of structural reforms, including the passage of the new mining and hydrocarbon legislation, is encouraging. Nonetheless, further measures are needed to make poverty more responsive to growth and strengthen the business climate.” Mozambique \nThe Mozambican gay community has declared its wish for Mozambique “to become a world reference in defence of the … see more » Copyright © 2015 Agencia de Informacao de Mocambique. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-04T16:38:00.000+03:00", "crawled": "2015-07-04T17:06:51.000+03:00", "highlightTitle": ""}