{"organizations": ["Facebook Twitter Google"], "uuid": "7ca56e85264321b8bb2595d265beb2125beda7a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.goodreturns.in", "main_image": "http://www.goodreturns.in/img/2015/07/04-1435984655-bank.jpg", "site_section": "http://www.goodreturns.in/rss/money-business-news-fb.xml", "section_title": "Latest Business News | Finance News India | International Share Market – Oneindia Money", "url": "http://www.goodreturns.in/news/2015/07/04/mudra-bill-likely-be-parliament-winter-session-ceo-mudra-bank-371833.html", "country": "CA", "title": "MUDRA Bill Likely to be in Parliament in Winter Session: CEO, MUDRA Bank", "performance_score": 0, "site": "goodreturns.in", "participants_count": 0, "title_full": "MUDRA Bill Likely to be in Parliament in Winter Session: CEO, MUDRA Bank", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T07:37:00.000+03:00", "replies_count": 0, "uuid": "7ca56e85264321b8bb2595d265beb2125beda7a5"}, "author": "", "url": "http://www.goodreturns.in/news/2015/07/04/mudra-bill-likely-be-parliament-winter-session-ceo-mudra-bank-371833.html", "ord_in_thread": 0, "title": "MUDRA Bill Likely to be in Parliament in Winter Session: CEO, MUDRA Bank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Saturday, July 4, 2015, 10:07 [IST] Facebook Twitter Google+ Comments Mail \nA bill towards MUDRA Bank is going to be introduced in winter session of the Parliament to make it operational, said Mr Jiji Mammen, CEO, MUDRA Bank at an ASSOCHAM event held in New Delhi on Friday. \nThe drafting committee has been constituted and the draft bill is already prepared. A couple of rounds of discussion have also taken place but still in a drafting stage, ASSOCHAM said in the press release. \nWe expect by winter session it could be placed in Parliament, said Mr Mammen while inaugurating a conference on National Summit on Small Business Financing Through MUDRA Bank - The Way Forward,' organised by The Associated Chambers of Commerce and Industry of India (ASSOCHAM). \nThe scheme for financing has been finalised, the policy has been finalised and eligibility criteria for partners that has also been finalized. \n\"We have already enrolled about 122 partners which includes around 73 banks, 25 microfinance institutions (MFIs), 23-24 non banking finance companies (NBFCs)\", highlighted Mr. Mammen. \n\"We are also in the process of constituting an Information Technology (IT) committee because IT platform is going to be the game changer. We are also in the process of processing the applications we have received around 12 applications from different institutions which are already partners. Around 15 banks have already executed their refinance agreement\", said Mammen. \n\"Till now no loan disbursement has taken place but one proposal has been sanctioned\", said MUDRA CEO at an event. \nHe further said, \"Rs. 20,000 crore allocated for disbursement has not taken place. We have already got the allocation made by Reserve Bank of India (RBI) because this budget announcement has to be followed up with an allocation by the RBI that has already been done\". \nThe Reserve Bank of India has allocated Rs. 20,000 crore and we have already received Rs. 5,000 crore. We are expecting to make the disbursement very soon, said Mr. Mammen. \nWe are working as an NBFC now therefore, facing some challenges on the exposure norms front etc which are different from a Development Financial Institution (DFI). These things need to be considered and RBI is considering some kind of an exemption for us. \nHe also said, Mudra card is a combination of bank and an MFI. It is a fusion of banking facility as well as MFIs so the borrower will get a better service, adds Mr. Mammen. \n\"I don't see any challenges at the moment because in the last three months we were in the process of setting up, putting systems in place. We have already short listed the partners and enrolled some of them\", he said. \nAsked when loan disbursement is likely to take place, Mr. Mammen said, that it should happen in a week's time because 15 banks have already signed General Refinance Agreement with them so any moment they can now approach us for refinancing. \nSimilarly around 12 applications from MFIs and NBFCs are available with us one has already been sanctioned. He said, the first loan sanctioned is of around 30 crore. \nMUDRA aims at addressing these challenges and creating an inclusive an inclusive economic growth by supporting development and promotional activities in the sector. \nGoodReturns.in Other articles published on Jul 4, 2015 Write Comments Company Search Enter the first few characters of the company's name or the NSE symbol or BSE code and click 'Go' More Headlines", "external_links": [], "published": "2015-07-04T07:37:00.000+03:00", "crawled": "2015-07-04T08:22:22.000+03:00", "highlightTitle": ""}