{"organizations": [], "uuid": "f1d099fa46da96adac9e28a3fa59b409c38f7c9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.euractiv.com", "main_image": "http://www.euractiv.com/sites/default/files/wolfgang_schauble_0.jpg", "site_section": "http://www.euractiv.com/sections/euro-finance", "section_title": "Euro &amp; Finance | EurActiv", "url": "http://www.euractiv.com/sections/eu-priorities-2020/europe-feels-aftershocks-greek-deal-316745", "country": "GB", "title": "Europe feels the aftershocks of the Greek deal", "performance_score": 0, "site": "euractiv.com", "participants_count": 1, "title_full": "Europe feels the aftershocks of the Greek deal | EurActiv", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T19:47:00.000+03:00", "replies_count": 0, "uuid": "f1d099fa46da96adac9e28a3fa59b409c38f7c9a"}, "author": "euractiv.com", "url": "http://www.euractiv.com/sections/eu-priorities-2020/europe-feels-aftershocks-greek-deal-316745", "ord_in_thread": 0, "title": "Europe feels the aftershocks of the Greek deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Schaeuble's recent ideas are not likely to fly, but the controversy over the role of the Commission is only a part of a bigger debate in Europe: the dispute over what the future European Union should look like, write Stratfor's analysts.\nStratfor is a Texas-based global intelligence company.\nA German newspaper reported on July 30 that German Finance Minister Wolfgang Schaeuble wants to transfer the responsibility of enforcing rules in the European Union to a new politically independent agency. According to the report, Schaeuble is concerned about the European Commission's behavior during the negotiations with Greece, thinking the institution's push for a compromise between Athens and its creditors is incompatible with its role as the main enforcer of EU norms. A spokesman for the German Finance Ministry later confirmed that Schaeuble did express concern about the commission's dual role as a political actor and guardian of EU treaties, but denied plans to withdraw any powers from Brussels.\nThe founders of the European Union saw the commission as the ultimate supranational institution: a body of experts that would respond to global interests instead of national priorities, both proposing and enforcing measures that would progressively integrate the Continent. When the European financial crisis raised questions about the European Union's weak democratic legitimacy, member states decided that the commission president would no longer be elected by EU leaders behind closed doors, but by the largest party in the EU Parliament.\nThe European Commission saw the change as an opportunity for a more prominent role in continental affairs. In late 2014, Brussels decided to grant France and Italy more time to meet their fiscal targets. In early 2015, European Commission President Jean-Claude Juncker became one of the few friendly faces the Greek government found during its negotiations with Athens' creditors. Both of these circumstances worried Germany. Suddenly, Brussels was too close to Mediterranean Europe and its interests and too far from Berlin's vision of a continental bloc based on strict rule enforcement.\nBut the controversy over the role of the Commission is only a part of a bigger debate in Europe: the dispute over what the future European Union should look like. Countries in Northern Europe want to prevent the continental bloc from becoming a transfer union in which the north's wealth is redistributed to the south. Countries in Southern Europe want to prevent the European Union from becoming a rigid institution in which northern members impose policies on southern members.\nThese disputes became clear last week, when France proposed the creation of a eurozone parliament with a eurozone budget, and Germany reacted by suggesting the creation of a eurozone finance minister with the power of intervening in national budgets. The French and the Germans are worried about the consequences of the Greek crisis, but their assessment of the problem is different. So are their proposals to solve it. Paris fears that Germany is willing to asphyxiate a rebel country in order to prevent Europe from becoming a transfer union. Berlin is worried that EU norms on deficit and debt will become irrelevant.\nBerlin has two key imperatives when it comes to Europe: It needs to protect the free trade agreement to secure markets for its exports and to preserve a sphere of influence in Europe, but it also needs to protect its national wealth. For historical reasons, Germany has to be careful in pursuing these somewhat conflicting interests. Its neighbors could bristle at a perceived German attempt to control the European Union.\nGerman Chancellor Angela Merkel and Schaeuble share these imperatives but have slightly different approaches to them. The chancellor is interested in protecting Germany's political and economic influence in Europe, and the finance minister is focused on strengthening and sustaining the currency union. Greece's capitulation was seen as a victory for Schaeuble, but it was probably a greater victory for Merkel. However, the European Commission's behavior — along with some policies by the European Central Bank, such as the introduction of quantitative easing — are taking the continental bloc in a direction that worries both Schaeuble and Merkel.\nGermany does not have to act immediately. Unemployment is at record low levels, and its economy is growing at acceptable rates. German voters are skeptical about helping Greece, but the conservative Christian Democratic Union party is the most popular political force in the country. France and Italy criticize Germany but are too weak to challenge its leadership in Europe. Germany is concerned about recent events in the Continent, but its economic stability is not currently under threat. It would take a severe economic downturn for Germany to make a drastic decision such as leaving the currency union or promoting measures that could destabilize large countries such as France or Italy.\nUltimately, Berlin is far from the breaking point, but the Greek crisis has put it a bit closer to it. Moreover, it's summer in Europe, and most parliaments are closed, which means that leaders on both sides of the Rhine have more room to make bold proposals about the future of the Continent. Schaeuble's alleged suggestion to withdraw powers from the commission was probably a political message to Juncker.\nGermany and France will hold general elections in 2017, reducing the chance of a drastic change of direction for the European Union. Consequently, neither Germany nor France will see its current proposals materialize in the short term. The European Union will not enhance its enforcement powers or create a transfer union unless member states believe they will get something in return. The European Union is not a federation, but an agreement between nation states, which means continental integration can continue only if all the countries involved think they can benefit from it. With no benefits from further integration in sight, the preservation of the status quo is the most EU members can hope for.\nStratfor ,", "external_links": [], "published": "2015-07-31T19:47:00.000+03:00", "crawled": "2015-07-31T23:42:32.144+03:00", "highlightTitle": ""}