{"organizations": [], "uuid": "12cdbcf17a6c652717bbbdb94a2985cf880cbcdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-13/china-etf-switches-its-strategy-after-stock-trading-halts", "country": "US", "title": "China ETF Switches Its Strategy After Stock Trading Halts", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "China ETF Switches Its Strategy After Stock Trading Halts - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T06:23:00.000+03:00", "replies_count": 0, "uuid": "12cdbcf17a6c652717bbbdb94a2985cf880cbcdf"}, "author": "Miles Weiss", "url": "http://www.bloomberg.com/news/articles/2015-07-13/china-etf-switches-its-strategy-after-stock-trading-halts", "ord_in_thread": 0, "title": "China ETF Switches Its Strategy After Stock Trading Halts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China’s use of trading restrictions amid its worst market rout in more than two decades has prompted a rare strategic change at one of three U.S. exchange-traded funds with access to the Shanghai and Shenzhen stock markets.\nKrane Funds Advisors’ exchange-traded fund based on the MSCI China A International Index will temporarily switch from owning all of the stocks in the benchmark to holding a “representative sampling,” the firm notified U.S. regulators on July 10. Equity ETFs typically seek to fully replicate their benchmarks, according to Todd Rosenbluth, director of mutual fund and ETF research at S&P Capital IQ in New York, who added that sampling is more often used by fixed-income ETFs that would otherwise have to track down thousands of bonds comprising their indexes.\nThe Chinese government and local exchanges have allowed more than 1,400 companies to halt trading in their shares, one of several unprecedented moves designed to reverse crashing markets. While these steps helped the markets recover, they have also revealed the potential pitfalls for foreigners that dabble in Chinese A shares, the designation for those denominated in yuan and issued by locally incorporated companies.\n“The past month has been enlightening for investors and providers about how illiquid the Chinese A share market still is,” Rosenbluth said. Foreigners can only invest in the A share market through specially designated institutions.\nThe largest U.S. ETF devoted to Chinese A shares, a $769 million fund run by Deutsche Asset & Wealth Management’s X-trackers platform and Hong Kong-based Harvest Global Investments Ltd., will continue to use a full replication strategy, said Luke Oliver, head of capital markets at the passive business of Deutsche Asset & Wealth Management, a unit of Deutsche Bank AG.\n‘Fully Replicate’ “We seek to fully replicate the index at all times where possible” said Oliver, whose firm runs the Deutsche X-trackers Harvest CSI 300 China A-Shares ETF. “That said, it is often necessary to trade around” halts and limits on Chinese stocks.\nThe KraneShares Bosera MSCI China A Share ETF, which has about $20 million in assets, “does not currently expect to continue to replicate” the MSCI benchmark, according to last week’s notice filed with the U.S. Securities and Exchange Commission. Instead, the fund will use a sampling strategy that gives its co-adviser, Bosera Asset Management (International) of Shenzhen, the flexibility to select members of the index “that are not subject to trading halts and are relatively liquid.”\nThe change will help ensure that the ETF can accurately track the performance of its benchmark, said Brendan Ahern, chief investment officer at New York-based Krane. The fund generated a 15 percent return this year through July 10 including dividends, compared with 18 percent for the MSCI index, according to data compiled by Bloomberg.\nSmall Stocks China has mostly been halting smaller stocks that investors purchased through unauthorized margin loans from non-financial firms, Ahern said. While the suspensions covered more than a third of the 3,000 stocks that trade domestically after restrictions were lifted on some securities, their combined market capitalization equaled only about 23 percent of the value of companies on the Shenzhen and Shanghai exchanges.\n“We are seeing the number of halts come down because they are going in and deleveraging these margin accounts,” Ahern said in a telephone interview, adding that the ETF will return to a full replication strategy once all of the stocks it tracks are trading again. “You are seeing all these stocks come back online very quickly.”", "external_links": ["http://www.sec.gov/Archives/edgar/data/1547576/000114420415042048/v415325_497.htm\\"], "published": "2015-07-14T06:23:00.000+03:00", "crawled": "2015-07-14T02:14:06.000+03:00", "highlightTitle": ""}