{"organizations": [], "uuid": "7eaf9d6b9c20fa51758e7b68d8d3b96f51f69d12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/07/shark_tank.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/one-shark-tank-deal-turned-lani-lazzari-millionaire-before-college/", "country": "US", "title": "How One ‘Shark Tank’ Deal Turned Lani Lazzari Into a Millionaire Before College", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "How One ‘Shark Tank’ Deal Turned Lani Lazzari Into a Millionaire Before College", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T12:00:00.000+03:00", "replies_count": 0, "uuid": "7eaf9d6b9c20fa51758e7b68d8d3b96f51f69d12"}, "author": "Laura Woods", "url": "http://www.gobankingrates.com/personal-finance/one-shark-tank-deal-turned-lani-lazzari-millionaire-before-college/", "ord_in_thread": 0, "title": "How One ‘Shark Tank’ Deal Turned Lani Lazzari Into a Millionaire Before College", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Laura Woods July 26, 2015 \nMany entrepreneurs with multiple college degrees under their belts spend years trying to start a successful company. But 20-something “ Shark Tank ” star Lani Lazzari has already mastered it. \nIn 2013, a then 19-year-old Lazzari appeared on Season 4 of the hit ABC show to pitch her company, Simple Sugars, to the sharks and walked away with $100,000 from billionaire Mark Cuban — in exchange for a 33 percent stake. ‘Shark Tank’ Catapults Lani Lazzari’s Simple Sugars to Success \nApproximately 10 million people tune in to watch “Shark Tank” each week, reports the Financial Post. The show serves as a platform most business owners can only dream of to promote their company. \nLazzari graduated high school and was accepted into George Washington University. But, she delayed her college plans to focus on growing Simple Sugars, reports the Pittsburgh Post-Gazette. \nPrior to her appearance on the show, “Shark Tank” producers estimated Simple Sugars would have $20,000 more in sales the night the show aired, reports NextPittsburgh.com. The company far surpassed expectations by meeting that mark before the end of Lazzari’s pitch, reaching $600,000 by the following weekend and amassing a total of $1 million in sales six weeks later. \nBy late 2014, the company had reached more than $3 million in sales, reports Business Insider . In 2015, Simple Sugars is expected to rake in an additional $4 million in sales, according to Inc. \nIn June 2013, Cuban appeared on “Live with Kelly and Michael” and said his deal with Simple Sugars is one of the best he’s made on “Shark Tank,” reports TribLive.com. “We expected she might get 500 to 1,000 orders,” he said. “Her business is killing it. This girl is so smart.” \nLazzari returned to “Shark Tank” during its sixth season to give viewers an update on the success of Simple Sugars. The show spotlighted a deal she had recently made with Destination Maternity to carry her products in each of the retailer’s 575 locations in the U.S. \nCuban also appeared on the update, sharing his praise for Lazzari. “I invested in Lani because I want to see that $100,000 turn into $20 million,” he said. “The best part is there’s a shot that that could happen. She’s that good.” \nRelated: 13 Million-Dollar Businesses That Turned Down ‘Shark Tank’ Deals Simple Sugars Celebrates 10 Years \nSimple Sugars has grown into brand with a team of 22 employees. The products are sold internationally online and in more than 700 retail locations. While the company has catapulted to success since Lazzari’s appearance on “Shark Tank,” she actually founded it in 2005 when she was 11 years old. \nLazzari’s mother insisted that the family have a homemade Christmas, encouraging her children to hand make all of the holiday gifts they gave out. Lazzari was inspired to develop an all-natural skincare product that would be safe for very sensitive skin, as she was unable to use commercial products without suffering skin irritation or a rash. After conducting a great deal of research, she created her own formulation — which was an instant hit among her family and friends. \nShe founded Simple Sugars and continued to create the product in her family’s home — first in the kitchen and eventually moving production to the basement, reports WTAE.com. When Lazzari was a junior in high school, she persuaded school administrators to start an independent work study program that allowed her to attend class via Skype so she could focus more time on her company. \nIn 2012, when she was asked to pitch to “Shark Tank,” the company was in need of capital to expand. She was 18, and her mother had officially transferred ownership of Simple Sugars to her. Unfortunately, she was having trouble securing funding, as banks were hesitant to lend money to someone her age with no credit history, Lazzari’s mother told NextPittsburgh.com. \nLazzari partially credits her good fortune to “Shark Tank” but also notes that her company wouldn’t be thriving today if her team couldn’t handle scale and continue to sustain the momentum. She cited her ability to create a good product for an undeserved market and building a company culture that focuses on employee satisfaction as her secret to success. \n“Shark Tank” Season 7 premieres on Friday, Sept. 25, with special guest star Ashton Kutcher.", "external_links": [], "published": "2015-07-26T12:00:00.000+03:00", "crawled": "2015-07-26T17:23:31.466+03:00", "highlightTitle": ""}