{"organizations": [], "uuid": "c6eae9830251c20dcefb0db262c6acd840a0a55d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/c/k/x/h/image.related.afrArticleLead.620x365.gid0zk.png/1436943955326.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/equity-markets/relief-rally-continues-as-asx-passes-5600-points-20150715-gid0zk", "country": "AU", "title": "Relief rally continues as ASX passes 5600 points", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Relief rally continues as ASX passes 5600 points | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T14:57:00.000+03:00", "replies_count": 0, "uuid": "c6eae9830251c20dcefb0db262c6acd840a0a55d"}, "author": "Rose Powell", "url": "http://www.afr.com/markets/equity-markets/relief-rally-continues-as-asx-passes-5600-points-20150715-gid0zk", "ord_in_thread": 0, "title": "Relief rally continues as ASX passes 5600 points", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The ASX200 and All Ordinaries passed 5600 points as the post-Greece relief rally continued. Peter Braig Share on twitter Share on Google Plus by Rose Powell The big banks and supermarket chains led the Australian equity market up and over 5600 points in a relief rally spurred by an easing in the Greek debt and Chinese equities crises.\nDespite the release of underwhelming consumer confidence numbers that saw a widely observed index drop a further 3.2 per cent, closing in on levels last seen in the global financial crisis, the stock market finished with all sectors finishing up.\nThe biggest gain was by the energy sector which ended up 2.5 per cent, while the smallest gains were made by information technology companies, up by just 0.3 per cent.\nThe benchmark S&P/ASX 200 closed up 1.05 per cent or 58.8 points to 5636, while the All Ordinaries finished up 1.03 per cent to 5619.\nThe relief rally was led by the big banks , which all lifted on Wednesday. The Commonwealth Bank closed up 1.01 per cent up to $87.12; ANZ Banking Group was up 0.68 per cent to $32.42; the National Australia Bank rose 0.93 per cent to $33.78 while Westpac finished at $34, up by 1.16 per cent.\nThe supermarkets chains were the other big leaders of the rally, with Wesfarmers closing 2.54 per cent up at $41.58 and Woolworths at $28.30, up by 2.09 per cent.\nThe Australian Stock Report's head of research, Chris Conway, attributed the gains to the positive momentum generated as the Greece and China induced volatility calmed.\n\"These factors have lit a fire under the bulls and given them the green light to move back into the market, albeit cautiously.\" Mr Conway said.\n \"It's certainly a refreshing change from what we saw last week and hopefully the technical break higher on the ASX200 above 5610 adds further fuel to the fire.\"\nThe ASX's climb was buoyed by the release of Chinese second-quarter GDP figures , which came in slightly above expectations at 7 per cent. Industrial production and retail sales numbers were also better than predicted.\nRBS chief China economist Ouis Kuijs said Chinese growth was finally responding to ongoing government stimulus.\n\"Looking at the industrial production number for June, it seems that this pick-up is a bit faster than most people, including me, had expected. The higher frequency data suggests that indeed. we can start to talk about growth seeming to have bottomed out,\" Mr Kuijs said\nUBS equity strategist David Cassidy said the impact of the recent dramatic correction in Chinese equities would be short-lived.\n\"I don't think much of what we saw in the last weeks was about the economy so much as a bit of a bubble sorting itself out,\" Mr Cassidy said adding the only possible, and minimal, impact would be on sentiment around commodities.\nRio Tinto closed at $53.12 on, up by just 0.09 per cent. BHP Billiton closed 0.74 per cent down to $26.90, after the miner flagged another write-down of its US shale assets, while Fortescue Metals Group closed down by 0.84 per cent to $1.77.\nThe biggest losses of the day were funds management giant Perpetual, electrical manufacturer Breville Group as well as Seven Group Holdings.\nPerpetual lost 6.58 per cent after announcing a $1.6 billion decline in just three months. The funds manager closed at $45.60.\nThe biggest gain of the day was in Bradken, which has lost 79 per cent of its value since in the last year. On Wednesday, the share climbed 16.82 per cent to $1.25 after the embattled mining services confirmed its full-year earnings would be in line with last month's guidance.", "external_links": ["http://www.smh.com.au/business/markets-live/markets-live-bulls-take-over-20150715-gicgsf", "https://plus.google.com/110623698861133556711", "https://twitter.com/rosepowell"], "published": "2015-07-15T14:57:00.000+03:00", "crawled": "2015-07-15T16:04:33.000+03:00", "highlightTitle": ""}