{"organizations": [], "uuid": "dd74ddde43d0761c22dd243bc41af35cf81ba253", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507061764.html", "country": "US", "title": "South Africa: SA's R600 Million Train Blunder", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: SA's R600 Million Train Blunder", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T14:13:00.000+03:00", "replies_count": 0, "uuid": "dd74ddde43d0761c22dd243bc41af35cf81ba253"}, "author": "", "url": "http://allafrica.com/stories/201507061764.html", "ord_in_thread": 0, "title": "South Africa: SA's R600 Million Train Blunder", "locations": ["South Africa", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Mugabe Expected to Announce New Cabinet \nSenior railways engineers and sources with firsthand knowledge of the issue told Rapport Prasa had been warned that the new diesel locomotives it ordered from Spanish manufacturer Vossloh España are too tall for local use. \nThe locomotives exceed the height restrictions for diesel locomotives on the long distance lines Prasa intended using them on. \nR3.5bn order \nThe thirteen Afro 4000 diesel locomotives that have so far been delivered to Prasa are worth R600 million and form part of a larger R3.5 billion order for 70 new locomotives. \nThe locomotives have a roof height of 4 264mm while the maximum height for diesel locomotives may not exceed 3 965mm, senior rail engineers with firsthand knowledge of the saga told Rapport. \nPrasa intended using the locomotives for its long distance Shosholoza Meyl passenger service. \nThe locomotives were revealed to the media at an event in Cape Town in January, where Prasa and transport minister Dipuo Peters stated the locomotives would undergo three months' testing before entering operations in April. \n\"Prasa was warned the locomotives were too high even before they started arriving in the country. They carried on with the contract despite our warnings,\" said a senior Transnet engineer. \nAnother Transnet engineer said Transnet initially didn't want Prasa to move the locomotives even on the short track distance between the Cape Town docks and the nearby Salt River train depot. \nThe engineers say the locomotives could damage the overhead electrical cables on the country's rail lines. \nTender regulations flouted \nThe auditor general last year announced Prasa had flouted its own tender regulations when it awarded the contract to Swifambo Rail Leasing. \nThe South African Institute of Electrical Engineers (SAIEE) confirmed it was aware of the height issue and that it was working on finding \"technical solutions\". \nTransnet and Prasa \"engage on a frequent basis on any matter that affects us in whatsoever way through the designated channels and forums established between the two companies,\" said Transnet Freight Rail spokesperson Sandile Simelane. \n\"Transnet Freight Rail is therefore not at liberty to engage Prasa through the media,\" he added. \nMoffet Mofokeng, Prasa's spokesperson, did not respond to the newspaper's queries beyond stating in an e-mail that \"you are at liberty to write what you want\". \nSource: Netwerk24", "external_links": [], "published": "2015-07-06T14:13:00.000+03:00", "crawled": "2015-07-06T17:52:48.000+03:00", "highlightTitle": ""}