{"organizations": [], "uuid": "9783af8f1ea31ea4dfeddc93b28e79f9bca7646a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507200752.html", "country": "US", "title": "Kenya: Turning Kenya Into a 24-Hour Economy Will Boost Development", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Turning Kenya Into a 24-Hour Economy Will Boost Development", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T12:02:00.000+03:00", "replies_count": 0, "uuid": "9783af8f1ea31ea4dfeddc93b28e79f9bca7646a"}, "author": "", "url": "http://allafrica.com/stories/201507200752.html", "ord_in_thread": 0, "title": "Kenya: Turning Kenya Into a 24-Hour Economy Will Boost Development", "locations": ["Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya: Street Kids Swoop Ahead of Obama Tour \nWhat this has done is that other businesses close to the supermarkets have also now embraced the 24-hour economy concept. It is now even more encouraging that the government is going out of its way to ensure that, in line with Vision 2030, Nairobi turns into the region's premier 24-hour economic hub. \nThe benefits of a 24-hour economy are enormous and cannot be wished away for a country like Kenya that is on the path of attaining middle-income status. \nA 24-hour economy does not only help us deal with congestion witnessed during the day, but also helps in job creation. We know that jobs are one of our key needs in the country, and this concept can help us deal with it as more manpower is needed to handle the long hours. \nWe know the greatest economic growth is driven by an increase in productivity, and a 24-hour economy ensures that more is produced thus reducing the cost of production. A fully operative 24-hour economy will enable us to increase productivity by allowing us to do more with the available space, manpower and technology. \nA 24-hour economy will also ensure growth of other amenities that are needed for its success such as water, electricity and transport infrastructure. \nPresident Uhuru Kenyatta's commitment to ensuring that Kenya and Kenyans grow economically is in no doubt. The President has personally been supervising the lighting up of Nairobi and installation of surveillance as part of the plan to encourage the 24-hour economy. \nA few months back, the President led the Cabinet in endorsing a work-plan to ensure Nairobi is well lit and has a conducive environment for late-night business. The President asked the National Treasury to allocate Sh953 million for lighting up Nairobi through Kenya Power. \nAs a result, close to 15,000 new lanterns, public lighting masts and floodlights have been installed in Nairobi, and the city looks brighter and cleaner. \nWe know that 4,255 lights had been installed in Nairobi CBD and the environs by last month. Of these, 1,954 lanterns have been improved in the city centre, Ngara and Murang'a Road. In Westlands, which has been one of the hubs of Nairobi nightlife, 332 lights have been installed. Information released by government shows that in other parts of Nairobi, 2,472 improved lanterns will be installed by August 30. \nWhat we are witnessing is a transformation of the capital that will make it easier to do business at night. Already, Nairobi is listed as one of the cities with the most vibrant nightlife in Africa - meaning that this can be extended to the other areas of the economy. \nWe are ranked third among the world-fastest growing economies, and a 24-hour concept helps us even grow faster. Not everything must be done during the day. We can leave some issues and do them at night, and at the same time ease congestion that chokes city streets during the day. \nThe government is doing a lot in ensuring that the cost of doing business comes down as well as putting in place an enabling environment. This is commendable and we must support the government's efforts by embracing these emerging concepts. \nOne of the issues that has stalled turning Kenya into a 24-hour economy has been the cost of energy. It is commendable the Jubilee administration is working hard not only to increase connectivity but to also make energy affordable especially for large consumers such as industries. \nReducing the cost of energy for manufacturers and industries will help bring the cost of living down as well as helping reduce over-reliance on imports. This will also increase the number of exports from the country and as a result increase foreign earnings. \nTowards this end, President Uhuru Kenyatta, last week, launched Kenya's single biggest energy investment in Marsabit county. The Sh72 billion Lake Turkana Wind Power project will boost Kenya's capacity by nearly 20 per cent, and add 310MW (310,000 kilowatts) of clean energy to the national grid, the company behind the venture has said. \nThe wind farm is the single largest private sector investment on 40,000 acres (162sq km) in Loyangalani, and with 365 turbines. It is also the biggest turbine order ever done in the world, and the biggest wind power project in Africa. \nThe Loyangalani project is very significant for Kenya, and with its huge transmission infrastructure likely to be used to connect future projects to the grid. It is an example of large-scale and privately funded infrastructural projects that are possible in Kenya, and will attract similar ventures to the country. \nThe writer is a political and communications consultant. Kenya \nThe government has confirmed that US President Barack Obama will make a speech at the Kasarani Safaricom Stadium next … see more » Copyright © 2015 The Star. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-20T12:02:00.000+03:00", "crawled": "2015-07-20T12:59:40.196+03:00", "highlightTitle": ""}