{"organizations": [], "uuid": "7183378c9500a775f69c19084aadb45fc32938eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/d/v/y/s/image.related.afrArticleLead.620x365.giddr9.png/1437289312540.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/technology/apps/education/uts-data-arena-turns-information-into-a-wondrous-visual-display-20150719-giddr9", "country": "AU", "title": "UTS data arena turns information into a wondrous visual display", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "UTS data arena turns information into a wondrous visual display | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T21:34:00.000+03:00", "replies_count": 0, "uuid": "7183378c9500a775f69c19084aadb45fc32938eb"}, "author": "Tim Dodd", "url": "http://www.afr.com/technology/apps/education/uts-data-arena-turns-information-into-a-wondrous-visual-display-20150719-giddr9", "ord_in_thread": 0, "title": "UTS data arena turns information into a wondrous visual display", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Glenn Wightwick, left, and Ben Simons are harnessing the human brain's extraordinary ability to analyse visual patterns. Daniel Munoz by Tim Dodd How do researchers sift through massive banks of data and find the patterns, or the anomalies, that reveal the information which has significance?\nThis week, the University of Technology, Sydney (UTS) will reveal a new tool to do just that – a 360-degree arena, which surrounds viewers with data in visual form.\nThe data arena, as it is called, is a darkened circular room, in which six projectors – all linked to a large computer optimised for graphics – create a seamless display on the walls.\nTechnical director Ben Simons first shows off its capability with some show-stopper movies showing beaches and landscapes; it's like watching a 360-degree Imax movie.\nBut the facility's real importance is in analysing large quantities of information, enabling researchers to find curious things that don't advertise their presence when hidden in a vast data bank.\n\"It has the ability to leverage the power of the [human] visual system and to see anomalies and discover patterns,\" UTS deputy vice chancellor (research) Glenn Wightwick said.\n\"If you a thinking about looking at millions of rows of data in a spreadsheet; you just can't do that. But we are able to pump that into the data arena and suddenly out of that comes an insight into a particular pattern, a particular anomaly or errors in the data.\"\nI saw an example of that when Mr Simons projected on the arena a physical depiction of millions of stars – data collected by an orbiting telescope, which was being processed by Australian researchers. What hadn't been obvious in a scan of the raw data is that it was corrupted by many duplications. But when it was in the data arena, this quickly became clear.\n Way to learn unknown unknowns With a wry reference to former US defence secretary, Donald Rumsfeld, Professor Wightwick said the data arena was a way of learning the things that you didn't know you didn't know.\nWhile it is true that these \"unknown unknowns\" in the data could be detected by a computer algorithm, researchers might not think to write the code to look for that particular pattern. Instead, the data arena attempts to shortcut the the process by utilising the human brain's extraordinary ability to analyse visual patterns.\nProfessor Wightwick said while the facility was very valuable to scientific researchers, it had applications to any field in which large amounts of data were collected.\n\"I've been talking to financial institutions, to consulting companies, to infrastructure companies, to utilities, to retailers – in fact I can't think of a single industry or organisation when, having brought them in here, they haven't gone, 'Oh my god I could use this'.\"\nThe data arena was created by bringing together visual effects software – working with well-known local film animation company Animal Logic – and high-performance, parallel rendering computer programs. \"We're building a bridge between the two,\" Mr Simons said.\n\"Because it's open source we can package it up into a virtual machine and others can use it on their desktops or in their own environment,\" Professor Wightwick said.\n\"This is the peak facility because of its high visualisation. But you can imagine someone saying 'I want to deploy this in my lab or in my organisation' and take that same software into their own environment.\"", "external_links": [], "published": "2015-07-18T21:34:00.000+03:00", "crawled": "2015-07-19T11:57:31.401+03:00", "highlightTitle": ""}