{"organizations": ["LifePoint Health"], "uuid": "4b5ac3f9052bf720d33702a760f4e6cbfdf7a3f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=LPNT", "section_title": "Yahoo! Finance: LPNT News", "url": "http://finance.yahoo.com/news/crowd-lifepoint-health-lpnt-stock-125812163.html", "country": "GB", "title": "Is the Crowd Right About LifePoint Health (LPNT) Stock? - Tale of the Tape", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is the Crowd Right About LifePoint Health (LPNT) Stock? - Tale of the Tape", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T15:58:00.000+03:00", "replies_count": 0, "uuid": "4b5ac3f9052bf720d33702a760f4e6cbfdf7a3f2"}, "author": "", "url": "http://finance.yahoo.com/news/crowd-lifepoint-health-lpnt-stock-125812163.html", "ord_in_thread": 0, "title": "Is the Crowd Right About LifePoint Health (LPNT) Stock? - Tale of the Tape", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Content preferences Done \nIf you are looking for a stock in the Med-Hospitals sector, LifePoint Health Inc (LPNT) could be one to watch closely. Right now the company has a Zacks Rank #2 (Buy) and it has been seeing rising earnings estimate revisions as of late. \nIn fact, the full year consensus estimate has risen from $4.01/share to $4.02/share in the past 30 days, while one estimate has gone higher for the time frame and zero have gone lower. If that wasn’t enough, LPNT also has Style Score grades of ‘A’ on both the value and growth fronts so it could be worth considering from that perspective too. \nBut what is the Crowd saying about this stock? \nMany times, broad investor perception of a security can have a large bearing on a stock’s outlook. And thanks to social media sites like Twitter, we now have an easy way to see what the masses are thinking about stocks and how they might perform in the future. \nAccording to MarketProphit.com, a financial Big Data social media analytics company, the moving average of the Crowd Sentiment Z-Score for LPNT is 0.32, which shows social media momentum trending upward for this stock. \nGenerally speaking, moving averages of Crowd Sentiment Z-Scores with values above 0.2 is significant, so the rating for LPNT today is indicative of broad positive Crowd opinion towards this stock in the near term. And when you add in the positive earnings estimate revisions to this story it definitely suggests that LifePoint Health is a stock to put on your radar right now. \nAnd for more data and insights on trending sentiment and buzz in social media for stocks you care about, make sure to check out marketprophit.com and their Z-Score system. \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report", "external_links": [], "published": "2015-07-13T15:58:00.000+03:00", "crawled": "2015-07-13T19:28:19.000+03:00", "highlightTitle": ""}