{"organizations": [], "uuid": "0738d0789331e37a45809de07cdba706cec7bc72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/06/humana-ma-aetna-idUSL1N0ZM1GU20150706", "country": "US", "title": "UPDATE 3-Aetna CEO addresses antitrust concerns over Humana deal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 3-Aetna CEO addresses antitrust concerns over Humana deal | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T02:31:00.000+03:00", "replies_count": 0, "uuid": "0738d0789331e37a45809de07cdba706cec7bc72"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/06/humana-ma-aetna-idUSL1N0ZM1GU20150706", "ord_in_thread": 0, "title": "UPDATE 3-Aetna CEO addresses antitrust concerns over Humana deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comments from Massachusetts attorney general, American Hospital Association)\nBy Caroline Humer\nNEW YORK, July 6 (Reuters) - Aetna Inc's chief executive said Monday he was confident any antitrust review of the health insurer's proposed purchase of smaller rival Humana Inc would allow the deal to close in the second half of 2016.\nMark Bertolini said Aetna had already prepared for possible divestitures to address overlaps with Humana's business in the largest-ever U.S. health insurance deal. The two sides announced the $37 billion transaction on Friday. Hospital and state officials said they would take a hard look at whether the deal would diminish competition for consumers.\n\"We took a conservative view of what we would need to divest,\" Bertolini said during an investor conference call.\nAetna has not discussed the deal directly with the U.S. Department of Justice, but has consulted with regulatory experts, Bertolini told cable channel CNBC.\n\"We believe that given the legal advice we have...that this is a very manageable transaction,\" he said.\nThe bigger the insurer, the more power it has negotiating prices with hospitals and other providers, as well as improving its doctor networks.\nAetna and Humana are in nine of the same states in one of their key businesses - Medicare Advantage plans for the elderly. Combined, they would have market share of 88 percent in Kansas, 80 percent in West Virginia, 58 percent in Iowa and 51 percent in Missouri.\nRegulators would also look for the impact on competition in each local market for the companies' Medicaid plans for the poor, individual insurance, commercial insurance for small and large businesses and the large employer business.\nAttorneys general in several U.S. states said on Monday they would be ready to review the proposed deal.\n\"Our office is aware of these mergers, and we will be looking to determine whether or not there's any significant impact on Massachusetts,\" said Chloe Gotsis, a spokeswoman for the state AG's office.\nHealthcare providers are concerned that further consolidation will decrease competition in the insurance industry, said Alicia Mitchell, spokeswoman for the American Hospital Association.\n\"Any potential deal of this magnitude needs rigorous scrutiny. That's why the AHA will call upon the DOJ and Congress to exercise a significant level of scrutiny,\" Mitchell said in an emailed statement.\nHealth insurers have been in a race to consolidate, saying that being larger would help them negotiate better prices with doctors and hospitals as well as cut administrative costs.\nNo. 2 health insurer Anthem Inc has offered to buy No. 5 Cigna Corp. The two companies have revived discussions in light of the Humana-Aetna deal, though it is not clear whether they can agree on terms including price and governance issues, sources familiar with the matter have told Reuters.\nIf an Anthem-Cigna deal is announced within the next two to three months, regulators could look at the impact of both mergers at the same time, Bertolini said.\n\"It really depends on whether or not any other deals are announced,\" he told investors. \"Currently we anticipate that our transaction will be viewed alone at this point in time, but they could be bundled together at some point.\"\nAetna shares fell 6.4 percent to $117.43 on Monday as investors took stock of the regulatory and financial risks of the deal. Humana also lowered its 2015 financial forecasts, citing higher than expected expenses in its Medicare business.\nHumana shares closed up 0.8 percent at $188.96, well below the value of Aetna's proposed cash and stock offer of $223, based on the most recent share prices. (Reporting by Caroline Humer in New York; Additional reporting by Greg Roumeliotis, Susan Kelly and Karen Freifeld; Editing by Bernadette Baum and Christian Plumb )", "external_links": [], "published": "2015-07-07T02:31:00.000+03:00", "crawled": "2015-07-07T01:53:41.000+03:00", "highlightTitle": ""}