{"organizations": [], "uuid": "6d713e8a5c4daab14a5e13e01288f6bf9bd3cf00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/fdcd4c04-4d62-4169-a4df-cb399e6a7cf9.img", "site_section": "http://www.ft.com/rss/world/americas/finance", "section_title": "Latin America & Caribbean Finance News - FT.com", "url": "http://www.ft.com/cms/s/0/50ddb0fc-30c1-11e5-8873-775ba7c2ea3d.html?ftcamp=published_links%2Frss%2Fworld_americas_finance%2Ffeed%2F%2Fproduct", "country": "US", "title": "Cut to Brazil budget target hits markets", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Cut to Brazil budget target hits markets", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T01:59:00.000+03:00", "replies_count": 0, "uuid": "6d713e8a5c4daab14a5e13e01288f6bf9bd3cf00"}, "author": "", "url": "http://www.ft.com/cms/s/0/50ddb0fc-30c1-11e5-8873-775ba7c2ea3d.html?ftcamp=published_links%2Frss%2Fworld_americas_finance%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Cut to Brazil budget target hits markets", "locations": ["Brazil"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 22, 2015 11:59 pm Cut to Brazil budget target hits markets \nJoe Leahy in São Paulo More Brazil outlines $65bn infrastructure package \nBrazil has slashed its estimates for balancing its budget this year, sending markets lower amid fears the move could place its prized investment grade rating at risk. \nThe country’s economic team announced on Wednesday night that it was reducing its 2015 target for the primary fiscal surplus, the budget balance before interest payments, from 1.2 per cent of gross domestic product to just 0.15 per cent. \n“Tax revenue is lower than what was expected,” said Nelson Barbosa, planning minister, blaming the country’s deepening recession. \n“It’s a more realistic target but it’s clear evidence that the adjustment is progressing very, very slowly,” said Alberto Ramos, economist with Goldman Sachs. \nBrazil’s currency, the real, weakened 1.61 per cent against the dollar to R$3.22 while the benchmark stock index, the Ibovespa, fell 1.08 per cent ahead of the announcement. \nThe reduction in the target for the primary fiscal surplus, considered the main gauge of the health of public finances in Latin America’s largest economy, was forced by a rapid weakening of the economy. \nThe government originally expected the economy to grow 0.8 per cent this year but on Wednesday revised this to a decline of 1.49 per cent. \nBrazil’s economy is suffering a hangover from the end of the commodities boom and a prolonged period of fiscal stimulus. This has generated a toxic mix of sluggish growth and persistent inflation. Confidence has also been hit by a sweeping corruption scandal at state-owned oil company Petrobras . \nContinue reading \nPresident Dilma Rousseff won a second term in October by assuring voters that the economy was in good shape but upon victory immediately set about correcting imbalances, appointing a hawkish finance minister, Joaquim Levy, to restore public finances. \nAfter trying to control fuel and energy prices in her first term and stimulate the economy through massive state bank lending, she allowed prices to rise to market levels and reined in public credit. \nShe also allowed the central bank to begin hiking interest rates to control inflation, which in turn has suppressed business and consumer appetite for investment and borrowing. \nMr Levy said on Wednesday that in spite of the reduction in the primary surplus target the government remained committed to fiscal adjustment. He presented a chart showing the primary surplus increasing to 2 per cent by 2018, a level considered more compatible with stabilising the rise in gross public debt. We will work to beat these targets, I think we have a great chance of doing so \n- Joaquim Levy \n“We will work to beat these targets, I think we have a great chance of doing so,” he said. \nBut opposition leader Senator Aécio Neves said the climbdown on the budget targets showed the government’s inability to meet its promises “and correct the numerous and repeated errors in the conduct of economic policy in recent years”. Podcast \nDilma Rousseff’s precarious presidency \nThe Brazil president’s second term in office has had a shaky start, with a barrage of corruption allegations fuelling discontent over the country’s economic woes and even talk of impeachment. Fiona Symon asks Joe Leahy, FT Brazil bureau chief, how bad things look for Dilma Rousseff. \nOthers praised the revision as “realistic” and better than the government’s past practice of presenting overly optimistic estimates. \n“It’s preferable to conduct fiscal policy in a clear manner and in this way assure the credibility of the official numbers,” said André Guilherme Pereira Perfeito, economist with Gradual Investimentos. \nAs a result of the slumping economy, unemployment is expected to have hit 6.7 per cent in June compared with 4.8 per cent a year earlier, according to Goldman Sachs. \n“We expect the labour market to deteriorate further. Policy tightening, depressed consumer and business confidence, and tighter financial conditions are expected to lead to a higher unemployment rate in 2015 (forecasted to approach 7.5 per cent seasonally adjusted by year-end),” economist Alberto Ramos said in a report. Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-07-23T01:59:00.000+03:00", "crawled": "2015-07-23T17:06:25.954+03:00", "highlightTitle": ""}