{"organizations": [], "uuid": "2fac80018a75048eff390a528a1b6ac478cde8fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-29/europe-is-hot-spot-as-industrial-deals-are-applauded-real-m-a", "country": "US", "title": "Europe Is Hot Spot as Industrial Deals Are Applauded: Real M&A", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Europe Is Hot Spot as Industrial Deals Are Applauded: Real M&A - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T02:29:00.000+03:00", "replies_count": 0, "uuid": "2fac80018a75048eff390a528a1b6ac478cde8fe"}, "author": "Brooke Sutherland", "url": "http://www.bloomberg.com/news/articles/2015-07-29/europe-is-hot-spot-as-industrial-deals-are-applauded-real-m-a", "ord_in_thread": 0, "title": "Europe Is Hot Spot as Industrial Deals Are Applauded: Real M&A", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Those industrial giants that haven’t done a big deal might want to get moving.\nMost of the acquirers responsible for the top industrial takeovers this year have climbed since announcing their purchases, according to data compiled by Bloomberg. That includes Danaher Corp., Harris Corp. and FedEx Corp. In contrast, Emerson Electric Co., Eaton Corp. and Pentair Plc -- companies that are under pressure to find sizable acquisitions after sitting on the sidelines -- have slumped.\nAs cash piles up at many industrial companies, share repurchases and dividends just aren’t cutting it any more for investors. Instead, they want to see that money put to work on acquisitions that can boost middling revenue growth and better focus companies on their core businesses.\nThe world’s makers of everything from train brakes to beverage cans are on track for a record year of dealmaking, with $266 billion in purchases announced so far. American acquirers have spent nearly as much on Europe as they have at home, seeking to take advantage of the strong U.S. dollar and large amounts of cash stockpiled overseas.\nEurope Focus U.S. takeovers of European industrial companies are now at an annual high of $40 billion with about five months still left in the year. Honeywell International Inc. added to the activity this week, using its overseas cash to pay for the bulk of a planned purchase of London-based Melrose Industries Plc’s Elster meter business. That cash can’t be used for American acquisitions without incurring a big tax bill.\n“Industrials aren’t meant to be banks and where you see a lot of cash trapped outside of the U.S., it becomes a more powerful driver to utilize that in acquisitions,” said Joel Levington, an analyst at Bloomberg Intelligence.\nPossible future targets in Europe may include Stockholm-based Sandvik AB, a $13 billion company, or Germany’s Pfeiffer Vacuum Technology AG, at about $880 million.\nWhile many of Europe’s top industrial companies have gotten more expensive, they’re still a bargain relative to some U.S. takeover targets.\nHoneywell, for example, is paying about 13 times Elster’s projected 2015 earnings before interest, taxes, depreciation and amortization. That’s about half the 22 times trailing 12-months Ebitda that Danaher agreed to give Port Washington, New York-based Pall Corp.\nU.S. buyers have offered a median of 9 times Ebitda for European industrial targets of more than $1 billion in the last year. Their American peers received 11.6 times, according to data compiled by Bloomberg.\n“Deals may be better there than here,” said Chip Pettengill, principal and fund manager at Honeywell investor Bahl & Gaynor Investment Counsel Inc. “Europe is in a bit of a turnaround mode. They’ve been through the ringer and things seem to be getting better there, so the timing is pretty good.”\nNext Targets European companies also often have more room for margin improvement than their more cost-aggressive U.S. peers.\nMetalworking-tool maker Sandvik, bar-code reader manufacturer Datalogic SpA and Pfeiffer Vacuum Technology are among the European industrial companies that passed Bloomberg Intelligence’s screen for potential targets. Criteria included above-average gross margins and below-par operating margins -- signaling opportunity for cost cuts.\nOther Way Some industrial companies may be more focused on slimming down. ABB Ltd. could consider splitting in two after activist investor Cevian Capital AB built a stake in the power-grid maker.\nIncreasingly, though, big breakups go hand in hand with big takeovers for industrial manufacturers. United Technologies Corp. and Emerson have announced major divestitures this year, and both could turn their attention to acquisitions.\nGeneral Electric Co. jumped ahead of many manufacturers with its 2014 agreement to buy the energy business of France’s Alstom SA, a $17 billion deal that’s awaiting regulatory approval. Now it’s shedding the bulk of its financial businesses, and will reap billions to spend on future purchases.\nTargets for United Technologies could include Allegion Plc, Hubbell Inc. or even $15 billion Tyco International Plc. Companies including ITT Corp., Flowserve Corp. or Gardner Denver Inc. could appeal to Emerson. Flowserve, a $6.3 billion company, could also interest GE, as could Bio-Rad Laboratories Inc. or possibly Pentair.\nEaton Corp. is barred from spinning off any businesses in a tax-efficient manner for five years after its purchase of Cooper Industries Plc in 2012. In the meantime, it could take advantage of its Irish tax rate with more purchases.\nIn releasing its latest earnings results, Eaton said that from 2016 through 2020, about 38 percent of capital would be devoted to mergers and acquisitions.\nEaton would consider takeovers “if we see the right opportunities and if we see the right pricing to really create value,” Chief Executive Officer Sandy Cutler said on a conference call Wednesday.", "external_links": [], "published": "2015-07-30T02:29:00.000+03:00", "crawled": "2015-07-29T21:47:01.805+03:00", "highlightTitle": ""}