{"organizations": ["National Bank of Fujairah", "Al Etihad Credit Bureau", "Deutsche Bank", "Reuters", "Dubai World", "Abu Dhabi Islamic Bank"], "uuid": "56110a5e2f0bb7f6827e076f72e32e00c481e2b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/ui/img-logo-zawya.png", "site_section": "http://www.zawya.com/rss/default.cfm?rssid=23C341EC-8851-9E2C-C35A985480E8068B", "section_title": "Zawya.com - Islamic Finance Live News", "url": "http://www.zawya.com/story/Most_banks_using_UAE_credit_scoring_service-TR20150716nL8N0ZM3DQX2/", "country": "AE", "title": "Most banks using UAE credit scoring service", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Most banks using UAE credit scoring service", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T16:32:00.000+03:00", "replies_count": 0, "uuid": "56110a5e2f0bb7f6827e076f72e32e00c481e2b0"}, "author": "", "url": "http://www.zawya.com/story/Most_banks_using_UAE_credit_scoring_service-TR20150716nL8N0ZM3DQX2/", "ord_in_thread": 0, "title": "Most banks using UAE credit scoring service", "locations": ["United Arab Emirates", "UAE", "Saudi Arabia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marwan Lutfi", "Rahul Shah", "Tom Arnold DUBAI", "Vince Cook", "Tirad al-Mahmoud", "Lutfi", "Keith Weir", "Tom Arnold"], "text": "* Around 92 pct of banks using new credit bureau * Aims to control indebtedness of consumers, companies * Impact on lending still too early to assess By Tom Arnold DUBAI, July 16 ( Reuters ) - Almost all banks are now using data from the United Arab Emirates' new credit bureau, its CEO says, a development analysts believe should boost confidence in the banking system. It also helps to put the UAE on a par with most developed markets, which have long had fully-functioning credit bureaus, and to catch up with its larger Gulf neighbour Saudi Arabia which launched its own version in 2004. After years in the planning, the UAE launched Al Etihad Credit Bureau in November 2014, since when it has faced the inevitable teething problems. Some banks have accused others of dragging their heels in providing data, while others have complained about the bureau's refusal to accept liability for the information it provides. But CEO Marwan Lutfi told Reuters there were 51 active subscribers to the bureau's services, including the top 47 banks and finance companies, compared to about 30 in November. There are 51 banks operating in the UAE, according to central bank data. Lutfi said 56 institutions were providing data to the bureau, mainly financial firms, up from 42 in November. \"We are pretty much covered. The top banks in the UAE are all on board and 99 percent of the active retail lending market and more than 95 percent of the active company lending market is accounted for,\" he said in an interview. In a country with an estimated average debt load of $95,000 per household and recent debt woes at several large companies, the government sees the bureau as a safeguard against a repeat of the credit crisis that brought the economy to its knees and battered banks' balance sheets at the end of the last decade. FULLER PICTURE The bureau collates information on credit histories for consumers and companies dating back to October 2012. It aims to give lenders a window on each borrower's total exposure across the financial system and a better picture of whether they are likely to be able to manage their debt. For many years, consumers have been able to take out multiple credit cards or loans with several banks without the knowledge of other lenders. \"Increasing utilisation of the credit bureau should help banks to avoid the worst individual risks, which lends further support to our positive top down view,\" said Rahul Shah, research analyst at Deutsche Bank. In the three years before 2008, credit growth surged to the mid-30s percent, before plummeting once a property market crash, debt restructurings at Dubai World and other state-linked companies, and mass job losses prompted banks to set aside huge provisions to cover a rise in bad debt. Lutfi said it was still too early to say how much impact it will have on lending. Bank lending growth slowed to 8 percent year-on-year in May from 8.4 percent in April, the latest data shows. \"Some banks may be a little more exposed [to bad debt] and other less so, it will be a question of management,\" said Lutfi. Abu Dhabi Islamic Bank (ADIB) is already increasing the amount of money it sets aside to cover potential bad loans, said Tirad al-Mahmoud, the bank's chief executive. Other banks said they had not yet started to do the same as they were not able to form a picture of indebtedness in the financial system at this stage. Their visibility should improve later this year with the launch of a new system by the bureau that sends alerts to banks if a customer misses a payment with another institution. Traditionally, banks have used name lending, a process that allows only limited assessment of a company's ability to repay debts. The bureau is expected to usher in more differential pricing for corporate borrowers. \"Now the good guys can get the terms they deserve and the bad guys can be pushed on to someone else,\" said Vince Cook, chief executive of National Bank of Fujairah . (Reporting By Tom Arnold; Editing by Keith Weir) ((Tom.Arnold@thomsonreuters.com; +97144536265; Reuters Messaging: tom.arnold.thomsonreuters.com@reuters.net)) © Copyright Zawya. All Rights Reserved.", "external_links": [], "published": "2015-07-16T16:32:00.000+03:00", "crawled": "2015-07-16T21:50:29.000+03:00", "highlightTitle": ""}