{"organizations": [], "uuid": "94beca504cd60974f5904f8f28535f1838e6acec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/subrata-roys-release008072015.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/cant-pay-rs36000-crore-in-18-months-sahara-tells-sc/42702.html", "country": "IN", "title": "Can't pay Rs.36,000 crore in 18 months, Sahara tells SC", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Can't pay Rs.36,000 crore in 18 months, Sahara tells SC", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T08:56:00.000+03:00", "replies_count": 0, "uuid": "94beca504cd60974f5904f8f28535f1838e6acec"}, "author": "IANS", "url": "http://www.moneylife.in/article/cant-pay-rs36000-crore-in-18-months-sahara-tells-sc/42702.html", "ord_in_thread": 0, "title": "Can't pay Rs.36,000 crore in 18 months, Sahara tells SC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Can't pay Rs.36,000 crore in 18 months, Sahara tells SC 42702 Can't pay Rs.36,000 crore in 18 months, Sahara tells SC 0 Comments, Be the first to comment + COMMENT IANS | 08/07/2015 11:26 AM | The Sahara Group on Tuesday told the Supreme Court that it was not possible for it to repay, in 18 months, Rs.36,000 crore of investors' money that it had collected in 2007-08 in 18 months as was ordered by the court on June 17. \"There is no business house in the country or in the world which can deposit Rs.36,000 crore in 18 months time,\" senior counsel Kapil Sibal, appearing for jailed Sahara chief Subrata Roy, told a bench of Justice T.S.Thakur, Justice Anil R.Dave and Justice A.K.Sikri. He said that he was getting an application ready that would be moved in a week's time pointing to the difficulty in arranging Rs.36,000 crore to return the investors money. His admission came as Justice Thakur asked him that suppose Sahara was not able to repay the entire amount. At this, senior counsel Arvind Dattar, appearing for market regulator SEBI, told the court that Sahara had told in the past that it can and would return the investors money and it had the resources to do so. In response, Sibal said: \"If I have told the court that I can and I will pay but if I am not abler to (return) then I can be sent to jail.\" The apex court had June 19 given Sahara's two companies - SIRECL and SHFCL - 18 months to repay the investors' money which they had collected in 2007-08 through OFCDs. Subrata Roy and two directors of the Sahara group were sent to judicial custody for its failure to comply withy its August 31, 2012 and December 2012 order to return investors Rs.24,000 crore along with 15 percent interest. The total amount along with interest component now stands at Rs. 36,000 crore. Telling the court that they stood on a stronger wicket asd far as their claim that they have already paid a substantial amount of investors money, Sibal told the court that the Income Tax Appellate Tribunal has accepted that two Sahara companies have already returned money of the 85 percent of the investors. He said that thought its contention was not accepted by the Income Tax authorities but the same has found favour with the appellate tribunal. As the court asked him that he had submitted all the documents to SEBI and which were the documents he was referring to, Sibal said that these were PAN card numbers showing TDS. In the meanwhile, the court asked a Gorakhpur-based real estate developers to deposit a bank draft of Rs. 11 crores - 10 percent of Rs.110 crore that it has offered to pay for buying 54.71 acres of Sahara land in the eastern Uttar Pradesh town. The court said that the draft should be favouring secretary general, Supreme Court. This is nearly double of Rs.65 crore that Sahara has told the court it was getting for the same land from another developer. As Sahara objected to the offer saying that it would come in the way of the release of Subrata Roy from jail and it was about to get Rs.65 crore from the first buyer, the court asked the new buyer to deposit Rs.65 crore immediately and the remaining Rs.45 crore in three to four months. As counsel appearing for the new buyer wanted time to take instructions, the court gave him time till Monday with a rider that he would deposit a demand draft of Rs. 11 crores by Wednesday to establish his bonafide. More in Moneylife", "external_links": [], "published": "2015-07-08T08:56:00.000+03:00", "crawled": "2015-07-08T12:45:35.000+03:00", "highlightTitle": ""}