{"organizations": ["Fiat Chrysler"], "uuid": "6287aa9627abba7300d1920af5ed1764dd0b85ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static4.businessinsider.com/image/5593deac5afbd3c1678b456e/fiat-chrysler-seeks-to-rebut-criticism-ahead-of-us-safety-hearing.jpg", "site_section": "http://feedproxy.google.com/clusterstock?format=xml", "section_title": "Finance", "url": "http://www.businessinsider.com/magic-mike-is-a-feminist-movie-2015-7", "country": "IL", "title": "Fiat Chrysler seeks to rebut criticism ahead of U.S. safety hearing", "performance_score": 0, "site": "businessinsider.com", "participants_count": 0, "title_full": "Fiat Chrysler seeks to rebut criticism ahead of U.S. safety hearing", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T18:24:00.000+03:00", "replies_count": 0, "uuid": "2a310083cd62c4e5d93e9c810fe4023281d382f5"}, "author": "", "url": "http://www.businessinsider.com/r-fiat-chrysler-seeks-to-rebut-criticism-ahead-of-us-safety-hearing-2015-7", "ord_in_thread": 0, "title": "Fiat Chrysler seeks to rebut criticism ahead of U.S. safety hearing", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You have successfully emailed the post. Fiat Chrysler seeks to rebut criticism ahead of U.S. safety hearing Jul. 2, 2015, 11:24 AM 0 \nThomson Reuters A woman walks past a logo of Fiat Chrysler Automobiles (FCA) in Turin \nBy David Morgan \nWASHINGTON (Reuters) - Fiat Chrysler Automobiles NV went on offense ahead of a hearing before federal regulators to blunt criticism of its plan to install trailer hitches on 1.5 million Jeep Cherokee and Liberty SUVs to avert a more costly fix to reduce the risk that fuel tanks could rupture and catch fire in rear-end collisions. \nThursday's hearing, convened by the National Highway Traffic Safety Administration, is expected to highlight testimony from safety advocates and others who will argue that the trailer hitch fix is inadequate, and that regulators should order Fiat Chrysler to make more dramatic changes to the vehicles, which have fuel tanks positioned behind the rear axle, or buy them back. \nThe automaker issued a lengthy statement hours before the hearing, underscoring the role that regulators have played in testing the remedy and determining that it provides an incremental safety hitch for vehicles in low-to-moderate-speed collisions. FCA also said NHTSA found the Jeep sport utility vehicles have a safety performance similar to other makes in the most severe crashes. \nAt the all-day proceedings, which began in late morning, NHTSA was expected to try to find evidence that the automaker failed to fix defects in 22 recalls involving 11 million vehicles. FCA said the hearing was unnecessary. \nThe automaker could face more than $700 million in fines and be required to buy back or replace vehicles if regulators find that it failed in its legal obligations. Some of the recalls under scrutiny involve Jeep SUVs linked to more than 50 deaths, due to fuel tank fires that can occur in rear-end collisions. The recalls took place mainly over the past two years. \nThe recalls cover Jeep, Dodge, Chrysler and Mitsubishi vehicles from model years dating back to 1993. \nDays before the hearing, FCA took the unusual step of telling about 65 Grand Cherokee and Dodge Durango owners to stop driving their sport utility vehicles because of an improperly heated suspension component that can break, causing instability and reduced braking power. Another 7,690 vehicles were subject to the recall, including a handful in Canada. \nThe hearing also poses a test for NHTSA, which is taking a more aggressive stance on automakers under new administrator Mark Rosekind, who took office in January. The watchdog has been blasted by lawmakers and government auditors for long-running internal weaknesses that they say prevented the agency from moving quickly against deadly defects including faulty General Motors Co ignition switches. \nAhead of Thursday's hearing, NHTSA had tentatively concluded that Fiat Chrysler's U.S. unit, FCA US LLC, was responsible for a series of shortcomings including failure to adequately remedy defects, notify car owners and keep NHTSA in the loop about important developments. \nAmong the issues that have caught the eye of regulators are 1.5 million Jeep Liberty and Jeep Grand Cherokee SUVs recalled in June 2013 to reduce the risk of fire in rear-end collisions. By April 30, 2015, NHTSA said FCA had completed repairs on only 320,000 of the vehicles, or 21 percent. \nAs an example of what it said was FCA's failure to remedy vehicle defects in a reasonable time, NHTSA cited a series of three recalls from 2013, involving a million Dodge Ram trucks with potentially defective tie rods. The agency said FCA could not produce enough repair parts and that some of the replacement parts failed after repairs were made. \nThe biggest recall, announced last December, involves more than 2.9 million vehicles from 2004-2007 equipped with defective Takata Corp air bags that can rupture explosively in a collision and kill or injure occupants with flying metal shrapnel. That recall spans a dozen Chrysler, Dodge and Mitsubishi models including sedans, SUVs, wagons and pick-up trucks. \nNHTSA said FCA failed to notify car owners \"for over five months\" about the risk that air bag inflators could rupture. \n(Editing by Joe White and Matthew Lewis) Read the original article on Reuters . Copyright 2015. Follow Reuters on Twitter . More from Reuters:", "external_links": [], "published": "2015-07-02T18:24:00.000+03:00", "crawled": "2015-07-02T18:43:33.000+03:00", "highlightTitle": ""}