{"organizations": [], "uuid": "03f7a3fd1b8ae67f685adc779fa63dad1e69318a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20150701&t=2&i=1060694312&w=&fh=545px&fw=&ll=&pl=&r=LYNXNPEB6023F", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/01/us-money-travel-roadtrips-idUSKCN0PB51V20150701", "country": "US", "title": "Five ways road-tripping families can save money", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Five ways road-tripping families can save money | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T18:35:00.000+03:00", "replies_count": 0, "uuid": "03f7a3fd1b8ae67f685adc779fa63dad1e69318a"}, "author": "Chris Taylor", "url": "http://www.reuters.com/article/2015/07/01/us-money-travel-roadtrips-idUSKCN0PB51V20150701", "ord_in_thread": 0, "title": "Five ways road-tripping families can save money", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK With four kids between the ages of 1 and 12, Loralee Leavitt is a cost-savings ninja when she hits the road.\nLeavitt, who hails from Kirkland, Washington, estimates that she has gone on more than 30 road trips with her growing family, logging over 60,000 miles, to places like Utah, Colorado, Arizona and California.\nFrom packing their own food, to staying in state parks, to scouring for last-minute hotel deals, the family has made an art of saving money. Their piece de resistance: A trip to Montana's Glacier National Park that did not cost more than $400 total.\n\"It is easy to spend more than you expect,\" says Leavitt, author of \"Road Tripping\". \"But if you prepare it right, it can be a lot of fun, and very cheap.\"\nMore Americans are planning road trips around the United States. In fact, 65 percent of those polled report they are more likely to take a road trip this summer than they were last summer, according to a recent survey by booking site Travelocity. And when you single out parents, a whopping 81 percent said they were more likely to hit the road with the kids this year.\nBe careful, though. While a domestic road trip might appear like an affordable alternative to traveling abroad, costs can easily spiral out of control.\nA recent study by travel site Expedia found that Americans expect to pay an average of $898 per person for a weeklong trip within their own country, hardly chump change.\nTo keep a lid on summer road-trip costs, we canvassed financial planners for their best tips, culled from personal experience. Here's what they had to say.\nUSE APPS TO YOUR ADVANTAGE\nNot that long ago, travelers squinted at printed maps and missed exits. These days, there is no excuse for not using smartphone apps.\nGoogle Maps, for instance, will get you from Point A to Point B without getting lost and racking up unnecessary mileage. GasBuddy will locate the cheapest local stations where you can fill up the tank. Apps like RoadNinja and Roadtrippers can tell you about local amenities and help plan your route, and HotelTonight or Hotels.com can locate last-minute lodging discounts nearby.\nGET CAMPY\nDitch the hotels, and stay in campgrounds, says financial planner Therese Nicklas of Braintree, Massachusetts.\nBy camping in state parks with her family of four for around $10 a night, and cooking their own food, Nicklas estimates they save about $150 every single day.\nYou don't have to pitch a tent every night. Consider an occasional splurge at a hotel with a pool, hot showers and free breakfasts.\nDiehard money-savers might enjoy so-called \"dispersed camping\" permitted in many national and state forests, where you set up away from designated campgrounds. No amenities, but no fees, either.\nAlso consider an annual pass from the National Park Service, allowing you access to more than 2,000 sites nationwide for $80.\nHOLD MONEY-SAVING COMPETITIONS\nAdviser Niv Persaud of Atlanta has an innovative idea: Make budgeting a game with your kids instead of a chore. \"For each dollar they save, on coupons, special deals, or cheap gas, they earn a star,\" Persaud says. \"The one with the most stars at the end of the trip gets to pick the location for the next family vacation.\"\nFORGET FLIGHTS AND CAR RENTALS\nWhatever savings you realize by staying domestic could be wiped out by airline bookings and car- or RV-rental fees. So do what David MacLeod did, and schlep to your destination in your own car, even if it's a long distance away. The planner from Fullerton, California recently took his family all the way from southern California to Montana in their trusty Honda Odyssey, saving $1,000 in the process.\nBRING YOUR OWN FOOD\nThe silent killer of many family travel budgets: Eating out. Nip that in the bud with a cooler or two stuffed to the brim with snacks and quick meals.\n\"A simple gallon of milk, box of cereal, yogurts and fresh fruit can provide a great breakfast at 1/4 of the cost of eating out,\" says Janice Cackowski, a planner in Independence, Ohio. She also advises eating out only at lunch, when restaurant prices tend to be much lower.\nAbove all, don't be scared off by the idea of being in a car for so many hours with your kids. Magic occurs when families actually spend time with each other. \"Something wonderful happens: You pay attention to each other,\" says Leavitt.\n(Editing by Lauren Young and David Gregorio )", "external_links": [], "published": "2015-07-01T18:35:00.000+03:00", "crawled": "2015-07-01T18:17:24.000+03:00", "highlightTitle": ""}