{"organizations": [], "uuid": "7ed14a937db4951be68b0dbccc3649490266527a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507190041.html", "country": "US", "title": "Zimbabwe: Labour Laws Need Alignment", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Labour Laws Need Alignment", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T10:21:00.000+03:00", "replies_count": 0, "uuid": "7ed14a937db4951be68b0dbccc3649490266527a"}, "author": "", "url": "http://allafrica.com/stories/201507190041.html", "ord_in_thread": 0, "title": "Zimbabwe: Labour Laws Need Alignment", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: President to Psmas' Rescue \nMost people, including both parties at the beginning of this latest case before the Supreme Court, had assumed that ending a contract of employment where there was no disciplinary reason meant that the retrenchment procedures had to be followed. Now it is clear that there is another method, and one that costs an employer very little and gives very little protection to the honest, hardworking employee. \nThe Supreme Court has ruled that the Labour Act and labour regulations do not take away an employer's common law right to end a contract of employment although they do modify the amount of notice that must be given, ensuring that long-term staff are given at least three months notice or pay in lieu of notice. This judgment confirms an earlier judgment by the Labour Court. \nThis ruling on what our law states now is definitive; there is no appeal from the Supreme Court on a matter of law. But it does go against how most people have interpreted the right of an employer to dismiss staff, and it does conflict with the retrenchment law where the payout for a long-term employee is usually considerably more than three months salary and allowances. \nWe agree with the present legal position that an employer should not have to keep someone on the payroll if they do not want them, for whatever reason. Overstaffing, personality clashes, and the like have to be resolved, usually by the employee leaving the employer. Where we disagree is with the amount that employees have to be paid when their contracts are ended without cause. Three months pay for someone with say 20 or 30 years of loyal service is unfair to the employee. \nThere is a great deal of protection for employees being summarily dismissed, that is fired without notice, and the law insists that a proper disciplinary process is followed but, it is now apparent, there is very little protection for the hardworking competent employees who can be sent on their way with little money. \nWhat is now urgently needed is a revamp of labour law to ensure that dismissal of long-term staff without cause will result in a higher payout than just three months salary. \nWe agree that the present retrenchment rules are cumbersome and probably limit the number of new jobs created by making employers think very seriously before taking on a new full-time employee. They tend to give employees all the advantages. But clarifying that an alternative exists through modest notice is unfair to employees and gives employers all the advantages. A workable system has to be fair to both. \nIt has been clear for several years that a simple system, fair to both employers and employees, is needed to cope with changing demands for labour, and that this system should not involve a lot of bureaucracy. Discussions and debate on such a system has been in progress for some time and there is a growing measure of agreement. \nIt is now urgent that the debate is moved into law by Parliament. A simple amendment extending notice periods beyond three months for staff with more than three years service would be a start and might answer the problem of giving employers labour flexibility without being unfair to employees. Zimbabwe \nA leaked tape of a meeting between a Politburo member and some youths has led to the suspension of Zanu-PF Manicaland … see more » Copyright © 2015 The Herald. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-19T10:21:00.000+03:00", "crawled": "2015-07-19T11:02:31.708+03:00", "highlightTitle": ""}