{"organizations": ["GNA"], "uuid": "061ed2f8c279738f155ae3b67e00cfaa33648c87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/ptkw50anm2_2738097202343_3990680150428.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/627664/1/ghana-china-trade-exceeds-5-billion.html", "country": "US", "title": "Ghana-China trade exceeds $ 5 billion", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Ghana-China trade exceeds $ 5 billion", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T18:36:00.000+03:00", "replies_count": 0, "uuid": "061ed2f8c279738f155ae3b67e00cfaa33648c87"}, "author": "", "url": "http://www.modernghana.com/news/627664/1/ghana-china-trade-exceeds-5-billion.html", "ord_in_thread": 0, "title": "Ghana-China trade exceeds $ 5 billion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  4 July 2015 16:36 CET Ghana-China trade exceeds $ 5 billion By GNA \nThe value of trade between Ghana and China reached $ 5.6 billion at the end of 2014, making Ghana the Asian country single biggest trading partner. \n“Our economic and trade cooperation has achieved gratifying results, trade volume has surged from less than $100 million in 2000 to $5.6 billion in 2014,” Chinese Ambassador, Ms Sun Baohong, said. \nGhana’s export to China has also increased significantly at a very high rate of 86.7 per cent vis-a-vis declining total international trade. \nGhana’s export to China has hit $1.4 billion, a historical high, Ms Sun said at a reception on Thursday to mark 55th anniversary of the establishment of China-Ghana diplomatic relations. \n“All the indicators of China-Ghana cooperation are ranking high in China-Africa cooperation. \n“The achievements of our cooperation have not grown overnight; it is jointly cultivated and nurtured through mutual political trust.” \nGhana is faced with erratic power supply, high budget deficit and rising public debt as well as a depreciating cedi. \nDespite the country’s economic difficulties, Chinese enterprises say they still have confidence in the economy, while China has also urged its companies to invest more in the country. \n“In recent years, Ghana’s economy encountered some difficulties, while most of the foreign investors are pessimistic about Ghana’s economy and decrease investment to Ghana, Chinese enterprises still have confidence in Ghana’s market,” Ms Sun said. \n“The Chinese government encourages the Chinese companies to invest in the fields such as energy, aviation, manufacturing and agriculture.” \n“China is willing to keep close policy dialogue, improve cooperation mechanism, exchange governance experiences and properly solve the existing problems through consultation and cooperation with Ghana,” she said. \nThe Minister of Education, Professor Jane Naana Opoku-Agyemang, said Ghana recognises the immense support, including loans, from China towards the nation’s social, political and economic development agenda. \nShe said the celebration marked a historic milestone in the economic cooperation between the two countries. Other Stories Follow Us He is no fool who gives what he cannot keep to gain what he cannot lose By: John Boadi", "external_links": [], "published": "2015-07-04T18:36:00.000+03:00", "crawled": "2015-07-04T18:10:37.000+03:00", "highlightTitle": ""}