{"organizations": [], "uuid": "72fa9c965e84fa47db15a52a60f76787ce785d9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/e/r/e/2/image.related.afrArticleLead.620x365.gie36j.png/1437940808174.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/media-and-marketing/tv/google-unlocks-virtual-reality--within-a-small-budget-20150726-gie36j", "country": "AU", "title": "Google unlocks virtual reality – within a small budget", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Google unlocks virtual reality – within a small budget | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T22:00:00.000+03:00", "replies_count": 0, "uuid": "72fa9c965e84fa47db15a52a60f76787ce785d9a"}, "author": "Paul McIntyre", "url": "http://www.afr.com/business/media-and-marketing/tv/google-unlocks-virtual-reality--within-a-small-budget-20150726-gie36j", "ord_in_thread": 0, "title": "Google unlocks virtual reality – within a small budget", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Google Cardboard makes a DIY immersive experience readily available. by Paul McIntyre Virtual Reality for the masses is coming like a bullet train and could account for a third of all digital video consumption within two years, predicts the managing director of creative and digital agency CHE Proximity, Chris Howatson.\nIt's a big hairy call but Mr Howatson, who is currently producing one of the first Australian VR brand films for the launch of Mazda's MX5, said thanks to Google's cheap \"VR\" kit called Cardboard (it literally is) and Facebook's more sophisticated Oculus Rift, \"immersive experiences\" in VR and 360-degree viewing formats are set to explode.\n\"We've been talking forever about living in an experience economy,\" Mr Howatson told The Australian Financial Review . \"I think 360 [degree] video will become hugely prevalent. It will be pretty safe to say in two years' time at least a third of what we produce from a video perspective will be 360.\"\nThe new format means rather than shooting and viewing with a single, one-dimensional aspect, the entire surrounds are included using 360 camera rigs, which then can be viewed as users physically pivot.\nThe automotive and travel related sectors will be first to move on VR because they are \"natural experience brands\" but there were also huge implications for retail and e-commerce ventures, Mr Howatson said. There are already whispers that Qantas is another company working on a VR project for an in-flight initiative.\nMazda sees its fourth generation MX-5 roadster as a perfect fit for 360-degree video to help sell its open-top motoring icon.\n\"Our challenge is to get a new generation of buyer into this car and the $31,990 price point opens up the market a lot more for us,\" said Mazda's director of marketing, Alastair Doak. \"We need to sell the excitement and romance of a roadster and open-top motoring so a tool like 360 really talks to that generation of buyers. It's fortuitous for us. If we can demonstrate online, give them a taste of what having a true convertible roadster is like, we'll be well on the way to having them take a real test drive of the car.\"\nMazda's ambitions for the MX-5 are big – it launches next month and in its first year Mr Doak said the carmaker wanted to match its peak unit sales of the MX-5 in Australia during the mid-1990s of 1500 cars.\n The future is here More broadly on the future of VR and 360 video, Mr Howatson said he was sold on the coming mass take-up of the technology for three reasons: the cost to consumers of experiencing VR has already collapsed thanks to Google Cardboard – it costs between 50¢ and $10 depending on individual configurations; the once massively prohibitive cost of shooting in VR or in true 360 degrees (as opposed to a \"bubble\" or panoramic view) is also plummeting (Google has a VR camera rig with full surround cameras called Jump launching shortly) and the distribution challenge has been half-solved. Google's YouTube has started allowing \"360 view\" video uploads as part of its rollout; Red Bull and others are already trialling the format with its Formula 1 team.\nThere are a lot of chips on Google's table in this scenario but Mr Howatson said the tech giant is the lead player at present because it's trying to make VR accessible for the mass market.\n\"We're on the cusp of very big change,\" he told the Financial Review . \"Google is essentially the leader by enabling essentially every smartphone user a pretty immersive 360-degree experience. Compared to Oculus Rift, it makes it very accessible. Virtual Reality has been talked about for a very long time but it's been pretty inaccessible and largely limited to gamers and gaming devices. Google has made the VR viewer cheap. The other thing is distribution. In March YouTube made it possible to upload 360-degree video which obviously as a distribution platform means everyone in the world can get it easily. Basically all the conditions for mass consumer demand are being met.\"\nMr Howatson said the opportunity for brands now was to make compelling, immersive content.\n\"There are a lot of car brands around the world that are doing this and we're working with one at the moment for Mazda's MX-5 launch,\" he said. \"You can imagine the feeling of a test drive; what it's like to be behind the driver's seat as if you actually were. You can look around and see what the driver sees through the window; you can see what the dash looks like. You can look up and down. So the whole idea of a linear narrative is kind of gone.\"\nDon't expect the big TV set in the lounge room to tap VR anytime soon though – it requires the sensor motion capability of a smartphone or a dedicated headset like Rift for that. And there are limitations to the environments in which fully-immersive VR will be experienced.\nHeads up: virtual reality or virtually unrealistic? Just as Google discovered when early adopters wearing its internet-enabled Glass specs in public became known as \"Glassholes\", the idea that people will strap-on a VR headset on the train is virtually unrealistic. But on smart phones they will still be able to experience 360 viewing without the enhancements of strap-on kits.\n\"The biggest thing is you want some space around you to get the benefit of 360, you have to be able to turn around so you're not going to watch on a bus,\" he said. \"If you're going to put a headset on, you naturally want to do that in a private space. But even if you're consuming 360-degree video, just turn your eyesight and without a headset on, you could be walking down Bourke Street Mall, and be playing a video to try to better understand where your position within the mall may be.\n\"The reason this one will stick where others have failed from Google like Glass is there are no barriers to consumption. People who came out wearing Glass were called Glassholes because it was an unnatural way with which they had to interact with society. VR and 360 viewing doesn't have any of those negatives associated with it.\"", "external_links": [], "published": "2015-07-26T22:00:00.000+03:00", "crawled": "2015-07-27T00:06:26.901+03:00", "highlightTitle": ""}