{"organizations": ["World Bank"], "uuid": "fd37f3213c0de900ffcc15547ba2e8e4eda3c081", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507021318.html", "country": "US", "title": "Africa: Caribbean Alliance Eyes New Era for Youth Entrepreneurship", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Caribbean Alliance Eyes New Era for Youth Entrepreneurship", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T15:41:00.000+03:00", "replies_count": 0, "uuid": "fd37f3213c0de900ffcc15547ba2e8e4eda3c081"}, "author": "", "url": "http://allafrica.com/stories/201507021318.html", "ord_in_thread": 0, "title": "Africa: Caribbean Alliance Eyes New Era for Youth Entrepreneurship", "locations": ["Africa", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Africa: World Bank Suggests Continent Learn From China's Experience in Special Economic Zones \nAccording to the agreement signed on 30 June 2015, the founding members aim to \"contribute to regional sustainable development by helping to increase the numbers of young entrepreneurs who grow businesses, create jobs, change lives and ensure future economic prosperity.\" \nSelma Green of Barbados Youth Entrepreneurship Scheme, elected as inaugural Chair following the launch event, said: \"I look forward to leading a dynamic alliance of partners who are committed to creating a new generation of entrepreneurs, who will lead the charge to revolutionise our economies.\" Green will serve alongside Erica Wynter of Young Entrepreneurs' Association of Jamaica, who was elected Vice Chair. \nTrinidad and Tobago's Minister of Gender, Youth and Child Development, Clifton De Coteau, applauded the initiative, noting that it will help countries to share practices and promote youth entrepreneurship. He highlighted that many young people are sole bread winners for their households, saying: \"Our support of young entrepreneurs is not just about boosting their self-esteem and their career development, but also about ensuring they can provide a good quality of life for their families.\" \nA network of networks, the alliance will facilitate trade opportunities, training and technical support for young business leaders, and increase networking and mentorship opportunities. It will also unify the voices of young people to call for enhancements to existing entrepreneurship policies. \nWelcoming the new alliance, Katherine Ellis, Director of Youth at the Commonwealth Secretariat, said: \"Young entrepreneurs are powerful drivers of economic renewal, job creation, innovation and social change. The Commonwealth Secretariat is committed to supporting and connecting young entrepreneurs so their voices are heard by decision makers at the highest levels.\" \nThe decision to form the alliance - which is modelled on the Commonwealth Asia Alliance of Young Entrepreneurs (CAAYE), set up in 2011 - was made in December 2014 at a forum in Barbados convened by the Commonwealth Secretariat. \nMr Matt Sweeting, President of the Bahamas Organization of Young Professionals, said: \"CAYE-C&C represents an unparalleled opportunity to create an enabling environment for young people to start and grow their own businesses, in an effort to combat unemployment, crime and poverty. An initiative like this can be a game-changer.\" \nThe following organisations are founding members of the Commonwealth Alliance of Young Entrepreneurs-Caribbean & Canada: \nAnguilla Get SET Entrepreneurship Programme - Anguilla \nOrganization of Young Professionals - Bahamas \nBarbados Entrepreneurship Foundation - Barbados \nBarbados Youth Business Trust - Barbados \nYouth Entrepreneurship Scheme - Barbados \nYouth For Epic Change - Barbados \nFuturpreneur Canada - Canada \nDominica Youth Business Trust - Dominica \nJamaica Youth Business Trust - Jamaica \nYoung Entrepreneurs Association of Jamaica - Jamaica \nSt Lucia Youth Business Trust - Saint Lucia \nSt Vincent & Grenadines Youth Business Trust - St Vincent and The Grenadines \nYouth Business Trinidad & Tobago - Trinidad and Tobago \nVisit the CAYE-C&C website: http://www.cayecaribbean.com \nFollow CAYE-C&C on Twitter: @cayecnc Africa \nFew have heard of it. Even fewer know how it will work. But a newly launched body could revolutionise how Saudi Arabia … see more » Copyright © 2015 Commonwealth News and Information Service. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-02T15:41:00.000+03:00", "crawled": "2015-07-03T09:55:37.000+03:00", "highlightTitle": ""}