{"organizations": [], "uuid": "f49420aae5c41332fb29571bc91cac44c79d32f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/PropertyManagement", "section_title": "Yahoo! Finance: Property Management Industry News", "url": "http://finance.yahoo.com/news/cbre-clarion-global-real-estate-230600691.html", "country": "GB", "title": "CBRE Clarion Global Real Estate Income Fund (NYSE: IGR) Declares an 11% Increase to Monthly Distribution", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "CBRE Clarion Global Real Estate Income Fund (NYSE: IGR) Declares an 11% Increase to Monthly Distribution", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T02:06:00.000+03:00", "replies_count": 0, "uuid": "f49420aae5c41332fb29571bc91cac44c79d32f3"}, "author": "", "url": "http://finance.yahoo.com/news/cbre-clarion-global-real-estate-230600691.html", "ord_in_thread": 0, "title": "CBRE Clarion Global Real Estate Income Fund (NYSE: IGR) Declares an 11% Increase to Monthly Distribution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "*Includes PFIC losses, as defined below. \nThe amounts and sources of distributions reported are only estimates and are not provided for tax reporting purposes. The actual amounts and sources of the amounts for accounting and tax reporting purposes will depend upon the Fund’s investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. SHAREHOLDERS WILL BE SENT A FORM 1099-DIV FOR THE CALENDAR YEAR INDICATING HOW TO REPORT FUND DISTRIBUTIONS FOR FEDERAL INCOME TAX PURPOSES. \nThe Fund invests primarily in real estate investment trusts (“REITs”) and similar companies. When these companies make distributions during the year, they do not disclose the character of those distributions. The Fund uses historical information to generate the estimated character reflected in this notice. Until the Fund receives information as to the character of distributions it has received from these companies – generally around January 31 of the following year – it cannot provide a definitive characterization of the source of distributions paid to shareholders. \nThe Fund invests in certain companies that have been designated as PFICs for purposes of U.S. tax regulations. Increases in the value of these PFICs (“PFIC Income”) increase the income of the Fund, even when those gains have not been realized. The amount of net investment income described in the foregoing table (Estimated Source of Distributions) may include PFIC Income. Conversely, decreases in the value of these PFICs (“PFIC Losses”) offset the other investment income of the Fund, even when those losses have not been realized. The amount of net investment income in the foregoing table (Estimated Source of Distributions) may have been reduced by PFIC Losses. \nThe Fund estimates that it has distributed more than its income and net realized capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur, for example, when some or all of the money that you invested in the Fund is paid back to you. A return of capital distribution does not necessarily reflect the Fund’s investment performance and should not be confused with “yield” or “income”. \nShareholders should not draw any conclusions about the Fund’s investment performance from the amount of this distribution or from the terms of the Fund’s managed distribution policy. The performance and distribution rate information disclosed in the table below is based on the Fund’s net asset value (“NAV”). The Fund’s NAV is calculated as the total market value of all the securities and other assets held by the Fund minus the total value of its liabilities. Performance figures are not meant to represent individual shareholder performance. The value of a shareholder’s investment in the Fund is determined by the market price of the Fund’s shares. \nThe Fund’s Cumulative Total Return for fiscal year to date 2015 (January 1, 2015 through June 30, 2015) is set forth below. Shareholders should take note of the relationship between the Cumulative Total Return and the Fund’s Cumulative Distribution Rate for 2015, as well as its Current Annualized Distribution Rate. Moreover, the Fund’s Average Annual Total Return for the preceding five-year period (July 1, 2010 through June 30, 2015) is set forth below. Shareholders should take note of the relationship between the Fund’s Average Annual Total Return and its Average Annual Distribution Rate for the preceding five-year period. Fund Performance and Distribution Rate Information:", "external_links": [], "published": "2015-07-15T02:06:00.000+03:00", "crawled": "2015-07-15T02:15:02.000+03:00", "highlightTitle": ""}