{"organizations": [], "uuid": "e0d95c0caad76d85ce61693445fe84022134f77a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/2/w/y/t/image.related.afrArticleLead.620x365.gikmd8.png/1437938045182.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/street-talk/meet-integral-diagnostics-the-500m-float-formerly-known-as-lake-imaging-20150726-gikmd8", "country": "AU", "title": "Meet Integral Diagnostics, the $500m float formerly known as Lake Imaging", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Meet Integral Diagnostics, the $500m float formerly known as Lake Imaging | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T03:14:00.000+03:00", "replies_count": 0, "uuid": "e0d95c0caad76d85ce61693445fe84022134f77a"}, "author": "afr.com", "url": "http://www.afr.com/street-talk/meet-integral-diagnostics-the-500m-float-formerly-known-as-lake-imaging-20150726-gikmd8", "ord_in_thread": 0, "title": "Meet Integral Diagnostics, the $500m float formerly known as Lake Imaging", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Integral Diagnostics, Australia's fourth-largest imaging diagnostics company, is seeking an ASX-listing before the end of 2015. Nicolas Walker by Sarah Thompson Anthony Macdonald Jake Mitchell ASX-hopeful Lake Imaging has received a fresh coat of paint as it prepares to meet fund managers for the first time ahead of a potential $500 million initial public offering.\nFundies will be introduced to the rebadged Integral Diagnostics - Australia's fourth largest provider of x-rays, MRI scans and the like - this week, with chief executive John Livingston and chief financial officer Craig Bremner out to explain the diagnostic imaging company and its position in the industry.\nIt is understood lead managers Morgan Stanley and UBS have arranged one-on-one meetings and group lunches in Sydney, Melbourne, Hong Kong and New Zealand, designed to have the company's float ready to go should the IPO window re-open following the August reporting season.\nIntegral is expected to be pitched as a high-growth small cap company with strong positions in key markets in Queensland, Victoria and Western Australia.\nThe company has grown quickly since it was founded as Victoria's Lake Imaging 2002 and counts 44 radiology sites, including a number of practises co-located in hospitals.\nA large part of Integral's growth has come through bolt-on deals, including South Coast Radiology in Queensland and a stake in Western Australia's Global Diagnostics. The pitch to investors is expected to include the potential for further industry consolidation.\nThe float is expected to see Advent Private Capital reduce its minority stake. Doctors own about half of Integral Diagnostics, while the rest is split between management, founders and Advent.\nFundies will also use the information sessions to find out more about Primary Health Care and Sonic Healthcare and another potential IPO contender, I-MED Radiology Network. I-MED's Image Networks Holdings is the largest industry player with 17.5 per cent market share according to IBISWorld, while Sonic has 13 per cent and Primary 10.1 per cent. IBISWorld reckons the industry was worth $3.3 billion in the 2014/15 financial year and growing at 6.5 per cent.\n Medicare data released late last week showed imaging services provided were up 5 per cent in the year to June 30, while imaging benefits paid were 7.6 per cent higher than the 2014 financial year.\nHighbury Partnership is advising Integral.\nElsewhere in capital markets, Westpac Banking Corp is expected to launch its $750 million hybrid on Monday. Further to Street Talk's report last week , it's understood the hybrid will have a 7½ year mandatory call date and a 5½ year optional call date. The pricing range is expected to be 390 to 410 basis points over the bank bill swap rate and pegged to other hybrids with similar terms to maturity.", "external_links": [], "published": "2015-07-27T03:14:00.000+03:00", "crawled": "2015-07-27T00:08:29.275+03:00", "highlightTitle": ""}