{"organizations": [], "uuid": "05de0a9e07f2d3acd953a880ca9e2bfc2f8c1f8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/c/x/b/v/image.related.articleLeadwide.620x349.gicftc.png/1436989519229.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/15/materials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/banking-and-finance/nab-chief-executive-andrew-thorburn-says-bank-has-done-heavy-lifting-on-capital-20150714-gicftc.html", "country": "AU", "title": "NAB chief executive Andrew Thorburn says bank has done 'heavy lifting' on capital", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "NAB chief executive Andrew Thorburn says bank has done 'heavy lifting' on capital", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "05de0a9e07f2d3acd953a880ca9e2bfc2f8c1f8f"}, "author": "James Eyers", "url": "http://www.smh.com.au/business/banking-and-finance/nab-chief-executive-andrew-thorburn-says-bank-has-done-heavy-lifting-on-capital-20150714-gicftc.html", "ord_in_thread": 0, "title": "NAB chief executive Andrew Thorburn says bank has done 'heavy lifting' on capital", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NAB chief executive Andrew Thorburn addresses the Trans-Tasman Business Circle lunch on Wednesday. Photo: Louie Douvis\nNational Australia Bank chief executive Andrew Thorburn is giving himself credit for raising $5.5 billion in equity before the banking regulator said the industry needs to boost capital ratios, even though there is no deadline or clarity on how capital strength will be defined.\nNAB's decision to raise capital at its May results \"was a prudent, appropriate move\" given bank capital is moving higher, Mr Thorburn said on Wednesday.\n\"We still believe we are well paced, and we still believe we absolutely did the right thing in May to get ahead of that,\" he told a Trans-Tasman Business Circle lunch in Sydney.\nCapital raisings can hurt bank shareholders by diluting the return on equity, but analysts say with the current focus on leverage, they can also boost a bank stock's trading multiples by reducing investor concerns about stability.\nAdvertisement Bank capital is back in the spotlight after the Australian Prudential Regulation Authority said on Monday the major banks would have to increase their capital ratios by 2 percentage points – or about $28 billion according to analysts – to be comfortably in the top quarter of global banks, the definition used by the financial system inquiry to define \"unquestionably strong\".\nWhile APRA said it agreed bank capital should be \"unquestionably strong\", it has not settled on how to definite that term – making it impossible to determine what the true capital shortfall is. APRA's ambiguity is likely to be deliberate, given a host of changes being proposed by the Basel Committee on Banking Supervision to the ways capital ratios are calculated globally.\nWhile Westpac Banking Corp said at its results in May it would raise $2 billion through a partially underwritten dividend reinvestment plan to boost its capital ratio, ANZ Banking Group and Commonwealth Bank of Australia have taken a less aggressive approach in the wake of the financial system inquiry report .\nANZ chief executive Mike Smith said at the bank's interim results in May there was no need for urgent action because shareholders are not rewarded if the bank is over-capitalised and regulators will provide time to meet any new targets. ANZ said it is comfortable running a common equity tier 1 (CET1) ratio in the \"high 8s\".\nBut with NAB's equity raising boosting its CET1 to a sector-leading 10 per cent, UBS analyst Jonathan Mott said this level has become a new \"line in the sand\", and \"it is unlikely the market will believe any Australian bank's capital position is \"unquestionably strong\" unless it maintains a CET1 ratio of at least 10 per cent post NAB's moves\".\nANZ continues to trade at a discount to the other major banks based on price-equity ratios, and said on Monday it is considering \"organic capital generation, balance sheet management and the disposal of non-core assets\" to lift capital further.\nCBA had been the best capitalised of the large Australian banks (it generates more capital than peers through its stronger earnings) but has been overtaken by NAB. This has prompted some analysts to ponder whether CBA might announce a capital-raising initiative at its full-year results on August 12. CBA was the only one of the big four banks not to put out an ASX release in response to APRA's paper on Monday.\n\"[CBA] has not commented but we believe CBA will undertake some form of capital raising at the FY15 result,\" said Morgan Stanley analyst Richard Wiles said in a note on Wednesday. Mr Wiles expects CBA will partially underwrite the dividend reinvestment plan to raise about $2.5 billion, which would lift the CET1 to 9.8 per cent. He also sees \"merit\" in a capital raising of $4 billion to $5 billion, which would lift CBA's pro forma CET1 ratio to 10.4-10.7 per cent – well ahead of NAB. CLSA analyst Brian Johnson also raised the prospect of CBA raising capital next month.\nMr Thorburn said there is some confusion about whether APRA's focus will be on total capital (which includes equity, hybrids and tier 2 bonds) or CET1, but \"on both counts, we stand in good stead because since June 2014 – which was the timeframe APRA was referring to – we have lifted our CET1 by 150 basis points and our total capital by around 200 [basis points]. So we have done most of the heavy lifting.\"\nWith the Basel committee examining whether to curtail big banks' use of their own risk models to determine how much capital they hold, Mr Thorburn also suggested that caution about \"internal ratings-based\" models is warranted. Australia's long run of unbroken economic growth can limit the ability of banks' internal models to predict the effects of a sharp downturn.\n\"There is no doubt that at some point in the future, there are going to be events which are going to be as challenging for banks [as the global financial crisis], and whilst we have invested a lot of money in risk models that we believe in and are predictive, we have had 24 years of unbroken growth in Australia,\" Mr Thorburn warned. \"We see rising capital levels are not just inevitable around the world, but are necessary.\"\nOn technology, Mr Thorburn said P2P lenders \"should be something that we are concerned about\" but reiterated other bank chiefs' view that the sustainability of the nascent sector will not be known until a downturn. Responding to the recent move by Westpac's venture capital fund to invest in leading bitcoin player Coinbase, the NAB chief said bitcoin is \"an area we continue to scan and monitor and think about, but I do think we have the capability in our own company to do this stuff\".", "external_links": ["http://www.afr.com/it-pro/cba-anz-tipped-to-lead-capital-raisings-20150713-giba0i", "http://www.afr.com/business/banking-and-finance/financial-services/banks-are-going-to-raise-extra-capital-before-they-have-to-20150713-gib42k"], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T05:08:49.000+03:00", "highlightTitle": ""}