{"organizations": [], "uuid": "69e64be4d686845003dbc4e39ab106215eb6bc1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/28/akamai-tech-results-idUSL3N1085FV20150728", "country": "US", "title": "UPDATE 1-Akamai forecasts revenue, profit below estimates; shares sink", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Akamai forecasts revenue, profit below estimates; shares sink | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T02:10:00.000+03:00", "replies_count": 0, "uuid": "69e64be4d686845003dbc4e39ab106215eb6bc1e"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/28/akamai-tech-results-idUSL3N1085FV20150728", "ord_in_thread": 0, "title": "UPDATE 1-Akamai forecasts revenue, profit below estimates; shares sink", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details, forecast, CEO comment, shares)\nBy Anya George Tharakan\nJuly 28 (Reuters) - Online content distributor Akamai Technologies Inc forecast third-quarter revenue and profit below estimates, citing a stronger dollar.\nShares of Akamai, which claims to deliver between 15 and 30 percent of all Web traffic, fell as much as 13 percent in after-hours trading on Tuesday.\nThe company's second-quarter profit fell nearly 8 percent after 11 quarters of growth, as costs rose.\nCambridge, Massachusetts-based Akamai, which gets about a quarter of its revenue from outside the United States, said it expected a stronger dollar to have a negative impact of about $20 million on revenue in the current quarter.\nThe average value of the dollar against a basket of currencies was 20 percent higher in the second quarter compared with the same quarter last year.\nAkamai, whose customers include MTV Networks and online home rental marketplace Airbnb, forecast an adjusted profit of 56-58 cents per share and revenue of $543 million-$555 million for the current quarter.\nAnalysts on average expected earnings of 62 cents per share and revenue of $565.1 million, according to Thomson Reuters I/B/E/S.\nAkamai and rivals Limelight Networks Inc and Level 3 Communications Inc face increasing competition as companies such as Amazon.com Inc, Netflix Inc and Comcast Corp enter the content delivery market.\nAkamai has been trying to differentiate itself by investing in cloud security services, as well as investing to expand its content delivery platform to better handle rising video traffic.\n\"There is some reasonable prospect that there could be a substantial amount of ... traffic that comes on the platform next year and we want to be prepared in case that happens,\" Chief Executive Tom Leighton told Reuters.\nTotal costs rose 19.5 percent to $434.5 million.\nAkamai said its revenue from media delivery rose about 12 percent to $243.5 million in the quarter ended June 30.\nRevenue from the company's fast-growing performance and security business, under which it offers cloud security products, rose about 15 percent to $256 million.\nOverall net income fell to $67.2 million, or 37 cents per share, from $72.9 million, or 40 cents per share, a year earlier.\nExcluding items, Akamai earned 57 cents per share, missing the average analyst estimate by a cent, according to Thomson Reuters I/B/E/S.\nRevenue rose 13.6 percent to $540.7 million, beating the average estimate of $540.4 million.\nUp to Tuesday's close of $73.65, Akamai's shares had risen about 17 percent this year. (Reporting by Anya George Tharakan and Subrat Patnaik in Bengaluru; Editing by Savio D'Souza and Ted Kerr )", "external_links": [], "published": "2015-07-29T02:10:00.000+03:00", "crawled": "2015-07-29T01:29:00.797+03:00", "highlightTitle": ""}