{"organizations": [], "uuid": "ee82f2036fa6bb08987f08ddabc1a664756af063", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/4/f/m/j/image.related.afrArticleLead.620x365.gi1ruj.png/1435916248419.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/100women/women-of-influence--nine-mistakes-young-leaders-can-make-20150703-gi1ruj", "country": "AU", "title": "Women of Influence - nine mistakes young leaders can make", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Women of Influence - nine mistakes young leaders can make | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T22:15:00.000+03:00", "replies_count": 0, "uuid": "ee82f2036fa6bb08987f08ddabc1a664756af063"}, "author": "Claire Stewart", "url": "http://www.afr.com/brand/100women/women-of-influence--nine-mistakes-young-leaders-can-make-20150703-gi1ruj", "ord_in_thread": 0, "title": "Women of Influence - nine mistakes young leaders can make", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nicole Gibson, 22, CEO of her own company, and Australia's National Mental Health Commissioner, cautions young leaders against making decisions that are more about themselves, than their business. 'You can't lead from that position.' Wayne Taylor by Claire Stewart Being the boss isn't about being the oldest person in the room any more, it's about effective leadership. But how do you know what that means, particularly in the boardroom, if you finished high school only a few years ago?\nAFR Weekend asked Australia's National Mental Health Commissioner and chief executive of The Rogue and Rouge Foundation, 22-year-old Nicole Gibson (NG), and 25-year-old leadership consultant and non-executive director Holly Ransom (HR) for their advice on how to lead like a champion.\nYour job is not you (NG)\n\"When you're in a leadership position from a young age, it becomes a part of you, in those fundamental years when you're forming your identity. The risk is that decisions become more about you than the business. You can't lead from that position. A true leader knows how to raise their team up. They walk beside or behind their team, not in front.\nAvoid \"Ego-preneurs\" (NG)\n\"We put entrepreneurs on a pedestal. Entrepreneurial thinking and taking action should be the norm. Acknowledgement is crucial, but we shouldn't \"celebratise\" them like we do. What they do is always achievable but the more we make entrepreneurs celebrities the more out of reach they become [for young people as role models].\"\nDon't cannibalise colleagues (HR)\nHow do you question the status quo without getting people offside? \"For me, it's seeking to understand, rather than be understood. Ask people to explain why things are done a certain way, rather than confront them about why they are doing something you think is wrong. [Often] you realise you're both using different language but talking about the same thing. Build from that foundation rather than coming at it from two different points and as a result cannibalising each other.\"\n Adapt your work style to your leader (HR)\n\"I know a CEO who has a member of staff who was given instructions about a particular thing he wanted done. The CEO had worked out exactly what they wanted, but the person did it differently, came back next day and said, 'I've found a better way of doing it'. The CEO was getting really frustrated because there was a reason [for the instructions] and that things were done a certain way because that's the way they knew they worked.\"\nHave someone above you (NG)\nEven if you're at the top of the tree. \"I have a board of advisers and I run all decisions past them, because they see it more objectively, with fresh eyes. Then I take it to the team for their input.\" Gibson says it's important to make preliminary decisions before opening up for team discussions, otherwise it gets too messy. \"At the end of the day, people do need leadership.\"\nSubordinates aren't your best mates (NG)\nBeing friends is fine until something goes wrong at work. \"No boss wants to have a hard conversation with a mate. And you run the risk of them counting on you to give them a bit of slack if they're late with work, or under-performing. I've lost staff because it was too personal. I valued the friendship more than I valued them as an employee and I didn't want to jeopardise that.\"\nSay Yes (NG)\n\"Our society is so worried about what might go wrong, we are blinded by what we could achieve. I'm the youngest commissioner by 40 years. I have to have a sense of humour around my life, the opportunities I get and the situations I find myself in. I think it's because I'm an open person, nothing is impossible in my mind. If you get an opportunity, run with it.\"\nKnow-it-alls aren't hot (HR)\nOne of the worst things you can do is come in and profess to know the place, or to have a handle on things and assert your opinions too early. I've seen it happen over again, where it's practically the opening address of the [board] meeting and the new person comes in and says, 'This is how our strategy should be, what we should do, where we should be heading…'.\"\nFind a living, breathing mentor, preferably from another industry (HR)\nThere's a real comfort in the social media/digital world to share ideas and get advice, but that kind of in-person art of connecting and creating those relationships with people more experienced or senior is something we're not seeing the uptake of. And cross-disciplinary mentoring is really important.\nHow to become a Woman of Influence Nominations are open for The Australian Financial Review and Westpac 100 Women of Influence Awards. Enter yourself or someone you know in one or more of the 10 categories: board/management, innovation, culture, public policy, business enterprise, diversity, young leader, global, local/regional and social enterprise/not-for-profit.\nEntries close on August 9. Winners will be announced in late September and celebrated at a gala event on October 15, 2015.\nFor more information go to www. 100womenofinfluence.com.au", "external_links": ["http://100womenofinfluence.com.au/"], "published": "2015-07-03T22:15:00.000+03:00", "crawled": "2015-07-04T20:38:23.000+03:00", "highlightTitle": ""}