{"organizations": ["Dixons Carphone PLC"], "uuid": "71814f630d8a3ecf11fa29628a322051cc6167cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-retail/?format=rss", "section_title": "Retail News | Retail Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/retailer-results-top-buy-dixons-095658510.html", "country": "GB", "title": "Which Retailer’s Results Make It A Top Buy? Dixons Carphone PLC vs Sports Direct International Plc", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Which Retailer’s Results Make It A Top Buy? Dixons Carphone PLC vs Sports Direct International Plc", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T12:56:00.000+03:00", "replies_count": 0, "uuid": "71814f630d8a3ecf11fa29628a322051cc6167cd"}, "author": "", "url": "https://uk.finance.yahoo.com/news/retailer-results-top-buy-dixons-095658510.html", "ord_in_thread": 0, "title": "Which Retailer’s Results Make It A Top Buy? Dixons Carphone PLC vs Sports Direct International Plc", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 16, 2015, 11:48 BST - UK Markets close in 4 hrs 42 mins Which Retailer’s Results Make It A Top Buy? Dixons Carphone PLC vs Sports Direct International Plc By Roland Head | Fool.co.uk – 51 minutes ago 728.50 -6.0000 \nThere's little doubt in my mind that Dixons Carphone (LSE: DC) and Sports Direct International (LSE: SPD) are two of the UK's top retail stocks. Today's full-year results from both firms seem to confirm that view. \nDixons Carphone reported a 21% increase in pro-forma adjusted pre-tax profits, which rose to £381m. Sports Direct matched this with a 20.5% increase in underlying pre-tax profits. \nInterestingly, both firms have their critics. Sports Direct founder Mike Ashley's abrasive and unconventional style clashes with more conventional City suits, while the combination of Carphone Warehouse and Dixons was seen as a poor fit by many. \nSo far, both firms' detractors have been proved wrong. Shares in Sports Direct have risen by a staggering 546% over the last five years, during which post-tax profits have risen by 185%. \nDixon Carphone's share price has dialled up a 36% gain since the merger completed last year. \nSuch strong performance does come at a price, however. Based on today's results, Dixons shares trade on a P/E of 18.1, while Sports Direct trades on a P/E of 18.7. \nIn contrast, the FTSE 100 trades on an average of 14.6. With this in mind, is either company a buy after today's results? \nDixons Carphone \nDixons reported a 6% rise in like-for-like revenue over the last year, highlighting the fact that much of the improvement in profits came from cost-savings as a result of combining the two businesses and from disposing of loss-making operations. \nThis helped to provide a worthwhile increase in operating margin, which increased from 4.4% to 4.8% on an adjusted basis. \nShareholders were rewarded with a 42% hike in the total dividend, which rose to 8.5p. That's significantly more than the 7.8p forecast by analysts, but still only gives a yield of 1.8% at today's share price. This is considerably less than the FTSE 100 average of 3.6%. \nWith this in mind, investors in Dixons Carphone need to focus on growth prospects. \nAnalysts' forecasts suggest that both earnings per share and the dividend should rise by 17% 9p in 2015/16, giving a forecast P/E of 16.6 and a prospective yield of 2.0%. \nSports Direct \nIn my view, Sports Direct's results were slightly more impressive than those of Dixons Carphone, although the firm did surprise investors by lowering its profit target for the year ahead to reflect a lack of acquisitions last year. \nAlthough group sales only rose by 4.7%, the firm's gross profit margin rise from 42.7% to 43.8%, while the operating margin rose from 9.2% to 10.4%. \nIn my view, Sports Direct's ability to generate such strong margins while maintaining very competitive in-store prices is one of the company's key advantages. \nAnalysts are forecasting a 16% rise in earnings per share for Sports Direct next year, but as always, there's no dividend. This is my biggest complaint about Sports Direct. Although the firm has proved itself to be good at allocating capital effectively, I think it's now a large enough business to justify paying a dividend. \nToday's top retail buy? \nI believe that both of these firms could still offer decent returns for growth investors. \nOf the two, I'd be tempted to choose Sports Direct, thanks to its high profit margins and strong free cash flow, but it's a close-run decision. \nIf you're considering an investment in any UK retail stock, I'd urge you to take a look at \" 3 Hidden Factors Behind This Daring E-commerce Play \" . \nThe company concerned is in the middle of an aggressive online expansion which the Fool's experts believe could lead to significant profit growth. \nTo find out more, download of this FREE, no-obligation report today! \nIt's simple, FREE and a 'must read' for UK investors. To get your copy, click here now . \nRoland Head has no position in any shares mentioned. The Motley Fool UK has recommended Sports Direct International. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-16T12:56:00.000+03:00", "crawled": "2015-07-16T13:53:43.000+03:00", "highlightTitle": ""}