{"organizations": ["China Stocks Drop With U.S. Futures"], "uuid": "3e2caf7573492bf6a98e9ce3b4ff570715336f22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/euro-holds-drop-greece-deadline-224546630.html?l=1", "country": "GB", "title": "China shares in free fall as contagion fears mount", "performance_score": 1, "site": "yahoo.com", "participants_count": 0, "title_full": "China shares in free fall as contagion fears mount", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T05:10:00.000+03:00", "replies_count": 0, "uuid": "3e2caf7573492bf6a98e9ce3b4ff570715336f22"}, "author": "", "url": "http://finance.yahoo.com/news/euro-holds-drop-greece-deadline-224546630.html?l=1", "ord_in_thread": 0, "title": "China shares in free fall as contagion fears mount", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nick Gentle"], "text": "China Stocks Drop With U.S. Futures as Contagion Fear Boosts Yen By Nick Gentle 7 minutes ago  Content preferences Done \nShanghai and Hong Kong shares plunged, while U.S. equity-index futures dropped amid concern that China’s share rout may spread to the wider economy. The yen gained against all peers as commodities held recent declines. \nThe Shanghai Composite Index fell as much as 8.2 percent by 10:55 a.m. in Tokyo, while a gauge of mainland companies in Hong Kong tumbled 5.1 percent after entering a bear market Tuesday. The MSCI Asia Pacific Index fell 2.1 percent. Standard & Poor’s 500 Index futures lost 0.6 percent, while Treasuries rallied with Japanese bonds. The yen climbed 0.3 percent versus the dollar and 0.5 percent to the euro. Copper was little changed with crude oil. \nMore from Bloomberg.com: Chinese Trade Halts Freeze $1.4 Trillion of Shares Amid Rout \nInvestors are flocking to assets that offer some safety as China’s stock rout and Greece’s possible exit from the euro roil global markets. About 45 percent of China’s listed companies are suspended, leading traders to sell what they can. With Federal Reserve meeting minutes due Wednesday, the twin crises have prompted some investors to push back estimates for when U.S. rates may rise. \n“China’s stock market rout is now spreading to other financial markets, creating a sweeping sense of panic and a liquidity crunch,” Zheng Ge, an analyst at Wanda Futures Co., said by phone in Beijing. \nMore from Bloomberg.com: The Hugely Profitable, Wholly Legal Way to Game the Stock Market PBOC Pledge\nChina’s central bank will provide “ample liquidity” to the nation’s stock market, it said in a statement on its website Wednesday. The People’s Bank of China said it will provide liquidity to the China Securities Finance Corp. and will prevent “systemic” risks. \nNone of the 40 companies on the Hang Seng China Enterprises Index advanced today. BYD Co., the electric-car maker backed by Warren Buffett, plunged more than 20 percent. Mainland developers led declines in the Hang Seng Index, which dropped 4.8 percent. \nMore from Bloomberg.com: Alibaba to JD.Com Plunge as Investors Flee From All Things China \nThe Shanghai Composite has lost almost one-third of its value since June 12 as margin positions that helped propel its world-beating rally unwind. A gauge of technology and smaller shares in the southern city of Shenzhen is down more than 40 percent. The ChiNext index is still up 57 percent this year. \nThe Bloomberg Commodity Index has fallen 4.2 percent in two days, the most since September 2011. The London Metal Exchange Index plunged 4 percent Tuesday, also the most since 2011, on concern that demand from Europe and China, the two biggest consumers of industrial metals, will falter amid the dual crises. \nMore from Bloomberg.com", "external_links": [], "published": "2015-07-08T05:10:00.000+03:00", "crawled": "2015-07-08T05:12:39.000+03:00", "highlightTitle": ""}