{"organizations": ["US Fed"], "uuid": "5de4c5ceec3c61f23a0e7f7679592c684d74ba94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-chemicals/?format=rss", "section_title": "Chemicals News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/london-open-us-fed-pinch-092600433.html", "country": "US", "title": "London open: US Fed in a pinch with CPI set to drop", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "London open: US Fed in a pinch with CPI set to drop", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T13:06:00.000+03:00", "replies_count": 0, "uuid": "5de4c5ceec3c61f23a0e7f7679592c684d74ba94"}, "author": "", "url": "https://uk.finance.yahoo.com/news/london-open-us-fed-pinch-092600433.html", "ord_in_thread": 0, "title": "London open: US Fed in a pinch with CPI set to drop", "locations": ["London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "5.35 0.00 \nLONDON (ShareCast) - (ShareCast News) - Stocks in London continued to bounce back ahead of Wednesday's policy decision from the US Federal Reserve, as some analyst warned of deflation risks. Even (Taiwan OTC: 6436.TWO - news ) the Shanghai Stock Exchange's Composite Index finished higher overnight, rising by 3.44% to reach 3,789.19 points. Gains were also evident in some of the assets which have been most battered over recent weeks, such as emerging market stocks or the Russian rouble. \nAgainst that backdrop, as of 08:57 the Footsie was higher by 40.60 points to stand at 6,595.88. \nOil was the odd one out, with Bret oil futures moving lower by 0.97% to $52.79 per barrel out on the ICE. \nFed rate-setters in a pinch According to the minutes of the April meeting of the Federal Open Market Committee, most rate-setters in the US prefer not to guide markets too much, especially when it comes to the first rate hike in the cycle - possibly due to the volatility that the first move might trigger. \nHowever, the recent move lower in commodity prices might force the Fed's hand and make it tweak its statement so as to at least note that development, Jim Reid from Deutsche Bank (Xetra: 514000 - news ) said. Indeed, the Fed is in a bit of a pinch, as core inflation is expected to remain around 2% but headline consumer inflation drops. \n\"As DB's Joe LaVorgna points out the current -29% year-over-year drop in the CRB index implies YoY headline CPI (Other OTC: CPICQ - news ) inflation falling from 0.1% to -0.9% (all other things being equal) over the next couple of months, which would be the largest year-over-year drop since September 2009 (-1.3%) and one of the lowest prints in modern history. \n\"However core YoY CPI inflation is likely to edge above 2% in the months ahead which complicates matters. So the Fed have plenty to think about but today they'll likely defer the decision,\" Reid explained. \nActing as a backdrop, global deal-making among companies or so-called M&A activity was set to beat its previous record, set in the summer of 2007, when $944.3bn of transactions were proposed, according to Bloomberg data. \nForeigners keep scooping up London property Quintain Estates surged 22% on Wednesday after the company confirmed that it was in talks with Bidco - an investment vehicle directly controlled by Lone Star Real Estate Fund - over a takeover deal. Under the terms of the offer, Quintain shareholders will receive 131p in cash for each Quintain share, which values the entire issued, and to be issued, share capital of the company on a fully-diluted basis at around £700m. \nBarclays (LSE: BARC.L - news ) first half results showed an 11% increase in adjusted profit before tax as it set aside a further £1.6bn provision for further litigation and mis-selling after paying £1.6bn in the period. The bank's Tier 1 capital stood at 11.1% with risk weighted assets decreasing to £57bn from £75bn. \nBritish American Tobacco posted a rise in first-half profit, although revenue for the period was dented by currency moves. The company, which owns Dunhill and Lucky Stripe, said net profit for the year to 30 June came in at £2.65bn, up from £1.75bn and better than consensus expectations for £2.44bn. Cigarette volume was down 2.9%. \nCapita (LSE: CPI.L - news ) posted an 11% rise in underlying first-half pre-tax profit as most of it divisions performed well, with particularly strong growth in Asset Services Solutions and a pleasing initial contribution from Capita Europe. For the six months ended 30 June, underlying pre-tax profit came in at £264.9m, up from £238m in the same period last year, on revenue of £2.28bn, up 10% from £2.07bn. \nSt James's Place said an increase in levies impacted its first half earnings, as it posted underlying profit before shareholder tax at £72.9m for the six months to June 2015, about 7% lower than the same period last year. The UK based wealth management business declared a 20% increase in interim dividend despite this. \nHousebuilder Taylor Wimpey said it will return £300m in dividends to shareholders, as it posted a 33.4% rise in pre-tax profit following a strong selling season in spring and early summer. For the period ended 28 June, profit before tax and exceptional items came in at £238m from £178.4m in the first half of last year, on revenue of £1.34bn, up 12.2% from £1.19bn. Analysts had been expecting the company to post a pre-tax profit of around £221m. \nMarket Movers techMARK 3,162.00 +0.64% FTSE 100 6,600.91 +0.70% FTSE 250 17,507.03 +0.69% FTSE 100 - Risers Hikma Pharmaceuticals (LSE: HIK.L - news ) (HIK) 2,396.00p +3.23% British American Tobacco (BATS) 3,655.50p +2.93% Barclays (Swiss: BARC.SW - news ) (BARC) 286.10p +2.32% CRH (CRH (NYSE: CRH - news ) ) 1,885.00p +1.89% ITV (ITV (LSE: ITV.L - news ) ) 274.50p +1.59% Imperial Tobacco Group (IMT) 3,329.00p +1.31% Pearson (Amsterdam: PR8.AS - news ) (PSON) 1,189.00p +1.28% Experian (Amsterdam: EP8.AS - news ) (EXPN) 1,169.00p +1.21% BT Group (LSE: BT-A.L - news ) (BT.A) 471.25p +1.21% Hargreaves Lansdown (LSE: HL.L - news ) (HL (Shenzhen: 002105.SZ - news ) .) 1,167.00p +1.21% FTSE 100 - Fallers Compass Group (Other OTC: CMPGF - news ) (CPG) 1,042.00p -4.05% RSA Insurance Group (RSA) 506.50p -2.31% Antofagasta (LSE: ANTO.L - news ) (ANTO) 577.00p -1.54% Capita (CPI) 1,270.00p -1.24% St James's Place (STJ) 950.50p -0.78% Taylor Wimpey (LSE: TW.L - news ) (TW.) 182.30p -0.22% Royal Mail (LSE: RMG.L - news ) (RMG) 485.90p -0.16% Johnson Matthey (LSE: JMAT.L - news ) (JMAT) 2,844.00p -0.14% Travis Perkins (LSE: TPK.L - news ) (TPK) 2,182.00p -0.14% Whitbread (WTB) 5,135.00p -0.10% FTSE 250 - Risers Rightmove (RMV) 3,596.00p +6.08% Greggs (GRG) 1,251.00p +5.66% Foxtons Group (LSE: FOXT.L - news ) (FOXT) 234.20p +5.02% Diploma (DPLM) 800.00p +4.58% Tate & Lyle (LSE: TATE.L - news ) (TATE) 533.00p +4.31% Jupiter Fund Management (JUP) 460.40p +4.30% Man Group (LSE: EMG.L - news ) (EMG) 157.50p +4.30% Dignity (Frankfurt: DN8E.F - news ) (DTY) 2,452.00p +3.46% Renishaw (RSW) 2,030.00p +3.36% Indivior (Berlin: 2IV.BE - news ) (INDV) 267.30p +3.09% FTSE 250 - Fallers Premier Farnell (LSE: PFL.L - news ) (PFL) 150.90p -9.42% Hellermanntyton Group (LSE: HTY.L - news ) (HTY) 324.00p -2.64% Pets at Home Group (PETS) 280.70p -2.53% Jimmy Choo (LSE: CHOO.L - news ) (CHOO) 168.80p -1.75% Synergy Health (Other OTC: SYHEF - news ) (SYR) 1,670.00p -1.30% Lancashire Holdings Limited (Other OTC: LCSHF - news ) (LRE) 662.50p -1.27% John Laing Group (Frankfurt: JL0.F - news ) (JLG) 217.50p -1.05% Shawbrook Group (LSE: SHAW.L - news ) (SHAW) 332.00p -0.81% Redefine International (RDI) 53.05p -0.75% Morgan Advanced Materials (Other OTC: MCRUF - news ) (MGAM) 338.30p -0.62%", "external_links": [], "published": "2015-07-29T13:06:00.000+03:00", "crawled": "2015-07-29T13:20:05.442+03:00", "highlightTitle": ""}