{"organizations": ["NYSE"], "uuid": "b7c7a55c573a258143933803b1de6b6200c4df13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/r9wGGLQ6hM.usl5gEUo9gw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/185bcdd02c847adeaf07bed3bdc7fb101280f239_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/outage-shows-nyses-shrinking-impact-014748203.html", "country": "GB", "title": "Outage shows NYSE's shrinking impact on stocks", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Outage shows NYSE's shrinking impact on stocks", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T04:47:00.000+03:00", "replies_count": 0, "uuid": "b7c7a55c573a258143933803b1de6b6200c4df13"}, "author": "", "url": "https://uk.finance.yahoo.com/news/outage-shows-nyses-shrinking-impact-014748203.html", "ord_in_thread": 0, "title": "Outage shows NYSE's shrinking impact on stocks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 10, 2015, 03:05 BST - UK Markets open in 4 hrs 55 mins Outage shows NYSE's shrinking impact on stocks By Charlotte Raab | AFP – 17 minutes ago View Photo \n\nWhen the New York Stock Exchange halted trade this week, broadcasters showed images of brokers on the legendary exchange floor suddenly stopping orders. \nYet screens used by investors everywhere continued to flash new trade prices in red and green for ExxonMobil, JPMorgan Chase (Swiss: JPM.SW - news ) and other NYSE blue chip stocks, as fresh transactions were executed on other platforms, including the Nasdaq, the NYSE's cross-town rival. \nThe nearly four-hour outage underscored just how diminished the once world-leading power of the NYSE's trading floor has become. \n\"It shows how the floor exchange of the NYSE has lost its preeminence,\" said Gregori Volokhine, president of Meeschaert Capital Markets. \n\"Today the NYSE accounts for perhaps 15 percent of stock trades,\" Volokhine said. \"All the rest are on other exchanges.\" \nUS securities regulators have granted licenses to 26 exchanges in all, including the BATS Exchange, the Miami International Securities Exchange and the Arizona Stock Exchange, and their electronic platforms make it less and less important where trades take place. \nWednesday's shift in trading of the shares of hundreds of NYSE-listed companies to these other platforms was \"seamless,\" said Themis Trading. \n\"Many of us at Themis, as well as our clients, remarked how smooth and uneventful the 'NYSE glitch' was that was dominating the media airwaves,\" the brokerage said in its blog. \nOn Thursday, the NYSE linked the stoppage, which ran at peak trading hours from about 1530 GMT until 1910 GMT, to a bumpy rollout of new software. \nThe exchange decided to suspend trade after customers reported \"unusual system behavior,\" it said. \nEven (Taiwan OTC: 6436.TWO - news ) as other exchanges have proliferated, the NYSE has remained a potent symbol of capitalism with its iconic column-fronted building near Wall Street. \nThe outage was a \"non-issue for most low-frequency traders\" who could shift trades to other exchanges, Themis said. \nHowever, Themis said it likely had a greater impact on high-frequency traders, who can place orders for millions of shares and make cancellations and revisions in \"sub-second time periods.\" \nMoreover, the outage had the potential to cause much more profound disruption if the NYSE had been unable to reopen before the 2000 GMT close. \nClosing New York Stock Exchange prices are widely used to price mutual funds and portfolio statements, among other investment vehicles. \nThe impact would also have been more significant on a busier day in terms of market-moving news, such as a major Federal Reserve announcement or a rebalancing of an index. \n\"And while most of you can easily afford to sit back and watch, and not play during a period of mayhem, some industry players will not know their trading positions,\" Themis said. \"And that uncertainty will exacerbate the outcome.\"", "external_links": [], "published": "2015-07-10T04:47:00.000+03:00", "crawled": "2015-07-10T05:06:23.000+03:00", "highlightTitle": ""}