{"organizations": ["FPB", "Sanef", "IAB SA"], "uuid": "bd3cabb844662ec219eede6f944afa55beb9d3d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507091657.html", "country": "US", "title": "South Africa: Rethink Over SA Internet Censorship", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Rethink Over SA Internet Censorship", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T17:01:00.000+03:00", "replies_count": 0, "uuid": "bd3cabb844662ec219eede6f944afa55beb9d3d3"}, "author": "", "url": "http://allafrica.com/stories/201507091657.html", "ord_in_thread": 0, "title": "South Africa: Rethink Over SA Internet Censorship", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Instead, on Monday the FPB, the PCSA, the South African National Editors' Forum (Sanef), and the Interactive Advertising Bureau of South Africa (IAB SA) met to discuss the implications of the regulations and resolved to present a revised press code. \nBut the new policy is not yet final as there is ongoing discussion with stakeholders. \n\"We hope it's set in stone. The FPB Chair has said it in two meetings now,\" Andrew Allison, head of the Regulatory Affairs for the IAB, told Fin24. \nThe revised press code is making its way through a public participation process that could see the rules being eventually implemented. \nThe FPB, though, has not officially abandoned their draft policy to classify online content in SA, Allison said. \n\"It doesn't mean that they've backed down. What they're doing is consulting with a wide range of stakeholders. They're gathering perspectives from different industry bodies,\" Allison told Fin24. \nThe revised code is expected to differentiate from the FPB proposals in that PCSA members will be regulated for print and online content. \nComplaints \nThe PCSA has been working closely with the IAB to ensure that complaints relating to digital content are dealt with. \nThe IAB said the FPB has further indicated that it would not seek to regulate content published by the online divisions of print publishers as well as content from producers such as Fin24 sister publication News24 which only operates online. \nThe FPB sparked controversy in 2012 when it classified artist Brett Murray's painting The Spear which depicted President Jacob Zuma with exposed genitals as \"16N\". \nThe classification prevented a number of outlets from publishing the art work, triggering accusations that the FPB was acting under government pressure. \nAllison said that the IAB will continue to lobby the FPB over its regulations along with other stakeholders. \n\"Our position is that the FPB's draft online regulation policy is flawed and we will be making written submissions by next Wednesday 15 July around the policy in its current form.\" \nSource: Fin24", "external_links": [], "published": "2015-07-09T17:01:00.000+03:00", "crawled": "2015-07-09T17:58:49.000+03:00", "highlightTitle": ""}