{"organizations": [], "uuid": "8d4643e0e78855ff5c40655ebc226deac0acd9d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arabianbusiness.com", "main_image": "http://www.arabianbusiness.com/incoming/article598129.ece/BINARY/476608279.jpg", "site_section": "http://www.arabianbusiness.com//industries/banking-finance/?service=rss", "section_title": "Arabian Business - Banking & Finance", "url": "http://www.arabianbusiness.com/prince-alwaleed-gift-10-000-homes-cars-saudis-in-need-598470.html", "country": "US", "title": "Prince Alwaleed to gift 10,000 homes, cars to Saudis in need", "performance_score": 0, "site": "arabianbusiness.com", "participants_count": 0, "title_full": "Prince Alwaleed to gift 10,000 homes, cars to Saudis in need", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T15:50:00.000+03:00", "replies_count": 0, "uuid": "8d4643e0e78855ff5c40655ebc226deac0acd9d5"}, "author": "", "url": "http://www.arabianbusiness.com/prince-alwaleed-gift-10-000-homes-cars-saudis-in-need-598470.html", "ord_in_thread": 0, "title": "Prince Alwaleed to gift 10,000 homes, cars to Saudis in need", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alwaleed"], "text": "Prince Alwaleed to gift 10,000 homes, cars to Saudis in need Article By Staff writer Saturday, 4 July 2015 4:50 PM \nAlwaleed Philanthropies, the foundation of Saudi billionaire Prince Alwaleed which will channel his $32 billion fortune to charities, on Saturday announced it is to provide 10,000 homes and cars to Saudi citizens in need. \nPrince Alwaleed Bin Talal Bin Abdulaziz Alsaud said in a statement that the move was being made as \"an expression of his gratitude to the Saudi nation and its people\". \nThe two Alwaleed Philanthropic projects will provide 10,000 housing units in addition to granting Saudis 10,000 cars. \nThe gifts will bring the total number of beneficiaries among Saudi men and women to 100,000 in the last 10 years, the statement said. \nThe housing units will be distributed on an average of 1,000 units per year to beneficiaries who do not qualify for housing under the Housing Ministry's system. The cars will be distributed over a similar time period. \n\"Affording a home is a major concern for most Saudi citizens nowadays. It has become a big burden weighing on the family's budget, especially given that Saudi families are mostly young, small and with very limited means,\" the statement added. \nIn regard to the initiative of granting 10,000 cars, the Foundation said it believes that they should go to the families which have no transportation means. \n\"By providing a car and a house, those expenses would be spared and each family's other disposable income would be increased,\" the statement said. \nLast week, Prince Alwaleed pledged to gradually give his entire $32 billion fortune to charity. The cash will be channelled through his Alwaleed Philanthropies foundation to charities including those that promote health, disease eradication, disaster relief and women's rights, he told a news conference in Riyadh. \nIt also comes in the wake of pledges by other vastly wealthy businessmen in recent years to dedicate often huge parts of their personal fortunes to good causes, including Bill Gates, George Soros and Jack Ma. \nAlwaleed Philanthropies has been working for 35 years on launching humanitarian projects and supporting them in more than 92 countries.", "external_links": [], "published": "2015-07-04T15:50:00.000+03:00", "crawled": "2015-07-04T23:36:29.000+03:00", "highlightTitle": ""}