{"organizations": [], "uuid": "359c46fed131fabfc16fb85c0d2c88fa616c4432", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Vijender015715.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/sports-stars-take-the-moolah-others-left-penniless-in-haryana/42785.html", "country": "IN", "title": "Sports stars take the moolah, others left penniless in Haryana", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Sports stars take the moolah, others left penniless in Haryana", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T14:20:00.000+03:00", "replies_count": 0, "uuid": "359c46fed131fabfc16fb85c0d2c88fa616c4432"}, "author": "Jaideep Sarin (IANS)", "url": "http://www.moneylife.in/article/sports-stars-take-the-moolah-others-left-penniless-in-haryana/42785.html", "ord_in_thread": 0, "title": "Sports stars take the moolah, others left penniless in Haryana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Sports stars take the moolah, others left penniless in Haryana 42785 Sports stars take the moolah, others left penniless in Haryana 0 Comments, Be the first to comment Jaideep Sarin (IANS) | 15/07/2015 04:50 PM | The revelation has come from Haryana's sports department itself before the Punjab and Haryana High Court Encouraging medal-winning international sports stars from Haryana is seeing other sportspersons in the state losing out. The revelation has come from Haryana's sports department itself before the Punjab and Haryana High Court. The Haryana government, which has been showering largesse on medal winners of international sporting winners, has admitted that all funds have been exhausted in giving cash rewards and other prizes to winners of Commonwealth Games and other events. It has further admitted that release of money to other international, national and state-level athletes has not been done for want of funds. Bhupinder Singh Hooda's previous Congress government in Haryana (2005-2014), under its policy of promoting sports, had given away millions of rupees to sports stars from the state who won medals at the Olympics, the Asian Games and the Commonwealth Games. The admission by the state government came in response to a public suit filed by high court lawyer H.C. Arora. The petition had sought directions to the state government to release cash awards to medal winners at state- and national-level championships. \"The budget for giving cash awards to sportspersons was exhausted on medal winners of the CWG. The proposal for giving cash awards to medal winners of state/national/international competitions is pending for approval of the higher authorities and money would be disbursed after getting the go-ahead,\" Haryana's additional director-sports O.P. Sharma told the high court in an affidavit. The petitioner had pointed out the cases of athletes Sudesh, Poonam, Ritu and Sheetal of Kaithal, who had won medals in national and state level School Games in 2013-14 and were entitled to cash awards of Rs.15,000, Rs.10,000 and Rs.7,000 for gold, silver and bronze medals respectively. They were also entitled to a monthly scholarship. The petition pointed out that the families of the medal-winning athletes did not have a sound financial status and the players had to spend money from their own pockets to participate in sporting events. Hooda had distributed huge cash rewards, given jobs in police and other departments and distributed luxury cars like Audis and SX-4s, smartphones, land for sports academies, stadiums for villages of sportspersons and hundreds of kilograms of 'desi ghee'. Between 25 and 30 percent of all medal-winning sportspersons for the country in the Olympics, Asian Games and Commonwealth Games in recent years had a Haryana connection. In the 2010 Delhi Commonwealth Games, out of 101 medals won by India, 35 were claimed by players from Haryana. In the 2014 Glasgow CWG, out of India's 64 medals, 22 were bagged by Haryana players. In the 2012 London Olympics, the 83-member Indian contingent had 19 players from Haryana. Out of the six medals (2 silver, 4 bronze) won, Haryana's players bagged four. Boxers like Vijender Singh, Akhil Kumar and Jitender Kumar, wrestlers like Sushil Kumar, Yogeshwar Dutt and discuss thrower Krishna Punia are all from Haryana. Even players from other places like wrestler Sushil Kumar (Delhi), badminton ace Saina Nehwal (Hyderabad) and shooter Gagan Narang (Hyderabad), who had family connections with Haryana, benefitted from the cash and other rewards. Hooda, who himself is a badminton and tennis enthusiast and plays regularly, did not miss any opportunity to honour sportspersons. His government enhanced cash rewards for winners of gold, silver and bronze medals in the next Olympic Games to Rs.5 crore, Rs.3 crore and Rs.2 crore . The rewards were also enhanced for the Asian Games and the Commonwealth Games. In the past decade, 14,901 sportspersons got cash rewards of nearly Rs.82 crore from the Hooda government, while Rs.700 crore was spent on sports and sportspersons in this period. More in Moneylife", "external_links": [], "published": "2015-07-15T14:20:00.000+03:00", "crawled": "2015-07-15T14:36:23.000+03:00", "highlightTitle": ""}