{"organizations": ["Airbus Group", "Thomson Reuters People"], "uuid": "b49b212a8f9cc4c65efc521de75d18216af7a13e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static6.businessinsider.com/image/55941df35afbd3a27d8b4568/airbus-signs-deal-for-china-cabin-completion-plant.jpg", "site_section": "http://feeds.feedburner.com/TheMoneyGame", "section_title": "Finance", "url": "http://www.businessinsider.com/the-welding-industry-is-facing-a-big-labor-shortage-2015-7", "country": "US", "title": "Airbus signs deal for China cabin-completion plant", "performance_score": 0, "site": "businessinsider.com", "participants_count": 0, "title_full": "Airbus signs deal for China cabin-completion plant", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T17:38:00.000+03:00", "replies_count": 0, "uuid": "f3bc5121b45d45652386c794d7388f24d3af5116"}, "author": "", "url": "http://www.businessinsider.com/r-airbus-signs-deal-for-china-cabin-completion-plant-2015-7", "ord_in_thread": 0, "title": "Airbus signs deal for China cabin-completion plant", "locations": ["Colomiers", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thomson Reuters People are silhouetted past a logo of the Airbus Group during the Airbus annual news conference in Colomiers \nTOULOUSE, France (Reuters) - Airbus signed an agreement on Thursday to set up its second plant on Chinese soil in a deal that the European planemaker hopes will lead to lucrative new plane orders. \nThe 150-million-euro plant will be placed alongside an existing assembly line for smaller A320 jetliners in the northern port city of Tianjin from late 2017. It will be responsible for completing cabin work on large A330 jetliners. \nThe contract was signed during a visit by Chinese Prime Minster Li Keqiang to the planemaker's headquarters in Toulouse, along with two other deals on the production of cabin equipment and fasteners for assembling plane parts. \nIt came 48 hours after China agreed to buy 45 similar jets worth over $11 billion, with plans for a possible further 30, and could lead to further orders in the future. \nDespite a slowdown in its economy, China is the world's fastest-growing aviation market, with a surge in outbound travelers fuelling the expansion. \nIt is projected to order a total of 5,300 jetliners over the next 20 years. \nAirbus hopes the increased presence in China will lead to more demand for its profitable but aging wide-body A330, which is due to be revamped with new engines soon to boost sales. \nAirbus opened its first non-European aircraft assembly plant in Tianjin in 2009 and extended the co-operation venture with Chinese interests to 2025, in a fresh agreement last year. \nIt also plans to inaugurate another non-European assembly plant for A320 jets in Mobile, Alabama, in September. \nNegotiations to set up the new wide-body cabin completion center at Tianjin took longer than expected, partly due to a trade row between China and the European Union over airline emissions that was settled last year. \nThere were also tough negotiations over the number planes to be purchased by China in exchange for the factory investment. \nAirbus had originally hoped to more than double its existing Chinese fleet of about 150 A330s by offering a regional version especially tailored for the domestic market. \nAirbus has been locked in a fierce battle with Boeing for that slice of the busy Chinese market. \nBut the current agreement for as many as 75 jets, which could eventually be raised to around 100, ensures valuable production for the A330 as Airbus seeks to maintain a reliable source of cash for other developments. \n(Reporting by Tim Hepher, Joanna Decorse; editing by Mark John) Read the original article on Reuters . Copyright 2015. Follow Reuters on Twitter . More from Reuters:", "external_links": [], "published": "2015-07-02T17:38:00.000+03:00", "crawled": "2015-07-02T18:20:25.000+03:00", "highlightTitle": ""}