{"organizations": [], "uuid": "af24beea619fc05821ec38e45db28df238da02dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oneindia.com", "main_image": "http://www.oneindia.com/img/2015/07/01-1435758681-rahul-yadav.jpg", "site_section": "http://news.oneindia.in/rss/news-business-fb.xml", "section_title": "India Business News, Latest Finance News Headlines, Indian Stock Market & economic news", "url": "http://www.oneindia.com/business/housing-com-sacks-ceo-rahul-yadav-1793923.html", "country": "IN", "title": "Housing.com sacks CEO Rahul Yadav", "performance_score": 0, "site": "oneindia.com", "participants_count": 0, "title_full": "Housing.com sacks CEO Rahul Yadav", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T14:06:00.000+03:00", "replies_count": 0, "uuid": "af24beea619fc05821ec38e45db28df238da02dc"}, "author": "", "url": "http://www.oneindia.com/business/housing-com-sacks-ceo-rahul-yadav-1793923.html", "ord_in_thread": 0, "title": "Housing.com sacks CEO Rahul Yadav", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rahul Yadav"], "text": "Housing.com sacks CEO Rahul Yadav Updated: Wednesday, July 1, 2015, 19:25   \nNew Delhi, Jul 1: Realty portal Housing.com's board today sacked its CEO and co-founder Rahul Yadav with immediate effect, saying that his behaviour towards investors and media was not \"befitting\" of a CEO. \nYadav will not be an employee or part of the SoftBank backed portal in any manner, the company said. Rahul Yadav \n\"Housing.com has released its CEO Rahul Yadav, with immediate effect, after a regular board meeting, held earlier today,\" it said in a statement. \n\"Yadav who is also the co-founder of the company, will no longer be an employee of Housing and be associated with the company in any manner, going forward,\" it added. \n[ After a storm on Twitter, Housing.com CEO Rahul Yadav withdraws resignation ] \nThe board, unanimously agreed to bring Yadav's tenure to a close, with reference to \"his behaviour towards investors, ecosystem and the media\". \n\"The Board believed that his behaviour is not befitting of a CEO and is detrimental to the company, known for its innovative approach to product development, market expansion and brand building,\" the statement said. \nYadav has been in the thick of a controversy after he put in his papers questioning the intellectual capability of his company's board. Later, he apologised to the members. \nLast month, he hogged the limelight again when he gave away all his holding, worth about Rs 200 crore, in the company to the employees. In December, Housing.Com had raised USD 90 million through private equity infusion from SoftBank Group along with Falcon Edge and other existing investors. \nWhile the search for an interim CEO is underway, Housing.com said, a transition plan has been put in place. \n\"The current senior executives of Housing will continue to run the operations on a daily basis, and ensure its continued smooth functioning. The Board and the Operating Committee will remain closely involved with all key decisions,\" it said. \nThe board, investors, management team and employees are keen to see Housing maximise its huge potential in India and beyond, as well as run in professional and world class manner, the company said. \nThe Board thanked Yadav for his contributions and wished him well, for his future endeavours. Within two years of its founding, the company expanded from its original rent and resale proposition to include PGs and hostels, serviced apartments, land, plot projects, and new projects. \nHousing.com has more than 2,551 employees in over 100 cities across India. \nPTI", "external_links": [], "published": "2015-07-01T14:06:00.000+03:00", "crawled": "2015-07-02T04:29:52.000+03:00", "highlightTitle": ""}