{"organizations": [], "uuid": "e64e9fde44705e70bbe5a68bd8928fc4a4d90e54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/i/g/i/n/image.related.afrArticleLead.620x365.giglai.png/1437634962917.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/how-to-get-more-control-over-your-superannuation-in-your-30s-20150723-giglai", "country": "AU", "title": "How to get more control over your superannuation, in your 30s", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How to get more control over your superannuation, in your 30s | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T10:33:00.000+03:00", "replies_count": 0, "uuid": "e64e9fde44705e70bbe5a68bd8928fc4a4d90e54"}, "author": "Sam Henderson", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/how-to-get-more-control-over-your-superannuation-in-your-30s-20150723-giglai", "ord_in_thread": 0, "title": "How to get more control over your superannuation, in your 30s", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Selling a bathroom to pay your bills is not possible, so diversification into liquid assets such as shares or cash may be better in the long run. by Sam Henderson\nIf you still have decades before you retire, but want to maximise your super - what is the best thing to do?\nQ: I will be retiring, hopefully, in four years and investing my super to buy a property. Could I withdraw all my super and still be eligible for a pension, and do I have to pay any taxes?\nA: Superannuation is a concessionally taxed savings structure designed to fund your retirement. So why would you not invest into property via your super fund (a self-managed superannuation fund only) if you are so convinced property is a good investment? By doing this you may avoid capital gains tax, income tax and earnings tax in retirement when you're over 60 under the current legislation.\nAdmittedly, I'm not a fan of property in retirement owing to the low net cash flows and high ongoing costs including vacancy periods, strata fees, agent fees, land tax, maintenance, utilities and possible interest if you have borrowings. Remember, negative gearing without an income makes very little sense – that's a liability not an asset unless it goes up in value.\nConsider a parcel of CBA shares, or ideally a balanced portfolio of shares, that pays a 6 to 8 per cent after-tax dividend without costs and including franking credits as an example of an alternative investment. That's a 100 per cent improvement on income and when you're retired, income is king. Just ask those people still sitting in cash for the past seven years who have taken a 65 per cent income reduction owing to falling term deposit returns.\nI see very few property investors who make net cash flows over about 3 per cent a year from residential property investment. Selling a bathroom to buy a new car or pay your bills is not possible, so diversification into liquid assets such as shares or cash will be necessary in any case.\nDo your research and consider alternatives before you take the plunge, otherwise stick with your default balanced super fund.\n In your 50s maximise concessions Q: I would like to retire at 61. I am 53. Should I be putting as much as I can afford into super? I do not want to invest in property, but I would like to retire on the Sunshine Coast with no mortgage.\nA: At 53, superannuation should be a key focus thanks to the attractive tax benefits and the imminent opportunity to start a transition to retirement strategy (probably at 57 for you, as the preservation age has already begun its progression to age 60).\nI'd suggest you maximise your concessional (pre-tax) contributions to super at up to $35,000 a year. If you have the cash flow, also consider some after-tax (non-concessional) contributions. You can contribute up to $180,000 a year (or $540,000 under a rule that allows you to bring forward two years of contributions and make three years of contributions in one). My advice would be to maximise concessional contributions, but if you do have mortgage debt on your principal residence, also make that a focus and split your commitment.\nRemember if you are earning more than $300,000, you may also pay an additional 15 per cent contributions tax under the Division 293 rules.\nHow much before I take over? Q: I'm fairly young (32) and have my super in an industry super fund. I'd like a bit more control over what shares I'm in but I can only adjust asset classes. What balance do you have to have to make an SMSF worthwhile? I have $100,000 as my current balance. Should I keep saving more before I move to an SMSF?\nA: Great effort on your super savings and well done for thinking ahead! The Australian Taxation Office likes to think a balance of about $200,000 is a good benchmark to start an SMSF. Remember, if you have a partner, you can get closer to that figure by combining super savings.\nThere is no legislation or regulatory requirement to have a certain dollar amount in your super. But consider the ongoing costs of the fund, which will be about $2000 to $3000 a year (including all of the administration, tax returns and audit), or about 1 per cent of the fund's value. This is comparable to the cost of an industry or retail fund. That percentage fee should drop as your funds grow, of course, since the administration and taxation should be a fixed amount.\nAlso consider how much you will be putting into super and how fast it is likely to grow to $200,000 or more. I have clients in their late 20s who started an SMSF with $120,000 but both partners are maximising their $30,000 a year concessional contributions. They are also seeking control, flexibility and the ability to purchase property, which would not be possible in an industry, corporate or retail fund.\nAt 32, you have at least 28 years until you access your super, although I'd suggest that may increase with potential changes to superannuation law. Your legislative risk is high – that is, the chance of superannuation being tinkered with by successive governments seeking to raise revenue as superannuation balances total more than $2 trillion and budget deficits blow out.\nFinally, before you take the plunge consider alternatives such as the many industry funds that now allow investment into direct shares and exchange-traded funds at some very sharp brokerage rates. Industry funds must be a strong consideration until you pass the magic $200,000 mark.\nFinancial planner Sam Henderson, chief executive of Henderson Maxwell, will be answering your questions while veteran Australian Financial Review DIY super columnist John Wasiliev is on indefinite medical leave. To submit a question, please email: smartmoneyquestions @fairfaxmedia.com.au . Readers wanting to pass on their best wishes to John can do so by emailing dcleveland@fairfaxmedia.com.au .", "external_links": [], "published": "2015-07-23T10:33:00.000+03:00", "crawled": "2015-07-23T17:09:04.304+03:00", "highlightTitle": ""}