{"organizations": [], "uuid": "43c18c1a8b8af2018c3cb122ec8e003e450745a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-12/puerto-rico-confronts-bondholders-as-debt-talks-turn-contentious", "country": "US", "title": "Puerto Rico Confronts Bondholders as Debt Talks Turn Contentious", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Puerto Rico Confronts Bondholders as Debt Talks Turn Contentious - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T07:00:00.000+03:00", "replies_count": 0, "uuid": "43c18c1a8b8af2018c3cb122ec8e003e450745a1"}, "author": "Michelle Kaske", "url": "http://www.bloomberg.com/news/articles/2015-07-12/puerto-rico-confronts-bondholders-as-debt-talks-turn-contentious", "ord_in_thread": 0, "title": "Puerto Rico Confronts Bondholders as Debt Talks Turn Contentious", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you thought Greece’s negotiations with its creditors were ugly, just wait for the reception Puerto Rico officials will receive after saying they want to restructure their $72 billion debt load.\nMore than 300 participants ranging from institutional investors to hedge funds to bond insurers are scheduled to attend Monday’s presentation in New York explaining why the Caribbean island cannot repay all of its obligations on time. Complicating matters is a push by commonwealth officials to seek federal assistance and even changes in bankruptcy laws.\n“It will be a very protracted battle given Puerto Rico lacks a mechanism for restructuring like Chapter 9,” Peter Hayes, head of municipal debt at BlackRock Inc., which manages $114 billion of the securities, including Puerto Rico debt, said in an e-mail. “There is likely to be a multitude of lawsuits given the unlikely event creditors are acceptable to terms to be proposed by Puerto Rico.”\nThe New York-based firm plans to attend the meeting, Jessica Greaney, a spokeswoman for BlackRock, said in an e-mail. A link to a live Internet stream of the meeting will be available on the Government Development Bank’s website. The bank works on the island’s debt sales and lends to the commonwealth and its localities.\nExchange Proposal Governor Alejandro Garcia Padilla said in a June 29 televised speech that he will seek to postpone debt repayment for “a number of years,” and directed island officials to craft a restructuring plan by Aug. 30. A report from three former International Monetary Fund economists made public last week suggests that Puerto Rico swap current bonds for new ones with later maturities and lower payments. The report will serve as a focal point during the 3 p.m. meeting at Citigroup Inc.’s offices on Park Ave.\nOppenheimerFunds Inc., the largest U.S. mutual-fund investor of Puerto Rico securities disagrees. Sales-tax collections, unemployment and income growth show the economy is strong enough for the government to repay, its money managers said on a conference call last week.\nGarcia Padilla’s comments leaves the $3.6 trillion municipal-bond market wondering how much of the island’s debt will be altered, for how long and which credits with undergo change. The island’s constitution stipulates the government must repay general obligations before other expenses and sales-tax bonds are backed by a dedicated revenue stream.\nCompeting Agendas “It has the potential to get ugly,” said Craig Brandon, a portfolio manager at Eaton Vance Management, which oversees about $29 billion of munis, including Puerto Rico. “Everyone has a different agenda and everyone has a different endpoint of where they want to get to.”\nThe Boston-based firm plans to attend the meeting, Robyn Tice, a spokeswoman for Eaton Vance, said in an e-mail.\nThe island of 3.5 million racked up the highest debt per capita in the U.S. as the commonwealth and its agencies borrowed for years to fix budget deficits as its economy shrank almost every year since 2006. That was the final year of a 10-year phaseout of an incentive that had offered businesses outside Puerto Rico tax-free U.S. income for operations on the island.\nTax Exemption As the unemployment rate grew and residents began to leave the island for jobs on the U.S. mainland, investors were still eager to lend to Puerto Rico, with its securities tax-free nationwide and offering yields higher than comparable investments. The commonwealth faces a cash crunch and lenders have effectively shut the door on more borrowing, leaving it wondering how it will repay all of its obligations.\nPuerto Rico securities have been trading at distressed levels for two years on concern the island wouldn’t be able to repay its obligations on time and in full. The three largest credit-rating companies slashed the island to junk in February 2014 and deeper downgrades followed.\nCommonwealth general obligations maturing July 2035 and initially sold in March 2014 at 93 cents on the dollar -- the most actively-traded island debt in the past three months -- changed hands Monday at an average 70.3 cents on the dollar, for a yield of about 12 percent, data compiled by Bloomberg show. The debt fell to as low as 66.6 cents on June 30, with a yield of 12.6 percent, the day after the governor’s televised speech.\nShrinking Population Investors will have to compromise given the commonwealth’s troubles, Anne Krueger, a former IMF official and one of the authors of the report, said July 8 at a conference on Puerto Rico at The Heritage Foundation in Washington. The island’s gross national product is projected to contract by 1.2 percent in the fiscal year that began July 1, according to the island’s Planning Board, which calculates economic output. The island is expected to lose another 245,000 residents by 2025, according to the Planning Board. Its population has shrunk by 7 percent in the past decade, according to U.S. Census data.\n“Without some kind of re-profiling, or whatever you want to call it, they will get back even less over the longer term,” Krueger said at the conference about creditor repayment. “There are inter-creditor disagreements there which would also make those tougher.”\nA group of 35 hedge funds that hold $4.5 billion of Puerto Rico securities declined to say whether they would attend, said Russ Grote, a spokesman for the firms at Hamilton Place Strategies in Washington. The group is headed by Fir Tree Partners, Brigade Capital Management and Monarch Alternative Capital LP.\nBudget Deficit In the near term, the island is running out of cash. The budget gap for the fiscal year that ended June 30 is projected to widen to as much as $740 million, from earlier estimates of $191 million, according to financial documents. The Government Development Bank had $778 million of net liquidity as of May 31, down from $2 billion in October.\nThe island faces a $93.7 million debt-service payment on Public Finance Corp. bonds due July 15. The GDB Friday said it may purchase the bank’s notes “from time to time” as $300 million of tax- and revenue- anticipation notes matured last week. Another $140 million of GDB bonds mature Aug. 1, according to data compiled by Bloomberg.\nMunicipal debt sold on the island has lost about 9.7 percent through July 10, the worst performance for the period since at least 2007, according to S&P Dow Jones Indices. The broader muni market has earned 0.04 percent.\nBiggest Holders Melba Acosta, Puerto Rico’s top debt chief and president of the Government Development Bank, will lead the meeting, being held at Citigroup’s 350-seat auditorium.\nSpokespeople at OppenheimerFunds Inc. and Franklin Templeton Investments, the two biggest holders of Puerto Rico debt among muni mutual-fund firms, declined to say if the companies will attend the meeting in New York. MBIA Inc.’s National Public Finance Guarantee Corp., which insures $4.5 billion of Puerto Rico debt, plans to attend, Kevin Brown, a spokesman for the Purchase, New York-based insurer, said in an e-mail. Ashweeta Durani, spokeswoman at Hamilton, Bermuda-based Assured Guaranty Ltd, which guarantees $6 billion of commonwealth debt, declined to say if the company will be at the meeting.\nThose who are in attendance may have the same experience as those watching online. Any questions must be submitted prior to the meeting, according to the GDB. Wells Capital Management’s Lyle Fitterer said this is just the beginning of a likely protracted process.\n“We’re not going to fly someone out to New York just to be at this meeting,” said Fitterer, who helps oversee $38 billion of munis, including Puerto Rico securities, for Wells Capital in Menomonee Falls, Wisconsin.\nFor more, read this QuickTake: Puerto Rico&apos;s Slide", "external_links": ["http://www.bloombergview.com/quicktake/puerto-ricos-slide\\"], "published": "2015-07-13T07:00:00.000+03:00", "crawled": "2015-07-13T16:50:58.000+03:00", "highlightTitle": ""}