{"organizations": [], "uuid": "4fa17850a352b9faa17e35af4f23d36775f744f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507250045.html", "country": "US", "title": "Mozambique: Nyusi Inaugurates Chimoio-Espungabera Road", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Mozambique: Nyusi Inaugurates Chimoio-Espungabera Road", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T10:10:00.000+03:00", "replies_count": 0, "uuid": "4fa17850a352b9faa17e35af4f23d36775f744f7"}, "author": "", "url": "http://allafrica.com/stories/201507250045.html", "ord_in_thread": 0, "title": "Mozambique: Nyusi Inaugurates Chimoio-Espungabera Road", "locations": ["Nyusi Inaugurates Chimoio-Espungabera Road Malawi", "Mozambique"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malawi: Veteran Politician, Chibambo Wages War Against Jb \nAccording to the contractor, two new bridges were built, and streets in towns along the route were tarred. \nPrior to this road, the quickest way to reach Espungabera from Chimoio, particularly during the rainy season, was via Zimbabwe. Even in the dry season, the journey between Chimoio and Espungabera on the Mozambican roads used to take between six and eight hours - the new road cuts the time to two and a half hours. \nThe new paved road does not only end Espungabera's isolation from the rest of the country, but it should also stimulate the development of the other small towns it passes through, such as Sussundenga and Dombe. \nNyusi also inaugurated a meat processing unit, which is part of Mozbife, a cattle enterprise owned by the London-based Agriterra group. Agriterra has invested about 14 million dollars in the meat processing plant. \nOn its website Agriterra describes Mozbife as “a vertically integrated cattle ranching and feedlot production business which is developing into a ‘field to fork' producer, to capture more of the added value available higher up the food chain, benefitting profitability”. \nAgriterra says that Mozbife was established “to supply premium beef to both the domestic market in Mozambique as well as for export”. \nThe cattle are reared and bred at Agriterra ranches in Mavonde, Inhazono and Dombe, all in Manica, fattened at a feedlot in Vanduzi and butchered at an abattoir in Chimoio. Agriterra owns retail units in Chimoio,Tete, Manica and Beira, and says that its “integrated business approach enables the Group to maximise revenues and margins from the entire value chain”. Mozambique \nIn the decade between 2003 and 2013 Mozambique lost over 540 million US dollars through the illegal export of wood to … see more » Copyright © 2015 Agencia de Informacao de Mocambique. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-25T10:10:00.000+03:00", "crawled": "2015-07-25T20:23:54.140+03:00", "highlightTitle": ""}