{"organizations": ["Johnston Press"], "uuid": "e9c609ef8e500ede590e6b4704b428327a7514af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/sell-johnston-press-plc-buy-124818749.html", "country": "GB", "title": "Should You Sell Johnston Press plc To Buy Entertainment One Ltd?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Should You Sell Johnston Press plc To Buy Entertainment One Ltd?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T15:48:00.000+03:00", "replies_count": 0, "uuid": "e9c609ef8e500ede590e6b4704b428327a7514af"}, "author": "", "url": "https://uk.finance.yahoo.com/news/sell-johnston-press-plc-buy-124818749.html", "ord_in_thread": 0, "title": "Should You Sell Johnston Press plc To Buy Entertainment One Ltd?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 15, 2015, 14:04 BST - UK Markets close in 2 hrs 26 mins Should You Sell Johnston Press plc To Buy Entertainment One Ltd? By G A Chester | Fool.co.uk – 16 minutes ago 115.00 +1.5000 \nShares of media companies Johnston Press (LSE: JPR) and Entertainment One (LSE: ETO) have both been hammered this week -- but for very different reasons. \nYesterday, Johnston Press's shares plummeted 20% after the group issued a profit warning. Today, Entertainment One's shares are down 10% as I write, following news that a long-time institutional supporter has slashed its stake in the company by a third. \nUK local and regional news group Johnston reported that having \"traded well\" in Q1, performance in Q2 was such that first-half revenue is expected to fall by 5% year on year. Management blamed \"a slowdown in general trading as well as specific weakness in the run up to, and the period immediately after the election\" . \nOn the face of it, the 20% fall in the shares appears harsh. The company said first-half profits are likely to be only \"marginally\" below last year, that, based on most recent indicators, July is expected to show an improvement and that \"we anticipate full-year profit will be slightly below market expectations\" . \nHowever, Johnston is a heavily indebted company, with net debt of £185m versus a market capitalisation of £120m and a millstone of interest payments. If Q2 proves to be more than a blip -- or \"off-trend trading\" , as management called it -- the shares could have a lot further to fall. And the company did warn that, while it expects revenue trends to improve, sales \"may be impacted by market volatility during the rest of the year\" . \nAs an old-industry business that was late to respond to the digital age, Johnston has been struggling for years. If I held the shares, I would be tempted to sell and buy into Entertainment One. \nEntertainment One is a leading international entertainment company that acquires, produces and distributes film and television content. Peppa Pig is probably Entertainment One's best-known property, but the company has a large and diversified portfolio of media assets. \nSince 2010, Entertainment One's revenue and earnings have doubled. And management has a credible strategy to double the size of the business again over the next five years. Increasing scale should drive Entertainment One's financial return, and there is a virtuous circle as the company attracts and partners with more and more of the world's best creative talent. \nIn contrast to Johnston Press, today's hefty fall in Entertainment One's shares has nothing at all to do with business performance or outlook. The company announced that long-term backers Marwyn Value Investors have sold 9% of their stake in the business, by way of a placing to other institutional investors. \nI don't see anything sinister in Marwyn's move to take some profits after supporting Entertainment One's tremendous rise from an original AIM listing to its current listing on the Main Market and membership of the FTSE 250 . Marwyn still holds about 18% of the company's shares. Entertainment One's CEO said today that the directors \"look forward to Marwyn's continued support as an investor\" . The knee-jerk reaction of the market seems to be a response to the possibility that Marwyn could decide to sell more shares, creating a stock overhang and short-term weakness in the price. \nHowever, none of this detracts from Entertainment One's long-term prospects, and I see the stock as good value after today's drop. The company trades on a current-year forecast price-to-earnings ratio of 13.5, falling to 11.7 next year on the back of forecast mid-teens earnings growth. As such, now looks to me like an opportune time to buy. \nOf course, Entertainment One isn't the only stock in the market with exciting growth prospects. Indeed, the Motley Fool's analysts have just discovered an emerging opportunity to get into a top-class business before it makes a stealth attack on a huge market and becomes big global news. \nThe company in question dominates its market in the UK, but is on the brink of a bold global e-commerce expansion that could TREBLE online profits within 5 years . \nTo find out more for free, click here now . \nG A Chester has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-15T15:48:00.000+03:00", "crawled": "2015-07-15T16:05:17.000+03:00", "highlightTitle": ""}