{"organizations": [], "uuid": "6e43231f3fd628aa3f9b32ba689ae59519c6a3bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/o/4/a/z/image.related.afrArticleLead.620x365.ginqka.png/1438251445255.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/economy/australia-needs-to-get-over-its-recession-temperament-says-nz-prime-minister-john-key-20150730-ginqka", "country": "AU", "title": "Australia needs to get over its recession \"temperament\" says NZ prime minister John Key", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Australia needs to get over its recession \"temperament\" says NZ prime minister John Key | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T19:00:00.000+03:00", "replies_count": 0, "uuid": "6e43231f3fd628aa3f9b32ba689ae59519c6a3bb"}, "author": "Luke Malpass", "url": "http://www.afr.com/news/economy/australia-needs-to-get-over-its-recession-temperament-says-nz-prime-minister-john-key-20150730-ginqka", "ord_in_thread": 0, "title": "Australia needs to get over its recession \"temperament\" says NZ prime minister John Key", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "John Key says Australia needs to get over it's recession temperament. Kevin Stent Share on twitter Share on Google Plus by Luke Malpass\nNew Zealand prime minister John Key insists his economy will not go through the sort of \"recession\" hangover from its dairy boom that Australia is suffering after its mining boom.\nHe said despite the slide in dairy prices his country was in a far better position than Australia to benefit from China's economic transition.\nMr Key and Finance Minister Bill English said, in exclusive interviews with The Australian Financial Review , that Australia had developed its recession temperament in the absence of an actual recession.\nA dairy farm in the Waikato. Mr English said dairy is unusual because unlike other exports it has not benefited from the weaker NZ dollar effect. David White \"How come, generally speaking, Australians are a bit down in the mouth at the moment? And I think it's not an economic issue, it's a confidence issue,\" Mr Key said.\n\"Australia hasn't had a recession since 1991, but they are sort of displaying, the physical … temperament that they sort of are in recession, even though they are not. And in a way, we've got a bit of a contrast over here.\"\nThe Prime Minister said one of the things he has always admired was Australia's confidence, and while this had lagged, he reckoned, \"there is a growing confidence in modern New Zealand\".\nMr Key said the slowdown in China is a concern for New Zealand, as is falling business confidence. But for the metrics that matter, China looked a better prospect for New Zealand than Australia over the coming years.\n Finance Minister Bill English told Luke Malpass dairy in not as significant to New Zealand as mining is to Australia. David White \"The slowdown in China is an infrastructure, a financial markets story, it's fundamentally about lending and banking in [regional] governments and the property lending sector … so in a lot of ways, we think it will have a far more pronounced effect in Australia than in New Zealand, because you sell them iron ore and coal and all the ingredients for that construction and there's no question there is a bit of overcapacity there,\" Mr Key said\nBut he argued the same was not true for New Zealand\n\"Actually the [Chinese] consumer demand is very strong and actually likely to grow as wages are growing. Dairy is an outlier in that story – they just got a bit ahead of themselves.\" There was temporary but \"perfect storm\" of oversupply in global dairy markets.\nManufacturing, beef and kiwi fruit In his exclusive interview Prime Minister John Key told AFR reporter Luke Malpass (L) he was optimistic about the benefits to flow to New Zealand from the Trans Pacific Partnership. Kevin Stent As countervailing factors Mr Key pointed to 33 consecutive months of Chinese manufacturing growth, historically high beef prices and an increase in kiwi fruit exports from 100,000 crates into China in 2014, to one million in 2016.\n\"So if this was across our entire food production sector, you'd say: worry, but it's not. Dairy is quite significant, but it is only part of it. If consumer demand was slowing down, we'd probably be a bit more worried, but actually, we don't see that so much,\" he said.\n\"But I think we are right in saying that Australia is twice as dependent on iron ore compared to what we are with diary,\" Mr Key added.\nFinance Minister Bill English agreed: \"Diary's not quite as significant as iron ore is in Australia.\" He said dairy represented 5 per cent of the economy, and 22 per cent of exports, is not classified as its own line item in the budget, and the government has factored in only a 1 per cent drop to tax revenues as a result of the dropping price (currently at $NZ4.30 a kilogram for milk solids compared with $NZ8.65 this time last year).\nThe Prime Minister was optimistic about the Trans Pacific Partnership trade deal being negotiated in Hawaii this week, in which Australia is strongly involved and voiced his firm support for it.\n\"It does come down to a really philosophical debate. Do you think on a level playing field you can do better than the other guys? And we are going to be selling the New Zealand public the notion, that with a level playing field and better access to markets like Japan and United States, on balance, a small country like New Zealand will succeed.\"\nMr Key has previously signalled he will not sign a deal that disadvantages New Zealand, he's pleased with negotiation progress.\n\"There's nothing I've seen in the preliminary feedback on the TPP that rings such alarm bells to me that we should stop. I've seen things where one or two counter parties are pushing hard in area, or we would need better gains, but nothing is so worrying that we should walk away.\"\nThe falling New Zealand dollar, which has dropped from a high of US88¢ 12 months ago to US67¢ in late afternoon trading on Thursday, has had a salutary effect on New Zealand exporters, and tourism which clocked up over 3 million visitors per year for the first time, last year.\nMr English pointed out that dairy is unusual because unlike other exports it has not benefited from the weaker NZ dollar effect.\n\"80 per cent of exports are benefiting from the US cross [exchange rate] drop, the picture's just a bit more mixed than it was.\"", "external_links": ["https://twitter.com/https://twitter.com/LukeMalpassAFR", "https://plus.google.com/https://plus.google.com/107930364214961423804"], "published": "2015-07-30T19:00:00.000+03:00", "crawled": "2015-07-30T14:52:23.526+03:00", "highlightTitle": ""}