{"organizations": [], "uuid": "d01279c0c0086ff057abab2d13b0dd77ac40ddd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-07/AN_file-21-1437484883223857800_bb23775f-c6dd-4eb0-82fd-29897d41bac2.jpg", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business/Finance", "url": "http://www.menafn.com/1094287339/Shares-of-PayPal-rise-on-1st-day-of-trading?src=RSS", "country": "US", "title": "Shares of PayPal rise on 1st day of trading", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Shares of PayPal rise on 1st day of trading | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "d01279c0c0086ff057abab2d13b0dd77ac40ddd1"}, "author": "Arab News", "url": "http://www.menafn.com/1094287339/Shares-of-PayPal-rise-on-1st-day-of-trading?src=RSS", "ord_in_thread": 0, "title": "Shares of PayPal rise on 1st day of trading", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Arab News) NEW YORK: PayPal shares jumped in its first day as a separate and publicly traded company as the firm outlined plans to capitalize on the rise of mobile payments and the growing digitization of money. \nThe payments system company officially split with eBay Inc. on Friday 10 months after they announced that they were going their separate ways. \nPayPal processed 235 billion in total payment volume last year and logged revenue of about 8 billion. It plans to grow market share in mobile and online payments as well as expanding in areas like in-store payments. \nTrading on the Nasdaq Stock Exchange under the stock ticker 'PYPL' shares jumped 2.08 or 5.4 percent to 40.47 on Monday. \nPayPal CEO Dan Schulman and employees rung in the opening bell on the Nasdaq while the company gave out food via food trucks in Times Square and posted passersby's photos on Nadsaq's seven-story digital billboard to commemorate the listing. \nIn an interview Schulman said that being an independent company gives PayPal the ability to work with companies that might have hesitated before the split due to its association with eBay. \n'One of the big advantages for us is truly we now are world's leading neutral third-party payments provider and that will allow us the opportunity to partner with a number of companies across the world who before the separation either directly competed with eBay or had a perceived potential conflict with eBay' he said. \n'And now we are free to work with any of them.' \nBut similar to before the separation the company's focus is to grow its relationship with merchants and consumers he added. \n'We want to be much more than a proprietary button on merchants' websites' he said. 'We want to be a full-services partner to them as they look to use mobile tech to create more intimate relationship with their customers.' \nPayPal plans to grow market share with online and mobile payments as well as in-store payments he said. \n'As we see the proliferation of mobile devices and the digitization of money explode across the world we have an opportunity to follow those trends very naturally in the online space and in the app space and now to the in-store experience' he said.", "external_links": [], "published": "2015-07-21T03:00:00.000+03:00", "crawled": "2015-07-22T08:47:16.089+03:00", "highlightTitle": ""}