{"organizations": [], "uuid": "9e6ae437dc1696f19852f42f8017034f74cb28f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-businesswire/?format=rss", "section_title": "Finance News | Business Wire - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/innerworkings-astrazeneca-exclusive-marketing-execution-205800922.html", "country": "GB", "title": "InnerWorkings to Provide AstraZeneca Exclusive Marketing Execution", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "InnerWorkings to Provide AstraZeneca Exclusive Marketing Execution", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T23:58:00.000+03:00", "replies_count": 0, "uuid": "9e6ae437dc1696f19852f42f8017034f74cb28f8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/innerworkings-astrazeneca-exclusive-marketing-execution-205800922.html", "ord_in_thread": 0, "title": "InnerWorkings to Provide AstraZeneca Exclusive Marketing Execution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 16, 2015, 01:48 BST - UK Markets open in 6 hrs 12 mins InnerWorkings to Provide AstraZeneca Exclusive Marketing Execution Press Release : InnerWorkings, Inc. – 3 hours ago \nCHICAGO--(BUSINESSWIRE)-- \nInnerWorkings to direct print marketing operations in North America \nInnerWorkings, Inc. (NASDAQ: INWK), the leading marketing execution firm, has become the exclusive North American marketing execution partner of AstraZeneca, one of the world’s largest biopharmaceutical companies that operates in more than 100 countries. Under the seven-year agreement, InnerWorkings will manage AstraZeneca’s marketing print operations across North America, which will improve AstraZeneca’s transparency and reporting as well as strengthen its brand impact. \nStrategically placed across the U.S., InnerWorkings’ three onsite teams based in Delaware, Maryland, and Pennsylvania will help AstraZeneca sharpen its financial visibility, unify its brands, and enhance its marketing effectiveness. By tapping InnerWorkings’ $1 billion-dollar buying power, AstraZeneca will gain vital insights, promote sustainability, and refine its marketing spend. \n“Our new partnership will streamline our marketing and sales collateral and provide an unprecedented level of detail and control,” said Ed McAndrews, Head of Procurement, North America at AstraZeneca. “With InnerWorkings at our side, we can maximize our marketing resources while retaining brand consistency.” \nIn addition to AstraZeneca, InnerWorkings also serves top-tier global pharmaceutical clients such as Pfizer, Sanofi, and Novartis, all of whom benefit from InnerWorkings’ leverage, global reach, and ability to navigate the most sophisticated marketing supply chains across the globe. \nAbout InnerWorkings, Inc. \nInnerWorkings, Inc. (NASDAQ: INWK) is the leading global marketing execution firm serving Fortune 500 brands across a wide range of industries. As a comprehensive outsourced enterprise solution, the company leverages proprietary technology, an extensive supplier network, and deep domain expertise to streamline the production of branded materials and retail experiences across geographies and formats. InnerWorkings is based in Chicago, Ill., employs approximately 1,500 individuals, and maintains 67 global offices in 30 countries. Among the many industries InnerWorkings serves are: retail, financial services, hospitality, consumer packaged goods, not-for-profits, healthcare, food & beverage, broadcasting & cable, and transportation. For more information visit: www.inwk.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20150715006606/en/ Contact", "external_links": [], "published": "2015-07-15T23:58:00.000+03:00", "crawled": "2015-07-16T03:54:16.000+03:00", "highlightTitle": ""}