{"organizations": ["Elecam GM"], "uuid": "ab2fd08e83928ada28634dd8100bd9e491054aa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507231694.html", "country": "US", "title": "Nigeria: From Petrol Subsidy to Fuel Sales Tax", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: From Petrol Subsidy to Fuel Sales Tax", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T16:57:00.000+03:00", "replies_count": 0, "uuid": "ab2fd08e83928ada28634dd8100bd9e491054aa9"}, "author": "", "url": "http://allafrica.com/stories/201507231694.html", "ord_in_thread": 0, "title": "Nigeria: From Petrol Subsidy to Fuel Sales Tax", "locations": ["Nigeria", "Cameroon"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cameroon: Appointment of Elecam GM - Unperturbed Atmosphere Prevails \nIn the first half of January 2015, crude oil price averaged $48/barrel, the CRP was N90/litre and the pump price remained at N97/litre thereby resulting in over-recovery of cost that translates to implicit petrol sales tax of N7/litre. \nHowever, beginning from January 18, the pump price was reduced to N87/litre leading to a subsidy of N3/litre. On July 15, 2015, crude oil price was N57/litre, the CBN-fixed exchange rate was N197/litre, the CRP was N130/litre given the pump price of N87/litre, the subsidy was N43/litre. \nNote that, because the price of crude oil in July was below the level in December, had the exchange rate not changed, there would have been a big implicit sales tax margin at the official pump price of N87/litre and a much substantial sales tax margin at the previous pump price of N97/litre. \nHow does the naira exchange rate come about? Since the 1970s, the CBN has had to fix artificial naira exchange rates principally in order to fulfil fiscal projections. The two naira devaluations since November 2014 served that purpose. \nThere is a parasitic and distorted forex market that gives a semblance of market-determined exchange rates, but the set rates in reality allow a few elements to opportunistically exploit the financial system. \nResponding to a direct challenge to declare its stand, the World Bank agreed that the CBN approach was not proper in August 2006 (as may be gleaned from the relevant letters published on the Opinion pages of this newspaper on June 23-24, 2014). In August 2007, the CBN confessed that its method of fixing the naira exchange rate fell short of economic best practice. \nThe effect of CBN-fixed exchange rates on petrol subsidy leads to some conclusions. One, in the event of a collapse of crude oil price, petrol subsidy margin would contract or even disappear. But government becomes revenue-strapped, leading to delayed salaries, rising subsidy payment arrears, petrol scarcity, disruptions to economic activities and pervasive hardship. Two, low crude oil export receipts precipitate rounds of naira devaluation that further widen the subsidy margin and compound the prevailing adverse production conditions. Given predictions that low crude oil prices would stay for a while, the CBN's continual devaluation of the naira will spell economic doom. \nIn the circumstances, the issue of what to do with petrol subsidy is quite straightforward. By steadfastly implementing wrong fiscal and monetary policies, the FG wittingly chose to ride a tiger off which it dares not to dismount. So let the FG stew in its own juice. And the FG should reflect ruefully as it sizzling stews that in its management of the economy, the black market dictates the exchange rate and that the apex bank's artificial exchange rates, despite continually lowering the purchasing power of the domestic currency, always leave the naira overvalued and so predispose it to depreciate no thanks to the substitution of CBN funds for withheld Federation Account allocations which thereby bloat demand and constrict supply of forex in the distorted foreign exchange market. \nOn the other hand, by embracing proper management of the country's ample foreign exchange supply, good things will begin to happen to the economy. In a single forex market operated by deposit money banks employing the managed float system (MFS) with total (public sector plus autonomous) forex supply and eligible forex demand based on the requirements for duly specified genuine economic transactions, the DMB market-determined exchange rate will tend to appreciate until a realistic and stable exchange rate evolves. As the domestic currency appreciates, the CRP of fuel at a given price of crude oil will decline and thereby, at first, will narrow the subsidy margin and, subsequently, even accommodate implicit sales tax in the pump price. \nNow, suppose government, exercising its power to impose tax, adopts the CRP of diesel, aviation kerosene, household kerosene and other refined petroleum products on a particular date say July 15, 2015 to be their respective market or pump price together with the petrol price agreed with labour in 2012 for at least six months while the domestic currency is allowed to appreciate and find its realistic rate under the MFS with the CBN exchange rate as at the said date as the take-off rate. \nAmong the expected good happenings will be, first, that petrol subsidy will die naturally when the CRP and pump price of petrol meet. The rate of naira appreciation is likely to outstrip possible upswing in the CRP should crude oil price recover significantly. \nSecondly, when crude oil price falls, the CRP declines but the sales tax margin widens. Consequently varying volumes of sales tax revenue would accrue to government from the various refined petroleum products from the outset with the exception of petrol. As its subsidized status slips into history, petrol will yield a relatively low margin of sales tax. \nThirdly, with the CRP falling below the market price of the various products, investments in the petroleum sector would proceed unhindered. Public sector and private refineries, both old and new, should source crude oil and sell refined products at international price. Fourthly, conducive economic conditions will unfurl as the naira moves to its true value. \nIn the course of time, the energised productive sectors will gush revenue for government business. \nAt that point, Nigeria's march to economic emancipation will become irreversible. Nigeria \nThe National Economic Council meeting, chaired by Vice President Yemi Osinbajo, is currently in session at the … see more » Copyright © 2015 The Guardian. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-23T16:57:00.000+03:00", "crawled": "2015-07-23T17:43:38.635+03:00", "highlightTitle": ""}