{"organizations": [], "uuid": "bd6bdd0a86b946af51111f856475c9ef5985803d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/anti-austerity-protests-greece-bank-054743186.html", "country": "GB", "title": "Greece heads for IMF default, despite last-minute overtures to creditors", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Greece heads for IMF default, despite last-minute overtures to creditors", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T00:37:00.000+03:00", "replies_count": 0, "uuid": "bd6bdd0a86b946af51111f856475c9ef5985803d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/anti-austerity-protests-greece-bank-054743186.html", "ord_in_thread": 0, "title": "Greece heads for IMF default, despite last-minute overtures to creditors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Protesters wave and dance under a huge EU flag during a pro-Euro rally in front of the parliament building, … By Renee Maltezou and Robert-Jan Bartunek \nATHENS (Reuters) - Greece made last-minute overtures to its international creditors for aid on Tuesday, but it was not enough to save the country from imminent default on loans with the International Monetary Fund, people close to the negotiations said. \nAthens asked its European partners for new aid and offered to scrap a referendum in an attempt to lure creditors back into talks after five months of inconclusive negotiations have brought Greece close to leaving the euro currency bloc. \nSources said the offer was made by Finance Minister Yanis Varoufakis on a call with euro zone colleagues. \nGreece's existing aid package, with locked-up funds it needs to pay wages, salaries and debt, expires at midnight on Tuesday. Earlier in the day Athens had asked European countries for a reprieve and help paying its debts over the next two years. \nThe overtures came as tens of thousands of people have descended on Athens' central Syntagma square over the past 24 hours in two different rallies -- one to support the government and the other to push for Greece to remain in the euro. \nThe left-wing Greek government's gambits seemed to work in part. \nEuropean officials said it was too late to prevent Greece's current bailout from expiring at midnight, meaning Athens will forfeit 15.3 billion euros (17.1 billion dollars) in frozen funds. \nGreece is hours away from defaulting on a 1.6 billion euro loan to the International Monetary Fund. And German Chancellor Angela Merkel ruled out further negotiations until after Sunday's referendum that Prime Minister Alexis Tsipras has called on further bailout terms. \nYet finance ministers said they would confer on Wednesday over Tsipras' latest loan request, effectively coming back to the negotiating table. \nSources said the officials on Wednesday are expected to discuss Tsipras' request for the new two-year loan to pay debts that amount to nearly 30 billion euros. Tsipras is also seeking debt restructuring, an issue the lenders have so far been reluctant to tackle. \nIn what seemed like an effort to soften them, Varoufakis indicated during the call that his government might change its stance on the July 5th referendum when Greeks will vote on the latest bailout proposals by creditors. \nThe 40-year-old premier says the plebiscite is the democratic way for Greeks to say whether they will accept more budget-cuts and taxes in order to maintain international aid. He has been urging people to vote against it, angering creditors. \nDuring the call, Varoufakis said the Greek government was open to either call off the vote or change stance and recommend a \"yes\" vote if a deal were reached, according to euro zone sources. A Greek official said that, as of late Tuesday, there were no changes to the planned referendum. \nDEFAULT \nGreece has received nearly 240 billion euros in two bailouts from the European Union and International Monetary Fund since 2010. The money has allowed the country to stay afloat but at a high cost to its population which has swallowed many austerity measures such cuts to pensions, wages and public services. \nWith its likely missed payment to the IMF, Greece is on a path out of the euro with unforeseeable consequences for both the EU's grand currency project and the global economy. \n\"What would happen if Greece came out of the euro? There would be a negative message that euro membership is reversible,\" said Spanish Prime Minister Mariano Rajoy, who a week ago declared that he did not fear contagion from Greece. \n\"People may think that if one country can leave the euro, others could do so in the future.\" \nIf there is default, IMF Managing Director Christine Lagarde will immediately report to the global lender's board at close of business, Washington time, that Greece is \"in arrears\" - the official euphemism for default. \nIt will be the first time in the history of the IMF that an advanced economy has defaulted on a loan from the world's financial backstop, putting Athens, which has seen its economy contract by more than 25 percent since 2009, in the same bracket as Zimbabwe, Sudan and Cuba. \nAlready the imposition of capital controls to prevent the crippled banking system from collapsing have given Greeks a bitter foretaste of the economic plunge that could follow exit from the euro. \nWithdrawal limits of 60 euros a day have been fixed for cash machines and there have been long queues at petrol stations and in supermarkets as worried shoppers have stocked up on essentials like pasta and rice. \nThere were no immediate signs of serious shortages but if the banks remain closed, cash flow problems which have already been reported by some firms, could worsen. \n\"So far there are no problems with suppliers, but if the banks are still closed next week there will be a bit of a problem if they demand purely cash payments,\" said Charisis Golas, owner of a small meat and dairy shop in Athens. \nDEFIANCE \nIn Athens, opposition leaders -- echoing EU officials - hammered home on Tuesday that the choice facing Greeks in the referendum is whether to stay in the euro zone or return to the drachma, even though the EU has no legal way of forcing a member state to give up the single currency. \nFormer Greek Prime Minister Antonis Samaras, leader of the main opposition party, said a \"No\" vote would push the country out of the single currency and wipe out wages and pensions. \nThe euro fell against the dollar (EUR=) but European shares, which dropped sharply on Monday, steadied on hopes of a deal. (.EU). The Athens stock exchange is closed during a week-long shutdown of the banking sector which began on Monday. \nOpinion polls show a majority of Greeks favor holding on to the euro, but the referendum is shaping up to be a close call. \n(Additional reporting by Silvia Aloisi in Milan, Mark John in Paris, John O'Donnell in Frankfurt, Paul Day in Madrid, George Georgiopoulos and Lefteris Karagiannipoulos in Athens, Padraic Halpin and Gavin Jones; Writing by Paul Taylor, James Mackenzie and Alessandra Galloni; Editing by Janet Lawrence)", "external_links": [], "published": "2015-07-01T00:37:00.000+03:00", "crawled": "2015-07-01T00:45:48.000+03:00", "highlightTitle": ""}