{"organizations": [], "uuid": "85deeeb1558c99eda52940481fd861968f2479ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-27/china-minsheng-to-buy-white-mountains-sirius-for-2-2-billion", "country": "US", "title": "China Minsheng Investment to Acquire Sirius for $2.2 Billion", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "China Minsheng Investment to Acquire Sirius for $2.2 Billion - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T20:11:00.000+03:00", "replies_count": 0, "uuid": "85deeeb1558c99eda52940481fd861968f2479ae"}, "author": "Selina Y Wang", "url": "http://www.bloomberg.com/news/articles/2015-07-27/china-minsheng-to-buy-white-mountains-sirius-for-2-2-billion", "ord_in_thread": 0, "title": "China Minsheng Investment to Acquire Sirius for $2.2 Billion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "White Mountains Insurance Group Ltd. agreed to sell Sirius International Insurance Group Ltd. for about $2.2 billion to an arm of China Minsheng Investment Corp.\nThe price for the reinsurer will be 127 percent of shareholders’ equity, plus $10 million, White Mountains said Monday in a statement. The $2.2 billion figure is based on the measure of assets minus liabilities as of Dec. 31. China Minsheng Investment, or CMI , is a Shanghai-based firm that was founded last year, according to the statement.\nCMI is among international firms seeking to expand in Bermuda reinsurance to add premium dollars for investment purposes and gain access to risks that aren’t correlated with stock and bond markets. China’s Fosun International Ltd. in May agreed to buy the shares it doesn’t already own of Ironshore Inc. for about $1.8 billion. Exor SpA, run by Italy’s Agnelli family, is seeking to acquire PartnerRe Ltd.\nCMI “intends to further grow Sirius’s already substantial capital base,” Sirius Chief Executive Officer Allan Waters said in the statement. “China is one of Sirius’s most important markets, and CMI is the perfect partner for Sirius to continue its Asian growth strategy.”\nWhite Mountains specializes in building insurance providers. The company, led by CEO Ray Barrette, also holds a stake in life insurer Symetra Financial Corp., and in 2011 sold auto insurer Esurance and Answer Financial to Allstate Corp. for about $1 billion.\nJPMorgan, Willis Barrette was exploring a sale of OneBeacon Insurance Group Ltd. and had drawn interest from Fosun, people familiar with the matter said in April.\nWhite Mountains advanced 1.4 percent to $685 at 9:42 a.m. in New York trading. The company climbed 7.2 percent this year through Friday, and is headed for a seventh straight annual gain. White Mountains said the deal will increase adjusted book value by about $65 per share.\nThe seller got financial advice from JPMorgan Chase & Co. and Willis Group Holdings Plc, while using the law firm of Cravath Swaine & Moore LLP, according to the statement. White Mountains, which is domiciled in Bermuda, said it expects the deal to be completed within six months.\nCMI was founded by 59 privately owned companies including China Oceanwide Holding Group Co., Kechuang Group and Suning Commerce Group Co. Dong Wenbiao, former chairman of China Minsheng Banking Corp., is the chairman. The firm focuses on private equity and asset management and targets mergers and acquisitions in the financial industry, Dong said in September.", "external_links": ["https://www.cm-inv.com/en/aboutus/index.htm\\"], "published": "2015-07-27T20:11:00.000+03:00", "crawled": "2015-07-27T16:55:43.549+03:00", "highlightTitle": ""}