{"organizations": [], "uuid": "0f24ab547b7e8edcd08cc9ffd2b1adc5ba44b8cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/c/e/k/1/image.related.afrArticleLead.620x365.gicejg.png/1436903495423.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/world/hsbc-lost-control-of-swiss-arm-20150714-gicejg", "country": "AU", "title": "HSBC 'lost control' of Swiss arm", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "HSBC 'lost control' of Swiss arm | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:51:00.000+03:00", "replies_count": 0, "uuid": "0f24ab547b7e8edcd08cc9ffd2b1adc5ba44b8cd"}, "author": "Marion Dakers", "url": "http://www.afr.com/news/world/hsbc-lost-control-of-swiss-arm-20150714-gicejg", "ord_in_thread": 0, "title": "HSBC 'lost control' of Swiss arm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HSBC was fined $US1.9 billion in 2012 for poor money laundering controls in Mexico. Getty Images by Marion Dakers The former boss of HSBC has admitted that the bank \"should have drilled into\" the problems at its scandal-hit Swiss and Mexican businesses.\nLord Green of Hurstpierpoint yesterday gave his first full public account of his role at the bank since becoming trade minister in late 2010. He expressed regret that HSBC did not grasp the urgency of the problems in its global business units before they were caught up in tax evasion and money laundering investigations.\n\"We did a lot of acquisitions that went just fine, but nevertheless you can't help but becoming conscious of the risks we were maybe stretching ourselves quite quickly and, with the benefit of hindsight, one might reflect on some of the wisdom of that,\" said Lord Green, who was HSBC chief executive from 2003 to 2006, before serving as chairman until 2010.\nResponding to criticism of the Swiss private banking unit, he told the House of Lords economic affairs committee: \"I do not believe anyone was aware of, to use your phrase, an industrial scale of tax evasion\". He said the theft of data from its Swiss arm became apparent in 2010, and admitted some executives were not aware of the contents until after that. HSBC paid ??28m to the Geneva authorities last month to settle an investigation into \"suspected aggravated money laundering\", and remains under investigation in other jurisdictions. Leaked documents show that HSBC's Swiss unit helped more than 8,800 British people avoid tax.\n\"I think it would be right to acknowledge that it would have been good to drill into this systematically a bit earlier and we didn't get everything right,\" said Lord Green.\nHSBC acquired Bital, a Mexican bank, in 2002 as part of its push into central America. \"Of course in the case of Mexico you could hardly ignore that fact it was an emerging market,\" said Lord Green. \"There were plenty of good reasons to believe this was the kind of emerging market which HSBC has flourished in, in so many other parts of the world.\"\nHSBC was fined $US1.9 billion in 2012 for poor money laundering controls in Mexico, with the US Senate upbraiding the bank for providing a channel for \"drug kingpins and rogue nations\".\n\"With the benefit of hindsight we should have drilled in more closely and more quickly on the anti-money laundering side. [Our checks] didn't help us understand that there was a sufficiently serious problem in that bank to need very close attention very urgently, and I'm sorry about that,\" he added.\n Before HSBC began its global spending spree by acquiring Midland in 1992, the bank was more \"cohesive\" and able to keep tabs on its operations, according to Lord Green. \"You could rely on the person on the spot because you knew them and probably went to school with them,\" he said.\nLord Green and Sir Win Bischoff, the former chairman of Lloyds Banking Group, both appeared before the Lords yesterday to discuss the culture of the banking industry. Both former executives said they were concerned about the rate of pay for bankers.", "external_links": [], "published": "2015-07-15T03:51:00.000+03:00", "crawled": "2015-07-14T23:58:27.000+03:00", "highlightTitle": ""}