{"organizations": [], "uuid": "7821afc977b76ebca04b13fc65f76d6bf3e4e119", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/g/f/w/w/image.related.articleLeadwide.620x349.gigfaz.png/1437652020609.jpg", "site_section": "http://www.canberratimes.com.au/business/carbon-economy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/markets/currencies/we-aint-seen-nothing-yet-chinese-foreign-investment-in-australian-property-tipped-to-surge-20150720-gigfaz.html", "country": "AU", "title": "'We ain't seen nothing yet': Chinese foreign investment in Australian property tipped to surge", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "'We ain't seen nothing yet': Chinese foreign investment in Australian property tipped to surge", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T19:47:00.000+03:00", "replies_count": 0, "uuid": "7821afc977b76ebca04b13fc65f76d6bf3e4e119"}, "author": "", "url": "http://www.canberratimes.com.au/business/markets/currencies/we-aint-seen-nothing-yet-chinese-foreign-investment-in-australian-property-tipped-to-surge-20150720-gigfaz.html", "ord_in_thread": 0, "title": "'We ain't seen nothing yet': Chinese foreign investment in Australian property tipped to surge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Politicians' entitlements 'a bit ambiguous': Turnbull\nBill Shorten outlines vision for Labor\nBronnie living the high life\nTravel perks for pollies\n'Change of heart of men' needed to combat domestic violence\nReplay video Return to video Video settings Please Log in to update your video settings\nHousing: cheap, unaffordable - or both? Economics editor Peter Martin explains the housing paradox - why buying a house is cheap by some measures, and prohibitive by others.\nPT2M23S 620 349 Autoplay On Off Video feedback Video settings Australians might think Chinese investors have pushed up property prices , but \"we ain't seen nothing yet,\" according to Colonial First State Global Asset Management chief economist Stephen Halmarick who is tipping the liberalisation of China's capital markets will inflate asset prices acrosss the globe.\nIn recent weeks there has been a lot of focus on the challenges facing China as it opens up its financial markets to foreign investors, and what the associated volatility means for other economies like Australia.\n\"But what will really matter for the world is how China opens up to allow its people to send money offshore. Australians might think they've seen a lot of Chinese investment in the Sydney and Melbourne property market, but we ain't seen nothing yet,\" Mr Halmarick said at a panel hosted by the Australian Institute of Superannuation Trustees in Sydney.\nIt is expected that the liberalisation of China's capital markets will continue to inflate asset prices across the globe. Photo: Glenn Hunt\nChina's main equity market, the Shanghai Composite Index, surged more than than 150 per cent in the 12 months to mid-June as the bourse was opened up to foreign investors, before plunging 32 per cent in a matter of weeks. Since the government intervened to stabilise the market with a capital injection in early July the Shanghai Composite has bounced back by 13 per cent. The direction of the ASX has tracked the rocky path of China's market over the past month .\nAdvertisement Aberdeen Asset Management head of fixed income Nick Bishop agreed that outflows of Chinese money in the years ahead is likely to have a far greater impact on global financial markets than the recent rise in inflows of offshore capital into China.\n\"China is a nation with a huge balance of household savings, because there has been no social safety net. Don't discount the ability of Chinese money to flow offshore and push up global asset prices, even if the economy slows down more than expected.\"\nChina's market tends to be more volatile because it is still dominated by small investors. Photo: AP\nMr Bishop said the biggest risk out of China would be a change in direction from policymakers.\nChina on track \"But we expect the authorities to continue to react to market volatility in a way that balances the challenges of the nation's structural reform push and plans to open up its financial markets with managing slower growth.\"\nAccording to data from the National Bureau of Statistics, China is on track to achieve its official economic growth target of 7 per cent in 2015, down from growth that was in excess of 10 per cent a few years ago.\n\"The official figures show China is still growing at 7 per cent, although it feels a lot weaker,\" Mr Halmarick said.\nMany fund managers are sceptical of the accuracy of data released by the Chinese state, but it is nevertheless a pretty reliable indicator of relative changes, he said.\n\"If all of a sudden the official statistics start saying Chinese growth has slowed to 5 per cent then we'll know we're in trouble, but I don't think that is likely.\"\nMacquarie Asset Management head of fixed income Brett Lewthwaite said the slowdown in China is being well managed by the state and tipped a \"soft landing\".\nAfter all, China has the advantage of being governed by a centralised government with a 10-year fixed term. That makes it easier for policymakers to stick to their long-term reform plans, despite setbacks caused by periods of turmoil.\n\"Nobody ever said the liberalisation of Chinese markets was going to be easy,\" Vanguard Asia Pacific head of investment strategy Jeffrey Johnson said.", "external_links": ["https://sasha-project.s3.amazonaws.com/afr-prod/archive/responsiveJSV2/pym.min.js", "https://s3-ap-southeast-2.amazonaws.com/sasha-project/afr-prod/2015/07jul/shanghai_short_hype/index.html", "http://www.smh.com.au/business/comment-and-analysis/wall-of-chinese-capital-buying-up-australian-properties-20150628-ghztdf.html", "http://www.smh.com.au/business/china/the-chinese-stock-meltdown-that-makes-the-greece-saga-look-trivial-20150710-gi99m9.html", "http://www.afr.com/markets/equity-markets/asx-slumps-2pc-as-chinese-share-market-spooks-investors-20150708-gi7g5z", "http://www.afr.com/news/world/china-economic-growth-beats-estimates-after-rate-cuts-20150715-gicld2"], "published": "2015-07-23T19:47:00.000+03:00", "crawled": "2015-07-24T23:23:38.561+03:00", "highlightTitle": ""}