{"organizations": [], "uuid": "1c36793046c633417c6fc84685e237eef0c31151", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/e/q/7/7/image.related.afrArticleLead.620x365.giejx3.png/1437124339478.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/mining/coal/shenhua-watermark-bets-on-nature-to-past-next-hurdle-20150717-giejx3", "country": "AU", "title": "Shenhua Watermark bets on nature to past next hurdle", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Shenhua Watermark bets on nature to past next hurdle | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T22:15:00.000+03:00", "replies_count": 0, "uuid": "1c36793046c633417c6fc84685e237eef0c31151"}, "author": "Geoff Winestock", "url": "http://www.afr.com/business/mining/coal/shenhua-watermark-bets-on-nature-to-past-next-hurdle-20150717-giejx3", "ord_in_thread": 0, "title": "Shenhua Watermark bets on nature to past next hurdle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Clift: sinking bores for decades to find water but as far as he can tell there isn't any. Paul Mathews Share on twitter Share on Google Plus by Geoff Winestock There are plenty of local farmers who will tell you that the area around Breeza in the Liverpool Plains, five hours' drive north of Sydney, is no place for a coal mine. The yield of crops such as cotton, barley and sorghum from the black soil is about 40 per cent above the national average. The bores yield sweet water from a geological formation known as the Breeza choke which holds in the run-off and makes the upper Namoi catchment one of the best west of the Great Divide. Tony Clift, whose family farmed the area for six generations, says the most beautiful thing about the area is \"the wide open plains with the surrounding hills of the Liverpool range. It is a special place\".\nYou would think that Clift, 53, would be frightened of the huge open-cut coal mine that could soon obliterate the Watermark Ridge set in the middle of this scene that used to form part of his family's land. If Shenhua's proposal goes ahead it will dig a mine right under the house where he grew up.\nBut Clift has a personal experience that makes him doubt some of the claims made by opponents of the mine. The main complaint has been that the mine will damage ground water for the whole Upper Namoi catchment which locals have likened to the Nile Delta for its fertility. Clift says his family has been sinking bores for decades to find water in the red ridge country of Mount Watermark above the surrounding black soil plains. But he says as far as he can tell there isn't any. He says that once Shenhua started digging exploration wells on his land, for two years he went and checked the wells every morning to see if they were having more luck than he had. They didn't.\n\"I would have loved to have found water but we cannot run enough stock on it because we haven't got enough water,\" he says.\nHe is no expert but he cannot work out how blowing up this dry ridge country will hurt the flood plains that surround it. \"I just get a bit cranky about the truth being stretched a bit. People are saying they are going to mine the flood plains, well they are not. The water aquifers aren't going to be interrupted as far as I could see from the science.\"\nClift is certainly not typical of most farmers in the area. For one thing, he no longer has much skin in the game. Because his farm was right above the proposed mine site, Shenhua made him a handsome offer to buy his farm outright in 2011 which he decided to accept. He now leases the land back from Shenhua and the company encouraged the AFR Weekend to talk to him.\nBut it highlights the complexity of the debate over whether farming and coal mining can co-exist on the Liverpool Plains. It is a debate that this week developed into one of the nastiest battles between miners, farmers and environmentals in recent years. It has all the elements – dragging in national politics, relations with China and the community's trust in scientific method.\nSince the federal government last week announced what appeared to be final approval for the project, a split has opened inside the Coalition between the pro-business, pro-foreign investment Liberals and the rural heartland Nationals. Prime Minister Tony Abbott has insisted the project is safe and like Clift is invoking the science. The project has been studied inside and out for over five years.\n \"As all the science tells us, it's not going to have an impact on the water table. And frankly, if it's not going to damage the farming areas, if it is going to bring billions of dollars worth of economic activity and hundreds of ongoing jobs, I think we should say 'let's go with it',\" Abbott said on Sydney radio.\nBut Agriculture Minister Barnaby Joyce, whose seat covers the Liverpool Plains and the ridge that Shenhua want to obliterate, has broken cabinet solidarity by condemning Environment Minister Greg Hunt for approving the mine . He says it is a sign of a \"world gone mad\".\nThe idea that a coal mine planned to extract 10 million tonnes per annum for a period of 30 years will scar this rural idyll has also galvanised an odd alliance of alternative greens, conservative farmers and radio pundit Alan Jones who devoted most of two days of his program this week to attacking the project. In the course of a long, contentious interview on Thursday , Jones wrung a promise from Hunt to submit Shenhua's water management plan to another scientific expert assessment, potentially delaying the project even further.\nIt is a very local battle too. The local Gunnedah Chamber of Commerce and the mayor have come under fire from the local Namoi Water irrigators co-operative this week because they publicly welcomed the $30 million of cash and the 600-plus jobs that the project will bring to the area.\nTim Duddy, a farmer whose property adjoins the Shenhua exploration lease, says the government must kill the project and is promising a long battle if it doesn't. \"This is a dog of a project in our rarest agricultural resource. Wait till they have 25,000 people up there tied to machinery for 10 years!\" he warns. He says he is not going to judge Clift but adds that his former neighbour made a \"business decision\" which was not open to anyone else.\nClift says only that things were a \"bit cool\" after he sold out and he now lives away from Watermark closer to town. \"It's too hard to live there. The emotions were too high.\"\nTheir opposing views go to the heart of the matter: how precious is the land for agriculture and for providing a food bowl for Asia? The New England and North West Region accounts for 21 per cent of NSW agricultural production, according to official statistics, and it is drought resistant. In recent years it has continued to produce 80 per cent more than its historical average even as surrounding areas were affected by drought.\nIt is not just chance that this is happening in NSW where mining both of coal and coal seam gas has become one of the Baird government's hardest issues. In Queensland coal seam gas spread so quickly that opposition could hardly take hold and most of Queensland's coal is mined in the remote outback on less productive land.\nIn Victoria, the government banned CSG mining before it could start. But in the past few years NSW mining has been in everyone's face. Coal mines threatened the picturesque horse studs and vineyards of the Hunter Valley and coal seam gas rigs sprouted amid the green hills around Gloucester and the hippy communes and hobby farms of the NSW North Coast. The rage over mine approvals helped the Greens and the ALP win huge swings against the Nationals in several seats in the March state election and the Greens won the seat of Ballina, despite the popularity of the Baird government. NSW Premier Mike Baird has responded by effectively banning coal seam gas in all but two locations and by rewriting the planning rules for coal mines to give more weight to environmental and social factors and less to economics.\nShenhua's Watermark project also carries the burden of the state's politicised, not to say corrupt, system of planning approvals under both Labor and the Coalition. As Shenhua's opponents like to point out, the Chinese firm was first granted an exploration licence in 2008 by Ian Macdonald, the corrupt NSW resources minister who helped ALP power-broker Eddie Obeid​ to a $300 million mining licence in the Hunter Valley.\nThe licence was then extended in 2012 by Chris Hartcher, the Liberal resources minister who was at the centre of the Independent Commission Against Corruption's inquiry into illegal political donations. Opponents of the mine point out that when extending the exploration licence, Hartcher substituted his own definition of \"flood plain\", different to the one in the NSW water act, to ensure Shenhua's project could go ahead.\nAfter four years of scrutiny under NSW planning laws and the federal Environmental Protection and Biodiversity Act, the company now says the science is in.\n\"Shenhua has never shied from scrutiny and genuine scientific review of the assessments supporting the Watermark project, which have been validated at every stage of the process,\" says project manager Paul Jackson.\nBut the thing is that while the science is probably state-of-the-art, there are still areas of uncertainty. Most would agree that mining the Watermark ridge country itself is not that bad and it has no more environmental or social value than Whitehaven's nearby mine at Maules Creek. But the question is, what impact digging out a succession of three open-cut pits spread across an area of 35 square kilometres and hundreds of metres deep will have on the water supply for the surrounding black soil plains.\nAn aggravating factor in the upper Namoi is that local farmers have already slashed water use by as much as 50 per cent over the past decade under the national plan to improve flows throughout the Murray Darling Basin. They say Shenhua is getting preferential treatment.\nUsing computer modelling, Shenhua predicted that its mine would not lower the level of the surrounding water table by more than 1.4 metres, which is within NSW statutory limits. But the locals are sceptical, pointing out that at Caroona just down the road from Watermark, BHP's now mothballed exploration licence application predicted a much bigger impact from a proposed underground coal mine than Shenhua has from its open-cut. Why the difference? Shenhua says it is mining a much shallower open cut mine in hard permian rock, not the loose black soil.\nLast month an independent scientific expert committee paid for by the federal government and not by the company reviewed Shenhua's modelling and concluded that it was \"sufficiently robust to draw conclusions as to the most likely impacts on the Upper Namoi Alluvium, particularly the Gunnedah Formation\". That gave Hunt the scientific backing he needed to approve the project.\nBut what if the modelling is wrong? It is just modelling. Farmers say there is evidence that Maules Creek's impact on aquifers is much higher than predicted by the company when it won approval. No-one knows exactly how fast water could flow back and forth through the protecting block of permian rock between the black soil and the coal pit once the pressure of the ridge is taken out of the equation.\nHunt promised Jones on Thursday that he would seek another round of independent scientific assessment of Shenhua's plans to measure groundwater in the area around the ridge once the mine is started. Shenhua will have to show that it has enough bores in the surrounding ground to identify changes in water levels or toxic chemicals released from the pit. It might also have to say exactly how much water levels can change before it triggers a compulsory order to cease work on the mine, potentially costing Shenhua hundreds of millions of dollars.\nLocal farmers such as Duddy say that in practice once the mine is started this will never happen and the project should be nipped in the bud.\nClift hopes that in 30 years after the mine is filled back in, his family will return to his ancestral lands on the Liverpool Plains and turn the rehabilitated ridge back to pasture. But he also admits to moments of doubt. \"It's probably the most studied mine I have ever seen but we don't know what Mother Nature's got underneath.\"", "external_links": ["https://twitter.com/https://twitter.com/GeoffWinestock", "https://plus.google.com/https://plus.google.com/108137886892627412852"], "published": "2015-07-17T22:15:00.000+03:00", "crawled": "2015-07-17T23:06:23.000+03:00", "highlightTitle": ""}