{"organizations": ["COPC Inc", "Serco", "Accenture", "Infosys", "HCL", "COPC Inc.", "COPC Customer Service Provider", "Customer Experience Consulting Services in India Opens New Office"], "uuid": "92339b2623d1beeb1a5ec1cc1350230fe81cc8bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/copc-inc-expands-customer-experience-consulting-services-india/44656", "country": "US", "title": "COPC Inc. Expands Customer Experience Consulting Services in India", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "COPC Inc. Expands Customer Experience Consulting Services in India", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T09:00:00.000+03:00", "replies_count": 0, "uuid": "92339b2623d1beeb1a5ec1cc1350230fe81cc8bf"}, "author": "", "url": "http://businesswireindia.com/news/news-details/copc-inc-expands-customer-experience-consulting-services-india/44656", "ord_in_thread": 0, "title": "COPC Inc. Expands Customer Experience Consulting Services in India", "locations": ["United States", "Gurgaon New Delhi", "Mumbai", "Gurgaon", "Latin America", "Europe", "Delhi", "Sri Lanka", "Florida", "India", "Fla.", "Winter Park", "U.S.", "Africa", "Asia Pacific", "Japan", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Shreekant Vijaykar", "Cliff Moore"], "text": "Wednesday, July 29, 2015 11:30AM IST (6:00AM GMT) COPC Inc. Expands Customer Experience Consulting Services in India Opens New Office in Gurgaon New Delhi, Delhi, India and Fla., Winter Park, United States COPC Inc., a global consulting firm that helps organizations improve the customer experience, announces the availability of consulting services for call centers and other customer operations for companies located in India and the opening of a new office in Gurgaon. COPC Inc. has been working in the Indian market for more than 15 years, offering certification and training to increase the performance of call centers and business process outsourcing (BPO) organizations. With the opening of the Gurgaon office, the COPC Inc. Indian team will now also offer COPC Inc.’s complete line of consulting services, including customer experience (CX) consulting for any customer contact operation and strategic sourcing consulting for vendor management organizations (VMOs). “We are delighted to expand our efforts in India with the opening of our new office. India has always been an integral part of COPC Inc.’s global strategy. With our presence in the financial and industrial city of Gurgaon, we are better able to serve this growing market. Consumer expectations in India are changing, so companies need to compete on customer experience, rather than just cost. COPC Inc. is well positioned to help develop and execute new strategies for our Indian clients,” said Cliff Moore, co-founder and chairman of COPC Inc. Historically, COPC Inc. has provided training specific to the COPC Customer Service Provider (CSP) Standard in various cities throughout the country. Call center and BPO management training will remain a key part of the COPC Inc. service offering in India, and the next COPC CSP class will be offered from September 9 to 11 in Mumbai. COPC Inc. also has a long history working with BPO organizations in India, including Accenture, Aegis, Firstsource, HCL, Infosys, Interglobe, Minacs, and Serco. The company will continue to deliver training and certification services to help BPOs maintain their global competitiveness. COPC Inc.’s two new services offered in India, CX consulting and strategic sourcing, provide Indian clients with expert guidance to improve the customer journey. CX consulting focuses on operational aspects of the customer experience. COPC Inc. directs companies about how to create, implement and best manage their CX program to align with customer needs, expectations and behaviors. Strategic sourcing consulting provides best practices and expertise to VMOs for procuring and managing third-party services for a call center or other customer contact operation. “Our clients in India and Sri Lanka will now have access to a larger team of COPC Inc. experts from around the world to help drive improvements in service, cost and the customer experience. We plan to build upon our existing client base and work with new companies seeking guidance in developing and implementing a customer experience management program,” said Shreekant Vijaykar, director of South Asian operations, COPC Inc. To learn more about COPC Inc.’s work in India or to contact the Gurgaon office, contact Shreekant Vijaykar, svijaykar@copc.com or +91 981 842 5646. About COPC Inc. COPC Inc. is an innovative global leader that empowers organizations to manage complex customer journeys. With a focus on driving improvement, the company provides consulting, training and certification for operations that support the customer experience. Founded in 1996, COPC Inc. began by developing the COPC® Family of Standards and helping call centers increase their performance. Today the company works with hundreds of leading brands worldwide to optimize key customer touch points and implement a unified, cross-channel customer experience management (CEM) program. COPC Inc. is privately held with headquarters in Winter Park, Florida, U.S., and with operations in Europe, Middle East, Africa, Asia Pacific, Latin America, India and Japan. For more information, please visit www.copc.com .", "external_links": [], "published": "2015-07-29T09:00:00.000+03:00", "crawled": "2015-07-29T10:36:18.547+03:00", "highlightTitle": ""}