{"organizations": ["Standard Bank Launches New Youth Savings Account"], "uuid": "e967a46dc4f138f29efb560a90582596748f039c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507040267.html", "country": "US", "title": "Namibia: Standard Bank Launches New Youth Savings Account", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Namibia: Standard Bank Launches New Youth Savings Account", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T01:22:00.000+03:00", "replies_count": 0, "uuid": "e967a46dc4f138f29efb560a90582596748f039c"}, "author": "", "url": "http://allafrica.com/stories/201507040267.html", "ord_in_thread": 0, "title": "Namibia: Standard Bank Launches New Youth Savings Account", "locations": ["South Africa", "Namibia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa: Govt in Bid to Educate Millions Without Grade 9 \nThe good news is the new youth account comes with a customized debit card, no monthly management fees, free cash deposits, and you can open the account with a minimum of N$50 and stop orders can be linked to the account. \nThe new Standard Bank Digi Youth Account caters for existing and potential customers' children aged from zero to 18 years old. The account provides easy access to savings type accounts, and allows for products to be added as your child's financial sophistication grows. The custom-made debit cards for the Digi Youth Account are readily available at all Standard Bank branches. \n\"Giving your children the power to control their spending and track money going in and out of their accounts will help build healthy financial habits. This will help them differentiate between a 'want' and a 'need' at the end of the day,\" added Erna Kaura, liabilities manager of Standard Bank Namibia. \n\"It is imperative for us to always be giving our esteemed customers the best service by providing them with tailor-made and innovative products. This includes our children, as they will also become our future customers. This is a bond we cherish and an unshakable trust we share with our customers over the years,\" said Hans.. \nThe launch of the Digi Youth Account for children follows the previous successful launches of other innovative products like the Standard Bank Smart App and an enhanced customer offering to Prestige clients earlier this year. Namibia \nA City Police officer died on the spot when an alleged drunk driver drove into his patrol vehicle in the early hours of … see more » Copyright © 2015 New Era. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-05T01:22:00.000+03:00", "crawled": "2015-07-05T02:21:39.000+03:00", "highlightTitle": ""}