{"organizations": [], "uuid": "2c515276a7ec6245954e177d7db13948f143d4c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businessandfinance.com", "main_image": "http://businessandfinance.com/wp-content/uploads/2015/07/Cliffs_Of_Moher_Costal_Walk.jpg", "site_section": "http://businessandfinance.com/feed/", "section_title": "Business & Finance", "url": "http://businessandfinance.com/the-road-not-taken/", "country": "GB", "title": "The road not taken", "performance_score": 0, "site": "businessandfinance.com", "participants_count": 1, "title_full": "The road not taken", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T11:15:00.000+03:00", "replies_count": 0, "uuid": "2c515276a7ec6245954e177d7db13948f143d4c9"}, "author": "Niamh Mac Sweeney", "url": "http://businessandfinance.com/the-road-not-taken/", "ord_in_thread": 0, "title": "The road not taken", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The road not taken 0 Lifestyle | Wed 22 Jul | Author – Niamh Mac Sweeney Niamh Mac Sweeney forgets the highways and byways and goes off the beaten track, taking a walk on the wild side to find a brave new world awaits. \nI wander slowly along a winding boreen, beautifully framed by an abundance of yellow heather that bursts from the sides of ditches. On my right, rugged cliff trails are all too tempting, while mountains coated in a purple haze sit commandingly ahead. Robert Frost’s poem, ‘The Road Not Taken’, rings in my head: two roads diverged in a yellow wood, and sorry I could not travel both … \nI’ve often contemplated walking the Camino de Santiago, also known as the Way of St James. And when I heard that CaminoWays.com –specialists in tailoring cycling and walking holidays along the Camino – had launched a new offering, IrelandWays.com, I stopped contemplating and started planning. \nThe great thing about IrelandWays.com is the fact that there really is very little planning involved. They take all the stress out of researching and organising a trip – everything from transfers and accommodation down to the finer details. Really, the only tough part is deciding which route to take. \nFor me, there is only one way, and that’s the Wild Atlantic Way. No matter where you are along the Atlantic coastline – whether your route takes you to Donegal or Doonbeg, whether admiring the Blasket Islands or trekking through the Burren – striking scenery and remote locations, bustling towns and villages steeped in heritage and culture all vie for top billing along the 2,500km route. From Malin Head in Donegal to Mizen Head in Cork, free and unbridled walking trails showcase dramatic mountain ranges, coastal views are captured in true picture-postcard form, and when the sun makes a glorious appearance, Ireland always feels like the best place in the world to be. The spectacular Inch beach, Co. Kerry \nQUEEN IN THE KINGDOM \nThe Kerry Way, a trail between Tralee and Dingle, has historic connections to the Camino de Santiago, as Dingle used to be one of the main ports for Irish pilgrims leaving to go to Santiago de Compostela. The Church of St James in Dingle – famous now for Other Voices , one of Ireland’s most unique music events – is where I will complete my journey. But before that, there’s a bit of walking to be done. \nThe Grand Hotel in Tralee is basecamp before the expedition. A hearty meal of grandiose proportions is laid on, as locals and tourists, walkers and talkers converge. \nTralee too has many great waterholes. But if you’re looking for a quiet nightcap you could be hard pressed. The town is buzzing with lively spots, whether its Betty’s Bar on Strand Street where the locals hang out, or my personal favourite, Roundy’s bar with its fine selection of craft beer and cocktails (mojitos come highly recommended). Even on a weeknight the bars in the town are a hive of activity – great music and great people – which always leads to great fun. \nAND WE’RE OFF \nAfter a short but sweet night’s sleep, in the Grand Hotel reception I get my first stamp on the Kerry Camino passport. And we’re off! \nFrom Tralee along the canal and past the wetlands to Blennerville is a pleasant warm-up for what is to come. \nAt Camp (another stamping station) there is time to catch your breath, and given its location, it could possibly take your breath away too. Camp provides spectacular valley views with endless coast to the fore, enveloped in lush mountain ranges either side. On a clear day you can see out across the peninsula as far as Cloghane and Brandon. The view from the Dingle Whiskey Distillery \nFrom there, we take a 2km trek off road in a south-westerly direction, gradually rising out of the valley. Views of Caherconree Mountain and the megalithic fort are outstanding, as is Glentenassig Forest. \nWe trek on past forests and over streams, on towards the Emlagh River, taking in the beauty in between great chats and banter with fellow walkers along the way. Thinking it can’t get more spectacular than this, the trail temptingly swings to the west and reveals an inspiring view of Inch beach, where continuous streams of frothing waves crash on the sandy shoreline. It was from here that the film Ryan’s Daughter was filmed, and now I see why it was chosen as a location for this iconic film. \nAt Sammy’s beach-side restaurant we are served the most delicious seafood. From traditional fish and chips to simple oysters and mussels soaked in cream and garlic … there is no better substance after a trek than good food. With inspiring views out across the golden, sandy beach, where brave surfers catch massive waves, and with the glorious sun beating down on us, I wonder: ‘do I need to pinch myself. Am I in Ireland?’ \nFrom Inch, we head along the coast to Annascaul with views over its dramatic glacial valley. The village itself is famous as the birthplace of the great explorer Tom Crean and the South Pole Inn, where his home lies, is an emblem of his great adventures and bravery. \nThe Kerry Camino reaches a height of 235m as it crosses the peaks of Corrin and Knockbrack. The walk then follows a trail between the long mountain ridge of Moanlaur and Knockmore, and between all that walking and talking, we have all worked up a fierce thirst. \nSPIRIT HOUSE \nWhen we arrive in Dingle our first stop is the Dingle Distillery. We are greeted by Mary Ferriter. Larger-than-life, she’s the driving force and spirit behind this artisan distillery; and she’s a real tonic too! After an insightful tour of this traditional, independent distillery, it was time for some well earned refreshments – gin, cucumber and tonic never tasted so good. \nIt’s easy to doodle away a few hours in Dingle. On land, the town offers so much craft, culture, ceol agus craic. But at its heart, it’s a fishing village, and sightings of dolphins are as regular as seagulls landing on the quay. \nAfter a stroll across town, a quick stop-off in Kool Scoops of Dingle for a well deserved ice cream from John and Aine O’Connor’s well stocked ice cream parlour, is the perfect end to the perfect day. \nIntent on ‘making hay while the sun shines’, and not content with exploring only one part of this glorious island of ours, I decide to head up the Atlantic coastline to Clare, renowned for its dramatic cliffs and rugged Burren landscape. \nWith no time to waste, we take the ferry from Tarbert in Kerry to Killimer in Clare. All along the 20-minute boat journey numerous dolphins pop up to greet us and once again I wonder – ‘Am I in Ireland? Really?’ The Dingle Whiskey Distillery \nCASTAWAY \nNo matter how many times you visit the Cliffs of Moher, you will never tire of the outstanding and dramatic views out over the cliffs. Other people seem to agree because this is the most visited attraction in Ireland. \nAfter a quick stop-off at the visitor centre – where we learn all about the nature and wildlife of the area – it was onwards and upwards for us as we walked some of The Burren Way from the cliffs up to the coastal village of Doolin. \nAlthough there is a fresh breeze, the sun is shining and there isn’t a cloud in the sky. Because of the fine weather, from the cliffs we can see the Aran Islands and Galway Bay, as well as the Twelve Pins and the Maum Turk mountains in Connemara. \nOur walk along the rugged coastline is a pleasant one. We stroll across the peninsula admiring the pristine turquoise sea, listening to waves crashing against the rocks, while breathing in the fresh sea air. \nBut between all the walking, talking and intakes of fresh sea air, we have worked up quite an appetite and so when we arrive in Doolin it’s straight to O’Connor’s pub for a fine feast of fresh fish. \nRefreshed and refuelled, content, from our table outside in the sun, I sit back and watch the world go by, blissfully happy with all I have achieved and all that I have seen along the Wild Atlantic Way. \nGONE WITH THE WIND \nThroughout the year there are numerous walking festivals all along the Wild Atlantic Way. And with so many mapped out trails and companies like IrelandWays.com taking all the hassle out of planning, a walking holiday in Ireland couldn’t be easier to organise. \nI’m already planning my return to the Wild Atlantic Way and what roads the next holiday will take me down. There is so much to explore and enjoy on this island of ours. I like to think I’m well travelled domestically, but the reality is I’ve barley scratched the surface. Given that there are many roads not yet taken, and a lot of stamps still to be got before I have my Wild Atlantic Way passport fully stamped,new adventures in Ireland await. Walkers enjoy the Kerry Way ON THE ROAD AGAIN \nThere are numerous treks and trails to chose from all along the Wild Atlantic Way. Because all the trips are flexible and tailor-made, you can choose to cover only a few days of the ‘ways’ if you don’t have time to do the whole route. The two routes I took were: \nThe Dingle Way: From Tralee town we followed the road to Camp, and from there down to Inch beach, across to Annascaul before finishing up in Dingle. \nw: irelandways.com/ways/the-wild-atlantic-way/the-dingle-way \nThe Burren Way: From Liscannor you follow the coast to the world-renowned Cliffs of Moher, and then walk north along one of the most spectacular cliff paths until you reach the small village of Doolin. \nw: irelandways.com/ways/the-wild-atlantic-way/the-burren-way WAY TO GO! \nIrelandWays.com is the latest arrival to the CaminoWays.com family. It specialises in walking and cycling tours in Ireland, including the Wild Atlantic Way. \nIrelandWays.com packages include: half-board accommodation, luggage transfer to and from hotels, and holiday pack with route notes and maps. \nFor information and bookings: w: irelandways.com t: 01 525 2886 (from Ireland) and +353 1 646 801 7951 (from the US).", "external_links": [], "published": "2015-07-22T11:15:00.000+03:00", "crawled": "2015-07-23T08:12:07.513+03:00", "highlightTitle": ""}