{"organizations": [], "uuid": "78a391f728f5fd6065064441e113c1f5529d66af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/ptkw4bymm2_ydtg8kiv75_imf.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/629414/1/international-financial-institutions-announce-400-.html", "country": "US", "title": "International financial institutions announce $ 400 Billion to achieve SDGs", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "International financial institutions announce $ 400 Billion to achieve SDGs", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T19:00:00.000+03:00", "replies_count": 0, "uuid": "78a391f728f5fd6065064441e113c1f5529d66af"}, "author": "", "url": "http://www.modernghana.com/news/629414/1/international-financial-institutions-announce-400-.html", "ord_in_thread": 0, "title": "International financial institutions announce $ 400 Billion to achieve SDGs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  13 July 2015 17:00 CET International financial institutions announce $ 400 Billion to achieve SDGs By GNA \nHohoe, July 13, GNA - The Multilateral Development Banks (MDBs) and the International Monetary Fund (IMF), had signaled plans to extend more than $400 billion in financing development over the next three years, according to an African Development Bank (AfDB) release to the Ghana News Agency. \nThe multinational financial agencies vowed to work more closely with private and public sector partners to help mobilize the resources needed to meet the historic challenge of achieving the Sustainable Development Goals (SDGs). \nThe institutions, the AfDB, Asian Development Bank, European Bank for Reconstruction and Development, European Investment Bank, Inter-American Development Bank, World Bank Group (referred to as the MDBs), and the IMF, jointly announced their plans in the lead-up to the Third International Conference on Financing for Development in Addis Ababa, July 13-16. \nThe statement said the SDGs are ambitious and demand equal ambition in using the 'billions' of dollars in current flows of official development assistance (ODA) and all available resources to attract, leverage and mobilize 'trillions' in investments of all kinds, public and private, national and global. \nIt said ODA, estimated at $135 billion a year, provides a fundamental source of financing, especially in the poorest and most fragile countries, adding that more is needed. \n\"Meeting the staggering but achievable needs of the SDG agenda requires everyone to make the best use of each dollar from every source, and draw in and increase public and private investment. The MDGs - the engines of development finance - are looking to a range of options for scaling up,\" it said \nDonald Kaberuka, out-going President of AfDB said: '2015 is a critical year in charting the development future of Africa, the continent that still has the greatest development needs, and the continent that presents the greatest opportunity, for itself and for the world. The level of collaboration among the MDGs in preparing the Financing for Development conference has been unprecedented, in coming up with innovative solutions to scale up development financing.' \n'One such is sovereign exposure exchange, where the African Development Bank is working closely with the World Bank and the Inter-American Development Bank to stretch our balance sheet so that we can scale up lending to our clients in North Africa,' he said. Jim Yong Kim, President, World Bank Group, said: 'We must cast away the stereotypes of aid and think about development differently. It's about creating opportunity for all, giving people an equal chance to succeed in life, and preparing the world to deal with the challenges of climate change and the next pandemic.'\n'We need trillions, not billions, of dollars to accomplish these goals, and the money will come from many sources: developing countries, private sector investment, donors, and international financial institutions. By working together, we can help people build better lives with good education, quality health care, clean water, and proper sanitation. Those investments in people will help end extreme poverty in just 15 years.' \nChristine Lagarde, Managing Director of IMF, said 'This year marks a once-in-a-generation opportunity for global development. The only way to seize it is through partnership. To go far, we must go together. \nThe IMF, with its global membership and mandate to promote economic growth and stability - is a committed partner. In this pivotal year, we have targeted areas where providing additional support will have strong payoffs: we have just increased access to all our concessional loan facilities by a full 50 percent; we are set to expand our large program of support to developing countries in mobilizing domestic tax revenues; and we will deepen our policy engagement with countries on key development issues such as addressing infrastructure needs and promoting equity and inclusion.' \nAdditional steps to leverage more resources include the development of new approaches and tools to help developing countries play a stronger role in harnessing national resources. The MDBs and the IMF are partnering with countries on, for example, the introduction of a new toolkit to assess and improve tax policies and expanding instruments such as e-procurement to achieve better government spending. \nIt said increasing external resource flows to developing countries for investment was essential to achieving the SDGs, but these flows could be expected to materialize only in circumstances where countries had coherent development strategies consistent with maintaining macroeconomic stability, while also ensuring the delivery of key public sector services and a business environment supportive of growth. \nThrough their policy advice and technical assistance, the MDBs and IMF support countries in designing economic policies to achieve these objectives; through MDB policy support loans and IMF-supported programs, these institutions provide general financial support towards meeting budgetary and balance of payments needs. \nThe private sector is playing an increasing role in financing goods, services and infrastructure. The MDBs are committed to engaging differently with private sector partners on a wide range of interventions, including connecting investors with opportunities, helping countries make investments more attractive, and building local financial markets. \nIt indicated that the MDBs were also partnering with others to develop innovative financing approaches to support global needs, such as health and climate, building on extensive work already underway. \nGNA", "external_links": [], "published": "2015-07-13T19:00:00.000+03:00", "crawled": "2015-07-14T00:51:52.000+03:00", "highlightTitle": ""}