{"organizations": [], "uuid": "afd539c9a72128d5f609a9f73ee8914e09f84cf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/c/j/v/u/image.related.afrArticleLead.620x365.gil18r.png/1437978545240.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/market-wrap/australian-dollar-could-dip-below-us70-westpacs-robert-rennie-says-20150727-gil18r", "country": "AU", "title": "Australian dollar could dip below US70¢, Westpac's Robert Rennie says", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Australian dollar could dip below US70¢, Westpac's Robert Rennie says | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T09:15:00.000+03:00", "replies_count": 0, "uuid": "afd539c9a72128d5f609a9f73ee8914e09f84cf0"}, "author": "Mark Mulligan", "url": "http://www.afr.com/brand/market-wrap/australian-dollar-could-dip-below-us70-westpacs-robert-rennie-says-20150727-gil18r", "ord_in_thread": 0, "title": "Australian dollar could dip below US70¢, Westpac's Robert Rennie says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Australian dollar on Monday morning was buying US72.77¢, around six-year lows, after having dropped as far as US72.60¢ in international trade following Friday's local session. Louie Douvis Share on twitter by Mark Mulligan The Australian dollar is trading at close to fair value at the moment, but could dip a few cents further to US70¢, according to analysis from Westpac.\nWestpac's chief currency strategist Robert Rennie says the combination of falling commodity prices and expectations of an imminent increase in US interest rates are the main drivers of the Aussie's softness at the moment.\nHe adds that easing concerns about the Greek debt crisis and Chinese equity markets, coupled with the relative allure of Australian interest rates, particularly to Japanese pension funds, means the local unit may be close to its floor in the current cycle.\nThis, however, did not rule out a series of events which would drive it lower.\nThe Aussie was buying US72.93¢, around six-year lows, in late local trade on Monday, after having dropped as far as US72.60¢ on overseas markets following Friday's Asian session.\nThe currency has lost almost 23 per cent against the US dollar since this time last year.\nIts current value is slightly below average forecasts by economists in early June, and reflects mounting pressure on so-called \"commodity currencies\" such as the Canadian and New Zealand dollars - but also emerging market units such as the Brazilian real and South African rand - because of concerns about Chinese demand for raw materials and agriculture.\nThe strength of the greenback is also a factor here, as most commodities are priced in US dollars and so the currencies of exporter countries adjust accordingly.\n Emerging markets have also succumbed to capital flight because of broader economic worries and positioning in US dollar assets.\nMr Rennie has maintained since late-May that the domestic currency would be at US73¢ by September and US72¢ by December.\nFor it to slip to US70¢ or below, several market events would have to converge, he argues.\nThese include a further 10 per cent drop in Westpac's own export-weighted commodities index; two, 25 basis point cuts in the US Fed's fund rate, in September and December; another mass flight to safe-haven assets in the face of market turmoil; and a build-up of aggressive short-selling positions by currency traders.\n\"At least on paper, [this] scenario seems possible within our own forecasts,\" Mr Rennie writes in a research note.\nDespite this, Mr Rennie is sticking with his earlier forecasts.\n\"I see rising risks of dips towards US70¢ before year end,\" he said.\n\"However, I still argue there are factors that will make such a move sticky and slow in nature.\"\nNational Australia Bank's chief economist for markets Ivan Colhoun also sees the Aussie easing slightly from current levels by the end of the year.\n\"Fed tightening remains part of the expectation for further easing in the Australian dollar to the low 70s by end-year, a forecast that remains on track,\" he said in a note on Monday.", "external_links": ["http://www.smh.com.au/world/greek-bailout-talks-to-begin-after-delay-20150725-gikl05.html", "https://twitter.com/@MulliganMark"], "published": "2015-07-27T09:15:00.000+03:00", "crawled": "2015-07-27T10:04:50.409+03:00", "highlightTitle": ""}