{"organizations": [], "uuid": "b90b280972d65349085a8f14fee43313f9062da9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-03/iss-joins-glass-lewis-in-opposing-controversial-samsung-merger", "country": "US", "title": "ISS Joins Glass Lewis Opposing Controversial Samsung Merger", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "ISS Joins Glass Lewis Opposing Controversial Samsung Merger - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T18:25:00.000+03:00", "replies_count": 0, "uuid": "b90b280972d65349085a8f14fee43313f9062da9"}, "author": "Jungah Lee", "url": "http://www.bloomberg.com/news/articles/2015-07-03/iss-joins-glass-lewis-in-opposing-controversial-samsung-merger", "ord_in_thread": 0, "title": "ISS Joins Glass Lewis Opposing Controversial Samsung Merger", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Institutional Shareholder Services Inc. told investors to reject Samsung Group’s proposed merger of two units, setting back the South Korean conglomerate’s efforts to push through a deal that would solidify the founding family’s control over their business empire.\nInvestors in Samsung C&T Corp. should decline group affiliate Cheil Industries Inc.’s all-stock buyout offer when the deal comes to a shareholder vote on July 17, the proxy advisory firm said in a report.\nManagement’s revenue targets are “hugely optimistic and how such targets could be achieved remain unclear” ISS said in its report. Samsung’s argument in favor of the merger “remains vague and unconvincing.”\nISS joins Glass Lewis & Co. in opposing the merger and siding with billionaire activist investor Paul Elliott Singer’s campaign to block the deal on grounds that minority shareholders will be hurt. It’s a blow for Samsung’s ruling Lee family, which is counting on the merger to tighten the corporate dynasty’s grip over South Korea’s biggest conglomerate ahead of a generational transition in leadership.\nThe deal would put Samsung C&T shareholders at a disadvantage, as potential synergies don’t make up for the undervaluation in the deal, Rockville, Maryland-based ISS said in the report.\n“Much of the potential revenue synergies claimed by management seem to rely heavily on the growth profile of Cheil Industries,” ISS said. “Shareholders wishing to have exposure to Cheil Industries’ growth prospects could do so by simply investing directly in Cheil Industries.”\nISS and Glass Lewis are two of the most influential proxy advisory firms providing corporate governance advice to fund managers. ISS covers about 39,000 companies in 115 countries, while Glass Lewis’s clients collectively manage more than $20 trillion in assets. More than 40 percent of C&T’s shares are held by institutional investors, according to data compiled by Bloomberg.\nCheil, which is Samsung Group’s de facto holding company, announced in May it would take over its trading-and-construction affiliate as the Lee family restructures its businesses for a smooth power transfer to 47-year-old Lee Jae Yong, the founder’s grandson, from his bedridden father.\nAt stake is control over a collection of 67 companies with interests ranging from electronics to finance and shipbuilding. C&T owns more than $10.7 billion of group company shares, including those of crown jewel Samsung Electronics Co.\nThe Lee family, which together with other Samsung units own almost 20 percent of C&T’s shares, will have to first get through Singer’s Elliott, which began its campaign in early June to block the deal. Elliott has argued that the merger would pass 7.8 trillion won ($7 billion) of C&T book value to Cheil without compensation.", "external_links": ["http://www.issgovernance.com/\\"], "published": "2015-07-03T18:25:00.000+03:00", "crawled": "2015-07-03T13:59:50.000+03:00", "highlightTitle": ""}