{"organizations": [], "uuid": "dd5b616916504a5aadef5eab99b21a3bf15bd77b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "http://static.guim.co.uk/sys-images/Money/Pix/pictures/2015/7/8/1436358188425/Wallet-containing-Euros-a-005.jpg", "site_section": "http://www.theguardian.com/money", "section_title": "Personal finance and money news, analysis and comment | Money | The Guardian", "url": "http://www.theguardian.com/money/2015/jul/11/holiday-checklist-best-deals-currency-insurance-breakdown", "country": "GB", "title": "Our holiday checklist: find the best deals for your wallet", "performance_score": 0, "site": "theguardian.com", "participants_count": 3, "title_full": "Our holiday checklist: find the best deals for your wallet | Money | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T14:59:00.000+03:00", "replies_count": 3, "uuid": "4432a8a0eed6721c64031c735042792b054ed0bb"}, "author": "Patrick Collinson", "url": "http://www.theguardian.com/money/2015/jul/11/holiday-checklist-best-deals-currency-insurance-breakdown#post-0", "ord_in_thread": 0, "title": "Our holiday checklist: find the best deals for your wallet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "W ho is cheapest for foreign exchange – especially if you’re heading to Greece and need to take a lot of euros? What is the best-buy travel insurance? How much should you pay for car breakdown cover? Guardian Money went shopping for the best deals …\nBest travel exchange bureau for euros The euro crisis means that this summer many holidaymakers heading for the beaches and islands will be carrying much larger amounts of cash, rather than relying on taking money out of ATMs on arrival.\nOthers like to have a decent amount of money in their wallet before heading off to countries in the eurozone.\nThe cheapest option is to buy your money online and have the euros delivered to your door before heading off. You can also book a decent deal online and then pick up the cash at a bureau de change.\nOr you can buy your currency last minute at the airport, but this is usually the worst value.\nBest for delivery When we asked to change £500 this week, Moneycorp came top offering €693.15, or around €30 more than the worst deals, which are generally at the major high street banks (although Telegraph Trave l , a deal offered by the newspaper, was bottom of the table, while HSBC was relatively good).\nWebsite bestforeignexchange offered four cents more than Moneycorp, but we discounted it as it isn’t authorised by the Financial Conduct Authority.\nIf neither of those names appeals, then Debenhams , HSBC , Marks & Spencer (cardholders only) and Asda were all decent value.\nMost of the online deals offer free next-day delivery, so long as you exchange at least £500. For sums less than this you are likely to be charged £5 for delivery. Obviously, you first have to go online and open a personal account and transfer money from your current account to buy the currency.\nWe also tested the best providers for changing £1,000 into euros, which might be more pertinent for those heading to Greece.\nMoneycorp was again the best FCA-authorised site, although a number that weren’t came higher, such as TravelFX and ACEFX .\nBest for collection You can go online, book cash and then arrange to collect it at the airport, your bank or from a bureau in a shop if you don’t like the idea of it being posted. Generally, we found you get a slightly worse rate, but it’s marginal.\nFor changing £500, Moneycorp again came top, followed by Debenhams and ICE’s bureau at Ashford International (for Eurostar travellers).\nWe noted that the Post Office , which makes a big noise in the currency exchange market, was only offering middling value.\nBest for last-minute You’re throwing your money away if you hand your debit card over at the airport and ask for euros. According to travelmoneymax , from money-saving expert Martin Lewis, you would get around €50 less for your £500 by changing it at the airport.\nIn the past, Money has found that the ICE bureau in Waterloo Station, London, offers half-decent rates, but our best advice is to try to order beforehand for delivery or collection.\nBest travel insurance This is one area where cheapest is rarely best value. There are plenty of policies starting at around £10 for a single trip, but they are riddled with exclusions and excesses, which make them virtually pointless.\nTo find the best value for a family of four (two children aged 12 and 10) we only looked for those that covered bags for at least £750, cancellation at a minimum of £1,000 a person, and where the excess was just £50.\nBest for a family, single trip, two weeks, Europe ERV Express Lite . At £15.22 it was only £3 more than the policies with high excesses, and the policy is written by a company that is in the giant Munich Re insurance group.\nIf a family wants the peace of mind of knowing that it would cost them nothing at all in the event of a claim, the cheapest with a zero excess is again from ERV, the Express Premier policy coming in at £27.10.\nBest for family, annual cover, Europe only ERV comes top again, charging £38.69 for its annual Express Lite policy.\nBest for family, annual cover, Europe, including skiing Alpha comes top at £53.76. It is a relatively small company, having grown out of a provider that specialised in backpacker insurance, although they have been around since 2006. They are also best value if you want to include the US in your annual policy, charging £85.68 for our family of four.\nBest for individual, single trip, two weeks, Europe £8.55 from Alpha with a £50 excess; and £15.06 from ERV (Express Premier) for a policy with zero excess.\nBest for individual, annual cover ERV Express Lite at £13.54 for Europe-only; £22.58 from Alpha for Europe with winter sports cover included; and £35.99 from Alpha for worldwide cover with winter sports.\nBest for extended holiday/backpacker Most annual policies are really multi-trip that cover you for up to 30 days out of the country per trip.\nIf you are going for longer you will need a policy with a longer duration. Up to 62 days, Direct Travel Insurance is best at £48.38 , while Planet Earth will cover 91 days at £92.76 .\nAbove that, prices really begin to soar. Neither Confused.com or MoneySuperMarket.com could find Quote: s for a 22-year-old expecting to be away nine months travelling the globe.\nInsureandGo has a backpacker policy starting at £239 , but if you want proper cover then you are looking at £390 . Outbacker insurance offers slightly lower levels of cover for £168-£228 .\nBest European car breakdown cover Don’t be tempted to dart through the Eurotunnel on a summer break, however short, without taking out breakdown cover. If the engine fails and your car has to be taken back to the UK the costs can run into the thousands.\nBut you would be equally daft just to buy the policies on offer from the mainstream companies, such as the AA or RAC , which appear very pricey compared to some other deals.\nWe sought Quote: s on the cost of covering a three-year-old Nissan Qashqai for a two-week holiday in France or Spain. The RAC wanted £69.70 for comprehensive cover just for the holiday, while the AA said full cover would be £79.76 . This was double the price of Swiftcover at £33.50 for 11-17 days, or the £41.11 that ETA (Environmental Transport Association) wanted, for what looked like a higher level of cover and which aims to be carbon-neutral.\nBut, in reality, it’s better to find a breakdown policy that covers you or your car for the year in the UK, with European breakdown as an add-on. We found Kwik-Fit offered the best deal at £50.37 for our Nissan for full breakdown recovery in the UK and Europe for 12 months.\nWhen you consider that the AA and RAC charge upwards of £150 for comprehensive breakdown policies for the UK only, it appears to be exceptional value.\nNote: standard car insurance policies only cover you third party when driving in EU countries. Extend comprehensive cover well before travelling so any documentation arrives in time.", "external_links": ["http://www.wearetravelinsurance.co.uk/contact.asp", "https://www.theaa.com/european-breakdown-cover/#/", "http://www.swiftcover.com/breakdown/cover/", "http://www.telegraph.co.uk/travel/", "http://www.outbackerinsurance.com/?gclid=CIGplpK2y8YCFUnItAodBKYLCg", "http://www.moneysupermarket.com/travel-insurance/", "http://www.hsbc.co.uk/1/2/travel-money", "http://www.alphatravelinsurance.co.uk/?gclid=CIGPwsK0y8YCFe_HtAodxFoLpA", "http://www.kwik-fitinsurance.co.uk/landing-page/breakdown-cover-google?gclid=CO_z7Ye3y8YCFeQSwwodD10BkQ", "http://www.direct-travel.co.uk/travel_insurance_ppc/?cmpid=KNC-Google&gclid=CNLs-dW0y8YCFSbItAodjpcF4A", "http://bank.marksandspencer.com/banking/travel-money/overview/", "http://www.erv.co.uk/products/erv-express/#.VZ0GnHqHr7I", "http://finance.debenhams.com/travel-money/exchange-rates/", "http://www.rac.co.uk/breakdown-cover/european-breakdown-cover?WT.srch=1&gclscr=aw.ds&gclid=CLOnrL62y8YCFW2WtAodB64G6A", "http://money.asda.com/travel-money/", "https://www.insureandgo.com/?gclid=CKS3z-y1y8YCFSLkwgodQX8Jfw", "http://www.postoffice.co.uk/travel-money/tourist-exchange-rate", "http://www.moneycorp.com/uk/?pc=Adwords&gclid=CMyywoyyy8YCFaYfwwod9PoKQQ", "http://www.confused.com/travel", "https://www.iceplc.com/events/bureau-de-change"], "published": "2015-07-11T14:59:00.000+03:00", "crawled": "2015-07-11T16:06:19.000+03:00", "highlightTitle": ""}