{"organizations": [], "uuid": "5ac71afce8911b9e923a5d37a852a20ce9e55346", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thefinancebuff.com", "main_image": "http://lh3.googleusercontent.com/-meKkM2dIQUc/VYYToPFD9_I/AAAAAAAACKI/wi7NhGQIeE4/s800/largest-529-plans.png", "site_section": "http://thefinancebuff.com/feed/rss", "section_title": "The Finance Buff", "url": "http://thefinancebuff.com/largest-529-plan.html", "country": "US", "title": "The Largest 529 Plan And The Power Of Distribution", "performance_score": 0, "site": "thefinancebuff.com", "participants_count": 1, "title_full": "The Largest 529 Plan And The Power Of Distribution", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T16:51:00.000+03:00", "replies_count": 0, "uuid": "5ac71afce8911b9e923a5d37a852a20ce9e55346"}, "author": "Harry Sit", "url": "http://thefinancebuff.com/largest-529-plan.html", "ord_in_thread": 0, "title": "The Largest 529 Plan And The Power Of Distribution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "like a friend telling you about money ... The Largest 529 Plan And The Power Of Distribution by Harry Sit on 7 Comments \nWhile looking at 529 plan information, I came across an interesting tidbit. It also tells us something about investing in general. \nEvery state has a 529 plan. Some states have more than one plan. Which state has the largest 529 plans in terms of total assets? \nIs it California , the state with the largest population? No. Many California residents go elsewhere because there isn’t any state tax benefit for using an in-state plan. California’s plan has less money in it than Alaska’s. \nIs it New York , the next largest state in population, where taxes are high and residents are offered a state income tax deduction for 529 plan contributions? No. New York residents are doing their fair share but New York isn’t pulling in big money from other states. \nIs it Utah , whose plan is often ranked as the best in the country? No. Utah’s plan is doing quite well relative to Utah’s small population, but it only takes the #6 spot in the country. \nThe #1 state in the country with the largest assets in its 529 plans is Virginia , hands down by a mile. \nSource: 529 College-Savings Plan Landscape , 27 May 2015, Morningstar \nAccording to Morningstar, Virginia has nearly 1/4 of all 529 plan assets in the country. New York, the #2 state, comes in at less than half of the share taken by Virginia. \nWhy Virginia? One word: brokers. \nVirginia’s market share is driven by its CollegeAmerica 529 plan, which features American Funds, sold by brokers (“advisors”). American Funds pay brokers for selling the plan. Brokers convince parents and grandparents nationwide to open accounts with the Virginia plan. It’s that simple. \nGranted there are other funds and plans that also pay brokers, and American Funds and the Virginia plan must compete with those, I’m confident to say that without brokers the Virginia plan would be nowhere close to be #1 in the country. \nThat’s the power of distribution. Altogether, half of the 529 money in all plans are in broker-sold plans. \nTo all who think Vanguard Personal Advisor Services just unnecessarily charge 0.3% of assets for putting people in a handful of funds that look like a target-date fund, or that Schwab cheats by requiring a cash allocation in its Schwab Intelligent Portfolio product, or that Wealthfront is evil because their fees in dollars go up as your assets grow, let’s not forget that so many people still invest through brokers and they are paying a lot more. \nIf robo-advisors win over people from brokers, it’s a big win for the investing public. Just the other day a friend mentioned he had his account managed by someone at a broker branch. I asked him if he was paying a fee. He said he didn’t know. Then he said it was probably 0.1%. I think if he’s lucky it would be more like 1.5% after all is said and done. I won’t be surprised at all if it’s 2.5% or more. \nThat’s the investing reality. Whoever can reach people and sign them up charge an arm and a leg. That’s how they can afford the time and effort to reach people to begin with. We need all the marketing, PR, slick websites and mobile apps funded by venture capital dollars to change this. See All Your Accounts In One Place \nTrack your net worth, asset allocation, and portfolio performance with free financial tools from Personal Capital .", "external_links": [], "published": "2015-07-28T16:51:00.000+03:00", "crawled": "2015-07-29T16:14:36.980+03:00", "highlightTitle": ""}