{"organizations": [], "uuid": "e1efeb62ebd0274aa02a4e55bf4fed6cc217116c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/axisbank007072015.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/axis-bank-launches-one-touch-authentication-for-apple-users/42687.html", "country": "IN", "title": "Axis Bank launches one touch authentication for Apple users", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Axis Bank launches one touch authentication for Apple users", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T16:09:00.000+03:00", "replies_count": 0, "uuid": "e1efeb62ebd0274aa02a4e55bf4fed6cc217116c"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/axis-bank-launches-one-touch-authentication-for-apple-users/42687.html", "ord_in_thread": 0, "title": "Axis Bank launches one touch authentication for Apple users", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Axis Bank launches one touch authentication for Apple users 42687 Axis Bank launches one touch authentication for Apple users 0 Comments, Be the first to comment Bank customers using Apple iPhone 5s and above can now complete their financial transactions using Axis Bank's one touch authentication Axis Bank, India's third largest private sector bank, Tuesday unveiled 'Touch ID', its one touch authentication for transactions through its mobile app for customers who use Apple phones. \"Bank customers using Apple iPhone 5s and above can now complete their financial transactions such as bill payments, mobile recharge and funds transfer using this feature. Once the customer's fingerprint is set up on the Axis Mobile app, they can authenticate subsequent financial transactions by either using Touch ID or their mPIN,\" the lender said in a release. The bank has also launched its banking application for Apple Watch. Customers need to merely sync the Axis Mobile app with their Apple Watch to check their savings account balance, view last five transactions and notifications, access the 'Near Me' feature and search for ATMs, bank branches and offers near to them without any additional authentication. According to Rajiv Anand, Group Executive and Head Retail Banking, at Axis Bank, during June 2015, the Bank witnessed mobile transactions worth Rs2,400 crore through mobile banking. \"Considering the traction being witnessed in mobile banking, we plan to introduce other innovative mobility solutions in the near future. The launch of 'Touch ID' authentication and Axis Watch application for customers further reinforces our commitment to making banking simple and hassle free for our customers,\" he added.", "external_links": [], "published": "2015-07-07T16:09:00.000+03:00", "crawled": "2015-07-07T16:45:06.000+03:00", "highlightTitle": ""}