{"organizations": [], "uuid": "a61e17c0010469e6f4abeaf35d1b68da279ddbf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/Economy-Ret2.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/govt-must-deliver-on-promises-for-higher-growth-moodys/110965", "country": "IE", "title": "Govt must deliver on promises for higher growth: Moody’s", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Govt must deliver on promises for higher growth: Moody’s | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T03:14:00.000+03:00", "replies_count": 0, "uuid": "a61e17c0010469e6f4abeaf35d1b68da279ddbf5"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/govt-must-deliver-on-promises-for-higher-growth-moodys/110965", "ord_in_thread": 0, "title": "Govt must deliver on promises for higher growth: Moody’s", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Barack Obama urges supporters to lobby for Iran deal New Zealand business pessimism deepens, at six year-low: Survey China coal firms suffer H1 profit slump on weak demand Raising a red flag over “empty promises” of the Modi government, global giant Moody’s today said delay in key reforms is denting business confidence and the foreign investors are wary of investing in India.\nWhile pegging India’s true growth potential at near 10 per cent, Moody’s also warned that “GDP growth is not likely to rise above 7.5 per cent if the government continues to over-promise and not deliver”.\nIt further said that the “jury is still out on Prime Minister (Narendra) Modi”, but the government’s failure to deliver on promised reforms is a major impediment to a broader economic growth momentum in the country.\nIn a report titled ‘India’s Outlook: Waiting for Reforms to Fuel Growth’, Moody’s Analytics also cautioned against tampering with the independence of RBI in deciding on interest rates, saying it would hurt India’s economic prospects, even as it hoped that the central bank could effect two more 25 basis points rate cuts in 2015 to boost growth.\nA new draft of the Indian Financial Code has suggested creation of an interest rate-setting panel, where majority of seven members will be nominated by the government and the RBI chief would not have any veto power over the panel’s decision.\n“We believe that a government-elected panel undermines the RBI’s independence. Moving to the new model would severely dent the RBI’s competency: Credibility would be lower, politics would drive decisions, and transparency would be reduced,” the report said.\nMoody’s Analytics is the economic research analysis unit of Moody’s Corporation and is independent of Moody’s Investor Service, the credit rating agency of the US-based group.\n“Overall, we believe that tampering with the central bank’s independence would make it difficult to anchor inflation expectations. This would weigh on India’s economic prospects, particularly financial market stability,” it added.\nTerming this move a “dangerous road ahead”, the report said “a recent draft bill could undo the RBI’s good work”. It also added that India’s monetary policy has been effective with Governor Raghuram Rajan at the helm and hoped that given the criticism of the draft Indian Financial Code bill, it is unlikely to pass Parliament.\nTalking about “empty promises”, Moody’s said India’s political infighting is denting the business confidence.\nThe report said: “Without a majority in the Upper House, the ruling BJP ’s power has been nullified and the opposition has blocked proposed reforms.\n“Key reforms such as the land acquisition bill , flexible labour laws, and the Goods and Services Tax have failed to pass Parliament. And given the political seesaw, these are unlikely to be delivered until later this year or even 2016.”\nStating that the jury is still out on Modi, the report analysed the likelihood of passage of key reform bills. It said that there was “low likelihood” for passage of land acquisition bill and the flexible labour laws in 2015, while the probability was “medium” for the GST.\nIt, however, put the state asset sales in the “high” category.\nThe land acquisition bill is a catalyst to investment, it said, adding that passing the bill will improve India’s business environment by speeding up the conversion of land for infrastructure use.\n“Foreign firms are wary of investing in India, as lengthy delays in acquiring land tend to stall projects… If India is to catch up to global economic powerhouses such as China, reforms must be delivered swiftly,” Moody’s said.\nIt added that the economy has been in a cyclical upswing since late 2014, but it has failed to gain broader momentum.\n“Green shoots are slowly emerging, but the government’s failure to deliver promised reforms is the major impediment,” it said, while adding that there were signs that “not all is well for manufacturing, the key industry touted by the BJP to drive India’s growth engine”.\n“And manufacturing is not the only industry suffering — Purchasing Managers’ Indexes have dropped for both manufacturing and services in the past several months. The reform vacuum is largely to blame,” Moody’s said, while flagging concerns like weakness in private investments, stalled infrastructure projects and rise in bad loans as well.\n“A positive step higher is not likely without significant reform,” it added.\n 30, 2015 7:14 pm", "external_links": [], "published": "2015-07-31T03:14:00.000+03:00", "crawled": "2015-07-31T08:32:09.408+03:00", "highlightTitle": ""}