{"organizations": [], "uuid": "7713cfb903b4c3c5f6513c544e0957628763ec8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/illitracy007072015.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/how-rural-india-gained-86-mn-illiterate-people/42645.html", "country": "IN", "title": "How rural India gained 86 mn illiterate people", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "How rural India gained 86 mn illiterate people", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T08:46:00.000+03:00", "replies_count": 0, "uuid": "7713cfb903b4c3c5f6513c544e0957628763ec8f"}, "author": "IANS", "url": "http://www.moneylife.in/article/how-rural-india-gained-86-mn-illiterate-people/42645.html", "ord_in_thread": 0, "title": "How rural India gained 86 mn illiterate people", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » How rural India gained 86 mn illiterate people 42645 How rural India gained 86 mn illiterate people 0 Comments, Be the first to comment IANS | 07/07/2015 11:16 AM | About 86 million more rural Indians have been counted as illiterate than the 2011 census data found. This is revealed by the Socio Economic and Caste Census (SECC), which counted 315.7 million Indians in rural areas as illiterate in 2011, the same year as the census and the highest number of illiterates of any country in the world. Put another way, rural India has more illiterate people than the population of Indonesia – the world’s fourth-most populous country – and twice the population of Pakistan. Released last week, the SECC, which focused on rural India, counted more people (literate and illiterate) than the census: 35.73 percent of Indians in rural areas as illiterate, as against 32.23 percent counted by census 2011. The new data has also revealed the low levels of literacy in rural India. Those who are literate can barely read or count As many as 14 percent (123 million people) of literate Indians in rural areas have not studied past class five, while 18 percent (157 million) have completed primary education, or class five. Given that educational levels in India do not reflect real learning, 280 million literate Indians in rural areas are only nominally literate. As IndiaSpend reported earlier, only a fourth of all children in class III can read a class II text fluently, a drop of more than 5 percent over four years. With math, a quarter of children in class III could not recognise numbers between 10 and 99, a drop of 13 percent over four years, according to the 2014 Annual Status Report on Education (ASER). Only 3 percent (three million) of Indians in rural areas have completed graduation or a higher level of education. Central India reported the highest illiteracy rate of 39.20 percent and east India 38.79 percent, followed by west India (35.15 percent), north India (32.87 percent), the northeast (30.2 percent) and south India (29.64 percent). Union territories fared the best with less than 15 percent of the population illiterate. Rajasthan reported the worst illiteracy rate: 47.58 percent or 25.88 million people, followed by Madhya Pradesh with 44.19 percent or 22.80 million illiterate people, Bihar with 43.85 percent or 42.89 million illiterate people and Telangana with 40.42 percent or 9.5 million illiterate people. The surprises are the presence of the southern states of Telangana and Andhra Pradesh in the top 10 state for illiteracy. Kerala is another surprise in the SECC analysis. While state surveys and the census have repeatedly claimed a literacy rate of more than 90 percent, the SECC report says 11.38 percent, or 3 million Keralites, are illiterate. Among union territories, Dadra & Nagar Haveli reported the highest illiteracy rate of 36.29 percent. More in Moneylife", "external_links": [], "published": "2015-07-07T08:46:00.000+03:00", "crawled": "2015-07-07T09:42:54.000+03:00", "highlightTitle": ""}