{"organizations": [], "uuid": "7584f0c226a0932ddb6cc7fb95b5b0f8e25a3c4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "http://a.abcnews.com/images/Business/ht_fixer_monster_lf_150707_16x9_992.jpg", "site_section": "http://abcnews.go.com/GMA/ConsumerNews/", "section_title": "Business News, Personal Finance and Money News - ABC News", "url": "http://abcnews.go.com/Business/buying-monster-tablet-turns-moms-monster-headache/story?id=32279546", "country": "US", "title": "Buying Monster Tablet Turns Into Mom’s Monster Headache", "performance_score": 0, "site": "go.com", "participants_count": 1, "title_full": "Buying Monster Tablet Turns Into Mom’s Monster Headache - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "7584f0c226a0932ddb6cc7fb95b5b0f8e25a3c4a"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Business/buying-monster-tablet-turns-moms-monster-headache/story?id=32279546", "ord_in_thread": 0, "title": "Buying Monster Tablet Turns Into Mom’s Monster Headache", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dear ABC News Fixer: Last summer I bought two Monster tablets for my kids’ digital books. They were $169.99 each, plus I bought the extended warranty. Unfortunately, one of them had a loose charging port. I contacted the Walmart store where I bought them, but because it was outside their return period, they referred me to the manufacturer. Believe it or not, it has been almost a year since I sent the broken tablet to the manufacturer. Monster’s customer service just keeps telling me they haven't been able to run the diagnostic process on the tablet. At this point I would like my money back or another tablet!\nEditor's Picks The Comcast Contract Surprise\n- Ada Reyes, Bayamon, Puerto Rico Got a consumer problem? The ABC News Fixer may be able to help. Click here to submit your problem online . Letters are edited for length and clarity.\nDear Ada: That must be some fancy diagnostic process, if it takes almost a year to conduct. Sheesh. You showed us your documentation, including lots of emails back and forth with the company, and you weren’t kidding: they’ve had your kid’s computer since August 2014.\nYou told us you bought both tablets on June 12, 2014 but didn’t unpack them from their boxes until the following month because you didn’t want the kids to load them up with games all summer. By the time you tried them out and discovered the defective charging port, it was too late to return them to Walmart.\nWe got in touch with Sara Trujillo, spokeswoman for Monster Inc., and asked her to help track down your MIA tablet. She got back to us right away. She said they’re still trying to figure out why there was such a long delay, but to make things right they’ve decided to just send you a new one. You also got a personal call from a company representative apologizing for the mix-up.\nYour story reminds us all to check stores’ return policies carefully, especially for expensive items or things that may carry a restocking fee. And unpack the item before the return period ends, just in case there’s a problem.\n- The ABC News Fixer\nCLICK HERE to go to The ABC News Fixer homepage", "external_links": ["http://a.abcnews.com/images/Business/ap_comcast_time_warner_wy_150424_16x9t_144.jpg", "http://www.abcnews.com/fixer", "http://twitter-badges.s3.amazonaws.com/follow_me-c.png", "http://www.twitter.com/abcnewsfixer"], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-08T04:26:06.000+03:00", "highlightTitle": ""}