{"organizations": [], "uuid": "b889997b9918f2f730743e209a912cbde6bbf12e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "", "site_section": "http://www.marketwire.com/rss/mwFSPF.xml", "section_title": "Marketwired - Personal Finance", "url": "http://www.marketwired.com/press-release/1st-constitution-bancorp-reports-second-quarter-2015-results-nasdaq-fccy-2041212.htm", "country": "CA", "title": "1ST Constitution Bancorp Reports Second Quarter 2015 Results", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "1ST Constitution Bancorp Reports Second Quarter 2015 Results", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T16:15:00.000+03:00", "replies_count": 0, "uuid": "b889997b9918f2f730743e209a912cbde6bbf12e"}, "author": "", "url": "http://www.marketwired.com/press-release/1st-constitution-bancorp-reports-second-quarter-2015-results-nasdaq-fccy-2041212.htm", "ord_in_thread": 0, "title": "1ST Constitution Bancorp Reports Second Quarter 2015 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 23, 2015 09:15 ET 1ST Constitution Bancorp Reports Second Quarter 2015 Results \nCRANBURY, NJ--(Marketwired - Jul 23, 2015) - 1 ST Constitution Bancorp ( NASDAQ : FCCY ), the holding company (the \"Company\") for 1 ST Constitution Bank (the \"Bank\"), today reported net income for the second quarter of 2015 of $2.3 million, a 27% increase, compared to Adjusted Net Income of $1.8 million for the second quarter of 2014. Net income per diluted share for the second quarter of 2015 was $0.30, a 25% increase, compared to Adjusted Net Income per diluted share of $0.24 for the second quarter of 2014. Net loss and net loss per diluted share as reported for the second quarter of 2014 were $440,000 and $0.06, respectively. \nThe significant increase in net income for the second quarter of 2015 compared to Adjusted Net Income for the second quarter of 2014 was due primarily to the $1.0 million increase in net interest income to $9.4 million, which was driven by the growth of the Bank's loan portfolio in 2015. Non-interest income for the second quarter of 2015 increased $357,000 to $1.6 million due to higher gains from the sales of residential mortgages and SBA guaranteed commercial loans. \nReturn on average assets was 0.94% and return on average equity was 10.33% for the second quarter of 2015 compared to Adjusted Return on Assets and Adjusted Return on Equity of 0.76% and 8.90%, respectively, for the second quarter of 2014. \nFor the six months ended June 30, 2015, the Company reported net income of $4.6 million, a 36% increase, compared to Adjusted Net Income of $3.4 million for the six months ended June 30, 2014. Net income per diluted share was $0.60 for the six months ended June 30, 2015, a 33% increase, compared to Adjusted Net Income per diluted share of $0.45 for the six months ended June 30, 2014. Net income and net income per diluted share as reported for the six months ended June 30, 2014 were $202,000 and $0.03, respectively. \nAdjusted Net Income excludes the after-tax effect of merger related expenses that were incurred in the first and second quarters of 2014 in connection with the merger of Rumson-Fair Haven Bank and Trust Company (\"Rumson\") with and into the Bank on February 7, 2014 and the provision for loan losses related to the full charge-off of a loan participation due to fraudulent misrepresentations by the borrower and its principals recorded in the second quarter of 2014. Adjusted Net Income, Adjusted Net Income per diluted share, Adjusted Return on Assets and Adjusted Return on Equity are non-GAAP measures. A reconciliation of these non-GAAP measures to the reported net income, net income per diluted share, return on average assets and return on average equity is included in this release. \nSecond Quarter Highlights Net interest income was $9.4 million in the second quarter of 2015 compared to $8.5 million in the first quarter of 2015 and $8.4 million in the second quarter of 2014. The net interest margin for each of these periods was 4.19%, 3.96% and 3.89%, respectively. During the second quarter of 2015 the total loan portfolio increased $48.3 million, or 6.8%, to $758.5 million at June 30, 2015. Mortgage warehouse lines outstanding increased $46.7 million to $279.7 million at June 30, 2015, reflecting higher levels of residential mortgage loan originations by the Bank's mortgage banking customers due to the seasonal home buying market and favorable residential mortgage interest rates. Approximately 52% of the $1.1 billion of funding activity during the second quarter was for the purchase of a home and home purchase loans represented 62% of the outstanding mortgage warehouse loans at June 30, 2015. The loan to asset ratio increased to 72% at June 30, 2015 compared to 68% at December 31, 2014 and 64% at June 30, 2014. No provision for loan losses was recorded for the second quarter of 2015 due to the Bank's stable loan quality, the insignificant level of net-charge-offs and a reduction in the Bank's loan loss reserve factors based on management's assessment of strengthening economic conditions in the Bank's markets and stable asset quality trends. SBA loan sales were $5.2 million and generated gains on sales of loans of $513,000, and SBA commercial loan originations were $3.6 million during the second quarter of 2015. During the second quarter of 2015, the Bank's residential mortgage banking operation originated $43.3 million of residential mortgages and sold $43.8 million of residential mortgage loans, which generated gains from the sales of loans of $314,000. At June 30, 2015, the pipeline of residential mortgage loans in process was $68.8 million. The Company's efficiency ratio for the second quarter of 2015 was 67.4% compared to 61.7% for the first quarter of 2015 and 66.5% for the second quarter of 2014, excluding the after tax effect of the merger expenses. Write-down of one OREO property and related expenses and higher collection and asset recovery expenses for other assets impacted the efficiency ratio during the second quarter of 2015. \nRobert F. Mangano, President and Chief Executive Officer, stated, \"We experienced strengthening loan origination volume in our SBA, construction and residential mortgage banking operations during the first six months of 2015. Our mortgage warehouse lending operation, which finances mortgage bankers, was the principal driver of loan growth during the second quarter of 2015 and benefited from higher levels of loan originations for home purchases and continued mortgage refinancing activity due to the favorable residential mortgage interest rates and a reduction in insurance fees charged by the FHA. The level of future financing activity will depend on a number of market factors.\" \nMr. Mangano added, \"Improving economic conditions in our markets, our stable loan credit quality and moderate estimated loan losses are reflected in our decision to not increase our loan loss reserve during the second quarter of 2015. Our net income has exceeded $2 million in each of the last four quarters and provides a strong base for growth.\" \nDiscussion of Financial Results \nNet interest income was $9.4 million for the second quarter ended June 30, 2015, an increase of $870,000, or 10.2%, compared to $8.5 million for the first quarter of 2015 and an increase of $1.0 million, or 12.3%, compared to $8.4 million for the second quarter ended June 30, 2014. The $1.0 million increase compared to the second quarter of 2014 was due primarily to the increase in the loan portfolio and the higher proportion of average loans to average assets, which generated the higher yield on earning assets of 4.70% compared to 4.42% in the second quarter of 2014. \nInterest expense on average interest bearing liabilities was 0.64% in the second quarter of 2015 compared to 0.66% in the first quarter of 2015 and 0.67% in the second quarter of 2014. The decline in the interest cost of interest bearing liabilities in the second quarter of 2015 also contributed to the expansion of the net interest margin to 4.19% in the second quarter of 2015. \nNo provision for loan losses was recorded in the second quarter of 2015 compared to $500,000 for the first quarter of 2015 and $4.1 million for the second quarter of 2014. No provision for loan losses was recorded in the second quarter of 2015 due to the insignificant level of net charge-offs, the Bank's stable loan quality trends over the last four quarters and management's judgment that the loan loss reserve factors should be reduced to reflect the strengthening economic conditions in the Bank's markets, stable loan quality trends and the level of estimated loss in the loan portfolio. \nNon-interest income was $1.6 million for the second quarter of 2015, a decrease of $267,000, or 14.2%, compared to $1.9 million for the first quarter of 2015, and an increase of $357,000, or 28.3%, compared to $1.3 million for the second quarter of 2014. Lower gains from the sales of SBA and residential mortgage loans and lower service charges on deposit accounts in the second quarter of 2015 were the principal reason for the decrease in non-interest income compared to the first quarter of 2015. Gains from the sale of SBA and residential mortgage loans in the second quarter of 2015 were higher than the gains from the sales of these loans in the second quarter of 2014. \nNon-interest expenses were $7.6 million for the second quarter of 2015, an increase of $991,000, or 15.0%, compared to $6.6 million for the first quarter of 2015, and an increase of $1.0 million, or 15.2%, compared to $6.6 million, excluding the effect of the Rumson merger expenses, for the second quarter of 2014. Approximately $382,000 of the increase in non-interest expenses in the second quarter of 2015 compared to the first quarter of 2015 and the second quarter of 2014 reflected the write-down of one OREO property to the net realizable value of the contract for sale that was pending at June 30, 2015. The property had a current carrying value (after the write-down) of $1.4 million at June 30, 2015. Professional fees related to the collection and recovery of non-performing assets were $373,000 in the second quarter of 2015 compared to $151,000 in the first quarter of 2015 and $147,000 in the second quarter of 2014. The balance of the increase reflected higher employee compensation and benefits expense due to increases in staffing and additional operating costs due to the growth and expansion of the Bank's operations. \nIncome taxes were $1.1 million, which resulted in an effective tax rate of 32.4% for the second quarter of 2015 compared to $1.1 million and an effective tax rate of 31.8% for the first quarter of 2015 and a tax benefit of $728,000 and a net tax benefit rate of 62.3% for the second quarter of 2014. The increase in income taxes was due to the significantly higher amount of pre-tax income in the second quarter of 2015 compared to the net loss before taxes in the second quarter of 2014. The high effective tax benefit rate in the second quarter of 2014 was due to the amount of tax exempt interest income relative to the pre-tax loss in that quarter. \nAt June 30, 2015, the allowance for loan losses was $7.4 million, a $426,000 increase from the allowance for loan losses at December 31, 2014. As a percentage of total loans, the allowance was 0.97% at the end of the second quarter of 2015 compared to 1.06% at year-end 2014. With respect to the acquired Rumson loans of approximately $103 million at June 30, 2015, the accretable general credit discount was $873,000 and the non-accretable credit discount was $546,000. \nTotal assets increased $90.1 million to $1.05 billion at June 30, 2015 from $957 million at December 31, 2014 due principally to the $104.2 million increase in loans and the $105.6 million increase in FHLB borrowings that were used primarily to fund the increase in loans. Total portfolio loans at June 30, 2015 were $758.5 million compared to $654.3 million at December 31, 2014. Total investment securities at June 30, 2015 were $207.2 million , a decrease from $223.8 million at December 31, 2014. Total deposits at June 30, 2015 were $798.1 million compared to $817.8 million at December 31, 2014. The decrease in deposits was due primarily to the outflow of municipal deposits acquired in the Rumson merger and certificates of deposit. \nRegulatory capital ratios continue to reflect a strong capital position. Under the new regulatory capital standards (Basel III) that became effective on January 1, 2015, the Company's common equity Tier 1 to risk based assets (\"CET1\") ratio, total risk-based capital ratio, Tier I capital ratio and Leverage ratio were 8.71%, 11.49%, 10.69% and 9.88%, respectively, at June 30, 2015. The Bank's CET1 ratio, total risk-based capital ratio, Tier 1 capital ratio and Leverage ratio were 10.44%, 11.24%, 10.44% and 9.77%, respectively, at June 30, 2015. The Company and the Bank are considered \"well capitalized\" under the new capital standards. \nAsset Quality Net charge-offs during the second quarter of 2015 were $13,000. Non-accrual loans were $4.6 million at June 30, 2015 compared to $4.5 million at December 31, 2014. The allowance for loan losses was 159% of non-accrual loans at June 30, 2015 compared to 153% of non-accrual loans at December 31, 2014. \nOverall, we observed stable trends in loan quality with net charge-offs of $13,000 during the second quarter of 2015 and non-performing loans to total loans of 0.61% and non-performing assets to total assets of 0.96% at June 30, 2015. \nOREO at June 30, 2015 was comprised of three properties that totaled $5.3 million compared to $5.7 million at December 31, 2014. \nAbout 1 st Constitution Bancorp 1 ST Constitution Bancorp, through its primary subsidiary, 1 ST Constitution Bank, operates 19 branch banking offices in Cranbury (2), Fort Lee, Hamilton, Hightstown, Hillsborough, Hopewell, Jamesburg, Lawrenceville, Perth Amboy, Plainsboro, Rocky Hill, West Windsor, Princeton, Rumson, Fair Haven, Shrewsbury, Oceanport and Asbury Park, New Jersey. \n1 ST Constitution Bancorp is traded on the Nasdaq Global Market under the trading symbol \"FCCY\" and can be accessed through the Internet at www.1STCONSTITUTION.com \nThe foregoing contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are not historical facts and include expressions about management's confidence and strategies and management's expectations about new and existing programs and products, relationships, opportunities, taxation, technology and market conditions. These statements may be identified by such forward-looking terminology as \"expect,\" \"look,\" \"believe,\" \"anticipate,\" \"may,\" \"will,\" or similar statements or variations of such terms. Actual results may differ materially from such forward-looking statements. Factors that may cause results to differ materially from such forward-looking statements include, but are not limited to, changes in the direction of the economy in New Jersey, the direction of interest rates, effective income tax rates, loan prepayment assumptions, continued levels of loan quality and origination volume, continued relationships with major customers including sources for loans, a higher level of net loan charge-offs and delinquencies than anticipated, bank regulatory rules, regulations or policies that restrict or direct certain actions, the adoption, interpretation and implementation of new or pre-existing accounting pronouncements, a change in legal and regulatory barriers including issues related to compliance with anti-money laundering and bank secrecy act laws, as well as the effects of general economic conditions and legal and regulatory barriers and structure. 1 ST Constitution Bancorp assumes no obligation for updating any such forward-looking statements at any time, except as required by law.", "external_links": [], "published": "2015-07-23T16:15:00.000+03:00", "crawled": "2015-07-23T16:20:52.949+03:00", "highlightTitle": ""}