{"organizations": [], "uuid": "ddda6996820fe9bc127110abcb924b8e2edfaf29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=13091_3837.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/orrick-s-financial-industry-week-in-93657/", "country": "US", "title": "Orrick's Financial Industry Week in Review", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Orrick's Financial Industry Week in Review", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T05:04:00.000+03:00", "replies_count": 0, "uuid": "ddda6996820fe9bc127110abcb924b8e2edfaf29"}, "author": "Orrick, Herrington &amp; Sutcliffe LLP", "url": "http://www.jdsupra.com/legalnews/orrick-s-financial-industry-week-in-93657/", "ord_in_thread": 0, "title": "Orrick's Financial Industry Week in Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Orrick's Financial Industry Week in Review more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=9529d6e0-40a4-4186-8bbb-40d6f5bc991c\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> Financial Industry Developments Federal Reserve Releases First Determination of Aggregate Consolidated Liabilities of all Financial Companies \nOn July 1, the Federal Reserve Board released its first determination of the aggregate consolidated liabilities of all financial companies in accordance with section 622 of the Dodd-Frank Act, which prohibits any financial company from combining with another company if the resulting company's liabilities exceed 10 percent of the aggregate consolidated liabilities of all financial companies. Release . SEC Proposes Rules Requiring Companies to Adopt Clawback Policies on Executive Compensation \nOn July 1, the Securities and Exchange Commission proposed rules directing national securities exchanges and associations to establish listing standards requiring companies to adopt policies that require executive officers to pay back incentive-based compensation that they were awarded erroneously. Recovery would be required without regard to fault. The proposed rules would also require disclosure of listed companies' recovery policies, and their actions under those policies. The comment period for the proposed rules will be 60 days after publication in the Federal Register. Release . FHFA Releases Annual Guarantee Fee Report \nOn June 30, the Federal Housing Financing Agency released its annual report on the single-family guarantee fees charged by Fannie Mae and Freddie Mac, which tracks how guarantee fees have increased from 2009 through 2014. Release . CFTC Issues Proposed Rule on Cross-Border Margin \nOn June 29, the U.S. Commodity Futures Trading Commission voted unanimously to propose a rule that would apply the Commission's margin requirements for uncleared swaps in the context of cross-border transactions (Proposed Rule). The Proposed Rule would apply to Commission-registered swap dealers and major swap participants that are not subject to the margin requirements of other prudential regulators, such as the Federal Reserve Board, Office of the Comptroller of the Currency, and the Federal Deposit Insurance Corporation (collectively, covered swap entities). The comment period ends 60 days after the publication in the Federal Register. Release . FDIC, Federal Reserve and Office of Comptroller of the Currency Issue Host State Loan-to-Deposit Ratios \nOn June 29, the Federal Deposit Insurance Corporation, Board of Governors of the Federal Reserve System and Office of the Comptroller of the Currency issued the host state loan-to-deposit ratios that they will use to determine compliance with section 109 of the Riegle-Neal Interstate Banking and Branching Efficiency Act of 1994. Joint Release . Madden v. Midland Funding, LLC \nOn May 22, the Second Circuit Court of Appeals ruled that when a nonbank entity purchases loans from a national bank, the interest rate the nonbank entity may charge is limited to the rate of interest of the state of residence of the obligor (See Madden v. Midland Funding, LLC 2015 U.S. App. LEXIS 8483 (May 22, 2015). The court stated that because the entity is not a national bank or its agent, or otherwise acting on behalf of a national bank, and because applying state law would not significantly interfere with the national bank's ability to sell loans to third parties, the National Bank Act did not preempt the obligor's claim that the rate charged on the loan exceeded state rate ceilings. Opinion . Rating Agency Developments \nOn June 30, DBRS released its Global Methodology for Rating Banks and Banking Organisations . Report . \nOn June 30, S&P revised its Covered Bond Ratings Framework: Methodology and Assumptions . Report . Investment Management Personal Securities Transactions Reports By Registered Investment Advisers: Securities Held In Accounts Over Which Reporting Persons Had No Influence Or Control \nIn a recent Guidance Update, the Staff of the Division of Investment Management of the Securities and Exchange Commission addressed certain issues arising under Section 204A of the Investment Advisers Act of 1940 which requires registered investment advisers to maintain and enforce written policies and procedures reasonably designed to prevent the firm or its employees from misusing material nonpublic information. \nIn particular, Rule 204A-1 thereunder provides that an adviser's Code of Ethics must include requirements that certain advisory personnel report personal securities trading to provide a mechanism for the adviser and examiners to identify improper trades or patterns of trading. The Rule was designed, in part, to prevent the misuse of material nonpublic information, including the misuse of material nonpublic information about a registered adviser's securities recommendations, and client securities holdings and transactions. \nAmong the issues addressed in the Guidance Update is whether certain arrangements satisfactorily establish that an access person's securities are held in an account over which he or she had \"no direct or indirect influence or control\" and, accordingly, under the Rule are not required to be reported. The Guidance provides that if an access person provides a trustee with management authority over a trust for which he or she is grantor or beneficiary, or provides a third-party manager discretionary investment authority over his or her personal account, that, by itself, is insufficient for an adviser to reasonably believe that the access person had no direct or indirect influence or control over the trust or account. The Guidance then addresses certain arrangements that the adviser may be able to implement that could establish a reasonable belief that an access person had no direct or indirect influence or control over the trust or account and could, accordingly, rely upon the exception. RMBS and Other Securities Litigation Goldman Sachs's Motion to Dismiss Mostly Denied in $73M RMBS Suit \nOn June 29, 2015, Justice Eileen Bransten of New York Supreme Court granted Goldman Sachs Group Inc.'s (\"Goldman\") motion to dismiss a cause of action for negligent misrepresentation but denied Goldman's motion to dismiss causes of action for fraud. IKB Deutche Industriebank AG (\"IKB\") had sued Goldman over losses that IKB suffered after it purchased $73.2 million in RMBS. IKB filed the suit in September 2012, alleging that Goldman fraudulently induced IKB to purchase the RMBS by providing offering materials for the RMBS that misrepresented or omitted details about underwriting standards, loan-to-value ratios, occupancy rates of the mortgaged properties, and credit ratings. Goldman sought dismissal on the grounds that IKB's claims were time-barred, that IKB lacked standing to sue, and that IKB's allegations failed to state a claim. \nJustice Bransten found that it would be premature to determine whether IKB was a proper party before conducting discovery. She rejected Goldman's argument that IKB filed the case after the three-year German statute of limitations for fraud had run, finding that the claims accrued in Luxembourg, not Germany. Accordingly, Justice Bransten determined that New York's six-year statute of limitations—not Germany's—applied and that Goldman had not argued that the claims were time-barred under that longer period. Justice Bransten dismissed IKB's claim for negligent misrepresentation, finding that IKB's allegations did not describe the necessary special relationship between the parties, but rather an ordinary arms-length relationship. Finally, Justice Bransten held that IKB had sufficiently pleaded its fraud claims. Order . U.S. Bank Sues Countrywide for $178M in RMBS Losses \nOn June 25, 2015, U.S. Bank, in its capacity as Trustee for the LXS 2007-7N Trust, filed a summons with notice in New York Supreme Court against Countrywide Home Loans (\"CHL\"), Countrywide Home Loans Servicing LP (\"Countrywide Servicing\"), and others, seeking to recover $178 million in losses over alleged breaches of representations and warranties made about the sold to the Trust. U.S. Bank alleges that, despite receiving repurchase demands in connection with allegedly breaching loans, CHL failed to cure or repurchase the loans, or indemnify the Trust for the resultant losses. U.S. Bank also claims that Countrywide Servicing failed to notify the Trustee when it discovered breaches, and failed to force CHL to repurchase or substitute such breaching loans. U.S. Bank seeks specific performance, declaratory relief, damages, indemnification, and prejudgment interest. Summons with Notice . Events Orrick Breakfast Briefing: BitLicense and the Virtual Currency Regulatory Landscape \nWhat does the BitLicense require and how will the newly finalized New York State BitLicense regulations affect participants in the virtual currency space? In addition to BitLicense, what regulatory requirements are being developed or imposed in other jurisdictions? This program is meant to inform businesses, investors, entrepreneurs, lawyers and others on the state of virtual currency regulation. New York CLE credit will be offered. \nDate : Monday, July 20 Location : Orrick's New York Office To register for this event, please click here ​​.​​", "external_links": [], "published": "2015-07-10T05:04:00.000+03:00", "crawled": "2015-07-10T05:07:12.000+03:00", "highlightTitle": ""}