{"organizations": [], "uuid": "5ac30d2304e858623c74bedf41225e5b5fe354ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-health-care/?format=rss", "section_title": "Health Care News | Pharmaceutical News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/problematic-diabetes-drugs-may-protect-180000083.html", "country": "US", "title": "Problematic diabetes drugs may protect against Parkinson's", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Problematic diabetes drugs may protect against Parkinson's", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T21:00:00.000+03:00", "replies_count": 0, "uuid": "5ac30d2304e858623c74bedf41225e5b5fe354ce"}, "author": "", "url": "https://uk.finance.yahoo.com/news/problematic-diabetes-drugs-may-protect-180000083.html", "ord_in_thread": 0, "title": "Problematic diabetes drugs may protect against Parkinson's", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 22, 2015, 06:07 BST - UK Markets open in 1 hr 53 mins Problematic diabetes drugs may protect against Parkinson's Reuters - UK Focus – 11 hours ago 21.10 -0.65 \nLONDON, July 21 (Reuters) - Two problematic diabetes drugs associated with worrying side effects may reduce the risk of patients developing Parkinson's disease, offering a springboard for further research, scientists said on Tuesday. \nAn analysis of more than 160,000 British diabetics found that those taking either rosiglitazone or pioglitazone had a 28 percent lower incidence of Parkinson's than people taking other diabetes treatments. \nThe two medicines, which are now off-patent, were developed by GlaxoSmithKline (Other OTC: GLAXF - news ) and Takeda, respectively, and sold under the brand names Avandia and Actos. \nRosiglitazone use was curbed due to heart concerns, although restrictions were later lifted, while pioglitazone was hit by concerns over a possible link to bladder cancer. \nThe scientists, who published their findings in the journal PLOS Medicine, do not recommend these drugs be used to treat Parkinson's directly but rather that the biological pathways they activate should be explored in future research. \n\"We often hear about negative side effects associated with medications, but sometimes there can also be unintended beneficial effects,\" said senior researcher Ian Douglas from the London School of Hygiene & Tropical Medicine \n\"Our findings provide unique evidence that we hope will drive further investigation into potential drug treatments for Parkinson's disease.\" \nThe study was funded by the Michael J Fox Foundation for Parkinson's Research. \nIt only included patients with diabetes who had not been diagnosed with Parkinson's and therefore could not show whether taking the drugs might slow or prevent progression of the degenerative brain disease. \nAnother recently published clinical trial found that pioglitazone was unlikely to modify progression in early Parkinson's. (Reporting by Ben Hirschler; Editing by Pravin Char)", "external_links": [], "published": "2015-07-21T21:00:00.000+03:00", "crawled": "2015-07-22T08:12:07.535+03:00", "highlightTitle": ""}