{"organizations": [], "uuid": "011c6019b69dd1a0fe98b6747bf9450df188b602", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/14/diary-top-econ-idUSL4N0ZT4F020150714", "country": "US", "title": "DIARY-Top Economic Events to July 27", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "DIARY-Top Economic Events to July 27 | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T04:00:00.000+03:00", "replies_count": 0, "uuid": "011c6019b69dd1a0fe98b6747bf9450df188b602"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/14/diary-top-econ-idUSL4N0ZT4F020150714", "ord_in_thread": 0, "title": "DIARY-Top Economic Events to July 27", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 14 For other diaries, please see:\nU.S. Federal Reserve\nPolling unit diary\nToday in Washington\nPolitical and general news\nIndex of all diaries\nMajor central bank events\n** This Diary is filed daily **\nTUESDAY, JULY 14 LONDON - Bank of England's monetary policy member David Miles speaks at the Resolution Foundation on \"Weathering the storm: The recent past, present and future of UK monetary policy\" - 1700 GMT. LONDON - Bank of England Governor Mark Carney and other policymakers appears before UK Parliament Treasury Committee - 0915 GMT. BRUSSELS - Meeting of Economic and Financial Affairs Council. European Central Bank Vice President Vitor Constancio to participate. FRANKFURT - European Central Bank board member Yves Mersch speaks at a conference on \"Patch to dynamic growth in Germany\" - 1445 GMT. TOKYO - Bank of Japan holds monetary policy committee meeting (to July 15).\nWEDNESDAY, JULY 15\nWASHINGTON - Federal Reserve Chair Janet Yellen delivers semi-annual testimony on monetary policy before the House Financial Services Committee - 1400 GMT. KANSAS CITY, United States - Federal Reserve Bank of Kansas City President Esther George speaks on economic conditions and monetary policy before the Federal Reserve Bank of Kansas City 2015 Agricultural Symposium - 0015 GMT. COLUMBUS, United States - Federal Reserve Bank of Cleveland President Loretta Mester speaks on the economic outlook and participates in live interview before the Columbus Metropolitan Club Forum - 1625 GMT. WASHINGTON - Federal Reserve issues the Beige Book of economic conditions - 1800 GMT. MESA, United States - Federal Reserve Bank of San Francisco President John Williams speaks on the economic outlook before the Mesa Chamber of Commerce - 1900 GMT. PHOENIX, United States - Federal Reserve Bank of San Francisco President John Williams gives brief summary on the economy before a Greater Phoenix Economic Council panel on economic trends- 2200 GMT. THE HAGUE - Eurogroup Chair Jeroen Dijsselbloem briefs Dutch parliamentary committee on developments in Greece - 1130 GMT.\nOTTAWA - Bank of Canada key policy interest rate announcement and Monetary Policy Report - 1100 GMT. OTTAWA - Bank of Canada Governor Stephen Poloz holds a news conference - 1515 GMT. STOCKHOLM - Swedish central bank will publish the minutes of the executive board's monetary policy meeting - 0730 GMT. TOKYO - Bank of Japan announces interest rate decision - 0200 GMT.\nTHURSDAY, JULY 16\nWASHINGTON - Federal Reserve Chair Janet Yellen delivers semi-annual testimony on monetary policy before the Senate Banking Committee - 1400 GMT. FRANKFURT - European Central Bank Governing Council meeting, followed by interest rate announcement and news conference - 1145 GMT.\nFRIDAY, JULY 17 WASHINGTON - Federal Reserve Vice Chair Stanley Fischer participates in \"The Federal Reserve: a Conversation with Vice Chair Stanley Fischer\" before the U.S. Chamber of Commerce - 1400 GMT.\nTUESDAY, JULY 21 SYDNEY - Reserve Bank of Australia to publish the minutes of July interest rate meeting - 0130 GMT. BANGKOK - Bank of Japan Governor Haruhiko Kuroda speaks at the Cambridge Society of Thailand - 1315 GMT.\nWEDNESDAY, JULY 22\nSYDNEY - Reserve Bank of Australia Governor Glenn Stevens speaks at the Anika Foundation Luncheon - 0305 GMT. THURSDAY, JULY 23\nWELLINGTON - Reserve Bank of New Zealand announces Official Cash Rate.\nMONDAY, JULY 27 KUMAMOTO, Japan - Bank of Japan Deputy Governor Hiroshi Nakaso speaks in Kumamoto - 0130 GMT.", "external_links": [], "published": "2015-07-14T04:00:00.000+03:00", "crawled": "2015-07-14T03:17:18.000+03:00", "highlightTitle": ""}