{"organizations": [], "uuid": "50095c6fcfb3109a0e7009c7279c2cf5e8fe0ab9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/how-forums-can-help-you-promote-your-offers?cid=rss", "country": "US", "title": "How Forums Can Help You Promote Your Offers", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "How Forums Can Help You Promote Your Offers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T21:14:00.000+03:00", "replies_count": 0, "uuid": "50095c6fcfb3109a0e7009c7279c2cf5e8fe0ab9"}, "author": "Nelson Tan, Dothan Internet Marketing Examiner", "url": "http://www.examiner.com/article/how-forums-can-help-you-promote-your-offers?cid=rss", "ord_in_thread": 0, "title": "How Forums Can Help You Promote Your Offers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How Forums Can Help You Promote Your Offers Use your key for the next article Comment \nForums are a good way to get exposure for your links and meet new people and prospects on the side that might benefit you. I’ll be showing you step by step how you can get traffic (that’s free) from forums. \nNiche Identification \nTo get started, you’d probably want to find a forum that’s within your niche. You can easily find some by going to your search engine and type in your niche followed by the word “forum”. \nExamples: dog daycare forums, car maintenance forums, etc. \nMake sure that the forums that you find are active, meaning they have lots of posted messages every day. \nHelpful Tip: A good way to find more forums is simply asking on the forum itself for other similar forums. \nOnce you’ve found your forums, it’s time to provide value by posting and building your reputation in the forum. \nBuild Your Forum Reputation \n1. Register for an account, and learn and observe the forum and the posts. Make sure to read the rules to avoid being banned or rejected from the forum. Try not to barge in on any discussions and be courteous, as you would in any other social situation. Understand the members as well as the environment. Browse around and get a feel of what is appropriate and inappropriate to post. \n2. Start posting once you’re ready. Try to introduce yourself first. Then continue on and start answering questions and post your own if you have any. \n3. Build your reputation through steady and valuable contributions to the forum. Try to help people on the forum out by answering questions as helpfully and thoroughly as possible. \nAfter you’ve establish your reputation, which could take several days to several weeks, it’s time to include your signature in your posts. Rules for signatures vary with each forum, so make sure to read it before setting one up. \nHave it oriented towards the reader and include benefits, like how your promotion can offer a discount, or solve their problems. Try to arouse their interest. Spark up their curiosity by offering them an exclusive deal or benefit. \nAnd also, don’t forget to try to build relationships as well within the forum while you’re posting. As mentioned before, a forum is a social community, and building a good relationship will lead to opportunities where you least expect them.", "external_links": [], "published": "2015-07-09T21:14:00.000+03:00", "crawled": "2015-07-09T21:46:08.000+03:00", "highlightTitle": ""}