{"organizations": [], "uuid": "e52847c5c6195270ab8df7bf93ad636cd0a22f66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-02/japan-stocks-rise-amid-greek-optimism-as-yen-falls-on-u-s-data", "country": "US", "title": "Japan Stocks Rise Amid Greek Optimism as Yen Falls on U.S. Data", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Japan Stocks Rise Amid Greek Optimism as Yen Falls on U.S. Data - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T08:03:00.000+03:00", "replies_count": 0, "uuid": "e52847c5c6195270ab8df7bf93ad636cd0a22f66"}, "author": "Yuji Nakamura", "url": "http://www.bloomberg.com/news/articles/2015-07-02/japan-stocks-rise-amid-greek-optimism-as-yen-falls-on-u-s-data", "ord_in_thread": 0, "title": "Japan Stocks Rise Amid Greek Optimism as Yen Falls on U.S. Data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Japanese stocks rose after U.S. economic data boosted the dollar against the yen and as investors grow more confident that Greece’s debt crisis will be resolved.\nThe Topix index climbed 1 percent to 1,652.15 as of 9:01 a.m. in Tokyo, rising for a third day. The Nikkei 225 Stock Average gained 1 percent to 20,529.41. The yen traded at 123.30 per dollar after weakening 0.6 percent on Wednesday. Stronger-than-expected U.S. private data on employment and manufacturing boosted the greenback ahead of an official payrolls report on Thursday.\n“Just as the Federal Reserve expected, as we head toward higher interest rates the economic mood is recovering,” said Mitsushige Akino, executive officer at Ichiyoshi Asset Management Co. in Tokyo. “An interest-rate hike expresses the quality of the U.S. and should be seen as a positive.”\nGlobal stocks rallied Wednesday from near a three-month low as Greece made a compromise offer on its debt. The bid was rejected by euro-area leaders, who have said they won’t hold talks until after Sunday’s Greek referendum on creditors’ demands.\n“There has to be a negotiated deal there and I think the market believes there will be at the end of the day despite the drama,” Michael Cuggino, a fund manager at Pacific Heights Asset Management LLC in San Francisco, told Bloomberg TV. “Corporate earnings in the second quarter along with the labor data will give us an indication as to what we’re going to see going forward.”\nU.S. Data U.S. employers added 237,000 workers in June, beating the 218,000 expected by economists, ADP Research Institute reported . Separately, the Institute for Supply Management’s factory index increased to 53.5 in June from 52.8 the prior month, higher than the 53.2 expected.\nInvestors are awaiting the government’s official jobs report on Thursday, which economists expect will show employers added 230,000 workers. The improving outlook for the labor market is among the reasons Fed policy makers have said they may begin to raise interest rates this year from near zero.\nFutures on the Standard & Poor’s 500 Index fell 0.1 percent after the underlying benchmark climbed 0.7 percent on Wednesday on optimism Greece will forge a solution to its debt crisis. The Stoxx Europe 600 Index jumped 1.5 percent.", "external_links": [], "published": "2015-07-02T08:03:00.000+03:00", "crawled": "2015-07-02T03:33:49.000+03:00", "highlightTitle": ""}