{"organizations": [], "uuid": "8aa845b321897377454a75b1bccec02e406ac49c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "baltimorejewishlife.com", "main_image": "", "site_section": "http://baltimorejewishlife.com/news/finance.php", "section_title": "Baltimore Jewish Life | Finance", "url": "http://baltimorejewishlife.com/news/news-detail.php?SECTION_ID=5&ARTICLE_ID=61944", "country": "US", "title": "PayPal Sends $890 Million To Buy Money-transfer Firm Xoom", "performance_score": 0, "site": "baltimorejewishlife.com", "participants_count": 1, "title_full": "Baltimore Jewish Life | PayPal Sends $890 Million To Buy Money-transfer Firm Xoom", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "8aa845b321897377454a75b1bccec02e406ac49c"}, "author": "Staff Reporter", "url": "http://baltimorejewishlife.com/news/news-detail.php?SECTION_ID=5&ARTICLE_ID=61944", "ord_in_thread": 0, "title": "PayPal Sends $890 Million To Buy Money-transfer Firm Xoom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The digital payments firm continues its acquisition push ahead of its split from eBay later this month.\nPayPal unveiled its plans to buy money-transfer company Xoom on Wednesday, keeping up PayPal's effort to touch just about every aspect of the digital payments world.\nThe deal, with an enterprise value of $890 million, will expand PayPal's global money-transfer services, likely giving PayPal's 165 million worldwide active consumers more options to send and receive money across international borders using Xoom's services on their smartphones and personal computers.\nPayPal already offers international money transfers in 190 countries and regions, as well as peer-to-peer money-transfers and payments in the US through the service Venmo. San Francisco-based Xoom will help PayPal speed its expansion into the 37 countries Xoom already operates, especially the important markets of Mexico, India, the Philippines, China and Brazil, PayPal's incoming CEO Dan Schulman said in a statement.\nXoom, which has 1.3 million active customers in the US, is also available in Australia, China, Spain and the UK. The company is a competitor to money-transfer firms including Western Union and Moneygram, with Xoom allowing people to pay bills or send money overseas for about $3 to $10 per transfer. Xoom helped customers send about $7 billion to friends and family around the world during the 12 months ended March 31.\n\"Making international remittances simpler, safer and more affordable is something PayPal is excited to do for our customers,\" Schulman said in a statement.\nXoom's shares jumped about 22 percent in after-hours trading to $25.27, above PayPal's cash offer price of $25 a share.\nXoom should become yet another weapon in PayPal's growing arsenal, as PayPal works to keep up its position as a leading player in the increasingly competitive space of digital and mobile payments. PayPal has enjoyed rapid growth as more consumers have made purchases online, in mobile apps and while using mobile-payments systems such as Apple Pay . However, PayPal also faces more threats than ever as digital payments have become a key focus of major tech firms such as Amazon, Google and Apple and payment networks like Visa and Mastercard.\nLooking to stay one step ahead, PayPal plans to focus on money transfers, small-business lending, and peer-to-peer lending and payments, adding those services to its online and mobile payments features. That effort will be especially important for the company as it splits from its parent, eBay, later this month.\nPayPal earlier this year also purchased Paydiant, a startup that helps companies such as Subway and Capital One add loyalty features and mobile payment options into their mobile apps. In 2013, PayPal agreed to buy Braintree, which processes payments for companies including Airbnb and Uber, for $800 million.\nThe Xoom deal is expected to close in the fourth quarter of this year, with all off Xoom's more than 300 employees joining San Jose-based PayPal.\nPhoto Caption: PayPal to buy money-transfer startup Xoom for $890 million\nTweet", "external_links": ["http://www.cnet.com/products/apple-pay-ios/", "https://twitter.com/share", "http://twitter.com/home?status=Look%20what%20I%20found%20on%20BaltimoreJewishLife.com!%20"], "published": "2015-07-02T03:00:00.000+03:00", "crawled": "2015-07-03T02:43:13.000+03:00", "highlightTitle": ""}