{"organizations": [], "uuid": "cba36758c0b2ef32dd8db742e194a204d14f0279", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/personal-finance.html", "section_title": "Personal Finance", "url": "https://www.prbuzz.com/personal-finance/332172-tax-advisor-barry-g-fowler-reveals-some-provisions-of-the-new-taxpayer-bill-of-rights-enhancements.html", "country": "US", "title": "Tax Advisor Barry G. Fowler, Reveals Some Provisions of the New Taxpayer Bill of Rights Enhancements", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "Tax Advisor Barry G. Fowler, Reveals Some Provisions of the New Taxpayer Bill of Rights Enhancements", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "cba36758c0b2ef32dd8db742e194a204d14f0279"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/personal-finance/332172-tax-advisor-barry-g-fowler-reveals-some-provisions-of-the-new-taxpayer-bill-of-rights-enhancements.html", "ord_in_thread": 0, "title": "Tax Advisor Barry G. Fowler, Reveals Some Provisions of the New Taxpayer Bill of Rights Enhancements", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Barry G. Fowler, EA, leading expert in tax resolution issues and CEO of Taxation Solutions, reports that taxpayers are in for good news and more respectful treatment by the IRS with the proposed new Taxpayers Bill of Rights Enhancement Act.\nHouston, TX – June 30, 2015 – Barry G. Fowler, CEO of Taxation Solutions, posted a new article entitled “Soon We May Have More Taxpayer Rights, Less IRS Abuse of Power” in which he elaborates on some of the more meaningful provisions of the proposed new bill.\nFowler writes, “The massive IRS may soon have less power over taxpayers. Senators Charles Grassley (R-IA) and John Thune (R-SD) have proposed a new Taxpayer Bill of Rights Enhancement, with a list of improvement designed to protect taxpayers and hold the IRS accountable for abusive behavior.”\nRecognizing that all taxpayers may not be aware that there is a Taxpayer Bill of Rights in place, he reviews the current rights that are going to be added to. Fowler writes, “The current Taxpayer Bill of Rights includes the fundamental right of the taxpayer to ask and be informed about what is going on in their tax exam, to know what the issues are that the IRS has, the right to be heard, to appeal any decision and to be informed as to when the exam will be over as well as to expect confidentiality.” Fowler acknowledges the benefit of the current provisions saying, “As a representative for taxpayers, the Taxpayer Bill of Righs is very useful when dealing with IRS agents and managers. The enhanced provisions are going to be even more helpful.”\nAlways looking to benefit his clients, Fowler states, “It’s always great news when the taxpayer is protected against the massive and powerful IRS. The abuse of power has taken its toll on too many taxpaying Americans and I look forward to the day when the IRS is truly held accountable and made to treat citizens with the respect they deserve.”\nThe entire article can be read at http://www.taxationsolutions.net/soon-we-may-have-more-taxpayer-rights-less-irs-abuse-of-power/\nAbout Barry G. Fowler, EA\nBarry G. Fowler founded Taxation Solutions out of a genuine concern for the IRS issues his clients face, many of whom are self-employed, contract employees, or entrepreneurs. For his contributions to his profession and expertise in tax resolution and financial planning, Fowler has been featured as one of America’s Trendsetters on CBS and Yahoo, and as a Premier Expert in Inc. Magazine. He has been instrumental in helping hundreds of people resolve complex tax issues with the IRS.\nFowler is licensed to represent taxpayers before the Internal Revenue Service, and is a longstanding member of several tax industry professional organizations: NAEA, NATP, TSEA, ASTPS.", "external_links": ["http://www.taxationsolutions.net/soon-we-may-have-more-taxpayer-rights-less-irs-abuse-of-power/"], "published": "2015-06-30T03:00:00.000+03:00", "crawled": "2015-07-01T12:40:41.000+03:00", "highlightTitle": ""}