{"organizations": ["Credit Suisse"], "uuid": "a55236b567845ba32f7d37e70016df8cfa5ede8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-insurance/?format=rss", "section_title": "Insurance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/european-shares-steady-credit-suisse-082249749.html", "country": "US", "title": "European shares steady as Credit Suisse results beat expectations", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "European shares steady as Credit Suisse results beat expectations", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T11:22:00.000+03:00", "replies_count": 0, "uuid": "a55236b567845ba32f7d37e70016df8cfa5ede8d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/european-shares-steady-credit-suisse-082249749.html", "ord_in_thread": 0, "title": "European shares steady as Credit Suisse results beat expectations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 23, 2015, 09:36 BST - UK Markets close in 6 hrs 54 mins European shares steady as Credit Suisse results beat expectations Reuters - UK Focus – 13 minutes ago \n* FTSE 300 up 0.1 pct \n* Credit Suisse (NYSE: CS - news ) gains 5 pct \n* Earnings season gathers pace \nBy Liisa Tuhkanen \nLONDON, July 23 (Reuters) - European shares edged higher on Thursday as Credit Suisse, Unilever (NYSE: UL - news ) and others reported better-than-expected results, as the quarterly earnings season accelerated in Europe. \nThe FTSEurofirst 300 index of top European shares was up 0.1 percent at 1,587.57 points by 0754 GMT. It fell 0.6 percent in the previous session, dragged down by tech stocks after Apple Inc (NasdaqGS: AAPL - news ) 's revenue forecast fell short of estimates. \nCredit Suisse Group AG was the top gainer, up 5 percent, after it posted better-than expected earnings and improved its capital cushion ahead of a strategy shake-up under the Swiss bank's new chief executive. \nAnother Swiss company, the Zurich-based power and automation firm ABB (NYSE: ABB - news ) rose 3.7 percent, its best day since January 2014, despite reporting falling profits as the figure still beat analyst expectations. \nAmong other gainers, Unilever added 1.9 percent after reporting higher-than-expected second-quarter sales on Thursday, driven by increases in its home and personal care businesses. \n\"Markets are in general regaining their composure... The earnings disappointments in the U.S. are being absorbed in Europe, largely down to the fact that valuations are not excessive,\" said Vincent Guenzi, portfolio manager at Cholet Dupont. \n\"What we are still missing is evidence of forecast upgrades on the back of the earnings season - it's still a bit early for that.\" \nAberdeen Asset Management (Other OTC: ABDNF - news ) was the biggest faller on the blue-chip pan-European index, down 6.3 percent after the emerging markets-focused fund manager said it saw net outflows of 9.9 billion pounds ($15.5 billion) during the quarter ended June 30 as institutional investors cut exposure to Asia and emerging markets equities. \nAlso on the downside, SSE (LSE: SSE.L - news ) fell 4.3 percent after the British energy supplier said it expected lower profits from its retail business this year. \nEurope bourses in 2015: http://link.reuters.com/pap87v \nAsset performance in 2015: http://link.reuters.com/gap87v \nToday's European research round-up (Editing by Hugh Lawson)", "external_links": [], "published": "2015-07-23T11:22:00.000+03:00", "crawled": "2015-07-23T11:38:08.128+03:00", "highlightTitle": ""}