{"organizations": [], "uuid": "2d963b18022d079f37e568eb8ac05c526978efd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507260489.html", "country": "US", "title": "Africa: Africa50 to hold Constitutive General Assembly in Casablanca", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Africa50 to hold Constitutive General Assembly in Casablanca", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T20:52:00.000+03:00", "replies_count": 0, "uuid": "2d963b18022d079f37e568eb8ac05c526978efd6"}, "author": "", "url": "http://allafrica.com/stories/201507260489.html", "ord_in_thread": 0, "title": "Africa: Africa50 to hold Constitutive General Assembly in Casablanca", "locations": ["Kenya", "Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Africa50 to hold Constitutive General Assembly in Casablanca Tagged: Kenya: Trends That Are Defining Africa's Growth press release \nAfrica50 – an innovative infrastructure investment platform sponsored by the African Development Bank – will hold its Constitutive General Assembly on 29 July 2015 in Casablanca, Morocco. \nRepresentatives of 24 African countries who have subscribed for an aggregate amount of USD 830 million will attend this historic event. \nAfrica50 aims to significantly narrow Africa's infrastructure financing gap by delivering transformative national and regional infrastructure projects thereby spurring Africa's growth and prosperity. Through an integrated approach, Africa50 will invest in African infrastructure projects at scale along the entire value chain via its sister Project Finance and Project Development Companies. Related Topics Kenya: Trends That Are Defining Africa's Growth \nDuring the Constitutive General Meeting, Africa50's founding members will sign articles of incorporation which enshrine the highest corporate governance standards and headquarters agreements which will confer upon Africa50 a unique privileged corporate status. \nAfrica50 is expected to play a catalytic role for African states, infrastructure projects sponsors and other international financial institutions. Ongoing fundraising efforts promise to attract additional African countries, African financial institutions, pension funds, sovereign wealth funds, and private sector entities. \nAfrica50's medium term capitalization is projected to reach USD 3 billion. \nAbout Africa50: \nAfrica50 is an innovative vehicle promoted by the African Development Bank and designed to help accelerate infrastructure development in Africa. Africa50 has 2 Corporations: Project Financing and Project Development. All are incorporated in Casablanca with Special Status and enjoying all privileges and immunities recognized to International Financial Organizations. For more information pls visit: www.afdb.org/africa50 Morocco \nSome 60 Sahrawi students have been graduates from Cuban universities in different fields, among them 36 health … see more » Copyright © 2015 Africa50. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us . Related", "external_links": [], "published": "2015-07-26T20:52:00.000+03:00", "crawled": "2015-07-26T22:42:37.069+03:00", "highlightTitle": ""}