{"organizations": [], "uuid": "fe7b3bd4dcc213c8b3068e5146678780f7425b88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/6/y/i/l/image.related.articleLeadwide.620x349.gi6vlf.png/1436248370954.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2530/consumer-discretionary/consumer-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/hare-krishna-building-sells-for-record-price-20150707-gi6vlf.html", "country": "AU", "title": "Hare Krishna building sells for record price", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Hare Krishna building sells for record price", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "fe7b3bd4dcc213c8b3068e5146678780f7425b88"}, "author": "", "url": "http://www.smh.com.au/business/hare-krishna-building-sells-for-record-price-20150707-gi6vlf.html", "ord_in_thread": 0, "title": "Hare Krishna building sells for record price", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The home of Melbourne's Hare Krishnas vegetarian restaurants has set a new city land price record. Photo: Craig Sillitoe\nThe home of Melbourne's Hare Krishnas and their popular Crossways and Gopal vegetarian restaurants - a skinny, eight-level building on Swanston Street - has set a new city land price record, selling to a Chinese investor for $81,500 a square metre.\nThe heritage designated 1930s building sold for a turbo-charged price of $15.8 million, about $5.8 million or nearly 60 per cent more than expected, agents from Savills Australia said.\nThree upper floors in the property have been leased for decades to the saffron-clad religious group known for their chanting and drumming.\nThe home of Melbourne's Hare Krishnas has sold for a record-setting $15.8 million.\nThe Krishna restaurant's $7.50 'all you can eat' dishes have introduced generations of Melburnians to vegetarian food. The group has about four years remaining on its lease and will be hoping good karma encourages the new owner to renew.\nShoe repairers Downtown Revolution ply their trade on the ground floor and basement.\nThe building's prime position on the west side of the high-traffic thoroughfare - it's one of Melbourne's busiest pedestrian streets - between Collins and Bourke contributed to the record result, agent Clinton Baxter said.\nBy comparison, sought after development sites in less well located parts of the central city typically sell for around $20,000 per square metre.\nCentral Melbourne land values have soured over the past three years, pushed to record highs by low interest rates, development activity and a flood of offshore capital.\nThe deal should quieten fears that the major disruption expected from the construction of a new metro rail tunnel through the heart of the city under Swanston Street will hurt retailers and depress property prices.\nKey parts of the city will be shut down for years at a time under the rail tunnel plans.\nSections of Swanston Street attract some of the city's highest retail rents.\nNo stand-alone buildings on the west side of the same city block have changed hands for at least 15 years indicating the value landlords place on the tightly-held retail strip.\nThe property's owners, a couple from Donvale, purchased the building for $1.86 million in 1997 after the recession during a relatively buoyant economic period when interest in ageing city buildings was lagging.\nThey are likely to be slugged with a significant capital gains tax bill after the building's value appreciated an astounding 800 per cent.\nThe Chinese-based investor fended off significant competition by snapping up the property three weeks before the expression of interest campaign ended.\n\"This is the state of what is an extraordinary market where a purchaser buys several weeks prior to the close of a campaign with a knock-out offer,\" Mr Baxter said.", "external_links": [], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T21:52:06.000+03:00", "highlightTitle": ""}