{"organizations": [], "uuid": "f96959ce10641824439cc57e4a2d84bfac603818", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/i/4/h/l/image.related.articleLeadwide.620x349.gihab8.png/1437551686820.jpg", "site_section": "http://www.smh.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.smh.com.au/business/banking-and-finance/stevens-tips-apras-move-to-lift-home-loan-rates-20150721-gihab8.html", "country": "AU", "title": "Stevens tips APRA's move to lift home loan rates", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Stevens tips APRA's move to lift home loan rates", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "f96959ce10641824439cc57e4a2d84bfac603818"}, "author": "James Eyers", "url": "http://www.smh.com.au/business/banking-and-finance/stevens-tips-apras-move-to-lift-home-loan-rates-20150721-gihab8.html", "ord_in_thread": 0, "title": "Stevens tips APRA's move to lift home loan rates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reserve Bank governor Glenn Stevens says higher home loan rates after the Australian Prudential Regulation Authority's capital moves should not be surprising or controversial. Photo: Glenn Hunt\nReserve Bank of Australia governor Glenn Stevens says it is logical for the big banks to raise interest rates on home loans, after the prudential regulator called for more capital to be held against mortgages this week, because boosting banking competition was the reason the financial system inquiry called for action.\nAs each of the big four banks and Macquarie consider how additional costs from more expensive equity capital will be passed on to customers or shareholders, Mr Stevens said: \"I imagine it will result in some rise in mortgage rates from the major banks. It is supposed to – that's the point.\n\"It is for the banks to decide what they do, but if they made that adjustment nobody should find that surprising or controversial. The whole point of [the FSI recommendation] was to change the competitive landscape between the majors and the others ... You can't do that unless some process adjusts,\" he told the Anika Foundation luncheon in Sydney.\nMacquarie analyst Mike Wiblin said the governor's comments suggested the RBA had joined the Australian Prudential Regulation Authority in supporting the banks' restoration of return on equity after the capital changes.\nAdvertisement Pointing to the example of Scandinavia, where mortgage prices were increased in 2014 in response to higher risk weights, Mr Wiblin said: \"In many cases these have been successful to some degree in slowing mortgage growth, while expanding margins as well. It seems Australia is well placed to follow this well-trodden path.\"\nCredit Suisse analyst Jarrod Martin said earlier this week home loan rates could rise by between 0.1 and 0.2 percentage points as a result of the higher capital, while CLSA analyst Brian Johnson said the rise on standard variable rates could be 0.65 of a percentage point, assuming banks did nothing on other loans or deposits, which remained an option.\nWinning market share Restoring profitability through higher pricing will result in regional and community-owned banks winning market share should they choose to maintain lower rates. The competitive playing field will also be tipped in favour of smaller banks when new global rules on bank risk modelling, being referred to as Basel 4, are finalised in 2016.\nRob Goudswaard, chief executive officer of CUA, the country's largest customer-owned bank with 430,000 customers and $11.5 billion in assets, said Basel would lead to the fragmentation of the home loan market, resulting in a variety of interest rates offered based on the risks of individual borrowers.\nBasel 4 is designed to make standardised risk modelling, used by smaller banks, more risk sensitive by linking risk weights more closely with the \"loan to valuation\" (LVR) ratios of particular loans. While small banks using the standardised models are forced now to apply a standard risk weight of 39 per cent to mortgages, under Basel 4 they will be able to apply lower risk weightings for loans with a lower LVR.\n\"Given we are conservative, as mutuals traditionally are, this will allow us to allocate less capital to customers with lower LVRs and tailor specific customer offerings to reflect the different capital allocations,\" Mr Goudswaard said. \"Longstanding books with low LVRs will get a lower risk weight and we will be able to offer better pricing.\"\nBasel 4 will also prevent banks from reducing LVRs as market prices increase – known as dynamic valuation – because Basel 4 wants the LVR to be set at the time of loan origination. Basel 4 is also considering introducing a capital \"floor\" that will prevent big banks deviating too far from the models used by smaller banks.\nThe Basel proposals were released for comment two weeks after David Murray delivered the financial system inquiry report to the government in December 2014 and are due to be finalised by the end of 2015, although observers of the Basel process say finalisation of the package is likely to push into 2016.", "external_links": [], "published": "2015-07-22T03:00:00.000+03:00", "crawled": "2015-07-23T00:18:29.894+03:00", "highlightTitle": ""}