{"organizations": [], "uuid": "dee94093a8f7955239ed6a795ca7fac333a61d10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-22/carlyle-teams-with-tcw-in-push-for-ordinary-investors", "country": "US", "title": "Carlyle Teams With TCW in Push for Ordinary Investors", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Carlyle Teams With TCW in Push for Ordinary Investors - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T00:42:00.000+03:00", "replies_count": 0, "uuid": "dee94093a8f7955239ed6a795ca7fac333a61d10"}, "author": "Sabrina Willmer", "url": "http://www.bloomberg.com/news/articles/2015-07-22/carlyle-teams-with-tcw-in-push-for-ordinary-investors", "ord_in_thread": 0, "title": "Carlyle Teams With TCW in Push for Ordinary Investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carlyle Group LP isn’t backing down from its goal of offering alternative strategies to the masses, despite early setbacks.\nThe Washington-based firm is teaming up with TCW Group, which is majority owned by Carlyle funds, to offer three vehicles that give ordinary investors access to hedge fund-like bets, according to a regulatory filing last week. The effort comes months after Carlyle decided to close two mutual funds focused on so-called liquid alternatives when they failed to gather enough money.\nCarlyle and other alternative-asset managers that have typically invested for institutions and the very wealthy have met mixed results seeking to expand their client bases to individuals. Apollo Global Management LLC is teaming up with Ivy Investment Management to offer two new mutual funds. KKR & Co. last year closed two funds that focused on high-yield debt and distressed companies, after they attracted $33 million from outside investors in about a year. KKR, Carlyle and Blackstone Group LP have said they will continue to create offerings for individuals as they aim to eventually to break into the market for 401(k) retirement plans.\nRandall Whitestone, a spokesman for Carlyle, declined to comment on the filing, as did Doug Morris, a spokesman for TCW.\nAlternative Push TCW, as adviser for the three new mutual funds, will employ Carlyle’s hedge-fund team, known as Liquid Markets Solutions, to make investments. The TCW/Carlyle Trend Following Fund will use computer models to identify and bet on price trends, while the TCW/Carlyle Liquid Tactical Fund will actively invest across a variety of instruments, according to the filing. The TCW/Carlyle Absolute Return Fund will allocate capital across the trend-following and tactical strategies, and may invest directly in other securities.\nThe portfolio managers are Carlyle managing director Michael Beaton, along with George Main and Warren Wright, co-founders of Diversified Global Asset Management, which was acquired by Carlyle last year.\nTCW, which has been making a push into alternatives to traditional bonds and equities, also recently partnered with Gargoyle Investment Advisor to offer hedge funds strategies to individuals. The firm last year hired William Lloyd and Joseph Quinn to help market alternatives.", "external_links": [], "published": "2015-07-23T00:42:00.000+03:00", "crawled": "2015-07-23T16:33:06.246+03:00", "highlightTitle": ""}