{"organizations": [], "uuid": "ff2511deff7d06c23e770e02c57515f641021739", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/ipVjxbebEH6g/v2/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-27/move-to-strip-rajan-of-control-over-india-rates-faces-backlash", "country": "US", "title": "Move to Strip Rajan of Control Over India Rates Faces Backlash", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Move to Strip Rajan of Control Over India Rates Faces Backlash - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T02:30:00.000+03:00", "replies_count": 0, "uuid": "ff2511deff7d06c23e770e02c57515f641021739"}, "author": "Sandrine Rastello", "url": "http://www.bloomberg.com/news/articles/2015-07-27/move-to-strip-rajan-of-control-over-india-rates-faces-backlash", "ord_in_thread": 0, "title": "Move to Strip Rajan of Control Over India Rates Faces Backlash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The best strategy for Governor Raghuram Rajan to fend off the latest threat to the independence of India’s central bank may be just to sit back and relax.\nAlready, two officials in Prime Minister Narendra Modi’s administration have distanced themselves from a draft bill that would give the government control over a proposed interest-rate setting panel. The Finance Ministry has called for comments on the draft to be submitted by Aug. 8.\n“It’s a trial balloon brought in to see how the economic and financial community will react, and I don’t think they have reacted very well to it,” said Mohan Guruswamy, chairman of the New Delhi-based Center for Policy Alternatives and a former finance ministry official. “I think Raghuram Rajan will just lie low.”\nControl of a monetary policy committee is one of the final pieces of Rajan’s plan to modernize the 80-year-old central bank and put it on par with countries such as the U.S. and the U.K. While he and Finance Minister Arun Jaitley agreed to an inflation target earlier this year, representation on the rate-setting body has been a sticking point.\nRajan will have a chance to voice his opinion next week at a press conference that traditionally follows interest-rate decisions. A report by Reserve Bank of India Deputy Governor Urjit Patel last year had suggested a five-member monetary policy committee, with no government appointee.\n‘Just a Draft’ By comparison, the draft bill proposed an MPC with seven members -- three from the central bank and four nominated by the government. The RBI governor would hold the deciding vote in case of a tie, but wouldn’t get a veto. Right now the governor is responsible for making all rate decisions.\nThe proposal “is just a draft and not an approved document,” central bank spokeswoman Alpana Killawala wrote in response to an e-mail seeking comments.\nThe bill is meant to unify various laws that govern the country’s financial markets. While the document was posted on the finance ministry’s website, junior finance minister Jayant Sinha described the proposal as “only an input into the government’s deliberations,” according to the Economic Times. Arvind Subramanian, the ministry’s economic adviser, was Quote: d as saying that the report wasn’t the view of the government.\n“It is critical that the central bank’s independence is not compromised just as it is being provided with greater clarity of objective,” Deutsche Bank AG economists Taimur Baig and Kaushik Das wrote on Friday.\nRajan Legacy To meet best global standards, the government shouldn’t have a majority, Bejoy Das Gupta, Asia-Pacific chief economist at the Institute of International Finance in Washington, said in an e-mail. Rajan should push the government to agree to informally consult the governor on appointees, he said.\nAt the Bank of England, the government appoints four external members who have a vote on rate decisions along with five central bank officials.\nIn the U.S., seven of 12 members on the Federal Open Market Committee are nominated by the president and confirmed by the Senate for a term of 14 years, enough to outlast governments. Five regional Fed presidents, four on a rotational basis, make up the rest.\nThe bill is likely to fuel tensions between the central bank and the government, said Milan Vaishnav, an associate in the South Asia program at the Carnegie Endowment for International Peace in Washington.\n“We can expect a spirited debate between the RBI Governor and the Finance Ministry,” he said in an e-mail, referring to Rajan. “After all, this has a direct impact on his legacy.”", "external_links": ["http://finmin.nic.in/suggestion_comments/Revised_Draft_IFC.pdf\\"], "published": "2015-07-28T02:30:00.000+03:00", "crawled": "2015-07-28T02:51:26.986+03:00", "highlightTitle": ""}