{"organizations": [], "uuid": "ada3207d1e57801ad6c57d3e440d9c2d0bf2348f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-27/asian-stocks-follow-u-s-slump-as-investors-await-china-data", "country": "US", "title": "Asian Stocks Follow U.S. Slump as Investors Await China Data", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Asian Stocks Follow U.S. Slump as Investors Await China Data - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T08:03:00.000+03:00", "replies_count": 0, "uuid": "ada3207d1e57801ad6c57d3e440d9c2d0bf2348f"}, "author": "Adam Haigh", "url": "http://www.bloomberg.com/news/articles/2015-07-27/asian-stocks-follow-u-s-slump-as-investors-await-china-data", "ord_in_thread": 0, "title": "Asian Stocks Follow U.S. Slump as Investors Await China Data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Asian stocks fell, after the Dow Jones Industrial Average posted its worst week since January, as investors awaited data on China amid a selloff in commodities.\nThe MSCI Asia Pacific Index dropped 0.4 percent to 141.95 as of 9:00 a.m. in Tokyo after the Dow slumped 2.9 percent last week. China reports on industrial company profits Monday, providing further clues on the slowdown in Asia’s largest economy. Gold is trading near a five-year low and oil is in a bear market amid concern raw material supplies are outpacing demand. In the U.S., data are due on durable and capital goods orders, with investors looking to this week’s meeting of the Federal Reserve to gauge the timing for higher interest rates.\n“Share markets are likely to remain volatile as we are still going through a seasonally weak period of the year for shares,” said Shane Oliver, Sydney-based global strategist at AMP Capital Investors Ltd., which oversees A$160.5 billion ($117 billion). “Uncertainties remain regarding Chinese economic growth and a likely Fed interest rate hike lies ahead for later this year.”\nJapan’s Topix index fell 0.7 percent. South Korea’s Kospi index dropped 0.5 percent. Australia’s S&P/ASX 200 Index lost 0.2 percent and New Zealand’s NZX 50 Index slipped 0.4 percent.\nFutures on Hong Kong’s Hang Seng Index sank 0.7 percent in most recent trading, with contracts on the Hang Seng China Enterprises Index, a gauge of mainland Chinese stocks listed in the city, down 1.1 percent. Futures on the FTSE China A50 Index, which tracks the largest Chinese companies, lost 0.8 percent and CSI 300 Index contracts declined 3 percent in Friday trade.\nS&P 500 e-mini futures were little changed on Monday. The underlying equity gauge lost 1.1 percent on Friday.", "external_links": [], "published": "2015-07-27T08:03:00.000+03:00", "crawled": "2015-07-27T03:58:57.237+03:00", "highlightTitle": ""}