{"organizations": [], "uuid": "505179d9808b0bee1bfa1110c242221613faac06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/us-stocks-wall-st-falls-205241734.html", "country": "GB", "title": "US STOCKS-Wall St falls for 3rd day as earnings fall short", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "US STOCKS-Wall St falls for 3rd day as earnings fall short", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T23:52:00.000+03:00", "replies_count": 0, "uuid": "505179d9808b0bee1bfa1110c242221613faac06"}, "author": "", "url": "https://uk.finance.yahoo.com/news/us-stocks-wall-st-falls-205241734.html", "ord_in_thread": 0, "title": "US STOCKS-Wall St falls for 3rd day as earnings fall short", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Dow in the red for the year \n* Caterpillar (NYSE: CAT - news ) falls after lower quarterly profit \n* Amazon, Visa (Xetra: A0NC7B - news ) shares gain in after-hours trading \n* Indexes down: Dow 0.7 pct, S&P 0.6 pct, Nasdaq 0.5 pct (Updates close with volume, Visa up after the bell) \nBy Caroline Valetkevitch \nJuly 23 (Reuters) - U.S. stocks fell for the third straight day on Thursday after disappointing corporate results and forecasts added to concerns about the U.S. profit outlook. \nThe Dow Jones industrial average fell back into the red for the year, with 3M, American Express and Caterpillar contributing the most to the average's fall. \nThe Dow Jones transportation average was off 2.1 percent, with only one of its 20 components ending in the black. Union Pacific, down 5.7 percent at $92.12 after posting a lower quarterly profit, led the decline in transportation shares and was among the S&P 500's biggest drags. \n\"The initial take on big earnings reports has been lukewarm at best,\" said Bruce Zaro, chief technical strategist at Bolton Global Asset Management in Boston. \n\"The strong dollar certainly has been mentioned a lot, and I think there are still questions about demand in the economy and what would translate into revenue growth for most reporting companies.\" \nCaterpillar shares fell 3.6 percent to $76.88 and touched a four-year low. The world's largest construction and mining equipment maker reported sales declines in key markets in a sluggish global economy. \nAmerican Express was down 2.5 percent at $77.01 after its revenue missed expectations, while diversified manufacturer 3M was down 3.8 percent at $149.50 after cutting its full-year forecast. \nThe Dow Jones industrial average fell 119.09 points, or 0.67 percent, to 17,731.95, the S&P 500 lost 12 points, or 0.57 percent, to 2,102.15 and the Nasdaq Composite dropped 25.36 points, or 0.49 percent, to 5,146.41. \nAfter the bell, however, Nasdaq 100 e-mini futures turned positive following results from Amazon, whose shares jumped 18 percent in extended trading. Also jumping after the close, Visa shares were up 7 percent following results. \nDuring the regular session, all of the 10 major S&P 500 sectors were lower with the utilities index leading the decline with a 1.5 percent fall along with the materials index, also down 1.5 percent. \nDow Chemical's 5.2 percent drop to $47.45 weighed the most on the sector. Dow Chemical warned of soft demand in China after posting stronger-than-expected results. \nSecond-quarter S&P 500 earnings have been mixed, with 75 percent of companies so far beating analysts' profit expectations and just 52 percent surpassing revenue expectations, according to Thomson Reuters (Dusseldorf: TOC.DU - news ) data. \nThe S&P 500 is relatively expensive, trading at 16.9 times forward 12 months' earnings, above the 10-year median of 14.7 times, according to StarMine data. \nQualcomm (Swiss: QCOM.SW - news ) fell 3.8 percent to $61.78, a day after the chipmaker said it may break itself up as it delivered its third profit warning this year. \nNYSE decliners outnumbered advancers 2,099 to 965, while on the Nasdaq, 1,908 issues fell and 869 advanced. The S&P 500 posted 31 new 52-week highs and 40 new lows; the Nasdaq Composite recorded 103 new highs and 143 new lows. \nAbout 7 billion shares changed hands on U.S. exchanges, above the 6.5 billion daily average so far this month, according to BATS Global Markets. (Additional reporting by Tanya Agrawal; editing by Don Sebastian and Nick Zieminski)", "external_links": [], "published": "2015-07-23T23:52:00.000+03:00", "crawled": "2015-07-24T00:10:57.045+03:00", "highlightTitle": ""}