{"organizations": [], "uuid": "6adb1c797d5a0859a37bf403ef063b7787997ab0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/05/11/102668246-IMG_6570r.1910x1000.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://www.cnbc.com/id/102815926?__source=yahoo%7cfinance%7cheadline%7cheadline%7cstory&par=yahoo&doc=102815926", "country": "GB", "title": "Cramer: Big $$ craving this earnings season group", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "Cramer: Big $$ craving this earnings season group", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T01:13:00.000+03:00", "replies_count": 0, "uuid": "6adb1c797d5a0859a37bf403ef063b7787997ab0"}, "author": "", "url": "http://www.cnbc.com/id/102815926?__source=yahoo%7cfinance%7cheadline%7cheadline%7cstory&par=yahoo&doc=102815926", "ord_in_thread": 0, "title": "Cramer: Big $$ craving this earnings season group", "locations": ["Greece", "Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jim Cramer"], "text": "CNBC.com SHARES <p>Cramer: Market fed up with Europe</p> <p>Mad Money host Jim Cramer breaks down today&#039;s market reversal and Greece&#039;s impact on the broader market. </p> \nJim Cramer knew it would only be a matter of time before investors got so fed up with Europe and craved some good old-fashioned American stocks. And that was exactly what happened Tuesday, as the averages managed to bounce back from a total free fall in the morning. \nThe CNBC \" Mad Money \" host is watching Europe, not just Greece , because the issue has held all of Europe hostage. In Cramer's perspective, the Greeks borrowed too much and the Europeans, mainly Germany, lent too much. \nThe Germans could end this drama right now if they just booted Greece from the euro, but they insist on dragging things out. Cramer wonders if it is a deliberate procrastination at this point, which keeps dragging down the euro and helps German exporters. \n\"Look, I am adamant that until this Greek issue is resolved we're going to be in the soup, and every rally will be suspect,\" Cramer said. (Tweet This) Scott Mlyn | CNBC Customers enter a Chipotle restaurant in New York \"I am adamant that until this Greek issue is resolved we're going to be in the soup, and every rally will be suspect\" -Jim Cramer \nCramer believes that any sort of deal at this point will cause the markets to rally. He is confident that it would be best for Greece if it just defaulted, took their drachmas and went home instead of sticking with the euro and being the poor kid among a bunch of richer nations. Any resolution would be good. \nHowever on Tuesday Cramer saw many betting that with a strong dollar in place for earnings season, huge estimate cuts will happen for all companies with international exposure, and U.S. operating companies will have decent strength. \n\"But they won't be downgrading the domestics. They will be raising numbers and upgrading them,\" Cramer said. (Tweet This) \nIn fact, Cramer suspects that many money managers have started to prepare for earnings season by rotating out of the international stocks and into the domestic stocks. \nHow could he tell? Just take a look at the retailers and restaurant stocks. \nEven as the market was in a free fall, stocks like Costco roared right from the opening bell. The same rally occurred with names such as Kroger, Home Depot , Lowes and drugstore stocks. Heck, even Wal-Mart seems to have found a bottom! The same goes for restaurants as Chipotle , Jack in the Box and Sonic all had money flowing into them. Jim Cramer | CNBC String beans growing in Jim Cramer's garden. \"Nothing grows to the sky except perhaps my string beans. Let the sellers prune them for a couple of days. They'll do just fine\" -Jim Cramer \nSo what do these stocks all have in common? Gasoline. The price of it is plummeting again with a sharp drop in crude, and that pushes the buyers into these companies that benefit from lower gasoline prices. \nBig money was also excited in the insane decline of interest rates, so housing stocks are on the move as well. And of course, the utilities and REITs rallied from the lower interest rate competition from Treasurys.", "external_links": [], "published": "2015-07-08T01:13:00.000+03:00", "crawled": "2015-07-08T02:10:43.000+03:00", "highlightTitle": ""}