{"organizations": [], "uuid": "fc23e40b21303955db5c937f613b1d16ea0f018f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=12205_4442.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/new-obligations-for-foreign-investors-75330/", "country": "US", "title": "New Obligations for Foreign Investors in Agricultural Land in Australia", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "New Obligations for Foreign Investors in Agricultural Land in Australia", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T01:32:00.000+03:00", "replies_count": 0, "uuid": "fc23e40b21303955db5c937f613b1d16ea0f018f"}, "author": "K&amp;L Gates LLP", "url": "http://www.jdsupra.com/legalnews/new-obligations-for-foreign-investors-75330/", "ord_in_thread": 0, "title": "New Obligations for Foreign Investors in Agricultural Land in Australia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Obligations for Foreign Investors in Agricultural Land in Australia more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=cee98d6f-34e4-4dfa-bd7d-33c8c37b3177\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nThe Australian Government has demonstrated its commitment to create greater transparency around foreign investment in agricultural land by introducing a national Foreign Ownership of Agricultural Land Register (Register). \nIntroduction of the Register follows a reduction in the screening threshold for foreign investment in rural land (from AUD252 million to AUD15 million) implemented from 1 March 2015 and the proposed AUD55 million threshold for screening foreign investment in agribusiness from 1 December 2015. \nIntroduction of Register of Foreign Ownership of Agricultural Land \nAustralia's Foreign Investment Review Board (FIRB) has updated Australia's Foreign Investment Policy (Policy) to include additional obligations on foreign investors who currently hold, or will in the future hold, interests in agricultural land in Australia. \nExisting Interests in Agricultural Land \nFrom 1 July 2015, the Policy requires that all foreign persons (and foreign government investors) that currently hold interests in agricultural land must register those interests with the Australian Taxation Office (ATO) by 31 December 2015. \nNew Interests in Agricultural Land \nAny new interests in agricultural land acquired after 1 July 2015 must be registered with the ATO within 30 days of the acquisition. \nNo Threshold Applies \nThe obligation to register interests in Australian agricultural land applies irrespective of the value of the land and whether or not the acquisition was (or is) subject to FIRB approval. \nWide Definition of Agricultural Land \nAgricultural land is defined in the policy as \"land in Australia that is used, or that could be reasonably used, for a primary production business\". This definition is wider than the definition of Australian rural land under the Foreign Acquisitions and Takeovers Act 1975 which requires the relevant land is used wholly and exclusively for carrying on a business of primary production. \nAgricultural Land Register \nWhile the above registration requirement currently applies as a matter of policy, the Australian Government has stated its intention to introduce supporting legislation by 1 December 2015. \nThere is currently no penalty for failing to register an existing or new interest. However, it is expected penalties will be imposed when the policy changes are incorporated into legislation. \nRegistration can be processed at \nwww.ato.gov.au/aglandregister", "external_links": [], "published": "2015-07-15T01:32:00.000+03:00", "crawled": "2015-07-15T01:38:08.000+03:00", "highlightTitle": ""}