{"organizations": [], "uuid": "583b94ebb721e6ecf50bba75c67457df9f6d1475", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/sebi024715.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/sebi-directs-swasata-cements-to-cease-to-mobilise-any-fresh-funds-from-investors/42895.html", "country": "IN", "title": "SEBI directs Swasata Cements to cease to mobilise any fresh funds from investors", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "SEBI directs Swasata Cements to cease to mobilise any fresh funds from investors", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T12:29:00.000+03:00", "replies_count": 0, "uuid": "583b94ebb721e6ecf50bba75c67457df9f6d1475"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/sebi-directs-swasata-cements-to-cease-to-mobilise-any-fresh-funds-from-investors/42895.html", "ord_in_thread": 0, "title": "SEBI directs Swasata Cements to cease to mobilise any fresh funds from investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Not a member ? Sign up now Name: Email: Password: Moneylife » Investing » Regulations » SEBI directs Swasata Cements to cease to mobilise any fresh funds from investors 42895 SEBI directs Swasata Cements to cease to mobilise any fresh funds from investors 0 Comments, Be the first to comment Follow @mldigital Swasata Cements was engaged in fund mobilising activity through issue of NCDs to more than 49 persons without complying with the relevant provisions of the Companies Act, 1956 and SEBI (Issue and Listing of Debt Securities), Regulations, 2008, says a SEBI Order Market regulator SEBI (Securities and Exchange Board of India) has directed that Swasata Cements Limited (SCL) shall forthwith cease to mobilise any fresh funds from investors through the Offer of Non-Convertible Redeemable Debentures (NCDs) or through the issuance of equity shares or any other securities, to the public and/or invite subscription. SCL, and its directors, is prohibited from issuing prospectus or any offer document or issue advertisement for soliciting money from the public for the issue of securities, according to the SEBI Order. SCL, and its directors, shall not dispose of any of the properties or alienate or encumber any of the assets owned/acquired by that company without prior permission from SEBI, says the SEBI Order. SCL was engaged in fund mobilising activity through issue of NCDs to more than 49 persons without complying with the relevant provisions of the Companies Act, 1956 and SEBI (Issue and Listing of Debt Securities), Regulations, 2008. The SEBI Order is an Interim Order cum Show Cause Notice. SEBI, during the course of investigations in the matter of SCL Steel Corporation Limited came to know that one of their group companies, SCL had also raised money by issue of debentures during 2008-10. One of the directors of SCL Steel Corporation Limited, Avijit Chakraborty, undertook to submit the complete date-wise details of money raised with names and addresses of investors, along with number of debentures allotted, to SEBI. Subsequently, SCL Steel Corporation Limited in its letter dated January 19, 2015 submitted copies of audit reports from 2008-09 to 2012-13 and list of debenture holders of SCL. In the meanwhile, SEBI received a complaint on 23 January 2015 alleging non-payment of maturity amount by SCL and its other group entities. In respect of SCL, the complainant provided copies of Debenture Certificate no.13347 issued by SCL to an investor for 20 debentures of Rs100 each, post-dated cheque issued by SCL to the investor, and a brochure for “Advance Cement Booking” Scheme. Hence, SEBI began its investigation on SCL. The basis of initial investigation was the correspondence exchanged between SEBI, SCL Steel Corporation Limited and its directors, complaint received and documents contained and information/documents obtained from the Ministry of Corporate Affairs' website i.e. 'MCA 21 Portal'. The SEBI Order observes, “SCL had issued and allotted Non-Convertible Redeemable Debentures (Offer of NCDs) to approximately 11,013 investors during the financial years 2008-09 and 2009-10 and mobilized an amount of Rs6,63,93,184/-. SEBI points out that for ascertaining whether the Offer of NCDs is a public issue or an issue on private placement basis, in accordance with Section 67 of the Companies Act, 1956, the number of subscribers is of utmost importance. SCL is also not stated to be a non-banking financial company or a public financial institution within the meaning of Section 4A of the Companies Act and therefore, is not covered under the second proviso to Section 67(3). Hence SEBI found out that SCL had done a public issue of NCDs. It will follow that since the Offer of NCDs is a public issue of securities, such securities shall also have to be listed on a recognised stock exchange, as mandated under Section 73 of the Companies Act, 1956. In this regard, reference is made to Sections 73 of the Companies Act, 1956, of which sub-Sections (1), (2) and (3) are relevant, points out the SEBI Order. In the facts of the case, it prima facie appears that SCL has violated the provisions of Section 73 of the Companies Act, 1956, in respect of the Offer of NCDs. Under Section 2(36) read with Section 60 of the Companies Act, 1956, a company needs to register its prospectus with the RoC (Registrar of Companies), before making a public offer or issuing the prospectus. The SEBI Order infers that SCL is prima facie engaged in fund mobilising activity from the public, through the Offer of NCDs and as a result of the activity has violated the provisions of the Companies Act, 1956 (Section 56, Section 60 read with Section 2(36), Section 73, Section 117B, Section 117C) and the Debt Securities Regulations. Hence SEBI has restrained SCL and also sought more information from SCL. The SEBI Order concludes by saying that this interim order cum show cause notice is without prejudice to the right of SEBI to take any other action that may be initiated against SCL and its directors in accordance with law. More in Moneylife", "external_links": [], "published": "2015-07-24T12:29:00.000+03:00", "crawled": "2015-07-24T13:07:07.203+03:00", "highlightTitle": ""}