{"organizations": [], "uuid": "59d0c84e7d7ae7b648d13c9d55c1db8fc2634495", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/b/6/y/v/image.related.afrArticleLead.620x365.giizif.png/1437646196536.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/industrial-relations/employers-set-to-cave-in-to-cfmeu-demand-for-20pc-rise-20150723-giizif", "country": "AU", "title": "Employers set to cave in to CFMEU demand for 20pc rise", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Employers set to cave in to CFMEU demand for 20pc rise | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T21:45:00.000+03:00", "replies_count": 0, "uuid": "59d0c84e7d7ae7b648d13c9d55c1db8fc2634495"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/policy/industrial-relations/employers-set-to-cave-in-to-cfmeu-demand-for-20pc-rise-20150723-giizif", "ord_in_thread": 0, "title": "Employers set to cave in to CFMEU demand for 20pc rise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The CFMEU has been asking companies to pay $2000 each upfront to receive a draft copy of the pattern agreement and to get the deal registered. Glenn Hunt Share on twitter by Ewin Hannan Employers are set to cave in to demands by the militant construction union for a four-year wages deal in Queensland that delivers 20 per cent in pay rises but offers a zero increase in workplace productivity.\nAlso included is an extraordinary clause permitting workers to take paid four-hour stoppages, to participate in \"union activities\", increasing the capacity for massive union disruption of building sites.\nIn a move that could attract the attention of the Royal Commission Into Trade Union Governance and Corruption, the Master Builders said the Construction, Forestry, Mining and Energy Union had been asking companies to pay $2000 each upfront to receive a draft copy of the pattern agreement and to get the deal registered.\nAs well as delivering annual 5 per cent pay rises, the proposed agreement says employees can be paid to attend up to two union meetings of up to two hours each on any given shift. The meetings can be held consecutively or separately and the CFMEU is only required to provide notice to the employer prior to the start of a meeting.\nIn a confidential briefing given to Queensland sub-contractors, the Master Builders said the clause was a \"major industrial weapon\" for the CFMEU which could be used to stop and disrupt jobs each day. It said the union could halt jobs for an entire day by using the clause to conduct rolling stoppages by different trades.\nThe Master Builders has received legal advice that employers would have no avenue for legal redress because the meetings would not be considered unlawful industrial action.\nSenior industry figures said they expected the state's major contractors and sub-contractors engaged in projects valued over $20 million to agree to the deal over coming weeks. The sub-contractors were told that the CFMEU had intimated that 50 to 60 companies had already \"signed\".\nGrant Galvin, the executive director of the Master Builders' Queensland division ,said on Thursday it was likely that major companies would back the agreement.\n \"We will continue to assist and support our members irrespective of whether they choose to sign it or not,\" he said. \"We are, however, aware that in the absence of a credible alternative within the current bargaining framework, operators within this sector of the industry, will, in all likelihood, agree to something very close to the circulating agreement. The costs of not agreeing and then experiencing protracted industrial action only to finally capitulate are too great.\"\nAccording to the briefing, the base annual salary of a carpenter will increase from $148,481 to $179,000 by July, 2019. The deal provides for a 26 per cent increase in the cost of weekly superannuation contributions to employees over the four life of the agreement.\nThe agreement locks in 26 rostered days off and written permission must be provided by the CFMEU for an employer to have its workers employed on one of these days.\nIn restrictions on operational arrangements, written permission will be required from the CFMEU to work beyond 10 hours a day and 58 hours per week between 6am and 6pm.\nMichael Ravbar, the union's Queensland branch secretary, said on Thursday that the negotiations with employers for a new agreement `\"have been characterised by a cooperative approach between the two parties\".\n\"The employers' approach shows they are interested in working with the union for better outcomes for the industry and the workers who are employed in it, and are clearly not interested in the divisive agenda of the Federal Government,\" he said. He declined to comment on the provision allowing for four-hour stoppages to discuss union activities.\nMr Galvin said Master Builders had told members they were not obliged and \"should not pay\" $2000 to the CFMEU for a copy of the expression of interest and registration of an agreement documents.\n\"The concept of effectively paying money to get a draft copy of an EBA from the CFMEU is not necessary and incongruent with the normal principles of how enterprise bargaining was intended.\"\nThe Fair Work Commission confirmed on Thursday that there was no filing fee for submitting an enterprise agreement for approval.\nConstruction industry figures in other states said the $2000 fee sought by the CFMEU and the clause providing for four hours of paid meetings to participate in union activities were \"unheard of\".", "external_links": ["https://twitter.com/EwinHannan"], "published": "2015-07-23T21:45:00.000+03:00", "crawled": "2015-07-23T17:00:29.525+03:00", "highlightTitle": ""}