{"organizations": [], "uuid": "a453c8edc9b3032f2bc7c4e81f43115fa56acb12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://images.smh.com.au/2014/02/12/5155383/FAIRFAX-logo.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/chanticleer/telstras-penn-facing-technology-tsunamai-20150710-gi8upk", "country": "AU", "title": "Telstra's Andy Penn facing technology tsunami", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Telstra's Andy Penn facing technology tsunami | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T17:46:00.000+03:00", "replies_count": 0, "uuid": "a453c8edc9b3032f2bc7c4e81f43115fa56acb12"}, "author": "Tony Boyd", "url": "http://www.afr.com/brand/chanticleer/telstras-penn-facing-technology-tsunamai-20150710-gi8upk", "ord_in_thread": 0, "title": "Telstra's Andy Penn facing technology tsunami", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The penetration of subscription video streaming in Australia will present a challenge to new Telstra CEO Andy Penn. David Rowe Penn did discuss dividends at a doorstop press conference following his speech to CEDA in Sydney but only when pressed about the impact of the change in the capex ratio. His determination to position himself differently to his predecessor, David Thodey, probably explains why his first public speech focused on technology and network leadership. The speech reiterated the Thodey mantra of putting the customer at the heart of everything Telstra does.\nThe technology leadership boast rang a little hollow when set against the Netflix service offered by rivals. Telstra delivers its video streaming through Presto which offers standard definition quality services.\nExtremely slow growth But competitors, such as Optus, which have embraced Netflix are taking advantage of its software systems to deliver high definition services. This involves users servers close to the customers instead of relying on delivery of video from the US.\n Of course, Telstra's half-owned pay TV operation Foxtel is the premium video delivery option in Australia with market penetration of 30 per cent.\nBut its growth is extremely slow compared to the emerging streaming video providers as shown by data released on Thursday by Telsyte. The research shows that at June 30 there were 2 million active subscriptions for video on demand. The growth has been driven by the arrival of services such as Netflix and Stan, which is a joint venture between Nine Entertainment and Fairfax Media, which publishes The Australian Financial Review.\nTelsyte said the paid subscriber market leaders, in order, were: Netflix, Stan, Presto and Quickflix. The four represent around 90 per cent of all paid subscriptions; however, there is a long tail of providers covering sports and special interest niches such as AFL, NBA basketball, NRL and UFC matches.\nA Telstra spokesman said the company had agreements in place regarding peering arrangements with Netflix and \"we are working on opportunities to integrate the service on appropriate platforms. It is not yet integrated in current devices.\"\nTelstra under Penn wants to be the industry-leading aggregator of content.\nPhenomenal growth \"Rather than restrict our customers' choices, we are open to hosting all SVOD services on our platforms and making it easy for them to get all the content they want in the one place,\" the company says.\nThe phenomenal growth in Netflix customers in Australia was first identified by Roy Morgan Research last month when it said it had 1 million users across 400,000 households.\nForecasts published this week by Nomura Securities suggest the growth in Netflix in Australia will continue at very strong levels for another five years. Nomura predicts Netflix will have 2.2 million customers by 2020 or about 34 per cent of the estimated 6.6 million broadband households.\nNomura estimates that Netflix should have an addressable market of up to 730 million households by 2020, for which it anticipates a penetration rate of 13 per cent.\nThis equates to 94 million international subscribers, up from Nomura's previous estimate of 80 million.\nThe growth in the penetration of Netflix in Australia is partly due to the free offers that accompanied the launch. Even so, it shows the willingness of Australians to embrace new entrants perceived to be offering good value. For too long, access to international content was dictated by the free to air TV stations and Foxtel, which is half-owned by Telstra.\nChallenge for Penn Foxtel has cut its prices to gain greater traction in the market but its rusted-on users are sport lovers.\nFoad Fadaghi, managing director of Telsyte, says Australians are now using multiple video streaming services and he predicts the penetration of subscription video streaming will hit 40 per cent by 2019.\nThis presents a challenge for Penn because it makes it harder for Telstra to offer the bundling packages that were so effective in locking-in customers on high-cost broadband connections.\nFadaghi says Foxtel's earnings power remains considering it has an average revenue per household of about $77 a month.\nTougher competition for Telstra in fixed line broadband was not such a critical issue when it controlled the fixed line network.\nThe advent of the national broadband network changes the industry dynamics and levels the playing field.\nThe provision of access to households will be controlled by the NBN Co, a government monopoly.\nIts business model involves charging for the amount of data carried on its network. That has already caused ructions in the industry because companies such as iiNet struggle to make money when they must pay to carry the over the top streaming services.\nTelstra will be forced to embrace all industry disruptors as quickly as possible.\nTo be fair, Penn's speech and subsequent question and answer session at the CEDA lunch in Sydney showed he recognises the importance of embracing all forms of innovation.\nHe just returned from a trip last week to the Tesla electric car factory in California. He has overseen Telstra's move into venture capital investment and he has pushed hard the move into healthcare.\nInnovation centre \"Here in Sydney we opened our Insights Centre earlier this year,\" he said.\n\"It includes workshop spaces, partner pop-up installations, a connected home, hands-on technology demonstrations and customer collaboration areas all with state of the art connectivity and business technology solutions.\n\"In August we will open a new purpose-built Innovation Centre in Melbourne. A world-class space for customers, staff, inventors, vendors and partners to prototype and innovate.\"\nPenn is taking over Telstra at an interesting point in its history. The dividend yield which has underpinned the share price remains the biggest selling point for the company. The company's growth prospects in Asia are much talked about but that is a long-term game.\nPenn laid out a credible plan for maintaining Telstra's quality edge in networks but the increased investment comes at a time when competition is increasing.\nTougher competition can be seen in recent adjustments to Telstra's mobile plans including higher data allowances.\nThe market will want Penn to deliver growth but the first question on the minds of many shareholders at the next financial results will include the word left out of Thursday's speech: dividends.\nDeath of conglomerates When Macquarie analyst Mike Wiblin recently referred to a colleague's prediction that global financial conglomerates were on the death watch he had no inkling of the new tax imposed by the British government on banks. The move to impose an 8 per cent tax surcharge on banks will almost certainly force HSBC and Standard Chartered to abandon the UK. That suggests a break up of two of Asia's largest global banks. That may have implications for Australia's ANZ Banking Group.\nTony Boyd\nTwitter: @TonyBoydAFR\ntony.boyd@afr.com.au", "external_links": ["http://twitter.com/@TonyBoydAFR"], "published": "2015-07-09T17:46:00.000+03:00", "crawled": "2015-07-10T06:06:39.000+03:00", "highlightTitle": ""}