{"organizations": [], "uuid": "0231d0f3ef856cadd90894897c9b4048dcc933cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/07/prweb12833919.htm", "country": "US", "title": "New Penn Financial Hires New Branch Manager", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "New Penn Financial Hires New Branch Manager", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "0231d0f3ef856cadd90894897c9b4048dcc933cd"}, "author": "PRWEB", "url": "http://www.prweb.com/releases/2015/07/prweb12833919.htm", "ord_in_thread": 0, "title": "New Penn Financial Hires New Branch Manager", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "He brings knowledge and experience in building lasting realtor and builder relationships through talented teams, and Garrett’s outstanding reputation is not limited to sales teams Plymouth Meeting, PA (PRWEB) July 09, 2015\nNew Penn Financial announced today the hiring of Garrett Toste as Branch Manager. With over 20 years of financing and management experience Garrett is proven in his ability to generate, inspire, and develop top talent while maintaining and growing strong relationships with realtor partners. His success is in part due to his dedication towards creating the best financing experience for all parties involved, a superior work ethic, and an ability to lead and communicate effectively at all levels. Adept at reviewing complex situations and the ability to recognize customer needs, Garrett will be able to leverage the diverse New Penn product offering to help more buyers than ever before.\nMr. Toste joins New Penn as Branch Manager in San Antonio, where he will look to grow local market share. “I believe that New Penn’s competitive rates, turn times, and management team will give me and my team what we need to reach and surpass our goals in the San Antonio market. New Penn is making a big push into Texas, and I look forward to being a part of it.”\n“Garrett’s previous successes were strong factors in bringing him to New Penn Financial,” says Texas Regional Manager Deena Sisson. “He brings knowledge and experience in building lasting realtor and builder relationships through talented teams, and Garrett’s outstanding reputation is not limited to sales teams. He has earned a highly respected reputation with the operational teams in the South Texas Market. The combination of sales and operational top talent will only help us to grow and to make a real difference in the San Antonio housing market!”\nAbout New Penn Financial\nNew Penn Financial® continues to assemble deeply experienced and highly seasoned industry leaders, making us one of the fastest growing lenders in the nation. As a direct lender and servicer, we have positioned ourselves to be able to provide loans that serve a variety of scenarios. This allows us to assist more customers while maintaining the highest compliance standards, ensuring great customer service at every stage. Our leadership has successfully and strategically directed their teams to be prosperous during the downs of a challenging economy while capitalizing on the potential of a robust one. This depth of wisdom and focus on quality allows us to innovate with confidence, develop superior products, provide exceptional service and support, and back it up with the kind of solid foundation that is renewing the American Dream, all across the country.", "external_links": [], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-09T13:12:33.000+03:00", "highlightTitle": ""}