{"organizations": [], "uuid": "fc610360f046b0ef34b4c552da7221b5fbb2d21c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Eurogroupmeeting008072015.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/eurogroup-meeting-ends-fruitless-greece-insists-it-tabled-proposals/42700.html", "country": "IN", "title": "Eurogroup meeting ends fruitless, Greece insists it tabled proposals", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Eurogroup meeting ends fruitless, Greece insists it tabled proposals", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T08:50:00.000+03:00", "replies_count": 0, "uuid": "fc610360f046b0ef34b4c552da7221b5fbb2d21c"}, "author": "IANS", "url": "http://www.moneylife.in/article/eurogroup-meeting-ends-fruitless-greece-insists-it-tabled-proposals/42700.html", "ord_in_thread": 0, "title": "Eurogroup meeting ends fruitless, Greece insists it tabled proposals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Eurogroup meeting ends fruitless, Greece insists it tabled proposals 42700 Eurogroup meeting ends fruitless, Greece insists it tabled proposals 0 Comments, Be the first to comment + COMMENT IANS | 08/07/2015 11:20 AM | An emergency Eurogroup meeting in Brussels on the Greek debt deal ended inconclusive on Tuesday, with lenders saying that they expected to discuss Greece's proposals on Wednesday during a Eurogroup teleconference. The finance ministers of euro zone countries didn't receive new proposals they had expected from Greece on Tuesday, Eurogroup head Jeroen Dijsselbloem said after the crucial meeting. \"We welcome our new Greek colleague and listen to his assessment of situation after the 'no' vote in Greece,\" he said in a short statement, adding that there are no new proposals from new Greek Finance Minister Euclid Tsakalotos, Xinhua reported. \"The Greek government will send a new request letter for European Stability Mechanism (ESM) support, as soon as it comes in, I am hopeful that tomorrow morning we will have another conference call in the Eurogroup to formally start the process of dealing with the request,\" Dijsselbloem said. He noted that the group will ask the European Union institutions to look at the financial situation in Greece. \"And then the institutions will come back to us, and we will see whether we can formally start the negotiations,\" he said. However, Greek government sources dismissed the criticism, insisting that Greece's new Finance Minister Tsakalotos had in fact presented proposals. \"Is the problem that we do not have proposals, or that they do not like our proposals? \" a government source asked, according to the Greek national news agency AMNA. The Greek side stressed that Greece's proposals had been rejected again. The statements from both sides were made as Greek Prime Minister Alexis Tsipras was holding a meeting with German Chancellor Angela Merkel and French President Francois Hollande in Brussels ahead of the extraordinary euro zone summit which convenes later on Tuesday on the Greek issue. According to government sources in Athens, the Greek side is requesting a two-year, 29-billion-euro-worth ($32 billion) bailout programme through the ESM. Meanwhile, several European partners prefer a bridge agreement for a few months first in exchange for the swift implementation of reforms by the Greek side as a test before a comprehensive deal is discussed. Officials and analysts from both sides warn that the situation is perilous. Greek banks are closed and capital controls have been imposed in Greece since June 29, ATMs are expected to run out of cash this week, and without emergency assistance, Greece seems to be heading to default and possibly an exit from the euro zone. Since July 1, Greece has been in arrears to the International Monetary Fund and needs to repay 3.5 billion euros in loan installments to the European Central Bank by July 20. Earlier in the day, European Commission (EC) president Jean-Claude Juncker called on partners to put \"egos\" aside and return to the negotiation table to avoid a \"Grexit\". \"We have to put our little egos, and in my case very large ego, away and we have to deal with the situation we face,\" Juncker said. The US urged \"a compromise\" between Athens and international creditors and suggested a package of reforms and financing. \"The referendum is over, but our view here at the White House remains the same... it will require both a package of financing and reforms that will allow Greece to achieve, or at least be on a path towards some debt sustainability, but also be on a path towards economic growth,\" White House spokesman Josh Earnest said. French Prime Minister Manuel Valls warned that an eventual Grexit from the eurozone would put the economic recovery of the European bloc on edge and likely trigger political instability in the region. \"France is convinced that we cannot take the risk of a Greek exit from the eurozone for economic reasons but mainly for political ones. It is Europe that is in question,\" the French premier told RTL radio. Following the Eurogroup group meeting, a euro zone EU leaders emergency summit was underway in Brussels, Belgium, to find a way for an agreement between Athens and its creditors. More in Moneylife", "external_links": [], "published": "2015-07-08T08:50:00.000+03:00", "crawled": "2015-07-08T12:45:42.000+03:00", "highlightTitle": ""}