{"organizations": [], "uuid": "fefe601915758a6998914d59ea3790cb9620266b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-02/china-to-individual-investors-go-ahead-bet-the-house-on-stocks", "country": "US", "title": "China to Individual Investors: Go Ahead, Bet the House on Stocks", "performance_score": 7, "site": "bloomberg.com", "participants_count": 1, "title_full": "China to Individual Investors: Go Ahead, Bet the House on Stocks - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T00:00:00.000+03:00", "replies_count": 0, "uuid": "fefe601915758a6998914d59ea3790cb9620266b"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-07-02/china-to-individual-investors-go-ahead-bet-the-house-on-stocks", "ord_in_thread": 0, "title": "China to Individual Investors: Go Ahead, Bet the House on Stocks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In China, you can now literally bet the house on the nation’s tumultuous stock market.\nUnder new rules announced Wednesday by the country’s securities regulator, real estate has become an acceptable form of collateral for Chinese margin traders, who borrow money from securities firms to amplify their wagers on equities. That means if share prices fall enough, individual investors who pledge their homes could be at risk of losing them to a broker.\nWhile the rule change was intended to help revive confidence in China’s $7.7 trillion stock market after a 24 percent slump in less than three weeks, analysts say securities firms may be reluctant to follow through. Accepting real estate as collateral would tether brokerages to another troubled sector of the economy, adding to risk-management challenges as they try to navigate the world’s most-volatile stock market.\n“It does come across as relatively desperate,” said Wei Hou, an analyst at Sanford C. Bernstein & Co. in Hong Kong. “Globally, illiquid assets such as real estate are not accepted as collateral as they are very hard to liquidate.”\nThe new guidelines also permit non-listed shares and “other assets” as collateral for margin traders who have insufficient value in their stock accounts to repay loans. The China Securities Regulatory Commission didn’t respond to a faxed query on the changes, while Citic Securities Ltd., the nation’s biggest brokerage, declined to comment.\nShanghai Selloff “This is simply not practical,” said Chen Gang, the chief investment officer at Shanghai Heqi Tongyi Asset Management Co. He joked with colleagues that brokers would have to become experts in everything from property to antiques, given the range of assets that clients could potentially pledge.\n“Brokers are not stupid,” said Hao Hong, a China strategist at Bocom International Holdings Co. in Hong Kong. “I don’t think they would be willing to take this kind of collateral.”\nThe Shanghai Composite Index closed below the 4,000 level on Thursday for the first time since April, even after stock exchanges cut fees and the securities regulator rolled out its margin financing rule revisions more quickly than planned because of “market conditions.” Declines since June 12 have erased at least $2.4 trillion of value from Chinese shares, more than the entire market capitalization of France.\nMargin traders, who boosted leveraged bets nine-fold to 2 trillion yuan ($322 billion) in the past two years, have been closing out those positions for a record eight straight days.\nControlled Risk At Haitong Securities Co., China’s third-biggest brokerage, board secretary Huang Zhenghong said the firm was implementing the new rules, calling risks in its margin finance and securities lending business “controllable.” Huang didn’t comment on exactly what kinds of collateral Haitong will accept.\nFor Chen, relaxed rules on margin trading are unlikely to succeed in propping up the market. He said a half-year suspension of initial public offerings, which tend to weigh on the stock market because they divert funds from existing shares, would be more effective.\n“It’s like your girlfriend has broken up with you and then you decide to buy her a one-carat ring” instead of something much bigger, Chen said. “That’s useless.”", "external_links": [], "published": "2015-07-03T00:00:00.000+03:00", "crawled": "2015-07-02T23:03:17.000+03:00", "highlightTitle": ""}