{"organizations": [], "uuid": "4e281772994e98e24a8967d180c9ce647ff7721a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/06/deals-day-idUSL3N0ZM4EZ20150706", "country": "US", "title": "Deals of the day-Mergers and acquisitions", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Deals of the day-Mergers and acquisitions | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T17:34:00.000+03:00", "replies_count": 0, "uuid": "4e281772994e98e24a8967d180c9ce647ff7721a"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/06/deals-day-idUSL3N0ZM4EZ20150706", "ord_in_thread": 0, "title": "Deals of the day-Mergers and acquisitions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Royal Bank of Scotland, Petrobras, Stemcor, Reliance, Raiffesien Bank; Updates CTC Media, Eberspaecher)\nJuly 6 (Reuters) - The following bids, mergers, acquisitions and disposals were reported by 1330 GMT on Monday:\n** Health insurer Aetna Inc said on Friday it would buy smaller rival Humana Inc for about $37 billion in cash and stock, in the largest ever deal in the insurance industry.\n** Britain is planning to sell half its stake in Royal Bank of Scotland, worth 16 billion pounds ($25 billion) within two years of a possible first sale in September, according to people with knowledge of government thinking.\n** State-controlled oil producer Petróleo Brasileiro SA could sell a stake in Brazil's Braskem SA and build provisions against tax debts nearing 40 billion reais ($12.7 billion) to reduce costs and make finances sustainable, Valor Econômico newspaper said.\n** Canada's Potash Corp of Saskatchewan said it was confident of addressing concerns raised by K+S over its 7.9 billion euro ($8.7 billion) takeover proposal for the German potash miner, giving K+S's stock a boost.\n** Russian broadcaster CTC Media said it had received a $200 million offer for 75 percent of its operating assets in Russia and Kazakhstan from UTH Russia, part-owned by billionaire Alisher Usmanov.\n** Family-owned German car parts maker Eberspaecher is exploring a partnership with an overseas peer or a partial sale as it seeks to expand internationally, several sources familiar with the matter said.\n** Abu Dhabi Islamic Bank, which recently failed in its bid for Citigroup's Egypt retail business, is targeting acquisitions in 2016 in Asia, the Middle East, and North Africa, its chief executive said.\n** Kuwait's Al Ahli Bank received approval from the Gulf state's central bank to buy Piraeus Bank's Egyptian unit, it said on Monday.\n** German asset manager Union Investment has bought most of the remaining assets of Austria's Volksbanken as the part-nationalised group winds down after failing European bank stress tests.\n** U.S. cigarette giant Philip Morris International Inc plans to sell a stake worth at least $1 billion in Indonesian unit PT HM Sampoerna Tbk to comply with free-float rules, two people familiar with the matter said on Monday.\n** China Molybdenum Luoyang Co is poised to make an offer for an overseas mining project costing up to $2.15 billion, the latest push by a Chinese enterprise to acquire resource assets beyond its borders.\n** U.S. media group Scripps Networks Interactive has offered to pay a total of 3.2 billion zlotys ($843.64 million) to buy the shares in Polish broadcaster TVN it does not already own to take full control over the company and delist it.\n** Elliott Associates has bought shares in Samsung Fire & Marine Insurance Co Ltd, a spokeswoman for the South Korean firm said, potentially strengthening the U.S. hedge fund's hand in its bid to block an $8 billion proposed merger of another two Samsung Group companies.\n** Australian childcare operator Affinity Education on Monday urged shareholders not to accept a $121 million takeover offer from larger rival G8 Education Ltd, saying it would refer the all-share bid to regulators after what it called \"opportunistic\" off-market purchases of Affinity stock by G8.\n** Berlin is wooing private investors including Macquarie and JP Morgan to take a stake in its much-delayed new international airport, German newspaper Bild wrote on Sunday.\n** Mercedes F1 non-executive chairman Niki Lauda has dismissed a report suggesting Formula One rival Red Bull could switch from Renault to Mercedes engines with Aston Martin branding.\n** Formula One's commercial rights holders CVC Capital Partners are under no pressure to sell their controlling stake in the sport and want to keep it, co-chairman Donald Mackenzie told Reuters.\n** German utility RWE is considering a restructuring that could see units such as RWE Generation and RWE Innogy being merged or swallowed up by the parent group as it battles an industry-wide crisis, a German newspaper reported on Saturday.\n** Consolidation continues to be necessary in the auto industry but there is nothing new to report on Fiat Chrysler's desire for a tie-up with General Motors , FCA CEO Sergio Marchionne said on Friday.\n** South African gaming and hotel group Tsogo Sun Holdings has scrapped plans to buy a minority stake in two casinos owned by Sun International, the companies said.\n** Copenhagen-based private equity firm Polaris said it had made a binding offer to acquire all outstanding shares in Danish ferry company Mols-Linien and planned to delist the company from the stock exchange.\n** Creditors of insolvent German wind park operator Prokon have voted to try to revive the company themselves, rejecting a takeover bid from utility EnBW, the administrator said on Thursday.\n** The entertainment arm of Chinese property conglomerate Dalian Wanda Group said on Friday it would lead an almost 6 billion yuan ($967 million) investment into one of China's biggest travel websites, its first foray into online tourism.\n** Dutch lender ING Group is set to win the auction to buy HSBC Holdings Plc's Turkish business, people familiar with the matter said on Thursday.\n** Dollar Tree Inc was given the go-ahead to buy Family Dollar Stores Inc by the U.S. Federal Trade Commission on condition that they sell 330 Family Dollar stores, putting to rest a year-long merger saga.\n** Sycamore Partners is preparing an offer for Belk Inc that could value the U.S. department store chain at between $3 billion and $3.5 billion, including debt, and become the buyout firm's largest deal, people familiar with the matter said on Thursday.\n** Debt-laden steel trader Stemcor, one of the UK's largest private companies, has agreed a deal with U.S. distressed investment fund Apollo and with its other lenders that \"secures its future\", Stemcor said.\n** India's Reliance Industries Ltd plans to sell a 3.1 percent stake, worth $32 million at the current market price, in unit Network18 Media & Investments Ltd to comply with rules mandating public ownership in listed firms.\n** The European Bank for Reconstruction and Development said it was considering taking a significant minority stake in the loss-making Ukrainian unit of Raiffeisen Bank International (RBI) RBIV.VI.\n($1 = 3.7931 zlotys) ($1 = 0.9008 euros) ($1 = 6.2047 Chinese yuan renminbi) ($1 = 0.6429 pounds) ($1 = 3.1496 Brazilian reais) (Compiled by Anya George Tharakan and Natalie Grover in Bengaluru)", "external_links": [], "published": "2015-07-06T17:34:00.000+03:00", "crawled": "2015-07-06T16:49:36.000+03:00", "highlightTitle": ""}