{"organizations": [], "uuid": "876159249b805600f7b31321fd5cd7a652ed71fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/inside-track-by-coomi-kapoor-3/99636", "country": "IE", "title": "Inside track by Coomi Kapoor", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Inside track by Coomi Kapoor | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T08:20:00.000+03:00", "replies_count": 0, "uuid": "876159249b805600f7b31321fd5cd7a652ed71fd"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/inside-track-by-coomi-kapoor-3/99636", "ord_in_thread": 0, "title": "Inside track by Coomi Kapoor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home vs MEA\nThere is a divide between the ministry of external affairs and the home ministry over the latter’s clampdown on international NGOs for alleged violations of Indian rules and regulations. The US is upset over the home ministry’s stringent action against the Ford Foundation, which has made its continuation in India problematic. Representatives from the US have been mounting pressure on the MEA. US defense secretary Ashton Carter who led a delegation to India raised the issue during his recent visit.\nAssistant secretary of state Nisha Biswal and under secretary of state Wendy Sherman also brought up the matter with their Indian counterparts. The subject was raised in discussions during foreign secretary S Jaishankar’s visit to the US. US ambassador Richard Verma expressed his concern to the government and so has the US political counselor based in Delhi who has met home ministry officials twice. When India’s ambassador to the US Arun Singh was in India recently, he urged the home ministry to go slow with its punitive actions. The foundation, closely associated with the US, has been in India for more than half a century.\nOn the other side\nPrashant Kishor, formerly one of Narendra Modi ’s key media strategists during the 2014 election campaign, is now working hard for Nitish Kumar’s success in the Bihar Assembly polls. But Kishor, who hails from the state, is banking on a more traditional campaign than the hi-tech gimmicks he used last time, such as 3D holograms, laser shows, etc. This time Kishor is concentrating on a door-to-door campaign with JD(U) workers hoping to achieve the target of knocking on one crore homes. Kishor and his team are keeping tabs on all of Kumar’s ministers to make sure they are actually hitting the campaign trail. Kishor’s army of youth dressed in black keeps checking on the locations of senior JD(U) leaders through mobile phone. Incidentally, when the very same Kishor volunteers were working for Modi, Kumar had given instructions to keep the youth dressed in black out of JD(U) rallies and meetings.\nR&AW truth\nAs a long time IB man, AS Dulat knows a closely guarded secret or two about R&AW. In his recently released book, one of the things he discloses is that R&AW chiefs have an exclusive lift for their use in their office building. A R&AW chief can drive quietly to the back of the 11-storey building and take the lift all the way to the top floor, without anyone coming to know. Everyone else has to use the elevators at the front entrance.\nA little awkward\nAS Dulat whose book Kashmir: The Vajpayee Years has created ripples invited national security adviser Ajit Doval for the launch—if he did not “feel awkward” about it. Dulat was senior to Doval in the IB. Doval excused himself, claiming he was out of town. But there is a certain amount of awkwardness for the NSA, particularly the reference in the book that he, along with Jaswant Singh, accompanied Mushtaq Ahmed Zargar, Ahmed Omar Saeed Sheikh and Maulana Masood Azhar, the three terrorists released in exchange for the hostages during the IC-814 hijack, from Delhi to Afghanistan. The freeing of the terrorists is not an act which the NDA government wants to be reminded of.\nGetting a new voice\nPrime Minister Narendra Modi was reportedly upset with BJP spokespersons on television, who he felt were not doing a convincing job of presenting the party’s viewpoint on recent controversies centering around party leaders. Modi felt there was a need for spokespersons to raise definite talking points and adopt a clear line rather than speaking in generalities.\nBut if the spokespersons sound disjointed, it is because their briefings by the party seniors have been confused. For instance, it was not clear whether the BJP views Lalit Modi as a fugitive from the law or a victim of the last regime.\nAmit Shah decided to set up a new media department headed by veteran journalist MJ Akbar, now an MP, in the hope that it will present a more cogent defence on ticklish issues. Since the 2014 elections, when most of the party spokespersons were elevated as MPs and ministers, it has been left largely to Sambit Patra and GVL Narasimha Rao to hold the fort.\n 12, 2015 12:20 am", "external_links": [], "published": "2015-07-12T08:20:00.000+03:00", "crawled": "2015-07-12T04:22:35.000+03:00", "highlightTitle": ""}