{"organizations": [], "uuid": "9e914cb31626a7d5e9a00e8ae303594bd2434735", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/3/m/y/f/3/image.related.afrArticleLead.620x365.gi33uh.png/1435797179292.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/gay-marriage-causes-coalition-civil-war-20150702-gi33uh", "country": "AU", "title": "Gay marriage causes Coalition civil war", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Gay marriage causes Coalition civil war | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T07:47:00.000+03:00", "replies_count": 0, "uuid": "9e914cb31626a7d5e9a00e8ae303594bd2434735"}, "author": "Phillip Coorey", "url": "http://www.afr.com/news/politics/gay-marriage-causes-coalition-civil-war-20150702-gi33uh", "ord_in_thread": 0, "title": "Gay marriage causes Coalition civil war", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Tony Abbott wants to stop a party-room debate while Senator Eric Abetz says ministers who support gay marriage should quit frontbench. Andrew Meares Share on twitter by Phillip Coorey Civil war is erupting within the Liberal Party as arch-conservative MPs accuse pro-gay marriage colleagues of colluding with the Greens and Labor to derail the government's agenda and demanding ministers who support change resign from the frontbench.\nBacked by Prime Minster Tony Abbott who moved swiftly Wednesday to kill a push by his own backbench to debate the party's position when Parliament , conservatives have hit the airwaves to crush the push, which has the support of an estimated one-third of the Liberal Party backbench.\nGay marriage advocates, who were promised by Mr Abbott they could at least have a debate, are livid and one has warned the Prime Minster risks re-wakening the leadership issue should he not honour his pledge.\nThe issue flared on Wednesday when, as anticipated, Liberal MP Warren Entsch confirmed a report he would be introducing a private members bill to Parliament in August.\nOnce the bill, to be co sponsored by Labor, the Greens and independents, was introduced, the party room would be able to debate its position.\nCurrently, Liberal MPs are bound to vote against gay marriage but Mr Abbott promised before the election the party could debate having a conscience vote if a bill came before the Parliament.\nBut on Wednesday, Mr Abbott backtracked, signalling he would not even allow the party room to have a debate.\nHis spokesman said there could only be a debate if the bill was to be brought to a vote and the government was going to use its numbers to stop than happening.\n Liberal Senate leader Eric Abetz said ministers who supported gay marriage should resign from the frontbench as he did in Opposition when he refused to back Malcolm Turnbull over an emissions trading scheme.\n\"There is very strong support in favour of maintaining the definition of marriage as it is in the marriage act\".\n\"If you can't support party policy, like I did with emissions trading, you do the honorable thing and I resigned from the front bench,\" he said.\nLiberal Senator Cory Bernardi, who once claimed legalised gay marriage would lead to legalised bestiality, accused his colleagues of siding with Labor and the Greens to derail the government's economic and national security agenda. He said they were captive to \"left activism\".\nMr Bernardi said gay marriage would lead to gay couples having children. But gay couples have long been able to have children in Australia.\nSenator Abetz claimed the change would put Australia out of step with the region and lead to \"polyamory\".\n\"The Labor party and other journalists tell us time and time again we are living in the Asian century, tell me how many Asian countries have redefined marriage,\" he said.\n\"Well, are we in the Asian century or not, it's amazing how certain people try to pick and choose in relation to debates.\"\nGay marriage is legal in New Zealand, The United States, the United Kingdom, Canada and Ireland.", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-07-02T07:47:00.000+03:00", "crawled": "2015-07-02T05:42:23.000+03:00", "highlightTitle": ""}