{"organizations": [], "uuid": "7a8b1deb4b903c909056f19737308ad2c7899a47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-retail/?format=rss", "section_title": "Retail News | Retail Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/laird-plc-better-buy-tesco-122134106.html", "country": "GB", "title": "Is Laird PLC A Better Buy Than Tesco PLC?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is Laird PLC A Better Buy Than Tesco PLC?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T15:21:00.000+03:00", "replies_count": 0, "uuid": "7a8b1deb4b903c909056f19737308ad2c7899a47"}, "author": "", "url": "https://uk.finance.yahoo.com/news/laird-plc-better-buy-tesco-122134106.html", "ord_in_thread": 0, "title": "Is Laird PLC A Better Buy Than Tesco PLC?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 30, 2015, 15:43 BST - UK Markets close in 47 mins. Is Laird PLC A Better Buy Than Tesco PLC? By Peter Stephens | Fool.co.uk – 2 hours 22 minutes ago 214.95 +1.9500 \nShares in Laird (LSE: LRD) have soared by as much as 14% today after the technology company released a positive update. The key takeaways were that Laird increased its pretax profit for the first half of the year by 35% versus the same period last year and, crucially, it has reiterated its guidance for the full year. \nAs such, Laird expects to post a rise in its bottom line of 18% in the current year, with demand for its shielding products in particular helping to push its sales and profitability considerably higher. Furthermore, Laird is benefitting from stronger sterling, which is providing its financial numbers with a significant boost. And, looking ahead to next year, Laird is expected to continue to grow its earnings, with growth of 10% currently being pencilled in. \nDespite all of the above, Laird continues to offer excellent value for money. For example, it trades on a price to earnings (P/E) ratio of just 17.8 which, when combined with its growth prospects, equates to a price to earnings growth (PEG) ratio of just 0.8. As such, and even though its shares have risen by 29% since the turn of the year, Laird appears to offer growth at a very reasonable price. \nOf course, Tesco (LSE: TSCO) is enduring a rather different outlook than Laird. Despite having a new strategy and new management team, it continues to suffer from a shift in customer tastes, with no-frills, discount supermarket, Aldi, this week showing that demand for its cheaper products remains relatively high. That's somewhat surprising, since wage growth is far outstripping inflation for the first time in a number of years, which should cause many shoppers to focus less on price than they have been doing in the past. \nLooking ahead, though, Tesco is expected to post improved financial numbers. For example, its bottom line is expected to rise by a whopping 33% next year which, if met, could be a hugely positive catalyst to turn investor sentiment around. And, while Tesco does have a rather high P/E ratio of 24.2, when its growth potential is taken into account it equates to a PEG ratio of just 0.6, which indicates that Tesco's share price rise of 13% year-to-date could continue. \nClearly, Tesco has been hurt by a changing UK supermarket sector and, while it still pays a dividend, its yield of 0.4% is hardly impressive. And, while its payout ratio of less than 10% indicates that dividends could move higher, Laird's yield of 3.3% is far more impressive. And, with Laird having strong growth prospects and dividend payouts being just 58% of profit, it appears to be the better income play at the present time. \nAs for whether Laird is the better overall buy, both stocks have very bright long term futures for their investors. They both have growth potential and offer good value and, in Tesco's case there is perhaps more scope for a turnaround in investor sentiment which could boost its share price. However, with Laird delivering top notch performance right now, it seems to be a less risky proposition than Tesco and, while Tesco may be cheaper, Laird seems to be the preferred option at the present time. \nOf course, finding great value stocks is never an easy task. That's why The Motley Fool has written a free and without obligation guide called 7 Simple Steps For Seeking Serious Wealth. \nIt's a step-by-step guide that could make a real difference to your portfolio returns in 2015 by helping you to find the best stocks at the lowest prices. \nClick here to get your copy - it's completely free and comes without any obligation. \nPeter Stephens owns shares of Laird and Tesco. The Motley Fool UK owns shares of Tesco. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-30T15:21:00.000+03:00", "crawled": "2015-07-30T17:47:16.947+03:00", "highlightTitle": ""}