{"organizations": ["Christchurch Town Hall"], "uuid": "a78466fa3f64a71e3aaf01bec1ce5d25605f5b01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.3news.co.nz", "main_image": "http://cdn.3news.co.nz/3news/AM/2015/7/8/6eee07b4-75fe-4306-a423-3d138e498e81/townhall-1200.jpg", "site_section": "http://feeds.feedburner.com/co/hYAN", "section_title": "Business / Finance news", "url": "http://www.3news.co.nz/nznews/christchurch-town-hall-damage-on-display-2015070812", "country": "NZ", "title": "Christchurch Town Hall damage on display", "performance_score": 0, "site": "3news.co.nz", "participants_count": 0, "title_full": "Christchurch Town Hall damage on display", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T02:53:00.000+03:00", "replies_count": 0, "uuid": "a78466fa3f64a71e3aaf01bec1ce5d25605f5b01"}, "author": "", "url": "http://www.3news.co.nz/nznews/christchurch-town-hall-damage-on-display-2015070812", "ord_in_thread": 0, "title": "Christchurch Town Hall damage on display", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  12:53 p.m. \nAn official tour has given a rare glimpse inside the quake-damaged Christchurch Town Hall. \nThe Christchurch City Council recently confirmed their decision to save the building at a cost of $127.5 million. \nChristchurch mayor Lianne Dalziel was at the building this morning for a blessing and contract signing with rebuild company Hawkins Construction. It's been closed since suffering serious damage in the February 2011 earthquake. \nThe restoration work is due to be completed in 2018, and includes repairing and strengthening the building to 100 percent of building standards. \nHawkins Construction South Island regional manager Steve Taw says he's \"excited\" to be involved in the remediation project. \n\"It is an important piece of Christchurch's infrastructure, it's a community building\", he says. \n\"It's something we take great pride in and it's something we have experience in as some of the team here in Christchurch have been working on projects like the Auckland War Memorial and the Auckland Art Gallery.\" \nMr Taw admits the building suffers from land issues but says several techniques have been devised to combat problems brought on by the quakes. \n\"I don't think there's anywhere in Christchurch that doesn't have land issues but obviously some areas are more affected than others,\" he says. \n\"We're going to embark on this project with a number of engineering projects and one of those is to reinforce the ground capacity of the building underneath. Then we look to go for a more traditional-type approach with a large raft slab which essentially creates a monolithic slab which supports the building as a whole.\" \nThe work will also include several upgrades and refurbishments, including a possible reconfiguration of the James Hay Theatre. \n3 News", "external_links": [], "published": "2015-07-08T02:53:00.000+03:00", "crawled": "2015-07-08T04:34:52.000+03:00", "highlightTitle": ""}