{"organizations": [], "uuid": "a8153fde3f99d3a7dc0e452c623f4d2dba613efc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507080074.html", "country": "US", "title": "Africa: Private Universities in Africa Are Missing a Trick", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Private Universities in Africa Are Missing a Trick", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T09:00:00.000+03:00", "replies_count": 0, "uuid": "a8153fde3f99d3a7dc0e452c623f4d2dba613efc"}, "author": "", "url": "http://allafrica.com/stories/201507080074.html", "ord_in_thread": 0, "title": "Africa: Private Universities in Africa Are Missing a Trick", "locations": ["Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rwanda: Farming Liberated Semarembo From Poverty \nIn Ghana, these institutions are called university colleges - privately established but managed and accredited by older public universities. Most of Liberia's private universities were established by Christian missionary groups. \nNo matter their structure and location, these private institutions are a valuable addition to Africa's higher education landscape - and, ultimately, the continent's economies . \nFor one thing, they broaden access to higher education. In many countries, governments have focused their education funding on the primary and secondary sectors. This matches most donors' priorities and the United Nations' Millennium Development Goals . \nPublic institutions are scrambling for money . They are also crammed to capacity and simply cannot cater for the growing number of young Africans who want a university degree. \nThough private universities are an important part of the sector, far more must be done to make them powerhouses of knowledge, research and graduate output. \nFlaws in the system \nAbout 90% of Africa's jobs are in the informal economy, which is associated with low productivity, low quality and low pay. At the same time, the continent is urbanising rapidly and a natural resources boom has handed some countries a golden growth opportunity . Africa badly needs the kind of skilled people that a good university can produce such as engineers, scientists and computer technicians. \nPrivate universities are uniquely poised to address the continent's economic and development needs. They don't rely on government funding and are not subject to government pressure. They are often smaller than their public counterparts and are less bureaucratic by their very nature, so decisions can be made quickly. \nSince their founders often come from the private sector, they ought to have better links to various industries and a better understanding of what kind of employees those industries need. \nSo what is holding them back? \nThe first constraint is that there is a shortage of PhDs on the continent. In Nigeria and Kenya , most university lecturers don't have PhDs. The only way private institutions can get around the shortage is to employ senior academics from public universities on a contract basis. \nThese academics won't quit their full-time jobs or give up the pensions they've been working towards for years. They consider the public sector more stable - but they welcome the extra income. The quality of teaching naturally suffers when academics are trying to do both their full-time and a part-time job. \nWithout senior academics qualified to supervise postgraduates, private institutions struggle to develop and produce their own research. There is also very little capacity for revamping existing curricula or developing totally new course material. \nThis means that private institutions tend to recycle public unversities' old curricula so they are really not offering their students anything new or groundbreaking, and certainly nothing to justify considerably higher fees . \nA functional model \nAlthough governments do not fund private universities, they do have an important role to play in building, supporting and monitoring the sector. They need to regulate private institutions so that they offer good quality education and qualification. \nThere is much to learn from Ghana's model of university colleges. These encourage a good working relationship between private and public institutions. This is far more constructive than the rivalry that exists between the two sectors elsewhere on the continent. \nGovernments have the authority to bring public and private institutions to the same table and help them to establish productive partnerships. These can ultimately only benefit the entire higher education system - and Africa's university students. Africa", "external_links": [], "published": "2015-07-08T09:00:00.000+03:00", "crawled": "2015-07-08T11:08:28.000+03:00", "highlightTitle": ""}