{"organizations": [], "uuid": "2345699ba7104648eb0d751acbe249678734519f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.finfacts.ie", "main_image": "", "site_section": "http://www.finfacts.ie/irelandbusinessnews/rss.xml", "section_title": "Finfacts Ireland Business & Finance Portal", "url": "http://www.finfacts.ie/irishfinancenews/article_1028935.shtml", "country": "GB", "title": "German car firms boost exports from Spain, UK, Portugal, Czech Republic, Slovakia, Hungary and Romania", "performance_score": 0, "site": "finfacts.ie", "participants_count": 0, "title_full": "German car firms boost exports from Spain, UK, Portugal, Czech Republic, Slovakia, Hungary and Romania", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T11:11:00.000+03:00", "replies_count": 0, "uuid": "2345699ba7104648eb0d751acbe249678734519f"}, "author": "", "url": "http://www.finfacts.ie/irishfinancenews/article_1028935.shtml", "ord_in_thread": 0, "title": "German car firms boost exports from Spain, UK, Portugal, Czech Republic, Slovakia, Hungary and Romania", "locations": ["Portugal", "Hungary", "Czech Republic", "Slovakia", "Spain", "Romania", "UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "German car firms boost exports from Spain, UK, Portugal, Czech Republic, Slovakia, Hungary and Romania   editor of Finfacts Jul 27, 2015 - 8:11 AM   \nAlmost two-thirds of the production of German car manufacturers is outside Germany and they help to make cars + car parts one of the top goods exports from Spain, UK, Portugal, Czech Republic, Slovakia, Hungary, Slovenia, Romania and Poland. \nImproving the dismal inward investment record is key to a Greek recovery and coupled with a positive environment in an economy conducive to attracting new projects, at indigenous company level whether it was Nokia in feebly responding to Apple's move into phones, or shoe and textile manufacturers in Italy, Spain and Portugal, responding to competition from China and Vietnam, the ones that did not change died. \nIn 2014 the automotive sector was Germany's biggest goods export category with an 18% share, valued at €80bn. However, domestic production at 5.6m units (includes vans) in 2014 was up only 9% since 2000 while overseas production jumped by over 140% to 9.3m according to data from the German Association of the Automotive Industry (VDA) . Spain was Europe's No. 2 manufacturer in 2014 with 1.9m units. Volkswagen (VW) acquired SEAT, the local car company, in 1986. Vehicle exports/ total goods ratio was at 18%; The UK with car companies owned by Japanese, German and Indian companies produced 1.5m units and the total goods export ratio in 2014 was 13%; France was just slightly behind the UK at 1.5m units and the total goods export ratio was 6%; The Czech Republic had an output of 1.2m units with a total goods export ratio of 19%; Slovakia produced 993,000 units and it had a total goods export ratio of 25%; Poland produced 473,000 units and it had a total goods export ratio of 10%: Italy produced 401,000 units and it had a total goods export ratio of 2%; Romania produced 391,000 units and it had a total goods export ratio of 14%; Hungary produced 225,000 units and it had a total goods export ratio of 14%; Slovenia produced 198,000 units and it had a total goods export ratio of 15%; Sweden produced 154,000 units and it had a total goods export ratio of 3%; Portugal produced 118,000 units and it had a total goods export ratio of 13%. \nData from VDA, International Organization of Motor Vehicle Manufacturers (OICA), Coface, Observatory of Economic Complexity and national statistics offices. \nCommercial vehicle production was led by Spain at 504,000 units; 322,000 in France; 304,000 in Germany and 296,000 in Italy. \nVW purchased Skoda from the Czech government in 1991 when it had an output of 187,000. In 2014, 780,000 units were produced in the Czech Republic and 277,000 units in China. \n“It was VW or Renault, and even I, not an expert in cars, was thinking: I buy my cheese in France and my cars in Germany,” Vaclav Klaus, the Czech president, said at a 20th anniversary event according to the Financial Times. \nIn recent years Daimler chose Hungary for its first Mercedes factory in central Europe and Audi invested almost €1bn to expand its factory there in recent years. \nThe investments by the German manufacturers were important as Ireland discovered when Intel, the US chip giant, decided in 1989 to open a big facility in Ireland. \n“The automotive sector has been both a successful and visible example of the transition to market economies, and also of increased competition, of expansion of the private sector, of dissemination of quality standards, of skills, of regional development, and, of course, creation of jobs,” Alain Pilloux, managing director for industry, commerce and agribusiness at the European Bank for Reconstruction and Development told the FT in 2013. Auto production, he added, has a “snowball” effect, attracting other investments not just in components but in materials such as steel, glass and rubber. \nPilloux said CEE (Central European Economies) countries may have scope to expand manufacturing in some less developed sectors, such as chemicals, as well as in agribusiness, but agrees that nurturing innovation is the next step. But coming out of the crisis, he warns, countries across the region will have to compete hard for slices of a smaller investment pie. \n“It is not easy these days to present an investment to a board of directors in western Europe or the US,” he said. “Investments will go where the investment climate is the best.” \nCoface , a French company that was founded in 1946 to provide export credit insurance, says in a report published last week that the car industry provided over 850,000 workers in 2013 in the 6 CEE countries analysed. \n“The number of vehicles produced in the CEE region has more than doubled in the last ten years,\" commented Grzegorz Sielewicz, Coface economist for CEE . “Slovakia, the Czech Republic and Romania were the most successful, where car production tripled, or even quadrupled. However, it should also be noted that high growth dynamics cannot be endlessly continued, due to eventual saturation of the market.” \nThe collapse of the British car industry was once viewed as a national catastrophe but it has returned from a near-death experience: BMW now owns Rolls-Royce Motors and India's Tata owns Jaguar and Land Rover and it's expected the record peak output of 1.92 million cars in 1972 will be overtaken in 2017. \nAccording to Bernstein Research at BMW's plant in Oxford, England, each worker produced around 46 Minis on average in 2013 compared with roughly 23 vehicles per PSA Peugeot-Citroën (PSA) worker at the Sochaux plant in France. \nBernstein also claimed that productivity at PSA's plant in Slovakia is also much higher than the French plants . \nGermany has the highest manufacturing wages of the big manufacturing nations.", "external_links": [], "published": "2015-07-27T11:11:00.000+03:00", "crawled": "2015-07-27T12:56:22.894+03:00", "highlightTitle": ""}