{"organizations": [], "uuid": "9ea0687636e16bbf97c807ae9ff911d18830e646", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static5.businessinsider.com/image/559b42055afbd33b018b4567/china-stocks-tumble-again-despite-support-measures.jpg", "site_section": "http://feeds.feedburner.com/TheMoneyGame\r", "section_title": "Finance", "url": "http://www.businessinsider.com/r-china-stocks-tumble-again-despite-support-measures-2015-7", "country": "US", "title": "China stocks tumble again despite support measures", "performance_score": 0, "site": "businessinsider.com", "participants_count": 0, "title_full": "China stocks tumble again despite support measures", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T06:03:00.000+03:00", "replies_count": 0, "uuid": "9ea0687636e16bbf97c807ae9ff911d18830e646"}, "author": "", "url": "http://www.businessinsider.com/r-china-stocks-tumble-again-despite-support-measures-2015-7", "ord_in_thread": 0, "title": "China stocks tumble again despite support measures", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You have successfully emailed the post. China stocks tumble again despite support measures Jul. 6, 2015, 11:03 PM 0 \nThomson Reuters An investor makes a note on his hand at a stock exchange market in Kunming \nBy Samuel Shen and Pete Sweeney \nSHANGHAI (Reuters) - Chinese stocks opened down on Tuesday, taking no comfort from a slew of support measures unleashed by Beijing in recent days, and unnerved by Chinese Premier Li Keqiang's failure to mention the market chaos in a statement on the economy. \nBefore the market opened, Li said in comments on a government website that China had the confidence and ability to deal with challenges faced by its economy, but had nothing to say on the three-week plunge that has knocked around 30 percent off Chinese shares since mid-June. \nAfter a brief pause to the slide on Monday, the CSI300 index of the largest listed companies in Shanghai and Shenzhen fell 4.8 percent in early trading on Tuesday, while the Shanghai Composite Index shed 3.4 percent. [.SS] \nThe ChiNext growth board , home to some of China's giddiest small-cap valuations, fell 5.1 percent. \nIn an attempt to halt the slide, China has arranged a curb on new share issues and orchestrated brokerages and fund managers to buy massive amounts of stocks, helped by China's state-backed margin finance company, which in turn has a direct line of liquidity from the central bank. \nThe official Shanghai Securities News reported on Tuesday that China's major insurance firms plowed tens of billions of yuan into blue-chip exchange-traded funds (ETF) and large caps on Monday. \nChina Life Insurance Co Ltd bought a net 10 billion yuan ($1.6 billion) in index funds, while China Pacific Insurance Group and other insurers each invested more than 1 billion yuan, the newspaper said. \nThat helped the indexes rise just over 2 percent on Monday, but the relief was shortlived. \nLei Mao, assistant professor of finance at Warwick Business School, said government measures to support the market distorted the allocation of funds and trading behavior and could create the conditions for further sharp falls. \n\"Even an optimistic investor should not participate in the market for now,\" he said. \nTraders are increasingly unnerved by the unusually large number of Chinese companies asking for their shares to be suspended from trading, fearing that many of them are looking for excuses to sit out the market turmoil. \nAbout a quarter of the roughly 2,800 companies listed in Shanghai and Shenzhen had filed for a trading halt by the close on Monday, and on Tuesday the Securities Times said another 200 had announced a suspension. \nInvestors were also reacting to news of tightened restrictions on futures trading on a major small-cap index. \nOUT OF HAND \nThe rapid decline of China's previously booming stock market, which had more than doubled in the year to mid-June, had become a major headache for President Xi Jinping and China's top leaders, who are already struggling to avert a sharper economic slowdown. \nEven China's bullish securities regulators admitted that markets had become too frothy before they turned down, but the slide quickly showed signs of getting out of hand. \nA surprise interest-rate cut by the central bank at the end of June, relaxations in margin trading and other \"stability measures\" did little to calm investors, many of whom have borrowed heavily to play the stock market. \nIn a series of announcements on Saturday, China's top brokerages pledged to collectively buy at least 120 billion yuan of shares to help steady the market, and said they would not sell while the Shanghai Composite Index remained below 4,500, a level last seen on June 25. \nUnderlining scepticism beyond mainland China about the sustainability of the measures, Hong Kong listed shares of Chinese brokerages took a beating on Monday. \nIn addition, 28 companies that had been approved to launch IPOs announced they had suspended their plans. \n(Writing by Will Waterman; Editing by Alex Richardson) Read the original article on Reuters . Copyright 2015. Follow Reuters on Twitter . More from Reuters:", "external_links": [], "published": "2015-07-07T06:03:00.000+03:00", "crawled": "2015-07-07T06:45:18.000+03:00", "highlightTitle": ""}