{"organizations": [], "uuid": "840d486b39b066aa3bc609371ac71624a7d46ff3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/8/e/s/j/image.related.afrArticleLead.620x365.gicncw.png/1437146896122.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/national/thanks-goodness-rosie-batty-wont-be-silenced-20150717-gicncw", "country": "AU", "title": "Thanks goodness Rosie Batty won't be silenced", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Thanks goodness Rosie Batty won't be silenced | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T22:15:00.000+03:00", "replies_count": 0, "uuid": "840d486b39b066aa3bc609371ac71624a7d46ff3"}, "author": "Anna Bligh", "url": "http://www.afr.com/news/politics/national/thanks-goodness-rosie-batty-wont-be-silenced-20150717-gicncw", "ord_in_thread": 0, "title": "Thanks goodness Rosie Batty won't be silenced", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rosie Batty speaking at the Women's Parliamentary Conference. Daniel Munoz by Anna Bligh I invited Australian of the Year, Rosie Batty, to be guest speaker at a fundraising lunch for YWCA NSW. As Rosie held the room captivated, she had some strong messages to deliver. She spoke of how our legal system had failed her family, how she had taken out her first protection order against her son Luke's father and killer almost 10 years earlier but it did not protect her son, and of how Luke's killer was subject to four arrest warrants, that she was not informed of, on the day he killed Luke. [Luke Batty was killed by his father at a cricket ground in Victoria in February last year].\nShe urged the audience to learn more about the issue, to lobby for legislative changes, to support our work helping women escape domestic violence and to understand that violence in the home is more widespread than many of us think. We raised $30,000 that day and Rosie gave her time for free.\nI know she sometimes accepts fees from those who can pay, like corporate conferences and I, for one, am pleased to hear it. This courageous woman deserves to make a living and to be treated the same as any other speaker at these conferences.\nIn his recent AFR Weekend column, \" Private woe, public show \", Mark Latham launched an extraordinary personal attack on Rosie and her campaign against domestic violence. At the risk of feeding the author's appetite for controversy, there are a number of assertions in the attack that should not be left unanswered.\nFirstly, the repugnant suggestion that Rosie Batty is somehow misusing her position as Australian of the Year to \"cash out\" her personal tragedy by speaking about her experience. The nearer truth is that Rosie was selected as Australian of the Year precisely because she was prepared, in the face of an unspeakably violent tragedy, to speak out against violence against women and children, so often hidden from public view by the very silence that Latham urges on Rosie.\nHow odd to expect an Australian honoured for her passionate advocacy to fall silent when elevated to one of the most prominent platforms in the country. Just as Adam Goodes used his time as Australian of the Year to combat racism, Professor Patrick McGorry used his to fight for better mental health services, and Ita Buttrose used hers to promote a better understanding of Alzheimer's disease, Rosie is doing exactly as Australians would expect, using the opportunity she's been given to make Australia a fairer, and better informed, place.\nJust as curiously, Latham's column harks back to some golden age when good people kept their troubles to themselves, \"a time, in the dignity of working-class life, when grieving was conducted in private\". Of course, for most of us, grief and trauma are deeply private, personal experiences. But there have always been the courageous and exceptional, determined to speak out about their experience to spur much-needed change.\nAlmost 30 years ago, Ian Davies' life was changed forever when his daughter Shari was raped, stabbed a dozen times and had her throat cut in a brutal attack in a Brisbane car park. As Ian supported his daughter through the days and months of police and court processes he became increasingly angry about the way the criminal justice system treated victims. He went public with his grief and anger, called public meetings, spoke in any forum he could, formed the Victims of Crime Association and secured significant legal reforms to ease the burden on crime victims. Thank goodness Ian Davies refused to stay silent, as Rosie is being urged to do. The most pernicious aspect of Latham's column is his insistence that domestic violence is confined to \"Aboriginal and other underclass communities\" and that to suggest otherwise is the \"Big Lie of feminist propaganda\". I first worked with women and children escaping domestic violence in the early 1980s. Later, as a Queensland government minister, I worked with many government and community agencies providing crisis and ongoing support.\n As chief executive of YWCA NSW I am again working in an organisation that offers counselling, court assistance and temporary housing to those who have experienced domestic violence. In all that time, I have never encountered anyone who doesn't understand that poverty exacerbates domestic violence. Equally I know of no one working in this field who hasn't encountered violence in the lives of educated, wealthy and very advantaged women.\nData from the NSW Bureau of Crime Statistics on domestic assaults shows \"hotspot\" concentrations of domestic violence reports to police across Sydney. It indicates a lower incidence of reported assaults across most of the North Shore, but with hotspots in Manly and Mosman. It shows a higher prevalence in other wealthier demographics such as Surry Hills, Marrickville, Randwick and Five Dock, while a number of lower-income suburbs like Rouse Hill and Kellyville show a noticeably lower incidence.\nPolice reports often don't tell the full story as many women continue to find it extremely difficult to report or disclose their experience. In just the past month my domestic violence team at YWCA have assisted several teachers, a psychologist, a solicitor and several small business owners.\nIt is a myth that financial independence and economic security protect women from violence in their relationships. The fact that it happens more frequently in some places than others, that it is more prevalent in some very disadvantaged communities than others, does not negate this myth. With one woman murdered by her partner almost every week in Australia, one case, anywhere, is one too many.\nIt is precisely this dangerous myth that Rosie Batty seeks to dispel.\nHer central message is simple – if it can happen to her, an educated, financially independent woman with the protection of a court order, it can happen to anyone. Only when we understand that, can we begin to understand what needs to be done to eliminate violence from our homes.\nAssaults, bullying, control and abuse do not occur in relationships where partners respect each other as equals. Domestic violence is deeply rooted in gender inequality and I take my hat off to the many men and women working to protect women and their children, building a world where women and girls are equal, safe and valued in all their relationships. I take my hat off to Rosie Batty, who will not be silenced, and say thank goodness for that.\nAnna Bligh is the CEO of YWCA in NSW and a former Queensland premier.", "external_links": [], "published": "2015-07-17T22:15:00.000+03:00", "crawled": "2015-07-17T23:06:54.000+03:00", "highlightTitle": ""}