{"organizations": [], "uuid": "b510260a7978a2620deca20079eb75eab352ccf9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/forex-aussie-hits-6-low-075226273.html", "country": "GB", "title": "FOREX-Aussie hits 6-year low, German survey prods euro lower", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "FOREX-Aussie hits 6-year low, German survey prods euro lower", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T10:52:00.000+03:00", "replies_count": 0, "uuid": "b510260a7978a2620deca20079eb75eab352ccf9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/forex-aussie-hits-6-low-075226273.html", "ord_in_thread": 0, "title": "FOREX-Aussie hits 6-year low, German survey prods euro lower", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Aussie slumps after China PMI survey falls to 15-month low \n* Euro dips on poorer German survey \n* Questions over dollar rally continue to weigh on market (Updates after start of European trade, changes dateline from previous TOKYO) \nBy Patrick Graham \nLONDON, July 24 (Reuters) - The Australian dollar sank to a six-year low and other currencies closely related to global commodities prices were under pressure on Thursday after the worst reading on sentiment in Chinese manufacturing in more than a year. \nWith the euro, yen and dollar in tight ranges, eyes were also on the yuan, China's long closely controlled currency, which fell after Beijing said it would relax its trading bands against the dollar. \nThe Aussie, often used as a liquid proxy for China trades, fell to $0.7269 in early European deals, after the July survey of purchasing managers (PMI) deepened worries over the health of the world's second-largest economy. \nSlowing Chinese growth means less demand for commodities such as iron ore, one of Australia's chief exports. The recent decline in a wide range of commodities, including oil, has weighed on currencies like the Canadian and Australian dollars. \n\"It is the only story out there this morning,\" said Michael Sneyd, a strategist with BNP Paribas (Xetra: 887771 - news ) in London. \n\"The decline in commodities prices recently is still to be fully priced in to the Aussie and if it isn't then we think the Reserve Bank (of Australia) will deliver (interest rate) cuts, something which isn't priced in to the market.\" \nSneyd said money market pricing showed only a 50 percent chance of a quarter point cut in Aussie interest rates over the coming months, at a time when policymakers in New Zealand cut this week and signalled more was likely. \nHe forecast the Aussie to fall to $0.70 by the end of the year and by another 5 percent against the kiwi. \nA slightly weaker PMI survey in Germany prodded the euro 0.3 percent lower against the dollar after breaching $1.10 for the first time in more than a week on Thursday. \nAsian analysts said there was also some relief from Greece taking another step towards a bailout but the main trend of this week has been the halting of improvement for the dollar, again casting doubt on how fast the U.S. currency can rally further. \nOn the one hand, U.S. data has been fairly solid and the mood music from the Federal Reserve supportive of a rise in interest rates. But if China continues to struggle, doubts about global growth will grow. \n\"If you believe U.S. rates will go up, the dollar is the choice. But if you do not have confidence in the global economy, the yen will be your destination,\" said Koji Fukaya, president of FPG Securities in Tokyo. \nThe euro dipped to $1.0952 after the German numbers at 0730 GMT, still well above last week's 3-month low of $1.0808. \nThe dollar trod water at 123.92 yen but was 0.3 percent higher against a basket of currencies on the back of the euro move. \n\"News from Greece helped, but fundamentally speaking, euro/dollar remains on a downtrend in the long run. European economic indicators and inflation data are not as strong as they were at the start of the year, and of course the U.S. is steadily preparing to hike rates,\" said Shinichiro Kadota, chief Japan FX strategist at Barclays (LSE: BARC.L - news ) in Tokyo. (Additional reporting by Shinichi Saoshiro in TOKYO; Editing by Toby Chopra)", "external_links": [], "published": "2015-07-24T10:52:00.000+03:00", "crawled": "2015-07-24T11:06:52.498+03:00", "highlightTitle": ""}