{"organizations": [], "uuid": "d68fbb829949b534cc5ce736945d69168159a131", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=FOXA", "section_title": "Yahoo! Finance: FOXA News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125qep90b/*http://www.noodls.com/view/10C1D32BA10C5111C2A59896B58AD5781A926EAB", "country": "US", "title": "21st CENTURY FOX ELEVATES JARED SHER TO SENIOR VICE PRESIDENT AND ASSOCIATE GENERAL COUNSEL", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "21st CENTURY FOX ELEVATES JARED SHER TO SENIOR VICE PRESIDENT AND ASSOCIATE GENERAL COUNSEL", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T19:20:00.000+03:00", "replies_count": 0, "uuid": "d68fbb829949b534cc5ce736945d69168159a131"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125qep90b/*http://www.noodls.com/view/10C1D32BA10C5111C2A59896B58AD5781A926EAB", "ord_in_thread": 0, "title": "21st CENTURY FOX ELEVATES JARED SHER TO SENIOR VICE PRESIDENT AND ASSOCIATE GENERAL COUNSEL", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JARED SHER"], "text": "Close \nNew York, NY - July 20, 2015 - \n21st Century Fox (NASDAQ: FOXA, FOX) today announced that Jared Sher has been promoted to Senior Vice President and Associate General Counsel. \nMr. Sher continues to have primary responsibility for advising 21st Century Fox on domestic media regulatory issues and representing its portfolio companies before the FCC. He is based at the Company's Washington, DC, office and reports to Ellen Agress, its Senior Vice President and Deputy General Counsel. \n\"Jared has distinguished himself with the outstanding policy counsel he provides for our domestic broadcast and cable business and we are pleased to recognize his many valuable contributions to our organization,\" said Ms. Agress. \nMr. Sher served as 21st Century Fox's Vice President and Associate General Counsel for the last three-plus years, having previously advised the Company as Counsel at Skadden, Arps, Slate, Meagher & Flom LLP & Affiliates from 1999 to 2012. He holds a J.D. from the George Washington University Law School and a B.A. from George Washington University. \nAbout 21st Century Fox \n21st Century Fox is the world's premier portfolio of cable, broadcast, film, pay TV and satellite assets spanning six continents across the globe. Reaching more than 1.8 billion subscribers in approximately 50 local languages every day, 21st Century Fox is home to a global portfolio of cable and broadcasting networks and properties, including FOX, FX, FXX, FXM, FS1, Fox News Channel, Fox Business Network, FOX Sports, Fox Sports Network, National Geographic Channels, STAR India, 28 local television stations in the U.S. and more than 300 channels that comprise Fox International Channels; film studio Twentieth Century Fox Film; and television production studios Twentieth Century Fox Television and a 50% ownership interest in Endemol Shine Group. The Company also holds a 39.1% ownership interest in Sky, Europe's leading entertainment company, which serves 21 million customers across five countries. For more information about 21st Century Fox, please visit www.21CF.com . \nC ontact: N athaniel Brown n brown@21cf.com", "external_links": [], "published": "2015-07-20T19:20:00.000+03:00", "crawled": "2015-07-20T20:38:58.749+03:00", "highlightTitle": ""}