{"organizations": [], "uuid": "f554e2a4d1594f227555f5409d0205d04e8e82b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-02/china-s-fix-for-a-margin-debt-boom-roiling-stocks-more-leverage", "country": "US", "title": "China’s Fix for a Margin-Debt Boom Roiling Stocks? More Leverage", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "China’s Fix for a Margin-Debt Boom Roiling Stocks? More Leverage - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T11:06:00.000+03:00", "replies_count": 0, "uuid": "f554e2a4d1594f227555f5409d0205d04e8e82b2"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-07-02/china-s-fix-for-a-margin-debt-boom-roiling-stocks-more-leverage", "ord_in_thread": 0, "title": "China’s Fix for a Margin-Debt Boom Roiling Stocks? More Leverage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As China’s stock-market slump spurs margin traders to unwind record bullish bets, authorities have responded with a policy that analysts say could exacerbate the problem: make it easier to take on even more leverage.\nHours after a one-day tumble of 5.2 percent in the Shanghai Composite Index, China’s securities regulator eased collateral requirements for leveraged investors and allowed brokerages to securitize margin loans -- a move that frees up room to extend credit after a nine-fold surge in outstanding margin debt in two years. Brokerages have leeway to boost lending by about $300 billion, based on regulatory caps announced Wednesday.\nWhile a surge in leverage helped fuel the longest-ever bull market in Chinese stocks, traders have been closing out those positions for a record eight straight days as the Shanghai Composite tumbled more than 20 percent from this year’s high. Even if relaxed rules help prevent a free-fall in share prices, the risk is that more leverage will expose amateur investors to even greater losses later and spur bigger price swings in the world’s most-volatile market.\n“Beyond the short term, risk taking with leverage underwritten by the state plants seeds for even greater market peril in the future,” Hao Hong, a China strategist at Bocom International Holdings Co. in Hong Kong, wrote in an e-mailed note.\nPolitical Decision The China Securities Regulatory Commission will allow brokerages to accept new forms of collateral, including real estate, from clients with insufficient value in their stock accounts.\nThe regulator, which cut short a public consultation on the rules due to “market conditions,” said investors no longer need to supply extra collateral within two days when it falls below 1.3 times the amount of borrowed money. The new guidelines let brokerages give six-month extensions to clients’ margin trading and short selling contracts, instead of liquidating the positions.\nChinese authorities are becoming more sensitive to swings in stocks after individual investors piled in at a record pace this year. The nation’s $7.7 trillion equity market now has more than 90 million individual investors. That compares with 87.8 million Communist Party members at the end of last year, according to a June 29 report from the state-run Xinhua News Agency.\nFee Cut “It’s a temporary and political decision, the purpose is to stop the market from becoming more panicked,” said Zheng Chunming, a Shanghai-based securities analyst at Capital Securities Corp. “The regulator was rushing out several measures in just one night because it wants to prevent the market from losing confidence. It wants to keep the bull market sentiment.”\nWith net capital at brokerages of about 970 billion yuan at the end of May, a margin financing ceiling of four times net capital leaves room for funding to nearly double. The CSRC didn’t immediately respond to a faxed request for comment.\nChina’s two bourses will cut equity-trading fees by 30 percent starting Aug. 1, the Shanghai Stock Exchange said after the market close on Wednesday. Authorities are considering suspending IPOs to prevent a diversion of funds from weighing on the market, people familiar with the matter said on June 29.\nThe Shanghai Composite dropped 1.1 percent at 10:14 a.m. local time. Citic Securities Co., the nation’s largest brokerage, gained 2.4 percent while Guotai Junan Securities Co., the second biggest, dropped 2.6 percent.\nThe announcements won’t stabilize the market, although “anything that improves sentiment will be a short-term positive,” Simon Male, head of Asian equities sales at Auerbach Grayson & Co. in New York, said by e-mail. “Making it easier to obtain margin financing is only exacerbating the problem. Without fundamental support, the market will remain extremely volatile.”", "external_links": [], "published": "2015-07-02T11:06:00.000+03:00", "crawled": "2015-07-02T07:13:49.000+03:00", "highlightTitle": ""}