{"organizations": [], "uuid": "a0415232ac13ec9e284d0a869d5a94c28eb43eaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15516_5958.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/pcaob-requests-supplemental-comment-on-70405/", "country": "US", "title": "PCAOB Requests Supplemental Comment on Rules to Require Disclosure of Engagement Partners and Audit Participants", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "PCAOB Requests Supplemental Comment on Rules to Require Disclosure of Engagement Partners and Audit Participants", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T22:30:00.000+03:00", "replies_count": 0, "uuid": "a0415232ac13ec9e284d0a869d5a94c28eb43eaf"}, "author": "WilmerHale", "url": "http://www.jdsupra.com/legalnews/pcaob-requests-supplemental-comment-on-70405/", "ord_in_thread": 0, "title": "PCAOB Requests Supplemental Comment on Rules to Require Disclosure of Engagement Partners and Audit Participants", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PCAOB Requests Supplemental Comment on Rules to Require Disclosure of Engagement Partners and Audit Participants more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=f00e9151-76a4-432a-b754-eb2d2d7fed8d\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nAt an open meeting on June 30, 2015, the Public Company Accounting Oversight Board unanimously voted to publish a supplemental request for comment on potential rules to require the disclosure of certain audit participants on a new PCAOB Form AP. \nThe supplemental request for comment seeks input on a new approach to the PCAOB's ongoing proposal to require identification of the lead engagement partner on an audit, as well as other accounting firms and entities that also provided services in connection with the audit. This is the latest development in a process that dates back to 2005 and includes a 2009 concept release, a prior rule proposal in 2011, and a re-proposal in 2013. \nThe 2013 re-proposal (see this previous post ) would have required disclosure in the auditor's report of: the name of the engagement partner the names, locations, and extent of participation of other independent public accounting firms that took part in the audit the locations and extent of participation, on an aggregate basis by country, of certain non-accounting firm participants \nThe Board's latest proposal responds to concerns that disclosure of the lead engagement partner in the auditor's report would subject audit partners to increased litigation and liability risk under federal securities laws. Unlike the 2013 re-proposal, the current proposal would not require placement of the disclosure in the auditor's report. Instead, a new PCAOB Form AP would be created, on which audit firms would disclose the name of the lead engagement partner and the name of other accounting firms participating in the audit. The latest proposal also eliminates the requirement to disclose non-accounting firm participants. As an alternative to filing on Form AP, auditors would have the option to include the required disclosure in the body of the auditor's report. \nAudit firms would be required to file Form AP via the PCAOB's existing web-based Registration, Annual and Special Reporting System within 30 days following the date of the auditor's report to which it relates. Data from Form AP would be aggregated in a searchable database on the PCAOB website that will enable users of the financial statements to search by auditor or company. \nComments on the Board's latest proposal are due by August 31, 2015, and the Release contemplates an effective date beginning with auditors' reports issued or reissued on or after June 30, 2016.", "external_links": [], "published": "2015-07-16T22:30:00.000+03:00", "crawled": "2015-07-16T22:35:02.000+03:00", "highlightTitle": ""}