{"organizations": [], "uuid": "644dc3ff034ea6300e1875371d399169ef6bfe95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/download/pic/main/main/csiid/00301173:af3daa0c15ff8d3539a8f9a1dab151e7:arc614x376:w1200.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507161770.html", "country": "US", "title": "Ethiopia: Remittance Plays Positive Role in Dev't, Household Food Security", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Ethiopia: Remittance Plays Positive Role in Dev't, Household Food Security", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T21:24:00.000+03:00", "replies_count": 0, "uuid": "644dc3ff034ea6300e1875371d399169ef6bfe95"}, "author": "", "url": "http://allafrica.com/stories/201507161770.html", "ord_in_thread": 0, "title": "Ethiopia: Remittance Plays Positive Role in Dev't, Household Food Security", "locations": ["Ethiopia", "China", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: China Gives Mnangagwa Reality Check During Visit \nOn the sideline of the Third International Conference on Financing for Development held yesterday at Radisson Blu Hotel with the theme: 'Remittances as a tool for financing for development and meeting food security,' the IGAD Special Representative on Remittances Hussein Halane said: \"Remittances represent annually 400 billion USD income globally, but Africa receives only 40 billion USD a year.\" \nAccording to him, the IGAD region receives the biggest share of Africa's remittances -- in 2014 Somalia received 1.3-1.5 billion USD, Kenya around 1.4 billion USD and Ethiopia 9.8 billion USD. \nHussein also said that one of the most visible gains of international migration is remittance - transfer of the much-needed hard currency into local and national economies, thus, making significant contribution to the development. \nDahabshiil Group CEO Abdirashid Duale said that the conference aims to highlight how communities play a role in the region's investment, humanitarian, food security and to work together with the international partners and governments to deliver remittances in secure, safe and transparent system. Dahabshiil works with Ethiopian banks to deliver remittances to the Ethiopian people from one corner to another, he added. \nAbdirashid also said that as a community Dahabshiil provides remittance service with a competitive and best price that is available to access international banking system for the IGAD region. He adding said, currently, the international migrants can develop their countries of origin through investing more in financial markets. \nThe conference also highlighted that remittances played as a significant tool for financing for development in the Monterrey Consensus. While remittances is used to pay school fees and also function as an informal and community-based health insurance, it has helped reduce poverty by increasing household income. Due to the cost of migration, remittances do not reach the poorest of the poor, but rather the middle classes and they can even increase inequality. \nIt is often discussed how the potential of remittances for financing for development could be further strengthened through channeling of remittances into investment schemes and encouraging more savings. \nAll IGAD Member States are called to coordinate and support the prevention of illegal money flows, ensure transparency throughout the remittance system in compliance with international regulation and use of technology. More on This", "external_links": [], "published": "2015-07-16T21:24:00.000+03:00", "crawled": "2015-07-17T17:55:12.000+03:00", "highlightTitle": ""}