{"organizations": [], "uuid": "fdfcd68ebfdb48d34c028f0209d04ffd33fa7d1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business_Finance", "url": "http://www.menafn.com/1094294629/Qatar-GCC-issues-USD4813bn-sukuks-bonds&src=RSS", "country": "US", "title": "Qatar- GCC issues $48.13bn sukuks, bonds", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Qatar- GCC issues $48.13bn sukuks, bonds | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "fdfcd68ebfdb48d34c028f0209d04ffd33fa7d1b"}, "author": "The Peninsula", "url": "http://www.menafn.com/1094294629/Qatar-GCC-issues-USD4813bn-sukuks-bonds&src=RSS", "ord_in_thread": 0, "title": "Qatar- GCC issues $48.13bn sukuks, bonds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - The Peninsula) The aggregate primary issuance of bonds and sukuk by GCC entities, including cCentral Banks, totalled 48.13bn in the first half of 2015 (H1, 2015), a 15.19 percent decrease from the total amount raised in the first half of 2014.\n\nDuring H1, 2015, a total of 28.29bn was raised by the GCC central banks of Kuwait, Bahrain, Qatar, and Oman. The Central Bank of Kuwait raised the highest amount of 12.85bn, representing 48.8 percent of the total amount raised by Central Bank Local Issuances (CBLIs) through 36 issuances, followed by the Central Bank of Bahrain, which raised a total of 6.69bn, 47.13 percent higher from 4.55bn raised in the first half of 2014, Kuwait Financial Centre (Markaz) noted in its latest GCC Bonds & Sukuk Market Survey.\n\nThe GCC bonds and Sukuk market is composed of bonds and sukuk issued by GCC Sovereign and Corporate entities for financing purposes and denominated in local and foreign currencies. \n\nA total of 19.83bn was raised in the GCC bonds market in H1, 2015, a decline of 19.29 percent from 24.57bn raised in H1 2014. On the geographical allocation, the Markaz report noted the issuances by UAE entities raised the largest amount in GCC Bonds & Sukuk market in the first half of the year, representing 75.6 percent of the total amount, or 14.99bn, and were the most active in terms of issuance frequency with 99 issuances.\n\nSaudi Arabian issuers raised 1.57bn through three issues. Omani corporates raised 1.38bn, while Bahraini issuers raised 800mn. Qatari entities raised 380m by 10 issuances. There was a single Kuwaiti corporate issue, a tier 1 perpetual 700m bond by National Bank of Kuwait bearing an initial coupon of 5.75 percent.\n\nDuring H1, 2015, corporate issuances dominated the majority of the amount raised in the GCC bonds market, with 18.83bn, or 95 percent of the total amount raised. The sole sovereign issue was a 10 year 1bn bond issued by the emirate of Ras al Khaimah bearing a coupon of 3.094 percent.\n\nConventional issuances raised 15.01bn, or 75.71 percent of the total amount raised in GCC bonds and sukuk market during H1 2015. This was a decline of 16.69 percent as compared to H1, 2014. Sukuk issuances shrunk by 26.45 percent from 6.55bn raised in H1, 2014 to 4.82bn raised in H1 2015.\n\nThe Financial Services issuers accounted for the largest amount raised during H1, 2015, with 16.82bn representing 84.8 percent of the total amount raised, through 113 issuances. The other sectors - Communications, Government, Industrial Utilities and Transport - were represented by a single issue each. GCC bonds and sukuk issuances during H1, 2015 had issue sizes ranging from 5m to 1.12bn. \n\nIssuances with principle amounts greater than or equal to 500m but less than 1bn raised the largest amount of 7.07bn, representing 35.63 percent of the total value. \n\nThe two largest issues were the Euro-denominated bonds by Aabar Investments each raising ‚1bn and having tenures of 5 and 7 years. During H1, 2015, 52 bonds and sukuk, representing total of 15.56bn, were listed on exchanges. The number of regional bonds and sukuk listed on international exchanges were 47 issues with a value of 13bn.\n\nAs of June 30, 2015, the total amount outstanding of corporate and sovereign bonds issued by GCC entities was 242.04bn. Corporate issuances constituted the majority of total amount outstanding with 205.41bn, or 84.87 percent of the total. Sukuk issuances represented 34.33 percent of the total amount.\n\nOf the amount outstanding as of June 30, 2015, 115.85bn, or 47.87 percent were issued by UAE entities. Bonds and Sukuks by Kuwaiti entities represented 6.10bn, or 2.52 percent of the total amount outstanding. \n\nUS dollar denominated issuances dominated the GCC bonds and Sukuk market in H1, 2015, raising a total of 13.13bn, thereby representing 66.2 percent of the total amount. \n\nEuro-denominated issuances raised 3.23bn 3.23bn, followed by SAR denominated issues which raised 1.57bn. GCC currencies were used to raise a total of 1.66bn, 8.37 percent of the total amount, in H1 2015.\n\nDuring H1, 2015, a total of 44 issuances, representing 37.3 percent of the total number of Sovereign and Corporate issuances, were rated by either one or more rating agencies.", "external_links": [], "published": "2015-07-29T03:00:00.000+03:00", "crawled": "2015-07-29T16:40:28.677+03:00", "highlightTitle": ""}