{"organizations": [], "uuid": "6eac040b35672f022a5e3a1ea92f581e02b0f23f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/e38lcp4bbv_cassavafarmersassociation.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/632459/1/cassave-farmers-advocate-for-representative.html", "country": "US", "title": "Cassave farmers advocate for representative", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Cassave farmers advocate for representative", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T01:00:00.000+03:00", "replies_count": 0, "uuid": "6eac040b35672f022a5e3a1ea92f581e02b0f23f"}, "author": "", "url": "http://www.modernghana.com/news/632459/1/cassave-farmers-advocate-for-representative.html", "ord_in_thread": 0, "title": "Cassave farmers advocate for representative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  23:00 CET Cassave farmers advocate for representative By GNA \nAwutu Bawjiase (C/R) July 27, GNA - Members of the Ayensu Cassava Farmers Association (ACFA), have advocated for the re-instatement of their representation on the board of directors of the company, which has been the status-quo. \nThis was contained in a press statement signed by Mr. Samuel Dodd, Chairman of the Association after a press conference at Awutu Bawjiase. \nThey said they were most grateful to the government for acknowledging them as share holders of the Company as originally planned. \nThis advocacy marks the concluding stages which have seen them through training, research, sensitization among others with support from BUSAC Fund and with contributions by DANIDA, USAID and the European UNION, they said. \nAccording to them, they have entered their final stages of an advocacy action to lobby the Government to allot to the group a definite guaranteed share of ASCO 30 percent share remaining, after the divestiture of the company, following the offer of government to release its share of 70 percent to a strategic investor. \nThey stated that they were not against the sale of government share to a strategic investor, which they hoped would benefit the Association, but were however, suggesting that the shareholding structure needed to be clearly spelt out. \nFor example, the number of shares belonging to each stakeholder so that the Association would be aware of its position. \nAccording to them their main focus of the advocacy was to lobby government to increase their shareholding and to involve them in any divestiture process. \n'We the farmers deem it right to be allotted definite share out of the 30 percent, it is our aim to finally engage the relevant Government Officials to accede to the allotment of definite negotiated percentage share of the 30 percent to them through further media, stakeholder workshop and dialogue activities as done with the earlier action resulting in government releasing its 70 percent share to public participation.' \nThey expected that after the action, there would be definitive share allotment to members of the Association, to encourage them to increase production outputs to feed the Ayensu Cassava Factory Company (ASCO) plant. GNA", "external_links": [], "published": "2015-07-28T01:00:00.000+03:00", "crawled": "2015-07-28T00:24:36.992+03:00", "highlightTitle": ""}