{"organizations": [], "uuid": "4be32ba4f7692ca68e68a2f92fe138645efd449b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static4.businessinsider.com/image/559f7fc1dd0895e45a8b4616/greeks-have-very-legitimate-reasons-for-panic-queuing-at-atms.jpg", "site_section": "http://feeds.feedburner.com/TheMoneyGame", "section_title": "Finance", "url": "http://www.businessinsider.com/greece-atm-and-capital-controls-update-reasons-behind-queue-2015-7", "country": "US", "title": "Greeks have very legitimate reasons for panic queuing at ATMs", "performance_score": 0, "site": "businessinsider.com", "participants_count": 1, "title_full": "Greeks have very legitimate reasons for panic queuing at ATMs", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T11:17:00.000+03:00", "replies_count": 0, "uuid": "4be32ba4f7692ca68e68a2f92fe138645efd449b"}, "author": "Lianna Brinded", "url": "http://www.businessinsider.com/greece-atm-and-capital-controls-update-reasons-behind-queue-2015-7", "ord_in_thread": 0, "title": "Greeks have very legitimate reasons for panic queuing at ATMs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "print \nReuters A bank manager points as pensioners wait in front of a National Bank branch to receive part of their pensions at an Athens neighborhood, in Greece July 9, 2015. \nGreece's banks only have enough money to keep the country going until Monday and subsequently extended its capital controls, which includes shutting its banks and restricting personal cash withdrawals to €60 (£43.24, $66.62) until then. \nBanks are being flooded by Greeks, mainly pensioners, but you can't really blame them — Greeks remember all too well the massive fallout from the 1999 Athens Stock Market, where people lost a substantial amounts of their savings, just before Greece joined the Euro. \nWhile it's looking more and more likely that Greece will actually strike a deal with its creditors, after Greece submitted its latest bailout proposal to its European creditors ahead of a midnight deadline on Thursday, people are still panic-queuing at their banks' ATMS across the country. \nA report a week ago suggested that the country's banks had just €500 million (£361 million, $556 million in physical cash left , so people are likely to worry that there is simply not enough cash in the bank to cover all their savings and other deposits. \nAs my colleague Mike Bird pointed out during his time in Athens last week, the stock of deposits is now less than half of what it was at the peak in 2009 , at the end of Greece's post-euro-entrance boom. \"A lot of the money that left the banks in 2010-2012 went out the country,\" said Syriza activist Mihalis Panayiotakis, a member of the governing party's digital-policy committee, to Mike Bird last week. \"Also, companies relocated. That money never came back.\" \nHere's a chart showing the slump in deposits but physical cash in circulation: \nBarclays \nBut that doesn't mean that the more vulnerable people in Greek society, namely the financially poor and pensioners, are worried that the little cash they do have left will disappear. After all, it happened in Cyprus in 2012 and 2013 when the government imposed a one-time tax on remaining bank deposits on all uninsured deposits . \nOn top of that, Greece may look likely that it is nearing a deal with its creditors, but this is not certain — just take a look at what happened with the call for the bailout referendum, even though that turned out to be completely pointless in the end . \nMany investment banks are now looking at a Grexit — Greece leaving the euro — as its base case scenario. This is a huge deal because it could really hit every day Greeks and the little money they have left. That's not to mention the banks' meagre amount of bank deposits. \nThen on Wednesday (July 8), the bank stepped up its warning and said it is afraid the Greek government is on the verge of collapse . \nBarclays reckons that it is now more likely that there will a Grexit than not. However, it pretty much predicts financial and economic chaos over the next month: 1) banks run out of euro cash within days (five days, according to development minister George Stathakis); 2) default on the ECB holdings of SMP bonds appears inevitable 3) banks turn insolvent as the ECB shuts down ELA, no later than 20 July – at this point, Greek banks need both a liquidity and capital injection 4) issuance of IOUs to pay public wages and pensions could happen as early as this month. \nEven the man who coined the term \"Grexit,\" Citi chief economist Willem Buiter, now thinks a Greece exit from the eurozone is the most likely outcome, or Citi's base case, just three months after the bank said an exit was \"unlikely.\" \nSo that means, Greeks are increasingly facing the prospect of not only losing their deposits but also not being given their salaries. On top of that, switching to the drachma will create total and utter chaos. \nMy colleague Mike Bird outlined the financial turmoil that would ensue if Greece falls (or is pushed) out of the euro. From money running out, to the development of black markets — it's worth a read to see the potential chaos . \nWhile it may look like Greeks are panicking for no reason at the ATMs, they all have a very legitimate fear right now. And over the next two weeks, when Greece's July 20 payment is up, they find themselves without any cash to withdraw.", "external_links": [], "published": "2015-07-10T11:17:00.000+03:00", "crawled": "2015-07-10T11:44:23.000+03:00", "highlightTitle": ""}