{"organizations": [], "uuid": "d08d4dd16e5c15c1f328f54302f3251a70f07e02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/3/o/4/z/y/image.related.afrArticleLead.620x365.gini5r.png/1438289716448.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/energy/oil/royal-dutch-shell-signals-browse-flng-goahead-far-from-certain-for-2016-20150730-gini5r", "country": "AU", "title": "Royal Dutch Shell signals Browse FLNG go-ahead far from certain for 2016", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Royal Dutch Shell signals Browse FLNG go-ahead far from certain for 2016 | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T19:57:00.000+03:00", "replies_count": 0, "uuid": "d08d4dd16e5c15c1f328f54302f3251a70f07e02"}, "author": "Angela Macdonald-Smith", "url": "http://www.afr.com/business/energy/oil/royal-dutch-shell-signals-browse-flng-goahead-far-from-certain-for-2016-20150730-gini5r", "ord_in_thread": 0, "title": "Royal Dutch Shell signals Browse FLNG go-ahead far from certain for 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shell wants to transfer learnings from Prelude FLNG to the Browse project. Share on twitter by Angela Macdonald-Smith Royal Dutch Shell has signalled that a final go-ahead next year for the Browse floating liquefied natural gas project in Western Australia is far from a certainty given the cost challenges of the venture in the depressed oil price environment .\nChief financial officer Simon Henry listed Browse among several large international projects that would be subject to \"the dynamic nature of decision making as we take both the oil price environment but also the supply chain and the cost level into account.\"\n\"There are some quite large investment decisions in the next 18 months that are on the table but only if we get the right returns and cost levels,\" Mr Henry told journalists on a teleconference on Shell's second quarter results.\nShell announced on Thursday it would slash capital investment by $US7 billion this year from 2014 and cut 6500 jobs as it buckles down for a drawn-out weakness in oil prices. The cutbacks are heightening concerns about the prospects for its Australian gas investments particularly after its proposed $US70 billion takeover of BG Group.\nChief executive Ben van Beurden also advised of a reduced investment budget expected next year after the takeover completes, with the capex figure for the combined company put at about $US35 billion for 2016, down from an estimate of $US40 billion flagged earlier this year.\nAssets sales from the combined group would span both upstream and downstream businesses, he said, pointing to a likely $US30 billion of divestments between 2016 and 2018.\n​\"We have to be resilient in a world where oil prices remain low for some time, whilst keeping an eye on recovery,\" Mr van Beurden said in a statement announcing a 37 per cent drop in second quarter profit excluding one-time items to $US3.8 billion.\nHe said Shell was making \"good progress\" with the proposed takeover of BG , which should lift free cash flow and \"be a springboard to change Shell into a simpler and more profitable company\".\n The merger with BG, which has yet to secure Australian regulatory approval, could see an amalgamation of Shell's Arrow gas interests in Queensland with BG's Queensland Curtis LNG project after the deal completes in early 2016. Some analysts have questioned whether the high-grading of the investment portfolio of the combined group could push the cost-challenged Browse floating LNG project down the list of Shell's project priorities.\nMr van Beurden said Shell would \"re-shape\" the company once the deal was complete, including reducing spending on exploration and taking \"a fresh look\" at the allocation of capital to longer-term projects. The divestments would \"concentrate our portfolio into fewer, higher value positions,\" he said.\nSpeaking to reporters he said that Browse still \"has the potential to be a very attractive project,\" noting that the venture partners only recently committed to carrying out preliminary engineering work. The venture was now working through technical and commercial details, he said.\nShell is developing its first floating LNG project, the Prelude venture, in WA, with a start-up of production targeted for 2017.\nMr van Beurden said Shell would take as much advantage as possible of learnings and \"replication benefits\" between Prelude and Browse.\n\"The amount of replication that we can do between Prelude and Browse is very, very significant and there are replication benefits within the Browse project itself because it comprises of three floaters,\" he said. \"There is tremendous learning that we can capitalise on.\"\nCrude oil prices have halved in the past 12 months, and Shell said the downturn could last \"for several years\".\n\"The company has to be resilient in today's oil price environment, even though we see the potential for a return to a $US70-$US90 oil price band in the medium term,\" Shell said.\nCapital investment for 2015 has been pared back another $US3 billion since Shell's update in April, and is now put at about $US30 billion, down $US7 billion from last year. The oil giant said the lower figure reflected cost reductions, project cancellations and \"re-phasing\" of growth options.\nWoodside Petroleum, operator of the Browse project, is aiming for a final investment decision on the venture in the second half of 2016. Woodside chief executive Peter Coleman said in April he now expected returns from Browse to be at the lower end of the company's 12-15 per cent target range for new projects.\nShell said the growth in free cash flow expected from BG's Australian business, which comprises the Queensland Curtis LNG project, was a \"natural fit\" with Shell's potential to grow free cash flow after 2017.\nShell said its sell-down of its stake in Woodside last year and an unplanned shutdown of the North West Shelf venture in Australia had dragged down its sales of LNG in the second quarter by 9 per cent from a year earlier to 5.46 million tonnes. Woodside still owns about 13 per cent of Woodside.", "external_links": ["http://www.smh.com.au/business/mining-and-resources/royal-dutch-shell-to-take-over-bg-group-in-megadeal-20150408-1mglkh.html", "https://twitter.com/angelamacd"], "published": "2015-07-30T19:57:00.000+03:00", "crawled": "2015-07-31T00:10:26.330+03:00", "highlightTitle": ""}