{"organizations": [], "uuid": "84b7cec65158a198e6b039df353d07a2c83bc356", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iKHBGVodPIGg/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-20/greece-said-to-order-creditor-payments-as-banks-reopen", "country": "US", "title": "Greece Said to Order Creditor Payments as Banks Reopen", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "Greece Said to Order Creditor Payments as Banks Reopen - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T16:37:00.000+03:00", "replies_count": 0, "uuid": "84b7cec65158a198e6b039df353d07a2c83bc356"}, "author": "Eleni Chrepa", "url": "http://www.bloomberg.com/news/articles/2015-07-20/greece-said-to-order-creditor-payments-as-banks-reopen", "ord_in_thread": 0, "title": "Greece Said to Order Creditor Payments as Banks Reopen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greece gave the order to repay 6.8 billion euros ($7.4 billion) to creditors after last week’s tentative bailout deal, the Finance Ministry said, as Greek banks reopened three weeks after closing to prevent economic collapse.\nThe payments ordered Monday by the Greek government include money owed to the European Central Bank, the International Monetary Fund and Greece’s central bank, said a Finance Ministry official who asked not to be identified in line with government policy. Greek financial markets remain closed, the country’s market regulator said in an e-mailed statement.\nAs withdrawal limits and restrictions on transfers remain in place, people in Athens lined up at banks for basic services such as payment orders and check deposits. While Greeks are seeing the first signs of stabilization, talks on the aid program lie ahead and German Chancellor Angela Merkel said any debt relief has to wait until Greece meets the terms of the first round of the new bailout.\n“When the first successful assessment of the program being negotiated now is completed, exactly this question will be discussed,” Merkel said Sunday in an interview on German television. “Not now, but then.”\nWhile the bailout agreed upon last weekend has split the government of Prime Minister Alexis Tsipras, it also cleared the ECB to inject more funds into Greece’s financial system. Banks can now replace the daily cash withdrawal limit of 60 euros with a weekly limit of 420 euros, though transfers abroad from Greek accounts remain banned.\nGreece’s financial strain eased after the ECB approved emergency financing and the European Union completed plans for a bridge loan. The stopgap funding will shore up the Greek economy during talks on a full three-year rescue program worth as much as 86 billion euros.\nMerkel said bailout talks need to move swiftly. She pledged to do “everything” to reach an agreement, though her government would act “firmly” to ensure Greece carries out reforms.\nRead this next: \\r Greek Banks to Open Monday as Next Parliamentary Vote Looms \\r Greece’s Real Crisis Deadline Arrives With ECB Debt to Pay \\r France’s Hollande Proposes Creation of Euro-Zone Government \\r Merkel Holds Out Prospect of Limited Greek Debt Relief \\r", "external_links": [], "published": "2015-07-20T16:37:00.000+03:00", "crawled": "2015-07-20T12:17:21.007+03:00", "highlightTitle": ""}