{"organizations": [], "uuid": "1b839d8ff9b80576bb402ed2800845939a4e3803", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.france24.com", "main_image": "http://scd.france24.com/en/files/imagecache/france24_ct_api_bigger_169/article/image/151727-china-stock-mkt.jpg", "site_section": "http://www.france24.com/en/business-tech/", "section_title": "Business news, technology, media and finance reports - France 24", "url": "http://www.france24.com/en/20150727-wall-street-usa-down-chinese-shares-post-biggest-drop-eight-years-markets", "country": "", "title": "Business - China shares post biggest drop in eight years", "performance_score": 0, "site": "france24.com", "participants_count": 1, "title_full": "Business - China shares post biggest drop in eight years - France 24", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "1b839d8ff9b80576bb402ed2800845939a4e3803"}, "author": "Text by NEWS WIRES", "url": "http://www.france24.com/en/20150727-wall-street-usa-down-chinese-shares-post-biggest-drop-eight-years-markets", "ord_in_thread": 0, "title": "Business - China shares post biggest drop in eight years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Concerns over China dominated financial markets on Monday, with the biggest fall in Shanghai shares in eight years driving stock markets and prices of major commodities lower across the board. The dollar was weak ahead of the week's main set piece - Wednesday's Federal Reserve policy decision and statement - with a better-than-expected survey of German business sentiment prodding the euro above $1.11 for the first time in two weeks.\nBut it was the stunning 8.5 percent fall in Shanghai that drove most of the moves early in the European day: Share indices in Frankfurt, London and Paris all slumped by more than 1 percent.\nTraders and investors said that was all rooted in broader concerns over global growth midway through the corporate results reason and following a poor economic reading out of China late last week.\nWall Street was also expected to open more than half a percent lower.\n\"This really has its roots in nervousness that began in the U.S. at the end of last week,\" said Andy Sullivan, a portfolio manager with Swiss investment firm GL Financial Group.\n\"Shanghai is an artificial market at the moment reliant on government support, and they have thrown the kitchen sink at it in recent weeks. The selling just ratcheted up steadily this\nmorning.\"\nThe CSI300 index of the largest listed companies in Shanghai and China's other major market, Shenzhen, ended 8.5 percent lower. Japan's Nikkei slipped more than 1 percent, while MSCI's broadest index of Asia-Pacific shares outside Japan fell 1.6 percent.\nBoth copper, for which Chinese demand is an important driver, and the broader Thomson Reuters CRB commodities index hit their lowest point in six years. Copper futures fell another 1 percent on Monday.\n\"The drop in Chinese equities and the negative growth backdrop in China are clearly going to leave you very concerned about Chinese demand in the months ahead,\" said Nic Brown, head of commodities research at Natixis.\nFed Up?\nDespite the still patchy economic news, many analysts still expect the U.S. central bank to raise interest rates in September. Fed chief Janet Yellen drove the dollar higher earlier this month by saying a move this year was on the cards, but she has gone no further than that.\n\"We expect Fed voters to pull the trigger in September, but for the path to interest rate normalisation to be a long one given the global risk profile,\" analysts at Australia and New Zealand Banking Group said in a note to clients.\nExpectations of a hike have slowly pushed up U.S. Treasury yields and widened the dollar's premium over the euro. But the euro has also tended to rise when investors get more concerned about global growth and rein in riskier bets, as they were doing on Monday.\nThe common currency gave back some of its early gains from a bullish Ifo survey of German business sentiment to stand up 0.8 percent on the day at $1.1076.\nBrent crude fell 84 cents to $53.78 a barrel, touching its lowest in almost four months, adding to falls which are expected to put more downward pressure on global inflation.\n\"In the next couple of months, even if the global oversupply and seasonal weakness are becoming priced in, it is difficult to see where any price uplift will come from,\" said Societe Generale oil analyst Michael Wittner.\n( REUTERS )\n 07-27\nTweet print", "external_links": ["http://f24.my/1gg6BmI", "http://f24.my/1gg6BmK", "http://f24.my/1gg6BmC", "http://f24.my/1gg6yY2", "https://twitter.com/share", "http://f24.my/1gg6yY4&title=China&#x20;shares&#x20;post&#x20;biggest&#x20;drop&#x20;in&#x20;eight&#x20;years&newwindow=1&sr=worldnews"], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-07-31T00:06:09.690+03:00", "highlightTitle": ""}