{"organizations": [], "uuid": "5722a2e878fdb899c80c6b7f4ac8135da61bc30f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/09/usa-health-antidepressants-idUSL1N0ZP1N820150709", "country": "US", "title": "Study links Prozac, Paxil use with birth defects", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Study links Prozac, Paxil use with birth defects | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T01:18:00.000+03:00", "replies_count": 0, "uuid": "5722a2e878fdb899c80c6b7f4ac8135da61bc30f"}, "author": "Ellen Wulfhorst", "url": "http://www.reuters.com/article/2015/07/09/usa-health-antidepressants-idUSL1N0ZP1N820150709", "ord_in_thread": 0, "title": "Study links Prozac, Paxil use with birth defects", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 9 A sweeping government study of thousands of women has found links between the older antidepressants Prozac and Paxil and birth defects, but has cleared other popular treatments in the class, including Celexa, Lexapro and Pfizer's Zoloft, which is the subject of a major lawsuit over birth defect claims.\nEarlier studies had raised questions about antidepressants in a class of drugs known as Selective Serotonin Reuptake Inhibitors or SSRIs, prompting the U.S. Food and Drug Administration in 2005 to issue a safety warning about use of the treatments during pregnancy.\nIn the current study, published on Wednesday in the British Medical Journal, researchers at the U.S. Centers for Disease Control and Prevention wanted to see if the birth defect risk affected the entire class of drugs, or only select treatments.\nFor the study, the researchers asked nearly 28,000 women if they took Celexa, Lexapro, Prozac, Paxil or Zoloft any time from one month before conception through the third month of pregnancy and analyzed which women bore children with birth defects.\nThey found that many popular antidepressants - Celexa, Lexapro or Zoloft - are not associated with birth defects. Only two in the study, Prozac, sold generically as paroxetine, and Paxil, sold generically as fluoxetine, were implicated.\nIn women who took those two drugs early in pregnancy, birth defects occurred 2 to 3.5 more frequently compared with women who did not take them.\nProzac use was associated with a birth defect in which a baby's skull is misshapen. Paxil use was associated with a defect in which a baby's intestines protrude outside the body and with anencephaly, in which a baby is missing parts of the brain and skull, the study found.\nBoth Paxil and Prozac were linked to a heart defect.\nThe study's authors noted that the risks appeared to be small. For example, in women who took paroxetine early in pregnancy, the risk for anencephaly rose from 2 cases per 10,000 to 7 per 10000.\nThe analysis was only able to show links between the drugs and birth defects, but could not prove that the drugs caused the deformities.\nThe authors called the findings about Zoloft \"reassuring\" because the drug was used by some 40 percent of the women in the study who said they had used an antidepressant in early pregnancy.\n(Editing by Julie Steenhuysen and Christian Plumb )", "external_links": [], "published": "2015-07-10T01:18:00.000+03:00", "crawled": "2015-07-10T00:22:30.000+03:00", "highlightTitle": ""}