{"organizations": ["General Motors", "Chevrolet Cruze"], "uuid": "e7aef74b7fee9da9394a8a61b2178b3f171bbb86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://g.foolcdn.com/editorial/images/172295/cruze_sales.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13adhpd6o/*http://www.fool.com/investing/general/2015/07/19/is-general-motors-2016-chevrolet-cruze-a-contender.aspx?source=eogyholnk0000001", "country": "GB", "title": "Is General Motors' 2016 Chevrolet Cruze a Contender or Pretender?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is General Motors' 2016 Chevrolet Cruze a Contender or Pretender?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T19:02:00.000+03:00", "replies_count": 0, "uuid": "e7aef74b7fee9da9394a8a61b2178b3f171bbb86"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13adhpd6o/*http://www.fool.com/investing/general/2015/07/19/is-general-motors-2016-chevrolet-cruze-a-contender.aspx?source=eogyholnk0000001", "ord_in_thread": 0, "title": "Is General Motors' 2016 Chevrolet Cruze a Contender or Pretender?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Daniel Miller"], "text": "Motley Fool Mobile Is General Motors' 2016 Chevrolet Cruze a Contender or Pretender? General Motors is more competitive in passenger cars than it has been in over a decade, but the 2016 Chevrolet Cruze faces an uphill battle. Daniel Miller Jul 19, 2015 at 12:02PM General Motors' 2016 Chevrolet Cruze. Image source: General Motors. \nGeneral Motors ( NYSE:GM ) has been hard at work freshening up its Chevrolet lineup. According to Chevy executives, 95% of the brand's vehicles are all-new over the last two years. Those redesigns will include the 2016 Camaro, Malibu, Spark, and Volt, and the next car up on deck is the 2016 Cruze. Unbeknownst to many, the Chevy Cruze is actually the brand's best-selling model globally, and it is important for the new model to continue the best-selling trend. \nLet's take at the 2016 Cruze, what people are saying about the new ride, and what investors can expect from its sales figures. \nContender or pretender? Chevy's all new 2016 Cruze will hit the roads as a larger version than its predecessor, yet it will also be lighter. The 2016 version is expected to be more efficient, agile, and sophisticated. GM is stuffing plenty of new technologies into the new Cruze, which includes Android Auto, Apple CarPlay, and new safety features, among a long list of options. Interior of GM's 2016 Chevrolet Cruze. Image source: General Motors. \nFurthermore, GM claims it will have more standard features than most competitors' small cars. Those standard features include 10 air bags, four-wheel disc brakes, rearview camera, and available OnStar 4G LTE with Wi-Fi hotspot. \nWhen it hits North American dealerships in early 2016, consumers will find a new standard 1.4-liter turbocharged engine under the hood producing 153 horsepower -- it will also achieve an estimated 40 miles per gallon on the highway with the six-speed automatic transmission. \nThe Cruze's styling takes some hints from the critically acclaimed 2014 Impala, as well as the all-new Malibu. It's a style that has worked well overseas, as well as within American borders, and GM plans to tweak small content variations for specific local market demands abroad. So far, the response has been largely positive for the 2016 Cruze: \n\"So it seems that Chevy has gotten the package right, with some of the best materials to be found in a compact car, plenty of space and a dramatically improved multimedia experience.\" -- Cars.com \n\"With better fuel economy and reliability, and a more comfortable back seat, the new Cruze could be more than competitive; it could be a real small-car contender.\" -- Consumer Reports \nHowever, while the 2016 Cruze might be a real winner, it faces hurdles that are beyond General Motors' control. \nSegment headwinds Here's a look at the Cruze's sales history in the U.S. market. Chart by author. Data source: GoodCarBadCar.net \nWhile the Chevrolet Cruze has rebounded from its spiraling sales trend between the early 2000's and the recent recession, it still lags behind its Japanese competitors' small cars. Despite the 2016 Cruze possibly being GM's best chance at gaining market share on the Corolla and Civic in a decade, segment headwinds look to make growing sales difficult. \nAs gas prices remain lower and SUVs boast improved fuel economy, Americans have renewed their love affair with SUVs and crossover vehicles. A quick glance at segment sales makes the trend of consumers moving into larger vehicles very clear. \nConsider that sales of cars in the U.S. are down 3.7% through June 2015 compared to the same time period last year, in a market where total light vehicle sales are up 4.4%. Moreover, overall light-duty trucks are up 11.4%, SUV and crossover sales combined are up 14.4%, and crossovers alone are up 19.5%. \nDespite being a solid product, the 2016 Cruze will have an uphill battle to increase sales at a high clip with current industry trends favoring SUVs and crossovers -- though, if it can maintain its level of sales while increasing its share of the segment, as many competitors will post a sales decline in the short-term, it will still be a win for GM investors. \nThis $19 trillion industry could destroy the Internet One bleeding-edge technology is about to put the World Wide Web to bed. And if you act quickly, you could be among the savvy investors who enjoy the profits from this stunning change. Experts are calling it the single largest business opportunity in the history of capitalism... The Economist is calling it \"transformative\"... But you'll probably just call it \"how I made my millions.\" Don't be too late to the party -- click here for one stock to own when the Web goes dark. \nDaniel Miller owns shares of General Motors. The Motley Fool recommends General Motors. Try any of our Foolish newsletter services free for 30 days . We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . Compare Brokers Daniel Miller Fool Contributor As a Motley Fool Industrial Specialist, I use my marketing and business background in the automotive industry to evaluate major automakers and other large industrial corporations. Follow me on twitter for tweets about stocks, cars, sports, and anything I find amusing. Follow @StreetSmartFool Article Info Jul 19, 2015 at 12:02PM Industrials", "external_links": [], "published": "2015-07-19T19:02:00.000+03:00", "crawled": "2015-07-19T20:53:54.110+03:00", "highlightTitle": ""}