{"organizations": [], "uuid": "46f2a1f3c8f6472ae03c4d44a598939bcbbf73e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/07/24/12866911/051.jpg", "site_section": "http://www.prweb.com/rss2/homefinance.xml", "section_title": "Home and Family: Banking / Personal Finance", "url": "http://www.prweb.com/releases/2015/07/prweb12866911.htm", "country": "US", "title": "GSF Mortgage Appoints New Chief Financial Officer", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "GSF Mortgage Appoints New Chief Financial Officer", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "46f2a1f3c8f6472ae03c4d44a598939bcbbf73e5"}, "author": "PRWEB", "url": "http://www.prweb.com/releases/2015/07/prweb12866911.htm", "ord_in_thread": 0, "title": "GSF Mortgage Appoints New Chief Financial Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is a great opportunity and a great company. The importance of capital to a lending company is a critical part of the company’s success. GSF Mortgage is well positioned for future growth. Brookfield, Wisconsin (PRWEB) July 24, 2015\nGSF Mortgage is pleased to announce that Bruce Olster will be its new Chief Financial Officer, effective immediately. In his role, Olster will maintain and develop relationships with financial partners, deal with investors that lend to the company and oversee financial reports as well as internal management and operations reports.\nOlster has held various leadership positions throughout his extensive career in the financial services and mortgage industries, including firms in Florida and Illinois. He specializes in managing, growing and financing mortgage companies.\nOlster holds a bachelor’s degree in economics from the University of Pennsylvania Wharton School of Finance and Commerce, and also completed the Advanced Management Program at Harvard Business School.\nBefore joining GSF Mortgage, Olster was senior vice president for the multifamily warehouse lending divisions at Banco Popular North America. He was also CEO and co-founder of NattyMac LLC, a nationwide mortgage warehouse company that served single- and multi-family independent mortgage bankers.\n“This is an easy subject for me because it is something I am passionate about. This is a great opportunity and a great company. The importance of capital to a lending company is a critical part of the company’s success,” says Olster. “GSF Mortgage is well positioned for future growth.”\n“I’m elated that Bruce has agreed to join the GSF family. His vast experience in the lending industry will undoubtedly strengthen GSF’s knowledge base and ability to lend safely and profitably. For me personally, I have an opportunity to work alongside an industry great. Bruce is a great teacher and I’m sure I will learn a great deal from him,” says Chad Jampedro, president.\nOlster can be reached at (262) 901-1428 or bolster(at)gogsf(dot)com.\nGSF Mortgage continues to seek mortgage rockstars for a number of positions throughout the United States including branch managers, mortgage underwriters and mortgage processors. If you are looking for a dynamic company with a great work culture, benefits and a remarkable reputation, please visit gogsf.com/careers.\n# # #\nFounded in 1995, GSF Mortgage is an established and experienced direct mortgage lender. With 20 years of lending experience, GSF professionals originate, process, underwrite, and fund all loans. We continue to serve the next generation of homeowners with the GoGSF brand. We are focused on flexible and transparent mortgage lending and are on a quest to continue hiring the \"best of the best\" in the mortgage industry. With many locations, our strengths keep GSF Mortgage “Lending in Your Favor”. Interested in finding out more about us? Visit us at GoGSF.com and check out our careers available!", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2dvZ3NmLmNvbQ=="], "published": "2015-07-24T03:00:00.000+03:00", "crawled": "2015-07-25T01:06:16.974+03:00", "highlightTitle": ""}