{"organizations": [], "uuid": "3586d66d6f8ee67d310c499efb37d5183f78fa5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/5/x/8/9/image.related.afrArticleLead.620x365.gi9f5a.png/1436554775535.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/economy-missing-in-the-world-according-to-tony-abbott-20150710-gi9f5a", "country": "AU", "title": "Economy missing in the world according to Tony Abbott", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Economy missing in the world according to Tony Abbott | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T02:59:00.000+03:00", "replies_count": 0, "uuid": "3586d66d6f8ee67d310c499efb37d5183f78fa5d"}, "author": "Jacob Greber", "url": "http://www.afr.com/news/politics/economy-missing-in-the-world-according-to-tony-abbott-20150710-gi9f5a", "ord_in_thread": 0, "title": "Economy missing in the world according to Tony Abbott", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Abbott seems more relaxed talking about just about anything other than the economy. Share on twitter by Jacob Greber\nIf you take Tony Abbott at his word, Australians have nothing to fear from either Greece's debt mendicants or Shanghai's sharemarket gamblers.\nOr the sudden downturn in China's steel production , that drives demand and prices for Australian iron ore, now at its lowest level since 2005.\nOr even the accelerating slide in living standards that – according to one estimate this week – will cut the global purchasing power of households to what it was in the 1990s, a decade remembered by those old enough for its recession, high interest rates and extreme youth unemployment.\nAll of these things – let's call them \"grave threats\" for argument's sake – are nothing but silly trifles in a world where excoriating the ABC is the dominant political obsession.\nNot a wazoo of worry folks. We truly are the blessed country.\nAnd how do I know this? Because Abbott reckons our big supermarket retailers have agreed to play nice.\nYep. It's because Woolies, Coles and Aldi promised hand-over-heart to pay their suppliers \" within a reasonable time \" and not hide that brand of muesli on the top shelf when the supermarket manager wants them to miss their sales target so they can wriggle out of a supply deal.\n Standing in a Sydney supermarket on Tuesday, when asked twice how worried he was about whether Greece's and China's problems might spread to Australia, he responded like this:\n\"Look, the important thing is to do whatever we can to build a strong and prosperous economy locally, and again I get back to the Grocery Code of Conduct.\n\"We have a great supermarket system. That rests on the shoulders of great local suppliers and this is about ensuring that we continue to have very strong local suppliers, best possible product at the best possible price … and if we do that we will avoid the problems that we see overseas.\"\nSay what? It would all be funny if it weren't emblematic of how badly the government is stuffing up the economic debate.\nThe reporter asking the question wasn't seeking to \"gotcha\" the prime minster into making a blunder. The question reflected the genuine concern of Australians all week. Will a Greek default and exit from the eurozone become another \"Lehman moment\"? Does what's happening in China threaten my job? Will I lose my savings/house/superannuation?\nWhat the public hopes for in such situations – when unsettling, dangerous and deeply unpredictable global forces are unleashed – is a sense that the guy at the top has a clue. That he's giving these things serious consideration.\nTo be sure, the sight of Abbott in a wild-eyed panic would be counterproductive. But what about reassuring the nation that the flexible currency will help; that there's more to Australia's economy than shipping iron ore; that real economic growth will come from spurring productivity; that the Chinese sharemarket isn't necessarily a good gauge to what is happening in its economy, as Peter Costello managed to explain on Friday.\nWhile Abbott is clearly at the top of his game when talking about national security or union malfeasance within the Labor movement, he gives the impression of being ham-fisted on the economy.\nEarlier this month he dismayed first-time buyers when he declared \"I do hope our housing prices are increasing\", and in March shocked economic dries within his own ranks when he suggested it wouldn't be the end of the world if Australia's debt-to-GDP ratio blew out to 50 or 60 per cent.\nForeign Minister Julie Bishop showed on Friday morning that it's not that difficult to do. Yes, the fall in iron ore to $US44 a tonne that week \"does present challenges\", she said. And yes, China is a \"large and resilient economy\" led by a Beijing doing all it can to ensure the correction takes place \"in an orderly fashion\".\n\"China has been through the Asian financial crisis in the past and I'm sure they'll adopt whatever measures they can to make this a seamless transition,\" she said.\nYup, that's better.\nJohn Fraser, no doubt surprised at how much scrutiny he gets as Treasury secretary after almost two decades working behind the boilerplate protection of UBS' press flacks, is also showing how it's done.\nHe has rightly pointed out that parts of Sydney's property market are in a bubble and that Australians will need to get used to the kind of market turmoil unleashed in China this week.\nWith an election due within the next 12 months or so, Abbott's apparent lack of command on the economic front is a big weakness for the Coalition, particularly if – as seems increasingly likely – the prime minister chooses to replicate his 2013 strategy of winning on what he's against.\nThat's unlikely to work this time around, not least with the economy facing serious headwinds. During Abbott's time in office, not enough will have been done to fettle back to health the usual tools of fiscal policy. Monetary policy is reaching its limits, and the hard stuff – tax reform, industrial relations, competition policy – is being kicked onto the back burner.\nEven in the unlikely event that nothing bad happens either in China or elsewhere around the world, the next few years will be a slow grind for many Australians.\nStandards of living – pincered between rising costs for housing and declining wages growth – are more likely than not to fall.\nChina – and the iron ore price – will remain the primary barometer of the economy's immediate future, and with it, the Abbott government's ultimate fortunes.\nIgnoring people's genuine concerns with spin won't help this time around.\nJacob Greber is the AFR's economic correspondent. Phil Coorey is on leave.", "external_links": ["http://www.accc.gov.au/business/industry-codes/food-and-grocery-code-of-conduct", "https://twitter.com/jacobgreber"], "published": "2015-07-11T02:59:00.000+03:00", "crawled": "2015-07-11T02:04:41.000+03:00", "highlightTitle": ""}