{"organizations": ["Standard Group"], "uuid": "ba3cfee7d96578c2bffafd51ff6364ad5c4dd6f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507101739.html", "country": "US", "title": "Kenya: Standard Group to Unveil a 24-Hour TV News Channel", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Standard Group to Unveil a 24-Hour TV News Channel", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T21:56:00.000+03:00", "replies_count": 0, "uuid": "ba3cfee7d96578c2bffafd51ff6364ad5c4dd6f7"}, "author": "", "url": "http://allafrica.com/stories/201507101739.html", "ord_in_thread": 0, "title": "Kenya: Standard Group to Unveil a 24-Hour TV News Channel", "locations": ["Kenya", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa: Communications Hosts Public Sector Manager Forum On Digital Terrestrial Television, 14 Jul \nStandard Group Chief Executive Officer Sam Shollei said the new channel will break new grounds in TV programming because it will give Kenyans a variety of news channels to watch. This, according to him will see more Kenyans access information both from county and national level and determine level of service delivery by both levels of governments. \n\"We will be moving to counties and give them platforms that wananchi can connect with their leaders. We will see a situation where governors will be interacting with other leaders and their electorate,\" he said. \nThe new channel can be accessed through all available digital platforms and regionally via DSTV on channel 274, ADN-KTN News, Gotv on channel 94, Zuku on channel 14 (on both Fibre and satellite). The group will also seek partnership with other TV stations in East and Southern Africa in the coming months to have it accessed in the region. \nShollei said the new station will ensure that programmes and news that have always got limited attention during prime time are aired. \"There is a lot that does not reach the common mwananchi in terms of news. Ordinarily, TV news bulletins have traditionally been aired between 7pm and 9pm. Now KtnNews will address the interests of viewers who are not at home around that time for one purpose or another,\" said Shollei. \nOrdinarily, TV news bulletins have traditionally commanded the highest viewership numbers especially for the prime time bulletins at 7pm and 9pm. \"There is more public need to know and I have to say the digital platform will play a great role in this country and this is the path Standard Group has taken by introducing the new station,\" he added. \nStandard Group Managing Director, Broadcast Division Joe Munene said the new channel, which will broadcast in both English and Kiswahili, will serve as a one-stop shop of all the day's news and information, with emphasis on in depth analysis of news and people making the news. \n\"For the past 25 years, KTN has established a strong brand name for Television news. We are excited that on our 25th Anniversary and to ride on KTN's historical news tradition and reputation, we are launching a 24hr News Channel,\" he said. \nMr Munene said news content and programming will largely be sourced and produced internally while most of the programmes will be local. It will also provide a wide variety of news, current affairs programming, documentary, business news and features content. \n\"There is need for hourly news updates and this is why Ktn News comes in. There will be no need to wait for news at particular time as our channel two will break news as it happens,\" he added. \nBeing a 24hr news channel, the new station will at its core be focused on timely delivery of relevant TV news content round-the-clock. \nThe TV schedule will include distinct flagship programmes that speak to the channel's agenda while meeting the public's needs for news and current affairs. Shollei said this was an advent of digital migration which offers a lot in terms of news channels which he says, places Kenya at par with developed countries. Kenya \nWestgate Mall will reopen on July 18, twenty three months after it was attacked and destroyed by terrorists, director … see more » Copyright © 2015 CIO East Africa. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-10T21:56:00.000+03:00", "crawled": "2015-07-11T17:44:24.000+03:00", "highlightTitle": ""}