{"organizations": [], "uuid": "0d32c487743764b9cafd8bcb10080b7c97d08d25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/07/eurozone-greece-sunday-summit-idUSL8N0ZN48820150707", "country": "US", "title": "UPDATE 1-Eurozone summit possible on Sunday to back plan for Greece-sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Eurozone summit possible on Sunday to back plan for Greece-sources | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T23:12:00.000+03:00", "replies_count": 0, "uuid": "0d32c487743764b9cafd8bcb10080b7c97d08d25"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/07/eurozone-greece-sunday-summit-idUSL8N0ZN48820150707", "ord_in_thread": 0, "title": "UPDATE 1-Eurozone summit possible on Sunday to back plan for Greece-sources", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds more details of timetable, Greek official)\nBy Julien Ponthus\nBRUSSELS, July 7 (Reuters) - Euro zone leaders could hold a further emergency summit on Sunday to approve a plan to aid Greece if creditor institutions are satisfied with a Greek loan application and reform commitments, two senior EU sources said.\nThe leaders were meeting on Tuesday evening in Brussels with Greek banks shuttered and fast running out of cash and the Greek economy on the verge of collapse.\nThe sources set out a tentative timetable that could offer a breakthrough to keep Greece afloat and in the euro zone, provided it accepts credible reforms and spending cuts to make its public finances sustainable in the mid-term.\nGreece is expected to submit a formal request for a medium-term assistance programme from the European Stability Mechanism rescue fund within hours and euro zone finance ministers have said they will hold a conference call in Wednesday morning to consider that request.\nThe three institutions representing the creditors - the European Commission, the International Monetary Fund and the European Central Bank - would then take two or three days to make a first analysis of the feasibility of the Greek proposals.\nIn parallel, Greek Prime Minister Alexis Tsipras was expected to put forward a reform plan on Wednesday that would entail so-called \"prior actions\" to be put into law in Greece before the next emergency summit.\nA Greek government official said it would make sense to put some initial measures through parliament before the weekend.\nIf all went to plan, the German parliament could on its last day before the summer recess give the government a legally required mandate to start negotiations on a new programme for Greece, one of the sources said.\nIf the institutions gave their green light and the German parliament approved, euro zone leaders could meet again probably on Sunday evening to give political approval for detailed negotiations on a two-or-three-year bailout programme.\nThat deal could also include some commitment by the euro zone to reprofile Greece's debt, but no write-downs, two sources said.\nThey said new Greek Finance Minister Euclid Tsakalotos had not requested any \"haircut\" during a meeting of euro zone finance ministers but had used the term \"reprofiling\", which involved stretching out the maturities of existing loans and possibly lowering interest rates and granting a longer debt service moratorium.\nGreece would receive a short-term interim financing arrangement to meet a crucial 3.5 billion euro July 20 bond redemption to the ECB and to clear arrears of 1.5 billion euros with the IMF, another source said.\nA Greek government source confirmed that Athens was seeking an interim financing deal to cover its debt service hump over the summer ahead of a longer-term programme.\nThe EU sources were reluctant to discuss how Greece's short-term needs would be funded.\nTwo sources said it would be a mixture of releasing 1.9 billion euros in profits returned by the ECB to member governments on its Greek bond holdings, and either bilateral loans from friendly countries or a decision by the ECB to allow Greece to issue more short-term Treasury bills.\nHowever, a source familiar with the discussions said the ECB could not allow Greek banks to buy any more Treasury bills, since that would clash with its responsibility as banking supervisor for ensuring their solvency and avoiding indirect monetary financing of the Greek government. (Additional reporting by Tom Koerkemeier and Renee Maltezou; Writing by Paul Taylor; Editing by Alastair Macdonald and Ralph Boulton)", "external_links": [], "published": "2015-07-07T23:12:00.000+03:00", "crawled": "2015-07-07T22:32:31.000+03:00", "highlightTitle": ""}