{"organizations": [], "uuid": "5e91154729220d71886251d33a65fc82fe0ab3fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/morning-star-publishing/rss/627", "section_title": "Morning Star Publishing : Personal Finance", "url": "http://business-news.thestreet.com/morning-star-publishing/story/with-rental-rates-rising-get-creative-to-cut-a-good-housing-deal/13227087", "country": "EU", "title": "With Rental Rates Rising, Get Creative To Cut A Good Housing Deal", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "With Rental Rates Rising, Get Creative To Cut A Good Housing Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T16:25:00.000+03:00", "replies_count": 0, "uuid": "5e91154729220d71886251d33a65fc82fe0ab3fc"}, "author": "", "url": "http://business-news.thestreet.com/morning-star-publishing/story/with-rental-rates-rising-get-creative-to-cut-a-good-housing-deal/13227087", "ord_in_thread": 0, "title": "With Rental Rates Rising, Get Creative To Cut A Good Housing Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brian O'Connell"], "text": "With Rental Rates Rising, Get Creative To Cut A Good Housing Deal Written by: Brian O'Connell 07/22/15 - 9:25 AM EDT More Headlines 10 Beers That Aren't Made Where You Think They Are: Are You Drinking a Lie? \nNEW YORK (MainStreet) -- Apartment and housing rentals are rising across the U.S. and are climbing \"drastically\", according to a new report tracking nationwide three-bedroom rentals by Real Property Management, a real estate company based in Salt Lake City. According to RPM, rental rates grew by 3.3% between the first and second quarters this year, and \"that's at a faster pace than the national inflation rate\" of 0.1% . At a glance, the report reveals some interesting snapshots of the U.S. home rental market: - The U.S. Northeast and Pacific regions are experiencing double digit increases in rents. - Rent increases have been accompanied by reductions in vacancy rates - vacancies have fallen from 5.58% last year to 5.46% through June. The fewer vacancies are likely contributing to rental price pressure. - Rental saturation is now 25.4%, emphasizing declines in home ownership throughout the country. - During the second quarter of 2015, the average monthly rent for single-family homes now exceeds $1,320, up 3.3% since just last quarter and representing a 6.1% year-over-year increase. Based on the rising number of Americans who are choosing to rent a home than own one, RPM analysts expect the rental price increases to rise even further through the remainder of 2015 (U.S. renters rose from 23.9% in 2014 to 25.4% through the first half of 2015.) \"The changes in the rental market are consistent with other reports that point to a dwindling number of Americans who are choosing to own homes,\" notes Don Lawby, president of Property Management Business Solutions, the franchisor for Real Property Management. \"We have already witnessed significant increases in rental rates through the first half of this year, and we expect those numbers to continue to climb during the second half.\" If you're in the market for a new apartment or home rental, get creative to cut the best deal. Many landlords will work with you if you show you can work with them. 1", "external_links": [], "published": "2015-07-22T16:25:00.000+03:00", "crawled": "2015-07-22T17:48:39.519+03:00", "highlightTitle": ""}