{"organizations": [], "uuid": "abcae4d95244a9e85ade3a85f8a41c5810128563", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/a/j/e/3/image.related.articleLeadwide.620x349.giixyo.png/1437666420230.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/comment-and-analysis/chinas-interventionist-recovery-plan-will-not-be-as-easy-next-time-20150723-giixyo.html", "country": "AU", "title": "China's interventionist recovery plan will not be as easy next time", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "China's interventionist recovery plan will not be as easy next time", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "abcae4d95244a9e85ade3a85f8a41c5810128563"}, "author": "Ambrose Evans-Pritchard", "url": "http://www.smh.com.au/business/comment-and-analysis/chinas-interventionist-recovery-plan-will-not-be-as-easy-next-time-20150723-giixyo.html", "ord_in_thread": 0, "title": "China's interventionist recovery plan will not be as easy next time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Chinese central bank is running down the country's foreign reserves to defend the yuan. Photo: Reuters\nChina is engineering yet another mini-boom. Credit is picking up again. The Communist Party has helpfully outlawed falling equity prices. Economic growth will almost certainly accelerate during the next few months, giving global commodity markets a brief reprieve.\nYet the underlying picture in China is going from bad to worse. Robin Brooks, of Goldman Sachs, estimates capital outflows topped $US224 billion ($304 billion) in the second quarter, a level \"beyond anything seen historically\".\nThe Chinese central bank is running down the country's foreign reserves to defend the yuan. This intervention is becoming chronic. The pace is creeping up. Mr Brooks calculates the authorities sold $48 billion of bonds between March and June.\nIllustration Kerrie Leishman\nCharles Dumas, of Lombard Street Research, says capital outflows – when will we start calling it capital flight? – have reached $US800 billion in the past year. These are frighteningly large sums of money.\nChina's bond sales automatically entail monetary tightening, and it has come at the worst moment, just as the country struggles to emerge from recession – to use the term recession advisedly. Looking back, we may conclude that the world economy came within a whisker of stalling in the first half of 2015.\nThe Dutch CPB's world trade index shows shipping contracted 1.2 per cent in May, and has been negative in four of the past five months. This is extremely rare. The epicentre of this crunch has clearly been in China, with cascade effects through Russia, Brazil, and the commodity nexus. Chinese industry ground to a halt earlier this year. Electricity use fell. Rail freight dropped at near-double-digit rates. What had begun as a deliberate policy by Beijing to rein in excess credit escaped control, escalating into a vicious balance-sheet purge.\nThe Chinese authorities tried to counter the slowdown by talking up a \"1929\" sharemarket boom in the state-controlled media. This has been a fiasco of the first order.\nThe equity surge had no effect on GDP growth, and probably diverted spending away from the real economy. The $US4 trillion crash that followed has exposed the true reflexes of President Xi Jinping. Half the shares traded in Shanghai and Shenzhen were suspended. New floats were halted. Some 300 corporate bosses were strong-armed into buying back their own shares. Police-state tactics were used to hunt down short-sellers.\nWe know from Caixin Magazine that China's top brokers were shut in a room and ordered to hand over money for an orchestrated buying blitz. A target of 4500 was set for the Shanghai Composite by Communist Party officials. Caixin says the China Securities Finance Corporation – a branch of the regulator – now owns an estimated $US200 billion of Chinese stocks and has authority to buy a further $US500 billion if necessary to prop up the market.\nThis use of brute force has done the trick. Equities have recovered. But how could they not do so, since selling was illegal, and not to buy was also illegal.\nYet it is hard to see what remains of Xi Jinping's pledge at the Communist Party's Third Plenum in November 2013, to let market forces play the \"decisive role\" in the economy. There was always a contradiction in this pledge. Mr Xi was touting free enterprise, even as he tightened control on the internet, academia and political dissent.\nHis pirouette is fatal for China's economy. The World Bank and China's Development Research Centre published a lengthy report three years ago calling for a market revolution before the Chinese economy hits a brick wall. It warned that the country's 30-year growth model is obsolete. The low-hanging fruit of state-driven industrialisation has been picked.\nEither China breaks its dependence on export-led growth and imported technology or it will drift into the \"middle-income trap\" awaiting all catch-up countries that fail to reform in time, and to do that it must let a hundred flowers bloom.\n\"The role of the private sector is critical because innovation at the technology frontier is quite different in nature from catching up. It is not something that can be achieved through government planning,\" it said.\nLombard Street Research says China's true economic growth rate is below 4 per cent using proxy measures of output. Capital Economics and Oxford Economics have reached a similar verdict.\nThe effect of pervasive excess capacity – the country produced more cement between 2011 and 2013 than the United States in the 20th century – has been a blanket of deflation. Factory-gate prices are falling at a rate of 4.6 per cent. Mr Dumas says this has pushed one-year market borrowing costs to 10 per cent in real terms. \"Current monetary conditions are extremely tight,\" he said.\nThe Chinese authorities have until now been reluctant to flood the system with fresh stimulus, all too aware that the ratio of private credit to GDP has jumped sixfold to 160 per cent of GDP since 2007.\nAdam Slater, of Oxford Economics, says the raft of easing measures since late 2014 have not kept pace with tightening conditions. The real exchange rate has jumped 15 per cent since mid-2014, chiefly due to China's dollar peg and Japan's weak yen policy. \"If the authorities wanted to quickly and radically ease monetary conditions, exchange rate depreciation would be the obvious way to go,\" Mr Slater said.\nThis is blocked – for now – because it would risk other nasty side-effects. Chinese companies have $US1.2 trillion of US denominated debt. A yuan devaluation would risk a beggar-thy-neighbour currency war throughout Asia, with lethal deflationary effects.\nThe early signs are that Mr Xi will now revert to stimulus again – hoping that he can calibrate the dosage, concluding that it is too dangerous to let market forces do their worst.\nThe Communist Party still controls the quantity of credit through the state banking system. It is using its lever. New loans jumped to $US205 billion in June, up from $145 billion in May. Local governments – facing new curbs on bank borrowing – issued a further $US113 billion in bonds. Taken together, they amount to a fresh sugar-rush.\nIndustrial output and electricity use are coming back from the dead. Sales of property floor space are suddenly spiking. The great scare of early 2015 appears to be over. The hideous denouement has been averted once again. It will be even harder next time.\nTelegraph, London", "external_links": [], "published": "2015-07-24T03:00:00.000+03:00", "crawled": "2015-07-24T10:35:53.704+03:00", "highlightTitle": ""}