{"organizations": [], "uuid": "37e0d02c787bf22725a5331e607bf59b5384b3ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/m/4/u/7/image.related.afrArticleLead.620x365.ginhui.png/1438246206435.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/time-for-tony-abbott-to-stand-up-to-haters-over-adam-goodes-20150730-ginhui", "country": "AU", "title": "Time for Tony Abbott to stand up to haters over Adam Goodes", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Time for Tony Abbott to stand up to haters over Adam Goodes | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T14:45:00.000+03:00", "replies_count": 0, "uuid": "37e0d02c787bf22725a5331e607bf59b5384b3ba"}, "author": "Fleur Anderson", "url": "http://www.afr.com/news/politics/time-for-tony-abbott-to-stand-up-to-haters-over-adam-goodes-20150730-ginhui", "ord_in_thread": 0, "title": "Time for Tony Abbott to stand up to haters over Adam Goodes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Abbott needs to speak up about the recent controversy surrounding Swans star Adam Goodes. Getty Images Share on twitter by Fleur Anderson When Tony Abbott presented Adam Goodes as Australian of The Year in January 2014, he praised the footballer for his leadership in the fight against racism and the personification of the very best of Australia.\n\"You are what the rest of us might be – if only we kept our new year's resolutions and heeded our best instincts,\" Abbott said at the time.\n\"You are a living embodiment of our country at its best.\"\nEighteen months on, the time is coming for our Prime Minister - not a bullied and despondent football star - to remind us of our best selves, shining a path away from the ugly tribalism emerging on the sidelines of sport, politics and the media.\nPersonalised, targeted hate - from supporters of both sides of politics - is now par for the course on issues like immigration, climate change, gay marriage and even issues as prosaic as tax reform. Mostly the hate is not visible or audible as a mob in a football stadium. It is quiet and insidious in late-night tweets and internet blogs.\nPoliticians usually stay out of sport. National leaders are required to take a stand on national issues.\nYet when the AFL hierarchy itself, the players and national newspaper editorials - even from the right-leaning side of the business - call out Goodes' treatment as mob bullying with every appearance of racism, this destructive disrespect of the \"other\" is becoming a national issue.\nNSW Premier Mike Baird, the man who most recently risked the ire of his constituents to call for a debate on a 15 per cent GST, has taken a stand in defiance of the powerful conservative commentators like Alan Jones and the like who effectively argue the bullied one, in this case, deserved it.\n \"There is a place for good-natured heckling in Australian sport. I've booed a few Queensland league players in my time - Wally Lewis comes to mind,\" Baird said in a statement posted on his Facebook account .\n\"And some may argue that the line between good-natured and malicious heckling can be fuzzy. But there is nothing fuzzy about this. The line has been crossed.\"\nAbbott, whose long-term commitment to aboriginal affairs is unquestioned, is yet to comment on the Goodes saga. This week he's appeared at a finance conference to deliver a set speeches and one doorstop press conference on Monday where he was asked one question about his embattled speaker Bronwyn Bishop.\nBut sometime today, tomorrow or over the weekend, Abbott will be asked about it.\nGiven Abbott will be attending WA colleague Don Randall's funeral in Perth on Friday, he could be forced to take a public stance in the very city in which West Coast Eagles fans almost ended the career of the 35-year-old Goodes.\nJust short of a month ago, Tony Abbott and Bill Shorten held an historic meeting with Indigenous leaders at Kirribilli House in Sydney to map out the process for a referendum in less than two years on Indigenous recognition in the Constitution.\nPutting aside the petty, political trivia of the day, Abbott and Shorten nutted out with the 40 Indigenous leaders a timetable of consultations around the country starting as early as September.\nIt's an ambitious timetable - a referendum in May 2017 to coincide with the 1967 referendum - and as Abbott said at the time, it would be a disappointment to fail. He would feel \"we had not quite been our best selves if we weren't able to do this in the next term of Parliament\".\n\"Our country has moved closer to recognising the First Australians in our constitution and ending the great silence about indigenous people in our founding document,\" Abbott and Shorten said in a joint statement,\nBipartisanship on such an important political principle is a rare and precious thing that it seems incredible that while the Coalition and Labor might be in complete agreement on constitutional recognition, we are engaged in national brawl over what is racist behaviour.\nMany have pointed out Australians do not react well to being told we're racist and it's a tough ask to remind people to treat with respect those whose views you fundamentally and vehemently disagree.\nOften the left complain of being victims of this sort of mob hate, frequently citing the \"ditch the witch\", 'Bob Brown's bitch\" anti-Gillard posters being the most visible examples.\nAnd yet, the left are just as bad as anyone else.\n\"Knuckle dragging Neanderthal Tony Abbott beating his chest like a lowland gorilla,\" tweets GrumpyMichael, just one of thousands of tweets attacking Abbott for his appearance, his walk and his personality.\nLiberal backbencher Cory Bernardi is no stranger to attracting the ire of the politically correct for some of his outspoken views but he reminded gay marriage advocates that they are not the only ones calling for tolerance and respect.\nDebating Labor's Penny Wong this week on legalising same sex marriage at the National Press Club, Bernardi believes the ability of those opposing a change to the definition of marriage were hamstrung by the knee-jerk accusation that those supporting a traditional marriage model were \"offensive\".\n\"We've been called bigots, we're told homophobes or worse on the name calling,\" he said.\n\"Once again it's simply another well-known propaganda technique designed to silence an alternative voice. I believe it's crude, it smacks of hypocrisy and intolerance, but it is very effective in silencing many from sharing their view.\"\nBronwyn Bishop hate-love relationship Bronwyn Bishop is another polarising figure, an almost caricacture of herself after so many years in politics that she attracts equal measure of Bishop lovers and haters.\nJust like Goodes, her detractors say it would all be better if only she'd apologise (her for that helicopter trip, wedding, acting like royalty etc and he for being a \"flog\" and calling out the 13-year-old girl who called him an ape) and on Thursday and after three weeks of controversy, Bishop bowed to the pressure.\n\"I am so apologetic to the Australian people for letting them down and I will be working very hard to make sure that things are right,\" she said.\nBishop, so often portrayed as an imposing cartoonish villian, looked diminished and humiliated - a tiny seventy-something woman standing alone in front a press pack to deliver her mea culpa.\nHer position as speaker is clearly untenable and if she resigns, at least the haters will move on to the next target.\nAs for Goodes, perhaps this episode will remind more people of the long game - constitutional recognition in 2017.\nIn the meantime, perhaps the current and future betes noir of the left and right can be comforted by the advice of the late Margaret Thatcher.\n\"I always cheer up immensely if an attack is particularly wounding because I think, well, if they attack one personally, it means they have not a single political argument left.\"", "external_links": ["https://twitter.com/https://twitter.com/fleur_anderson", "https://www.facebook.com/mikebairdMP/posts/938643059597269", "http://www.smh.com.au/afl/sydney-swans/swans-star-adam-goodes-always-plays-the-victim-alan-jones-20150729-gimmn3"], "published": "2015-07-30T14:45:00.000+03:00", "crawled": "2015-07-30T14:03:43.401+03:00", "highlightTitle": ""}