{"organizations": [], "uuid": "66edaf415fa984e7036b7a110051f1d6d2f4cf90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507201772.html", "country": "US", "title": "Africa: Rethinking Africa's Turbulence", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Rethinking Africa's Turbulence", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T15:32:00.000+03:00", "replies_count": 0, "uuid": "66edaf415fa984e7036b7a110051f1d6d2f4cf90"}, "author": "", "url": "http://allafrica.com/stories/201507201772.html", "ord_in_thread": 0, "title": "Africa: Rethinking Africa's Turbulence", "locations": ["Tanzania", "Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tanzania: War Against Poachers Beefed Up \nOne analogy that might shed light on the nature of instability is found in physics. In fluid dynamics, there are two types of flows: turbulent flow and laminar flow. Turbulence is characterized by essentially chaotic changes. Fluids moving at higher velocities tend to exhibit turbulent flow characteristics, while fluids moving at slower velocities will have \"laminar\" (smooth) flow characteristics. \nWhen the flow is laminar, the flow \"absorbs\" shocks that result when it is interrupted by things like surface roughness, heat transfer, vibration, noise, and other disturbances. When it's turbulent, the absorptive capacity of the flow is reduced, which sets off \"eddying\" motions. \nEddying motions are essentially chaotic vibrations that have a mind of their own. As they accumulate, they generate their own disturbances and reverberations. Eventually the flow is characterized not by the initial conditions, but by the relationship between the eddies and the energy they put off. \nThis makes turbulence essentially non deterministic: it can go faster, slower or stay the same speed depending on the interactions between the eddies. Whatever absorptive capacity the flow may have had at the beginning, is worn off. What's left is turbulence. \nThe physics of fluid dynamics is not a perfect analogy in which to consider economic growth. But it's a useful conceptual framework to consider rapid change in general and to reconsider how societies have sought to pursue sustainable development paths. \nThree fundamental features of fluid dynamics stand out as particularly relevant when re-considering what matters for growth and development: 1. the irrelevance of \"initial conditions,\" 2. the importance of absorptive capacity, and 3. the interaction between \"eddying motions\" and the turbulence these reactions create. \nThe importance placed on the \"initial conditions\" of a state - the constitution, division of power, the form and function of the elections, and the division of state and religion - has been a major focus of development practitioners. While there is a widespread assumption that getting these initial conditions right matters to long term stability and growth, the links are actually much more tenuous in practice. \nDespite the fact that many African countries are technically constitutional democracies, seven of the top 10 countries in the world most at risk of state failure are African. And of the 34 constitutions with term limits implemented in sub-Saharan Africa since the 1990s, only seven have adhered to the term limit. \nEven when the constitution and elections are met with fanfare from virtually all sides, things often fall apart - Burundi is a regrettable case in point. Regardless of how a country achieved independence, or what is enshrined in its constitution, as it undergoes rapid growth, everything is up for grabs. \nMore important to continued growth and stability than initial conditions is the \"absorptive capacity\" of society. The ability for a society to contain its turbulence can be characterized by a number of things, but the best definition might be the resilience of its institutions - both formal and informal. \nInvestment into formal institutions has formed a growing part of official development assistance. From 2006-2011, public sector institutional reforms were featured in over $50 billion worth of World Bank sponsored projects. \nBut less than 40% of 80 countries getting World Bank support for public sector reform between 2007-2009 had improved governance scores (Andrews, The Limits of Institutional Reform; 2013, Pgs 6,13). \nAnd according to the African Development Bank, average country scores fell in government effectiveness and regulatory quality indicators from 1998 - 2006, despite substantial reforms. So what are we doing wrong? \nThe deepest reservoir of absorptive capacity in a given society often emerges not from its formal institutions, but from its informal institutions. Informal institutions evolve as society does. They reflect the norms and means of life and adapt to promote solutions to conflict and the provision of social services. \nFor example, the Christian Health Association provides up to 40% of healthcare services in Nigeria. \nIn Tanzania, the land courts system offers a widespread alternative to the winner-take-all system the western legal system promotes. \nIn South Africa, member-based alternative asset management clubs called \"Stockvels,\" comprised of individuals sharing similar interests who manage their own money, are growing rapidly precisely because the formal pension sector is inflexible and costly. \nExploring ways to invest \"in the grain\" of local institutions is especially important, as reforms of formal institutions can mask or deter real reform. \nIn order to be successful, institutional reform needs to be linked with local norms and realities. Refocusing efforts on understanding which informal institutions would benefit from what forms of assistance should be a priority. \nLastly, understanding the interactions between the \"eddies\" of discontent rather than the specific eddies themselves would better focus enforcement efforts. We should look not just at Boko Haram or Al Shabaab in isolation, but specifically at the nature of the relationship they have with other sources of discontent - be it in business, civil society, government and/or religious institutions. \nA growing body of work and initiatives focused on understanding what are sometimes called \"illicit financial flows\" is painting a far more complex picture of the beneficiaries of, and contributors to, instability. \nBy investigating the interactions between sources of discontent, it could reveal weaknesses in the relationship between terrorist groups and their supporters. It might also reveal new ways for different groups to have their grievances met through different means. \nAt this month's World Economic Forum in Cape Town, the sentiment surrounding Africa's growth was overwhelmingly positive. But a different conversation was emerging in the hallways. \nEnthusiasm about Africa Rising is increasingly tempered by the recognition that progress is an inherently unstable process. It generates counter-currents which both advance and stall progress. It transforms small disturbances into widespread economic and social disruption. \nThe result isn't always an Arab Spring, as the most pessimistic observers suggest. But taken together, the accumulation of these factors reveal a more uncertain future than Africa Rising currently captures. \nTo ensure these alternative futures are managed, civil society, the private sector, governments and development stakeholders would do well to refocus their approach to managing growth. \nUntil now, too much focus has been spent making sure the initial conditions of the state are sound, too little time understanding informal institutions, and even less on understanding the often very complex relationship between different sources of discontent. By refocusing resources to better understand these three areas we would be better able to soften the shocks of Africa's rapid growth. \nEliot Pence is the director of the Africa Practice at McLarty Associates and founder of the Africa Expert Network. Africa \nActivists from different civil society organisation (CSOs) on tax matters have slammed last week's third International … see more » Copyright © 2015 African Arguments. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-20T15:32:00.000+03:00", "crawled": "2015-07-20T16:27:48.249+03:00", "highlightTitle": ""}