{"organizations": ["Standard Chartered Jul."], "uuid": "b2d0347ad0ee5e58b615372a021d845e8ac685e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static1.businessinsider.com/image/55adc05d5afbd34d1b8b4567/new-york-intensifies-probe-into-promontory-work-for-standard-chartered.jpg", "site_section": "http://feeds.feedburner.com/TheMoneyGame\r", "section_title": "Finance", "url": "http://www.businessinsider.com/r-new-york-intensifies-probe-into-promontory-work-for-standard-chartered--2015-7", "country": "US", "title": "New York intensifies probe into Promontory work for Standard Chartered", "performance_score": 0, "site": "businessinsider.com", "participants_count": 0, "title_full": "New York intensifies probe into Promontory work for Standard Chartered", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T06:35:00.000+03:00", "replies_count": 0, "uuid": "b2d0347ad0ee5e58b615372a021d845e8ac685e6"}, "author": "", "url": "http://www.businessinsider.com/r-new-york-intensifies-probe-into-promontory-work-for-standard-chartered--2015-7", "ord_in_thread": 0, "title": "New York intensifies probe into Promontory work for Standard Chartered", "locations": ["New York"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You have successfully emailed the post. New York intensifies probe into Promontory work for Standard Chartered Jul. 20, 2015, 11:35 PM 4 \nThomson Reuters A man walks past the head office of Standard Chartered bank in the City of London \nBy Karen Freifeld \nNEW YORK (Reuters) - New York state's banking regulator has intensified an investigation into Promontory Financial Group, a global consulting firm, over its work for Standard Chartered Plc , according to a person familiar with the matter. \nThe probe, conducted by the New York State Department of Financial Services (NYDFS), focuses on a 2011 report to regulators about the British bank's transactions with Iran and other sanctioned countries, the person said. \nAt stake in the investigation is whether Promontory may have amended the report to regulators under pressure from the bank, the source said. \"The concern is they sanitized the report,\" the person said, speaking on condition of anonymity because the investigation is not yet complete. \nIn an emailed statement, Washington, D.C.-based Promontory said it stood behind its work and the integrity of the professionals who conducted it. \nIn recent years, New York has scrutinized the independence of consultants retained by banks to report to regulators. A spokeswoman for the New York regulator declined to comment on the Promontory case. \nTwo other firms settled similar investigations. Deloitte LLP agreed in 2013 to pay New York $10 million and stay out of certain business for a year over accusations it watered down a report on Standard Chartered. Last year, PricewaterhouseCoopers paid $25 million and agreed to abstain from certain work for two years over claims it whitewashed a report involving Bank of Tokyo-Mitsubishi UFJ . \nIn 2012, the New York's Department of Financial Services threatened to revoke Standard Chartered's license to operate in New York over violations related to U.S. sanctions on Iran and other countries. The bank paid state and federal regulators $667 million that year, and another $300 million to the state last year, and it is still under scrutiny by authorities. \nBank of Tokyo-Mitsubishi reached settlements over similar violations. \nNew York subpoenaed Promontory back in 2013 and relations between the two became \"acrimonious\", the person familiar with the matter said, with Promontory not turning over documents sought by New York. \n\"We have sought for nearly two years to provide NYDFS with a complete understanding of the facts in this matter and, to that end, recently encouraged it to meet with our professionals,\" Promontory said in its emailed statement. \nStarting Tuesday, New York plans to depose at least a half dozen employees of Promontory it has subpoenaed, the person familiar with the matter said. \nPromontory managing director Michael Dawson, a former deputy assistant secretary at the U.S. Treasury, who helped lead the Standard Chartered engagement, is among those scheduled to be questioned, the person said. \nKonrad Alt, Promontory's chief operating officer, will be asked about the firm's policies, though he is not suspected of wrongdoing, the person said. \nThe escalation of the probe was first reported late Monday by The New York Times. \n(Reporting by Karen Freifeld; Editing by Kenneth Maxwell) Read the original article on Reuters . Copyright 2015. Follow Reuters on Twitter . More from Reuters:", "external_links": [], "published": "2015-07-21T06:35:00.000+03:00", "crawled": "2015-07-21T07:48:57.595+03:00", "highlightTitle": ""}