{"organizations": [], "uuid": "48f7a8e231ad190a000867d988dd126fb79d91a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/21/japan-economy-tankan-idUSL3N10103A20150721", "country": "US", "title": "UPDATE 1-Japan business mood subdued on uncertainty over China -Reuters Tankan", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Japan business mood subdued on uncertainty over China -Reuters Tankan | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T05:06:00.000+03:00", "replies_count": 0, "uuid": "48f7a8e231ad190a000867d988dd126fb79d91a3"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/21/japan-economy-tankan-idUSL3N10103A20150721", "ord_in_thread": 0, "title": "UPDATE 1-Japan business mood subdued on uncertainty over China -Reuters Tankan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* July manufacturers' sentiment index 14, unchanged from June\n* Service firms' index down the most in over a year\n* Retailers' index plunges to zero, from 34 in June\n* Business mood seen largely unchanged ahead\n* Reuters poll strongly correlates with BOJ tankan (Adds analyst's Quote: s, details)\nBy Tetsushi Kajimoto and Izumi Nakagawa\nTOKYO, July 21 (Reuters) - Confidence at Japanese manufacturers in July was subdued and the service sector mood dimmed the most in over a year, a Reuters poll showed, reflecting worries about sluggish consumption and exports as growth cools in major trading partner China.\nThe Reuters Tankan - which closely tracks the Bank of Japan's quarterly tankan survey - showed both manufacturers' and service-sector morale staying muted over the next three months.\nThe subdued sentiment joins a recent mixed batch of data that underlined the fragility of Japan's economy, and shows companies were far from assured about the outlook.\nThe poll of 516 big and midsize firms between July 1 and 15, of which 285 responded, showed business managers were worried about the state of China's economy - a major market for Japanese exporters.\n\"Asian markets centring on China are not performing very well. We have not felt a recovery in domestic markets related to private consumption either,\" said one chemicals producer.\nThe downturn in China's economy, which is on course to grow at its slowest pace in over two decades this year, has continued to hurt exports and manufacturing across much of Asia. In Japan, data in the past few weeks showed shipments and output weakening, but capital expenditure picking up.\n\"The worsening outlook index among the processing industries suggests the prospects for demand from China and Asia are not bright,\" said Yuichiro Nagai, economist at Barclays Securities.\n\"We expect a contraction in the second quarter. If the big drop in retailer's mood points to weakness in consumption, the economy may remain in a soft patch in the current quarter.\"\nThe BOJ trimmed its growth forecast on Wednesday but held off on offering fresh stimulus, convinced that an expected pick up in consumption will help accelerate inflation toward its 2 percent target next year.\nThe Reuters Tankan sentiment index for manufacturers held steady at 14 in July. The index is seen inching up to 15 in October.\nThe service-sector index tumbled from a record high of 36 in June to 24, the biggest decline since May 2014 when a sales tax hike dealt a blow to consumers.\nRetailers' mood plunged from over one year highs seen in June, weighing on the overall service sector mood.\nThat bodes ill for private consumption, which accounts for roughly 60 percent of the economy and is needed to pick up to cement a recovery from an expected slowdown in growth in the second quarter.\n\"Customers are staying away due to an unusually rainy weather and summer goods sales are slumping,\" said one retailer. (Editing by Shri Navaratnam)", "external_links": [], "published": "2015-07-21T05:06:00.000+03:00", "crawled": "2015-07-21T04:22:19.541+03:00", "highlightTitle": ""}