{"organizations": [], "uuid": "2c8d4c7a1778b62e7805d205d110e5c354bc8cc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "baltimorejewishlife.com", "main_image": "", "site_section": "http://baltimorejewishlife.com/news/finance.php", "section_title": "Baltimore Jewish Life | Finance", "url": "http://baltimorejewishlife.com/news/news-detail.php?SECTION_ID=5&ARTICLE_ID=62426", "country": "US", "title": "Wall Street Ends Flat Ahead of Greek Vote", "performance_score": 0, "site": "baltimorejewishlife.com", "participants_count": 1, "title_full": "Baltimore Jewish Life | Wall Street Ends Flat Ahead of Greek Vote", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "2c8d4c7a1778b62e7805d205d110e5c354bc8cc7"}, "author": "Staff Reporter", "url": "http://baltimorejewishlife.com/news/news-detail.php?SECTION_ID=5&ARTICLE_ID=62426", "ord_in_thread": 0, "title": "Wall Street Ends Flat Ahead of Greek Vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At the close of trade, focus on Wall Street was split between Greece, where protestors spared with police and debate began on bailout funds for Athens, and on Capitol Hill where Federal Reserve Chairwoman Janet Yellen gave members of a House committee an update on monetary policy and outlook for higher interest rates.\nThe Dow Jones Industrial Average ended down 3 points, or 0.02% to 18050. The S&P 500 ticked 1 point lower, or 0.06% to 2107, while the Nasdaq Composite lost 5 points, or 0.12% to 5098.\nToday’s Markets\nInvestors continued to monitor developments out of Greece on Wednesday where protests broke out, and briefly turned violent, in the streets as those against the nation’s bailout clashed with police.\nThe country’s parliament is set to vote within hours on a bailout deal that was negotiated by Prime Minister Alexis Tsipras and his eurozone counterparts over the weekend. The more than 17-hour talks resulted in a preliminary deal aimed at sustaining Greece’s membership in the euro. However, the deal was subject to a set of conditions Greece must implement by Wednesday and final approval by parliament.\nNot everyone is on the \"yes\" side this time around .\nIG analyst Josh Mahony, in a note, said despite the relative calm in the markets, the events that are set to unfold Wednesday night could be “explosive,” and are the biggest risk to global financial markets.\n“The Greek crisis is certainly not over yet. We’re only at the start of several national votes which potentially could derail the bailout…unfortunately, the deal hammered out at the start of this week represents a capitulation for Greece; a decision taken to simply escape the pressure of the negotiations merry-go-round, rather than the Greek long-term debt spiral,” he noted.\nEuropean markets closed higher on Wednesday, erasing earlier losses, as investors there awaited the outcome of the evening vote. The Euro Stoxx 50, which tracks large-cap companies in the eurozone, rose 0.54% to 3626. Meanwhile, the German Dax rose 0.32% to 11553, the French CAC 40 was 0.36% higher to 5050, while the UK’s FTSE 100 was flat at 6754.\nBack in the U.S., Federal Reserve Chief Janet Yellen made a visit to Capitol Hill for day one of her semi-annual testimony to Congress in front of the House Financial Services Committee. In prepared remarks, the Fed chief said the central bank is on track to begin raising interest rates, with the first hike “likely\" this year as long as economic conditions continue to improve. She also reiterated that once rates do begin to rise, increases will be “gradual.”\n“We continue to anticipate that it will be appropriate to raise the target range for the federal funds rate when the Committee has seen further improvement in the labor market and is reasonably confident that inflation will move back to its 2% objective over the medium term,” she said.\nAddressing market concerns, Yellen remarked that Greece’s debt problems, and worries over an economic slowdown in China are unlikely to affect course of action on monetary policy in the U.S.\n“Foreign developments, in particular, pose some risks to U.S. growth. Most notably, although the recovery in the euro area appears to have gained a firmer footing, the situation in Greece remains difficult. And China continues to grapple with the challenges posed by high debt, weak property markets, and volatile financial conditions. But economic growth abroad could also pick up more quickly than observers generally anticipate, providing additional support for U.S. economic activity,” Yellen remarked.\nBarclay’s director and U.S. economist Rob Martin wrote in a note Yellen’s comments seemed slightly less dovish than her speech on Friday at the City Club of Cleveland, citing in particular, the Fed’s chief’s comments on GDP growth and labor-market slack. However, he views the change in tone a result of a change in audience, not necessarily the Fed’s overall view of the economy.\n“We stand by our call for a September rate hike but continue to note that a flare-up in volatility driven by developments abroad or a few disappointing data releases could easily push the hike into December or even March,” he wrote.\nFollowing her House testimony, on Thursday Yellen will head to the Senate Banking Committee where discussion will again, likely focus on the timing and trajectory of rate hikes.\nOn the economic data front, traders parsed the latest read on producer prices, which came in better than expected. Prices at the wholesale level rose 0.4% in June from May. The reading was higher than the 0.2% pickup expected. Excluding the volatile food and energy components, prices rose 0.3%, compared to the 0.1% gain anticipated.\nA reading on Empire State manufacturing from the New York Federal Reserve showed activity moved back into expansion territory in July. The gauge rose to 3.86 during the month, surpassing Wall Street expectations for a rise to 3 from a June reading of -1.98. Readings above 0 point to expansion, while those below indicate contraction.\nIn its anecdotal Beige Book report , the Federal Reserve said the U.S. economy continued to expand at a modest to moderate pace across all of its 12 districts. The central bank noted that low energy prices helped boost spending in some districts, while the strong dollar continued to weigh on others. Additionally, the Fed noted employment levels either held steady or increased in most sectors, though layoffs were reported in manufacturing and energy industries.\nSecond-quarter earnings season revved up on Wednesday when Bank of America ( BAC ) unveiled its latest results . The second-biggest bank by assets reported a big beat on the bottom line with earnings per share coming in at 45 cents compared to 36-cent expectations. Revenue of $22.36 billion also topped estimates for $21.32 billion. The company’s chief executive, Brian Moynihan, said in a statement expenses reached the lowest level since the financial crisis, and costs continued to fall during the quarter as the bank put legal expenses behind it.\nTraders also got a check-up on quarterly results from Delta Airlines ( DAL ), U.S. Bancorp ( USB ), and BlackRock ( BLK ) ahead of the bell, with reports from Netflix ( NFLX ) and Intel ( INTC ) due out after the close of trade.\n“Specific attention should be given to Netflix with a combination of the release of its second quarter figures and the activation of its seven-for-one stock split, we’re sure to see fireworks in this afternoon’s trading session,” Alastair McCaig, market analyst at IG, said in a note.\nElsewhere in the world, in Asia, where growth concerns persist , the Shanghai Composite index dropped 3.03% to 3805. Hong Kong’s Hang Seng fell 0.26% to 25055, while Japan’s Nikkei ticked 0.38% higher to 20463.\n“The lack of support garnered from the slightly better-than-expected GDP figures [in China]either demonstrates an ongoing skepticism over figures correlated by China, or a greater fear of what equity markets could do if restrictions are fully lifted,” McCaig wrote.\nIn currencies on Monday, the euro fell 0.55% against the U.S. dollar. The yield on the benchmark 10-year U.S. Treasury note fell 0.047 of a percentage point to 2.352%. Bond yields move in the opposite direction of prices.\nIn commodities, global oil prices were lower after a Tuesday deal between Iran and six world powers on a nuclear agreement. Investors fretted how fuel exports from Iran would impact the existing global supply glut. U.S. crude oil futures settled at the lowest level since april, down 3.37% to $51.23 a barrel. Brent, the international benchmark, also fell 2.63% to $56.79a barrel. Gold prices also declined 0.51% to $1,147 a troy ounce.\nPhoto Caption: At the close of trade, focus on Wall Street was split between Greece, where protestors spared with police and debate began on bailout funds for Athens, and on Capitol Hill where Federal Reserve Chairwoman Janet Yellen gave members of a House committee an update on monetary policy and outlook for higher interest rates.\nTweet", "external_links": ["http://www.foxbusiness.com/markets/2015/07/15/greek-protesters-clash-with-police-at-anti-austerity-march-896991073/?intcmp=bigtopmarketfeatures", "http://www.foxbusiness.com/economy-policy/2015/07/15/yellen-global-turmoil-unlikely-to-throw-us-off-course/?intcmp=bigtopmarketfeatures", "http://quote.foxbusiness.com/symbol/BLK/snapshot", "http://quote.foxbusiness.com/symbol/INTC/snapshot", "http://www.foxbusiness.com/markets/2015/07/13/with-greek-deal-nearly-done-is-china-next-threat/", "http://www.foxbusiness.com/economy-policy/2015/07/15/beige-book-energy-strong-dollar-affect-consumer-spending/", "http://www.foxbusiness.com/economy-policy/2015/07/15/civil-servants-pharmacists-srike-against-greek-bailout/?intcmp=bigtopmarketfeaturesside", "http://quote.foxbusiness.com/symbol/BAC/snapshot", "http://www.foxbusiness.com/industries/2015/07/15/blackrock-beats-on-bottom-line/?intcmp=bigtopmarketfeaturesside", "http://quote.foxbusiness.com/symbol/USB/snapshot", "http://www.foxbusiness.com/industries/2015/07/15/us-bancorp-profit-revenue-fall/?intcmp=marketfeatures", "http://twitter.com/home?status=Look%20what%20I%20found%20on%20BaltimoreJewishLife.com!%20", "http://www.foxbusiness.com/industries/2015/07/15/bank-america-profit-rises-on-lower-legal-costs/?intcmp=bigtopmarketfeatures", "https://twitter.com/share", "http://www.foxbusiness.com/markets/2015/07/15/oil-falls-on-prospect-higher-iranian-exports/", "http://www.foxbusiness.com/industries/2015/07/15/delta-air-lines-beats-second-quarter-profit-views/?intcmp=bigtopmarketfeaturesside", "http://quote.foxbusiness.com/symbol/NFLX/snapshot", "http://quote.foxbusiness.com/symbol/DAL/snapshot"], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T11:48:43.000+03:00", "highlightTitle": ""}