{"organizations": [], "uuid": "7fc16590cf7d44b9df889f8f0d9d09960cdc46ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/20/102848151-GettyImages-481405970.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss/rss.html", "section_title": "Finance", "url": "http://www.cnbc.com/2015/07/21/paypal-ceo-time-to-democratize-the-banking-system-commentary.html", "country": "US", "title": "PayPal CEO: Time to democratize the banking system—commentary", "performance_score": 1, "site": "cnbc.com", "participants_count": 14, "title_full": "PayPal CEO: Time to democratize the banking system—commentary", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T03:00:00.000+03:00", "replies_count": 20, "uuid": "63ebb536935d153276a79fdb450335d5be4fc7aa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2015/07/21/paypal-ceo-time-to-democratize-the-banking-system-commentary.html#post-0", "ord_in_thread": 0, "title": "PayPal CEO: Time to democratize the banking system—commentary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One way to understand human progress is to look at how technology has made products and services – once reserved for the elite – progressively more accessible and affordable. Personal and mobile computing, long-distance communications, energy storage and air travel are just a few of the things that have been democratized by technology, creating new possibilities for billions of people.\nHowever, financial services is one area where democratization is still far from reality both in the United States and globally. For the truly affluent, checking is free, credit is plentiful and cheap, and fees for dipping below an account balance minimum are seldom a concern. But for everyone else, managing and moving money comes at a price. In the United States, for example, it can cost around $60 a year to maintain a checking account, $3 or more to make an ATM cash withdrawal, and $30 per transaction if you bounce a check.\nGetty Images PayPal President and CEO Dan Schulman speaks before ringing the bell at Nasdaq on July 20, 2015 in New York City. The cost of money rises dramatically if you can't afford to keep it in a bank. Not long ago, I spent a week using only what the banking industry calls \"alternative financial services,\" relying on check-cashing offices and wire-transfer companies to support my daily finances. The results were deeply dispiriting. Accessing my own money became a part-time job, and the price of each transaction meant my checks yielded less than their value and my bills cost more than they should have.\nWhat, for me, was only an eye-opening experiment is an everyday fact of life for the 2 billion adults around the world who lack access to basic financial services. The simplest transaction – receiving a paycheck, paying bills or sending money to a loved one – can be distressingly inconvenient and disproportionately expensive.\nRead More Is Wall Street pay too high?\nNot only is this is manifestly unfair, but it is economically counterproductive. Numerous studies make clear that when people achieve \"financial inclusion\" – defined by the World Bank as having a bank account and using it at least twice a month – they are more likely to start new businesses and invest in education. A growing body of research indicates that financial inclusion has a positive impact on economic growth and can help reduce income inequality.\nToday, financial services is primed for the same technological transformation that has revolutionized many other industries. The digitization of money, the rapid proliferation of Internet access and mobile phones have created the perfect conditions to make it easier and cheaper to save, spend, give, and borrow.\nThe ability to connect people to affordable financial services anywhere and at any time promises to be more than a transformation for the unbanked in emerging economies.\nRead More Will the dollar foil the Fed's rate-hike plans?\nMoreover, history demonstrates that living standards almost always rise when new technologies streamline how people connect to the things they need or want. By making financial services universally affordable and accessible, we have the chance to extend financial citizenship to billions of people worldwide, giving them greater control of their economic destiny and new ways to create opportunities for themselves, their families, and their communities.\nWe cannot rely solely on governments and non-profits to address the social needs around us. Those of us in positions of leadership in the business and technology community have the obligation to take action and do our part. And, in doing so, we can be both consumer and shareholder friendly by re-imagining what could be — and creating opportunities for real social change.\nSo, what will it take to create a fair and equal financial system that makes financial services universally accessible and truly inclusive? As companies, governments, nonprofits, and foundations around the globe grapple with this question, the answer must be built on three principles.\nFirst, it will take open, easy access to digital financial systems and networks. Although mobile devices are now nearly universally available, we still need to close infrastructure gaps in remote and underdeveloped regions where people still lack access to communications networks. We'll also need to support efforts to provide everyone with a reliable digital ID to use for financial transactions.\nRead More Time to 'aggressively' buy big banks\nSecond, we must guarantee safe and secure digital transmission for all transactions. Whether someone is paying a local bill or sending money to family in another country, they have to be able to do so with complete confidence that their money and personal information are protected.\nAnd third, we must broaden the basic concept of financial inclusion to include equitable and affordable financial participation in the economy. Full financial citizenship means more than just a savings account and a way to transfer money and pay bills. It also requires access to credit, along with the ability to accept payments and run a business, send money to family or transact business across borders, contribute to the community and help others in need, and invest for the future.\nWorking through all of the technical, economic and regulatory barriers to make this all possible will require clarity of purpose and an unusual degree of public and private collaboration across the financial and business sectors.\nBut it can be done — and the effort will be worth it.\nPeople work hard for their money, and they want to be treated fairly and equally, regardless of how much they earn, save, or spend. The good news is that the technology platforms exist to create regional and global financial systems that are fair, safe, and universally accessible. As the private and public sectors work together to extend affordable financial services to all, the benefits and progress we can achieve for people globally will be enormous.\nCommentary by Dan Schulman, president and CEO of PayPal. In 2014, he was appointed to lead the digital payments company – which listed on Nasdaq this week – into its next chapter as an independent business. Follow him on Twitter @Dan_Schulman .", "external_links": ["http://www.twitter.com/Dan_Schulman"], "published": "2015-07-21T03:00:00.000+03:00", "crawled": "2015-07-21T23:15:14.151+03:00", "highlightTitle": ""}