{"organizations": [], "uuid": "87e6b1d3c9a6493ff815df9acb38990f07f5c087", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=12833_4517.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/settling-down-or-ramping-up-99061/", "country": "US", "title": "Settling Down or Ramping Up? Intercreditor Dynamics on Unitranche Transactions", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Settling Down or Ramping Up? Intercreditor Dynamics on Unitranche Transactions", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T00:32:00.000+03:00", "replies_count": 0, "uuid": "87e6b1d3c9a6493ff815df9acb38990f07f5c087"}, "author": "Dentons", "url": "http://www.jdsupra.com/legalnews/settling-down-or-ramping-up-99061/", "ord_in_thread": 0, "title": "Settling Down or Ramping Up? Intercreditor Dynamics on Unitranche Transactions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Settling Down or Ramping Up? Intercreditor Dynamics on Unitranche Transactions more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=b6b3bd02-51c5-4681-b722-edbf6c435a53\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nWith sub-investment grade borrowers increasingly drawn to the higher leverage, more flexible terms and speed of execution offered by the Unitranche solution, its continued popularity in the mid-market shows no sign of abating. \nUnitranche, as the name suggests, describes leveraged transactions (acquisition financings, refinancings or recapitalisations) where the term debt is all provided in a single non-amortising tranche. This note looks at the intercreditor dynamics at play in Unitranche financing transactions, particularly between the key secured parties: the RCF lenders, who are providing ongoing working capital to the borrower; the Unitranche lender(s), providing the term debt; and the hedging banks. \nRanking and enforcement proceeds \nThe starting point is that all the secured parties rank pari passu subject to two key exceptions. \nFirst, given their deal economics and relative size within the capital structure (typically 10-15 per cent.), the RCF lenders have super senior priority over enforcement proceeds and any other payments received while the borrower is in default. Typically a certain amount of hedging debt will also be afforded super senior status (see below). \nSecondly, looking at the pre-enforcement position, Unitranche providers are generally paid out first from disposal proceeds not applied in mandatory prepayment, provided the borrower is in compliance with certain financial metrics. On the flipside, often the RCF lenders are successful in achieving first rights to insurance proceeds. \nHedging debt \nThe amount of non-speculative hedging debt permitted to have super senior status varies from deal to deal but will be subject to a cap. Remaining hedging exposures will rank pari passu with the Unitranche or even be unsecured. Hedging banks do not have voting rights unless and until the hedge is closed out. \nEnforcement of security \nThe majority Unitranche providers control the enforcement process subject to certain independent enforcement rights of the RCF lenders which are triggered on a \"material event of default\" where either: the majority Unitranche providers have failed to give the Security Trustee enforcement instructions within a specified standstill period, usually 60-90 days for non-payment and 120-180 days for other defaults; or the majority Unitranche providers have taken enforcement action which has not resulted in the successful discharge of the RCF debt within a specified standstill period (usually six months). \nWhat constitutes a \"material event of default\" is subject to a degree of negotiation. The definition will typically include non-payment, breach of financial covenant, insolvency and failure to comply with those amendments or waivers that require majority RCF lender approval (e.g. changes to the financial covenants). \nOption to purchase and value protection \nThroughout the relevant standstill periods, the Unitranche lenders have the right, upon notice, to buy out the RCF debt at par along with any super senior hedging debt in the structure. \nUnitranche lenders also benefit from value protection provisions, now standard in the European leveraged finance market, which require distressed disposals to be made pursuant to a court process, a competitive sales process or with a fairness opinion from a financial adviser. \nAgreement among lenders \nIn transactions involving more than one Unitranche provider, there is normally an agreement among lenders (to which the borrower is not a party), regulating the relationship between the so-called \"first-out\" and \"last-out\" Unitranche providers. Under this arrangement, the blended interest rate and other economics paid by the borrower are allocated disproportionately between the Unitranche providers, who in turn accept a different risk position vis-à-vis enforcement proceeds. Enforcement is typically controlled by the \"first out\", subject to certain step-in and buy-out rights of the \"last-out\". \nLooking ahead \nThese dynamics are likely to become more settled, with RCF lenders seeking to agree common intercreditor terms with Unitranche providers they work with regularly. However, as capital structures on these transactions become more bespoke, some areas of uncertainty are likely to remain, in particular: What rights will asset-based lenders or providers of invoice discounting facilities have in these structures? Will they rank ahead of the RCF lenders for certain pools of assets? Will they have separate step-in rights on enforcement? Is there scope for a second lien or other junior debt to be interposed into these capital structures to provide additional leverage and, if so, what intercreditor rights will these lenders have? In transactions with more than one Unitranche provider, will sponsors in the European market continue to accept a lack of visibility on the agreement among lenders? Or will they expect the key terms of this agreement (in particular who is controlling enforcement) to be included in the intercreditor agreement?", "external_links": [], "published": "2015-07-09T00:32:00.000+03:00", "crawled": "2015-07-09T00:45:35.000+03:00", "highlightTitle": ""}