{"organizations": [], "uuid": "3752749feaaee61728bcef61b27de785b0e5855e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/30/google-france-idUSL5N10A52V20150730", "country": "US", "title": "Google refuses French request to apply right to be forgotten globally", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Google refuses French request to apply right to be forgotten globally | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T20:00:00.000+03:00", "replies_count": 0, "uuid": "3752749feaaee61728bcef61b27de785b0e5855e"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/30/google-france-idUSL5N10A52V20150730", "ord_in_thread": 0, "title": "Google refuses French request to apply right to be forgotten globally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* French watchdog wants Google to scrub web results worldwide\n* Follows EU court ruling establishing \"right to be forgotten\"\n* Google sticks to position that ruling only applies in Europe\nBy Julia Fioretti\nBRUSSELS, July 30 (Reuters) - Google Inc is refusing to bow to an order from the French privacy watchdog to scrub search results worldwide when users invoke their \"right to be forgotten\" online, it said on Thursday, exposing itself to possible fines.\nThe French data protection authority, the CNIL, in June ordered the search engine group to de-list on request search results appearing under a person's name from all its websites, including Google.com.\nThat stemmed from a ruling in May last year by the European Court of Justice that European residents can ask search engines, such as Google or Microsoft Corp's Bing, to delete results that turn up under a search for their name when they are out of date, irrelevant or inflammatory, the so-called right to be forgotten.\nGoogle complied with the ruling and has since received more than a quarter of a million removal requests, according to its transparency report. It has accepted about 41 percent of them.\nHowever, it has limited removals to its European websites, such as Google.de in Germany or Google.fr in France, arguing that over 95 percent of searches made from Europe are done through local versions of Google.\nIn a blog post on Thursday, the U.S. company said it believed no one country should have the authority to control what content someone in a second country can access.\n\"As a matter of principle, therefore, we respectfully disagree with the CNIL's assertion of global authority on this issue and we have asked the CNIL to withdraw its formal notice,\" wrote Peter Fleischer, Google's global privacy counsel.\nThe CNIL had said the company could face fines, albeit small compared with Google's turnover, if it refused to comply with the order.\nGoogle warned that applying the right to be forgotten globally would trigger a \"race to the bottom\" where \"the Internet would only be as free as the world's least free place\".\nIts stance was upheld in February by a group of experts appointed by the company to guide it on how to apply the landmark ruling.\nHowever, European regulators and some legal experts think Google ought to apply the ruling globally as it is too easy to circumvent it by switching from one version of Google to another. (Editing by David Holmes )", "external_links": [], "published": "2015-07-30T20:00:00.000+03:00", "crawled": "2015-07-30T19:04:37.534+03:00", "highlightTitle": ""}