{"organizations": ["ELSS", "PPF", "Insurance Regulatory and Development Authority of India"], "uuid": "dffb2fd5466de27e1928a5736de8d720ec7211ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/36", "section_title": "Artipot: Business > Financing Articles", "url": "http://www.artipot.com/articles/1909614/knowing-about-the-stems-of-tax-saving-plant.htm", "country": "US", "title": "Knowing about the stems of tax saving plant (Gaurav Kadam)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Knowing about the stems of tax saving plant (Gaurav Kadam)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T10:03:00.000+03:00", "replies_count": 0, "uuid": "dffb2fd5466de27e1928a5736de8d720ec7211ce"}, "author": "", "url": "http://www.artipot.com/articles/1909614/knowing-about-the-stems-of-tax-saving-plant.htm", "ord_in_thread": 0, "title": "Knowing about the stems of tax saving plant (Gaurav Kadam)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Gaurav Kadam Jul 5, 2015 A sigh of relief has been offered by the Union budget for taxpayers by recommending an increase in the deduction limits from existing 1 to 1.5 lakhs. The government thinks that the disposable income of the middle class has eroded due to persistent inflation and there is a strong case for providing some tax relief for this section of the society. So, you can now save taxes by using some of the popular options given below: PPF Public Provident Fund (PPF) has always been a lucrative tax saving plan option for the investors. As per the government announcement the annual investment limits under PPF scheme has now been increased to 1.50 Lakhs. The profit lies in the fact that the interest is compounded annually on the principal amount. And, upon maturity you will receive almost double of the principal paid towards PPF. The maturity amount is tax-free which is like an icing on the cake. It offers investors a high flexibility unlike other tax-saving instruments. A PPF account can be opened in any bank or in the post office. You can either pay a lump sum of Rs 1.50 lakhs or opt for installments. However, you need to invest atleast Rs 500 annually to keep your account operational. Otherwise, you will have to pay a penalty of Rs 50 to re-activate your account. A PPF account matures in 15 years, but you can increase the tenure in blocks of 5 years, post maturity period.ULIPsUnit Linked Insurance Plans (ULIPs) are the modern day investment vehicles running on the wheels of dual benefits of investment in the capital markets along with insurance. The new guidelines implemented in 2010 for ULIPs, has now made it easier to invest in them. Compared to the direct mutual fund investments, ULIPs have become more affordable now. However, to gain the desired corpus from ULIPs, you need to hold your account for atleast 10 to 12 years. ELSS Among all the tax saving plans the most eye catching investment for medium term period is (Equity linked Savings Scheme) ELSS that offers the minimum lock-in period of just 3 years under 80C tax savings. Compared to regular equity funds where the minimum limit of investment is Rs 5000, the ELSS offers a respite with a minimal balance of Rs 500. To reap good benefits, you should invest money in ELSS funds on a regular, installment basis.SCSS(Senior Citizen Savings Scheme) SCSS offers ideal tax saving plan with guaranteed returns for senior citizens. However, benefits are limited due to an upper limit of Rs 15 Lakhs. Interest amounts are generated four times every year on 30th June, 31st March, 31stDecember and 30th September.FDs or NSCs Even the high interest rates on (Fixed Deposits) FDs after five years don't make them an interesting option because the interest amount is completely taxable. So, for those who fall under the tax brackets of 20% to 30%, it is not an attractive option, as the PPF.NPS An affordable, feature rich and easy best tax saving plan can definitely be described as (National Pension Scheme) NPS. You need to invest a minimum amount of Rs 6000, which can be done in easy installments of Rs 500 each. As an investor you decide how much of the payment will go towards equity, gilts, or corporate bonds.Life Insurance PlansLife insurance is the most effective tax saving options in the modern era. As per the Insurance Regulatory and Development Authority of India (IRDAI) guidelines, customers can reap good benefits from life insurance plans. The good news in the health insurance sector is that a relief is provided in the form of tax exemption (on expenditure on health care) being raised from Rs 15,000 to Rs 20, 000 and Rs 30,000 in case of senior citizen thereby improving the affordability, accessibility and awareness of health insurance About the Author", "external_links": [], "published": "2015-07-05T10:03:00.000+03:00", "crawled": "2015-07-05T16:51:58.000+03:00", "highlightTitle": ""}