{"organizations": [], "uuid": "2b3a2a80e0c47a68c69d581ff236563aec17e355", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2014/06/LARSEN-RE-L-e1437966832143.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/companies/larsen-toubro-posts-over-37-pct-slide-in-q1-profit/111536", "country": "IE", "title": "Larsen & Toubro criticises ‘unhurried’ reform pace as profit slides by 37 pct", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Larsen & Toubro criticises ‘unhurried’ reform pace as profit slides by 37 pct | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T00:33:00.000+03:00", "replies_count": 0, "uuid": "2b3a2a80e0c47a68c69d581ff236563aec17e355"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/companies/larsen-toubro-posts-over-37-pct-slide-in-q1-profit/111536", "ord_in_thread": 0, "title": "Larsen & Toubro criticises ‘unhurried’ reform pace as profit slides by 37 pct", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Vedanta Resources Q1 operating profit falls 38% to $644.6 mn Govt to infuse additional Rs 800 crore into Air India 'NGOs' acting at behest of foreign tobacco firms: ITC chief Y C Deveshwar Industrial giant Larsen & Toubro Ltd criticised on Friday the “unhurried pace” of government reforms for weakening investment in its home market, as it reported a 37 percent slide in first-quarter profit.\nLarsen, which makes everything from metro train lines to gas pipelines to parts for submarines, has been hoping for a rebound in India after several years of sluggish demand for its goods.\nThe Mumbai-based company, which is viewed as a bellwether for the Indian economy, said in a statement that an improved fiscal deficit and lower interest rates should eventually support business, but that the investment climate remained subdued because of “global uncertainties and unhurried pace of reforms in India.”\n“The speed and scale of the reforms that is required to push this trajectory into an investment-rich momentum is of a much higher order than what is currently on display,” chief financial officer, R. Shankar Raman, told reporters.\nIndian companies have looked to the government of Prime Minister Narendra Modi , who was elected last year, to kick-start the economy by clearing stalled projects and bureaucratic delays that had slowed the investment cycle.\nModi this year unveiled a big splurge on public infrastructure, hoping it would soon be leveraged by private funds to fire up the economy. But Larsen said private investment continued to be constrained by weak demand, low commodity prices and spare capacity.\n“The private sector today is in a very difficult situation … It has soft demand, capacity underutilised, it has stretched balance sheets and generally, the supply chain is liquidity constrained,” said Shankar Raman.\nHe said orders from public sector companies had increased during the quarter as their balance sheets strengthened.\nThe company reported a net profit of 6 billion rupees ($93.6 million) for the three months ended in June, lower than last year’s 9.67 billion rupees, although those numbers were supported by gains from a series of divestments.\nThe company said revenue grew 7 percent year-on-year, led by its infrastructure and power businesses. Larsen maintained its guidance for growth in revenue and order inflow for the full-year at 15 percent.\nLarsen also said on Friday that it was proposing to sell up to 15 percent of the shares it holds in Larsen & Toubro Infotech Ltd., its information technology services unit.\nShares in the group closed up 1 percent on Friday, underperforming the\nFirst Published on July 31, 2015 4:33 pm", "external_links": [], "published": "2015-08-01T00:33:00.000+03:00", "crawled": "2015-07-31T18:22:30.391+03:00", "highlightTitle": ""}