{"organizations": [], "uuid": "d90c0c5e4f8a332f96fcf1116f92710655324bef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/06/monsoon-farmer-APs.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/commodities/monsoon-revival-signals-bumper-crop/110465", "country": "IE", "title": "Monsoon revival signals bumper crop", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Monsoon revival signals bumper crop | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T16:16:00.000+03:00", "replies_count": 0, "uuid": "d90c0c5e4f8a332f96fcf1116f92710655324bef"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/commodities/monsoon-revival-signals-bumper-crop/110465", "ord_in_thread": 0, "title": "Monsoon revival signals bumper crop", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Gold prices head for longest weekly losing streak in 16 years Oil prices fall on OPEC comments; investors await US wage data Govt sets 30-MT rice procurement target A ‘strong’ El Nino notwithstanding, fears of the country suffering a second consecutive drought year — something that was a distinct possibility till two weeks ago — appear to have been laid to rest.\nThe monsoon’s impressive revival since mid-July, after a disastrous first half that appeared to bear El Nino’s imprint, has generated optimism about this year’s kharif harvest.\n“We are seeing signs of a farm sector production recovery. Right now, the pattern of rainfall and sowing area coverage is almost similar to that of 2013-14, which was a bumper crop year,” said J S Sandhu, Agriculture Commissioner and Deputy Director-General (Crop Science) of the Indian Council of Agricultural Research.\nThings seemed far more bleak a fortnight ago. The south-west monsoon began well, with June recording almost 16 per cent country-wide surplus rainfall relative to the long period average for the month. Farmers could, hence, undertake planting sufficiently early, unlike last year when the monsoon rains were 42 per cent deficient in June.\nBut what followed was an extended dry spell. As the first half of this month received nearly 33 per cent below normal precipitation, it brought back memories of 2002. That year, India registered a 9.4 per cent monsoon surplus in June, only to be neutralised by a 54.2 per cent deficit in July. The fact that it was an El Nino year like the present one only fuelled fears of a repeat which, this time around, would have translated into a back-to-back drought, last witnessed in 1986-1987 and 1965-1966.\nThose fears have ebbed for now. Although July has so far had 14.5 per cent below-normal precipitation — in line with the Met department’s forecasts — the second half turnaround (see table) has given a fresh impetus to plantings, apart from breathing life into the already-sown crop that was experiencing severe moisture stress.\nThe threat of drought is currently confined mainly to the contiguous stretch covering Marathwada, north Karnataka, Rayalaseema and parts of Vidarbha and Telangana. “In most parts, the sowing progress has been good and the crops are in vegetative growth stage. Rains are still required, especially at the time of flowering from mid-August,” said Sandhu.\nThe monsoon’s timely revival is also significant since it comes ahead of the Reserve Bank of India’s next monetary policy review scheduled on August 4. It could be just the trigger for a cut in policy interest rates beyond the usual 25 basis points.\nEl Nino ghost exorcised for now\nThat in agriculture ‘when’ rather than ‘how much’ it rains is what matters has been clearly borne out this time.\nThe south-west monsoon’s good start and its covering the whole of India three weeks before the scheduled time of July 15 induced farmers to take up early sowings.\nAn estimated 80 per cent of soyabean planting in Madhya Pradesh (MP), for example, was completed by June 25. This was also true for most other kharif crops, from groundnut, bajra and maize to pulses. During June 1 to June 24, the country’s overall area-weighted rainfall was almost 24 per cent more than the ‘normal’ long period average for this period.\nThe following three weeks, however, witnessed a dry spell. Between June 25 and July 15, the rains were over 25 per cent below normal. Regions such as west MP, Gujarat, Saurashtra and the South Peninsula, which had recorded surplus rainfall in June, slipped significantly into deficit territory by mid-July. All the hard work by farmers, desperate to recover from last year’s disastrous kharif as well as rabi crop failures, seemed to come to naught. The worst fears of El Nino — an abnormal warming of the equatorial eastern Pacific waters associated with monsoon failures in India — rearing its ugly head were apparently being confirmed. This was more so with most global agencies predicting this year’s El Nino to be on par, if not stronger, than the record one of 1997.\nThat gloomy prospect has, however, been averted for now, with the monsoon staging a revival over the past couple of weeks. “We practically had no rains from around June 25 to July 16. In some areas of west MP like Neemuch and Mandsaur, it looked as though farmers would have had to sow afresh, given the moisture stress faced by crop that was already planted. That, however, did not happen, as it has been raining incessantly in the past 10 days or more,” says Rajesh Agarwal, past-chairman of the Indore-based Soyabean Processors Association of India.\nThe same story — of the monsoon making a comeback just in the nick of time — holds for groundnut in Gujarat’s Saurashtra region. A bumper crop and below minimum support price realisations in 2013 led farmers there to plant more cotton last year. But with kapas prices falling while rising in the case of groundnut, they switched back to the latter this time.\n“Much of their sowing was done during June 15-20 because of the monsoon’s early arrival. But then, we had this long dry spell well into mid-July, which thankfully has been broken with the good showers in the second half,” points out BV Mehta, executive director, Solvent Extractors’ Association of India.\nThe most heartening feature of the current monsoon so far has been the excellent rains — and at the right time — across Rajasthan, Gujarat and MP, giving a huge boost to sowing of kharif pulses (especially moong and urad), oilseeds (groundnut, soyabean and sesamum) and coarse cereals (bajra and maize). This has helped offset the deficient rainfall in Maharashtra (particularly Marathwada) and northern Karnataka.\n“We have not had any rains here after June 20,” notes Ashok Kumar Kagi, a trader from Gulbarga, which along with Bidar, Bijapur, Yadgir and Raichur in northern Karnataka is a major tur or pigeon pea-growing belt . According to him, the progress of sowing has been very poor so far, “though the window for it is still open till the second week of August”.\nMaharashtra, likewise, has not had a good monsoon, which could have implications for this year’s pulses crop. Latur, Nanded, Osmanabad, Parbhani and Hingoli in Marathwada are major producers of urad (black gram), while Amravati, Akola, Buldhana, Washim and Yavatmal in Vidarbha grow lot of moong (green gram).\n“The rains over the past one week have given jeevandan (lease of life) to pulses in parts of Vidarbha. But that may not be enough. The situation is Marathwada is even worse,” feels Chandrakant Mishra, who supplies weather and crop status updates to traders via SMS alerts from Akola.\nBut lower production from Maharashtra and Karnataka may be offset through likely bumper harvests in Rajasthan, which has reported a near doubling of area under pulses this time. Moong and urad are relatively short duration (80-90 days) crops, which would start arriving in the markets from September.\n“On the whole, this has turned out to be a good monsoon so far, contrary to general expectations fueled by El Nino fears. The rains have been well distributed, thereby enabling timely sowing, which did not happen last year,” observes S Chandra, director of Indian Society of Agribusiness Professionals, a farm extension consultancy.\nThe already sown kharif crops are now mostly at the vegetative growth stage that falls between germination and flowering. “The June and July rains have ensured good progress of the sowing and vegetative growth stages. August rains are equally important, as we enter flowering that will start in about a fortnight’s time,” adds Chandra.\nWhether El Nino could a bearing on the monsoon’s performance in August remains to be seen. What is holding out hope is the prospect of a “positive” Indian Ocean Dipole (IOD) event that could help neutralise a “strong” El Nino, as it happened in 1997.\nThe Australian Weather Bureau, in its latest update, has said that a positive IOD event — which involves the western Indian Ocean becoming unusually warmer relative to the waters in the eastern part off Indonesia and Australia, thereby leading to greater precipitation in the former region — “remains possible”.\n 30, 2015 8:16 am", "external_links": [], "published": "2015-07-30T16:16:00.000+03:00", "crawled": "2015-07-31T08:28:02.261+03:00", "highlightTitle": ""}