{"organizations": ["Competition Commission of India", "AEGON", "IRDAI", "AEGON Asia", "Foreign Investment Promotion Board", "AEGON Religare Life Insurance", "AEGON Asia AEGON", "AEGON Asia Q&A", "BCCL"], "uuid": "9bee19b1936c8f95b3640e715b0bdd59f20c3181", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-07/28/full/1438056759-3625.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/we-will-be-one-of-the-first-insurers-to-hike-stake-to-49-aegon-asia-chairman-115072800160_1.html", "country": "IN", "title": "We will be one of the first insurers to hike stake to 49%: AEGON Asia chairman", "performance_score": 0, "site": "business-standard.com", "participants_count": 0, "title_full": "We will be one of the first insurers to hike stake to 49%: AEGON Asia chairman", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T07:23:00.000+03:00", "replies_count": 0, "uuid": "9bee19b1936c8f95b3640e715b0bdd59f20c3181"}, "author": "", "url": "http://www.business-standard.com/article/finance/we-will-be-one-of-the-first-insurers-to-hike-stake-to-49-aegon-asia-chairman-115072800160_1.html", "ord_in_thread": 0, "title": "We will be one of the first insurers to hike stake to 49%: AEGON Asia chairman", "locations": ["Hungary", "Netherlands", "Asia", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Irdai", "Douglas Henck", "Modi", "M Saraswathy"], "text": "http://mybs.in/2Rx4Qge   We will be one of the first insurers to hike stake to 49%: AEGON Asia chairman Q&A with Douglas Henck, chairman and CEO, AEGON Asia Q&A with Douglas Henck, chairman and CEO, AEGON Asia AEGON, one of the world’s leading financial services organizations which is present in India through its insurance joint venture AEGON Religare Life Insurance, expects to be one of the first insurance players to increase its stake to 49% in the company. In an interview with M Saraswathy, Douglas Henck, chairman and CEO, AEGON Asia talks about their stake hike plans and future strategy. Edited excerpts: With the new Insurance Act coming into force, at what stage are your plans of hiking your stake in the life insurance JV? I anticipate that we will be one of the first companies to go up to 49 % (in foreign direct investment). We have already made the application and have gotten approval from Competition Commission of India (CCI). The Foreign Investment Promotion Board hearing is on Friday and we are already on the agenda. Further, the regulatory authorities have also received the necessary documents. Was the 'Indian management control' provision a dampener? I would give the Modi government full marks to have had the Insurance Act early on its agenda and getting it passed. But, we were surprised that the Indian management and control provision was added in at the last moment. However, we are already Indian-managed and -controlled. We have a board of directors and there are three Westerners while the rest six are Indians. In our company, too, we have only one Westerner among the 1,000-plus employees. In the top leadership team, there are none. After AEGON goes to 49%, the Indian partner will still have 51%. After Religare exits the company, will there be any change in the way business is done? As a practical matter, the way we are operating the company today would not change the way we are operating it tomorrow. The name will be changed in due course. Only the shareholding pattern will change once Religare exits and BCCL takes up their stake. AEGON Religare has been known for its online products. Will that be the strategy going forward? There is a strategy to be a leader or be everyone else. There are people who have come in and undercut us with respect to pricing. But the industry says that we are better. No one is close to us with respect to the number of products we offer or the quality of products and services that we offer. We have well over 90% cent persistency rates in the online space, because these customers stay with us. When we improved our product when competition came in, when we launched it so that existing customers would be upgraded to the new product. Most of it is protection, but it will change. We have started making some headway in the online Ulip space as well, since it is a good product for the consumer. How important a market is India for AEGON? Asia and India are very important markets for us. In India, we are not big enough and need to be bigger. Though we were late coming in, we have already been established as the first digital insurance company and the first online company. Everywhere, not just in India, the digital landscape will transform the way business is done. What we are doing in India will also help us in the mature economies because we are doing it so well. Are you planning to enter general insurance in India? We have general insurance businesses in markets like Netherlands and Hungary. There are some products sold in general insurance that overlap with life including health and personal accident and we are interested in those. But as far as fresh entry into general insurance by setting up a JV company is concerned, we will not be interested in that. If a customer wants these products, we can source it, but won't manufacture them. India has been known to be a tough regulatory environment for insurance. Do you agree? Opening up of the insurance market in 2000 lead to a fundamental shift in regulations. In several areas, the Indian regulator has managed it better here than other countries. For example, in some countries, foreign insurers are regulated differently than domestic companies. Here, Irdai has managed it well. Further, in issues like corporate governance and health of the industry, IRDAI has been more attuned than others (regulators in other countries). Where all regulators are struggling today is the question of just how deeply do they get involved in the day to-day decisions of the insurance industry. In India, they aren't necessarily more intrusive or less intrusive than others. But my personal view is that regulators should allow the market to do a lot of these things. Insurance penetration and density has been on the decline. Is that a concern? The low insurance penetration can either be seen as a problem or opportunity, because it will go up. If you look at GDP and your population, there are still a lot of people who are not as actively engaged in the economy as others. As people starts moving up the ladder as their income levels rise, the first insurance that will be brought would be general insurance. Life insurance will come in later. Insurance penetration and density will go up since the poor will continue to go up to the middle class and the middle class will have better access. There are some short-term measures like the government-insurance schemes that have been launched. At present, it is a little bit of a superficial calculation and hence it will go up.", "external_links": [], "published": "2015-07-28T07:23:00.000+03:00", "crawled": "2015-07-28T07:46:39.671+03:00", "highlightTitle": ""}