{"organizations": [], "uuid": "4614ca30eb323fccf4dc0e56b07b1c23c453adc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/09/usa-chicago-pensions-idUSL1N0ZP0YA20150709", "country": "US", "title": "UPDATE 1-Judge to rule July 24 on Chicago pension reform law", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Judge to rule July 24 on Chicago pension reform law | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T23:50:00.000+03:00", "replies_count": 0, "uuid": "4614ca30eb323fccf4dc0e56b07b1c23c453adc2"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/09/usa-chicago-pensions-idUSL1N0ZP0YA20150709", "ord_in_thread": 0, "title": "UPDATE 1-Judge to rule July 24 on Chicago pension reform law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts with date for ruling, oral arguments)\nBy Karen Pierog\nCHICAGO, July 9 (Reuters) - An Illinois judge said on Thursday she will rule July 24 on the constitutionality of a 2014 state law aimed at shoring up two financially ailing Chicago pension funds.\nCook County Circuit Court Judge Rita Novak made the announcement after attorneys for the city and its municipal and laborers' pension funds, as well as lawyers for city unions and retirees challenging the law, held more than two hours of oral arguments.\nNovak said there are \"very significant issues\" in the case and that she is \"fully aware of the implications\" her ruling will have for all the parties.\nThe law, which took effect Jan. 1, requires Chicago and affected workers to increase their pension contributions and replaces an automatic 3 percent annual cost-of-living increase for retirees with one tied to inflation. Those increases are also skipped in some years.\nOpponents of the law based their challenge on the Illinois Supreme Court's May 8 unanimous ruling in a case involving a 2013 law cutting benefits for state pension funds. The high court found the Illinois constitution gives public sector workers iron-clad protection against pension benefit cuts.\nStephen Patton, the city's top staff attorney, argued the 2014 law actually ensures city pensions and pensioners will be better off.\n\"Without (the law) these funds will run out of money and benefits promised will not be paid,\" he said.\nThe city contends if the law is voided, the two pension systems would run out of money within 10 to 13 years and that under Illinois law, payments to retirees would be the obligation of the pension funds, not Chicago.\nBut Judge Novak noted the city had been making payments to the funds before the law took effect and questioned if the law only changed the funding formula to an actuarial basis.\nMichael Freeborn, an attorney for unions and retirees, said the bottom line is that pensions will be unconstitutionally diminished and that affected workers and retirees did not agree to the law.\n\"They (the city and state) want to put pension back in the game of political football,\" he said.\nPension obligations are weighing on Chicago's finances and its credit ratings. Moody's Investors Service in May lowered the city's rating to junk. Standard & Poor's on Wednesday cut the rating to the low-investment-grade level of BBB-plus because of a chronic structural deficit.\nThe losing side in Judge Novak's ruling will appeal, leaving the high court once again to render an ultimate decision.\n(Reporting By Karen Pierog; Editing by Cynthia Osterman and Steve Orlofsky)", "external_links": [], "published": "2015-07-09T23:50:00.000+03:00", "crawled": "2015-07-09T22:57:59.000+03:00", "highlightTitle": ""}