{"organizations": [], "uuid": "cd668293c39bb14147718f8929caf9e708de77a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nz.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/deJW9VU2fCOAwc7gLIfB7Q--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/FIN_ANZ_AAP_ART_FTP_LIVE_1/20150710001154166775-original_1280x720_original.jpg", "site_section": "https://nz.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Latest business and finance news from New Zealand and the world's key markets - Yahoo New Zealand Finance", "url": "https://nz.finance.yahoo.com/news/airbus-electric-plane-crosses-channel-082408626.html", "country": "US", "title": "Airbus electric plane crosses Channel", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Airbus electric plane crosses Channel", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T11:24:00.000+03:00", "replies_count": 0, "uuid": "cd668293c39bb14147718f8929caf9e708de77a4"}, "author": "", "url": "https://nz.finance.yahoo.com/news/airbus-electric-plane-crosses-channel-082408626.html", "ord_in_thread": 0, "title": "Airbus electric plane crosses Channel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nAn Airbus electric plane has crossed the English Channel from Britain to France, claiming the record for the first such crossing but the event was marred by controversy over the cancellation of a rival flight. \nTest pilot and designer Didier Esteyne landed Airbus Group's E-Fan 1.0 plane in the French port of Calais on Friday after flying the 74 kilometres from Lydd in south-east England in 37 minutes, setting a \"milestone for the all-electric aircraft technology,\" the company said. \nThe 100th flight by an E-Fan plane echoed the first Channel crossing by French pilot Louis Bleriot in 1909, Esteyne said. \n\"Like so many others in the aviation industry, Louis Bleriot has been a hero and inspiration to me and it gives me great pride that I am able to honour his legacy with the first ever electric-powered Channel crossing,\" he said. \n\"The 10th of July 2015 will now join the list of famous days in aviation history and I'm sure Bleriot would be proud of this achievement,\" said Jean Botti, chief technical officer at Airbus Group. \nFinesse Max, the French distributor for Slovenia-based light-aircraft maker Pipistrel, had planned to fly an electric plane across the channel on Tuesday, said Ivo Boscarol, Pipistrel's general manager. \nBut the flight was cancelled after Siemens claimed a loan agreement for the plane's motor did not cover flights over water and asked the companies to return the motor. \n\"We deeply regret the action of Siemens which prevented the flight,\" Boscarol said, calling the move \"bizarre and incomprehensible.\" @YahooNZBusiness on Twitter, become a fan on Facebook Airbus electric plane crosses Channel AAP \nAn Airbus electric plane has crossed the English Channel from Britain to France, claiming the record for the first …", "external_links": [], "published": "2015-07-11T11:24:00.000+03:00", "crawled": "2015-07-11T16:17:27.000+03:00", "highlightTitle": ""}