{"organizations": [], "uuid": "418353e9a47016f7d5b67c026ee11fa53688aaed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://mw1.wsj.net/MW5/content/images/logos/mw-social-logo.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/why-its-important-for-tv-networks-to-adopt-multiple-platforms-2015-07-14", "country": "US", "title": "Why it’s important for TV networks to adopt multiple platforms", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "Why it’s important for TV networks to adopt multiple platforms - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:00:00.000+03:00", "replies_count": 1, "uuid": "c58b951a334c578cc6e702b22c0d7a2c1fe328aa"}, "author": "By     Trey Williams", "url": "http://www.marketwatch.com/story/why-its-important-for-tv-networks-to-adopt-multiple-platforms-2015-07-14#post-0", "ord_in_thread": 0, "title": "Why it’s important for TV networks to adopt multiple platforms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new report released on Tuesday confirms the trend of video and TV consumers moving away from traditional TV and toward online streaming.\nMedia research and consulting firm, SmithGeiger and Net2TV, a company that helps programmers create online video content, produced the report that looks at the TV and the nonlinear, subscription video on demand (SVOD) ecosystems, and how people are consuming media.\nSmithGeiger and Net2TV The report is the result of a national survey of about 1,000 respondents and found that the amount of time spent streaming video online outweighs the time spent watching live TV.\nOn average, consumers spend eight hours and 15 minutes per week watching video, according to the report. Nearly four hours, or 45%, of the overall time is spent in front of a TV set—two hours of which are spent watching live TV.\nHere’s the breakdown of time spent watching video content on various platforms:\nStreaming Internet via TV: 46 minutes Digital Video Recorder (DVR): 29 minutes Video on demand via TV: 22 minutes Web/computer: two and 1/2 hours Smartphones: one hour and 12 minutes Tablets: 45 minutes. The survey breaks Generation-Y into two age categories of 18 to 24 years old, and 25 to 34 years old. They are the No. 1 and 2 consumers of mobile and computer video, with 67% and 56% of their viewing time conducted via a mobile device or computer. However, the trend was found in respondents aged 35 to 44 years of age, who spent 53% of their viewing time online, and those aged 45 to 54 years of age, who spent 44% of their time.\n“Virtually everyone is a digital consumer at this point,” SmithGeiger Chief Executive Dave Smith said. “This is a watershed moment for live viewing... We tell everybody; you’ve got to get your content on all platforms or your brand will suffer.”\nComcast Corp. CMCSA, -0.75% on Sunday became the latest cable provider to delve into the online streaming market. The company unveiled Stream, a streaming video-on-demand service that it is selling on a subscription basis.\nOne challenge facing many of these new services is persuading advertisers that they can get their ads in front of the right audience. Smith said his firm has found that a network or broadcaster would need revenues of $600 per customer per year to make up for lost advertising dollars.\n“This is a really broad look at the American consumer’s video consumption,” Smith said. “It is an immediate snapshot of where we are right now. A month ago, those numbers would have been much lower, and a month from now they’ll be even more drastic.”\nMore from MarketWatch", "external_links": [], "published": "2015-07-14T03:00:00.000+03:00", "crawled": "2015-07-15T02:09:53.000+03:00", "highlightTitle": ""}