{"organizations": [], "uuid": "396a7b7c8f04f1a4c46991a60d9cabec64260f57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/malloy-could-face-override-fellow-171115440.html", "country": "GB", "title": "Malloy could face override from fellow Connecticut Democrats", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Malloy could face override from fellow Connecticut Democrats", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T20:11:00.000+03:00", "replies_count": 0, "uuid": "396a7b7c8f04f1a4c46991a60d9cabec64260f57"}, "author": "", "url": "https://uk.finance.yahoo.com/news/malloy-could-face-override-fellow-171115440.html", "ord_in_thread": 0, "title": "Malloy could face override from fellow Connecticut Democrats", "locations": ["Connecticut"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malloy"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 10, 2015, 18:19 BST - UK Markets closed Malloy could face override from fellow Connecticut Democrats Gov. Malloy could face 1st real veto override threat from fellow Connecticut Democrats By Susan Haigh, Associated Press | Associated Press – 8 minutes ago Print \nHARTFORD, Conn. (AP) -- Gov. Dannel P. Malloy could face the first real threat of a veto being overridden by his fellow Democrats in the General Assembly. \nWhile no date has been set yet for a legislative veto session and Democratic leaders haven't said whether they'll attempt any overrides, some rank-and-file lawmakers and groups like the state's largest teachers union and University of Connecticut students are among those pushing to overturn some of the nine vetoes issued so far by the second-term governor as of Friday. \nThe Connecticut Education Association this week took to social media, urging its more than 30,000 members to ask their lawmakers to save a bill that created qualifications for the state's education commissioner. The bill had originally passed the Senate unanimously and the House of Representatives on a 138-5 vote. Meanwhile, two Democratic legislators recently issued a rare public rebuke of Malloy and his veto of a bill that would have doubled the number of student members on the UConn board of trustees from two to four. Only one lawmaker voted against the bill. \nKillingly Sen. Mae Flexer called the veto \"both outrageous and unnecessary,\" adding that student membership on the board has remained stagnant for 40 years despite enrollment doubling over that time period. Mansfield Rep. Greg Haddad said Malloy's veto \"ignores\" that tuition and fees are now funding more of UConn's budget than ever before. Students have been contacting lawmakers, urging them to support an override. \nIn his veto message, Malloy said adding two more students \"would alter the balance currently reflected in the makeup of the board of trustees.\" \nAnother of Malloy's vetoes is under fire from a traditional ally: unionized public school teachers. CEA Executive Director Mark Waxenberg said the state's teachers have a \"serious difference of opinion\" with Malloy on whether there should be standard qualifications for the state's education commissioner. The bill had required the next commissioner to have at least a master's degree in an education-related field and at least five years of experience as a teacher and three years as a school administrator. \nWaxenberg said teachers' concerns stem from Malloy's appointment of his first education commissioner, Stefan Pryor, who didn't have a teaching background. He said Pryor, who has since left the administration, could not understand \"the context of public education\" in Connecticut because he was never a teacher. \n\"Unfortunately, it caused frustration among classroom teachers. And Stefan did try to reach out. He went to schools, talked to the teachers and he did the best he could,\" Waxenberg said. \"If you haven't had that experience, it's a very hard thing to grasp.\" \nIn his veto message, Malloy said the legislation \"encroaches on the purview of the chief executive of the state\" to select a candidate he believes is suitable for the position. While proponents of the bill have said Connecticut is one of four states lacking qualifications for their education chief, Malloy contends most states have only minimum age and residency requirements. \n\"The establishment of qualifications for the Commissioner of Education in statute closes the door on a broad pool of talented and diverse leaders who would otherwise be eligible and could foster greatness in our schools,\" Malloy wrote. \nThe Democrat-controlled legislature was not shy about overriding vetoes issued by Malloy's predecessor, Republican Gov. M. Jodi Rell. Lawmakers successfully overturned 16 vetoes during her six years as governor. \nThe bills vetoed by Malloy have run the gamut. They deal with eligibility for retirement benefits for municipal employees who have been rehired, removing records of unsubstantiated abuse claims against teachers and preventing the Office of Higher Education from approving new or revised academic programs for certain nonprofit higher education institutions, among other issues. \nAs of Friday, Malloy had signed 257 bills into law.", "external_links": [], "published": "2015-07-10T20:11:00.000+03:00", "crawled": "2015-07-10T20:25:51.000+03:00", "highlightTitle": ""}