{"organizations": [], "uuid": "144da23b100d77341b02659b0ad3c1e7f53c26d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-01/global-equity-axis-tilts-east-even-as-china-takes-gloss-off-gain", "country": "US", "title": "Global Equity Axis Tilts East Even as China Takes Gloss Off Gain", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Global Equity Axis Tilts East Even as China Takes Gloss Off Gain - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T08:56:00.000+03:00", "replies_count": 0, "uuid": "144da23b100d77341b02659b0ad3c1e7f53c26d3"}, "author": "Adam Haigh", "url": "http://www.bloomberg.com/news/articles/2015-07-01/global-equity-axis-tilts-east-even-as-china-takes-gloss-off-gain", "ord_in_thread": 0, "title": "Global Equity Axis Tilts East Even as China Takes Gloss Off Gain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Asian largest markets ended the quarter with the biggest slice of the global equity pie on record, even as a June rout in China diverted attention from the gains.\nThe combined value of the region’s three main equity markets rose to $18 trillion as of June 30, swelling by $4.4 trillion in just six months. That pushed Japan, China and Hong Kong’s share of global stocks to 26 percent, the largest chunk for the end of a quarter since Bloomberg began compiling such data in 2003. The U.S. remains the biggest pool of equity capital with $24.5 trillion, or 35 percent of the worldwide market, down from 37 percent at the start of the year.\nThings were looking even better for Asia before a 10-day, 22 percent slump ended China’s longest bull market. Money managers Manulife Financial Corp. and Vontobel Asset Management are among those betting the volatility is masking a permanent shift in the global equity map, last month announcing plans to hire more workers in the region.\n“This is just the first innings of a story that will run for decades,” said Philippe Gijsels, Brussels-based chief strategy officer at BNP Paribas Fortis. “An occasional bubble from time to time goes with the territory and is part of growing up and becoming a worldwide leading stock market.”\nThe value of private wealth in the Asia-Pacific region surpassed Europe for the first time in 2014 and is on course to top North America next year , according to Boston Consulting Group. Chinese policy makers are slowly scaling back the capital controls that have kept $21 trillion in savings locked on the mainland.\nThe Shanghai Composite climbed 32 percent in the first half of 2015 even after a 7.3 percent slide in June, its worst month in two years. The surge had convinced traders, many of them individual investors, to bet an unprecedented amount of borrowed money on further gains.\nStemming Losses Policy makers are dusting off their playbook on how to stem further losses, with a weekend interest-rate cut followed by moves to direct pension money into equities and comforting statements by the regulator. The Shanghai Composite rallied 5.5 percent Tuesday, the most in more than six years.\nHong Kong’s Hang Seng Index has advanced 11 percent since Dec. 31. Companies with a primary listing in the city are worth $4.9 trillion, more than double the size of France’s market. Hong Kong stocks attracted $1.2 billion from overseas investors this year through June 22, the first inflow for that period since 2011 and the biggest in EPFR data going back to 2005.\nForeign buyers put more than $29 billion into Japanese shares, a figure only surpassed by inflows in the first half of 2013, as central-bank governor Haruhiko Kuroda kick-started unprecedented easing, EPFR data show. The Topix index has risen 16 percent this year and has gained for 10 of the past 11 quarters.\nStructural Shift “You’ve got China’s increasing importance globally and at the same time Japan is coming out of pretty much 20 years in the doldrums,” Simon Grose-Hodge, a Singapore-based investment strategist at LGT Group, said by phone. “Asia’s gaining more attention again and it’s definitely structural.”\nAsia’s standing among global stock markets has benefited from six months of sideways trading in the Standard & Poor’s 500 Index, which is up 0.2 percent in 2015. Stimulus in Europe drove that region’s benchmark gauge to its best quarter since 2009 through March, before shares slipped amid Greece’s debt crisis.\nMichael Haupt relocated from Switzerland in June to run Vontobel’s wealth management business in Hong Kong, which the firm said shows its desire to develop a bigger presence in Asia.\nManulife appointed three senior executives to Hong Kong in June, and CSOP Asset Management Ltd., the first Chinese money manager to offer an exchange-traded fund directly to U.S. investors, said in May it’s considering hiring in Hong Kong as demand for Chinese assets grows. T. Rowe Price Group Inc. has started trading Japanese stocks from Sydney, while Deutsche Bank AG is boosting its Asian asset and wealth-management staff by as much as 10 percent.\n“There’s been a trend for a few years now for the banks to have a greater emphasis on Asia,” said LGT’s Grose-Hodge. “Certainly in private banking, Asia is seen as the growth market.”", "external_links": ["http://www.manulife.com/public/news/detail/0,,lang=en&artId=148337&navId=630002,00.html\\", "https://www.bcgperspectives.com/content/articles/financial-institutions-growth-global-wealth-2015-winning-the-growth-game/?chapter=2#chapter2\\"], "published": "2015-07-01T08:56:00.000+03:00", "crawled": "2015-07-01T04:29:56.000+03:00", "highlightTitle": ""}