{"organizations": [], "uuid": "70844845b7793068c77fce5e71ef67d0c25ec2a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/Paes-hingis-APs.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/sports/wimbledon-leander-paes-wins-16th-grand-slam-title/99933", "country": "IE", "title": "Wimbledon: Leander Paes wins 16th Grand Slam title", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Wimbledon: Leander Paes wins 16th Grand Slam title | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T08:06:00.000+03:00", "replies_count": 0, "uuid": "70844845b7793068c77fce5e71ef67d0c25ec2a2"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/sports/wimbledon-leander-paes-wins-16th-grand-slam-title/99933", "ord_in_thread": 0, "title": "Wimbledon: Leander Paes wins 16th Grand Slam title", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A vintage Leander Paes clinched his 16th Grand Slam trophy, winning the mixed doubles event of the Wimbledon Championship with legendary Martina Hingis after a dominating win over Alexander Peya and Timea Babos, here today.\nSeventh seed Indo-Swiss pair drubbed the fifth seed Austrian-Hungarian team 6-1 6-1 in the lop-sided summit clash which was over in just 40 minutes.\nIt was Paes’ eighth mixed doubles title and second with Hingis. They had won the Australian Open early this year.\n42-year-old Paes has eight men’s doubles crowns in his Grand Slam collection.\nPaes’ win capped an incredibly successful Wimbledon for India as the country took three titles this year. Sania Mirza won the women’s doubles and Saumit Nagal won the junior boys doubles trophy.\nFor Hingis, it was second title in as many days, having won the women’s doubles with Sania. Overall it was 18th Major title for the Swiss and third in mixed doubles.\nHingis was back on court less than 24 hours after that win with Sania but showed no sign of fatigue. She served well and was terrific at the net, complementing the Indian Pro.\nPaes and Hingis literally toyed with Peya and Babos, who surprisingly failed to put any resistance.\nIn no time Paes and Hingis pocketed the first set as all they needed was 19 minutes to nose ahead. Two broke Babos in the fourth game and Peya in the sixth for a 5-1 cushion. Hingis served out the set when Paes smashed a volley winner.\nPaes and Hingis kept the pressure on the Austrian- American combination right from the first game of the second set. Peya failed to negotiate a Paes return at deuce to hand the seventh seeds grabbed the opportunity to break them.\nBabos’ could not handle a Hingis return and the Indo- Swiss pair got an early break. There was no stopping them from there as they raced to victory in less than one hour.\nBabos failed to hold her serve even once and it was on her return that Paes hit a deft backhand volley winner to close the contest.\n 13, 2015 12:06 am", "external_links": [], "published": "2015-07-13T08:06:00.000+03:00", "crawled": "2015-07-13T08:39:57.000+03:00", "highlightTitle": ""}