{"organizations": [], "uuid": "6a94aafdb2fcc1658e010c63f529225cd587f70c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business_Finance", "url": "http://www.menafn.com/1094283574/National-council-and-financial-allocations-for-climate-change-Mehleb&src=RSS", "country": "US", "title": "National council and financial allocations for climate change: Mehleb", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "National council and financial allocations for climate change: Mehleb | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "6a94aafdb2fcc1658e010c63f529225cd587f70c"}, "author": "Daily News Egypt", "url": "http://www.menafn.com/1094283574/National-council-and-financial-allocations-for-climate-change-Mehleb&src=RSS", "ord_in_thread": 0, "title": "National council and financial allocations for climate change: Mehleb", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Daily News Egypt) The government has formed a national council for the climate change, headed by the Minister of Environment, with the aim of adapting to the effects of environmental changes, according to Prime Minister Ibrahim Mehleb.\n\n\"The council is responsible for working on drafting and updating a comprehensive national strategy for climate change, in addition to settling national plans related to the climate change and linking them to a sustainable development strategy,\" a cabinet statement read.\n\nHossam El-Kawish, the cabinet spokesperson, said the council will work on collecting the studies and researches related to climate change, in addition to following up on implementing the projects that aim at reducing gas emissions and adapting to climate change risks. He also noted that the council will work on removing obstacles in front of collecting, managing and processing the climate change data.\n\n\"The council will conduct a report on the results of its work every four months, and will be submitted to the Prime Minister,\" El-Kawish added.\n\nThe council will give its recommendation to the decision makers, in return for approving all the projects presented for finance by the Green Climate Fund.\n\nThe Africa Green Fund is a project that was launched by the African Developmental Bank to confront climate changes in Africa and help the continent to easily obtain the financial resources allocated for this issue.\n\n\"The council would be responsible for suggesting, following up on and gradually increasing financial annual allocations in the general budget of the state inside each ministry concerned with the impact of climate change,\" said El-Kawish. He added that the purpose is to reduce the emissions and implement the state's contribution to international efforts in climate change.\n\nEl-Kawish said that the council was assigned by the Ministry of Planning to coordinate with the Green Climate Fund over following up on the projects accepted by the fund.\n\nMoreover, the concerned ministries would assign one of their related units to work on the climate change issues and their consequent obligations. The unit would work under the supervision of the ministry's representative in the national council for climate change.\n\nThe representatives of the different bodies in the council are mandated by their managers to apply the recommendations related to the issues of climate change, before submitting them to the cabinet.\n\n\"The head of the council has the right to invite those he deems appropriate to attend the council's meeting. The department specialised in climate change at the Egyptian Environmental Affairs Agency would assist the council in its works, as a technical secretariat,\" noted El-Kawish.\n\nEl-Kawish added that the decision of the national council for climate change includes the membership of the Ministries of Defence, Foreign Affairs, Investment, Finance, Planning, Interior, International Cooperation, Electricity, Agriculture, Transport, Petroleum, and Aviation, and the Federation of Egyptian Industries, in addition to representatives of all the concerned governmental bodies, and three experts chosen by the Ministry of Environment.", "external_links": [], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T19:50:53.000+03:00", "highlightTitle": ""}