{"organizations": [], "uuid": "c52ca7d359413cc3bccd09544003d59f6a49281c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/04/rbi-pti-T.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/draft-financial-code-proposes-committee-on-policy-rate/106293", "country": "IE", "title": "Draft IIndian Financial Code dilutes RBI chief’s power; can’t veto on policy rate", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Draft IIndian Financial Code dilutes RBI chief’s power; can’t veto on policy rate | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:38:00.000+03:00", "replies_count": 0, "uuid": "c52ca7d359413cc3bccd09544003d59f6a49281c"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/draft-financial-code-proposes-committee-on-policy-rate/106293", "ord_in_thread": 0, "title": "Draft IIndian Financial Code dilutes RBI chief’s power; can’t veto on policy rate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Sop on kerosene to end in 3 years Economists say fundamentals strong despite British retail sales dip Indian Financial Code: Monetary policy panel to have three RBI members In a move that may dilute powers of RBI chief, the government today proposed taking away his authority to veto the interest rate decision of the central bank’s monetary policy committee.\nThe revised draft of Indian Financial Code (IFC), released today by the Finance Ministry, has also proposed that the all-powerful committee would have four representatives of the government and only three from the central bank, including the ‘RBI Chairperson’.\nThe draft talks of ‘RBI Chairperson’ and not ‘RBI Governor’. RBI is headed by a Governor, at present.\nThe IFC, which is conceived as an overarching legislation for the financial sector, proposes a monetary policy committee which will be entrusted with the task of deciding the key policy rate and chasing the annual retail inflation target to be decided by the government in consultation with RBI.\n“Inflation target for each financial year will be determined in terms of the Consumer Price Index (CPI) by the Central Government in consultation with the Reserve Bank every three years,” said the draft on which the Finance Ministry has invited comments till August 8.\nFurther, it said the RBI “must constitute a Monetary Policy Committee to determine by majority vote on the Policy Rate required to achieve the inflation target”.\nAt present, the RBI Governor consults a Technical Advisory Committee, but does not necessarily go by the majority opinion while deciding on the monetary policy stance.\nThe first draft, submitted in March 2013, too had talked about the committee and majority vote, but gave powers to RBI chairperson to supersede the decision of the panel.\n“In exceptional and unusual circumstances, if the RBI Chairperson disagrees with a decision taken at a meeting of the Monetary Policy Committee, the RBI Chairperson will have the right to supersede such decision,” it had said. The provision was dropped in the revised draft.\nAs per revised draft there will be three members from the RBI side and four from the central government, thus giving full control to the government on policy rate.\n 23, 2015 7:38 pm", "external_links": [], "published": "2015-07-24T03:38:00.000+03:00", "crawled": "2015-07-24T00:09:07.660+03:00", "highlightTitle": ""}