{"organizations": [], "uuid": "afeb7fd9e682da6e0b3fa01dd0118d24534c689a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cajnewsafrica.com", "main_image": "http://cajnewsafrica.com/wp-content/uploads/2015/07/nascom-logo.jpg", "site_section": "http://cajnewsafrica.com/category/finance-banking/finance/feed/", "section_title": "CAJ News Africa » Finance", "url": "http://cajnewsafrica.com/2015/07/15/nigeria-poised-to-exploit-profitable-sports-industry/", "country": "US", "title": "Nigeria poised to exploit profitable sports industry", "performance_score": 0, "site": "cajnewsafrica.com", "participants_count": 1, "title_full": "Nigeria poised to exploit profitable sports industry", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T10:05:00.000+03:00", "replies_count": 0, "uuid": "afeb7fd9e682da6e0b3fa01dd0118d24534c689a"}, "author": "Admin", "url": "http://cajnewsafrica.com/2015/07/15/nigeria-poised-to-exploit-profitable-sports-industry/", "ord_in_thread": 0, "title": "Nigeria poised to exploit profitable sports industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria poised to exploit profitable sports industry NASCOM nurtures sports and academics at grassroots level poised to benefit from growing revenue in Sports From OKORO CHINEDU i n Lagos, Nigeria LAGOS, (CAJ News) – Nigeria ‘s Federal Ministry of Industry, Trade and Investment has outlined plans to explore avenues to make the most of the lucrative global sports industry.\nThe ministry is plans to set up a joint inter-agency body to of benefitting from the $800 billion annual global sports revenue. \nThis was part of the decisions reached in an interagency meeting when the Director-General, National Sports Commission (NSC), Alhassan Yakmut, led a team from NSC on a business mission to the Industry Ministry. \nGreyne Anosike, Ministry Spokesperson, said Permanent Secretary in the Ministry, Ambassador Abdulkadir Musa, told the delegation that Nigeria has come to a point in her economic renaissance where it has to harness abundant raw materials especially from Nigeria Petrochemical industrial sector to promote revenue growth and create employment. \nMusa said sportswear (canvas) are products of cotton and petroleum products which can be produced in Nigeria to meet the needs of the Nation’s paramilitary-customs, Immigration, Civil Defence and National Youth Service Corps. \nHe insisted that the process of manufacturing these items in Nigeria must receive expedited attention to save National revenue, create jobs as well as boast the health of citizens through exercise. \nEarlier, the Director General of the NSC, Mallam Alhassan Yakmut said the commission was set to rebase and rebrand Nigeria by exploring huge business opportunities available in sports. \n“As huge as Nigeria is and as versatile as her sports men and women are, Nigeria benefits nothing from $800 billion annual global sports revenue,” he said. \nHe argued that revenue from sporting businesses in Nigeria should exceed that of Nollywood (local movie industry). \n– CAJ  //cajnewsafrica.com/?p=6762   15 2015. Filed under Africa & World , Finance , Investing , Investing , Regional , Sports  ", "external_links": [], "published": "2015-07-15T10:05:00.000+03:00", "crawled": "2015-07-15T10:27:15.000+03:00", "highlightTitle": ""}