{"organizations": [], "uuid": "81a50b1dab66e67ae0521b2421a4c3f48028f85e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/a9/7d/a97d3d0d66c12f39dc4125055fb7a489.png?itok=5MjbnxSx", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/where-is-the-money-for-my-business-hiding?cid=rss", "country": "US", "title": "Where is the money for my business hiding?", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Where is the money for my business hiding?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T00:38:00.000+03:00", "replies_count": 0, "uuid": "81a50b1dab66e67ae0521b2421a4c3f48028f85e"}, "author": "Margaret Jackson, San Jose Women's Business Examiner", "url": "http://www.examiner.com/article/where-is-the-money-for-my-business-hiding?cid=rss", "ord_in_thread": 0, "title": "Where is the money for my business hiding?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Where is the money for my business hiding? Use your key for the next article Business Women Digital Juice 2.0 Royalty Free Images \nWomen business owners are afforded opportunities to access capital through various programs. If you want to start, grow or expand your business, you will have to start looking in the right places. Finding money to build your business revolves, heavily, around wide-ranging research of funding opportunities, that can be narrowed down over time. The fact is, money is all around you. How to attract the funding needed, is not always clear or simple. It is important to take the time to research, how you become the right candidate for funding. \nWhere is the money for my business hiding? It is hiding in plain sight. Ask yourself the following questions. \n• Do you really want to acquire funding? Why or Why not?• What kind of funding do you want to pursue? Is it grants, loans, angel funders, crowd-funding, venture capitalists or a mix of funders?• Do you have a business plan?• How much do you want to invest into your business?• Do you need help in preparing your business to acquire funding? \nA great place to start the journey on finding funding, is at the Small Business Administration’s website . The SBA has resources that support women entrepreneurship, and their ability to compete in the global marketplace. Connecting your business with the right organizations, resources, and tools, is a huge leap in the right direction. SBA has partnered with many organizations that benefit the start, growth, and expansion of women businesses, to include NAWBO. The National Association of Women Business Owners, 2014 State of Women Owned Business Report, predicted that 92% of more women would venture to start their own businesses. \nThe world of funding your business does not have to be a lonely journey. It doesn’t have to be scary, confusing or overwhelming. When you choose to access available resources, online education and training on business funding , like Creative Funding for Your Small Business, it can help eliminate business funding stresses. If you want to receive the Creative Funding for Your Small Business webinar, become a member of the On the Edge Women In Business Club . The business Club is online networking, business and professional training, and an on own your time resource hub for you to explore and get involved with your business growth. \nSan Jose Womens Business Examiner invite you to subscribe by clicking subscribe at the top of the page. Suggested Links", "external_links": [], "published": "2015-07-13T00:38:00.000+03:00", "crawled": "2015-07-13T05:54:29.000+03:00", "highlightTitle": ""}