{"organizations": ["Princeton", "Dice Princeton Information", "Princeton Information"], "uuid": "db1bad2077c8b89318b6f8320c8e9bab301f1579", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.simplyhired.com", "main_image": "", "site_section": "http://www.simplyhired.com/a/job-feed/rss/o-13205", "section_title": "Finance jobs | Simply Hired", "url": "http://www.simplyhired.com/job/zjsbavik7g", "country": "US", "title": "Financial Analyst at Princeton Information (New York, NY)", "performance_score": 0, "site": "simplyhired.com", "participants_count": 0, "title_full": "Financial Analyst at Princeton Information (New York, NY)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T12:33:00.000+03:00", "replies_count": 0, "uuid": "db1bad2077c8b89318b6f8320c8e9bab301f1579"}, "author": "", "url": "http://www.simplyhired.com/job/zjsbavik7g", "ord_in_thread": 0, "title": "Financial Analyst at Princeton Information (New York, NY)", "locations": ["US", "New York", "NY", "UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Source: Dice Princeton Information is seeking a Financial Analyst for a financial firm. We already have a working application called FITS that has most of our Market data usage already entered for the UK and the East coast business. We need a hand on person to aid in the collection, entry of data contracts information and run reports on usage of the Market data used by the west coast offices. Responsibilitites include Augment our Market data contracts administration staff during onboarding of additional users from the east and west coast. FITS experience is preferred, but there are other products on the market which are similar. Princeton Information is one of the nation's top five privately-held IT consulting firms, in business since 1985. Princeton Information services a clientele of primarily Fortune 500 companies nationwide. With annual revenues over 120 million, Princeton Information operates across the US from multiple regional offices. Our Commitment to Our Consultants As a privately held company, Princeton Information is solely committed to the success of clients and consultants - not to any shareholders. PI's success is grounded in the relationships we build with our consultants. We seek the best people provide career path counseling as well as the most challenging opportunities in business and in IT. As part of its culture of loyalty and commitment to its consultants, Princeton Information is committed to doing all we can to ensure our consultants have the best possible search, placement and work experience possible. Our Services Working with one Princeton Recruiter will gain you access to over 500 open requirements with the top clients in the US across all industries (finance, insurance, pharmaceutical, commercial, telecom, media, manufacturing) nationwide. Our local recruiters have in-depth knowledge of our clients and opportunities. They will work with you to find you the best possible opportunities for you and your career. Our Relationships Our relationships with our clients, as well as our consultants, are critical to our success! We have a robust sales organization that ensures that Princeton has the inside track on what attributes a person needs in order to be successfully placed and engaged at our clients. We know the technical and non-technical skills that our clients are looking for and we ensure that you are educated about the client prior to your interview with them. Princeton is committed to going above and beyond to ensure that each meeting you have with a client is a successful one! (FITS over 1 year(s) ) AND (FINANCIAL ANALYST over 1 year(s) OR ANALYST over 1 year(s) )", "external_links": [], "published": "2015-07-22T12:33:00.000+03:00", "crawled": "2015-07-23T01:51:53.155+03:00", "highlightTitle": ""}