{"organizations": [], "uuid": "5e44152d79215a526014ed083ebf052607b678cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/hycG0ydjqFT6MwONK2oSREJxetZ4I8FC/promo260501943&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.news.com.au/finance", "section_title": "Finance | Business and Finance News | News.com.au", "url": "http://www.news.com.au/finance/work/shorten-to-be-quizzed-on-awu-agreements-at-the-trade-union-royal-commission/story-fn5tas5k-1227432139943", "country": "AU", "title": "Bill Shorten: trade union royal commission questions former AWU leader", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Bill Shorten: trade union royal commission questions former AWU leader", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "5e44152d79215a526014ed083ebf052607b678cc"}, "author": "MALCOLM FARR", "url": "http://www.news.com.au/finance/work/shorten-to-be-quizzed-on-awu-agreements-at-the-trade-union-royal-commission/story-fn5tas5k-1227432139943", "ord_in_thread": 0, "title": "Bill Shorten: trade union royal commission questions former AWU leader", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BILL Shorten is the deal maker’s dealmaker, a man who acknowledges one of his strongest skills is in getting the numbers right for agreements he favours.\nHis history and reputation as a deal maker will be examined tomorrow in his appearance before the trade union royal commission (TURC) in Sydney, a critical test for the Labor chief.\nIt is expected he will appear tomorrow and Thursday with the possibility Mr Shorten will be recalled later.\nOne important outcome will be whether he is depicted as a deal-making spiv or a leader who used his skills to help his members and the companies they worked for.\nBut the central charge against him is that he used workplace agreements to boost the political power of the AWU — and himself — at the expense of his members.\nOr as Prime Minister Tony Abbott put it today: “There have been deals that have been done to help the union but dud the workers. Let’s see what light can be cast on that.”\nMr Shorten believes he has done nothing improper and has contributed more to the wellbeing of workers than Prime Minister Abbott has.\nThe Opposition Leader has spent the past week re-examining his deal-making history by reviewing hundreds of industrial agreements he presided over when Victorian leader of the Australian Workers’ Union (1997-06) and national president (2001-07).\nSome of those enterprise agreements were negotiated by other officials and signed off by Mr Shorten after he was satisfied — through a system of statutory declarations he introduced — that proper processes had been followed.\nOne agreement to be examined was with Thiess John Holland to build Melbourne’s EastLink tollway. The company paid the AWU nearly $300,000 after an agreement on workplace flexibility which saved the project close to $100 million.\nExecutives behind the project have recently applauded the agreement.\nThe TURC is expected also to ask about the AWU record keeping of payments by employers. Was Bill Shorten just a man of the people when he was the secretary of the Australian Workers Union? Source: News Corp Australia\nAnd attention will be given to the payment of union fees for members on a project. Union sources point out that under the Howard government’s Work Choices laws payroll deductions of fees was banned and another scheme had been used to the same effect.\nLabor believes the TURC is a political inquiry. The party makes no allegations against royal commissioner Dyson Heydon or his staff, but the Government’s insistence of a full inquiry into unions and its targeting of the ALP as well as individual unions.\nMr Shorten was to have fronted the TURC in August or September but appealed to Commissioner Heydon to bring forward his appearance to tomorrow.\nHe will be the third Labor leader to front a royal commission in 12 months — former prime ministers Kevin Rudd and Julia Gillard were questioned on the Home Insulation Scheme and the AWU slush fund scandal.\nThe Government believes the inquiry is justified in the cause of cleaning up any corruption in the union movement.\nTony Abbott today said he would not give a running commentary on the TURC’s work but made clear what he thought was an important area of investigation.\n“I think that it’s really a matter for the Leader of the Opposition to explain, and plainly there is some explaining that’s needed,” said the Prime Minister.\n“There are a lot of questions that have been raised by the testimony that has been given to the royal commission.\n“In the end what we want to come out of this is honest unions that do the right thing by their members and plainly it seems there have been a lot of ghosts on the rolls of some of the unions. Tony Abbott believes Bill Shorten has a lot of questions to answer from his days as a union leader. Picture: Toby Zerna Source: News Corp Australia\n ", "external_links": ["http://www.myspace.com/index.cfm?fuseaction=postto&t=The+grilling+of+deal-maker+Bill&c=BILL+Shorten+is+due+to+face+the+trade+union+royal+commission+tomorrow.+But+will+the+Labor+leader+come+out+looking+like+a+deal-making+spiv%2C+or+as+a+man+who+helped+improve+workers+conditions%3F&u=http://www.news.com.au/finance/work/shorten-to-be-quizzed-on-awu-agreements-at-the-trade-union-royal-commission/story-fn5tas5k-1227432139943?sv=563789c536cdcab017d116ae686d5441", "http://digg.com/submit?phase=2&url=http://www.news.com.au/finance/work/shorten-to-be-quizzed-on-awu-agreements-at-the-trade-union-royal-commission/story-fn5tas5k-1227432139943?sv=563789c536cdcab017d116ae686d5441&title=The+grilling+of+deal-maker+Bill", "http://del.icio.us/post?url=http://www.news.com.au/finance/work/shorten-to-be-quizzed-on-awu-agreements-at-the-trade-union-royal-commission/story-fn5tas5k-1227432139943?sv=563789c536cdcab017d116ae686d5441&title=The+grilling+of+deal-maker+Bill", "http://www.newsvine.com/_wine/save?popoff=0&u=http://www.news.com.au/finance/work/shorten-to-be-quizzed-on-awu-agreements-at-the-trade-union-royal-commission/story-fn5tas5k-1227432139943?sv=563789c536cdcab017d116ae686d5441&h=The+grilling+of+deal-maker+Bill", "http://www.facebook.com/share.php?u=http://www.news.com.au/finance/work/shorten-to-be-quizzed-on-awu-agreements-at-the-trade-union-royal-commission/story-fn5tas5k-1227432139943?sv=563789c536cdcab017d116ae686d5441", "http://www.kwoff.com/submit.php?url=http://www.news.com.au/finance/work/shorten-to-be-quizzed-on-awu-agreements-at-the-trade-union-royal-commission/story-fn5tas5k-1227432139943?sv=563789c536cdcab017d116ae686d5441"], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T09:31:44.000+03:00", "highlightTitle": ""}