{"organizations": [], "uuid": "3c3134d2e4625ec645376a6145d654e529343d18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/22/590x/greece-unemployment-590091.jpg", "site_section": "http://express.co.uk//posts/rss/21/finance", "section_title": "Daily Express :: Finance Feed", "url": "http://www.express.co.uk/finance/city/590091/Unemployment-in-Spain-and-Greece-at-make-or-break-moments", "country": "", "title": "Unemployment in Spain and Greece at 'make or break' moments", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Unemployment in Spain and Greece at 'make or break' moments", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T21:06:00.000+03:00", "replies_count": 0, "uuid": "3c3134d2e4625ec645376a6145d654e529343d18"}, "author": "", "url": "http://www.express.co.uk/finance/city/590091/Unemployment-in-Spain-and-Greece-at-make-or-break-moments", "ord_in_thread": 0, "title": "Unemployment in Spain and Greece at 'make or break' moments", "locations": ["Greece", "Athens", "Spain", "Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Unemployment in Spain and Greece at 'make or break' moments Unemployment in Spain and Greece at 'make or break' moments THE worrying scale of unemployment in the debt-laden countries of southern Europe has been laid bare, as the economic crisis in Greece threatens to spread to other countries. PUBLISHED: 19:06, Thu, Jul 9, 2015 | UPDATED: 19:15, Thu, Jul 9, 2015 REUTERS Young people in Athens, Greece \nUnemployment in Greece remains well above 25 per cent, and at 21.5 per cent the situation is not much better in Spain, according to a report by the Organisation of Economic Co-operation and Development (OECD).The situation is not set to improve before the end of next year, warned the think tank that analyses the economies of 34 developed countries. It predicts that Spain's unemployment rate will not drop below 19.7 per cent before 2017, while Greece will still have almost a quarter of people out of work at a rate of 24. per cent. As countries reach \"make or break\" points, the OECD said that time is now running out to help millions of people who are still suffering the effects of the economic crisis. Britain, Germany, the US and Japan are the only developed countries where employment is back above pre-crisis levels. But the report pointed toward a higher amount of part-time workers in the UK and said many people are looking to work full-time. OECD secretary-general Angel Gurría said: \"Time is running out to prevent the scars of the crisis becoming permanent, with millions of workers trapped at the bottom of the economic ladder.”The report pointed to youth unemployment as a particular problem and said that a person's long-term career is largely determined by their first ten years of working life. It means that people who finished school or training in around 2007 and have not been able to find a job, could find that their future job prospects are permanently damaged. Unemployment in Britain has now fallen to 5.5 per cent, according to the most recent statistic from the Office for National Statistics (ONS). However, the amount of young people out of work is at 16.1 per cent, it's estimate that around 13 per cent of young people are not in employment, education or training. Related articles", "external_links": [], "published": "2015-07-09T21:06:00.000+03:00", "crawled": "2015-07-10T00:27:36.000+03:00", "highlightTitle": ""}