{"organizations": [], "uuid": "9973dfbbf58bcf3311913a5f74613725b4bcae24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/gKdOqF.09pDzM4n4Ti5kRw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/e7fe09e8de150637a50dcb041ea2a3033d10b87f_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/ukraine-eyes-september-debt-repayment-153038105.html", "country": "GB", "title": "Ukraine eyes September debt repayment freeze", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Ukraine eyes September debt repayment freeze", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T18:30:00.000+03:00", "replies_count": 0, "uuid": "9973dfbbf58bcf3311913a5f74613725b4bcae24"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ukraine-eyes-september-debt-repayment-153038105.html", "ord_in_thread": 0, "title": "Ukraine eyes September debt repayment freeze", "locations": ["Ukraine"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 30, 2015, 16:44 BST - UK Markets closed Ukraine eyes September debt repayment freeze By Dmitry Zaks | AFP – 13 minutes ago View Photo \n\nUkraine's finance ministry warned Thursday it could declare a technical default in two months should its lenders fail to accept less stringent repayment terms and a possible partial debt write-off. \nThe war-shattered state's words of caution came on the eve of a crucial Washington meeting at which the International Monetary Fund is expected to back the release of a new payment that would keep Ukraine's $40-billion (37-billion-euro) global rescue package live. \nBut that money includes $15.3 billion in existing debt Ukraine must restructure over the course of the four-year deal. \nFranklin Templeton and three other US financial titans who own about two-thirds of this sum have balked at Kiev's request to accept a 40-percent cut to the value of their original investment in the former Soviet state. \nNegotiations have been proceeding slowly and Kiev now faces a September 23 deadline to return $500 million and make smaller interest payments on debt issued by a Russian-backed president who was ousted by street protests last year. \nDeputy Finance Minister Artem Shevalev said Kiev would have a tough time explaining in negotiations why it made the September principal payment but is hoping not to have to cover even bigger ones that mature by the end of the year. \n\"Making the coupon payment is one thing. It shows financial discipline,\" news agencies quoted Shevalev as saying. \n\"But after paying the body of the bond, it will be very hard to talk to the other creditors -- why we decide to pay someone in September and not someone else later on.\" \nUkraine's biggest worry is a $3-billion Eurobond that Russia purchased from the deposed government in the wake of its 2013 decision to bow to Kremlin pressure and reject an EU association pact. \nMoscow authorities have refused to join the debt negotiations and demand the money be repaid by the December 20 deadline. \n- Creditors under pressure - \nUkraine last week made a new debt restructuring offer that IMF Managing Director Christine Lagarde on Wednesday urged the Western creditors to accept. \nThe IMF chief said she hoped \"bondholders are sensible about what can be achieved\" and expressed optimism about recent \"progress\". \nThe two sides have agreed to keep their talks private in order to avoid either Kiev or the investment houses putting pressure on each other through the press. \nIt remains unclear whether the new Kiev proposal includes the 40-percent write-off that the lenders have so furiously fought. \nUkrainian Finance Minister Natalie Jaresko had said Monday she expected direct talks to resume this week. \nAnd her deputy Shevalev confirmed that discussions at various levels were becoming more frequent and involved. \n\"I cannot disclose the details, but at the very least, our dialogue has reached a new stage of development,\" \nLagarde has signalled repeatedly that the Fund's payments to Kiev's pro-Western government would continue even if no immediate debt agreement is struck.", "external_links": [], "published": "2015-07-30T18:30:00.000+03:00", "crawled": "2015-07-30T18:45:18.391+03:00", "highlightTitle": ""}