{"organizations": [], "uuid": "8a0bedf87e355c33ae41542865fc6eb74d6505d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/y/f/q/z/image.related.afrArticleLead.620x365.gihlg1.png/1437644296229.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/immigration/us-toughens-up-on-australian-work-visas-20150723-gihlg1", "country": "AU", "title": "US toughens up on Australian work visas", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "US toughens up on Australian work visas | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T21:45:00.000+03:00", "replies_count": 0, "uuid": "8a0bedf87e355c33ae41542865fc6eb74d6505d3"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/policy/immigration/us-toughens-up-on-australian-work-visas-20150723-gihlg1", "ord_in_thread": 0, "title": "US toughens up on Australian work visas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The E-3 work visa exclusively for Australians was set up under a deal between former president George W Bush and prime minister John Howard in 2005 as an offshoot to a free-trade agreement. iStock Share on twitter Share on Google Plus by John Kehoe One in 10 Australians applying for a specialty occupation visa to work in the United States are being rejected by American authorities, who are turning away people in less-sophisticated roles trying to dodge the immigration rules.\nThe E-3 work visa exclusively for Australians was set up under a deal between former president George W Bush and prime minister John Howard in 2005 as an offshoot to a free-trade agreement.\nWhile the E-3 visa is being issued in record numbers as more Australians apply, expatriates living in the US and immigration lawyers say they have also noticed an increase in the number of people being denied the special visa.\nAnalysis of US State Department figures shows 958 Australians were refused E-3 visas in 2013-14, up from 783 in the previous year and 642 in 2012.\nAnecdotal evidence suggests authorities are denying people in less qualified roles such as hospitality and administration because the visa is meant to be for Australians with university degrees in specialist roles.\nThere might also be a crackdown against some entrepreneurs incorporating US companies and employing themselves.\nNew York-based immigration lawyer Douglas Lightman said he had noticed an \"uptick in scrutiny\" by the US consulate in Sydney analysing E-3 applications.\n\"Thankfully our clients haven't been rejected but we have had calls and been approached by people having issues at the consulates after being denied,\" he said.\n Speciality occupation While more Australians are being refused, a record 8834 people were issued the E-3 visa in 2014. It requires a bachelor's degree, a job offer in the US and skills to fill a position that qualifies as a speciality occupation such as finance, accounting, engineering or technology.\nThe number of Australians being approved for the E-3 visa is growing at more than 20 per cent a year, putting the program on track to hit the visa limit of 10,500 by the end of 2015.\nAlthough the number of approvals and rejections is rising, the proportion of Australians being knocked back has remained relatively stable, at between 9 and 11 per cent, over the past eight years.\nThe rise in the number of denials has become a talking point among expatriate groups and on social media.\nJames Boland, president of The Australian Community in New York, said some people were applying for the E-3 for positions that \"don't really make the cut of a professional job\".\nOthers were hiring themselves after setting up a US company but the US authorities were waking up to this if the business was not legitimate, Mr Boland said.\n\"You might get away with it the first time but when you come up for your renewal interview and they look at your financials and if any other people are employed, it will be rejected,\" he said.\nThe E-3 visa must be renewed every two years.\nBig advantage The visa gives Australians a big advantage over other nationalities and the less-generous H1-B visa, because the E-3 process is streamlined, the visa is renewable for an indefinite number of times and spouses are allowed to work on the permit.\nA spokesman for the US State Department's Bureau of Consular Affairs, John Taylor, said \"we have not changed or adjusted the way E-3 visas are adjudicated\".\n\"The applicant must demonstrate that the prospective employment meets the standard of being 'specialty occupation employment' and have necessary academic qualifications,\" he said.\nThere are three versions of the E-3 visa – the E-3, E-3D (dependent for spouses) and the E-3R (renewal).\nMr Lightman, of Lightman Law Firm, said the most common reasons for denial were incorrect preparation of application documents and people trying to apply for the wrong occupations.\n\"The E-3 is for professional positions that normally require a specific bachelor's degree for entry into that role,\" Mr Lightman said.\nOne of the frustrating aspects of the renewal process is that visa holders must leave the US and apply at an American consulate overseas, even if they are staying in the same job with the same US employer.\nCanada, Mexico and the Caribbean are the closest countries to do a \"visa run\".\nAn Australian New Yorker working in project management said he was forced to join a five-month waiting list at the US embassy in Ottawa before his E-3 was renewed recently.\n\"The US embassy in Canada is starting to reprioritise requests for these transactions for non-residents, behind Canadian citizens,\" he said.\nThe person did not want to be identified, out of concern that speaking out might jeopardise future visa applications.\nSome Australians are opting to take the 40-hour return flight to Australia to renew their visas, to tie in with family visits.", "external_links": ["https://twitter.com/Johnkehoe23", "https://plus.google.com/https://plus.google.com/u/2/b/117110503471959828934/105888713093633772087/posts"], "published": "2015-07-23T21:45:00.000+03:00", "crawled": "2015-07-23T16:59:12.704+03:00", "highlightTitle": ""}