{"organizations": [], "uuid": "feb767f3a37be21bd91ec0539f510d51bc440bb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/bfvi84kxx6_finance_minister_seth_terkper.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/630856/1/terkper-downplays-loan-debacle.html", "country": "US", "title": "Terkper Downplays Loan Debacle", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Terkper Downplays Loan Debacle", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T19:42:00.000+03:00", "replies_count": 0, "uuid": "feb767f3a37be21bd91ec0539f510d51bc440bb2"}, "author": "", "url": "http://www.modernghana.com/news/630856/1/terkper-downplays-loan-debacle.html", "ord_in_thread": 0, "title": "Terkper Downplays Loan Debacle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  20 July 2015 17:42 CET Terkper Downplays Loan Debacle By Daily Guide \nSeth Terkper FINANCE AND Economic Planning Minister, Seth Terkper, says the rejection of Ghana's Chinese loan application is not the end of the road for the government. \nThe roads involved Accra Ring Road outer project, Mankessim/Agona-Swedru/Nsawam and the Dodowa/Kpong and Somanya/Akuse Junction road reconstruction projects. \nAccording to the Chinese, they are rejecting the loan application on the grounds that the road projects are not 'financially beneficial' and therefore not capable of repaying the loan by themselves. \nSome critics of the government have also attributed the rejection of the loan application to the cancellation of a contract earlier awarded Chinese firm StarTimes and later given to K-NET Limited Ghana in the digital migration project which would see Ghana move from analogue to digital terrestrial television (DTT). \nStarTimes is reportedly lacing its boots to initiate arbitration proceedings at the London Court of Arbitration against the government over the abrogation of the contract. \n'Having studied the documents for the above projects, we would like to advise you that, according to the current guidelines by Chinese government, the Chinese government concessional loan and preferential buyer credit are mainly directed towards projects with good financial benefits and repayment abilities,' Ji Chun, Regional Director of the Chinese government, said in the rejection letter. \nHowever, in the ensuing confusion, the Finance Minister remains adamant and said the rejection cannot be a major setback. \nHe told Joy FM that 'I just want to assure Ghanaians that the rejection of a loan is not new. It happens often times either through feasibility studies or for some other reasons. \n'If they say the projects are not commercially viable, then it could be by their assessment and that is one of the reasons why I am meeting the Chinese ambassador. I am hoping to travel to China to meet the executives of Exim Bank so we could understand their reasons,' he noted. \n'The Chinese don't give us one type of loan. The Chinese give us loans which are concessional; the Chinese give us loans which we take preferential credit and there are commercial loans and the Exim expects that when you apply for a loan for a commercial project the project should be able to pay for itself,' the minister explained. \nMr Terkper said although there were plans to toll the roads to make it commercial, it was possible the Chinese did not find them viable enough. \n'Probably their (Chinese) analysis is showing that…the tolls may not be viable yet. This is where you go for mixed credit…or branded credit,' he said to explain that perhaps the type of loan Ghana applied for did not conform to the 'Gang of Four' project. \nBy William Yaw Owusu", "external_links": [], "published": "2015-07-20T19:42:00.000+03:00", "crawled": "2015-07-20T19:04:25.416+03:00", "highlightTitle": ""}