{"organizations": ["Fed"], "uuid": "4792ef3d570d07d93f963fddd0bb62d3c7c835c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/fed-expected-push-ahead-rate-050316372.html", "country": "GB", "title": "Fed expected to push ahead with rate hike plan", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Fed expected to push ahead with rate hike plan", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T08:03:00.000+03:00", "replies_count": 0, "uuid": "4792ef3d570d07d93f963fddd0bb62d3c7c835c4"}, "author": "", "url": "https://uk.finance.yahoo.com/news/fed-expected-push-ahead-rate-050316372.html", "ord_in_thread": 0, "title": "Fed expected to push ahead with rate hike plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 29, 2015, 06:08 BST - UK Markets open in 1 hr 52 mins Fed expected to push ahead with rate hike plan Reuters – 4 minutes 45 seconds ago \nThe United States Federal Reserve Board building is shown in Washington October 28, 2014. REUTERS/Gary … By Howard Schneider \nWASHINGTON (Reuters) - The Federal Reserve is expected on Wednesday to point to a growing U.S. economy and stronger job market as it sets the stage for a possible interest rate hike in September. \nThe U.S. central bank is scheduled to issue its latest policy statement at 2 p.m. EDT following a two-day meeting, spelling out how policymakers feel the economy has progressed since they last met in June. \nEarlier this year the Fed embraced a meeting-by-meeting approach on the timing of what will be its first rate hike since June 2006, making such a decision solely dependent on incoming economic data. \nWith a slew of employment, inflation and GDP reports to come before its September meeting, the Fed is unlikely to hint too strongly about its plans, Barclays economists Michael Gapen and Rob Martin wrote in a preview of this week's meeting. \nBut simply hewing to the language of the June policy statement, when the Fed said the economy was expanding moderately, or even strengthening the outlook a bit, \"leaves the door wide open for September,\" they wrote. \nDespite a dovish reputation, Fed Chair Janet Yellen has been among those pulling on the door handle in recent public statements, saying she felt a rate hike would be appropriate sometime this year absent a negative shock to the economy. \nAlthough another collapse in energy prices and growing economic uncertainty in China is clouding the global economic outlook, the Fed has largely looked beyond recent turmoil overseas. \nInstead, it has focused on the steady growth in the U.S. job market and on policymakers' expectations that inflation will eventually rise to the central bank's medium-term objective of 2 percent. \nThe U.S. unemployment rate is 5.3 percent, near what many officials consider full employment. \nAn economic contraction in the first quarter also has been set aside as an aberration, the result of a harsh winter and statistical \"noise\" that federal number crunchers are now trying to fix. \nEarly projections that the second quarter was also going to be weak have since turned around. \nA \"real-time\" gross domestic product forecast by the Atlanta Fed as of the middle of May projected 0.5 percent annualized growth in the second quarter. When the final estimate was issued this week, the forecast had jumped to nearly 2.5 percent annualized growth. \n(Reporting by Howard Schneider; Editing by Paul Simao)", "external_links": [], "published": "2015-07-29T08:03:00.000+03:00", "crawled": "2015-07-29T08:09:08.309+03:00", "highlightTitle": ""}