{"organizations": [], "uuid": "049336910ce6c3b4300639c7aaabdff328ad091b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/balidor-oil-gas-llc-receives-130000331.html", "country": "US", "title": "Balidor Oil & Gas, LLC Receives $150 Million Equity Commitment from Kayne Anderson", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Balidor Oil & Gas, LLC Receives $150 Million Equity Commitment from Kayne Anderson", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T16:00:00.000+03:00", "replies_count": 0, "uuid": "049336910ce6c3b4300639c7aaabdff328ad091b"}, "author": "", "url": "https://uk.finance.yahoo.com/news/balidor-oil-gas-llc-receives-130000331.html", "ord_in_thread": 0, "title": "Balidor Oil & Gas, LLC Receives $150 Million Equity Commitment from Kayne Anderson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 9, 2015, 14:12 BST - UK Markets close in 2 hrs 18 mins Balidor Oil & Gas, LLC Receives $150 Million Equity Commitment from Kayne Anderson Press Release : Kayne Anderson Capital Advisors, L.P. – 12 minutes ago Print \nHOUSTON--(BUSINESS WIRE)-- \nBalidor Oil & Gas, LLC (“Balidor” or the “Company”) today announced a $150 million equity commitment from Kayne Anderson Energy Funds (“Kayne Anderson”) and members of the Balidor management team. Balidor is a Houston, Texas based independent oil and gas company formed to target the acquisition and development of oil and natural gas assets in North America. \nThe Balidor management team is led by Dave Baker, CEO; Brian Dorr, COO; and Steve Liles, Vice President. Prior to forming Balidor, Dave Baker and Brian Dorr served as senior executives at Breitburn Energy (“Breitburn”) where Dave Baker served as Senior Vice President of Operations, managing engineering and operations for all of Breitburn’s assets, and Brian Dorr served as Vice President of Operations, managing Breitburn’s E&P operations in six states. Steve Liles joins the team from his prior role as Executive VP and COO for BETA Offshore. \nBalidor’s CEO, Dave Baker, commented, “We are excited for this opportunity to partner with Kayne Anderson, and are pleased with the working relationship and mutual trust that has been established. I’m fortunate to have Brian and Steve as partners who I greatly value for their integrity, work ethic, experience, and abilities. I’m confident that together, we will build a successful oil and gas company.” \n“We believe the current market environment provides a great opportunity for private equity-backed companies and we are confident the Balidor team has the technical, operational, and commercial execution experience to capitalize on this unique time in the oil and gas industry,” said David Habachy, Managing Director at Kayne Anderson. \nAbout Balidor \nHeadquartered in Houston, Texas, Balidor will pursue acquisitions of oil and gas assets with scalable exploitation and development upside. The Company will evaluate opportunities across the onshore U.S. with a focus on the Ark-LA-Tex, Mid-Continent and Rockies regions. \nAbout Kayne Anderson \nKayne Anderson Capital Advisors, L.P., founded in 1984, is a leading independent alternative investment management firm focused on niche investing in upstream oil and gas companies, energy infrastructure, specialized real estate, middle market credit, growth private equity and distressed municipal opportunities. Kayne’s investment philosophy is to pursue niches, with an emphasis on cash flow, where its knowledge and sourcing advantages enable it to deliver above average, risk-adjusted investment returns. Kayne manages approximately $28.5 billion in assets (as of 5/31/2015) for institutional investors, family offices, high net worth and retail clients and employs nearly 290 professionals in eight offices across the United States. \nThrough Kayne Anderson Energy Funds, the firm has raised over $4.3 billion of committed capital dedicated to energy private equity investments in primarily upstream and midstream oil and gas companies. Currently, the firm has over 30 active portfolio companies focused on upstream and midstream oil and gas assets across North America. \nThe firm is headquartered in Los Angeles with offices in Houston, New York City, Chicago, Denver, Dallas, Atlanta and Boca Raton. For more information, please visit www.kaynecapital.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20150709005145/en/ Contact:", "external_links": [], "published": "2015-07-09T16:00:00.000+03:00", "crawled": "2015-07-09T16:12:58.000+03:00", "highlightTitle": ""}