{"organizations": [], "uuid": "6f9718708cf1ea43029a693de283ace5aa2783fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/2/r/j/0/image.related.afrArticleLead.620x365.ghfy18.png/1436434277110.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/boss/boss-young-executives-2015-the-power-of-risktaking-20150709-ghfy18", "country": "AU", "title": "Boss Young Executives 2015: the power of risk-taking", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Boss Young Executives 2015: the power of risk-taking | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T22:00:00.000+03:00", "replies_count": 0, "uuid": "6f9718708cf1ea43029a693de283ace5aa2783fc"}, "author": "Lucinda Schmidt", "url": "http://www.afr.com/brand/boss/boss-young-executives-2015-the-power-of-risktaking-20150709-ghfy18", "ord_in_thread": 0, "title": "Boss Young Executives 2015: the power of risk-taking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Young Executives 2015, from left: Catherine Ball, Sujeet Rana, Michael Knight, Mandy Ross, Jorden Lam and Boris Musa. Photographed at The Darling Hotel, Star Casino, Sydney. James Brickwood by Lucinda Schmidt It’s not often that a successful executive talks of failure. Sujeet Rana, the 32-year-old head of digital for Woolworths, encourages it as a crucial indicator of performance. He is a big fan of “flearning” – giving his team autonomy to fail and learn. “I don’t think failing is a bad thing,” he says. “I need my team to be comfortable in taking risks and making mistakes. If you’re succeeding in everything you do, you’re probably not pushing yourself.”\nRana is one of the six BOSS Young Executives of 2015. The cohort has more in common than their youth and career success. Working in high-level leadership roles across industries ranging from fish farms to superannuation, all have made risky moves early in their careers that have propelled them to the top. And all six come across as collaborative, adaptable and comfortable with technology; these young leaders know that getting the best out of teams is about influence rather than control.\nPut to the test Their skills were put to the test in a simulated “day in the life of a CEO” exercise in early June, run by talent management consultants Development Dimensions International (DDI), which has partnered with BOSS on the program since 2004.\nTen contestants – selected after thorough checking of qualifications and employment histories – spent seven frenetic hours in structured role-play as the new chief executive of a fictional technology company. Given background material only a day or two before, the contestants had to prepare and present a strategy plan for the visiting global head, as well as a short podcast for staff.\nAs the day wore on, the demands on the contestants’ time and attention piled up, with multiple emails and meetings testing their leadership and decision-making skills.\n“It’s a high-fidelity, realistic experience, but it’s probably fair to say it’s a month in the life of a CEO,” says DDI Australia managing director Mark Busine. “That’s intentional; we want to see their leadership skills under a bit of pressure.”\nThe six winners were chosen after interviews with the judging panel of three senior business executives: Michael Rebelo, CEO, Saatchi & Saatchi (himself a BOSS Young Executive in 2004); Nerida Caesar, CEO and managing director, Veda; and Bonnie Boezeman, the chairwoman of ShopReply and POLi Payments, who has been a foundation judge since BOSS and DDI launched the Young Executives program in 2004.\n “I was incredibly nervous, but within half an hour it became exciting because it was so real,” says Rana, confessing that initially he kept using his usual email sign-off, “Suj”, rather than the fictional “Terry”. He also had to resist a natural inclination to respond immediately, learning instead to take a step back, pause and prioritise his time. Rana’s biggest surprise was how energised he felt at the end of the day and how much he had achieved.\nThe personal touch Catherine Ball, 35, describes the CEO simulation as “one of the most interesting and surreal days” of her life. “I just achieved so much that day; I learnt how good I am at focusing when I have to,” says Ball, who leads regional unmanned aerial systems (drones) for engineering consultancy URS Australia.\nShe also realised how much she has learnt from mentor Bob McGowan, URS Australia’s managing director, about being honest, calm and positive as the pressure mounted. “A few times I was thinking, ‘What would Bob do?’ ” she says, referring to creating an “ask Terry” email for staff of the fictional company.\nBack in her real job, Ball describes her leadership style as inclusive, open, honest and approachable. Her strength is as a “social architect”, connecting people across diverse business lines to further URS’s global leadership in drones for environmental and engineering data collection.\nShe’s also a strong advocate for women in an industry that blends the male-dominated fields of science and engineering. For example, if a conference has few female participants, she’ll request some free passes for her female colleagues.\nWhere she needs to lift her skills, Ball says, is in workload management to delegate more, maximise focus and minimise distractions. “I need to stop spreading myself too thin,” she says, adding that meditation and mindfulness practice helps.\nAlready, the DDI simulation has encouraged her to reduce email traffic and increase face-to-face and telephone communication.\nManaging relationships Jorden Lam, 30, company secretary and general counsel, HESTA, has also changed her email habits. “It gave me a real appreciation of what Debby’s [HESTA chief executive Debby Blakey’s] day must be like. Now I try and apply a higher level filter and wait until I email her.”\nFor Lam, the role-play reaffirmed what she thought she was good at – critical thinking, reasoning and problem solving. Her biggest challenge was a tough conversation managing a difficult employee, as she has not had direct reports in her real job.\nLam describes her leadership style as being built on personal relationships. “The personal touch helps you understand people’s motivators and how they work,” she says, adding that she deals with staff across nine business units.\n“I have to be collaborative and engage with all managers so I’m across what’s going on.” Even so, she’s thought about doing some training in how to influence people.\n“A lot comes naturally for me but it’s not a one-size-fits-all approach and I have to work with lots of different personalities.”\nLike Ball, Lam says her CEO has been a big influence. “I observe the way she leads and I’m in awe of how she does it. She’s very collaborative, gentle and warm, but so influential. She’s very different to an old-style CEO and shows you can have a light touch and be a nice person, and still be at the top.”\nEarly chance to shine Mandy Ross, 35, chief information officer, Tatts Group, found the DDI simulation challenging, exhausting and rewarding.\n“I reverted to being very task oriented, the more stress I was under,” she says. “I was very focused on getting the job done – in the real world, I need to step back and make sure it’s a dialogue.”\nShe describes her natural leadership style as a collaborative servant-leader, creating the right environment and removing roadblocks so her 12 direct reports and their 370 staff can do their work. Her strength, she says, is “making stuff happen”; where she is seeking to improve is in public speaking and facilitation, as well as corporate finance and governance.\nReasonable not possible Boris Musa, 32, stepped out of investment banking at Macquarie Group to join a former client, Mainstream Aquaculture, where he has been managing director and CEO of Mainstream Aquaculture since 2012.\nThe company is the world’s largest supplier of barramundi fingerlings and one of Australia’s biggest barramundi table fish suppliers. He describes his leadership style as inclusive, reliable and disciplined: “I’m demanding of myself and others, but I believe I’m considered and will listen to alternate views.”\nMusa says his biggest challenge is to manage what’s reasonable, rather than what’s possible. “That’s about balance,” he says.\n“I’ve tried to calibrate my style and intensity for different projects and personalities. As I’ve matured, I’ve developed a more nuanced approach to managing different motivational drivers.”\nFinding the stop button Michael Knight, 35, knows all about people’s motivators. He has been vice-president, human resources Australia and New Zealand, for office supplies company Staples for three years. It’s been a tough period of cost-cutting but in that time staff engagement has increased and voluntary turnover has decreased. He describes his leadership style as being about empowering people, building teams and getting them working well together.\nHis challenge is to find “a stop button”, to delegate more and to sometimes realise that the glass is half-empty. “I push myself and I push my team; I really do expect a lot. I always want to move forward. I’m an optimist but sometimes, if things aren’t going well, I probably need to acknowledge it more.”\nAs the pressures mounted during his day as “CEO”, Knight became more instinctive and was pleased he didn’t respond impulsively.\n“I was more detailed than I expected to be,” he says, adding that he read right through all the email threads. “But I’d go back to people once, not three or four times.” At the end of the day, he found himself typing an extra email to thank the factory manager.\nOpportunities to shine Rana has been at Woolworths for eight years. He was 24 in his first leadership role, managing staff in their 40s and 50s. “I’ve been known to grow a beard to look a bit older,” he laughs. He’s still the second-youngest in his team of eight direct reports and 200 staff and external partners.\n“I’ve been given many opportunities to shine by leaders giving me a chance when I was not 100 per cent ready,” he says.\nHe has repaid that compliment by promoting some of his team early and micro-managing them while they learn.\n“We get a better outcome as a result – you have to take a gamble on your team and trust them.” Ask him for an example of where he’s learnt from failure, and he responds: “You’ll need a book.”\nPlenty of times, he says, insufficient stakeholder management has meant that he has not articulated decisions to the right people. “It’s not about over-communicating; it’s about taking them on a journey so they can contribute more and you get better outcomes.\n“The real trick to leadership is to recognise you don’t know everything and be willing to leverage others’ knowledge.”\n‘Baptism of fire’ Another lesson Rana has learnt is to adapt his style to suit different personalities and generations, communicating information to some people verbally and to others in documents or pictures, depending on their preference. And he’s had his leadership group profiled to help him understand what drives them.\n“The whole point of leadership is not about what I’m saying, it’s more about the person who is listening to you,” he says.\nAs for areas to improve, Rana says he gets very passionate about work and can sometimes drive himself and others too hard. For example, a while back when he’d started a senior role with a much bigger team, he’d hop online at about 9pm to reply to the day’s emails. Soon he realised his dedicated team was also online at 9pm – then his wife pointed out it was probably because he was.\n“Now I write all my emails in the evening but I don’t send them until the morning,” he says. “I need to be careful about thinking everyone is on the boat with me; I need to step back and look.”\nGlobal outlook A global outlook is something the Young Executives of 2015 also have in common. All took risks to push their careers into what others might have seen as unexpected and uncharted territory.\nRoss says her decision, at age 27, to accept an unexpected promotion to CIO at Wotif.com was a major career turning point. Knight left South Africa to pursue his career; Ball emigrated from England at age 30, switching from academia to industry in what she describes as a “baptism of fire” on a Western Australian oil and gas project.\nMusa and Lam left well-paid jobs in banking and law for the corporate world. Lam was a fourth-year solicitor at a major commercial law firm, but took a 30 per cent pay cut for a junior compliance role at HESTA: “It was a bit of a leap of faith at the time; my friends thought I was mad.”\nRana took four months off work at a key career moment to complete his MBA at Duke University, which rounded out his skills beyond being “just the IT person”.\nSays DDI’s Busine: “The concept of career today is very different to 12 years ago [when BOSS Young Executives began]. Successful individuals recognise the need to manage their career and that sometimes a sideways or backward move – as perceived by others – is necessary to build skills.”\nLike Boss on Facebook . Follow Boss on Twitter . Join the LinkedIn conversation.", "external_links": ["https://www.facebook.com/AFRBoss", "https://www.linkedin.com/groups/BOSS-Magazine-4971364", "https://twitter.com/AFRBoss"], "published": "2015-07-09T22:00:00.000+03:00", "crawled": "2015-07-09T20:05:58.000+03:00", "highlightTitle": ""}