{"organizations": ["SEC"], "uuid": "5328c19afa8d3263123906c1f26709429267dc8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=C", "section_title": "Yahoo! Finance: C News", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://biz.yahoo.com/e/150715/c8-k.html", "country": "US", "title": "CITIGROUP INC Files SEC form 8-K, Change in Directors or Principal Officers, Financial Statements and Exhibits", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "CITIGROUP INC Files SEC form 8-K, Change in Directors or Principal Officers, Financial Statements and Exhibits", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T23:36:00.000+03:00", "replies_count": 0, "uuid": "5328c19afa8d3263123906c1f26709429267dc8d"}, "author": "", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://biz.yahoo.com/e/150715/c8-k.html", "ord_in_thread": 0, "title": "CITIGROUP INC Files SEC form 8-K, Change in Directors or Principal Officers, Financial Statements and Exhibits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Show all filings for CITIGROUP INC \nForm 8-K for CITIGROUP INC \n15-Jul-2015 \nChange in Directors or Principal Officers, Financial Statements and Exhibits Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. \nOn July 13, 2015, the Board of Directors (the \"Board\") of Citigroup Inc. (\"Citigroup\") elected Eugene M. McQuade as a non-employee director, effective July 13, 2015. Mr. McQuade served as Chief Executive Officer of Citibank, N.A., Citigroup's largest banking subsidiary, from July 2009 to March 31, 2014, and as Vice Chairman of Citigroup, from April 1, 2014 to May 1, 2015. Mr. McQuade is also the Chairman of the Board of XL Group. Prior to his service at Citibank and Citigroup, he served in various executive positions at Bank of America, FleetBoston Financial, and Merrill Lynch. \nSince Mr. McQuade served as the former CEO of Citibank and as Vice Chairman of Citigroup, the Board determined that Mr. McQuade is not independent in accordance with the director independence standards established under Citigroup's Corporate Governance Guidelines, which are intended to comply with the New York Stock Exchange corporate governance rules, and all other applicable laws, rules and regulations. Mr. McQuade will continue to serve as a director of Citibank and he will serve on Citigroup's and Citibank's Risk Management Committees. \nMr. McQuade will receive compensation as a non-employee director in accordance with Citigroup's non-employee director compensation practices described in \"Proposal 1: Election of Directors - Directors' Compensation\" of Citigroup's Annual Proxy Statement filed with the Securities and Exchange Commission on March 18, 2015. Mr. McQuade received compensation from Citigroup in 2015 for his service as Vice Chairman in the form of a base salary. The amount of base salary paid to him for his service from January 1, 2015 to May 1, 2015 was $172,602.72. In addition, he was eligible for benefits under broad-based plans on the same terms as Citigroup employees generally. There are no family relationships between Mr. McQuade and any officer or other director of Citigroup. There is no arrangement or understanding between Mr. McQuade and any other person pursuant to which he was selected as a director. \nA copy of Citigroup's press release relating to the appointment of Mr. McQuade as director is being furnished as Exhibit 99.1 to this Current Report on Form 8-K. Item 9.01 Financial Statements and Exhibits. \n(d) Exhibits \nThe following exhibit is furnished as part of this Current Report on Form 8-K: \nExhibit Number", "external_links": [], "published": "2015-07-15T23:36:00.000+03:00", "crawled": "2015-07-16T02:21:55.000+03:00", "highlightTitle": ""}