{"organizations": ["Hindustan Times"], "uuid": "5fc5118431d74c3cfcb0f8882cccd8b8e80c082f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/6/7f8852a3-1492-4c2b-9e5d-fdff2dfbcc4cMediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Business\r", "section_title": "Business News, Personal Finance, Financial News, India Stock Market Investing", "url": "http://www.hindustantimes.com/business-news/imf-india-to-grow-faster-in-2015-china-s-growth-to-dip/article1-1367627.aspx", "country": "IN", "title": "IMF: India to grow faster in 2015, China's growth to dip", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "IMF: India to grow faster in 2015, China's growth to dip", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T21:08:00.000+03:00", "replies_count": 0, "uuid": "5fc5118431d74c3cfcb0f8882cccd8b8e80c082f"}, "author": "", "url": "http://www.hindustantimes.com/business-news/imf-india-to-grow-faster-in-2015-china-s-growth-to-dip/article1-1367627.aspx", "ord_in_thread": 0, "title": "IMF: India to grow faster in 2015, China's growth to dip", "locations": ["Washington", "China", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Abhimanyu Sinha"], "text": "HT Correspondent, Hindustan Times , Washington | Updated: Jul 10, 2015 03:28 IST India is projected to grow by 7.5% in 2015, over 7.3% in 2014 and maintain that pace in 2016. China will dip to 6.8% from 7.4% in 2014, and will continue to slide in 2016.(Illustration: Abhimanyu Sinha) \nIndia will grow faster in 2015 from 2014, according to the IMF’s World Economic Outlook report released Thursday, as China’s growth will slow down over the same period. \nIndia is projected to grow by 7.5% in 2015, over 7.3% in 2014 and maintain that pace in 2016. China will dip to 6.8% from 7.4% in 2014, and continue to slide in 2016. \nGlobal growth is expected to slide from 3.4% in 2014 to 3.3% in 2015 — on account of “a gradual pickup in advanced economies and a slowdown in emerging market and developing economies\" — and then go up to 3.8% in 2016. \nAbout Greece, the report said development there “have, so far, not resulted in any significant contagion. Timely policy action should help to manage such risks if they were to materialize”. \nChina’s slide was attributed to its rebalance, the transition to a new growth model, which, the report also listed as a risk factor that could muddy its projections. \n“The puncture of what had clearly become a stock market bubble may have some limited effect on spending. But, for the moment, the slowdown in growth is primarily led by a slowdown in real estate investment, a development we see as basically desirable,\" IMF’s chief economist Olivier Blanchard, the IMF's chief economist, said about China at a news conference. \nThe Fund warned that China could see \"greater difficulties\" in its transition to a new growth model focused more on domestic demand than investments. \nWhile growth in advanced economies as a group — the US, Europe and Japan — are projected to increase, emerging markets and developing economies — India, China and others will slow down, along expected lines. Tags", "external_links": [], "published": "2015-07-09T21:08:00.000+03:00", "crawled": "2015-07-10T05:23:20.000+03:00", "highlightTitle": ""}