{"organizations": [], "uuid": "140c3413e8bde3ce8df72cf909572764651a8375", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/20/markets-stocks-usa-idUSL3N1004GB20150720", "country": "US", "title": "US STOCKS-Wall St higher as earnings boost confidence", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "US STOCKS-Wall St higher as earnings boost confidence | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T21:08:00.000+03:00", "replies_count": 0, "uuid": "140c3413e8bde3ce8df72cf909572764651a8375"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/20/markets-stocks-usa-idUSL3N1004GB20150720", "ord_in_thread": 0, "title": "US STOCKS-Wall St higher as earnings boost confidence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Apple biggest boost to three major indexes\n* Gold touches 5-year low; Copper, oil prices fall\n* Vivint Solar soars after SunEdison deal\n* Indexes up: Dow 0.19 pct, S&P 0.19 pct, Nasdaq 0.27 pct (Updates to early afternoon)\nBy Tanya Agrawal\nJuly 20 (Reuters) - Wall Street was higher in early afternoon trading on Monday as better-than-expected earnings from big companies overshadowed a fall in commodities.\nShortly after trading began, the tech-heavy Nasdaq composite added to its gains from last week and touched a record for the third straight day as investors shift their focus to earnings from concerns surrounding Greece and China.\nGold prices plunged as much as 4 percent to their lowest in more than five years while copper prices hit their lowest in nearly two weeks. Oil prices fell too on signs of a growing glut in refined products.\nThe dollar index was up marginally at $97.87. It had earlier hit a three-month high due to expectations of a Federal Reserve rate hike this year.\n\"The commodity markets are lower which are a concern because if those prices fall then economic growth isn't as strong as we thought,\" said Paul Nolte, portfolio manager at Kingsview Asset Management in Chicago.\nOn Friday, strong earnings from Google pushed the tech-heavy Nasdaq to a record close, which gained 4.3 percent for the week, its largest weekly gain since October while the S&P 500 stopped just short of its record high.\nTech earnings will continue to be in focus this week with IBM reporting after the close on Monday and other big tech giants such as Apple, Yahoo and Microsoft expected to report later this week.\nOf the companies that have reported earnings so far, 71 percent have reported earnings above analyst expectations, above the 63 percent that typically beat in a quarter.\nHowever, only 51 percent have beaten on revenue, below the 61 percent.\nU.S. companies were expected to post their worst sales decline in nearly six years in the second quarter, in part due to the strong dollar that reduces the value of U.S. companies' overseas income. Profit is expected to have fallen 2.9 percent, according to Thomson Reuters estimates.\n\"Revenue growth is very weak and unless you see some sustainable growth, we'll continue to see sideways movement for the rest of the year,\" said Nolte.\nAt 12:53 p.m. ET (1653 GMT) the Dow Jones industrial average was up 34.74 points, or 0.19 percent, at 18,121.19, the Nasdaq Composite was up 13.85 points, or 0.27 percent, at 5,223.99.\nThe S&P 500 was up 3.97 points, or 0.19 percent, at 2,130.61, just 4 points shy of its all-time high of 2134.72, set in May.\nSix of the 10 major S&P 500 sectors were higher with the technology index leading the advancers with a 0.52 percent rise.\nApple's 2 percent rise was the biggest boost to the three major indexes.\nMorgan Stanley rose as much as 1.8 percent to an almost seven-year high of $40.94, after the bank's profit beat expectations as its bond and equities trading businesses handily outperformed those of its Wall Street rivals.\nPayPal Holdings was up 6.3 percent to $40.80, on its trading debut after it split from e-commerce company eBay .\nVivint Solar soared 44 percent to $15.66 after solar company SunEdison said it would buy the company in a deal valued at about $2.2 billion, including debt. SunEdison was up 2.5 percent to $32.27.\nHasbro rose as much as 6.7 percent to an all-time high of $83.52 after the U.S. toymaker reported a lower-than-expected decline in quarterly revenue, helped by strong demand for its \"Jurassic World\"- and \"Star Wars\"-themed toys.\nDeclining issues outnumbered advancers on the NYSE by 1,885 to 1,108. On the Nasdaq, 1,748 issues fell and 975 advanced.\nThe S&P 500 index showed 39 new 52-week highs and 29 new lows, while the Nasdaq recorded 108 new highs and 105 new lows. (Editing by Don Sebastian)", "external_links": [], "published": "2015-07-20T21:08:00.000+03:00", "crawled": "2015-07-20T20:14:57.056+03:00", "highlightTitle": ""}