{"organizations": [], "uuid": "d30f9504fc4a2cf25ed190a0a7cebb9be45cf5c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.therepublic.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/s3.amazonaws.com/hne-smedia/2/2/225d68cb53b1493ea80b9335a0583aff/web_full_449110050804.jpg", "site_section": "http://www.therepublic.com/feed/subject/5bfcea40857510048d1dff2260dd383e", "section_title": "Personal finance News from TheRepublic.com", "url": "http://www.therepublic.com/view/story/225d68cb53b1493ea80b9335a0583aff/US--Fraud-Scheme-Sentencing", "country": "US", "title": "'Citizen of the year' gets 14 years in California fraud case", "performance_score": 0, "site": "therepublic.com", "participants_count": 0, "title_full": "'Citizen of the year' gets 14 years in California fraud case", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T01:06:00.000+03:00", "replies_count": 0, "uuid": "d30f9504fc4a2cf25ed190a0a7cebb9be45cf5c4"}, "author": "", "url": "http://www.therepublic.com/view/story/225d68cb53b1493ea80b9335a0583aff/US--Fraud-Scheme-Sentencing", "ord_in_thread": 0, "title": "'Citizen of the year' gets 14 years in California fraud case", "locations": ["California"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Citizen of the year' gets 14 years in prison in California fraud case \nBy AMANDA LEE MYERS Published: 7/2/15 6:06 pm EDT - Updated: 7/2/15 6:09 pm EDT \nLOS ANGELES — A former California real estate developer once honored as his city's citizen of the year was sentenced Thursday to the maximum 14 years in prison for bilking investors who poured millions of dollars into failed development projects. \nFederal Los Angeles Judge Otis Wright handed down a harsher sentence than the government had requested for Kelly Gearhart, 53, who pleaded guilty last year to wire fraud and money laundering. Gearhart, who now lives in northeastern Ohio, apologized through tears Thursday to the mostly elderly people he cheated. \n\"I'm so sorry for all the heartache I caused,\" Gearhart said with a quavering voice. \"I've lost everything I had. I've found material things have no value compared to the trust and friendship of those who believed in me. I valued that the most and now it's gone.\" \nGearhart's attorneys had requested five years in prison, while federal prosecutors asked for 11. \nAs federal marshals handcuffed Gearhart, two investors smiled while a third cried. \nJudge Otis Wright spoke sternly to Gearhart, saying he gave great weight to hundreds of elderly investors \"who had counted on this money to see them through their so-called golden years.\" \n\"I would imagine many of them have a number of sleepless nights worrying about what their future holds in store. And for what?\" Wright asked. \nHe said Gearhart has done nothing to show he was motivated by anything other than \"sheer greed.\" \nGearthart and his attorney argued that he wasn't using investor money on himself, but had begun extensive work on the real estate projects they had funded, and when the housing market collapsed in 2007, scrambled to use his own money to try to get them finished. \n\"It's kind of like being a good swimmer and thinking you can outswim the biggest wave and realizing halfway through it that you can't,\" Firdaus Dordi told the judge before sentencing. \"Mr. Gearhart drowned.\" \nDordi said Gearhart was motivated by pride, arrogance and determination not to see his business fail. \nIn his plea agreement with prosecutors, Gearhart admitted selling the same lots in a real estate project to multiple investors, telling them that they would be paid back with interest. Gearhart also admitted using the same lots to get bank financing. \nIn all, Gearhart cheated more than 250 investors out of at least $15 million, federal prosecutor Stephen Goorvitch said. \n\"His conduct was quite brazen,\" Goorvitch said. \"Mr. Gearhart is just saying whatever to the victims to get their money, making all these promises even though he's losing money on his projects ... He sells the lots over and over again even though the lots are being used to secure the victims' investments. He lies to the bank and uses the money as a personal piggy bank.\" \nBoth attorneys disagreed about the significance of Gearhart's contributions to his community, Atascadero, on California's central coast. After working as a prison guard for eight years, Gearhart built a construction and real estate business from the ground up in 1992, completing hundreds of successful homes and commercial properties over the years, Dordi said. \nIn 2006, Atascadero's chamber of commerce named Gearhart citizen of the year, citing $500,000 in charitable donations. \nGoorvitch said donations mean a lot less if any of the money came from investors. \n\"He was a trusted professional in the community, he was citizen of the year,\" Goorvitch said. \"To me those people should be held to a higher standard.\" \nAn Oct. 20 hearing will determine how much restitution Gearhart will be ordered to pay investors, though prosecutors note that Gearhart may not have any money left. \nKelly Stark, 66, said Gearhart's sterling reputation swayed him to invest $175,000 in several projects; he lost it all. \nAfter sentencing, Stark said he felt relief and closure. \n\"He just destroyed people,\" Stark said. \nMonetta Grabowski, 69, spoke through tears earlier this week about how she lost $27,000 she invested hoping for a bigger supplement to what she gets from retirement. \n\"We were not rich people,\" Grabowski said. \"Most of us can never earn the money back.\" \nFollow Amanda Lee Myers on Twitter at https://twitter.com/AmandaLeeAP FILE - In this April 26, 2005 file photo, former Atascadero Citizen of the Year Kelly Gearhart poses in front of the Printery building in Atascadero, Calif. Gearhart, 53, was sentenced Thursday, July 2, 2015 to 14 years in prison for bilking investors who poured millions of dollars into failed development projects. Gearhart pleaded guilty last year to wire fraud and money laundering as part of a plea agreement with prosecutors. Los Angeles federal Judge Otis Wright sentenced Gearhart, who now lives in Ohio, after hearing on Monday from various investors who said the developer robbed them of their savings and ruined their lives.(Joe Johnston/The Tribune (of San Luis Obispo) via AP, File) MANDATORY CREDIT \n  Photo Gallery: Click to view (3 Photos)  ", "external_links": [], "published": "2015-07-03T01:06:00.000+03:00", "crawled": "2015-07-03T01:12:07.000+03:00", "highlightTitle": ""}