{"organizations": [], "uuid": "7f870052977e39cda2e8b101bbedac913161faf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/b/6/n/m/image.related.afrArticleLead.620x365.ghhgek.png/1437958388560.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/afr-magazine/150-years-on-alices-adventures-in-wonderland-by-lewis-carroll-takes-a-turn-20150727-ghhgek", "country": "AU", "title": "150 years on, Alice's Adventures in Wonderland by Lewis Carroll takes a turn", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "150 years on, Alice's Adventures in Wonderland by Lewis Carroll takes a turn | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T08:53:00.000+03:00", "replies_count": 0, "uuid": "7f870052977e39cda2e8b101bbedac913161faf5"}, "author": "Share via Email", "url": "http://www.afr.com/brand/afr-magazine/150-years-on-alices-adventures-in-wonderland-by-lewis-carroll-takes-a-turn-20150727-ghhgek", "ord_in_thread": 0, "title": "150 years on, Alice's Adventures in Wonderland by Lewis Carroll takes a turn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "POLIXENI PAPAPETROU 'RIDDLES THAT HAVE NO ANSWERS', 2004. COURTESY THE ARTIST AND STILLS GALLERY, SYDNEY by Simon Hughes That the Dormouse never said “feed your head” is a source of some disappointment. What was Grace Slickon about in Jefferson Airplane’s White Rabbit ? More to the point: what was Grace Slick on? We are led to these musings on the occasion of the sesquicentenary of the first publication of Alice’s Adventures in Wonderland . This hallucinogenic excursion, composed while Mr Dodgson​ rowed up river with the Liddell children, the eponymous Alice chief among them, has fixed itself in the collective imagination ever since.\nYou might be interested to learn, for instance, that Finnegans Wake is in part inspired by Alice: “Alicious, twinstreams twinestraines, through alluring glass or alas in jumboland.” Riffing on the title of Lewis Carroll’s now canonical work turns out to be something of a pastime for subsequent writers. Almost a cliché. You will find, with aid of Google search, Alice in Blunderland, Grammarland, Puzzle-Land, Quantumland, Otherland, Underland, Sunderland – and on it goes.\nEveryone, it seems, who has pored over the adventures of Alice, or listened rapt while being read to, constructs within their memory a small shrine to the girl who fell down the rabbit hole.\nHow to explain the enduring spell Alice casts over readers? The chief attraction for children, you have to think, is Sir John Tenniel’s​ illustrations. His beautifully detailed drawings give form to a narrative which threatens at every turn to dissolve into entropy as Carroll seriously tests the Newtonian, not to say Einsteinian, universe. And the oddness of Alice – her head is surely too big for her body – appeals to the child who is fast learning that difference in a conformist world can present its challenges.\nThe greatest triumph of Alice’s Adventures in Wonderland , though, lies in its demonstration of the sheer power of the literary imagination. Wonderland is a realm which can encompass an OCD white rabbit, a trial where the accused is sentenced first, a tea party where there is “no room” when clearly there is plenty, and the possibility of running faster to stay in the same place. You are hooked by the intriguing nonsense of it all.\nOnly one mystery remains: what did the Dormouse say? Whatever it was, we are destined never to know for, as Alice learns, the Hatter’s madness has impaired his memory. “But what did the Dormouse say?” one of the jury asked.\n“That I can’t remember,” said the Hatter. Curiouser and curiouser.\nMacmillan, the original publishers of Alice’s Adventures in Wonderland , have released an anniversary edition of The Complete Alice ($54).\n Reviews Flesh Wounds\nRichard Glover\nABC Books, $29.99\nWith an emotionally remote and self-absorbed mother and an alcoholic father, Richard Glover had always considered himself \"self-raising, like flour\". Certainly he was left to unpick the porkies his mother retailed about her aristocratic upbringing and his conception. Life, at least until he meets his soul mate in the 70s, is one of serial disillusionment: the selfless teacher is in fact a creep with designs on his mother; the useful theatre connection in London an unattractive sexual opportunist. Not since Unreliable Memoirs by Clive James has there been a funnier, more poignant portrait of an Australian childhood.\nYou Don't Have To Live Like This\nBenjamin Markovits​\nFaber, $29.99\nBarack Obama has won the presidency just as the world is sliding further into the abyss of the global financial crisis. Abroad there are wars and rumours of war but it is in the urban wastes of America's cities where the saddest battles are fought. Robert James has a vision to renew blighted Detroit and enlists the aid of acquaintance Greg Marnier to realise his vision. Marnier, a jobbing academic, is about to be introduced to the real world of grassroots politics, where all the stakeholders jostle for room at the trough. Markovits ably depicts a culture on the knife-edge, where a chance event can tip the balance.\nMr Mojo: A biography of Jim Morrison\nDylan Jones\nBloomsbury, $19.99\nBy his own reckoning, Jim Morrison was the Lizard King and he could do anything. On the point of such hubris are heroes impaled. When Morrison died in 1971 of an apparent heroin overdose in Paris aged 27, he was in the process of reinventing himself as a poet. There was always the sense that he found the whole pop star shtick infra dig. When you visit Père-Lachaise Cemetery where he is buried, as Dylan Jones did, you will find disaffected youth leaving trite memorials. It could be a metaphor for the whole 60s thing. A hangover from a party whose fabulousness is for most of us only a tantalising rumour.\n30-Second Evolution\nNicholas Battey and Mark Fellowes\nPier 9, $19.99\nIf you don't have time to get to know Stephen Jay Gould, then this is a tasty degustation of evolutionary theory. You will, in pithy synopses, learn the difference between mutation and speciation, ontogeny and phylogeny, and you will learn about sex. Here the authors ask what is the use of males when so many species are able to reproduce clones asexually at an exponential rate. The answer is deleterious mutations that can accumulate and lead to extinction. Genetic engineering might bring evolution as we understand it to an end. Survival of the fittest is due to take on an altogether different meaning.", "external_links": [], "published": "2015-07-27T08:53:00.000+03:00", "crawled": "2015-07-27T10:06:26.916+03:00", "highlightTitle": ""}