{"organizations": [], "uuid": "d6ac6b0d79a4e8aff3126fa3a2f1f169e029a1ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/britain-needs-stay-eu-support-123448505.html", "country": "GB", "title": "Britain needs to stay in EU to support transatlantic ties, Obama says", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Britain needs to stay in EU to support transatlantic ties, Obama says", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T15:34:00.000+03:00", "replies_count": 0, "uuid": "d6ac6b0d79a4e8aff3126fa3a2f1f169e029a1ff"}, "author": "", "url": "https://uk.finance.yahoo.com/news/britain-needs-stay-eu-support-123448505.html", "ord_in_thread": 0, "title": "Britain needs to stay in EU to support transatlantic ties, Obama says", "locations": ["Britain", "EU"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 24, 2015, 13:38 BST - UK Markets close in 2 hrs 52 mins Britain needs to stay in EU to support transatlantic ties, Obama says Reuters - UK Focus – 4 minutes 10 seconds ago \n* Britain's role in EU has made world a safer place, Obama says \n* Conservative politician accuses U.S. president of lecturing (Changes date, adds LONDON dateline and British reaction) \nBy William James and Peter Cooney \nLONDON/WASHINGTON, July 24 (Reuters) - U.S. President Barack Obama said he wants Britain to stay in the European Union and help maintain the post-war transatlantic partnership, prompting angry responses from Eurosceptic lawmakers in London. \n\"Having the United Kingdom in the European Union gives us much greater confidence about the strength of the transatlantic union,\" Obama said in an interview with the BBC. He said Britain being inside the EU had helped make the world a safer and more prosperous place since World War Two. \n\"We want to make sure that the United Kingdom continues to have that influence. Because we believe that the values that we share are the right ones, not just for ourselves, but for Europe as a whole and the world as a whole.\" \nBritish Prime Minister David Cameron is seeking reforms to Britain's ties with the EU ahead of a membership referendum by the end of 2017, a bid to appease Eurosceptic voters and lawmakers within his own party. He has said he wants to stay in a reformed EU, but has ruled nothing out if his renegotiation is unsuccessful. \nObama has previously said it was hard for him to imagine the European project working without Britain or Britain prospering outside the union. \nHis latest intervention in the debate over a possible British exit from the bloc angered some politicians. \n\"President Obama is wrong about the UK and the EU,\" John Redwood, a lawmaker from Cameron's Conservative Party, said on his website. He accused Obama of lecturing Britain. \n\"If letting foreign countries impose laws on you, levy taxes on you, and spend your money is such a good idea why doesn't he create an American Union so Mexico can have common borders with the U.S.?\" he said. \nThe opposition Labour Party, which wants Britain to remain in the EU, also seized on Obama's remarks, saying Cameron's \"weakness and indecision are putting our country's future international influence and prosperity at risk\". \nCameron's planned EU vote and British cuts to military spending in recent years have caused concern in Washington. But Obama congratulated the government on committing to NATO's defence spending pledge of two percent of GDP for the next five years. \nThe United States is Britain's second biggest trade partner behind the EU and has been its closest military ally for more than a century. \nCameron's office defended the decision to hold a referendum. \n\"It's right for Britain to have this renegotiation and this referendum to address the concerns that the British people have about Europe and to make sure the British people have the final say about whether we stay in a reformed European Union or leave,\" a source from his office said. (Additional reporting by Kylie MacLellan; Editing by Digby Lidstone)", "external_links": [], "published": "2015-07-24T15:34:00.000+03:00", "crawled": "2015-07-24T15:39:47.623+03:00", "highlightTitle": ""}