{"organizations": ["BHP"], "uuid": "02947102d9bf51d3537ccc2b906bde13f23db338", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/bhp-beats-fiscal-2015-iron-233456275.html", "country": "US", "title": "BHP beats fiscal 2015 iron ore guidance, takes copper hit", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "BHP beats fiscal 2015 iron ore guidance, takes copper hit", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T02:34:00.000+03:00", "replies_count": 0, "uuid": "02947102d9bf51d3537ccc2b906bde13f23db338"}, "author": "", "url": "https://uk.finance.yahoo.com/news/bhp-beats-fiscal-2015-iron-233456275.html", "ord_in_thread": 0, "title": "BHP beats fiscal 2015 iron ore guidance, takes copper hit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 22, 2015, 00:43 BST - UK Markets open in 7 hrs 17 mins BHP beats fiscal 2015 iron ore guidance, takes copper hit Reuters - UK Focus – 8 minutes ago +0.38 \n* BHP beats fiscal 2015 iron ore guidance \n* Says will take up to $650 million writedown in copper (Adds iron ore production figures, prices copper impairment) \nBy James Regan \nSYDNEY, July 22 (Reuters) - BHP Billiton (NYSE: BBL - news ) beat its own production guidance for iron ore in fiscal 2015 and said it was on track for additional growth in the current year following major expansion work. \nThe global miner also flagged a further hit to its full-year underlying profit of up to $650 million, chiefly linked to writedowns in its copper business. \nThe impairments come on top of $2 billion in post-tax writedowns to its U.S. shale oil division announced last week. \nOutput at its Western Australia iron ore mines increased by 13 percent to a record 254 million tonnes in the year ended June 30 versus previous guidance of 250 million tonnes, the company said on Wednesday. \n\"Better productivity will be the sole source of volume growth at Western Australia Iron Ore in the 2016 financial year with production forecast to increase by 7 percent and unit costs are expected to fall to US$16 per tonne,\" Chief Executive Andrew Mackenzie said in the latest company production report. \nFurther productivity improvements would contribute to an increase to 290 million tonnes a year over time, BHP said. The miner in April deferred a port project that would have boosted output to 290 million tonnes by mid-2017. \nBHP is facing ever-stiffer competition from Vale and Rio Tinto (LSE: RIO.L - news ) for its share of the seabourne iron ore trade, which many analysts believe will not meet bullish forecasts, contributing to a collapse prices. \nBHP said it saw a 41 percent decline in the price of its ore in fiscal 2015 to $61 per wet metric tonne. Iron ore is trading around $52 a tonne, down from prices above $190 in early 2011 on slowing demand growth in China. \nThe June quarter output for BHP's share of production of 60.1 million tonnes was in line with analysts' estimates of 60 million tonnes. The full-year production figures and guidance take into account the share of output for BHP's joint venture partners in some mines. \nRival Rio Tinto this month cut its calendar 2015 target for shipments by 10 million tonnes to 340 million tonnes after two cyclones disrupted operations. \nBHP said it expects the latest impairments to total between $350 million and $650 million, mostly tied to its Cerro Colorado mine in Chile and redundancies in the overall copper business. A reduction in the use of rigs will also contribute between $50 million and $150 million to the writedown. (Editing by Richard Pullin)", "external_links": [], "published": "2015-07-22T02:34:00.000+03:00", "crawled": "2015-07-22T02:44:33.267+03:00", "highlightTitle": ""}