{"organizations": [], "uuid": "146f7efd617daee5d852b1c3ffc9eb5982c84589", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/15/mideast-factors-idUSL5N0ZV05C20150715", "country": "US", "title": "MIDEAST STOCKS - Factors to watch - July 15", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "MIDEAST STOCKS - Factors to watch - July 15 | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T07:44:00.000+03:00", "replies_count": 0, "uuid": "146f7efd617daee5d852b1c3ffc9eb5982c84589"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/15/mideast-factors-idUSL5N0ZV05C20150715", "ord_in_thread": 0, "title": "MIDEAST STOCKS - Factors to watch - July 15", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DUBAI, July 15 Here are some factors that may affect Middle East stock markets on Wednesday. Reuters has not verified the press reports and does not vouch for their accuracy.\nINTERNATIONAL/REGIONAL\n* GLOBAL MARKETS-Asian shares pare gains as China markets slump\n* MIDEAST STOCKS-Gulf markets mostly firm, Oman outperforms after Iran deal\n* Oil prices edge up as Iranian exports to take time to ramp up post-deal\n* Gold marks time ahead of testimony from Fed's Yellen\n* Saudi-backed forces seize Aden airport in sudden advance\n* U.N. Syria envoy meets southern rebels and opposition armed groups\n* UN delivers urgent food and health supplies to Aden\n* Turkish court deals blow to Erdogan, overturns law that shut rival's schools\n* Algeria's central bank says foreign reserves fall $19 bln in first qtr\nIRAN\n* Iran deal reached, Obama hails step towards \"more hopeful world\"\n* After Iran deal, U.S. companies face being left out in cold\n* Iran deal could help India boost exports by over a third -trade body\n* Iran deal could unleash big pent-up commercial aircraft demand\n* Peugeot plans expanded Iran venture after nuclear deal\n* Iran gears up for trade and investment boom that could reshape region\n* Turkish exporters see trade with Iran doubling to $35 billion in 2016\nEGYPT\n* Egypt's GASC buys 235,000 tonnes of Russian, Romanian wheat\n* Egypt hopes Iran nuclear deal will prevent Middle East arms race\n* Egypt's Juhayna says Q2 net income rises 64 pct\n* Egyptian pound steady at auction, parallel market\n* Egypt's Beltone Financial to seek $25.5 mln in August share sale\nSAUDI ARABIA\n* Obama phoned Saudi King Salman to discuss Iran deal, Yemen -White House\n* Iran's nuclear deal puts Saudis on edge\n* Saudi crude output likely to stay high in summer - Gulf delegate\n* Saudi Electricity Q2 profit drops as fails to repeat one-time debt gain 5110.SE\n* Saudi's Ma'aden Q2 net profit falls 27 pct, misses forecasts\n* Saudi Electricity seeks multi-billion-dollar loan - sources\n* Saudi's SAFCO says starts commercial ops at delayed urea plant\n* TABLE-Saudi Arabia Q2 earnings estimates\n* Saudi's Fawaz Alhokair Co Q1 net profit rises 10.25 pct; misses forecast\n* Saudi's Yansab Q2 net profit slips 63 pct [ID:nL5N0ZU0F6\n* Saudi's Dar Al Arkan Q2 net profit falls 42 pct\nUNITED ARAB EMIRATES\n* Obama called Abu Dhabi crown prince about Iran deal\n* UAE congratulates Iran on atomic deal, first official Gulf comment\n* TABLE-Abu Dhabi Q2 earnings estimates\n* TABLE-Dubai Q2 earnings estimates\n* UAE's Aldar says makes 1.9 bln dhs sales in H1 2015 on new projects\n* TABLE-Dubai June inflation falls to 4.2 pct y/y\nKUWAIT\n* Kuwait Finance House posts 13.7 pct Q2 profit gain, misses estimates\n* Kuwait bank NBK targets Egypt growth as Q2 profit gains 10 pct\n* Kuwait's Gulf Bank Q2 net profit jumps 28.7 pct on higher income\n* TABLE-Kuwait Q2 earnings estimates\nQATAR\n* Qatari bank CBQ beats forecasts with 17.3 pct jump in Q2 net profit\n* Qatari shipper Nakilat Q2 net profit gains 12.3 pct\n* Qatar's Doha Bank Q2 net profit dips 1.8 pct, misses estimates\n* TABLE-Qatar Q2 earnings estimates\n* Qatar's QIB Q2 net profit jumps 27 pct\nOMAN\n* Oman's Bank Sohar signs $250 mln 3-yr loan - arranger\n* National Bank of Oman profits rise, deposits fall\n* TABLE-Oman Q2 earnings estimates\n* Oman's Bank Dhofar Q2 net profit rises 5.15 pct\n* Boeing to support Oman Air 787 dreamliner introduction\n* TABLE-Oman June consumer prices rise y/y, first time in three months\n* Bank Muscat Q2 net marginally lower, beats estimates\n* Oman's Raysut Cement Q2 net profit falls 33 pct\nBAHRAIN\n* U.S. concerned by Bahrain moves against opposition\n* TABLE-Bahrain Q2 earnings estimates\n* Bahrain frees rights activist for health reasons - agency\n* Bahrain's Arcapita buys part of Abu Dhabi property project for $200 mln (Compiled by Dubai newsroom)", "external_links": [], "published": "2015-07-15T07:44:00.000+03:00", "crawled": "2015-07-15T06:54:20.000+03:00", "highlightTitle": ""}