{"organizations": ["S & T Bancorp Inc"], "uuid": "759a40eba80a4028b74b57800b8380749c7d63da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dakotafinancialnews.com", "main_image": "http://www.dakotafinancialnews.com/logos/st-bancorp-logo.png", "site_section": "http://www.google.ca/finance/company_news?q=NASDAQ:STBA&ei=zIG5U_DmF4W-wQOOoICIDQ&output=rss", "section_title": "News for S & T Bancorp Inc - Google Finance", "url": "http://www.dakotafinancialnews.com/s-t-bancorp-inc-plans-dividend-of-0-18-stba/299033/", "country": "IL", "title": "S & T Bancorp Inc Plans Dividend of $0.18 (STBA)", "performance_score": 0, "site": "dakotafinancialnews.com", "participants_count": 0, "title_full": "S & T Bancorp Inc Plans Dividend of $0.18 (STBA)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T18:56:00.000+03:00", "replies_count": 0, "uuid": "759a40eba80a4028b74b57800b8380749c7d63da"}, "author": "", "url": "http://www.dakotafinancialnews.com/s-t-bancorp-inc-plans-dividend-of-0-18-stba/299033/", "ord_in_thread": 0, "title": "S & T Bancorp Inc Plans Dividend of $0.18 (STBA)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nS & T Bancorp (NASDAQ:STBA) declared a dividend on Monday, July 20th, Analyst Ratings Network.com reports. Shareholders of record on Thursday, August 6th will be paid a dividend of 0.18 per share by the financial services provider on Thursday, August 20th. The ex-dividend date of this dividend is Tuesday, August 4th. \nSeveral brokerages have weighed in on STBA. Keefe, Bruyette & Woods reaffirmed a “buy” rating on shares of S & T Bancorp in a research report on Thursday, July 23rd. Zacks raised S & T Bancorp from a “hold” rating to a “buy” rating and set a $37.00 price objective for the company in a report on Wednesday, July 22nd. Piper Jaffray lowered S & T Bancorp from an “overweight” rating to a “neutral” rating and lifted their target price for the company from $30.00 to $32.00 in a report on Wednesday, July 22nd. They noted that the move was a valuation call. Finally, RBC Capital lifted their price target on S & T Bancorp from $29.00 to $32.00 and gave the company a “sector perform” rating in a research report on Wednesday, July 22nd. Four investment analysts have rated the stock with a hold rating and two have given a buy rating to the company’s stock. The stock presently has a consensus rating of “Hold” and a consensus target price of $32.50. \nShares of S & T Bancorp ( NASDAQ:STBA ) traded up 0.92% during mid-day trading on Thursday, hitting $30.81. The stock had a trading volume of 14,256 shares. S & T Bancorp has a 12 month low of $30.24 and a 12 month high of $30.81. The stock’s 50-day moving average is $30.05 and its 200 day moving average is $28.67. The company has a market cap of $1.07 billion and a PE ratio of 16.08. \nS & T Bancorp (NASDAQ:STBA) last issued its quarterly earnings results on Tuesday, July 21st. The financial services provider reported $0.52 earnings per share (EPS) for the quarter, topping the Thomson Reuters consensus estimate of $0.48 by $0.04. The business had revenue of $62.20 million for the quarter, compared to the consensus estimate of $59 million. During the same quarter in the prior year, the company posted $0.49 earnings per share. On average, equities research analysts forecast that S & T Bancorp will post $2.05 earnings per share for the current fiscal year. \nIn related news, Director James Thomas Gibson sold 75,000 shares of the business’s stock in a transaction on Thursday, July 23rd. The stock was sold at an average price of $32.54, for a total transaction of $2,440,500.00. The sale was disclosed in a filing with the SEC, which can be accessed through the SEC website . \nS&T Bancorp, Inc. ( NASDAQ:STBA ) is a bank holding company. The Company operates through its wholly owned subsidiaries, including   S&T operates   which   deposits,   services; Wealth Management, which offers   deeds, guardian and custodian of employee benefits and other trust and brokerage services, as well as a registered investment advisor that manages private investment accounts for individuals and institutions, and Insurance, includes an insurance agency offering commercial property and casualty insurance, group life and health coverage, employee benefit solutions and personal insurance lines. S&T owns a one-half   Receive News & Ratings for S & T Bancorp Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for S & T Bancorp and related companies with MarketBeat.com's FREE daily email newsletter . Comment on this Post", "external_links": [], "published": "2015-07-30T18:56:00.000+03:00", "crawled": "2015-07-31T00:25:58.055+03:00", "highlightTitle": ""}