{"organizations": [], "uuid": "5e93da7fa9157e6ae48e8eeda696671fb949fe82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/oil-edges-expected-u-stock-005237008.html", "country": "US", "title": "Oil sinks toward $56 as China, Greece and Iran weigh", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Oil sinks toward $56 as China, Greece and Iran weigh", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T12:09:00.000+03:00", "replies_count": 0, "uuid": "5e93da7fa9157e6ae48e8eeda696671fb949fe82"}, "author": "", "url": "https://uk.finance.yahoo.com/news/oil-edges-expected-u-stock-005237008.html", "ord_in_thread": 0, "title": "Oil sinks toward $56 as China, Greece and Iran weigh", "locations": ["Iran", "Greece", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 8, 2015, 10:22 BST - UK Markets close in 6 hrs 8 mins Oil sinks toward $56 as China, Greece and Iran weigh Reuters – 12 minutes ago \nA pump jack is seen at sunrise near Bakersfield, California October 14, 2014. REUTERS/Lucy Nicholson … By Alex Lawler \nLONDON (Reuters) - Oil fell toward $56 a barrel on Wednesday, trading close to a three-month low, as China's accelerating stock market plunge and the Greek debt crisis raised the possibility of weaker economic growth that could hit oil demand. \nThese concerns compounded downward pressure on prices from the supply side as the prospect of a deal on Iran's nuclear work raised the possibility of more supply reaching a market many analysts see as already having too much oil. \nBrent crude fell 66 cents to $56.19 a barrel by 0843 GMT, having traded as low as $55.10, the weakest level since April 6, on Tuesday. U.S. crude was down 57 cents at $51.76. \n\"The three main drivers pushing prices down are the steep fall in equities in China, with the implications that has for oil demand; the possibility of a nuclear agreement with Iran and the Greece crisis,\" said Christopher Bellew, senior broker at Jefferies Bache. \nChinese stocks plunged on Wednesday after the country's securities regulator warned investors were in the grip of \"panic sentiment\" and the market showed signs of freezing up as firms had their shares suspended. China is the world's second-largest oil consumer. \nIn the Greek debt crisis, euro zone members have given Athens until the end of the week to come up with a proposal for sweeping reforms in return for loans that will keep the country from crashing out of the single currency. \n\"Turmoil in China and Greece may put recent robust demand growth at risk,\" Morgan Stanley analysts said in a report. \n\"Investors have justifiable concerns about the outlook for both supply and demand going forward given current events.\" \nIn Vienna, Iran and six world powers gave themselves at least until Friday to negotiate an agreement on the Iranian nuclear program. \nA deal could lead to an increase in Iran's oil exports, which would add to output from the Organization of the Petroleum Exporting Countries already at a three-year high without cutbacks by other OPEC members. \nThe confluence of bearish factors outweighed expectations that the latest weekly U.S. inventory data will show a drop in U.S. crude inventories. The American Petroleum Institute's supply report on Tuesday showed a 958,000-barrel decline, ahead of Wednesday's official data. \n(Additional reporting by Henning Gloystein in Singapore; Editing by Dale Hudson)", "external_links": [], "published": "2015-07-08T12:09:00.000+03:00", "crawled": "2015-07-08T12:23:40.000+03:00", "highlightTitle": ""}