{"organizations": [], "uuid": "35ce64d9341dd79070ca568fb32dee837d9b7fd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/c/a/z/5/image.related.afrArticleLead.620x365.gicb07.png/1436990925598.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/education/graduates-of-sandstone-unis-earn-less-hilda-survey-finds-20150715-gicb07", "country": "AU", "title": "Graduates of 'sandstone' unis earn less, HILDA survey finds", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Graduates of 'sandstone' unis earn less, HILDA survey finds | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T07:00:00.000+03:00", "replies_count": 0, "uuid": "35ce64d9341dd79070ca568fb32dee837d9b7fd3"}, "author": "Ben Potter", "url": "http://www.afr.com/news/policy/education/graduates-of-sandstone-unis-earn-less-hilda-survey-finds-20150715-gicb07", "ord_in_thread": 0, "title": "Graduates of 'sandstone' unis earn less, HILDA survey finds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Quidditch in the main quadrangle at The University of Sydney. Sandstone schools do not necessarily lead to the highest incomes. Dallas Kilponen Group of 8 chief executive Vicki Thomson said the marquee schools she represents were \"perplexed and disappointed\" at the publication.\nMs Thomson said she had bailed up HILDA survey director Mark Wooden over the results which were \"skewed\" and \"clearly anomalous with previous studies\".\n\"We absolutely question the veracity of the methodology,\" she said.\nBut they were welcomed by Innovation Research Universities (IRU) executive director Conor King.\nRelated \"The results from universities across the board are fairly similar but when you do break it up by university those usually considered 'best' are not necessarily the strongest.\"\nThe HILDA survey has interviewed 12,000 to 13,000 people in more than 7000 households each year since 2012, and is Australia's largest representative household survey.\nIt is conducted by the Melbourne Institute of Applied Economic and Social Research, which is based on the Melbourne University campus.\nIt finds that graduates of Innovation Research Universities enjoy incomes 13 per cent to 15 per cent higher than those of graduates of Group of 8 universities.\nThey are closely followed by graduates of the five Australian Technology Network (ATN) universities, who enjoy a 9 per cent to 10 per cent earnings premium over their Group of 8 counterparts.\nThe Group of 8 is the lobby group for Melbourne, Monash, Sydney, NSW, Queensland, Western Australia, Adelaide and ANU universities.\nThey are popularly considered the most desirable schools to enrol in and were expected to charge the highest fees the if universities had been deregulated.\nYet the HILDA survey finds that their graduates can expect earnings no higher on average than graduates of the six relatively new Regional Universities Network schools - Central Queensland, Southern Cross, Federation, Southern Queensland and Sunshine Coast - or overseas universities.\nShock finding The finding will come as a shock to many families.\nAndrew Norton, higher education program director at the Grattan Institute, said it was inconsistent with prior studies and marred by a failure to control for study disciplines, which are the biggest variable \"after being male\" and can lead to widely differing incomes.\nGroup of 8 schools have higher proportions of graduates in low-paying disciplines such as arts and sciences. But when Grattan controlled for both discipline and social background, it found that Group of 8 and ATN university graduates enjoyed an earnings premium of about 6 per cent over the rest.\nMr Norton said this was more consistent with prior studies and what you would expect given Group of 8 students have higher school results on average, although studies also find very little benefit in starting salaries from a Group of 8 education.\nHILDA deputy director and report author Roger Wilkins said the HILDA survey sample would not support analysis of how each institution performed discipline by discipline, and conceded the exclusion of the self-employed could exclude some high-earning doctors and lawyers.\nEven so, HILDA finds that male graduates of Group of 8, Regional Universities Network and overseas universities do enjoy a solid earnings over \"other\" unaffiliated Australian universities - about 20 per cent.\nThe 13 \"other\" universities include Australian Catholic, Bond, Charles Sturt, Deakin University, Macquarie, Swinburne, Canberra, Notre Dame, Tasmania, Western Sydney, Wollongong and Victoria.\nBut this premium turns into an earnings penalty for female graduates of the three groups.\nRenee Hindmarsh, chief executive of the ATN, said ATN universities deliver \"practical, world class education, with a strong industry focus\" and are committed to equipping students with skills for the modern workforce.\n\"We have the highest graduate employment rates in Australia, in part due to our strong industry links. It is great to see our graduates are also financially recognised for the skills they bring to the workplace,\" Ms Hindmarsh said.\nMs Thomson said findings \"so very different from everything that has gone before\" were damaging to the universities and require explanation.\nThe HILDA report says it is \"perhaps surprising\" that Group of 8 graduates are so far back in the pack when it comes to future earnings. It suggests this could be because of the stronger vocational focus at the technology network and regional universities, or because the data only covers full-time employees.\nRead next: HILDA survey threatens Group of 8's raison d'etre", "external_links": [], "published": "2015-07-15T07:00:00.000+03:00", "crawled": "2015-07-16T00:57:54.000+03:00", "highlightTitle": ""}