{"organizations": [], "uuid": "d77db7ab08c8086e00de1bdb78e1656a6c8f7609", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business2community.com", "main_image": "http://cdn2.business2community.com/wp-content/uploads/2015/07/followups.png.png", "site_section": "http://feeds.feedburner.com/B2C_Business", "section_title": "Business & Finance Articles on Business 2 Community", "url": "http://www.business2community.com/strategy/one-simple-trick-that-has-greatly-improved-my-business-01273616", "country": "US", "title": "One Simple Trick That Has Greatly Improved My Business", "performance_score": 0, "site": "business2community.com", "participants_count": 1, "title_full": "One Simple Trick That Has Greatly Improved My Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T06:14:00.000+03:00", "replies_count": 0, "uuid": "d77db7ab08c8086e00de1bdb78e1656a6c8f7609"}, "author": "Dave Schneider", "url": "http://www.business2community.com/strategy/one-simple-trick-that-has-greatly-improved-my-business-01273616", "ord_in_thread": 0, "title": "One Simple Trick That Has Greatly Improved My Business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One Simple Trick That Has Greatly Improved My Business 0 SHARES July 12, 2015 Strategy 0 \nI started doing something I wasn’t doing before, and I’m starting to realize how much I should have been doing it a long time ago. \nWhat’s the BIG change? \nI started noting down all opportunities that I needed to follow up with. \nThe idea came to me when I was reading an article by Steli, CEO of Close.io, a CRM for sales teams. \nHe said, and I quote Recommended for You Webcast: Scaling Startup Sales: Lessons Learned from Bootstrapping My Company $0 to $30 Million \n“I have a simple philosophy – I follow up as many times as necessary until I get a response. I don’t care what the response is as long as I get one. If someone tells me they need another 14 days to get back to me I will put that in my calendar and ping them again in 14 days.” – Steli \nAt first, I thought this mentality was mostly meant to be applied to sales. You send someone an email, and you keep sending it until you get an answer. \nMakes sense. I don’t do that for my outbound emailing, and I’m sure I could increase my conversions if I had that attitude. It’s bold, yes, but honestly most people don’t even send a single follow up. \nI should start sending follow ups, I mused. \nBut then I thought – is that all? \nWhy can’t this be applied to inbound opportunities too? \nOf course it can, and I should be doing it! \nI forget about things all the time. \nFor example, on a weekly basis, I come across tons of opportunities; invites to podcasts, guest posts, product reviews, partnerships, and meetings. \nSome of these are discussions I’m in the middle of, but both parties forget about it and it never happens. Others are things I just don’t act on right away and they get lost. \nOccasionally, I make a note of these things, but often I don’t unless it’s very important. Or I file it away separately and all of these opportunities are spread across a dozen of different documents. \nIt made sense to finally centralize it into one spreadsheet. \nNow I know there are tools for this. This is essentially what CRMs are for. But to be honest, I didn’t want/need something that complicated. \nAnd of course there are email apps like Boomerang , with which you can ping yourself to follow up after so many days. This is nice, but what if the opportunity isn’t email based? Or the time to follow up isn’t known (maybe it’s based on a feature release). \nAs old school as it sounds, the easiest thing to do was simply to log in the persons’ name/email address, the opportunity, and the date on which it happened. \nIt looks like this: \nAs you can see, most of these are: Product reviews people agreed to publish about NinjaOutreach A webinar, interview, or podcast invite A webinar, interview, or podcast that I did and want to make sure it gets published \nAnd things like that. \nHere’s an example of how this recently played out: \nBasically, Gael from Authority Hacker and I had agreed to do a podcast episode on his blog. Something came up, and we had to reschedule, but we didn’t reschedule it right then and there. Technically, it was on Gael’s to do list to follow up with me and let me know a good time. \nBut after two weeks I decided to follow up myself and see if he was ready. \nHe was, and we scheduled a podcast. \nThis is 100% something I would normally have forgotten, because technically it wasn’t “my job” to follow up. \nWould Gael have followed up? Maybe, and maybe not – people forget, I certainly have. \nFrankly, I don’t really care who’s job it is to follow up. It’s an opportunity, and as a startup founder I need to take any that come my way. \nHow many of these types of opportunities have I missed in the past? A lot. \nNot anymore though! I would be willing to bet I’m capturing 20%+ more opportunities, now that I’m following up on them all. \nSo, there you have it. A simple tweak to make sure you’re on top of all opportunities, not just outbound emails. \nHow do you keep track of opportunities?", "external_links": [], "published": "2015-07-13T06:14:00.000+03:00", "crawled": "2015-07-13T09:44:59.000+03:00", "highlightTitle": ""}