{"organizations": [], "uuid": "fb5cdbf7bdd9496bfc357e867a8150b9b105cc1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ezinearticles.com", "main_image": "http://ezinearticles.com/apple-touch-icon.png", "site_section": "http://feeds.ezinearticles.com/category/Finance.xml", "section_title": "Finance Articles from EzineArticles.com", "url": "http://EzineArticles.com/?Digital-Currency:-What-It-Is,-and-What-It-Is-Not&id=9100450", "country": "US", "title": "Digital Currency: What It Is, and What It Is Not", "performance_score": 0, "site": "ezinearticles.com", "participants_count": 0, "title_full": "Digital Currency: What It Is, and What It Is Not", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T16:05:00.000+03:00", "replies_count": 0, "uuid": "fb5cdbf7bdd9496bfc357e867a8150b9b105cc1c"}, "author": "", "url": "http://EzineArticles.com/?Digital-Currency:-What-It-Is,-and-What-It-Is-Not&id=9100450", "ord_in_thread": 0, "title": "Digital Currency: What It Is, and What It Is Not", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Terry S. Lim"], "text": "By Terry S. Lim | Submitted On July 13, 2015 \nThis generation can be considered to be part of the digital age. Sooner or later, everything will be easier through the help of technology. Digital processes will soon replace traditional ways, including money making. \nAnother booming trend in the industry is digital currency. It is oftentimes associated with information which it is not really related with. Now, what really is digital currency? What are the advantages and disadvantages of this new trend? \nDigital currency also known as digital money is an internet based medium of exchange that can be used to purchase goods, pay bills and services, and other monetary transactions. It allows the instantaneous transaction and borderless transfer-of-ownership with no fees to fewer fees. Like traditional or fiat currencies, it can also be used to facilitate payment for physical goods and in-person services. \nThis trend is also often mistaken as virtual currency. Both can be used for purchases and for paying bills and services, the only difference is that virtual currency can only be used with a specific environment. Digital currency has no boundaries as the user can transfer funds without location limits, but with zero to fewer transaction fees. Also, dealers cannot charge extra fees on the consumer without their knowledge. \nAs new as it may seem, this trend offers a lot of advantages to its users. Digital currencies are not controlled by a central bank and are better in terms of stability. It does not depend its value on supply and demand status of a certain place. Also, there is a limited supply of money to keep the original value of the currency. \nIt may also attract those who prefer private monetary transactions. Users have a hold on their personal account information and those who will receive the transaction do not have an access on the sender's details. One type of this is cryptographic digital currency. It is a medium of exchange using encryption to secure the transactions as well as to monitor the creation of the new accounts. Through this process, the problems on identity theft during transactions are solved. \nAnother problem that it resolves is money counterfeiting. Online transactions do not require physical cash unlike traditional or over-the-counter bank transactions. It uses some special math applications and cryptography to make counterfeiting almost impossible. \nThere may be some disadvantages that this new trend might bring to the users because it is still developing, but if you prefer fast, convenient, and secure transactions online, digital currency might be the best for you.", "external_links": [], "published": "2015-07-17T16:05:00.000+03:00", "crawled": "2015-07-18T09:14:17.000+03:00", "highlightTitle": ""}