{"organizations": [], "uuid": "6866bc139ffd22ffe1fbc471278b348c796e2f1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-07/aquino-plans-record-philippine-budget-the-problem-s-spending-it", "country": "US", "title": "Aquino Plans Record Philippine Budget. The Problem’s Spending It", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Aquino Plans Record Philippine Budget. The Problem’s Spending It - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T00:32:00.000+03:00", "replies_count": 0, "uuid": "6866bc139ffd22ffe1fbc471278b348c796e2f1b"}, "author": "Karl Lester M Yap", "url": "http://www.bloomberg.com/news/articles/2015-07-07/aquino-plans-record-philippine-budget-the-problem-s-spending-it", "ord_in_thread": 0, "title": "Aquino Plans Record Philippine Budget. The Problem’s Spending It", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Philippine President Benigno Aquino is preparing to bequeath his successor a record 3 trillion-peso ($66 billion) budget in 2016. That’s the easy part.\nWhile some governments struggle with insufficient revenue - - see Greece --, in the Philippines the challenge is actually implementing spending that’s been approved and funded. Bureaucratic bottlenecks and fear of being caught in an anti-corruption drive have contributed to the Aquino administration missing spending targets every year since 2011.\n“The president has directed all cabinet secretaries to see to it that all programs are properly implemented and completely carried out,” Communications Secretary Sonny Coloma said in an interview Tuesday.\nThe government has ordered agencies to submit requirements for the release of their budgets by April to fast-track approval and has increased the number of bids and awards committees in key agencies including transport, public works, health and education, according to the budget department.\n“It’s not so much about how big the budget plan is, but the execution,” said Gundy Cahyadi, a Singapore-based economist at DBS Group Holdings Ltd. “When you look at the first quarter, growth data came in disappointing because of the rather slow pace of fiscal spending. And it’s not like they don’t have the money, because they do.”\nThe proposed final budget by Aquino’s administration would be 15 percent bigger than the plan for this year and double the program in 2010 when he took office, according to Budget Secretary Butch Abad. State spending in the first quarter was about 13 percent below target.\nPublic Works “Our focus now is to help our agencies make optimal use of their allocations,” Abad said in an e-mailed statement Tuesday. “This includes enhancing their capacities for budget planning, procurement and project implementation.”\nSpending on public works will increase 32 percent from 2015 while funds for education will rise 16 percent, the budget agency said. On July 28, Aquino will submit the budget to lawmakers for their approval.\nPursuit of tax evaders and corrupt officials has given Aquino more revenue to fund roads and schools and boost cash handouts to the poor while curbing debt, efforts that led to investment-grade ratings and economic growth exceeding 6 percent since 2012. The next president should protect the anti-corruption drive and sustain higher investment in infrastructure, analysts said in a Bloomberg poll in June.", "external_links": [], "published": "2015-07-08T00:32:00.000+03:00", "crawled": "2015-07-08T00:56:10.000+03:00", "highlightTitle": ""}