{"organizations": [], "uuid": "2dc9f539a26011b52afac5fcd9e827a03ed5abff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/why-interest-rates-start-going-205555388.html", "country": "US", "title": "This is why interest rates are about to start going up", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "This is why interest rates are about to start going up", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T23:55:00.000+03:00", "replies_count": 0, "uuid": "2dc9f539a26011b52afac5fcd9e827a03ed5abff"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-interest-rates-start-going-205555388.html", "ord_in_thread": 0, "title": "This is why interest rates are about to start going up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 17, 2015, 01:04 BST - UK Markets open in 6 hrs 56 mins This is why interest rates are about to start going up By Allister Heath | Telegraph – 3 hours ago 24.76 +0.09 \nIf you are a saver, rejoice; if you are a borrower, the moment you had been dreading is approaching \nIf you are a saver, rejoice; if you are a borrower, the moment you had been dreading is approaching. The Bank of England is now explicitly talking about increasing interest rates: it won’t happen immediately, but there will probably be a decision at the turn of the year. \nMark Carney , the Governor, could not have been any clearer in the speech he delivered on Thursday night: it was a stark, barely veiled warning that rates are about to go up, albeit gradually and over the next three years. \nThis is therefore a seminal moment for the UK economy. The authorities are signalling the official end of emergency monetary policy: as far as they are concerned, the post-crisis era is finally over, almost a decade after US house prices started to drop in 2006 and losses began to mount in various North American financial markets throughout 2007. \nBut while normalisation looms, the new normal will be different to the old normal: the crisis is over, but the economy is in a permanently different place, requiring lower equilibrium rates. That, at least, is the Bank’s current thinking, for better or for worse. \nAt times, the prospect of higher interest rates had started to feel to younger people - especially those in their 20s - as a kind of El Dorado or Loch Ness monster: a myth from the dawn of time, something that everybody talks about in hushed tones but that nobody has actually ever seen. All previous sightings over the past few years turned out to be hoaxes; all the headlines predicting higher rates preposterously premature. The last time rates were hiked was in July 2007, eight years ago; an entire cohort can’t really remember what it felt like. \nEven (Taiwan OTC: 6436.TWO - news ) more dramatically, millions of people have got used to rock-bottom interest rates. Many have forgotten, or never knew, that interest rates were as high as 6pc in 2001 and above 7pc in 1998. Needless to say, historical rates were much, much higher, albeit in a world of much greater inflation and very different monetary institutions. \nThe good news for the present generation is that base rates won’t be going up much for the time being: the Governor expects them to peak at around 2.25pc, roughly half the 4.5pc 300-year average, implying a 1.75pc or so rise over two to three years. These are base rates, of course; commercial rates are higher and will rise commensurately, but they too will peak well below the level they used to reach (even though regulatory changes are increasing the gap between base and commercial rate). \nIf Mr Carney is right, there will be some pain and some gain, but it should all be largely bearable for the overwhelming majority of the population. \nFinancial institutions (NasdaqGS: FISI - news ) will be better off: they find it hard to cope with very low base rates. Borrowers will have less money to spend on other things, and the housing market will be hit, possibly even stagnating nationally and dipping in London and the South East over the next couple of years; savers, by contrast, will have more money to spend. The young will be worse off in cashflow terms, though better off if they can buy slightly cheaper homes; older generations will gain from increased interest payments but suffer a little from depressed asset prices. \nSo why this speech? Two crucial things have changed, in my view, and there are also other factors at play. \nFirst (Other OTC: FSTC - news ) , real and nominal wages are shooting up on the official measures: total average pay in the three months to May jumped by 3.2pc in nominal terms, the fastest rate for five years. With consumer price inflation - currently zero - no longer a reliable indicator of pressure on the economy, wage growth has emerged as a favourite proxy for economists. The UK had seen a puzzlingly long slump in real wages and sluggish nominal wages, at least on the usual official statistics; the fact that pay is surging again suggests there is little spare capacity left in the British economy. \nSecond, the US is on course to hike its interest rates within the next few months; where the Federal Reserve leads, the Bank will follow. In her recent testimony to the Senate Committee on Banking, Janet Yellen, the Fed chief, said that if the economy progresses as expected, “economic conditions would make it appropriate at some point this year to raise” the Fed’s key interest rate. She also warned of the dangers of delaying. \nJanet Yellen, chair of the US Federal Reserve \nThere are other factors too, of course. The Greek crisis is in temporary abeyance ; even if it flares up, the impact on the UK will be slight. China’s economy has slowed but global growth remains reasonable. The eurozone overall is growing more healthily. The massive increases in the UK’s minimum wage will probably push up prices; they will certainly push up wage increases. Some of the disinflationary factors that have pushed down the UK CPI in recent months will be reversed; there is always a long and variable lag between when interest rates go up and their impact on reducing inflation. This suggests that the Bank may now believe that inflation could breach its target at some point between mid-2017 and early 2018, though of course these are only guesstimates on my part. \nCrucially, Mr Carney singled out the importance of the UK’s massive current account deficit: he is clearly concerned by it, and believes that it requires, over the long-term, a tighter fiscal policy and a looser monetary policy than would otherwise be necessary. That ought to be seen as an endorsement of the Government’s deficit reduction plans - but also as a further signal that rates won’t go up as much as they did in previous tightening cycles. That, at least, is the thinking. Like with everything else in economics, events can always derail a central bank’s best laid out plans. \nallister.heath@telegraph.co.uk", "external_links": [], "published": "2015-07-16T23:55:00.000+03:00", "crawled": "2015-07-17T03:05:34.000+03:00", "highlightTitle": ""}