{"organizations": [], "uuid": "1e23e812e74db32820965f783e896775cf21e32c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/1/z/k/l/image.related.afrArticleLead.620x365.gi3bz7.png/1435908441626.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/fund-managers-find-investment-opportunities-in-volatile-markets-20150703-gi3bz7", "country": "AU", "title": "Fund managers find investment opportunities in volatile markets", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Fund managers find investment opportunities in volatile markets | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T22:15:00.000+03:00", "replies_count": 0, "uuid": "1e23e812e74db32820965f783e896775cf21e32c"}, "author": "Vanessa Desloires", "url": "http://www.afr.com/personal-finance/fund-managers-find-investment-opportunities-in-volatile-markets-20150703-gi3bz7", "ord_in_thread": 0, "title": "Fund managers find investment opportunities in volatile markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The weakening Chinese economy is a concern for investors, but Platinum still sees opportunities. AFP by Vanessa Desloires Andrew Clifford, portfolio manager, Platinum Asset Management\nDo you think the recent market falls are providing a good chance to buy, and if so, what are you buying?\nWe think it is a good opportunity to add to the stock that you already like. If you look at the different issues, we see Greece as really an issue for Greece and the odds of greater contagion across Europe are very low. There are concerns in the Chinese market, which while we see that parts of the market are very frothy there are certainly stocks that we think should be bought and are buying. We are buying into some European holdings, particularly a number of eastern European banks, which are all in later stages in terms of going through their bad-debt cycle. We're also adding to positions in Chinese life insurance that have been core positions for us. China Mobile is another. There are [Australian] stocks out there that are worth owning that had a setback around this general malaise around Europe.\nAre you worried about the Chinese economy?\nThere's no question China has had a very significant slowdown, and the ongoing data continues to reflect that very weak economic environment, particularly around investment and construction activity. But the Chinese are responding with economic policy as we would expect anywhere in the world. What is not always focused on is the parts of the economy that are growing very rapidly, things like express parcel deliveries, which grew last year from 9 billion to 14 billion through the function of ecommerce, movie ticket sales, and overseas travel grew more than 20 per cent. It is a very large and diverse economy.\nDo you expect the Fed to delay rate rises?\nOur view is that they should be putting up rates because the economy does have good momentum and you should expect that would continue. It's probably fair to say, given the long term track record of the Fed, there's a good chance they are cautious of putting up rates. We don't spent too much time thinking about it because the type of stocks we buy aren't particularly sensitive to that. The search for yield that has gone on by investors has pushed up a whole lot of stocks to expensive levels; they are to be avoided because they will be under pressure as rates rise over the next two or three years.\nSonia Baillie, head of capital research, AMP Capital\n Do you think the recent market falls are providing a good chance to buy, and if so, what are you buying?\nMarket volatility always presents opportunities for investors to exploit, especially for the corporate bonds where we have conviction in their underlying fundamentals. The challenge with the \"Grexit\" uncertainty is the evaporation of liquidity as market-makers step back. We continue to favour the capital securities of banks, especially those that have robust capital positions and improving profitability and whose spreads have been pressured due to contagion from the Greek IMF default. We also favour US corporates, especially in the real asset space of technology, media and telecommunications and infrastructure such as pipelines.\nAre you worried about the Chinese economy?\nChina presents a bigger concern for the performance of the Australian economy than developments in Europe. Financial system imbalances remain with the build-up in debt in local governments and off-balance-sheet financing vehicles, all of which is fairly opaque to offshore investors. There is recognition of wanting to move away from an export- and investment-led growth model to a consumption-led growth model. Addressing this rests a lot on structural reform and policy makers' decision-making and implementation abilities. This is happening as President Xi Jinping clamps down on corruption and concentrates his power and authority. It takes time and will mean a slower growth path for China in future years.\nDo you expect the Fed to delay rate rises?\nWe do not expect the Fed to delay rate rises, expecting that they will start the normalisation process by the end of 2015. While inflation is still benign on some measures, other sectors of the economy, particularly the labour market, have had a rapid reduction in slack and are beginning to show signs of price pressures. Additionally, the Fed has been very active in outlining their intentions to begin the normalisation process, albeit at a slow and steady rate. The key risk to this view is if weakness in major trading partners leads to strength in the US dollar, thereby tightening financial conditions without interest rates moving higher.\nSinclair Currie, portfolio manager, NovaPort Capital\nDo you think the recent market falls are providing a good chance to buy, and if so, what are you buying?\nMarket corrections inevitably create opportunities for investors; however, it is important to remain disciplined in selecting which companies to invest in. In the last few years the complexion of the economic outlook has shifted due to falling currency and weaker commodity prices, and at the same time technological change and supply chain globalisation are altering the competitive environment for many businesses. We have added selectively to information technology and some mining companies.\nAre you worried about the Chinese economy?\nChina is the world's second largest economy and the major consumer of Australian commodities, so the outlook for its economy is important and needs to be monitored. The Chinese government successfully drove an investment-led growth boom, in part courtesy of its influence over state-owned enterprises. However, a transition to consumption-led growth is likely to require the use of tools and policies with which it is less familiar. We believe some turbulence is likely during this transition which, depending on the speed and efficacy of policy responses, will elevate volatility to some extent.\nDo you expect the Fed to delay rate rises?\nThe Fed's decision-making process appears to be cautious and influenced by economic data, which is typically volatile. Unless you are investing within a very short time frame, trying to pinpoint the exact meeting at which the Fed raises rates seems to miss the point. To us it would appear that there are growing concerns that extended monetary stimulus is creating distortions in markets and the economy, and that this stimulus will be wound back at some stage.", "external_links": [], "published": "2015-07-03T22:15:00.000+03:00", "crawled": "2015-07-04T12:27:14.000+03:00", "highlightTitle": ""}