{"organizations": [], "uuid": "a886b32a82cfe467063badcbe18ef25e718157cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/designimages/pcom-FB.jpg", "site_section": "http://www.philly.com/philly/business/personal_finance", "section_title": "Personal Finance, Money and Investing Advice at Philly.com ", "url": "http://www.philly.com/philly/business/personal_finance/20150701_ap_b22a91491f8749c4bfa1587084d9e0c1.html", "country": "US", "title": "Consider the financial implications of lengthy auto loans", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Consider the financial implications of lengthy auto loans", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "a886b32a82cfe467063badcbe18ef25e718157cf"}, "author": "ALEX VEIGA,", "url": "http://www.philly.com/philly/business/personal_finance/20150701_ap_b22a91491f8749c4bfa1587084d9e0c1.html", "ord_in_thread": 0, "title": "Consider the financial implications of lengthy auto loans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kevin Flores has more than six years to pay off the loan on his new Nissan Frontier pickup.\nThat's more than double the length of the truck's bumper-to-bumper warranty. And it means the Baton Rouge, Louisiana resident will be paying roughly $2,580 in interest over the life of the roughly $25,000 loan.\nHe accepted the extra costs that come with stretching out his loan payment term in order to make his monthly payments affordable. \"The way I justified it is, in five or six years, when I'm making more money, I can make extra payments toward that and pay it off sooner,\" said Flores, a buyer at an engineering company.\nCar buyers are increasingly taking on loans with lengthier payoff terms to cope with rising prices or to make SUVs, crossovers and other pricier models more affordable. About 30 percent of all new vehicles financed in the first three months of the year were purchased with loans ranging from just over six to seven years, according to Experian Automotive.\nIn the first quarter of this year, 16 percent of used-car purchases were financed with these longer-term loans.\nLow interest rates, longer manufacturer warranties and the increased durability of newer cars can help blunt the potential risks of a loan that may not be paid off for six or seven years. People are hanging on to their cars for longer periods, with the average length of ownership at about eight years, said Melinda Zabritski, Experian's senior director of automotive finance.\nEven so, these loans also translate into higher interest payments over the life of the loan and can saddle buyers with other costs.\n\"When you agree to finance for that period of time it makes a car seem more affordable than it would otherwise might be,\" said Philip Reed, senior consumer advice editor at Edmunds.com.\nHere's what to consider if you're contemplating taking an auto loan with a term of more than five years:\nOVERALL COSTS.\nThe prospect of spreading out the expense of a vehicle may be enticing, but don't lose sight of the total cost. It's no accident that dealerships often will try to focus buyers on the monthly payment and not the sticker price and interest costs.\nOne strategy: Arrive at the dealership with preapproved financing in hand and say you want to negotiate the price of the car and leave any financing discussions until later. Once you arrive at an agreeable price, compare your preapproved financing to the dealership's offer.\nRemember also that, unlike a mortgage, the interest paid on a car loan is not tax deductible.\nTry Edmunds' interest rate calculator to determine how much you will pay over the life of the loan : http://www.edmunds.com/calculators/simplified-pricing.html .\nLENGTH OF OWNERSHIP\nHow long are you planning to keep the car -- long after your six- or seven-year loan term ends? Financially speaking, that could be the best move, as you can benefit from the savings of not having to make a car payment for a few years after you've paid it off.\nBut you also may have to contend with greater repair costs, and the fact that the car will have lost most of its resale or trade-in value. Note that these factors will be more of a concern on a used car.\n\"Buying a used car is a good financial decision for a lot of people, but I wouldn't finance it for six or seven years,\" Reed said. \"Let's say it's a 3-year-old car. Now all of a sudden you're making payments on a 10-year-old car.\"\nDEPRECIATION RISKS\nDepreciation is the decline in the value of an asset over time. And with cars, that begins as soon as you drive away from the dealership.\nThis can present some risks to borrowers with a six or seven year loan.\nLet's say the car is in an accident within the first two or three years. If it is classified as a total loss, it's likely the owner would owe more on the car than it is worth, known as being upside-down on the loan.\nDepreciation also could mean taking on added costs for owners who decide to sell the car in those first few years. They may have to roll the debt on the car into a new loan on a new vehicle.\nOne way to reduce these risks is to put down 20 percent of the cost of the car upfront. That payment essentially covers the car's first year of depreciation, Reed said.\nAnother is to buy insurance, known as gap insurance, which covers the difference in the value of the vehicle and what's owed on the loan in the event of an accident. Be sure to shop around, though, as you may get a better deal from an insurer, rather than the auto dealership.\nFASTER PAYOFF\nFind out whether there are any penalties for paying down the loan early. If not, consider paying a little extra every month. Over time, you may be able to reduce your interest costs.", "external_links": ["http://www.edmunds.com/calculators/simplified-pricing.html"], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-03T04:20:43.000+03:00", "highlightTitle": ""}