{"organizations": [], "uuid": "d5f5f63e076130e7b7ecdbde8a88224b3c76e530", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wisebread.com", "main_image": "http://www.wisebread.com/files/fruganomics/blog-images/car_service_000017616649.jpg", "site_section": "http://www.wisebread.com/taxonomy/term/6/all/feed", "section_title": "Wise Bread (Personal Finance posts)", "url": "http://www.wisebread.com/8-easy-diy-car-repairs-to-save-big", "country": "US", "title": "8 Easy DIY Car Repairs to Save Big", "performance_score": 0, "site": "wisebread.com", "participants_count": 1, "title_full": "8 Easy DIY Car Repairs to Save Big", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T20:00:00.000+03:00", "replies_count": 0, "uuid": "d5f5f63e076130e7b7ecdbde8a88224b3c76e530"}, "author": "Paul Michael", "url": "http://www.wisebread.com/8-easy-diy-car-repairs-to-save-big", "ord_in_thread": 0, "title": "8 Easy DIY Car Repairs to Save Big", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » Life Hacks » 8 Easy DIY Car Repairs to Save Big 8 Easy DIY Car Repairs to Save Big 0% Balance Transfer Credit Cards \nOne of the monthly expenses many of us forget to include in our budgets is car repair and maintenance . Sure, we put down the price of gas, and maybe an oil change every two or three months, but we forget about most of the ongoing maintenance costs. Cars need regular maintenance over their useful lives, and most of us will pay through the nose to get it performed. But it doesn't have to be that way. With parts bought online, some simple tools, and a little basic knowledge, many car repairs can be done without visiting a mechanic. \nI talked to Richard Reina, the Training Director at CARiD , about some of the easiest car repairs you can do at home. You can find most of the replacement parts at CARiD or similar sites, plus many instructional videos and fact sheets that will ensure you have the help you need every step of the way. I also talked to several mechanics, including a family member who has had over 20 years of experience fixing cars. He, like many other experts, was adamant that with preparation, you can save a lot of time and money on repairs. 1. Change Your Own Brake Pads \nWhen I first heard that, my reaction was \"No way, I'm not messing with my brakes!\" But as Reina points out, it's a very simple and inexpensive procedure that mechanics and specialty brake shops will charge hundreds of dollars to do. The industry wants you to think it's hard, because they make a lot of profit from a very simple procedure, but pads are way easier to replace than old fashioned drum brake \"shoes.\" \nAll you need is a wheel lug wrench , some basic wrenches , pliers , and of course a jack and set of jack stands (never get under a car unless it is on jack stands; you cannot rely on the jack as it may fail). \nA set of new brake pads will set you back just $20–$40, depending on the car and pad material. Compare that to the industry average of $250 per axle, and you can see how much this DIY job will save you. The procedure is basic. Take off the wheel, remove the hardware, pull out the worn pads, push in the caliper piston, install the new pads, and reinstall the hardware. You should be able to do all four wheels in under an hour, even if this is your first time doing the job. The new pads will last between 30,000–50,000 miles, and you should check them every 10,000 miles. When the pad thickness falls below 2mm–3mm, it's time for another replacement set. 2. Change the Battery \nIt amazes me how many people will get a shop to replace the battery, since this is by far the easiest of all DIY repairs. A battery will last 4–6 years, so you should be able to figure out when your current battery is ready to be changed. (Almost every battery will have a date stamped on it, so look for this if you want to be sure.) You do not want to wait until you start having problems. If you do, you could be stranded with a dead battery, and that's dangerous for many reasons. \nThe average price of a new battery is around $80, although you can spend more or less depending on the make and model. A dealer will charge upwards of $200 to replace it. \nTo do the swap, you just need a basic set of wrenches. The biggest warning here, Reina says, is the order in which you remove the replace the cables. Remove the NEGATIVE (black) cable FIRST, and when you have installed the new battery, replace the NEGATIVE cable LAST. If you don't do it this way, you could short circuit the positive (red) terminal to a grounded part of the car. 3. Do Your Own Oil Change \nA typical quick lube place could charge anywhere from $30 to $70 for an oil change. Some can go as high as $90–$100, especially if you own an expensive import. But then you see signs like $15 oil change and think, \"Well I'd pay that for the oil and filter anyway, so why not let them do it for me?\" \nHere's why. First, there is always an asterisk on those oil changes. They come with conditions, and may not include the correct amount of oil required for your engine (this happens a lot when you bring in an SUV or truck). You will also be given a low-grade oil, rather than a full synthetic or even a synthetic blend. And most importantly, the cheap oil change is a loss leader. \nThe loss-leader oil change is a great way to get you to hand over your car to the garage so that they can get under the hood and see if it has problems. A reputable place won't find any unless there are genuine problems. Others, well, let's just say they find problems that don't need attention. \nSuddenly, the $15 oil change has become thousands in major repairs. Poor establishments will use high-pressure tactics to get you to sign up for the work, and you may not even get the chance to get a second opinion. \nSo, do it yourself. Buy a good quality oil filter and the best oil you can afford from your local supplier (it can be an auto specialist or a retail store). Other than jack stands and a jack, you'll need an oil filter wrench and a drain pan. These only have to be purchased once and will last you decades (my father-in-law has been using the same drain pan for 20 years). You can find videos online walking you through oil changes on a variety of different vehicles. \nAnd one final note. As Richard Reina points out, the days of the \"every 3,000 miles\" oil changes are long gone. Vehicles these days can often go 10,000 miles between oil changes. Check your manual. 4. Change Your Spark Plugs \nThere is an episode of the iconic TV series Frasier that shows Niles and Frasier Crane attending an automotive workshop. The very first lesson is how to change spark plugs. It's one of the easiest home repairs you can do, although these days it is very rare you'll even have to perform this service. On modern cars, extended-life spark plugs can maintain a precise gap for 100,000 miles. However, it is still wise to check them every 30,000-40,000 miles, just to make sure. \nWhen the time does come to replace your spark plugs, along with your regular set of tools you will need a spark plug wrench . Again, this is a \"buy once, use for a lifetime\" kind of purchase, and it's not very expensive (under $10 in most cases). (WikiHow has a great instructional piece here .) And the savings…let's just say it's significant. You can pay over $300 for spark plugs to be changed, and spark plugs themselves are rarely more than $30 for a set. 5. Replace a Headlight or Taillight \nIf you are a good car owner, you will perform a regular walk around of your vehicle. It's important to do this for many reasons, but one of the biggest is to check that all the lights are working. Not only are lights essential for clear vision, and alerting drivers to your intentions, but you can also incur traffic tickets if they aren't working. So, try and do this at least once a month (you'll need someone to help you check the taillights). \nIf one (or more) isn't working, it's time to buy a replacement and do it yourself. With the average hourly repair rate of a garage being $100, you could easily spend $25–$50 per bulb, especially if the shop has a minimum charge. \nOne of the most important things to do is bring the old bulb with you to the store. You want to make sure you are getting like for like. And, when it comes time to change it out, never touch the bulb glass with your bare hands. The grease from your fingers can cause the bulb to burn out early. 6. Replace Your Windshield Wipers \nSome people go to a garage or dealership to have their windshield wipers replaced. This is, without a doubt, a massive waste of your time and money. A set of wipers will run you between $20 and $40 on average, plus the dealer will charge you one hour of labor (that's about $100). Don't throw your money away. It takes minutes to replace the wipers on your vehicle yourself, and all of the instructions are provided in the replacement wipers you buy. \nWhen you go to a store — say Walmart or Target — they'll have a reference manual (these days it's often a small electronic terminal) which will tell you which wiper sizes you need to ensure a correct fit. In most cases, the old wipers slide out, and the new ones slide in. The last time I changed my wipers, it took two minutes for both…and most of that time was spent trying to hack open the vacuum-sealed plastic package! 7. Replace Your Air Filter \nRichard Reina pointed out another simple fix that mechanics and dealerships will heavily mark up with labor costs and parts. And yet, it is a very quick fix (in most cases…if you happen to own a German import, you may have a few extra parts to remove to access the filter). On average, you'll pay over $100 in labor costs, and $50 for the filter. \nThe typical cost of an air filter from a retail store is between $15–$20, but again, this can be higher depending on the make and model of your car. In most cases, you will simply have to open up the hood of the car, turn a few screws, open the air filter housing, swap out the old for the news, and replace the screws. It really is that simple, and you can save a ton of money doing it yourself. 8. Fix a Chipped Windshield \nI recently had to do this one myself, and I can tell you…it's so simple. I had a small rock chip in the windshield. I was tempted to go by one of those \"fix it free\" places that hang out near malls, but they operate through your insurance company, and I wasn't keen on going through all that for a simple rock chip. \nOn Amazon or eBay, you can find windshield repair kits for under $15. Some run as low as $8. When you get it, all you need to do is dig out any loose glass with the pin provided, and then thoroughly clean it, and the surrounding area. You will have to stick a small device to the windshield that forms a seal around the rock chip, and then a vacuum contraption will work to apply the resin into the crack. It's an operation that takes less than one hour, from opening the package to the finished result, and most of that is simply waiting time. Stop that crack from spreading, before you need to replace the entire windshield. That can be costly. \nNow, what services do you regularly perform on your own car that saves you time and money? Let us know in the comments below. Wise Bread Picks", "external_links": [], "published": "2015-07-15T20:00:00.000+03:00", "crawled": "2015-07-16T08:35:44.000+03:00", "highlightTitle": ""}