{"organizations": [], "uuid": "8a0ef2cc78b7fd81dddee3cd36624122e98b5caf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-health-care/?format=rss", "section_title": "Health Care News | Pharmaceutical News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/health-insurer-anthem-profit-rises-103437529.html", "country": "US", "title": "Anthem profit beats as medical costs stay at low end of estimates", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Anthem profit beats as medical costs stay at low end of estimates", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T22:20:00.000+03:00", "replies_count": 0, "uuid": "8a0ef2cc78b7fd81dddee3cd36624122e98b5caf"}, "author": "", "url": "https://uk.finance.yahoo.com/news/health-insurer-anthem-profit-rises-103437529.html", "ord_in_thread": 0, "title": "Anthem profit beats as medical costs stay at low end of estimates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 30, 2015, 06:35 BST - UK Markets open in 1 hr 25 mins Anthem profit beats as medical costs stay at low end of estimates Reuters – 10 hours ago \nThe office building of health insurer Anthem is seen in Los Angeles, California February 5, 2015. REUTERS/Gus … By Caroline Humer \n(Reuters) - Health insurer Anthem Inc (ANTM.N), which plans to buy rival Cigna Corp (CI.N) for $47 billion, on Wednesday said medical costs, particularly in its Medicaid and Medicare businesses, were at the low end of expectations and helped boost second-quarter profit. \nAnthem raised its profit outlook for 2015 and said it expects health spending to increase at the lower end of a range of 6.5 percent to 7.5 percent this year. It also said that a key financial measure of medical costs fell during the quarter. \nHealth insurers closely manage costs to contend with a constant rise in medical spending. Cost increases had been held back for many years by the weak economy, but began picking up in 2014 with the improved economy and as the national healthcare reform law extended insurance to millions more people. \nA few months ago, the largest U.S. insurers began scrambling to line up merger partners that would give them leverage to contend with the trend and negotiate lower prices with medical providers. \nConsolidation has heated up across the healthcare industry, including among hospitals, doctor groups, pharmacy benefit managers, pharmacies and drugmakers. \nOn July 3, No. 3 health insurer Aetna Inc (AET.N) said it would buy rival Humana Inc (HUM.N) and Anthem on Friday said it would acquire Cigna for $47 billion in cash and stock to create the No. 1 U.S. health insurer with 53 million members. \nAnthem, which operates Blue Cross Blue Shield plans in more than a dozen states, said on Wednesday that spending on medical claims as a percentage of premiums fell to 82.1 percent from 82.7 percent a year ago. That is about 30 basis points better than Wall Street estimates, according to Leerink Partners analyst Ana Gupte. \nAnthem is the first insurer to report earnings since UnitedHealth Group Inc (UNH.N) two weeks ago missed analyst expectations for that key ratio, a harbinger of cost increases. \n\"(Anthem's) loss ratios came in very favorably. That's a big plus considering there were some concerns about the UnitedHealth report,\" Gupte said. \nAnthem shares were up 0.24 percent at $154.77. \nREVENUE TOPS EXPECTATIONS \nAnthem's net income rose to $859.1 million, or $3.13 per share, from $731.1 million, or $2.56 per share, a year earlier. Revenue increased 8.3 percent to $20.02 billion, topping analysts' expectations of $19.63 billion. \nThe company cited strong growth in its government Medicaid and Medicare businesses, where revenue rose 25.7 percent. Medicaid membership increased 11 percent. \nMedicaid enrollments began to increase in earnest starting in July of last year as the expansion of Medicaid coverage for the poor kicked in, Anthem Chief Financial Officer Wayne DeVeydt said during a conference call. \nAnthem expects 2015 adjusted net income to be more than $10 per share, up from its previous forecast of more than $9.90. \nAnalysts expected full-year earnings of $10.11 per share, according to Thomson Reuters I/B/E/S. \nExcluding items, Anthem earned $3.10 per share in the second quarter, well above the average analyst estimate of $2.77. \n(Reporting by Caroline Humer in New York and Amrutha Penumudi in Bengaluru; Editing by Anil D'Silva and Jeffrey Benkoe)", "external_links": [], "published": "2015-07-29T22:20:00.000+03:00", "crawled": "2015-07-30T08:42:29.824+03:00", "highlightTitle": ""}