{"organizations": [], "uuid": "add076dcc3f898cb5a8fcf11d4320e6f581e098c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/lewjack_101013gn.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/249680-lew-debt-limit-boost-not-necessary-until-late-october", "country": "US", "title": "Treasury signals end-of-October debt limit deadline", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Treasury signals end-of-October debt limit deadline", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T23:45:00.000+03:00", "replies_count": 0, "uuid": "add076dcc3f898cb5a8fcf11d4320e6f581e098c"}, "author": "pschroeder@thehill.com (Peter Schroeder)", "url": "http://thehill.com/policy/finance/249680-lew-debt-limit-boost-not-necessary-until-late-october", "ord_in_thread": 0, "title": "Treasury signals end-of-October debt limit deadline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Treasury signals end-of-October debt limit deadline Getty Images By Peter Schroeder - 07/29/15 04:45 PM EDT \nLawmakers will likely have at least until the end of October to raise the nation’s borrowing limit, Treasury Secretary Jack Lew said in a letter to Congress on Wednesday. \nLew told lawmakers that while he cannot pinpoint when the nation would be in danger of missing debt payments without a borrowing boost, he was confident he would be able to avoid default until at least late October. ADVERTISEMENT “We believe that the measures will not be exhausted before late October, and it is likely that they will last for at least a brief additional period of time,” he wrote.\nAfter the government reached its borrowing cap in March, Lew deployed his usual set of “extraordinary measures” to free up room under the cap to ensure the government kept paying its bills. \nNoting the inherent difficult in precisely predicting the flow of funds in and out of the federal government, Lew reiterated that there is “considerable uncertainty” in terms of how long the U.S. can go before risking a calamitous default. \nThe letter suggested lawmakers could seek to settle a government shutdown fight before moving on to a debt limit debate — though it is also possible the two issues could simply be merged. \nCongress needs to pass funding legislation to avoid a government shutdown by the end of September. Many expect lawmakers to pass a short-term funding measure, which could eventually couple a longer government-funding bill with legislation to raise the debt ceiling. \nLawmakers also face a raft of other issues in the fall, including extending authority for highway spending, dealing with expiring tax provisions and deciding whether to renew the charter for the Export-Import Bank. \nLew reiterated his call for lawmakers to raise the borrowing cap as soon as possible and without “controversy or brinksmanship.” \nBut lawmakers will not be acting on the limit anytime soon, as members will be heading home for the traditional August recess in a matter of days. \nLew’s timeline hews closely to other estimates of when the government could be in danger of running out of cash without a debt limit hike. \nThe Congressional Budget Office has estimated the debt limit will need to be increased in October or November, and the Bipartisan Policy Center has pegged the deadline as sometime in November or December. \nLew added in his letter that he would be prolonging a hold on new debt tied to investments in some government employee retirement funds. Temporarily suspending that debt is a frequent tool used by the Treasury Department to free up room under the borrowing cap. Lew previously suspended all new debt until July 30, and told lawmakers Wednesday he was extending that to October 30. \nThis story was updated at 5:26 p.m. Tags:", "external_links": [], "published": "2015-07-29T23:45:00.000+03:00", "crawled": "2015-07-30T06:09:20.620+03:00", "highlightTitle": ""}