{"organizations": [], "uuid": "566934a919b1b0f64a75df21842ac79cd5cd1de4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-targetukfocus/?format=rss", "section_title": "Finance News | Reuters - UK Focus - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/barclays-investment-bank-firing-line-064109615.html", "country": "US", "title": "Barclays investment bank in firing line despite change at top", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Barclays investment bank in firing line despite change at top", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T09:41:00.000+03:00", "replies_count": 0, "uuid": "566934a919b1b0f64a75df21842ac79cd5cd1de4"}, "author": "", "url": "https://uk.finance.yahoo.com/news/barclays-investment-bank-firing-line-064109615.html", "ord_in_thread": 0, "title": "Barclays investment bank in firing line despite change at top", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 14, 2015, 08:09 BST - UK Markets close in 8 hrs 21 mins Barclays investment bank in firing line despite change at top Reuters - UK Focus – 28 minutes ago \n* Investment bank core to Barclays (Swiss: BARC.SW - news ) - chairman \n* But CEO exit unlikely to stop investment bank cuts \n* U.S. arm could lose another quarter of assets \n* Barclays (LSE: BARC.L - news ) investment bank down two to 8th biggest in world \nBy Steve Slater \nLONDON, July 14 (Reuters) - Any investment bankers hoping for an easier ride at British bank Barclays after Chief Executive Antony Jenkins was ousted last week may be in for a surprise. \nRetail banker Jenkins spent three years cutting trading desks in a bid to boost profitability and curb what politicians dubbed a casino culture after a series of scandals, alienating many Barclays dealmakers and traders. \nYet while new Executive Chairman John McFarlane was quick to say investment banking would be a key part of Barclays' future, a recent plan to cut more assets is already being implemented, people familiar with the matter said. \nIndeed, Barclays told the U.S. Federal Reserve last week that assets at its broker-dealer in the United States had halved since 2010 and would fall by up to another quarter by July 2016 to $185-215 billion. \n\"It is important to have an investment bank to complement the wealth and private banking operations, but the returns have to be improved,\" said Guy de Blonay, fund manager at Jupiter Asset Management, which owns Barclays shares. \nThe investment bank has gone from Barclays' main profit engine to its biggest drag on returns. \nProfit fell by a third last year to 1.4 billion pounds ($2.2 billion), accounting for a quarter of overall profits and putting it on a par with the bank's credit card business. \nWhat's more, the investment bank's return on equity was just 2.7 percent. While returns were hit by deferred pay, conduct and legal costs, as well as restructuring charges, it was far short of the bank's 12 percent target. \nMcFarlane has said he wants to speed up improvements in profitability. Investors and analysts say this means \"non-core\" activities must be sold off faster, and fewer assets should be allocated to trading. \nTENSIONS REMAIN \nYet despite a low return on equity and contributing only a quarter of profits, investment banking still dominates attention and management time at the bank, a legacy of the Barclays Capital (Other OTC: CGHC - news ) business built up by Jenkins' predecessor Bob Diamond. \nA new plan set out three weeks ago and agreed by former CEO Jenkins, investment bank boss Tom King and Finance Director Tushar Morzaria, agreed to cut more assets from the business. \nBut King disagreed with Jenkins about the scale of cuts and threatened to retire early, a person familiar with the matter said. McFarlane persuaded King to stay, but the row undermined Jenkins and contributed to his departure. \n\"(The investment bank) is where the battle will be won and lost for our stock and our company and we had a CEO who didn't know anything about it,\" said one senior U.S. investment banker who asked not to be named. \nOver the past two years more than a third of investment banking jobs, or more than 8,000 staff, have been axed, first in Project Mango in 2013 and then under Project Electra in 2014. \nSources said tensions remain between London and the United States, the investment bank's two \"home\" markets, following the cuts. The U.S. division, largely the former Lehman Brothers business bought by Barclays in 2008, is far more profitable than investment banking in Asia and Europe. \nWhat will go next should become clearer soon. McFarlane has said he will give more details about the plan that undermined Jenkins when half-year results are released on July 29. \nNOT ALONE \nBarclays is not alone in trying to decide the best size and shape of its investment bank in a changed regulatory landscape. New (KOSDAQ: 160550.KQ - news ) bosses at Deutsche Bank (Xetra: 514000 - news ) and Credit Suisse (NYSE: CS - news ) are also assessing how to refocus to improve returns. \nThe British bank has to separate its domestic retail banking business in the next three years under new rules designed to give more protection to savers, and taxpayers. \nBut it is having a tough time determining its structure, which will in turn affect plans for the investment bank, sources have told Reuters. \nRanked the world's eighth biggest investment bank last year down from sixth in the previous two years, according to analytics firm Coalition, Barclays' strongest areas are rates and foreign exchange trading, municipal finance, mergers and acquisitions (M&A) advisory and debt capital markets. \nThe banks is expected to cut back in fixed income, currencies and commodities (FICC), potentially allowing it to allocate more capital to advisory activities in the United States and Britain - to help companies on M&A and equity and debt capital markets. \nTwo more radical options would be selling the investment bank altogether, or conversely, bulking it up by raising capital, analysts said. \n($1 = 0.6445 pounds) (Additional reporting by Sinead Cruise in London and Dan Feed and Olivia Oran in New York; editing by David Clarke)", "external_links": [], "published": "2015-07-14T09:41:00.000+03:00", "crawled": "2015-07-14T10:12:41.000+03:00", "highlightTitle": ""}