{"organizations": [], "uuid": "59671a46eeec0c5f6e30b016002d18d2f3608700", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/mother-re-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/lifestyle/health/progress-for-women-and-children-in-india-health-survey-may-offer-global-lessons/98845", "country": "IE", "title": "‘Progress for women and children in India health survey may offer global lessons’", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "‘Progress for women and children in India health survey may offer global lessons’ | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T05:15:00.000+03:00", "replies_count": 0, "uuid": "59671a46eeec0c5f6e30b016002d18d2f3608700"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/health/progress-for-women-and-children-in-india-health-survey-may-offer-global-lessons/98845", "ord_in_thread": 0, "title": "‘Progress for women and children in India health survey may offer global lessons’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Simple interventions such as using community workers to promote breast-feeding in villages have helped India improve the health of its women and children and could be good global examples, say aid workers, citing early findings from a U.N.-backed survey.\nThe Rapid Survey on Children, conducted by the ministry of women and child development and supported by the U.N.’s children’s agency, UNICEF, is the first national survey on child and maternal health in India in the last decade.\nThe findings – yet to be verified by the government – reveal that while indicators such as child malnutrition and child marriage remain high, progress in development among India’s 1.2 billion people shows there are lessons for elsewhere.\n“Overall we are pleased about the data as it shows a positive trend,” said Bidisha Pillai, Advocacy Director for Save the Children India.\n“Anything India does on development has a huge impact globally and I think everyone is optimistic about the progress made.”\nPillai said part of the success lay in the government’s emphasis on basic health campaigns such as encouraging families to take up good infant and child feeding practices as well as promoting births in hospitals.\nIn the last decade the government has introduced “ASHAs”, trained female health workers, who reside in the village and are employed to conduct pre- and post-natal visits and advise and support expectant and new mothers.\nIt has also launched schemes which provide free services, which include travel to and from hospital, to pregnant women and sick new born babies.\nPROGRESS\nThe data – gathered from more than 100,000 households across urban and rural India – showed that the number of stunted children below the age of 5 dropped to 39 percent in 2013/14 against 48 percent in 2005/6, when the government’s last National Family Health Survey was conducted.\nChild malnutrition is an underlying cause of death for 3 million children annually around the world – nearly half of all child deaths – most of whom die from preventable illnesses such as diarrhoea due to weak immune systems.\nThe survey also found that the number of women in India married younger than 18 had declined to 30 percent in 2013/14 from 47 percent in 2005/6. The number of women giving birth in clinics or hospitals had jumped to 79 percent from 41 percent.\nChildren under six months who were exclusively breast-fed has also risen to 65 percent from 46 percent, and the number of children fully immunised by the age of two surged to 65 percent.\n“The surprise is that progress is very good, but at the same time the rates are still high,” Saba Mebrahtu, chief of child development and nutrition at UNICEF India, told the Thomson Reuters Foundation.\n“I think it will have an implication not just for India, but also globally.”\nGovernment officials said they were still examining the survey’s findings and comparing it against two other surveys done at same time but which showed “very divergent results.”\nThe survey found no progress on the nutritional status of adolescent girls. Forty-four percent of girls aged between 15 and 18 were found to have a low Body Mass Index (BMI), unchanged from almost a decade ago.\nGiven that levels are still high, more needs to be done to improve women’s nutrition and dietary intake, boost the feeding and care of young children and increase hygiene and access to sanitation, said Mebrahtu.\n 10, 2015 9:15 pm", "external_links": [], "published": "2015-07-11T05:15:00.000+03:00", "crawled": "2015-07-12T05:02:09.000+03:00", "highlightTitle": ""}