{"organizations": [], "uuid": "aa2100ff6298de5a51483ad4ee1ef049bc2c2a88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-construction-materials/?format=rss", "section_title": "Construction & Materials News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/us-stocks-u-stocks-rise-151453491.html", "country": "GB", "title": "US STOCKS-U.S. stocks rise on Greek deal; Dow in the black for the year", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "US STOCKS-U.S. stocks rise on Greek deal; Dow in the black for the year", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T18:14:00.000+03:00", "replies_count": 0, "uuid": "aa2100ff6298de5a51483ad4ee1ef049bc2c2a88"}, "author": "", "url": "https://uk.finance.yahoo.com/news/us-stocks-u-stocks-rise-151453491.html", "ord_in_thread": 0, "title": "US STOCKS-U.S. stocks rise on Greek deal; Dow in the black for the year", "locations": ["US", "Greece"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Greece wins conditional agreement to receive $95 bln \n* Nasdaq, S&P 500 on track for biggest gain in over two weeks \n* Oil price drops, helping airline stocks rise \n* Netflix (Xetra: 552484 - news ) hits record high on Goldman price target hike \n* Indexes up: Dow 1.1 pct, S&P 0.91 pct, Nasdaq 1.2 pct (Adds details, changes comment, updates prices) \nBy Tanya Agrawal \nJuly 13 (Reuters) - U.S. stocks were higher on Monday, with the Dow Jones industrial average moving into positive territory again for the year, after euro zone leaders reached an agreement with Greece to move forward with a bailout loan for the country to avert bankruptcy. \nThe news also put the Nasdaq composite and the S&P 500 on track for their biggest gain in more than two weeks, with the consumer discretionary and financial indexes leading the markets higher. \nGreece won conditional agreement to receive a possible $95 billion over three years, along with an assurance that euro zone finance ministers would start discussing ways to bridge a funding gap until a bailout - subject to parliamentary approvals - is finally ready. \nThat will only happen if Greek Prime Minister Alexis Tsipras can meet a tight timetable for enacting unpopular reforms of value added tax, pensions and quasi-automatic budget cuts. \n\"The U.S. market is following the global markets as Greece nears a deal,\" said Peter Cardillo, chief market economist at Rockwell Global Capital in New York. \n\"The stronger Chinese markets are also helping but volatility will be high this week till a Greek deal is finalized and the big banks set the tone for earnings.\" \nWorld markets (Xetra: 4WM.DE - news ) rose, while the dollar index gained 0691 percent to $96.69 against a basket of major currencies following news of the deal. Chinese stocks rose for a third straight day as data showed exports rose while imports slipped in June, a tentative sign global demand might be on the mend. \nAt 10:52 a.m. ET (1452 GMT) the Dow Jones industrial average was up 196.22 points, or 1.1 percent, at 17,956.63. The S&P 500 was up 18.8 points, or 0.91 percent, at 2,095.42 and the Nasdaq composite was up 60.18 points, or 1.2 percent, at 5,057.88. \nAll the 10 major S&P 500 sectors were higher. The consumer discretionary index's 1.24 percent rise led the gains. \nFinancial stocks were also higher with the index gaining 0.99 percent, following the Greek debt deal. Big banks such as JPMorgan (LSE: JPIU.L - news ) , Bank of America, Citigroup were all up more than 1 percent. \nOil prices tumbled as Iran and six world powers closed in on a nuclear deal that would end sanctions on the Islamic Republic and let more Iranian oil on to world markets. \nHowever, the oil price slide boosted U.S. airline stocks . American Airlines (Xetra: A1G.DE - news ) , United Continental (NYSE: UAL - news ) , JetBlue and Alaska Air (NYSE: ALK - news ) were all up between 1.8 and 3 percent. \nApple (NasdaqGS: AAPL - news ) rose 1 percent to $124.59 after Socgen (Paris: FR0000130809 - news ) upgraded the company's stock to \"buy\" from \"hold\", saying it expected a successful launch of the new iPhone 6S in September. \nNetflix hit a record high of $711.15 after Goldman Sachs raised its price target on the stock to $780 From $620. \nThe U.S. Treasury Department's June budget report at 2 p.m. ET is expected to show surplus of $51.0 billion, compared with a $82.4 billion deficit reported in May. \nAdvancing issues outnumbered decliners on the NYSE by 2,177 to 740. On the Nasdaq, 1,937 issues rose and 650 fell. \nThe S&P 500 index posted 35 new 52-week highs and 10 new lows, while the Nasdaq recorded 121 new highs and 26 new lows. (Editing by Savio D'Souza)", "external_links": [], "published": "2015-07-13T18:14:00.000+03:00", "crawled": "2015-07-13T18:38:39.000+03:00", "highlightTitle": ""}