{"organizations": [], "uuid": "9546e58246d67cef95b8f98a2a9f38acb68fa73f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20150730&t=2&i=1068196244&w=&fh=545px&fw=&ll=&pl=&r=LYNXNPEB6T0RX", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/30/us-travel-summer-pointsguy-idUSKCN0Q41V520150730", "country": "US", "title": "Rethinking airline points strategy with the Points Guy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Rethinking airline points strategy with the Points Guy | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T18:22:00.000+03:00", "replies_count": 0, "uuid": "9546e58246d67cef95b8f98a2a9f38acb68fa73f"}, "author": "Mitch Lipka", "url": "http://www.reuters.com/article/2015/07/30/us-travel-summer-pointsguy-idUSKCN0Q41V520150730", "ord_in_thread": 0, "title": "Rethinking airline points strategy with the Points Guy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Earning and using airline miles used to be simple. Fly 25,000 miles and earn a free flight. It is not so simple anymore.\nThe process of redeeming miles is changing in a way that makes it more difficult for all but elite flyers to earn rewards.\nOne key change: Delta Air Lines' announcement in mid-July that its SkyMiles rewards will be based on what you spend, rather than on the distance you travel, and the cost will be based on demand rather than a fixed amount.\nExperts like Brian Kelly, known as The Points Guy ( thepointsguy.com/ ), expect more major airlines to follow suit.\nTo help sort out the changes to the miles game, Reuters asked Kelly for his advice for travelers to best take advantage of widely varying airline loyalty programs.\nQ: Are airlines suddenly being less loyal to their loyal customers?\nA: The real answer is that loyalty is being redefined.\nIn the past it used to be that whoever flew the most was the most loyal, but airlines are now saying it's whoever spends the most.\nBasically, the wealth gap is increasing between economy and first class, which I guess makes senses as the industry keeps changing.\nQ: It seems like all the airlines are treating miles like currency, and devaluing them.\nA: Pretty much. Every month there are billions of points and miles pumped into the system. But there are just not that many flights, or hotels for that matter, so they are looking for ways to have you redeem more miles and points for less value, and I don’t see that changing.\nQ: What airlines are the most generous to their frequent flyers right now?\nA: It really depends on where you live and how much you fly, but I still think American Airlines has the best top-tier elite status. American is also the most generous, in my opinion, with international upgrades giving eight system-wide upgrades, versus six on United.\nQ: What should travelers look for when they are deciding which airline loyalty program to focus on?\nA: Travelers should not have blind loyalty. The biggest thing is don’t put all your miles in one basket. You should get a credit card that allows you to transfer to multiple programs.\nYou can be loyal to one airline, but don’t over-expose yourself because that program will probably change or that airline won’t fly where you want, so it's good to have points in all different programs just like your stock portfolio.\nQ: Is it even worth it to try to accumulate points with credit cards?\nA: Always do the math. If you’re not getting at least 1–2 cents per mile in value you should really just think about getting a cash-back card. The Citi Double Cash and Fidelity Amex both give about 2 percent back. Why earn one airline mile that’s worth one cent when you could get 2 cents back in cash, which you could use toward anything?\nAlso, don’t always think that airline mileage cards - especially ones where you’re only earning one mile per dollar spent - are the best value. Sometimes cash is king and the ability to use that cash to purchase whatever you want is a great option.\nQ: What strategy should consumers employ for travel this summer or fall?\nA: I would recommend that people redeem miles in the near term, don’t hang on long-term in the next several years because these programs are evolving and they are evolving quickly.\nIf you are spending a lot of money on short flights you should take a look at Delta and United and the programs that reward based on money.\nIf you’re an economy traveler, especially international, you’re going to lose big time, so do the math and choose a program that rewards you the most.\nAnd, frankly, don’t be loyal to an airline if they’re not loyal to you. If you’re earning less miles and paying more and not getting the perks, it's time to rethink your strategy.\n(Editing by Dan Grebler)", "external_links": ["http://thepointsguy.com/"], "published": "2015-07-30T18:22:00.000+03:00", "crawled": "2015-07-30T18:10:55.016+03:00", "highlightTitle": ""}