{"organizations": [], "uuid": "bf0e1d9a75a8de53dc535becca4c267da2df0660", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-19/merkel-holds-out-prospect-of-limited-greek-debt-relief", "country": "US", "title": "Merkel Holds Out Prospect of Limited Greek Debt Relief", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Merkel Holds Out Prospect of Limited Greek Debt Relief - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T01:22:00.000+03:00", "replies_count": 0, "uuid": "bf0e1d9a75a8de53dc535becca4c267da2df0660"}, "author": "Patrick Donahue", "url": "http://www.bloomberg.com/news/articles/2015-07-19/merkel-holds-out-prospect-of-limited-greek-debt-relief", "ord_in_thread": 0, "title": "Merkel Holds Out Prospect of Limited Greek Debt Relief", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "German Chancellor Angela Merkel held out the prospect of limited debt relief for Greece if it follows through on the terms of a third bailout, while insisting that Greek membership in the euro precludes a debt writedown.\nNations in the 19-member currency union will consider extending maturities and reducing interest rates on Greek bonds only after the first assessment of whether Greece is meeting pledges for more austerity and overhauling its labor market, the German leader said -- “not now, but then.”\nGreece’s wish to remain in the euro area rules out a “classic haircut, writing down 30 or 40 percent of the debt,” since it violates European law, she said.\n“Just imagine that with any country that has more debt than the Greeks had among euro members -- we would enter a completely hopeless situation,” Merkel said in an interview with German broadcaster ARD on Sunday. “You can’t have that.”\nFurther easing of repayment terms for Greek aid loans has been an option in euro-area negotiations since 2012. Ensuring that Greece’s debt is sustainable looms as one of the challenges when talks on the third bailout get under way.\nMerkel defended Finance Minister Wolfgang Schaeuble’s breach of a taboo this month when he floated the idea of suspending Greece from the euro for five years. The proposal was meant to prevent a “catastrophic situation,” Merkel said.\n“The option was on the table, but we decided to take another one,” Merkel told ARD. “What counts is the result of these negotiations that took such a long time.”\nThe chancellor played down a disagreement between herself and Schaeuble a day after her finance minister confirmed differences between the two. In an interview with Der Spiegel, Schaeuble also said he’d quit if he were to conclude that he no longer had a say in her government.\n“I’ve received no such request for a resignation and I don’t have any intention of continuing this discussion,” Merkel told ARD. “We have work to do.”", "external_links": ["http://www.tagesschau.de/inland/merkel-sommerinterview-103.html\\"], "published": "2015-07-20T01:22:00.000+03:00", "crawled": "2015-07-19T20:42:01.999+03:00", "highlightTitle": ""}