{"organizations": ["SBI", "State Bank of India"], "uuid": "87a800dca2160c08e252caa77299aa53f5a5867c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2014-11/14/full/1415971943-5223.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss", "section_title": "Finance", "url": "http://www.business-standard.com/article/pti-stories/sbi-sees-no-rate-cut-by-rbi-on-aug-4-115071700493_1.html", "country": "IN", "title": "SBI sees no rate cut by RBI on Aug 4", "performance_score": 0, "site": "business-standard.com", "participants_count": 0, "title_full": "SBI sees no rate cut by RBI on Aug 4", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T12:12:00.000+03:00", "replies_count": 0, "uuid": "87a800dca2160c08e252caa77299aa53f5a5867c"}, "author": "", "url": "http://www.business-standard.com/article/pti-stories/sbi-sees-no-rate-cut-by-rbi-on-aug-4-115071700493_1.html", "ord_in_thread": 0, "title": "SBI sees no rate cut by RBI on Aug 4", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Arundhati Bhattacharya", "Bhattacharya"], "text": "  SBI sees no rate cut by RBI on Aug 4 The central bank has said it will watch out for the data, including inflation, and the monsoon progress before any change in its policy rates Country's largest lender State Bank of India (SBI) today said it is not expecting a rate cut by RBI in the monetary policy review next month on account of slightly higher retail inflation. \"No I am not. I am not expecting any rate cut (by RBI),\" SBI Chairperson Arundhati Bhattacharya told PTI. \"WPI is (negative) but CPI has gone up a little. Though it is mainly on account of food prices. The RBI has been benchmarking it to the CPI numbers, I think it is unlikely,\" Bhattacharya said. While retail inflation in June rose to an 8-month high of 5.4 per cent, the overall Wholesale Price Index (WPI) based inflation was (-)2.4 per cent in the same month. RBI mostly tracks the consumer price inflation for its monetary policy decision, and its next review is due on August 4. The central bank has said it would watch out for the data, including inflation, and the monsoon progress before any change in its policy rates. It would also wait for banks to pass on the benefit of three rate cuts ... Country's largest lender State Bank of India (SBI) today said it is not expecting a rate cut by RBI in the monetary policy review next month on account of slightly higher retail inflation.\"No I am not. I am not expecting any rate cut (by RBI),\" SBI Chairperson Arundhati Bhattacharya told PTI.\" WPI is (negative) but CPI has gone up a little. Though it is mainly on account of food prices. The RBI has been benchmarking it to the CPI numbers, I think it is unlikely,\" Bhattacharya said. ALSO READ: SBI plans to offer 3% profit to staff While retail inflation in June rose to an 8-month high of 5.4 per cent, the overall Wholesale Price Index (WPI) based inflation was (-)2.4 per cent in the same month. RBI mostly tracks the consumer price inflation for its monetary policy decision, and its next review is due on August 4. The central bank has said it would watch out for the data, including inflation, and the monsoon progress before any change in its policy rates. It would also wait for banks to pass on the benefit of three rate cuts during the year. RBI has cut policy rate thrice during 2015. The total reduction has been 0.75 per cent while banks have passed on an average 0.3 per cent to customers. Last month, RBI cut the repo rate (short-term lending rate) from 7.5 per cent to 7.25, but left all other policy tools like cash reserve ratio (CRR) unchanged at 4 per cent and statutory liquidity ratio (SLR) at 21.5 per cent.", "external_links": [], "published": "2015-07-17T12:12:00.000+03:00", "crawled": "2015-07-17T15:02:56.000+03:00", "highlightTitle": ""}