{"organizations": ["Micron"], "uuid": "14fc2ebef16a87275fac84c8d2e6a93825137c89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-conglomerates/?format=rss", "section_title": "Conglomerate Sector News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/micron-attracted-large-options-bets-201802251.html", "country": "US", "title": "Micron attracted large options bets ahead of deal news", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Micron attracted large options bets ahead of deal news", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T23:18:00.000+03:00", "replies_count": 0, "uuid": "14fc2ebef16a87275fac84c8d2e6a93825137c89"}, "author": "", "url": "https://uk.finance.yahoo.com/news/micron-attracted-large-options-bets-201802251.html", "ord_in_thread": 0, "title": "Micron attracted large options bets ahead of deal news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 14, 2015, 21:38 BST - UK Markets closed Micron attracted large options bets ahead of deal news Reuters – 20 minutes ago Print \nBy Saqib Iqbal Ahmed \nNEW YORK (Reuters) - Micron Technology Inc attracted large options bets days ahead of reports that China's state-backed Tsinghua Unigroup Ltd is preparing a $23 billion (£14.7 billion) bid for the U.S. memory chip maker. \nMicron's shares jumped as much as 13 percent to $19.84 on Tuesday, on reports that the Chinese technology conglomerate is prepared to bid $21 per share for Micron. A Micron spokesman said it had not received an offer. \nThe sharp rally in the shares comes after a days-long slide in the stock after the company gave a dismal sales outlook in late June. The shares fell to a twenty-month low of $17.14 on July 9. \nThe stock's options, however, have attracted bullish bets over the last two weeks - including calls betting the shares will rise above $19 by Aug. 21, said Fred Ruffy, options strategist at WhatsTrading.com. \nOpen interest in the August $19 calls has ballooned to nearly 100,000 contracts, from a bit more than 4,000 contracts on July 2, making it the biggest block of open interest in Micron's near-term options. \nWhile the trade appears to be aggressive, given that Micron’s options are usually quite heavily traded, they do not necessarily appear suspicious, strategists said. \n\"After the huge drop in the stock on earnings, many investors have been buying calls in anticipation of a rebound, not specifically expecting this deal,\" said Pravit Chintawongvanich, derivatives strategist at Macro Risk Advisors in New York. \nThe large trades in the August options also appear to be tied to a trade in Micron shares. \n\"The buyer of those calls appears to have sold some stock simultaneously and probably took a bet on sustained high level of volatility,\" said Anshul Agarwal, equity derivative strategist at Bay Crest Partners in New York. \nIf so, the trade might not have been betting on a big directional move in the shares, but simply banking on increased volatility. \nOptions activity has been known to spike before the public announcement of deals and the U.S. Securities and Exchange Commission has in the past announced enforcement action for alleged insider trading involving options trading. \nThe Financial Industry Regulatory Authority, which oversees securities firms, and the SEC declined to comment on Micron’s options activity. \n(Reporting by Saqib Iqbal Ahmed; Editing by Bernard Orr)", "external_links": [], "published": "2015-07-14T23:18:00.000+03:00", "crawled": "2015-07-14T23:38:27.000+03:00", "highlightTitle": ""}