{"organizations": [], "uuid": "b4c46421832f8c1b324bddd1bd96feb8d3340207", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/5/0/a/l/image.related.articleLeadwide.620x349.gi47tz.png/1435942719135.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/comment-and-analysis/gittins-world-less-scary-when-you-look-behind-the-news-20150703-gi47tz.html", "country": "AU", "title": "World less scary when you look behind the news", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "World less scary when you look behind the news", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "b4c46421832f8c1b324bddd1bd96feb8d3340207"}, "author": "", "url": "http://www.smh.com.au/business/comment-and-analysis/gittins-world-less-scary-when-you-look-behind-the-news-20150703-gi47tz.html", "ord_in_thread": 0, "title": "World less scary when you look behind the news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Illustration: Glen Le Lievre\nWe're still learning to cope with a globalised world. Things work a bit differently now, and we have to adjust our thinking accordingly.\nGlobalisation – the breaking down of barriers between countries – is leading to increased trade between economies and increased flows of financial capital around the world, not to mention greater flows of people.\nBecause humans have evolved to continuously monitor their environment in search of threats, the news that interests us most is bad news. The news media are only too happy to oblige.\nAnother dimension of globalisation that's having big effects without being widely noted is the globalisation of news.\nUnrest in Greece is unlikely to directly touch Australia. Photo: Kostas Tsironis\nNews of important happenings somewhere around the world now reaches most people in the rest of the world with a delay of maybe only a few minutes.\nBecause humans have evolved to continuously monitor their environment in search of threats, the news that interests us most is bad news. The news media are only too happy to oblige. They ignore all the good things that are happening, and all the everyday things as well, to give us a concentrated dose of any highly unusual, bad thing that's happening anywhere in the world.\nThe question is whether we're capable of absorbing this quite unrepresentative picture of what's happening around us without unconsciously reaching the conclusion that the world is in much worse shape than it actually is.\nOne lesson we've learnt is that everything in different parts of the world is now much more interconnected. That's true – particularly in the global economy – but we can take it too far.\nThe classic example of the heightened economic effects of globalised news was the global financial crisis of 2008, when news of crashing sharemarkets and teetering banks in America and Europe was beamed into living rooms all around the world every night for a month.\nOrdinary people in distant countries such as Australia had to judge how this absolutely frightening news might affect them. They assumed the worst. Business and consumer confidence plunged and households and businesses began battening down the hatches, moving money between banks and cutting their spending.\nIt turned out all our banks were safe. Thanks to our tight supervision of them, they had no \"toxic debt\". But the government did have to help them when the international financial markets in which they borrowed stopped operating briefly.\nThe point is, our consumers and businesses were so frightened by all they'd heard about troubles overseas that we could have had a local recession anyway, had the Rudd government – and the Reserve Bank – not acted so quickly and effectively to calm people down with \"cash splashes\" and news of its plans for stimulus spending.\nNow the big news is Greece's financial troubles, about which the media assume our curiosity knows no bounds. The obvious question for news consumers to ask is, how will this affect me?\nShort answer: probably it won't. We can feel sorry for the Greeks, or not, but we need to remember Greece is a country of just 11 million people, with an economy representing about 0.4 per cent of the world economy and the tiniest share of our exports.\nIt is true that, should Greece exit the eurozone, this would raise uncertainly about pressure on the other weak and heavily indebted member countries, and this could lead to the euro currency union coming to a messy end.\nIf that were to happen – which wouldn't be any time soon – it would have flow-on implications for every country. But you'd have to say that, just as living on a Greek island would be a good way to get as far away as possible from any problem in Australia you were trying to escape, the reverse also applies.\nAnother way we're still adjusting to how globalisation is changing things concerns the way we've always measured international trade. This story is told in the Productivity Commission's annual report on trade and assistance.\nEvery country has always measured the \"gross\" value of its trade. The full value of each exported good or service has been attributed to the last industry that handled the item and to the country it was sent to.\nBut the advent of \"global value chains\" – where the production of manufactured goods in particular is spread between countries, with parts coming from various countries to be finally assembled in another country – has made this gross value approach ever more misleading.\nSo the World Trade Organisation is now making more use of individual countries' \"input-output tables\" to measure exports on a \"value-added\" basis. That is, each industry sector that contributed to the production of an export item gets the credit for the value it contributed to the final price.\nDoing the numbers on this more accurate basis makes a big difference. The final price of manufactured goods, for instance, includes the value of raw materials provided by agriculture or mining, plus the value provided by service industries such as transport and providers of professional and scientific services.\nLooking globally, manufactured goods' share of total world exports drops from 67 per cent to 40 per cent, while services' share doubles to 40 per cent. The shares of agriculture and mining increase from 13 per cent to 20 per cent.\nThe new story for Australia is different because our exports are dominated by primary products. Using the most recent figures available, for 2008, the commission estimates that manufacturing's share of our total exports drops from 36 per cent to 14 per cent, while services' share jumps from 18 per cent to 42 per cent.\nAgriculture's share is unchanged at about 4 per cent, while mining's share drops only a little to 40 per cent.\nAs for the destination of our exports, looking at the period from 2002 to 2011, North America and Europe's share rose from 23 per cent, measured on a gross basis, to 32 per cent on value-added. The shares of our Asian customers fell.\nOne lesson: we should worry less about the decline of manufacturing and think more about the rise of the services economy.\nTwitter: @1RossGittins", "external_links": ["https://twitter.com/1rossgittins", "http://www.pc.gov.au/research/recurring/trade-assistance/2013-14"], "published": "2015-07-04T03:00:00.000+03:00", "crawled": "2015-07-04T16:12:58.000+03:00", "highlightTitle": ""}