{"organizations": [], "uuid": "6d7a5fc9715f225b59afbda12e6fc468de388b5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507150529.html", "country": "US", "title": "Africa: Trade for Sustainable Development Principles", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Trade for Sustainable Development Principles", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T11:52:00.000+03:00", "replies_count": 0, "uuid": "6d7a5fc9715f225b59afbda12e6fc468de388b5d"}, "author": "", "url": "http://allafrica.com/stories/201507150529.html", "ord_in_thread": 0, "title": "Africa: Trade for Sustainable Development Principles", "locations": ["Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Accessible, transparent, and credible standards, coupled with technical and financial assistance, benefit consumers and producers alike. Inclusive business needs inclusive standards. \nThe response \nITC has launched a set of 'Trade for Sustainable Development' (T4SD) principles to help stakeholders from across the supply chain -- standards organizations, multinationals, NGOs, and others -- find common ground and maximize the promise of standards in making trade contribute to sustainable and inclusive growth. \nSustainability is the first of the four principles. Signatories to the principles are expected to incorporate the full spectrum of social, environmental, economic, quality and ethical issues in production, processing, and trade. \nThe second principle is transparency. Signatories are encouraged to share good practices and foster trust and inclusiveness at all levels of global supply chains. ITC and the German Ministry for Development Cooperation (BMZ), together with the European Union and Switzerland, have worked together to produce \"Standards Map\", a neutral, online database of information on almost 200 voluntary sustainability standards and eco-labels. \nTransparency favours accessibility: ITC and partners use Standards Map and its self-assessment tool to sensitize smallholder to the basic good agricultural practices required to sell on to buyers who prize certain sustainability criteria. Harmonization is the third principle. Neither producers nor consumers are well served by a multiplicity of standards, audits, and assessment methodologies for roughly the same goals. Signatories pledge to build collaboratively on existing resources and methodologies to avoid duplication. \nFinally, signatories commit to align their work to the United Nations Post-2015 Development Agenda and the Sustainable Development Goals. \nThe results \nSince the principles were launched in October 2014, the number of signatories has grown steadily, reaching 39 by mid-2015. They include large multinationals such as Nestlé, supply chain traceability enablers such as GlobalStandard 1 (GS1), regional producers' associations, standard-setting organizations, and business platforms gathering multiple industry players. \nCollaboration with one of the signatories, the Global Social Compliance Programme (GSCP), has yielded a unique 'Quick Scan' tool that allows major supply chain actors to easily compare their social and environmental codes of conduct against best corporate practice and third party standards. This lays the groundwork for advancing harmonization of approaches. \nThe future \nThe next frontier for sustainability in supply chains is about traceability from primary producers all the way through to retailers. \nThe current absence of digital links between supply chain actors means that neither producers nor consumers adequately understand companies' sustainability and quality management attributes. Yet buyers increasingly demand such information. Consumer demand for full traceability is a powerful tool for advancing sustainable trade practices, but risks leaving out smallholder farmers and small and medium-sized enterprises (SMEs) unless complemented by action to integrate them into supply chains. \nITC's Trade for Sustainable Development programme is working with the UN Global Compact and GS1 to develop a free online system for SMEs to register and obtain a code containing information that would enable actors at every level of the supply chain to identify sustainability issues at different stages in the production process. Buyers or retailers would be able to confidently communicate their sustainable supply chain commitments to the customers. Primary producers and processors in the developing world would be able to better communicate their sustainability processes to existing or potential buyers. The data embedded in the codes would identify where technical assistance would help small producers and processors meet food safety standards, so that such aid can be more efficiently targeted. Finally, the data would enable companies around the world to benchmark themselves against peers elsewhere. \nITC will cooperate with private sector signatories to the Trade for Sustainable Development principles on the code initiative, which promises to empower small farms and businesses and contribute to more sustainable and traceable trade. Africa \nFor four days, government, business and organizational representatives are gathered in Addis Ababa, Ethiopia to discuss … see more » Copyright © 2015 International Trade Centre. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-15T11:52:00.000+03:00", "crawled": "2015-07-16T04:05:04.000+03:00", "highlightTitle": ""}