{"organizations": [], "uuid": "a7ee400bf93dec71bd269fe9a98f4736ac93a4ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/23/590x/gold-593057.jpg", "site_section": "http://express.co.uk//posts/rss/23/personalfinance", "section_title": "Daily Express :: Personal Finance Feed", "url": "http://www.express.co.uk/finance/personalfinance/593057/Gold-prices-perfect-storm-market-fall-further", "country": "", "title": "Gold faces a 'perfect storm' with prices set to fall further", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Gold faces a 'perfect storm' with prices set to fall further", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T20:01:00.000+03:00", "replies_count": 0, "uuid": "a7ee400bf93dec71bd269fe9a98f4736ac93a4ea"}, "author": "", "url": "http://www.express.co.uk/finance/personalfinance/593057/Gold-prices-perfect-storm-market-fall-further", "ord_in_thread": 0, "title": "Gold faces a 'perfect storm' with prices set to fall further", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gold faces a 'perfect storm' with prices set to fall further Gold faces a 'perfect storm' with prices set to fall further THE price of gold could fall below $1,000 an ounce in the coming months experts have warned, after the market crashed this week. PUBLISHED: 18:01, Wed, Jul 22, 2015 | UPDATED: 18:19, Wed, Jul 22, 2015 GETTY Gold faces a perfect storm, according to experts \nGold fell as low as $1,088 (£607) an ounce on Monday to trade at its lowest level since 2010. And while there has been some recovery market, critics have now warned the precious metal faces a 'perfect storm'. Several of the factors that affect the price of gold have turned against it, accoridng to Colin Cieszynski, chief market strategist at CMC Markets• Weak demand for safety Gold is the ultimate 'safe haven' investment bought in times of turmoil and uncertainty. Following the global financial crisis the price of gold reached a record $1,600 (£1,028) an ounce in 2011. But as the Greek debt crisis fades into the background and the American and British economies both continue to strengthen, the demand for safety is dropping. Mr Cieszynski added: \"Political tensions around the world also appear to be easing with the completion of the Iran nuclear deal and the US burying the hatchet reopening diplomatic relations with Cuba today.\"• Inflation risk reduced Gold is also used by investors to protect against inflation risks. The price of oil is a large factor in inflation and with Iran set to rejoin the market, inflation is expected to remain in check for the near future. • US dollar strengthGold is priced in US dollars so when the American currency strengthens it makes the commodity more expensive to buy in other currencies. For this reason the two often trade in opposite directions. In recent days the dollar has strengthened as the prospect of US interest rates rising is looking closer and the move puts the price of gold under further pressure. Related articles Price of gold plummets to five-year low on back of US economic... \n• China holds less gold than expectedThe Chinese central bank announced last week that had raised its gold reserves, which should have been good news for the trading price - except that the increase was less than expected. Gold still only represents about 1.65 per cent of Chinese reserves around the same level when its holding were revealed six years ago. However, when looking at seasonal trends the gold sell-off could be close to running its course. Mr Cieszynski said: \"Historically, May to July has been one of the weakest times of the year for gold, however it has then bounced back in August and September ahead of Wedding Season in India, the peak time of year for physical gold demand.\"But overall the outlook remains very uncertain and many experts predict that the market will remain weak. Chris Beauchamp, senior market analyst at IG, said: \"Gold looks increasingly likely to take a smaller and smaller part in investor portfolios.\"", "external_links": [], "published": "2015-07-22T20:01:00.000+03:00", "crawled": "2015-07-23T08:36:52.387+03:00", "highlightTitle": ""}