{"organizations": [], "uuid": "4fb30f3817ad29568441285115296b701c29e8af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/a/e/k/p/image.related.afrArticleLead.620x365.gint77.png/1438250237853.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/internships-still-the-best-way-into-investment-banking-20150730-gint77", "country": "AU", "title": "Internships still the best way into investment banking", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Internships still the best way into investment banking | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T17:00:00.000+03:00", "replies_count": 0, "uuid": "4fb30f3817ad29568441285115296b701c29e8af"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/banking-and-finance/internships-still-the-best-way-into-investment-banking-20150730-gint77", "ord_in_thread": 0, "title": "Internships still the best way into investment banking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Citi is engaging with students earlier and also ranking them on personality and leadership skills beyond academic achievements. Reuters by Joyce Moullakis Edmund Tadros Interns hoping for summer jobs at investment banks will receive offers by the end of this week and despite the gruelling work culture, it remains the best way to break into the industry.\nThe majority of this year's crop of interns, due to start in November, are expected to take up graduate positions with conversion rates of 66 per cent to 90 per cent, and as high as 100 per cent at some banks.\nSeveral investment banks have slightly racheted up their intern intake, across their advisory and markets divisions this year, otherwise the numbers are fairly consistent with 2014.\nThe programs now confront fierce competition with information technology companies, such as Google , to woo bright students.\nThe allure of investment banking was damaged by the global financial crisis and students are also mindful of the cyclical nature of the industry. A string of horror stories involving the working hours of young staff at investment banks also hasn't helped.\nMost firms are seeking to identify candidates at an earlier stage. More investment banking networking activity is taking place at university campuses and also at the offices of investment banks.\nMacquarie Group, which is understood to take the largest number of interns, typically has a networking event in June where potential interns apply for a spot, providing academic transcripts and resumes as part of the screening.\nCitigroup has an annual stock pitch challenge where students present and pitch a stock to industry professionals, with first prize being paid work experience within the markets division and the likelihood of an internship interview.\n Citi's local head of markets Itay Tuchman​ said the firm was engaging with students earlier and also ranking them on personality and leadership skills beyond academic achievements.\n\"It's not the people that are science or maths wizards, it's the people that have the ability to work as a team and know how to win,\" he said. \"It's critical for us … for me it's really the way to build the firm.\"\nDuncan Lee, an analyst in Citi's markets unit, came through the program after winning the stock pitch. He said while he was initially worried about the stories he'd heard about investment banks, he hadn't experienced a \"face time\" culture.\nHis advice to others: \"Be proactive in investigating what you're interested in.\"\nRetention top of the list Retention is also a priority for banks.\nCredit Suisse Australia chief John Knox said the firm had a \"good track record\" of retention as it provided career development and opportunities to be posted offshore.\n\"The intern and graduate programs are really important. The goal is to bring them in as interns, then see them progress to graduates and analysts and build their careers,\" he said.\nBut the industry has been marred by a number of incidents in the past three years, prompting some companies to rein in of the working hours of interns.\nGoldman Sachs has told its summer interns not to stay in the office overnight and other firms have banned working on Saturdays.\nThat followed the death of a London-based Bank of America intern in 2013 after working 72 hours without a break. It has since been found he died of natural causes. The deaths of Goldman Sachs analyst Sarvshreshth Gupta​ and a young Moelis & Co banker in New York have also exacerbated the situation.\nThe debate around work hours comes as data showed that local graduate employment levels sunk to the lowest level on record with almost one in three bachelor degree graduates still looking for full-time work after finishing their course.\nAbout 32 per cent of recent bachelor graduates were still looking for full-time work four months after graduating in 2014.\nThe rates vary by field. The percentage of accounting and business study graduates searching for work is at a record high, while the percentage of economics graduates looking for work four months after finishing their course is up to almost one in four.\nWhile high, the outcomes for economics graduates were worse in 1992, when almost one in three economic graduates were looking for work.", "external_links": [], "published": "2015-07-30T17:00:00.000+03:00", "crawled": "2015-07-30T14:08:29.866+03:00", "highlightTitle": ""}