{"organizations": [], "uuid": "c4084ddd8d5979c90af4d057445c61f311c0b89f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/b/v/b/9/image.related.afrArticleLead.620x365.gibw3u.png/1436846504210.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/policy/tax/property-levy-could-raise-9b-for-states-says-grattan-institute-20150714-gibw3u", "country": "AU", "title": "Property levy could raise $9b for states, says Grattan Institute", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Property levy could raise $9b for states, says Grattan Institute | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T19:00:00.000+03:00", "replies_count": 0, "uuid": "c4084ddd8d5979c90af4d057445c61f311c0b89f"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/policy/tax/property-levy-could-raise-9b-for-states-says-grattan-institute-20150714-gibw3u", "ord_in_thread": 0, "title": "Property levy could raise $9b for states, says Grattan Institute", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Grattan institute estimates that an annual levy of $2 for every $1000 of unimproved land value - or $1 for every $1000 of capital improved property value - would raise around $7 billion a year. James Mooney Share on twitter by Jacob Greber State governments could boost the efficiency of the economy by $9 billion a year if they adopted a tax on property and ultimately phased out stamp duty.\nThe finding is at the heart of a report by the Grattan Institute , which argues a tax levied on the value of property holdings would be a fairer way of funding the burden of health and education services that are rising faster than gross domestic product.\nProperty taxes – which Grattan institute director John Daley concedes are politically difficult to impose – are positive economically because they don't distort incentives to work, save or invest.\n\"Unlike capital, property is immobile – it cannot shift offshore to avoid higher taxes,\" he says in the report. Amid concern about the risks of multinational tax avoidance and the rising value of residential property relative to incomes, property taxes should become a priority.\nThe report finds that state governments are under far more medium-term budget pressure than people realise, particularly with cost pressures driving up hospital expenses just as the Commonwealth has announced it would no longer fund real increases.\nState budgets are also far more vulnerable to commodity price swings outside the traditional resources states given that when WA collects less by way of royalties it receives from from the goods and services tax.\nAn alternative revenue source should be charging homeowners and property owners a levy, that could be relatively small yet still generate considerable amounts of revenue for services.\nThe Grattan institute estimates that an annual levy of $2 for every $1000 of unimproved land value – or $1 for every $1000 of capital improved property value – would raise around $7 billion a year.\n A homeowner living in a median-priced Sydney home of $772,000 would pay a levy of $772 a year. Their Melbourne equivalent would pay $560 and those on low incomes with no wealth would pay nothing, while low-income retirees with valuable houses could defer paying until their homes are sold, Mr Daley argues.\nMr Daley says that even higher property taxes could be used to pay for a reduction and eventual scrapping of stamp duties, which he described as among the most inefficient and unfair taxes still available to states, as well as being linked to property market volatility.\n\"Shifting from stamp duty to a broad-based property tax would provide a more stable tax base for states, spread the tax burden more fairly, and add up to $9 billion annually to GDP,\" Mr Daley said.\nThe paper is the second in a four-part Grattan series on priorities for repairing Commonwealth and state budgets.\nThe first report, published earlier this month, found that the federal government's failure to fix a budget based on over-optimistic growth forecasts would see Australians slugged an extra $100,000 in taxes over their lifetimes to pay for today's spending commitments.\nMr Daley says in the report, to be published on Wednesday, that property tax reform would give state governments greater control over their own destinies with minimal drag on their economies.\nAlternatives to boosting state revenue sources include sharing in Commonwealth income tax receipts, or broadening or increasing the GST.\nThe report finds that Australia collects a relatively small amount of money from property taxes, despite the housing and land representing a potentially large tax base worth $8.3 trillion in mid-2014.\nAsked whether increasing revenue from property taxes would effectively enable states to expand the size of government, Mr Daley said they should still do the hard work on finding spending savings.\n\"But around the developed world, we're seeing spending on health go up faster than GDP.\n\"That means the size of government is going up.\n\"Australia has some of the very best health outcomes in the world, yet our spending per person is pretty middle of the road relative to the OECD.\n\"I'm sure there are things we can do to reduce health spending. But it's a game of inches because inherently it's a relatively efficient system.\n\"But given the rate of increased spending on healthcare – not just in Australia but around the world – our guess is we're going to have to do something on the revenue side.\"", "external_links": ["http://grattan.edu.au/", "https://twitter.com/jacobgreber"], "published": "2015-07-14T19:00:00.000+03:00", "crawled": "2015-07-14T14:06:31.000+03:00", "highlightTitle": ""}