{"organizations": ["Acquire Citigroup", "Scotiabank", "Commercial Banking Operations"], "uuid": "4df0ba97765f9c4d9b293fd425cdfff6a7fcacde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=C", "section_title": "Yahoo! Finance: C News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125cvcbem/*http://www.noodls.com/view/0CA3C5BF273B5D9D04B35575D5CD58FCC366E4B4", "country": "US", "title": "Scotiabank to Acquire Citigroup's Retail and Commercial Banking Operations in Panama and Costa Rica", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Scotiabank to Acquire Citigroup's Retail and Commercial Banking Operations in Panama and Costa Rica", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T16:23:00.000+03:00", "replies_count": 0, "uuid": "4df0ba97765f9c4d9b293fd425cdfff6a7fcacde"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125cvcbem/*http://www.noodls.com/view/0CA3C5BF273B5D9D04B35575D5CD58FCC366E4B4", "ord_in_thread": 0, "title": "Scotiabank to Acquire Citigroup's Retail and Commercial Banking Operations in Panama and Costa Rica", "locations": ["Panama"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close \nTORONTO, ON and NEW YORK, NY --(Marketwired - July 14, 2015) - Scotiabank announced today that an agreement has been reached to acquire Citigroup's retail and commercial banking businesses in Panama and Costa Rica, subject to regulatory approval. Scotiabank's common equity tier one capital ratio will be impacted by approximately 15 basis points. \nThis acquisition is in line with Scotiabank's strategy to increase scale within its footprint and complements its operations in Panama and Costa Rica. This transaction will provide a significant lift to the Bank's market share in credit cards to approximately 18% in Panama and 15% in Costa Rica, ranking Scotiabank number two in both countries in this segment. \nThis acquisition will nearly triple Scotiabank's customer base in these two countries from approximately 137,000 to 387,000, providing significant opportunities to leverage leading regional loyalty programs and key strategic alliances. \nCitibank's operations in Costa Rica and Panama include 27 branches which serve more than 250,000 retail and commercial banking customers. Citibank has been operating in Costa Rica since 1968 and in Panama since 1904 and will continue to operate in these countries with a focus on its Corporate and Institutional Banking Business, and International Wealth Management Services, capitalizing on its global presence and competitive leadership position in these segments. \nThe agreement also includes the assumption of Citigroup employees from the retail and commercial banking businesses in Panama and Costa Rica by Scotiabank Panama and Costa Rica, respectively. Until the transaction receives the necessary regulatory approvals, all operations, branches, products and benefits programs will continue to operate as usual. Scotiabank and Citibank will work together to ensure a smooth transition for customers and employees. \nAbout Scotiabank in Panama Scotiabank entered Panama in 1974 and has since grown to an operation with USD$2,700 million in assets, 16 branches and 22 ABMs. Scotiabank serves approximately 27,000 customers in Panama. \nAbout Scotiabank in Costa Rica Scotiabank entered Costa Rica in 1995 and has since grown to an operation with USD$2,650 million in assets, 35 branches and 153 ABMs. Scotiabank serves approximately 110,000 customers in Costa Rica. \nAbout Scotiabank Scotiabank is Canada's international bank and a leading financial services provider in North America, Latin America, the Caribbean and Central America, and parts of Asia. We are dedicated to helping our 21 million customers become better off through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With a team of more than 86,000 employees and assets of $837 billion (as at April 30, 2015), Scotiabank trades on the Toronto (TSX: BNS) and New York Exchanges (NYSE: BNS). Scotiabank distributes the Bank's media releases using Marketwired. For more information, please visit www.scotiabank.com and follow us on Twitter @ScotiabankNews. \nAbout Citigroup Citi, the leading global bank, has approximately 200 million customer accounts and does business in more than 160 countries and jurisdictions. Citi provides consumers, corporations, governments and institutions with a broad range of financial products and services, including consumer banking and credit, corporate and investment banking, securities brokerage, transaction services, and wealth management. www.citigroup.com | Twitter: @Citi | YouTube: www.youtube.com/citi | Blog: http://blog.citigroup.com | Facebook: www.facebook.com/citi | LinkedIn: www.linkedin.com/company/citi", "external_links": [], "published": "2015-07-14T16:23:00.000+03:00", "crawled": "2015-07-15T09:52:41.000+03:00", "highlightTitle": ""}