{"organizations": ["Associated Press"], "uuid": "63d1976667527bf14f0f914dc15bee3e7bb6abb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/lgvCEDQfB_sQ4_WkglZTJA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/US_AHTTP_AP_HEADLINES_BUSINESS/061799259f2e241d7b0f6a7067005804_original.jpg", "site_section": "https://au.finance.yahoo.com/news/category-currencies/?format=rss", "section_title": "Currency & Forex News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/greek-campaigns-neck-neck-crucial-175428280.html", "country": "US", "title": "Greek campaigns neck and neck before crucial referendum", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Greek campaigns neck and neck before crucial referendum", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T22:47:00.000+03:00", "replies_count": 0, "uuid": "63d1976667527bf14f0f914dc15bee3e7bb6abb2"}, "author": "", "url": "https://au.finance.yahoo.com/news/greek-campaigns-neck-neck-crucial-175428280.html", "ord_in_thread": 0, "title": "Greek campaigns neck and neck before crucial referendum", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Elena Becatoros"], "text": "Sat, Jul 4, 2015, 9:06 AM AEST - Australia Markets closed Greek campaigns neck and neck before crucial referendum Greek polls shows 2 sides neck and neck before crucial Sunday referendum By Elena Becatoros, Associated Press | Associated Press – 3 hours ago Recommend View Photo \nA member of the Communist-affiliated PAME labor union shouts slogans at the police during an anti-austerity protest calling to \"Vote NO\" outside of the in central Athens, on Friday, July 3, 2015. Greece braced for more chaos on the streets outside its mostly shuttered banks Thursday, as Athens and its creditors halted talks on resolving the country's deepening financial crisis until a referendum this weekend. (AP Photo/Petros Karadjias) \nATHENS, Greece (AP) -- The brief but intense campaign in Greece's critical bailout referendum ends Friday, with simultaneous rallies in Athens supporting \"yes\" and \"no\" answers to a murky question in what opinion polls suggest will be a very close vote. \nThousands began gathering for the rallies, which were being held about 800 meters (half a mile) apart. Brief clashes broke out between a group of dozens of anti-establishment protesters and police at the tail end of the \"no\" rally just as it was getting under way. \nPrime Minister Alexis Tsipras called the referendum last weekend, asking Greeks to decide whether to accept creditors' proposals for more austerity in exchange for rescue loans — even though those proposals are no longer on the table. \nNo campaigning is allowed the day before an election in Greece, so Friday's rallies would be the closing salvoes in the battle to persuade voters ahead of Sunday. \nTsipras says a \"no\" vote would put him in a stronger position to seek a better deal for Greece within the 19-nation eurozone to reduce its 320 billion-euro national debt and make payments more sustainable. \nIn a televised address to the nation Friday, Tsipras urged Greeks to vote \"no to ultimatums, divisions and fear.\" He emphasized that Sunday's referendum is not a vote on whether Greece will remain in the euro, Europe's joint currency. \nBut opposition parties, and many European officials, say a \"no\" vote would drive Greece out of the euro and into an even more impoverished future. \nGreek Finance Minister Yanis Varoufakis told Ireland's RTE radio Friday that an agreement with creditors \"is more or less done\" and that the only issue left is debt relief. \nBut the head of the eurozone finance ministers' group, Jeroen Dijsselbloem, rejected the idea, pointing out negotiations had been broken off. \n\"There are no new proposals from our side and, whatever happens, the future for Greece will be extremely tough,\" Dijsselbloem said. \"To get Greece back on track and the economy out of the slump, tough decisions will have to be taken and every politician that says that won't be the case following a 'no' vote is deceiving his population.\" \nTwo polls published Friday show the two sides in a dead heat, with an incremental lead of the \"yes\" vote well within the margin of error. \nBoth also showed an overwhelming majority of people — 74 percent in one poll and 76 percent in the other — want Greece to remain in the euro currency. \nBoth polls were conducted by ALCO. The first was carried out for To Ethnos newspaper with interviews conducted Tuesday and Wednesday, and the second for Proto Thema newspaper and website on July 1-3. \nThe Ethnos poll found 41.5 percent will vote \"yes\" and 40.2 percent \"no,\" well within the margin of error of 3.1 percentage points. Another 10.9 percent were undecided and the rest said they would abstain or leave their ballots blank. \nIn the Proto Thema survey, 41.7 percent said they would vote \"yes\" and 41.1 percent \"no,\" with 10.7 percent undecided and the rest either casting blank ballots or abstaining. \nBoth had a margin of error of 3.1 percent. \nLater in the day, Tsipras was to speak at the \"no\" rally in the capital's main Syntagma Square outside Parliament, while \"yes\" supporters would gather at the nearby Panathenian Stadium, where the first modern Olympics were held in 1896. \nThe vote could be the most important in Greece's modern history, but the question is unclear and many voters are confused about what's at stake. \nThe Council of State, the country's highest administrative court, rejected an appeal Friday by two private citizens asking the court to rule the referendum illegal and call it off. \nMuch of the ambiguity arises from the complicated question on the ballot paper: \n\"Must the agreement plan submitted by the European Commission, the European Central Bank and the International Monetary Fund to the Eurogroup of 25 June, 2015, and comprised of two parts which make up their joint proposal, be accepted? The first document is titled 'reforms for the completion of the current program and beyond' and the second 'Preliminary debt sustainability analysis.'\" \nVoters are asked to check one of two boxes: \"not approved/no\" and — below it — \"approved/yes.\" \nApostolos Foutsitzis, a 43-year-old medical scanner operator in the northern city of Thessaloniki, said he was confused by the question but plans to vote \"yes\" because he wants Greece to remain in Europe. \n\"The referendum is unclear in the way it is being phrased, so I interpret this ambiguity as meaning we might stay in Europe or not,\" he said. \nGreek banks have been closed during the week-long campaign to staunch a run, with cash machines limiting daily withdrawals to 60 euros ($67) — although in practice this has been reduced to 50 euros as most machines have run out of 20-euro notes. \nSome banks opened to let pensioners without ATM cards withdraw up to 120 euros a week, with crowds of elderly people waiting outside the doors for hours. Tsipras has said the measures are temporary. \nThe country's bailout package expired Tuesday, and Germany's finance minister on Friday dampened hopes that a deal for another can be reached quickly. \nWolfgang Schaeuble told Germany's Bild daily that any negotiations after the Greek vote \"will take a while.\" \nHe said Greece would first have to apply for aid and eurozone finance ministers would then have to consider whether to open negotiations, which would have to be approved by the German Parliament. He insisted Greece would have to make efforts of its own in return for any aid. \n___ \nThis story has been corrected to show that the first modern Olympics were held in 1896, not 1894. \n___ \nOnline: Official referendum website http://www.referendum2015gov.gr/en/ \n___ \nCostas Kantouris and Derek Gatopoulos in Athens, Geir Moulson in Berlin and Michael Corder in The Hague, Netherlands, contributed to this report. \n___ \nFollow Becatoros on Twitter on https://twitter.com/ElenaBec @y7finance on Twitter, become a fan on Facebook", "external_links": [], "published": "2015-07-03T22:47:00.000+03:00", "crawled": "2015-07-04T02:09:41.000+03:00", "highlightTitle": ""}