{"organizations": [], "uuid": "16672d6e88e0cae46949a81c6769649de803df9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/qvm8pcb54i_5467611268421_418005948679.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/631224/1/gas-supply-to-atuabo-to-be-delayed-for-3-more-week.html", "country": "US", "title": "Gas supply to Atuabo to be delayed for 3 more weeks", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Gas supply to Atuabo to be delayed for 3 more weeks", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T11:06:00.000+03:00", "replies_count": 0, "uuid": "16672d6e88e0cae46949a81c6769649de803df9c"}, "author": "", "url": "http://www.modernghana.com/news/631224/1/gas-supply-to-atuabo-to-be-delayed-for-3-more-week.html", "ord_in_thread": 0, "title": "Gas supply to Atuabo to be delayed for 3 more weeks", "locations": ["Atuabo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  22 July 2015 09:06 CET Gas supply to Atuabo to be delayed for 3 more weeks By BFT | NSA \nGas from the Jubilee Field off-shore Cape Three Points to Gas Processing Atuabo is to be delayed for a further three weeks, Tullow Oil has said. \nChallenges with gas compression systems on the FPSO Kwame Nkrumah have been identified as the main problem. \nTullow Oil plc in a statement said \"Gas exports from the Jubilee Field to the Ghana Gas Plant at Atuabo have been suspended since July 3, 2015 due to technical issues with gas compression systems on the FPSO Kwame Nkrumah, and are expected to resume by mid- August. \n\"Tullow has mobilised a team of experts to rectify the fault within the gas compression system and estimates that it will take approximately a further 3 weeks to reinstate gas exports and full oil production.\" \nChallenges with the compressors over the past three weeks have meant that thermal plants sited in the Western Region, which were hitherto running on cheap gas supplied by Ghana Gas Plant, have been operated using crude oil which is power. \nThe huge cost involved in running the plants on crude oil coupled with insufficient supply of gas from Nigeria via the West Africa Gas Pipeline, is likely to compound the current energy crisis that has necessitated a nationwide power rationing regime. \nLargest power producer Volta River Authority (VRA) conservatively estimates that it requires about US$50million to power its thermal plants in the absence of gas every three weeks - a financially challenging position for the Authority. \nThe oil producer says it will review its 2015 production forecast for Jubilee due to the recent development. \"Tullow will review its 2015 production forecast for Jubilee and provide an update on progress at its half- yearly results on July 29.\" \nOil production is currently constrained to approximately 65,000 bopd and is under constant review. The company however assured that there is no effect on the field's reservoir or resources. \nThe news led to a dip in shares price yesterday. New agency, Reuters, reported that shares in the Africa-focused energy group fell 2 percent after news that oil and gas exports from the field will be reduced for a further three weeks to fix a gas compression issue. \nA downward review of Tullow's 2015 oil production forecast, which comes on the heels of a sustained period of falling oil prices, is expected to lead to a significant shortfall in government revenue this year. \nFinance Minister Seth Terkper, in a mid-year budget review, acknowledged this and asked for a reduced cap on the Ghana Stabilisation Fund (GSF). \n\"With the downward revision of the expected oil revenue for 2015, resulting from the drastic decline in world oil prices, we propose to reduce the cap on the GSF to Ȼ150million for the rest of 2015,\" he said.", "external_links": [], "published": "2015-07-22T11:06:00.000+03:00", "crawled": "2015-07-22T10:50:49.860+03:00", "highlightTitle": ""}