{"organizations": [], "uuid": "09c918d1ff374dd9deb8899cb8c73857ba60679f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/i3ra3qoub0c4/v2/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-12/bond-traders-put-on-tenterhooks-after-greece-given-new-deadline", "country": "US", "title": "Bond Traders Put on Tenterhooks After Greece Given New Deadline", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Bond Traders Put on Tenterhooks After Greece Given New Deadline - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T04:17:00.000+03:00", "replies_count": 0, "uuid": "09c918d1ff374dd9deb8899cb8c73857ba60679f"}, "author": "Eshe Nelson", "url": "http://www.bloomberg.com/news/articles/2015-07-12/bond-traders-put-on-tenterhooks-after-greece-given-new-deadline", "ord_in_thread": 0, "title": "Bond Traders Put on Tenterhooks After Greece Given New Deadline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bond investors who pushed up prices of Spanish and Italian securities on speculation a Greek bailout deal was in sight will have to put that optimism at bay.\nDemand for haven assets instead may boost German bonds when European markets open on Monday after Greece was given three days to pass austerity measures into law or risk a suspension from the euro area. The European Union previously set a Sunday deadline for an accord.\nTraders may be caught off guard by the latest twist in Greece’s debt saga. The premium they demand to hold Italian debt over Germany’s narrowed by the most in almost three weeks on July 10 after Greece’s proposals for a deal seemed set to advance negotiations and bring it back from the brink of expulsion from the currency bloc.\n“It’s likely we are going to see risk-off trades on Monday as the market is disappointed there’s no concrete deal,” said Peter Chatwell, a fixed-income strategist at Mizuho International Plc. “Any spread-widening or market moves will be contained because no deal doesn’t mean no further negotiations or a complete breakdown in communication. While there is lack of trust, there will probably be some interim funds made available to Greece.”\nGerman bonds fell last week while Spanish and Italian securities rallied as investors became increasingly optimistic that a deal for Greece would be struck. The region’s bond markets have swung back and forth on shifts in sentiment toward Greece, though moves have been damped by investor speculation the European Central Bank would provide support in the event of a Greek exit.\nYield Spreads The extra yield, or spread, investors demand to hold Italy’s 10-year bonds instead of benchmark German securities was at 124 basis points, or 1.24 percentage points, on July 10. It reached a low for the year of 84 basis points in March and jumped as high as 199 basis points on June 29. The Spain-Germany spread was at 123 basis points.\nWhile the ECB has frozen the level of emergency aid available to Greek lenders, its target for 60 billion euros ($67 billion) a month of quantitative-easing debt purchases may continue to temper any selloff in the region’s so-called periphery. Policy makers have emphasized that they have additional tools to tackle financial turbulence in the currency bloc and elsewhere.\nGreece’s banks have been shut and capital controls imposed for the past two weeks. The stock market was also closed and the Bank of Greece halted dealing of government bonds on its electronic trading platform. The nation became the first developed country to miss a payment to the International Monetary Fund when it skipped a $1.7 billion obligation in June.\n‘On Edge’ Greece has further payments coming due. A yen-denominated bond matures on July 14 and there are 11.7 billion yen ($96 million) of the notes outstanding.\nThen the Greek state is due to pay 3.5 billion euros in redemptions to the ECB on July 20, as well as making various coupon payments before the end of the month.\n“The Greeks would do best if they left the euro zone on their own, did their homework and then tried to come back,” Slovak Prime Minister Robert Fico told reporters on a flight from Bratislava. “This is just torture for everybody.”\nFrench President Francois Hollande said on arriving at a meeting of euro-area leaders in Brussels that there should be no temporary exit and France would do everything to reach an agreement on Greece.\n“I would expect a bit of a negative reaction given how much discussion there seemed to be about a plan for Grexit,” Owen Callan, a fixed-income strategist at Cantor Fitzgerald LP in Dublin, said referring to a Greek exit from the euro. “But there shouldn’t be a panic or severe risk-off. It’s still very much on edge.”", "external_links": [], "published": "2015-07-13T04:17:00.000+03:00", "crawled": "2015-07-12T23:44:50.000+03:00", "highlightTitle": ""}