{"organizations": ["IRA"], "uuid": "282e04c6c86a4e359b01dbc5726b53cc34e79abd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiplinger.com", "main_image": "http://www.kiplinger.com/kipimages/pages/13825.jpg", "site_section": "http://www.kiplinger.com/about/rss/kiplinger.rss", "section_title": "Kiplinger's Personal Finance", "url": "http://www.kiplinger.com/article/retirement/T032-C000-S004-giving-heir-roth-ira-for-inheritance-taxes.html?rss_source=rss", "country": "US", "title": "Retirees, Consider This Valuable New Strategy for Passing IRAs to Your Heirs", "performance_score": 0, "site": "kiplinger.com", "participants_count": 0, "title_full": "Retirees, Consider This Valuable New Strategy for Passing IRAs to Your Heirs", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T07:00:00.000+03:00", "replies_count": 0, "uuid": "282e04c6c86a4e359b01dbc5726b53cc34e79abd"}, "author": "", "url": "http://www.kiplinger.com/article/retirement/T032-C000-S004-giving-heir-roth-ira-for-inheritance-taxes.html?rss_source=rss", "ord_in_thread": 0, "title": "Retirees, Consider This Valuable New Strategy for Passing IRAs to Your Heirs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "print order a reprint Retirees, Consider This Valuable New Strategy for Passing IRAs to Your Heirs Depending on the tax rates of you and your children, a traditional IRA may net a larger inheritance. Follow @susanbgarland Thinkstock \nMany retirees hold both a tax-free Roth IRA and a tax-deferred account, such as a traditional IRA or a 403(b). And it’s now a mantra among many financial advisers that the Roth is the better account to leave to your children because they can take tax-free withdrawals over their lifetimes. \nBut this may not always hold true. Your children could end up with a bigger inheritance if you tap the Roth for your own expenses and leave your traditional IRA to them, even though they will pay income tax on each withdrawal. The deciding factor: your tax rate versus your beneficiary’s rate, according to a recent study in the Journal of Personal Finance . See Also: 10 Things You Must Know About Roth Accounts \nThe general rule of thumb, the researchers found, is that a child who has a lower tax rate than the parent will get a bigger pot of money if he gets most or all of the inheritance from the traditional IRA. If the child has a higher tax rate than the parent, the heir will do better getting most or all from the Roth. “The widow and heir can maximize their joint after-tax amount by having the person with the lower tax rate pay tax” on the traditional IRA, says William Reichenstein, professor of investment management at Baylor University in Waco, Tex. (He is a co-author of the study with Tom Potts, a professor of financial planning at Baylor.) Advertisement \nSay the mother has $100,000 in a traditional IRA and $100,000 in a Roth IRA. She needs $60,000 in after-tax income to meet her spending needs. Assume she dies after she pays her expenses. \nAlso assume that the mother has a 40% combined federal and state tax rate, while the son’s rate is 15%. She takes the $60,000 tax free from the Roth for expenses. She leaves her son the $40,000 Roth balance, plus the $100,000 in the traditional IRA. His after-tax take on the traditional IRA is $85,000—for a total after-tax inheritance of $125,000. \nIf instead the mother taps her traditional IRA for expenses, she must withdraw the entire $100,000 to get $60,000 in after-tax income. Her son’s take: the $100,000 tax-free Roth. \nThe son fares much better with the first strategy—getting the bulk of his inheritance from the traditional IRA. That’s because the funds in the traditional IRA are “being taxed at the son’s 15% tax rate instead of the mom’s 40% tax rate,” Reichenstein says. \nWhat happens if the tax rates are reversed, with the son at 40% and the Mom at 15%? The son will inherit $100,000 in after-tax money if his mother takes her expenses from the Roth, according to Reichenstein. He gets close to $124,000 if she taps her traditional IRA to live on and pays just 15% tax on her withdrawal. When There's More Than One Heir \nThe calculations can be even more complex if a parent has two or more children with different tax rates. Giving each child an equal share of each account will lead to unequal after-tax inheritances, the study found. To equalize the inheritances, the parent should give the kid with the lowest tax rate a bigger share of the traditional IRA and the kid with the higher rate a larger share of the Roth. \nSay a widower has a $100,000 Roth and a $100,000 traditional IRA that he wants to leave to his daughter and son. Assume the son pays a 15% tax rate, and the daughter pays a 40% tax rate. \nDad leaves half of each account to each child. Each child gets $50,000 tax free from the Roth. But the son, at his 15% tax rate, gets an after-tax $42,500 from his $50,000 share of the traditional IRA, while the daughter, at 40%, gets an after-tax $30,000. \nTo even out the legacies, Dad gives his son $7,500 in tax-free money from the Roth, plus the $100,000 traditional IRA. Taking into account his 15% tax tab when he withdraws from the traditional IRA, his after-tax inheritance is $92,500. The daughter inherits $92,500 tax free from the Roth. Because the IRA owner won’t know how much will be in the accounts when he or she dies, the owner can leave the children percentages: 7.5% of the Roth to the son and 92.5% to the daughter, Reichenstein says.", "external_links": [], "published": "2015-07-31T07:00:00.000+03:00", "crawled": "2015-07-31T22:49:24.349+03:00", "highlightTitle": ""}