{"organizations": [], "uuid": "0acd4cf90e65e466510b174cb7534afcbc4f80a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/g/w/4/0/j/image.related.afrArticleLead.620x365.gidoxu.png/1437024894994.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/mining/coal/greg-hunt-may-still-block-shenhua-coal-mine-20150716-gidoxu", "country": "AU", "title": "Greg Hunt may still block Shenhua coal mine", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Greg Hunt may still block Shenhua coal mine | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T13:31:00.000+03:00", "replies_count": 0, "uuid": "0acd4cf90e65e466510b174cb7534afcbc4f80a1"}, "author": "Geoff Winestock and Primrose Riordan", "url": "http://www.afr.com/business/mining/coal/greg-hunt-may-still-block-shenhua-coal-mine-20150716-gidoxu", "ord_in_thread": 0, "title": "Greg Hunt may still block Shenhua coal mine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Broadcaster Alan Jones is a vocal critic of the Shenhua mine. Alex Ellinghausen by Geoff Winestock and Primrose Riordan Environment Minister Greg Hunt has said he could still block Shenhua's controversial Watermark coal mine and has promised to send a key aspect of the project back for further study.\nMr Hunt said that he would seek further approval from an Independent Expert Scientific Committee for the water management plan for the mine which is located near prime agriculture land in the Liverpool Plains in NSW.\n\"I will do something today that I have never done before, that I am not required by law to do but I will make a public commitment. When we get this water management plan back I will refer it to the Independent Expert Scientific Committee and if they are not satisfied I won't even approve that,\" Mr Hunt told broadcaster Alan Jones on Thursday.\nMr Hunt's pledge suggests the government has been rattled by a week in which it had stood firm against increasingly shrill protests against the decision to approve $1.2 billion mine project by Chinese-owned Shenhua .\nAgriculture Minister and local MP Barnaby Joyce called the decision \"mad\" and the NSW Farmers Association passed a motion opposing the mine at their conference Sydney on Tuesday, saying they were concerned about the impact on aquifers.\nNSW premier Mike Baird whose government had already signed off on the mine stood up at the same conference and spoke in support of the mine. As recently as Wednesday the government looked like it was toughing it out. Prime Minister Tony Abbot lent his support on another Sydney radio program.\n\"All the signs tell us it is not going to have an impact on the water table and frankly if it is not going to damage the farming areas...I think we should say let's go with it,\" Mr Abbott said.\nBut Mr Hunt said on Thursday that previous reporting of the approval under the Environmental Protection and Biodiversity Act which he granted last week had not made it sufficiently clear that approval of a water management plan was still a significant hurdle. \"It was a conditional approval,\" Mr Hunt said.\n The two remaining hurdles for the project are the approval of a water management plan which involves the monitoring and technical arrangements to ensure that Shenhua is complying with its pledge to curb the mine's impact on ground water.\nAfter that the NSW government must allow Shenhua to convert its exploration license into a full mining license but this is usually a formality.\nShenhua insisted that it would be able to produce a management plan that would satisfy the IESC and the minister.\n\"Shenhua has never shied from scrutiny and genuine scientific review of the assessments supporting the Watermark project, which have been validated at every stage of the process. The Minister and the IESC have both confirmed impacts on groundwater will be negligible and can be managed during operations with strict conditions,\" Project Manager Paul Jackson said.\nJon-Maree Baker, executive officer of Namoi Water which represents water users in the catchment aroundthe mine, said she was concerned that the NSW government, which regulates water usage, would lack the resources to monitor Shenhua's impact on aquifers.\nShe said the risk was that the water management plan would just be paper shuffling. \"Once the project is approved the onus is on the local farmer to prove that a multinational coal mine is breaking the rules.\"", "external_links": [], "published": "2015-07-16T13:31:00.000+03:00", "crawled": "2015-07-16T10:14:27.000+03:00", "highlightTitle": ""}