{"organizations": [], "uuid": "f6bddd098a8170e8b40e3710c5019a5355d605cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/tatamotors027715.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/tata-motors-to-roll-out-new-launches-in-mini-truck-segment/42913.html", "country": "IN", "title": "Tata Motors to roll out new launches in mini-truck segment", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Tata Motors to roll out new launches in mini-truck segment", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T14:33:00.000+03:00", "replies_count": 0, "uuid": "f6bddd098a8170e8b40e3710c5019a5355d605cf"}, "author": "IANS", "url": "http://www.moneylife.in/article/tata-motors-to-roll-out-new-launches-in-mini-truck-segment/42913.html", "ord_in_thread": 0, "title": "Tata Motors to roll out new launches in mini-truck segment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Tata Motors to roll out new launches in mini-truck segment 42913 Tata Motors to roll out new launches in mini-truck segment 0 Comments, Be the first to comment + COMMENT IANS | 27/07/2015 05:03 PM | Tata Motors, a pioneer and market leader in the mini-truck segment in India, is working to develop innovative solutions on Tata Ace platform to cater to evolving needs of customers. Tata Ace, which celebrated 10th anniversary here on Monday, is looking to maintain its leadership position with new launches and slew of upgrades for newer designs, improved fuel efficiency and better performance. With 1.5 million Tata Ace-family vehicles on Indian roads, the company currently holds 85 percent market share in Small Commercial Vehicle (SCV) category. Popularly known as 'Chhota Haathi' in the market, Tata Ace is used as municipal and cargo vans to tankers, service deliver, food and beverage and even branding and promotion vans. R. Ramakrishnan, senior vice president, commercial vehicle business unit, Tata Motors told reporters that they are adequately equipped to cater to growing needs of the country as well as emerging competition. The company sells 10,000 per month including both Tata Ace and Magic, the passenger transportation vehicle on the same platform. The analysts have projected 10 to 12 percent growth in SCV segment in the next five years. Ramakrishnan said there was huge uncapped potential in the segment as India has only 2.5 mini truck for one large truck against the average of four mini trucks in other BRIC countries. He said with its sheer reach and penetration in terms of its network of outlets and service centres, Tata Motors has the advantage to remain a dominant player in this segment. The company is also working with authorities to get proper permits for the passenger vehicles in this category. This is also expected to make financing of the vehicles easy. He pointed out that there are one passenger vehicle for every four vehicles in this segment. \"The potential should have been reversed given the country's population, propensity to travel and limitation in the public transport,\" he said. Launched in 2005, there are 1.5 million Tata Ace vehicles in India today. One in every five commercial vehicles sold in the country is from the Tata Ace family. The company has also exported 100,000 vehicles to 28 countries since 2006. Tata Ace was first launched in south India, which remained the biggest market with six lakh vehicles. The north and the west have four lakh vehicles while there are three lakh vehicles in the east. More in Moneylife", "external_links": [], "published": "2015-07-27T14:33:00.000+03:00", "crawled": "2015-07-27T14:40:25.389+03:00", "highlightTitle": ""}