{"organizations": [], "uuid": "38ef76c711683a77062192a2a59413f10e78bd8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/06/fe-santoshtiwari2.jpg", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/economy/pm-narendra-modi-to-muster-support-of-non-nda-partners-over-a-period-of-time-on-land-bill/105854", "country": "IE", "title": "Land Acquisition Ordinance lesson for PM Narendra Modi", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Land Acquisition Ordinance lesson for PM Narendra Modi | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T17:08:00.000+03:00", "replies_count": 0, "uuid": "38ef76c711683a77062192a2a59413f10e78bd8a"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/pm-narendra-modi-to-muster-support-of-non-nda-partners-over-a-period-of-time-on-land-bill/105854", "ord_in_thread": 0, "title": "Land Acquisition Ordinance lesson for PM Narendra Modi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Fall in gold prices not yet a concern for rupee: Nomura Exclusive: GST may finally meet April 1, 2016 deadline 1st Smart City nomination: What worked for Puducherry The NDA government’s decision not to re-promulgate the Land Acquisition Ordinance is the logical conclusion of its inability to garner enough support from the non-NDA parties to get the changes in the UPA’s 2013 Act cleared in Parliament.\nWith the possibility of dilution in the consent and social impact assessment clauses proposed in the NDA’s Bill seeing the light of the day anytime soon now subsiding, re-promulgation of the Ordinance is meaningless as no entity would be willing to acquire any land for a project under its provisions now.\nThis obviously leaves the Centre with the only option of suggesting the states to come up with their own liberal norms for land acquisition, and this is what the government has decided to do.\nIn any case, the projects take off in the states and land acquisition in a particular state is largely dependent on the provisions in the law there.\nEven with the UPA’s 2013 Act, land has been getting acquired in several states and ten BJP states have already started the process of bringing in the changes in their Land Acts on the lines of the Central Bill pending before Parliament.\nRajasthan is the clear leader here. It has introduced its Bill in the assembly and the select committee of the assembly has also approved the changed norms with minor tinkering like increase in the compensation for farmers.\nTake Our Poll But in the absence of a Central law, the real problem will come up in major infrastructure projects passing through several states.\nIf all the states through which the projects such as transport corridors pass don’t have similar laws, it will be difficult to complete land acquisition process.\nThe NDA government had issued the Ordinance for completing the Mumbai-Delhi industrial corridor passing through seven states — Maharashtra, Gujarat, Rajasthan, Madhya Pradesh, Haryana, Uttar Pradesh and Delhi — only five of these states are BJP-ruled.\nThe Ordinance to amend the UPA’s 2013 Act was first issued in December last year and the President cleared its re-promulgation in May this year again.\nBut, the continued opposition of Congress and other parties to the changes has ensured that even the joint Parliamentary committee’s report that is expected in the first week of August will not be of much help in passing the NDA Bill in Parliament in the near future.\nPrime Minister Narendra Modi should look at the current situation as taking one step backward to prepare and run fast going ahead. This can only be done by getting the support of parties like TMC, AIADMK, BJD and NCP, over a period of time. The Land Bill is the biggest test of his political acumen.\n 23, 2015 9:08 am © The Indian Express Online Media Pvt Ltd", "external_links": ["http://polldaddy.com/poll/8992996"], "published": "2015-07-23T17:08:00.000+03:00", "crawled": "2015-07-23T14:45:56.726+03:00", "highlightTitle": ""}