{"organizations": [], "uuid": "014e1c832d06b4272d7fd28916bed00715f4b9d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/OcZSVwJtLQd1KXb3GhiuSA--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_SILICONALLEY_H_LIVE/Some_military_recruitment_centers_are-1c3117b921aeb38c9bc0b46ffd44b4e6.cf.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/military-recruitment-centers-no-safer-230019862.html", "country": "GB", "title": "Some military recruitment centers 'are no safer than a shoe store in a shopping mall'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Some military recruitment centers 'are no safer than a shoe store in a shopping mall'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T02:00:00.000+03:00", "replies_count": 0, "uuid": "014e1c832d06b4272d7fd28916bed00715f4b9d2"}, "author": "", "url": "https://uk.finance.yahoo.com/news/military-recruitment-centers-no-safer-230019862.html", "ord_in_thread": 0, "title": "Some military recruitment centers 'are no safer than a shoe store in a shopping mall'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Jul 19, 2015, 00:24 BST - UK Markets closed Some military recruitment centers 'are no safer than a shoe store in a shopping mall' By Bryan Logan | Business Insider – 23 minutes ago Print \n(AP Photo/Bebeto Matthews) An NYPD anti-terrorism officer stands guard with a K-9 unit at a military recruiting station in Times Square, Friday, July 17, 2015, in New York. The shooting that killed five Marines at two military facilities in Chattanooga, Tennessee has prompted questions about how best to protect these centers from potential attacks. \nRand Corporation terrorism and security expert, Brian Michael Jenkins told the New York Times Friday that facilities like the military recruiting center targeted by a 24-year-old gunman Thursday are deemed \"soft targets,\" and are \"no more protected than a shoe store in a shopping mall.\" \nJenkins says the people working there \"are in uniform, but unarmed.\" \nThat vulnerability has led the governors of at least four states to change that. Oklahoma governor, Mary Fallin (R) issued an executive order Friday allowing personnel to arm themselves at military facilities in the state , KOKH-TV reports. \n\"It is unfathomable that [unarmed Marines] should be vulnerable for attack in our own communities,\" Fallin said in a statement Friday. \nAnd on Saturday, the governors of Texas, Florida and Indiana authorized similar orders for National Guard members and recruiting offices. \n(Thomson Reuters) Florida Gov. Scott addresses an economic summit in Orlando Six National Guard storefronts in Florida will be relocated to armories. \nFlorida governor Rick Scott (R) was cited in a Reuters report, saying \"Guard members who do not carry weapons should get them and obtain expedited concealed weapon permits, if necessary.\" \nSpeaking about the fatal attacks in Chattanooga, Texas governor Greg Abbott (R) said in a news release, \"our military personnel must have the ability to defend themselves against these type of attacks on our own soil.\" \n(Larry Downing/Reuters) Texas Gov-elect Greg Abbott speaks to the media after a meeting with U.S. President Barack Obama and other Governor-elects from seven U.S. states at the White House in Washington December 5, 2014. FBI spokesman Ed Reinhold said the shooting in Chattanooga is being investigated \"as an act of terrorism until we can confirm it is not.\" \nIt's another in a string of similar attacks against military outposts in the US since 2009. In that period, three different shootings at military installations on US soil have left 26 people dead. \n(Joe Raedle/Getty Images) Christina Reed (L), Aaron Workman and Julia Morrison (R) pay their respects at a memorial setup at the entrance to the Navy Operational Support Center and Marine Corps Reserve Center where four United States Marines and a Navy sailor were killed on July 18, 2015 in Chattanooga, Tennessee. Not all of the attacks, however, were the result of homegrown extremism — but such motives have been on the rise, according to analysis from New America, a nonpartisan think tank.", "external_links": [], "published": "2015-07-19T02:00:00.000+03:00", "crawled": "2015-07-19T02:26:44.000+03:00", "highlightTitle": ""}