{"organizations": ["SRP", "EOD"], "uuid": "6680b0dc51be8a241f858a09bbef14b38d7985ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.simplyhired.com", "main_image": "", "site_section": "http://www.simplyhired.com/a/job-feed/rss/o-13205", "section_title": "Finance jobs | Simply Hired", "url": "http://www.simplyhired.com/job/duldr36z2q", "country": "US", "title": "Risk Business Analyst at Open Systems Technologies (New York City, NY)", "performance_score": 0, "site": "simplyhired.com", "participants_count": 0, "title_full": "Risk Business Analyst at Open Systems Technologies (New York City, NY)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T13:20:00.000+03:00", "replies_count": 0, "uuid": "6680b0dc51be8a241f858a09bbef14b38d7985ec"}, "author": "", "url": "http://www.simplyhired.com/job/duldr36z2q", "ord_in_thread": 0, "title": "Risk Business Analyst at Open Systems Technologies (New York City, NY)", "locations": ["New York City", "NY"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["BO Risk"], "text": "Source: BullhornReach.com Job Description: Ensure complete and accurate requirements are captured in an efficient manner; ensure their coordination and consistency of requirements; ensure appropriate scoping and requirements traceability § Translate modelling and risk requirements into functional specifications for implementable solutions in our front-to-back infrastructure § Perform analysis related to data requirements, process/flows and non-functional requirements § Support change request impact analysis and test case/script development § Document requirements in a variety of analysis artefacts required by stakeholders and developers as well as Audit and external regulators § Communicate key concepts and decisions to a variety of stakeholder audiences § Ensure the analysis effort is properly coordinated with overall programme objectives Specific § Market Data Alignment – perform business analysis in support of a strategic and regulatory-reported market data alignment programme within SRP, involving a decision to align all book EOD and EOM valuation/P&L calculation timing to the entity of the book (rather than region of trader). This is expected to have broad implications across Trading, FO Risk, BO Risk, Finance, Ops and Client Management. This role will involve performing impact analysis front to back and producing related BRDs. Extensive experience performing business analysis/support in an investment banking front office IT environment, with an emphasis on front office risk and risk managment systems. Experience working on any change programme with front to back impact (not just front office impact) will be useful, as will experience facing off to or working with enterprise or back office Risk departments and/or Product Control. § Excellent understanding of: a. the market risk business processes within Investment Banking (valuation, sensitivities, stress testing, scenarios, VaR, etc) and front office risk systems. b. financial instruments, risk and pricing c. trade capture and trade lifecycle processes d. investment banking processes including trading, risk management, product control and operations (this is crucial) § Strong analysis skills, the ability to drill into and resolve complex problems and posit pragmatic solutions § Experience with formal BA approaches/methodologies and the production of BA-related artefacts: business requirements docs, functional specs, etc. § Though the role is not technical, the applicant will be expected to have a broad understanding of technologies used in Investment Banking and be able to converse directly with technical colleagues e.g. architects and developers § Though the role is not quantitative, the applicant will require a broad understanding of financial quantitative theory and methods and be able to converse with quant colleagues § Excellent written and oral communication skills and ability to choose communication style and media appropriate to the subject and audience § Ability to lead discussions to a conclusion, negotiation skills § Experience working in a team-oriented, collaborative environment", "external_links": [], "published": "2015-07-09T13:20:00.000+03:00", "crawled": "2015-07-09T15:28:30.000+03:00", "highlightTitle": ""}