{"organizations": [], "uuid": "1a3eaf4fc0568f76fac1956dc02355796f0b57f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/images/print-edition/20150725_FNP002_0.jpg", "site_section": "http://www.economist.com/rss/finance_and_economics_rss.xml", "section_title": "The Economist: Finance and economics", "url": "http://www.economist.com/news/finance-and-economics/21659713-rebuilding-confidence-banks-bound-be-hard-long-march-normality", "country": "US", "title": "The long march to normality", "performance_score": 0, "site": "economist.com", "participants_count": 2, "title_full": "The long march to normality | The Economist", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T03:00:00.000+03:00", "replies_count": 1, "uuid": "e78859538b2d95c1e58d1a8cae9f634803763ba0"}, "author": "From the print edition", "url": "http://www.economist.com/news/finance-and-economics/21659713-rebuilding-confidence-banks-bound-be-hard-long-march-normality#post-0", "ord_in_thread": 0, "title": "The long march to normality", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Show us the money\nAFTER three weeks of closure the reopening of Greek banks on July 20th was a positive step. But the banks remain enfeebled; a liquidity crisis has turned into a solvency crisis. Until worries about their viability are quelled after the summer, when stress tests to determine their capital adequacy will be held, they will struggle to get back to some semblance of normality.\nAlthough the shutters have gone up and there are no longer queues at ATMs, little has changed in practice this week. Customers can pay in cheques and gain access to safe-deposit boxes in banks where they have stashed cash. However, strict capital controls still prevent transfers abroad and the existing limit on cash withdrawals remains in place, with only a cosmetic change from the previous daily cap of €60 ($65) to a weekly limit of €420.\nIn this section Into the home stretch Bargaining chips The long march to normality Bank free or die Bypassing the voters Much ado about trading Destination unknown European markets Financial markets Greek markets World markets Greek economy\nYet the position could have been far worse. After eking out a limited amount of cash over three weeks, the banks were close to running out altogether. What made the difference was the decision by the European Central Bank (ECB) on July 16th to raise the amount of emergency liquidity assistance (ELA) that the Bank of Greece can provide to the banks. Although the increase of €900m was relatively small, further rises appear likely, especially since a temporary €7 billion loan from a fund backed by the EU allowed the Greek government to redeem bonds worth €3.5 billion held by the ECB, together with €700m of interest, and to repay its arrears of €2 billion to the IMF on July 20th. As part of the deal with creditors, the Greek Parliament passed another set of reforms early on July 23rd.\nAs Nikolaos Karamouzis, chairman of Eurobank, one of the four big Greek banks, says, what matters now is allowing the banks to support businesses. The hope is that, with continuing tight limits on cash withdrawals, additional ELA can be passed on to companies that urgently need trade credit. Since many firms need to buy vital imports this would be combined with an easing in capital controls.\nAny such improvements are likely to rely heavily on extra ELA rather than a return of deposits. The banks previously experienced a big run when two elections were held in the early summer of 2012, arousing fears of a forced exit from the single currency and a redenomination of euro bank accounts into drachmas. Even after this risk receded after the second election in June 2012, deposits were slow to recover. Although concern about a “Grexit” has subsided once again, households and especially businesses may now worry about a “bail-in” of big deposits (above €100,000)—converting some of them to equity—in order to recapitalise the banks, as happened in Cyprus in 2013.\nAlthough Danièle Nouy, head of the ECB’s supervisory board, which is now in charge of overseeing the four big Greek banks, said in early June that the Greek banks were solvent, they have undoubtedly been the main victims of this year’s crisis. The run on them, which started in December, ahead of the election that brought Syriza to power in late January, has made them heavily dependent on central-bank funding, which now actually exceeds private deposits.\nThe protracted liquidity squeeze on the economy, exacerbated by the extraordinary developments of the past month, is taking its toll on businesses. Prospective losses from a surge in non-performing loans, already very high at 34% at the end of last year, will eat into bank capital. Quite how much damage has been done will be revealed in the autumn.\nIt nonetheless seems very unlikely that depositors will be bailed in to recapitalise the banks. For one thing, the EU’s bail-in rule is not supposed to apply until 2016 (although, within the euro area, Austria and Germany have already introduced it this year). That should rule out raids on deposits, restricting the sacrificial victims to shareholders (together with small amounts of subordinated debt).\nEven if bail-ins were allowed they would be extraordinarily counter-productive. In Cyprus there was a case for using this approach on the ground that many of the deposits affected were ultimately owned by Russians and Ukrainians and were of dubious provenance. But in Greece they would destroy the working capital of small and medium-sized businesses, the backbone of the country’s economy.\nBut until the banks have been sorted out and recapitalised this autumn depositors will remain nervous. Mr Karamouzis says that, if the rest of Europe could offer swift reassurance to Greek depositors that they will not be bailed in, it would have a catalytic effect in restoring confidence and getting deposits back into the banks. But as things stand it will be several months at the least before there is a return to normal. Whatever that now means in Greece.\n ", "external_links": ["http://cdn.static-economist.com/sites/default/files/imagecache/full-width/images/print-edition/20150725_FNP002_0.jpg"], "published": "2015-07-25T03:00:00.000+03:00", "crawled": "2015-07-24T06:19:21.459+03:00", "highlightTitle": ""}