{"organizations": [], "uuid": "a3e1ef525246449dc8f5e9ecea435100c537febf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/china-relationship-enter-golden-era-130939339.html", "country": "US", "title": "China relationship will enter 'golden era' this year, says BRICS term creator", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "China relationship will enter 'golden era' this year, says BRICS term creator", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T16:09:00.000+03:00", "replies_count": 0, "uuid": "a3e1ef525246449dc8f5e9ecea435100c537febf"}, "author": "", "url": "https://uk.finance.yahoo.com/news/china-relationship-enter-golden-era-130939339.html", "ord_in_thread": 0, "title": "China relationship will enter 'golden era' this year, says BRICS term creator", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 21, 2015, 14:14 BST - UK Markets close in 2 hrs 16 mins China relationship will enter 'golden era' this year, says BRICS term creator By Szu Ping Chan | Telegraph – 4 minutes 39 seconds ago GS-PB 25.7364 \nLord O'Neill says UK policymakers are in \"very active discussions\" with China on projects that will strengthen relations between the two countries \nBritain's relationship with China will enter a golden era this year, as the two countries forge fresh business links to strengthen their relationship and boost growth, according to Lord O'Neill. \nThe UK's commercial secretary to the Treasury, who represented Britain during the formal signing of the creation of the Asian Infrastructure Investment Bank (AIIB) last month, said there were a number of areas in which deeper co-operation between the world's second and fifth largest economies could help to create stronger, more sustainable growth. \nSpeaking at the National Institute of Economic and Social Research (NIESR), he said president Xi Jinping's state visit in October - the first by a Chinese leader in ten years - could trigger a wave of new deals. \nHe said: \"Right now, Chinese leaders are describing 2015 as a golden year for UK - China relations. While one does not want to build up too much expecation for the state visit, my suggestion to Chinese policymakers when I was in Beijing was: why can we not make it a golden rest-of-the-decade? Why does it just need to be a golden year?\" \nLord O'Neill of Gatley, who coined the BRIC moniker during his time as chief economist at Goldman Sachs (NYSE: GS-PB - news ) , also said there were opportunities for Britain to aid China's transition towards what the country's premier Li Keqiang has described as a “new normal” of slower but healthier growth. \n\"I think there are all sorts of opportunities - especially now that China is going through a new era of growth which is more about the quality rather than the quanitity,\" he said. \nXi Jinping, China's president, will make his first state visit to the UK in October - which is also the first by a Chinese leader in 10 years (Photo: Getty) \nLord O'Neill said policymakers were in \"very active discussions\" with China on projects related to the growing threat of resistance to antibiotics, a topic which he is currently leading an independent review on , and nuclear development. \n\"The natural symbiosis between the UK and China going forward involves a number of areas of co-operation - more than there has been in the last decade - whether it be direct Chinese involvement in infrastructure projects in the UK - nuclear is one of the main [areas]. \n\"There's a lot that the UK can do and wants to do to help China grow. It's a pretty exciting moment for our relationship,\" he said. \nLord O'Neill, who delivered a keynote speech on UK devolution on Tuesday, said it was \"not healthy for the long term balance of the economy\" if London continued to strengthen its status as the dominant the driver of UK growth. \nWhile he said he was unsure about the \"ultimate equilibrium\" of devolved powers, Lord O'Neill added that it was important for all policymakers to be pulled out of their \"comfort zone\". \nHe said: \"I often get asked what is the end point of all this, and one of the really exciting aspects is: I don't think I or anybody else knows the answer. \n\"Part of the success of all of this is trying to take everybody out of their comfort zone, whether its myself, the Prime Minister, the Chancellor, and most importantly the local council leaders and with it the buisness people and individuals they represent. Where it all ends up, I have no idea.\" \nTony Travers, a professor at the London School of Economics, said devolving more powers to local governments made both political and economic sense. \nHe said big spending cuts over the next few years meant central government may have no choice but to devolve big parts of spending such as the NHS to ensure the country lives within its means. \n\"Unlike national government, [local government] is required to balance its budget and it has to borrow within prudential rules,\" he said. \"If Britain's spending had been in the hands of local government the deficit would have been smaller\".", "external_links": [], "published": "2015-07-21T16:09:00.000+03:00", "crawled": "2015-07-21T16:15:19.609+03:00", "highlightTitle": ""}