{"organizations": [], "uuid": "b860369e48a7bbbf123436e0e471b37979903b92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.therepublic.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/fit-in/1200x630/filters:fill(white)/cdn1.therepublic.com/tr_assets/images/TheRepublic-Icon-2048x2048.jpg", "site_section": "http://www.therepublic.com/feed/subject/5bfcea40857510048d1dff2260dd383e", "section_title": "Personal finance News from TheRepublic.com", "url": "http://www.therepublic.com/view/story/3e5968cbd39f4a70886175129f0eca60/MA--Home-Insurance", "country": "US", "title": "Home insurance rates soar after brutal winter", "performance_score": 0, "site": "therepublic.com", "participants_count": 0, "title_full": "Home insurance rates soar after brutal winter", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T17:50:00.000+03:00", "replies_count": 0, "uuid": "b860369e48a7bbbf123436e0e471b37979903b92"}, "author": "", "url": "http://www.therepublic.com/view/story/3e5968cbd39f4a70886175129f0eca60/MA--Home-Insurance", "ord_in_thread": 0, "title": "Home insurance rates soar after brutal winter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home insurance premiums soar nearly 9 percent in response to brutal winter weather \nTHE ASSOCIATED PRESS Published: 7/13/15 10:46 am EDT - Updated: 7/13/15 10:50 am EDT \nBOSTON — Massachusetts homeowners are paying for last winter's record-setting snowfall with insurance premiums that are jumping by about 9 percent, much higher than in most years. \nThe increases could translate to an additional $100 on the average Massachusetts premium of $1,150, according to The Boston Globe ( http://bit.ly/1K0CGv9 ). \nThe Massachusetts Division of Insurance has approved an 8.9 percent increase on average for the state's largest insurer, Mapfre USA Corp., beginning Aug. 1. Last year, the company, which insures more than 214,000 homeowners in the state, increased rates by 2.3 percent. \nSafety Insurance Co., which covers nearly 150,000 homeowners in Massachusetts, plans to raise premiums by 9.1 percent starting in December. \nOther insurers are expected to follow suit. \n\"The unprecedented weather-related events and claims activity this winter have negatively impacted the insurance industry,\" Daniel McCabe, Mapfre's vice president for New England, wrote in a recent bulletin to independent insurance agents explaining the rate increase. \nRay Gallant, president of Gallant Insurance Agency Inc. in Acton, said he has warned customers that their premiums are likely to jump. \n\"It's very difficult on the consumer, very difficult on the agent and very difficult on the company,\" Gallant said. \"It is in response to the biblical losses that they (insurers) received.\" \nHis company logged as many as 75 calls a day from customers reporting damage like ice dams and leaky roofs during the worst of the winter. Gallant said he is still dealing with storm-related claims two seasons later. \nInsurance companies consider several years of weather trends, along with the rising costs of building materials and home repairs, in determining rates, said Chris Olie, chairman of Bunker Hill Insurance. \nThink your friends should see this? Share it with them! \nStory copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. \nFeedback, Corrections and Other Requests: AP welcomes feedback and comments from readers. Send an email to info@ap.org and it will be forwarded to the appropriate editor or reporter. We also have more stories about: (click the phrases to see a list) \nCategory:", "external_links": [], "published": "2015-07-13T17:50:00.000+03:00", "crawled": "2015-07-13T18:08:05.000+03:00", "highlightTitle": ""}