{"organizations": ["The American Society of Clinical Oncology", "HealthLeaders Media", "ASCO"], "uuid": "180061f5f5be3c0f9e4971414a4356182de19075", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.healthleadersmedia.com", "main_image": "", "site_section": "http://www.healthleadersmedia.com/rss/WS_HLM2_FIN_TS.xml", "section_title": "HealthLeadersMedia.com - Finance News & Analysis", "url": "http://www.healthleadersmedia.com/content_redirect.cfm?content_id=318355", "country": "US", "title": "ASCO Aims to Score New Cancer Treatments on Value", "performance_score": 0, "site": "healthleadersmedia.com", "participants_count": 0, "title_full": "ASCO Aims to Score New Cancer Treatments on Value", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T15:14:00.000+03:00", "replies_count": 0, "uuid": "180061f5f5be3c0f9e4971414a4356182de19075"}, "author": "", "url": "http://www.healthleadersmedia.com/content_redirect.cfm?content_id=318355", "ord_in_thread": 0, "title": "ASCO Aims to Score New Cancer Treatments on Value", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alexandra Wilson Pecci"], "text": "News Widget Alexandra Wilson Pecci, for HealthLeaders Media , July 9, 2015 The American Society of Clinical Oncology is working on a tool for assessing the value of new cancer treatment options based on clinical benefit, side effects, and cost. \nCancer treatment is expensive. For patients, sometimes cripplingly so. New cancer treatments can cost tens of thousands of dollars per month, out-of-pocket expenses are sky-high, and a recent survey shows that more than one third of patients are worried about bankruptcy . \nWhether high costs and novel treatments lead to a better value and what value really means in the context of cancer care, are yet to be determined. Lowell Schnipper, MD \nTo attempt to answer those questions, the American Society of Clinical Oncology (ASCO) has published an initial version of a conceptual framework for assessing the value of new cancer treatment options based on clinical benefit, side effects, and cost. \nASCO has opened up its framework for public comment through August 21. Eventually, the framework will become a tool for physicians and patients to use to help guide their cancer treatment decision making. \n\"Should doctors even think about cost in the context of what we want to do for our patients?\" asks Lowell Schnipper, MD , chair of the ASCO Value in Cancer Care Task Force and clinical director of the Cancer Center and Chief of Hematology and Oncology at Beth Israel Deaconess Medical Center in Boston. Over the years, it's become apparent that doctors should be considering cost, and more importantly, value. \nSchnipper points to ASCO's 2009 guidance statement about the cost of cancer care as the \"launching pad\" for this discussion. \n\"There's an abiding sense that we want the best cancer care to be available to all people on this country in the most affordable possible way,\" he says. \nSchnipper says ASCO embraced the general concept that \"value\" is the quality of the service delivered and the outcome in relation to its cost. With this in mind, data about the clinical benefits and toxicity of each treatment regimen are used to calculate a combined \"Net Health Benefit\" score (NHB) which represents the added benefit that patients can expect to receive from the new therapy, versus the current standard of care. \nAccording to Schnipper, it asks, to \"what degree did the new treatment extend survival as opposed to standard of care?\"", "external_links": [], "published": "2015-07-09T15:14:00.000+03:00", "crawled": "2015-07-09T15:39:00.000+03:00", "highlightTitle": ""}