{"organizations": [], "uuid": "e6255af8049b24f6303aa42771c6d7813d8b9530", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nz.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://nz.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Latest business and finance news from New Zealand and the world's key markets - Yahoo New Zealand Finance", "url": "https://nz.finance.yahoo.com/news/hockey-not-happy-states-taxing-140615000.html", "country": "US", "title": "Hockey not happy with states' taxing", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Hockey not happy with states' taxing", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T17:06:00.000+03:00", "replies_count": 0, "uuid": "e6255af8049b24f6303aa42771c6d7813d8b9530"}, "author": "", "url": "https://nz.finance.yahoo.com/news/hockey-not-happy-states-taxing-140615000.html", "ord_in_thread": 0, "title": "Hockey not happy with states' taxing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wed, Jul 15, 2015, 2:58 AM NZST - New Zealand Markets open in 7 hrs 2 mins Hockey not happy with states' taxing AAP – 51 minutes ago Print \nTreasurer Joe Hockey has hit out at some states for not keeping their side of the bargain by eliminating inefficient taxes when the GST was introduced 15 years ago. \nHe will tell an audience in Melbourne on Wednesday that he has received many submissions to his tax review calling for the abolition of state taxes, like stamp duties and insurance duties, while urging the broadening of the GST and its rate. \nBut he will again rule out making any changes to the GST without the unanimous agreement of state and territory governments and bipartisan support in the federal parliament. \n\"Before we go further down the track of reform of federal financial relations, there are still a number of states that have failed to abolish some taxes that were agreed to be abolished following the introduction of the GST,\" he will tell the PwC Tax Reform Forum. \nHe says there is a real opportunity for constructive talks about reforming the federation when premiers and chief ministers meet with the prime minister next week. \nHe believes the revenue raising capacity of each tier of government should be aligned to responsibilities of funding and service delivery. \n\"Our current federal system clearly fails this objective,\" the treasurer will say. \n\"Not only do the states and territories raise considerably less revenue than they spend, around a third of their tax is from inefficient taxes.\" \nHe said the states must take responsibility for their own budgets in order to ensure they can afford their ever-increasing expenditure, such as the cost of public hospitals as the population ages. @YahooNZBusiness on Twitter, become a fan on Facebook NSW mine is 'a threat to all farming' AAP \nA giant coal mine approved for construction beside premium farmlands shows no farm in Australia is safe, says the …", "external_links": [], "published": "2015-07-14T17:06:00.000+03:00", "crawled": "2015-07-14T18:03:35.000+03:00", "highlightTitle": ""}