{"organizations": ["Board of Directors Close New York", "FleetBoston Financial", "Operating Committee", "Freddie Mac", "Bank of America", "Merrill Lynch Banks", "Board of Citibank", "Citi Holdings", "Citi Board", "Citi", "Board of Directors", "J.P. Morgan Chase", "Citigroup", "Board of XL Group", "Citibank", "KPMG Peat Marwick", "Manufacturers Hanover Corp."], "uuid": "15a8863a516ccae849866c0d41bec2c0cca8c4b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=C", "section_title": "Yahoo! Finance: C News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=1255gfdoc/*http://www.noodls.com/view/E77E8E44DC448B2C1D13AE4BB6DB2B36464CC232", "country": "US", "title": "Citi Board Elects Eugene M. McQuade to Board of Directors", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Citi Board Elects Eugene M. McQuade to Board of Directors", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T21:43:00.000+03:00", "replies_count": 0, "uuid": "15a8863a516ccae849866c0d41bec2c0cca8c4b7"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=1255gfdoc/*http://www.noodls.com/view/E77E8E44DC448B2C1D13AE4BB6DB2B36464CC232", "ord_in_thread": 0, "title": "Citi Board Elects Eugene M. McQuade to Board of Directors", "locations": ["New York", "U.S.", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gene McQuade", "Gene", "Merrill", "Michael E. O'Neill", "McQuade", "Michael Corbat", "Eugene M. McQuade"], "text": "Close New York - Citi's Board of Directors today announced that it has elected Eugene M. McQuade as a new non-executive director, effectively immediately. Mr. McQuade is the former CEO of Citibank, N.A. and former Vice Chairman of Citigroup and is currently the Chairman of the Board of XL Group. \"We are pleased to have Gene McQuade join us on the Citigroup board,\" said Citi Chairman Michael E. O'Neill. \"Not only does Gene bring a wealth of expertise from his deep experience in banking, but he also offers continuity of knowledge in the capital planning process which has become so central to our business planning.\"\"When we called upon Gene to delay his retirement to help guide our capital planning process this past year, he took on that role with characteristic poise and professionalism,\" said Citi CEO Michael Corbat. \"We look forward to continuing to have his wise counsel in this capacity.\" Mr. McQuade was elected Vice Chairman of Citigroup in April 2014 with responsibility for overseeing stress testing and capital planning until his retirement in May 2015. From 2009 to 2014 he was Chief Executive Officer of Citibank, N.A. with responsibility for corporate governance and franchise management in 101 countries around the globe. He also had operating responsibility for Citi Holdings and Citi's business in Japan. Mr. McQuade previously had responsibility for Citigroup's Audit and Compliance functions. He was a member of Citigroup's Operating Committee and serves on the Board of Citibank, N.A. Previously, Mr. McQuade served as Vice Chairman and President of Merrill Lynch Banks (U.S.). Prior to joining Merrill, he served for three years (2004-2007) as President and Chief Operating Officer and a Director of Freddie Mac. Previously, he had been President of Bank of America, helping to bring about the 2004 merger between that company and FleetBoston Financial, where he also served as President and Chief Operating Officer. Before working at Fleet, Mr. McQuade served as Executive Vice President and Controller at Manufacturers Hanover Corp., a predecessor of J.P. Morgan Chase. He began his career at KPMG Peat Marwick in New York. \nMr. McQuade is a Certified Public Accountant, earning a degree in accounting from St. Bonaventure University, of which he was a Trustee and was awarded an honorary Doctorate in 2013. He is a Trustee to The Boys & Girls Club of America and the American Ireland Fund as well as a Director of Catholic Charities in New York. Mr. McQuade has served on the Boards of Directors of Merrill Lynch Banks, Bank of America and FleetBoston.", "external_links": [], "published": "2015-07-14T21:43:00.000+03:00", "crawled": "2015-07-15T11:08:18.000+03:00", "highlightTitle": ""}