{"organizations": [], "uuid": "97709ed78972ba1bdbf3958a9a2baaf2629dda53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/greek-mps-pass-controversial-austerity-012747682.html", "country": "US", "title": "Greek MPs pass controversial austerity bill to secure Eurozone bail-out", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Greek MPs pass controversial austerity bill to secure Eurozone bail-out", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T04:27:00.000+03:00", "replies_count": 0, "uuid": "97709ed78972ba1bdbf3958a9a2baaf2629dda53"}, "author": "", "url": "https://uk.finance.yahoo.com/news/greek-mps-pass-controversial-austerity-012747682.html", "ord_in_thread": 0, "title": "Greek MPs pass controversial austerity bill to secure Eurozone bail-out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alexis Tsipras"], "text": "Syriza MPs rebel, but Alexis Tsipras secures parliamentary vote that will stave off the threat of bankruptcy for now \nGreek crisis: live updates \nGreek MPs have voted in favour of new austerity measures that will secure a third Brussels bail-out to stave off the threat of bankruptcy. \nAfter a tense debate that lasted into the small hours of Thursday morning, the 300 member parliament voted by a majority of 229 to 64 against on a raft of tax hikes and pension reforms. \nThere were six abstentions and one MP was missing from the debate. \nGreek MPs during the tense debate \nThe move was part of the conditions laid down by Brussels for a third-bail out of around 85 billion euros, and will stop it being thrown out of the Eurozone. \nThe country's prime minister, Alexis Tsipras said he would probably step down from office if he did not gather the support of more than 121 of his Syriza MPs. \nThursday morning's vote has left him with the support of 124, a margin that may still leave his fate hanging in the balance and could provoke a vote of confidence in his leadership. \nAmong those voted against the package of reforms was Mr Tsipras's former minister, Yanis Varoufakis, who likened the measures to a \"Treaty of Versailles\" for Greece. \nA protester holds a molotov cocktail in front of the Greek Parliament in Athens \nPrior to the votes being cast, Mr Tsipras made a final appeal to parliament for support for the measures, telling fellow MPs that there was no alternative. \n\"We don't believe in it, but we are forced to adopt it,\" he said. \nResponding to criticisms that he had accepted a package of measures that were tougher than those originally rejected by the referendum a fortnight ago, he said that to have refused them would have led to default and exit from the Eurozone, which he had a \"responsibility\" to avoid. \n\"I didn't want Greek society to be in a worse position than in five years ago,\" he said. \nHe added: \"\"We are called to take decisions based on our responsibility, which lie heavily on us. We gave a struggle and I take full responsibility and I am proud that I have fought a difficult battle for the right of the people.\"", "external_links": [], "published": "2015-07-16T04:27:00.000+03:00", "crawled": "2015-07-16T06:10:55.000+03:00", "highlightTitle": ""}