{"organizations": [], "uuid": "6f698b21bc8f041f2ce91eb64305f1dc255b112a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/stock-market-preview-for-the-week-of-july-20-2015?cid=rss", "country": "US", "title": "Stock market preview for the week of July 20, 2015", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Stock market preview for the week of July 20, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T14:24:00.000+03:00", "replies_count": 0, "uuid": "6f698b21bc8f041f2ce91eb64305f1dc255b112a"}, "author": "Ronald Zimba, Traverse City Investing Examiner", "url": "http://www.examiner.com/article/stock-market-preview-for-the-week-of-july-20-2015?cid=rss", "ord_in_thread": 0, "title": "Stock market preview for the week of July 20, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stock market preview for the week of July 20, 2015 Use your key for the next article Comment \nThe S&P 500 opened higher in every session during the past week with Monday’s and Thursday’s opens seeing the largest gaps higher. The index flirted with a loss for much of the session Friday, before rebounding near the close to finish a little higher. Friday’s rebound provided the fourth session gain for the week and aided in a 2.41% rise in the index price for the week. The gain broke a three week string of losses. The index has moved higher in six of the past seven sessions. \nInvestors breathed a sigh of relief as it appears the Greek crisis was put off yet again. The terms of the new bailout appear to have left no way for employment to rise to the levels that Greece needs to become solvent. They cannot pay off their current loans without borrowing money and they cannot run their government without borrowing money . Even with a massive restructuring of the current debt, the problem isn’t going away. \nThe past austerity measures more than tripled Greece’s unemployment rate as it now hovers near 25%. The high unemployment rates further reduced an already crippled tax base and as a result, the haircut private investors took in 2012 was nearly added back at the time the latest crisis began. Greece’s debt recently surpassed the €356 billion they owed prior to the private debt restructuring. Greece saw this increase in unemployment during the heart of the rebound in employment in nearly all other non-austerity riddled economies. During this employment rebound the countries with the highest unemployment rates in Europe were the countries with forced austerity measures. All are seeing their debt clocks tick higher. \nWith past austerity measures still in place and additional measures added that eliminate recently reinstated job positions, the conditions of the bailout loans look likely to further weaken Greece’s economy. It seems likely Greece could see further increases in unemployment past these forced job cuts and with this increased unemployment, add additional pressure on its tax base. It therefore seems likely the benefits of any debt restructuring could follow the same path as the earlier restructuring did. At this point debt restructuring looks ineffective, and once this debt is rebuilt, restructuring now could make it more difficult to obtain meaningful restructuring later, unless there is a total default. \nGermany continues to ridicule Greece as fat and lazy to any that will listen, even though the loan conditions they have insisted on had detrimental effects on their economy in the past and will continue to be a burden in the future. Greece’s average work week is the third longest in the world, following only Mexico and Korea. Germany’s average work week is the shortest in the world. It looks more like Greece has a problem with a lack of jobs than laziness. \nEurope’s leaders are acting much like an idiot that lends his neighbor a huge sum of money and then gets him fired from his job so he cannot repay the loan. After the neighbor manages to find a new job at half the pay and has increased the hours he is working, they then demand that he stops buying food for his family to make the next payment coming due. Austerity is little different. \nThe Euro Zone leaders were right about one thing. The €59 billion loan that Greece asked for wasn’t enough, but neither is the €86 billion they instead offered to pay. It looks likely the problem is far from over. It will last as long as the Eurozone can continue to bully and intimidate spineless Greek leaders. \nPrime Minister Alexi Tsipras’s made nearly an overnight turnaround after his people rallied around him to resoundingly defeat an agreement he called “humiliating to the Greek people” to accept basically the same proposal less than a week later. After a few of his party members showed some backbone and defied supporting the very proposal Tsipras had urged his countryman to defeat just days before, he fired them. \nDespite the current perceptions, the problem was not fixed in Italy, Spain, Portugal or Ireland either. It was only made worse in all of these countries too. All of them have debts that continue to build. Eventually all of these countries will be in dire straits again; all it will take is a normal economic downturn. Europe is running out of time to fix their problems. \nAusterity is not the answer, higher tax rates on the wealthy and businesses are. It is how the US repaid its enormous debts from World War II while becoming the world’s leading economy. Since cutting these rates the US has seen a profound increase in debt and a profound decrease in the dominance of its world leading economy. Despite the rhetoric to the contrary, lowering tax rates on the wealthy and businesses does not create prosperity, except of course for the wealthy and businesses. It has proven to be detrimental to overall economies time and time again. \nThe US markets were further calmed as China ’s markets appeared to show some stability. The Shanghai Composite continued with a third straight day of volatile gains rising 2.39% on Monday before retreating near the upper trend line and shedding over 4% in the following two sessions. The retreat included a volatile loss of 3.03% on Wednesday. The index regained most of those losses in the week’s final two sessions. The rebound included a third volatile weekly session during a 3.51% gain on Friday. \nThe index shows a possible base is developing, but has continued to see volatile daily moves, which is generally bearish indication. It is also seeing this base at a price that is arguably four times above even value based on the index P/E. A recent story by Reuters makes corporate debt look like just another of growing list of reasons to avoid Chinese market exposure. Little in China’s markets appears to be appealing at current valuations anyway and risk still seems too high. \nThe seven day rally in the US saw several large opening gaps higher, but provided little continuation during normal trading sessions. Despite four very large gaps higher during the rebound, only the NASDAQ reached new highs during the past week. The NASDAQ has opened higher in each of the past seven sessions during its run to new highs. The opening gaps higher totaled 248.80 points during these seven sessions, while the NASDAQ finished the same period 287.74 points higher. As a result the opening gaps accounted for 86.47% of the total move higher on the NASDAQ during this run. \nThe Russell 2000 gapped higher in six of these seven sessions. The total of these gaps, which included a small open lower, was 36.66 points. The Russell finished the same period only 32.94 points higher, or 10.14% lower than the total of the opening gaps. \nThe data for the New York Stock Exchange seems incomplete, as the index supposedly did not see an opening price change on either July 10 or July 13. It had not seen an open without a price change since Feb 18 and only seven during the past year, making the absence of a price change in two consecutive opens seem out of place. Since all of the other indexes saw two of their largest opening gaps on these days, it seems possible the recent computer glitches the exchange experienced on July 8 were not fully corrected and as a result the true opening price was not recorded. The charts also indicate the index had moved very near the session highs within the first minute of trading during each of these sessions. Without these two likely gaps higher, the index finished about 47% above the total of the gaps seen during the seven days. Adjusting the two likely missing opening prices to the gap percentage seen on the NASDAQ on these two days, which finished the period above its gaps, shows the NYSE likely would have finished the period about 6% below the total of the gaps and two likely gaps higher. This was partly due to a lower close Friday. The price movement in the charts after the first minute of trading in these two sessions appear to support a larger drop in price from these opening gaps probably occurred. \nThe S&P 500 and Dow Jones Industrial Average saw similar opening gaps, but most of these gaps are hidden due to the Dow Jones S&P Indices manipulation of opening price that is designed specifically to limit opening price gaps on their indexes. The opening price gaps were still present, only the “official” opening price does not reflect the real gap that occurred. Although the first minute high is likely very close to the actual opening price, it is not exact so a comparison in these indexes was not made. The charts indicate these indexes saw little movement higher shortly after the open. It seems likely that the retreats shortly after opens in the Dow along with the retreat on Friday took it well below the likely gap levels. The charts also show retreats from likely opening gap positions on the S&P 500 might have outweighed any additional moves higher it had seen. \nThe push higher took all of the US major indexes into fully overbought conditions. The lack of continuation after gaps higher could be a point of concern. It seems possible investors were taking profits into these gaps higher and not adding positions. It seems possible the push into overbought levels could increase this profit taking. \nThe S&P 500 saw one constituent change during the past week. Constituent eBay (EBAY) completed its spinoff of PayPal Holdings Inc. (PYPLV) and after the close on Friday PayPal replaced Noble Corporation plc (NE) in the S&P 500. Noble was moved to the S&P 400 and eBay remained in the S&P 500. \nTwo constituents had stock splits during the week. Netflix (NFLX) stock split seven for one and Kroger (KR) stock split two for one. The splits and constituent changes were reflected in the S&P 500 data below, however the S&P 400 saw several constituent changes during the past week and these changes were not yet reflected in data presented for this index. \nThe rebound in stock prices saw the number of S&P 500 constituents that remained below their 200 DMA at Friday’s close fall to 231 from the 251 a week earlier. The index saw 257 constituents finish Friday either below their 200 DMA or less than one dollar above it, also down from 278 in the previous week. \nThe continued rebound in stock prices saw the S&P 400 finish the week with 189 constituents below their 200 DMA on Friday, the same number as it finished with prior week. The index finished Friday with 223 of the 400 constituents either below or less than one dollar above the 200 DMA and only three less than the previous week. \nThe S&P 500 constituents saw a current year earnings decrease of $0.90 during the past week. The decrease is after adjustments made for constituent splits and discounts $2.16 in earnings for Nobel in the previous week. Earnings for recently spun off PayPal were not available at the time of publication. \nThe current quarter earnings expectations for those yet to report saw a decrease of $0.89 from the previous week’s estimates. Although larger than the previous weeks decline, the decrease seen in the current quarter projections continues to be smaller than those seen in the previous two quarters. \nThe constituents saw their trailing twelve month earnings increase by 1.58 during the past week, representing a 0.08% increase over the constituent’s total year ago earnings of the previous week. The trailing twelve month earnings increased an average of 0.80% in the 37 that reported earnings. There were 22 of the constituents that reported earnings above those they reported the same quarter a year ago, ten reported earnings below the year ago quarter and five reported earnings even with their year ago earnings. The previous week’s total was adjusted for recent splits and Nobel’s earnings were excluded from the week ago total. \nIndicators \nThe featured and supporting indicators discussed below are not always correct, but they have been many times. Being so they are worth reading about and taking note of. \nThe 100 L, (-)/(+) 90 D, +2% H, -2% H and 90 E indicators are currently active. See a more detailed description of most of the indicators developed through research and featured in these articles here . \nThe S&P 500 rebounded during the past week, but the rebound fell short of the May 21 highest close of 2130.82. This leaves the current significant drop from the upper half of the 100 L open. \nMonday started the week with a gap higher to open at the session low of 2080.03 and continued to a high of 2100.67 before finishing at 2099.60. Tuesday opened higher at 2099.72, fell to a low of 2098.18 and reached a high of 2111.98 before finishing at 2108.95. Wednesday opened higher at 2109.01, fell to a low of 2102.49 and moved to a high of 2114.14 before slipping to the week’s only loss at 2107.40. Thursday opened with a gap higher at the session low of 2010.55 and reached a high of 2124.42 before finishing slightly lower at 2124.29. Friday opened with a gap higher to 2126.80 and moved to the high of 2128.91 before slipping to a low of 2119.88 and then finished lower than it started at 2126.64. \nThe index opened each session higher in the past week, but left open gaps in Monday’s and Thursday’s sessions. The index left open gaps higher in Thursday’s and Friday’s sessions of the past week. All of these gaps are likely larger than the official open would indicate. There were also a large number of constituents that saw opening gaps higher during the past seven sessions. These open gaps are likely to be filled at some point. \nThe S&P 500 is in fully overbought conditions and has been since Tuesday’s session. The index has seen several large gaps higher but limited price movement higher after the first minute of trading in these sessions. \nA few constituent’s had stellar earnings reports and a couple had very poor reports in the past week. Overall earnings increases seen in those that reported were far lower than the overall increases expected for the quarter. It is still early, but it is beginning to seem possible the earnings growth projections for the quarter could be too high. Although not at the rates seen in the previous two quarters, earnings projections continue to be pared as earnings reports near. This could keep beat rates high, but it seems possible earnings could be lackluster for a third straight quarter. \nMany of the stocks that have carried the index higher are showing indications of stress in their charts. If earnings don’t meet investor’s high expectations, it seems possible these stocks could falter. \nThe (-)/(+) 90 D that became active on May 22, 2015 appears to have bearish potential. It has performed as follows to this point in the standard format: highest close / lowest close / last close. \n+0.91% / -2.88% / +0.91% \nThe -2% H and +2% H indicators failed to provide a correct indication in the past week. Supporting volatility indicators moderated in the past week, but remained at higher than normal levels. Provided there are no volatile moves in the coming week, the -2% H and +2% H indicators will fall to a low (L) level of likelihood with the expiration of the 90E. \nThe 90 E indicator will expire after Friday’s close in the coming week. To this point the index has seen one volatile daily move and fell to a significant level during its presence. \nThe average daily volume decreased 11.71% below the previous week. The highest volume was seen during Friday’s session and lowest on Tuesday. The five day volume variance dropped 33.45% to finish the week at 12.01%. The five day volume variance fell to bullish levels. \nCurrent Cautions \nThe percentage of increases in early season earnings reports were well below the projected increases for the quarter. It is still earlier, but the lackluster start could be an indication of lackluster earnings overall. There are many things that could hurt earnings, and many that missed growth projections in the past week saw these factors come into play. Beating projections does not mean a good earnings report, but it seems possible drops in projections just prior to earnings being reported could again increase the beat ratio. \nWithout a resolution that solves the problem, it appears investors have already forgotten about Greek debt . Unfortunately without a resolution that solves the problem, it seems likely the problem could resurface later, probably at elevated debt levels and probably during a time that it could be a much bigger problem to deal with. Europe is writing the book on what not to do during a debt crisis, and they are too foolish to see their mistakes even though they have kicked them in the pants twice more after screwing up the first time. One of the symptoms of insanity is continually repeating a failed method and expecting a different outcome. \nThere appeared to be little continuation after opening gaps in the index charts. Data and chart analysis appear to show the recent price moves were largely or fully contained in opening gaps higher. \nChart patterns in world indices looked a little less intimidating after a week with many rebounding. Even so, they are not out of the woods yet. \nChina’s Shanghai Composite Index continued to see volatile price moves, but also seemed to be establishing a base. Others markets that had intervention to stop slides near market highs appeared to stabilize in the past too. All eventually broke lower though. \nCurrent chart formations along with past timelines and worldwide stock overvaluations continue to make it seem possible the S&P 500 could see a large retreat before the end of the year. \nThe next likely resistance level above the 100 L at 2100 could be seen at the 2140 to 2160 MRL. Earlier highs on the S&P 500 could have seen the effects of this resistance level, but the index is still within the influence range of the 100 L since it has not yet reached this resistance level. Therefore this resistance is not yet considered active. This resistance appears to have the potential to cause a significant pullback. \nPlease note there is no established resistance in the MRL levels before the index has reached these levels. Several instances have proven to hold resistance once reached; however MRL levels that the index has not yet reached are only the most likely levels that resistance will be seen based on research. Back tests of the data used to project these resistance levels work well, but they are not always exact, and these resistances could react sooner or later than expected, it is also possible the resistance will not be seen at all. \nData provided for the S&P 500 was derived from the historical daily data tables, similar data can be found at AOL Finance . Earnings information was gathered from Yahoo Finance , CNBC , Edgar Filings , Scottrade Elite, AOL Finance and Morningstar , although other websites, including company websites, may have contributed small amounts of information. Stock and Treasury charts used for analysis and commentary were provided by StockCharts.com , Scottrade Elite or from those that Ron created from his data. Gold charts used for analysis and commentary were provided by Kitco . \nHave a great day trading. \nDisclosure: Ron has no investments in EBAY, PYPLV, NE, NFLX or KR. Ron is currently about 56% invested long in stocks in his trading accounts reflecting no change over the past week’s investment level. Although his rounded investment level was unchanged, he bought one issue with the cost of this purchase more than fully offset by the sale of four issues and dividend payments. He will receive dividend payments from seven issues in the coming week and seven in the following week. If no further investment changes are made during this time frame, these dividend payments would not change his investment level. \nIt seems possible the US indexes could muddle along until earnings either rebound or being to slip. It seems possible meaningful earnings increases, at least the type that make current stock prices seem within reason, could be a considerable time away. It is difficult to buy with any conviction with current stock valuations. Maybe it is time to look at other investment opportunities. \nDisclaimer: The information provided in the Stock Market Preview is Ron’s perception of the current conditions and what he thinks is the most probable outcome based on the current conditions, the data collected and extensive research he has done into this data along with other variables. It is intended to provoke thought of the possible market direction in his readers, not foretell the future. Ron does not claim to know what the stock market will do. If the stock market performs as expected, it only means he is applying the stock market history to the current conditions correctly. His perception of the data is not always correct. \nThis article is intended to provoke thought about investment possibilities. Acting on the information provided is at your own risk. You are urged to do your own research, and where appropriate, seek professional investment advice before acting on any information contained in these articles.", "external_links": [], "published": "2015-07-19T14:24:00.000+03:00", "crawled": "2015-07-19T14:54:06.311+03:00", "highlightTitle": ""}