{"organizations": [], "uuid": "5cb787207d5dbc506b208b3afae11a41e9b45668", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static1.businessinsider.com/image/5593fba3ecad04ee51d8d3ce/russias-big-gas-plan-hit-a-setback.jpg", "site_section": "http://feedproxy.google.com/clusterstock?format=xml", "section_title": "Finance", "url": "http://www.businessinsider.com/r-macys-cuts-ties-with-donald-trump-after-mexico-insults-2015-7", "country": "IL", "title": "Russia's big gas plan hit a setback", "performance_score": 1, "site": "businessinsider.com", "participants_count": 1, "title_full": "Russia's big gas plan hit a setback", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T17:40:00.000+03:00", "replies_count": 0, "uuid": "6b5f315022c92ae01780d2b38a80a6a0ecc0db5f"}, "author": "Elena Holodny", "url": "http://www.businessinsider.com/russia-and-turkey-dispute-over-gas-prices-turkish-stream-2015-6", "ord_in_thread": 0, "title": "Russia's big gas plan hit a setback", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greece is now officially a part of Russia's big new gas plan \nRussia's big plan to build the Turkish Stream might have hit a snag as Russia and Turkey can't agree on gas prices. \nRussia's Gazprom and Turkey's BOTAŞ had a six-month period to agree on the prices for gas supplies. That time frame expired on Monday without a deal. \n\" The dispute over prices means there’s no immediate prospect of signing a binding pact for the new pipeline ... An agreement could now be delayed until at least October ,\" people familiar with the situation told Bloomberg . \nBack in May, Russia gave permission to commence the construction of the pipeline, although it had \"not yet signed intergovernmental agreements with Turkey and Greece, and [was] acting on the basis of old documents relation to the South Stream project,\" according to RBTH . \nOne anonymous source told Bloomberg that the deal was delayed in part because the ruling party in Turkey lost its parliamentary majority in last month's election. Prior to it, Gazprom and Turkey's officials reportedly \"said they had agreed on pricing.\" \nGazprom Layout of Turkish Stream gas pipeline route, via Gazprom press release \nRelatedly, an anonymous Russian source \"familiar with the situation\" told Kommersant in late May that the delay was tied to the Turkish elections. \nHowever, also back in May, a Turkish source \"familiar with the situation\" told Kommersant that it was about the prices, not politics. \nThe director of Turkey's EPPEN Institute for Energy Markets and Policies, Volkan Özdemir, expressed a similar sentiment. \n\"We figure that with the 'Turkish Stream' Turkey will become a strategic partner, but so far Gazprom is not acting like such a partner,\" the anonymous Turkish source told Kommersant. \nReuters Map of Europe showing planned gas pipelines in the region. Includes proposed Gazprom pipeline to Europe through Turkey. \nThis delay will no doubt irritate Russia, especially given the pipeline's geopolitical importance. \nThe so-called Turkish stream was announced in January after Gazprom abandoned the $45 billion South Stream project in December. The key takeaway regarding both projects is that they're supposed to bypass Ukraine , which would allow Russia to maintain its gas leverage over the EU and to hurt Kiev. \nGazprom is \"is in a hurry to bring gas to Turkey and Southeastern Europe before the EU can implement its counter-strategy for the supply of Turkmen and Iranian gas,\" according to RBTH . \n“To help Gazprom reach Central European markets, Russia has advocated the construction of a pipeline that would run from Greece to Macedonia, Serbia and Hungary,” analysts from Texas-based consulting firm Stratfor wrote in a report, according to Bloomberg . “These four countries are at the center of a Russian diplomatic offensive.\" Reuters/Alexander Zemlianichenko/Pool Russian President Vladimir Putin (R) shakes hands with Greek Prime Minister Alexis Tsipras during a signing ceremony at the Kremlin in Moscow, April 8, 2015. Tsipras did not ask for financial aid at talks in Moscow on Wednesday but Russia could provide credits for large joint projects in the future, Putin said. \nMeanwhile , two weeks ago Russia signed a preliminary $2.27 billion (2 billion euro) agreement on building a section of the Turkish Stream through Greece. \nConstruction for this chunk will start in 2016 and is expected to be completed by 2019, according to Russian Energy Minister Alexander Novak. \n“The pipeline is not against anyone in Europe or the world,” Greek Energy Minister Panagiotis Lafazanis said in St. Petersburg. “It is here to serve people, peace and stability. Energy can bring people together and not feed Cold War situations.”", "external_links": [], "published": "2015-07-01T17:40:00.000+03:00", "crawled": "2015-07-01T18:01:55.000+03:00", "highlightTitle": ""}