{"organizations": [], "uuid": "30ff967e769e71d7a613d14cda84dcdcbd534083", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static4.businessinsider.com/image/5594d503dd08950b498b4573/a-greek-politician-told-us-grexit-will-100-happen-if-no-wins-on-sunday--and-plans-are-already-being-made.jpg", "site_section": "http://feedproxy.google.com/clusterstock", "section_title": "Finance", "url": "http://www.businessinsider.com/greek-politician-grexit-will-100-happen-if-no-wins-on-sunday-2015-7", "country": "IL", "title": "A Greek politician told us Grexit will '100%' happen if 'No' wins on Sunday — and plans are already being made", "performance_score": 0, "site": "businessinsider.com", "participants_count": 1, "title_full": "A Greek politician told us Grexit will '100%' happen if 'No' wins on Sunday — and plans are already being made", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T09:06:00.000+03:00", "replies_count": 0, "uuid": "30ff967e769e71d7a613d14cda84dcdcbd534083"}, "author": "Mike Bird", "url": "http://www.businessinsider.com/greek-politician-grexit-will-100-happen-if-no-wins-on-sunday-2015-7", "ord_in_thread": 0, "title": "A Greek politician told us Grexit will '100%' happen if 'No' wins on Sunday — and plans are already being made", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "REUTERS/Alexandros Avramidis Anti-austerity protesters march in front of a destroyed EU flag during a demonstration in Thessaloniki, Greece July 1, 2015 \nATHENS, Greece — Contradictory polls are showing that any result is possible in Greece's upcoming referendum. \nThe \"No\" campaign against the bailout seemed to be in the lead on Tuesday morning, while another later in the day showed \"Yes\" narrowly ahead . \nA Yes vote would mean agreeing to a bailout deal set down by Greece's European creditors, which the government is against — though since Greece's existing programme expired on June 30, it's not even clear that's on the table any more. \nA No vote would reject the proposals, which aim for more austerity and reforms — which could even mean Greece leaving the eurozone. \nI spoke to Greek politician Harry Theoharis about what's going on. Until 2014 he was in charge of tax collection in Greece , and trying to reform the country's revenue-raising system. Now, he's a politician, and has represented the centrist To Potami party since the January 2015 election. \nHe gave a brief overview of To Potami's position in the Greek political spectrum: This is a centrist, pro-reform party. We believe Greece needs a lot of reforms in the way the economy operated and to re-balance the long-term imbalances of the pension system for example. There's lots of things we need to do, to be able to compete in today's global economy, and to bring prosperity to our people at the same time. We also believe in social justice, and the European model of social cohesion. We're liberal in the social sphere, on immigration, the rights of lesbian and gay people. \nThis was a catastrophic scenario that the government chose to pursue,\" he said, confirming that Potami would be happy to vote for any bailout deal put on the table. \n\"This referendum is not, as the government says, about austerity or no austerity. They're trying to frame it to the Greek people as a question about austerity and this is wrong in so many ways.\" \n\"Really it's a question about the euro, whether people want to live in a European economy or not.\" \nHe added that he \"believes firmly\" that Yes will win, outlining what he thinks will be a catastrophic result of the country if it rejects the deal: \" Even those perhaps who are lured by promises of not paying debt, they don't realise what it means for them, for their children, for their next of kin.\" \nMike Bird, Business Insider Harry Theoharis, former Greek tax chief turned To Potami politician, wearing a \"Yes\" referendum badge at the party's offices. \nPerhaps the most interesting part of the discussion was Theoharis' assertion that there's already a government team working on bringing back the drachma, Greece's currency before the Europe. \nHe said he'd had effective confirmation from one of the further-left ministers in the government: \" The minister of productive reconstruction ( Panagiotis Lafazanis) said so in Russia, to a Russian news agency — that we have a plan B, that we're preparing for it.\" \nHe added that he had his own sources too: \"I have information that there is a team preparing for it.\" \nHe was unequivocal when I asked him what the likelihood of leaving the eurozone with a \"no\" vote: \"100%.\" \nIf a \"Yes\" vote did happen, Theoharis also foresaw something interesting — he said \"it's possible\" when pressed on whether the pro-euro parties in parliament could organise in a subsequent election as a single party — noting that he wasn't convinced of the merits himself, but that it was something clearly under discussion. \nSince New Democracy (the former governing centre-right party) lost the last election and seems extremely unlikely to triumph in one that's conducted soon, that might be the only chance Greece's anti-Syriza forces have of unseating Alexis Tsipras.", "external_links": [], "published": "2015-07-02T09:06:00.000+03:00", "crawled": "2015-07-02T09:15:32.000+03:00", "highlightTitle": ""}