{"organizations": [], "uuid": "be2cc8fdb33f330bc41003e0e514e2b56c3d5caa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://g.foolcdn.com/editorial/images/173193/credit-card-add-on-penalties.PNG", "site_section": "http://finance.yahoo.com/rss/headline?s=C", "section_title": "Yahoo! Finance: C News", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=130et94si/*http://www.fool.com/investing/general/2015/07/24/why-the-cfpb-fined-citigroup-770-million.aspx?source=eogyholnk0000001", "country": "US", "title": "Why the CFPB Fined Citigroup $770 Million", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why the CFPB Fined Citigroup $770 Million", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T19:10:00.000+03:00", "replies_count": 0, "uuid": "be2cc8fdb33f330bc41003e0e514e2b56c3d5caa"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=130et94si/*http://www.fool.com/investing/general/2015/07/24/why-the-cfpb-fined-citigroup-770-million.aspx?source=eogyholnk0000001", "ord_in_thread": 0, "title": "Why the CFPB Fined Citigroup $770 Million", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Maxfield"], "text": "Why the CFPB Fined Citigroup $770 Million The upstart financial regulator evidently looks down on selling deceptive and unfair credit card add-on products. John Maxfield JohnMaxfield37 Jul 24, 2015 at 12:10PM \nCitigroup ( NYSE:C ) was hit with a $770 million fine this week after the Consumer Financial Protection Bureau, together with the Office of the Comptroller of the Currency, sanctioned the nation's third biggest bank by assets for unfairly and deceptively enrolling customers in credit card add-on products. \n\"In our four years, this is the tenth action we've taken against companies in this space for deceiving consumers,\" said CFPB Director Richard Cordray. \"We will remain on the lookout for similar conduct and will address it as we find it.\" \nIn the wake of the financial crisis, Citigroup and other banks scrambled to find new streams of revenue to offset mounting loan losses and litigation costs. One such stream consisted of credit card add-on products that promised to cover one's credit card payments in the event of a disability, job loss, or other predefined life event; or to monitor a cardholder's credit score. \nBut the problem with these products, according to the CFPB, was that they were marketed in a deceptive way or were otherwise illegally charged to consumers without consent. \nWith respect to Citigroup in particular, the CFPB said that it, or, more specifically, its primary banking subsidiary, Citibank: Instructed its telemarketers to misrepresent the cost and fees of debt protection products. Misrepresented the benefits of credit-monitoring products. Used illegal practices to enroll customers in these products. Misrepresented or omitted information about a person's eligibility for coverage. \nThe net result is that Citibank was ordered to provide $700 million in relief to eligible consumers as well as twin $35 million civil penalties payable to the CFPB and the OCC. \nIf you've read enough of these types of analyses, it's tempting at this point to say that $770 million in penalties isn't anything for Citigroup to be worried about. Proponents of this view would point to the fact that it earned $4.8 billion in the second quarter of this year alone. \nBut this is absurd. A nearly $800 million fine is a lot for any bank. In the second quarter of last year, it would have increased Citigroup's profit by a factor of four. In the current quarter, it would have amounted to a 16% increase in earnings and resulted in a 1.22% return on assets. \nThe latter figure is particularly important, as a 1% return on assets over the course of a year is generally believed to dictate whether or not, and the extent to which, a bank's shares trade for a premium to book value. By contrast, thanks to damage inflicted during the crisis, Citigroup's shares continue to be priced at a 12% discount to book value. \nOf equal importance is what this type of behavior says about the state of the bank industry in the post-crisis world. To this end, it's important to keep in mind that Citigroup was far from alone when it came to steamrolling customers into credit card add-on products. American Express , Bank of America , Capital One Financial , and JPMorgan Chase , among others, have all settled similar allegations brought by the CFPB. \nWith heightened regulations pushing up expenses and weighing on revenues -- not to mention the oppressive impact of historically low interest rates -- banks have been forced to look elsewhere to make up the difference. The extent to which they've done so by preying on unsophisticated and unsuspecting credit card users merely reflects the severity of the issue facing the nation's leading bankers. \nThis isn't to say that banks won't eventually return to the salad days that preceded the financial crisis, but it is to say that they could take a perilous route to get there in terms of both their willingness to compromise on ethics and the concomitant cost of doing so. \nThis $19 trillion industry could destroy the Internet One bleeding-edge technology is about to put the World Wide Web to bed. And if you act quickly, you could be among the savvy investors who enjoy the profits from this stunning change. Experts are calling it the single largest business opportunity in the history of capitalism... The Economist is calling it \"transformative\"... But you'll probably just call it \"how I made my millions.\" Don't be too late to the party -- click here for one stock to own when the Web goes dark. \nJohn Maxfield has no position in any stocks mentioned. The Motley Fool recommends American Express and Bank of America. Try any of our Foolish newsletter services free for 30 days . We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . Compare Brokers John Maxfield Staff Writer John has written for The Motley Fool since 2011. If you like what you see, then you should follow him on Twitter. Follow @OneMarlandRoad Article Info Jul 24, 2015 at 12:10PM Financials", "external_links": [], "published": "2015-07-24T19:10:00.000+03:00", "crawled": "2015-07-25T16:16:00.876+03:00", "highlightTitle": ""}