{"organizations": [], "uuid": "3518ca49aab2e86415944560480ee3cd3452f19f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iJQGY4gXgxIs/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-13/greek-deal-makes-europe-more-german-but-at-what-cost-", "country": "US", "title": "Greek Deal Makes Europe More German. But at What Cost?", "performance_score": 3, "site": "bloomberg.com", "participants_count": 1, "title_full": "Greek Deal Makes Europe More German. But at What Cost? - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T22:16:00.000+03:00", "replies_count": 0, "uuid": "3518ca49aab2e86415944560480ee3cd3452f19f"}, "author": "Leon Mangasarian", "url": "http://www.bloomberg.com/news/articles/2015-07-13/greek-deal-makes-europe-more-german-but-at-what-cost-", "ord_in_thread": 0, "title": "Greek Deal Makes Europe More German. But at What Cost?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Europe’s deal with Greece was variously denounced as blackmail, an attack on national sovereignty and an end to the European dream. The accord’s detractors could at least agree on one thing: the chief culprit was Angela Merkel.\nHaving held sway in the unequal struggle with Alexis Tsipras over the terms of a third bailout, Merkel has ensured that the 19-nation euro area remains a club whose members abide by the rules or are shown the door. The question is what toll that stance has taken on her reputation and the extent of the damage to the international standing of Germany and Europe.\n“This is, to all intents and purposes, a German-led economic coup d’etat,” said Nicholas Spiro, the managing director of Spiro Sovereign Strategy, an advisory firm in London. The “ultimatum to Greece is a reminder, if any were needed, that there’s no appetite whatsoever for the kind of large-scale integration required to shore up Europe’s shaky single-currency area.”\nMerkel and her finance minister, Wolfgang Schaeuble, were the chief protagonists in a weekend of negotiations that left Tsipras holding Greece’s continued membership of the euro as the main prize. Simply to open talks on as much as 86 billion euros ($95 billion) in aid, he had to capitulate on positions including pensions, taxes, the involvement of the International Monetary Fund and surrendering control of Greek state assets.\nEU Acrimony Shada Islam, director of policy at the Friends of Europe advisory group in Brussels, said that months of EU acrimony since Tsipras’s election in January as Greek premier at the head of an anti-austerity coalition has tarnished the bloc in the eyes of both its own citizens and globally.\n“They reached a deal on Greece but at a huge cost,” Islam said by phone. “Merkel tried to play the middle ground but Schaeuble will be seen by some critics as the true villain of this piece.”\nBoth Merkel and Schaeuble have become hate figures in Greece, where comparisons with the World War II occupation by Nazi forces have become commonplace. In Germany, members of Merkel’s coalition have competed for outrage against a backdrop of the constant drumbeat of calls by the best-selling Bild newspaper for Greece to be ejected from the euro.\nGermany is “tearing Europe apart” for the third time in the past century, Nikos Filis, the parliamentary spokesman for the ruling Coalition of the Radical Left, or Syriza, said on ANT1 TV on Monday. Greece is being “waterboarded” by euro-area leaders, he said.\nPapered Over Fredrik Erixon, director of the European Centre for International Political Economy in Brussels, said the deal showed that the euro bloc is “papering over its structural problems” without addressing the flaws at its core, driving member states apart as a result.\n“The idea that you can parachute new leadership and new institutions into Greece to get it to work is wrong,” Erixon said by phone. “What we’re seeing is the end of euro-area convergence.”\nDismay over the showdown resonated in Germany, where a recent poll found voters split, with 45 percent saying Greece should stay in the euro and 45 percent calling for it to leave.\nBarbara Hahn, 72, a freelance translator, has been a steadfast supporter of the European Union. Because of Merkel’s hardline stance on Greece, she’s not so sure anymore.\n‘Ashamed’ “I’m ashamed how the German government has behaved,” said Hahn, as she walked by a German parliament building toward the French embassy in downtown Berlin. Germany and its EU allies “blackmailed” Greece, she said, adding that the focus on austerity at all cost had shattered her trust in the European project.\nAnton Hofreiter, co-leader of the opposition Greens in parliament, said he doesn’t believe the accord will ensure enough investment in Greece to boost the stagnant economy.\n“In the end, we will be facing the same problem in that Greece is stuck in recession and can’t pay its debts,” he said on N24 television.\nThe fellow opposition Left Party said that Merkel and Schaeuble had “effectively ended the European Union.”\nJoerg Forbrig, a senior program director at the German Marshall Fund of the U.S. in Berlin, said that he took criticism of the deal with “a pinch of salt.”\n“A whole bunch of euro member states backed the German position on Greece and at least four others took an even tougher position than did Berlin,” said Forbrig. “Germany’s a convenient target because it’s far harder to mobilize the Greeks against, say, Lithuania.”\nMerkel, speaking to reporters in Brussels on Monday after 17 hours of negotiations, deflected comparison of the Greek deal to the Treaty of Versailles imposed on Germany after its defeat in World War I, an act which played a role in the nation’s 1920s economic collapse.\n“I don’t take part in any historical comparisons,” Merkel said. The agreement struck in Brussels was “nothing special,” she said, other than the levels of financial assistance being so high.\n“I believe Greece has the chance to return to growth,” said Merkel. “The path will be long” and “it will be difficult.”", "external_links": [], "published": "2015-07-13T22:16:00.000+03:00", "crawled": "2015-07-13T17:48:32.000+03:00", "highlightTitle": ""}