{"organizations": [], "uuid": "a5f97b5be03722e3bd32e6046d30822e60fbab27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.finfacts.ie", "main_image": "", "site_section": "http://www.finfacts.ie/irelandbusinessnews/rss.xml", "section_title": "Finfacts Ireland Business & Finance Portal", "url": "http://www.finfacts.ie/irishfinancenews/article_1028930.shtml", "country": "IE", "title": "Energy subsidies at 6.5% of global GDP; Commodity prices to remain weak", "performance_score": 0, "site": "finfacts.ie", "participants_count": 0, "title_full": "Energy subsidies at 6.5% of global GDP; Commodity prices to remain weak", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T06:46:00.000+03:00", "replies_count": 0, "uuid": "a5f97b5be03722e3bd32e6046d30822e60fbab27"}, "author": "", "url": "http://www.finfacts.ie/irishfinancenews/article_1028930.shtml", "ord_in_thread": 0, "title": "Energy subsidies at 6.5% of global GDP; Commodity prices to remain weak", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Energy subsidies at 6.5% of global GDP; Commodity prices to remain weak   editor of Finfacts Jul 23, 2015 - 3:46 AM   \nEnergy subsidies are projected at US$5.3tn in 2015, or 6.5% of global GDP, according to a recent IMF study with most of this arising from countries setting energy taxes below levels that fully reflect the environmental damage associated with energy consumption. Meanwhile the World Bank said this week that commodity prices will remain weak despite a rebound in the price of crude oil. \nThe country-level estimates underlying the IMF's global energy subsidy figures are now publicly available. Energy subsidies are substantial \nEnergy subsidies are dramatically higher than previously thought. Estimates for global energy subsidies in 2011 have been revised to US$4.2tn, more than double the US$2.0tn previously reported in a 2013 IMF book, Energy Subsidy Reform: Lessons and Implications . \nThe upward revision is partly due to factoring in new World Health Organization estimates on harm to health from pollution exposure. Additional country-level data on emissions and the damage they cause have also become available, as detailed in a more recent IMF book, Getting Energy Prices Right: From Principle to Practice . \nSubsidies are projected to remain high, despite sharp declines in international energy prices according to the Fund. The estimate for 2015 is US$5.3tn (6.5% of global GDP). High growth in energy consumption, especially coal, inflation and real income growth, and persistent undercharging for environmental costs are all key factors. Subsidies are pervasive \nEnergy subsidies are sizable in nearly all countries, advanced and developing economies alike. China is the top subsidizer in dollar terms, Ukraine in percentage of GDP and Qatar in per capita subsidies (chart above). Subsidies in dollar terms in part reflect the size of the economy. \nThe bulk of energy subsidies in most countries are due to undercharging for domestic environmental damage, including local air pollution—especially in countries with high coal use and high population exposure to emissions—and broader externalities from vehicle use like traffic congestion and accidents. In many top subsidizers in% of GDP and in per capita terms, these also reflect the setting of domestic energy prices below their supply cost. The reform gains are large \nThe IMF says that eliminating global energy subsidies could reduce deaths related to fossil-fuel emissions by over 50% and fossil-fuel related carbon emissions by over 20%. The revenue gain from eliminating energy subsidies is projected to be US$2.9tn (3.6% of global GDP) in 2015. This offers huge potential for reducing other taxes or strengthening revenue bases in countries where large informal sector constrains broader fiscal instruments. \nAdvanced economies would gain enough revenue to halve corporate income tax or cover one quarter of public health spending (chart below). In emerging economies, the revenue is worth double their corporate income tax revenues or public health spending. In low-income countries, it is about one and half times corporate income tax revenues or public health spending. \nThe net gain from reform, after subtracting the cost of higher energy prices to consumers from the fiscal and environmental gains, is projected at US$1.8tn (2.2% of global GDP) and could be much larger if the fiscal gain is used for growth-enhancing tax cuts on labor and capital or badly needed investments in education, health, and infrastructure. \nThe Fund says that it is generally in countries’ own interest to move ahead unilaterally with energy subsidy reform. Top subsidizers in% of GDP and in per capita subsidies stand to gain the most. The benefits will mostly accrue at the local level, by reducing local pollution and generating much needed revenues. Taxing fuels to reflect environmental costs is also straightforward administratively, as it can build off road fuel excises which are well established in most countries. \nThe IMF adds: \"Energy subsidy reform can also contribute to carbon emissions reduction and help countries make pledges ahead of the Paris 2015 UN climate conference. To achieve significant carbon emissions cuts at the global level, it would be essential for top subsidizers in dollar terms to play a leading role. \nLow international energy prices have opened a window of opportunity for countries to move towards more efficient pricing of energy. However, a gradual approach may be desirable, given the size of the required price increases and uncertainty around the optimum level of taxes on negative externalities. This would allow time to further refine estimates, for households and firms to adjust, and for governments to implement measures to protect the poor.\" Commodity prices \nAverage prices for energy such as crude, natural gas and coal will be down 39% this year from 2014, while those for materials like metals and fertilisers will fall about 12%, the World Bank said in its quarterly \" Commodity Markets Outlook \" released Wednesday. \"All main commodity price indices are expected to decline in 2015, mainly due to abundant supplies, and in the case of industrial commodities, weak demand,\" the bank said in the report. \nThe lender has raised its 2015 forecast for crude oil prices from $53 in April to $57 per barrel after oil prices rose 17% in the Apr-Jun quarter and it reports that energy prices rose 12% in the quarter, with the surge in oil offset by declines in natural gas (down 13%) and coal prices (down 4%). However, the Bank expects energy prices to average 39% below 2014 levels. Natural gas prices are projected to decline across all three main markets — US, Europe, and Asia — and coal prices to fall 17%. Excluding energy, the World Bank reports a 2% decline in prices for the quarter, and forecasts that non-energy prices will average 12% below 2014 levels this year . \nRelated Articles", "external_links": [], "published": "2015-07-23T06:46:00.000+03:00", "crawled": "2015-07-23T09:56:51.197+03:00", "highlightTitle": ""}