{"organizations": [], "uuid": "97a72f78df827e92aa40c7ffee296e79651e5a09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2013-07/29/full/1375040069-9147.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss#", "section_title": "Finance", "url": "http://www.business-standard.com/article/economy-policy/rupee-seen-weakening-yields-might-rise-ahead-of-us-fed-meeting-115072700021_1.html", "country": "IN", "title": "Rupee seen weakening, yields might rise ahead of US Fed meeting News", "performance_score": 0, "site": "business-standard.com", "participants_count": 1, "title_full": "Rupee seen weakening, yields might rise ahead of US Fed meeting | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "97a72f78df827e92aa40c7ffee296e79651e5a09"}, "author": "BS Reporter", "url": "http://www.business-standard.com/article/economy-policy/rupee-seen-weakening-yields-might-rise-ahead-of-us-fed-meeting-115072700021_1.html", "ord_in_thread": 0, "title": "Rupee seen weakening, yields might rise ahead of US Fed meeting News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ahead of the US Federal Open Market Committee (FOMC) meeting later this week, the rupee is seen weakening, while government bond yields are seen rising from current levels.\n\nThe US jobless claims data released on Friday showed that jobless claims plunged by 26,000 to 255,000 in the week ending July 18, the lowest since November 1973. The data raised concerns on US Fed announcing tightening soon. Emerging markets, including India, will see outflows when the Fed begins to raise interest rates.\n\nThe yield on the new 10-year bond had risen by 3 basis points (bps) on Friday to end at 7.83 per cent compared with 7.80 per cent previously. However, the yield on the 10-year benchmark bond rose only 1 bps to close at 8.01 per cent.\n\n\"Every week, there is bond auction by the Reserve Bank of India (RBI) and that too is putting pressure on yields. The yield on the 10-year benchmark bond will trade between 7.95 to 8.05 per cent,\" said Debendra Kumar Dash, assistant vice-president (money market), DCB Bank. Bond traders believe that yields are biased towards rising.\n\nThe rupee on the other hand, ended at a two-month low on Friday at 64.04 compared with previous close of 63.77 against the dollar.\n\nThe weakening was despite RBI intervening in the market by selling dollars through state-run banks. However, currency dealers agreed the intervention was not in a major way. On Friday, there was a huge demand for dollars from corporates as well as oil companies, which put pressure on the rupee.\n\nAccording to Sandeep Gonsalves, forex consultant and dealer, Mecklai & Mecklai, this week the trading range for the rupee will be between 63.75 and 64.50 as month-end dollar demand by importers will continue to put pressure on the rupee. Currency dealers see the resistance at 64.50 and they believe that at least for this week this level may not be breached as RBI will ensure there will not be any major volatility.\n\nRBI's foreign exchange (forex) reserves fell over $1 billion for the week ending July 17 to $353.33 billion, showed data released on Friday. The forex reserves are currently at a level last seen in the week ending June 5 at $352.71 billion.Ahead of the US Federal Open Market Committee (FOMC) meeting later this week, the rupee is seen weakening, while government bond yields are seen rising from current levels. US jobless claims data released on Friday showed that jobless claims plunged by 26,000 to 255,000 in the week ending July 18, the lowest since November 1973. The data raised concerns on US Fed announcing tightening soon. Emerging markets, including India, will see outflows when the Fed begins to raise interest rates.\n\nThe yield on the new 10-year bond had risen by 3 basis points (bps) on Friday to end at 7.83 per cent compared with 7.80 per cent previously. However, the yield on the 10-year benchmark bond rose only 1 bps to close at 8.01 per cent.\n\n\"Every week, there is bond auction by the Reserve Bank of India (RBI) and that too is putting pressure on yields. The yield on the 10-year benchmark bond will trade between 7.95 to 8.05 per cent,\" said Debendra Kumar Dash, assistant vice-president (money market), DCB Bank. Bond traders believe that yields are biased towards rising.\n\nThe rupee on the other hand, ended at a two-month low on Friday at 64.04 compared with previous close of 63.77 against the dollar. The weakening was despite RBI intervening in the market by selling dollars through state-run banks. However, currency dealers agreed the intervention was not in a major way. On Friday, there was a huge demand for dollars from corporates as well as oil companies, which put pressure on the rupee.\n\nAccording to Sandeep Gonsalves, forex consultant and dealer, Mecklai & Mecklai, this week the trading range for the rupee will be between 63.75 and 64.50 as month-end dollar demand by importers will continue to put pressure on the rupee. Currency dealers see the resistance at 64.50 and they believe that at least for this week this level may not be breached as RBI will ensure there will not be any major volatility.\n\nRBI's foreign exchange (forex) reserves fell over $1 billion for the week ending July 17 to $353.33 billion, showed data released on Friday. The forex reserves are currently at a level last seen in the week ending June 5 at $352.71 billion.", "external_links": [], "published": "2015-07-27T03:00:00.000+03:00", "crawled": "2015-07-27T00:21:57.337+03:00", "highlightTitle": ""}