{"organizations": [], "uuid": "feafbb8ef36ad03620ea7be98ad466ea1be24b3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://specials-images.forbesimg.com/imageserve/460875866/640x434.jpg?fit=scale", "site_section": "http://www.forbes.com/finance/", "section_title": "Forbes - Personal Finance Information and Personal Finance News - Forbes.com", "url": "http://www.forbes.com/sites/kellyphillipserb/2015/07/28/tampa-bay-buccaneers-heir-says-irs-trying-to-improperly-seize-assets/", "country": "US", "title": "Tampa Bay Buccaneers Heir Says IRS Trying To Improperly Seize Assets", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "Tampa Bay Buccaneers Heir Says IRS Trying To Improperly Seize Assets - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T23:34:00.000+03:00", "replies_count": 0, "uuid": "feafbb8ef36ad03620ea7be98ad466ea1be24b3e"}, "author": "Kelly Phillips Erb", "url": "http://www.forbes.com/sites/kellyphillipserb/2015/07/28/tampa-bay-buccaneers-heir-says-irs-trying-to-improperly-seize-assets/", "ord_in_thread": 0, "title": "Tampa Bay Buccaneers Heir Says IRS Trying To Improperly Seize Assets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As the heir of a long time National Football League (NFL) franchise owner, Hugh Culverhouse Jr. knows a little bit about blindsiding. He just didn’t expect to experience it himself from the Internal Revenue Service (IRS).\nAccording to Culverhouse, the IRS blindsided him with a demand for payment on a tax liability that doesn’t exist and then attempted to seize his assets in the process. In response, the Culverhouses have filed suit in federal court in the Southern District of Florida to stave off a levy.\nIf you’re at all familiar with tax procedure, this may seem like a curious route. Generally, when the IRS alleges that you owe tax and threatens a levy, you can ask for a temporary hold on collections while you make payment arrangements. Better yet, if you’re as flush as the Culverhouses, you can pay the tax due and fight about it after the fact in Tax Court.\nThat assumes, however, that you know how much you owe.\nThe Culverhouses assert that the IRS never billed them for any tax. Further, they claim that after numerous communications with IRS, it’s still unclear how much they allegedly owe, how the IRS calculated the tax or, remarkably, which tax years are in question.\nThe Culverhouses do admit that they are in the middle of a legitimate tax dispute with IRS involving a partnership in which Culverhouse holds an interest, Palmer Ranch Holdings, Ltd. And not coincidentally, it involves the same tax year, 2006, for which the IRS is attempting to collect from them personally. In that dispute, the IRS attempted to assess additional tax to the partnership; the partnership disagreed, sued and won. IRS appealed and the matter is currently pending in the Eleventh Circuit. (You can read my colleague’s take on the easement issue involved in the dispute here .)\nTAMPA, FL – DECEMBER 28: Tampa Bay Buccaneers fans look ahead to next years season after a loss to the New Orleans Saints at Raymond James Stadium on December 28, 2014 in Tampa, Florida. (Photo by Cliff McBride/Getty Images)\nSo what does that have to do with the Culverhouses’ personal income tax liability? While a partnership is a separate entity from the individual partners, the two are connected for tax purposes. Tax is calculated at the partnership level and the individual tax attributes pass to the individual partners (that’s why you’ll hear a partnership referred to as a “passthrough entity”). That means that a change to the tax assessment for a partnership could affect the individual partners. But remember: the Culverhouses’ partnership matter is still pending.\nPage 1 / 3 Continue", "external_links": ["http://specials-images.forbesimg.com/imageserve/460875866/640x0.jpg?fit=scale"], "published": "2015-07-28T23:34:00.000+03:00", "crawled": "2015-07-28T23:27:51.699+03:00", "highlightTitle": ""}