{"organizations": [], "uuid": "2f2b425cea752cf5316d39639c4ae82e26acda53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/_w9r3EHrHt9DmmU7Ezr.2Q--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/6212f8b199890d7e546d830fca216c99dc5831d2_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/varoufakis-scourge-greeces-creditors-111712231.html", "country": "GB", "title": "Varoufakis: Scourge of Greece's creditors", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Varoufakis: Scourge of Greece's creditors", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T14:32:00.000+03:00", "replies_count": 0, "uuid": "2f2b425cea752cf5316d39639c4ae82e26acda53"}, "author": "", "url": "https://uk.finance.yahoo.com/news/varoufakis-scourge-greeces-creditors-111712231.html", "ord_in_thread": 0, "title": "Varoufakis: Scourge of Greece's creditors", "locations": ["Greece"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nGreece's maverick finance minister Yanis Varoufakis, who announced his surprise resignation on Monday, achieved near-celebrity status with an urban-cool image and visceral attacks on the country's international creditors. \nIn the culmination of his verbal barbs on the eve of the referendum, Varoufakis accused the lenders of \"terrorism\", by pushing for Greeks to vote \"Yes\" to bailout terms that would \"humiliate\" them. \nThe \"No\" camp won a resounding victory on Sunday, but Varoufakis stepped aside, saying it had become clear his departure would help Prime Minister Alexis Tsipras in the ensuing negotiations with creditors. \n\"Minister No More!\" the 54-year-old announced on his blog. \n\"Soon after the announcement of the referendum results, I was made aware of a certain preference by some Eurogroup participants, and assorted 'partners', for my... 'absence' from its meetings.\" \n- 'Wearing loathing with pride' - \nDuring five months of fruitless talks between Athens and its creditors, Varoufakis' blunt negotiating tactics -- and lack of previous political experience -- often angered those across the table. \nAt times, Varoufakis seemed more at ease chatting with unemployed anarchists than with his fellow European finance ministers, or International Monetary Fund officials. \nGermany's veteran Finance Minister Wolfgang Schaeuble, in particular, made little secret of the fact that he found him particularly difficult to deal with. \nBut many Greeks admired his approach and Varoufakis declared in his resignation announcement: \"I shall wear the creditors' loathing with pride.\" \nHe believed that Greece's shattered economy could only recover once the terms of its bailout are drastically revised -- and that creditors must write off some of its massive 320 billion euros ($353 billion) of debt. \nFrom the moment that the economics professor -- or \"accidental economist\" as he calls himself -- was appointed following the radical left Syriza party's victory in January elections, it was clear Varoufakis would refuse to bow to convention. \nHis look immediately set him apart from the pinstriped world of finance ministers. His jacket collar was turned up to his shaven head, his shirts were sometimes flowery, and away from meetings he preferred a motorbike to a chaffeur-driven limo -- he was quickly dubbed \"Greece's Bruce Willis\". \nHe rarely employed the carefully-chosen words of the financial milieu, and was fond of sharing his thoughts in frequent blog posts. \nAfter the final pre-referendum bailout negotiations broke down last week, Varoufakis slammed Europe's governance. \n\"This is not the way to run a monetary union. This is a travesty. It's a comedy of errors for five years now, Europe has been extending and pretending,\" he told the BBC. \nBy then, his abrasive style had led to him being removed from frontline negotiations on the bailout, although his influence was still clear. \nThough he prides himself on defending ordinary Greeks, Varoufakis' background was anything but common. \nHis father Giorgos Varoufakis, once headed one of Greece's leading steel producers, Halyvourgiki. He also attended the Moraitis School, whose alumni include prominent Greek leaders and artists. \nIn a public relations blunder, as Greeks were pulling in their belts even tighter, Varoufakis allowed himself to be pictured in Paris Match at a piano and dining in style with his wife on the roof terrace of their apartment overlooking the Acropolis, while telling the magazine he abhorred the \"star system\". \nHis father said his son's critics \"want to run him down because he is competent.\" \n\"Yanis is a very good boy, and is always telling the prime minister what to do, which is why he adores him,\" he told the Greek daily Ethnos. \nHis early academic career was spent in England at the universities of Essex, East Anglia and Cambridge. \nIn 1998 Varoufakis moved to Australia, and he is now a dual Greek and Australian citizen. \nHe moved back to Greece in 2000 to teach at the University of Athens, and in January 2013 accepted a post at the University of Texas in Austin before Greece -- and its problems -- called him back.", "external_links": [], "published": "2015-07-06T14:32:00.000+03:00", "crawled": "2015-07-06T14:51:22.000+03:00", "highlightTitle": ""}