{"organizations": ["Deutsche Bank"], "uuid": "f2a7e810c7a3f35736d90d9b26463ff1f13f703c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=C", "section_title": "Yahoo! Finance: C News", "url": "http://finance.yahoo.com/news/libor-rigging-hits-deutsche-bank-215409146.html", "country": "US", "title": "LIBOR Rigging Hits Deutsche Bank (DB) Beyond Financials - Analyst Blog", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "LIBOR Rigging Hits Deutsche Bank (DB) Beyond Financials - Analyst Blog", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T00:54:00.000+03:00", "replies_count": 0, "uuid": "f2a7e810c7a3f35736d90d9b26463ff1f13f703c"}, "author": "", "url": "http://finance.yahoo.com/news/libor-rigging-hits-deutsche-bank-215409146.html", "ord_in_thread": 0, "title": "LIBOR Rigging Hits Deutsche Bank (DB) Beyond Financials - Analyst Blog", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Content preferences Done \nGlobal banks, which are facing innumerable legal hassles from regulators, have now come on the radar of labor unions. Notably, a Las Vegas-based union has raised concerns over Deutsche Bank AG ’s DB stake in Station Casinos, after the Frankfurt-based lender was hit with a $2.2-billion fine for LIBOR rigging in Apr 2015.According to Bloomberg, Culinary Workers Union Local 226 and Bartenders Union Local 165 have questioned the “suitability” of the bank’s ownership in Station Casinos, challenging the 25% stake (worth nearly $337 million) acquired by Deutsche in 2009.These organizations have requested casino regulators in Nevada to investigate the matter. In an emailed statement, A.G. Burnett, Chairman of Nevada Gaming Control Board, said that “When someone presents us with information alleging that a licensee has done something inappropriate, we independently investigate that… Here, we have not reached any conclusions.”The mentioned unions are affiliates of UNITE HERE, a labor union of workers in the hotel, gaming, food textile, and other industries, with more than 265,000 active members.Of late, Deutsche Bank has been struggling with its casino business. In Jun 2015, Veneto Hotel & Casino SA sued the company for allegedly freezing accounts and funds to meet operating expenses. Also, the bank had to sell its Las Vegas-based casino Cosmopolitan to The Blackstone Group L.P. BX as part of its Strategy 2015+ efforts of reducing non-core operations.While the company might have to vend its stake in Station Casinos as well, such matters show how corrupt practices by banks have damaged their trustworthy image. Institutions like JPMorgan Chase & Co. JPM and Citigroup Inc. C have time and again engaged in the manipulation of benchmark rates and foreign exchange rates; while several others have been found to be involved in the subprime mortgage loan crisis of 2008. As a result, increasing legal reserves and penalties have tempered the companies’ profitabilities.Deutsche Bank currently carries a Zacks Rank #2 (Buy).Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days . Click to get this free report >> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report", "external_links": [], "published": "2015-07-11T00:54:00.000+03:00", "crawled": "2015-07-12T08:29:01.000+03:00", "highlightTitle": ""}