{"organizations": ["S&T Bancorp, Inc."], "uuid": "41fcb7f9c100d28527a69ce2f2925ec3acf5652c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theenterpriseleader.com", "main_image": "", "site_section": "http://www.google.ca/finance/company_news?q=NASDAQ:STBA&ei=zIG5U_DmF4W-wQOOoICIDQ&output=rss", "section_title": "News for S & T Bancorp Inc - Google Finance", "url": "http://theenterpriseleader.com/stock-watch/momentum-stock-in-focus-st-bancorp-inc-nasdaqstba-2/13227/", "country": "IL", "title": "Momentum Stock in Focus: S&T Bancorp, Inc. (NASDAQ:STBA)", "performance_score": 0, "site": "theenterpriseleader.com", "participants_count": 0, "title_full": "Momentum Stock in Focus: S&T Bancorp, Inc. (NASDAQ:STBA)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T23:15:00.000+03:00", "replies_count": 0, "uuid": "41fcb7f9c100d28527a69ce2f2925ec3acf5652c"}, "author": "", "url": "http://theenterpriseleader.com/stock-watch/momentum-stock-in-focus-st-bancorp-inc-nasdaqstba-2/13227/", "ord_in_thread": 0, "title": "Momentum Stock in Focus: S&T Bancorp, Inc. (NASDAQ:STBA)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Momentum Stock in Focus: S&T Bancorp, Inc. (NASDAQ:STBA) July 29, 2015 4:04 pm · \nS&T Bancorp, Inc. (NASDAQ:STBA) has been given a top momentum style rating by Zacks Research. This rating is an indicator of when a stock might be favorable to enter a position to take advantage of the equity movement in either an upward or downward direction. Momentum traders look at the trends of a stock price and believe that the stock will continue to move in the same direction, leading to timely and profitable trades. This strategy focuses on short-term movements in the stock price instead of fundamental research and is typically used only by experienced traders. \nInvestors looking to take positions in S&T Bancorp, Inc. (NASDAQ:STBA) might consider looking at past earnings history and future analyst projections in addition to the momentum score. According to Zacks, S&T Bancorp, Inc. has a consensus rating of 2.83. The number is based on a simplified 1-5 scale where analysts giving a Strong Buy rating would be given a 1 and those giving a Sell rating would be given a 5. This is the consensus number of all tracked analysts who have published ratings on the stock. \nBrokerage Views \nWall Street sell-side research firms who cover S&T Bancorp, Inc. (NASDAQ:STBA) have given the stock a one-year price target of $31.666. This is based on 3 analysts who have provided projections in the past 6 months. The most bullish firm sees the stock reaching $32 within the year while the most conservative has their price target set at $31. \nAnalysts are projecting that S&T Bancorp, Inc. will report earnings per share of $0.56 when they are scheduled to next report results on or around 2015-10-27. Most recently the company reported earnings of $0.52 for the quarter ending on 2015-06-30. \nS&T Bancorp, Inc. Profile \nS&T Bancorp, Inc. (S&T) is a bank holding company and has three wholly owned subsidiaries, S&T Bank, 9th Street Holdings, Inc. and STBA Capital Trust I. The Company also owns certain interest in Commonwealth Trust Credit Life Insurance Company. As of December 31, 2012, the Company had approximately .4 billion in loans and .6 billion in deposits. S&T Bank is a full service bank. It provides its services to its customers through offices located in Allegheny, Armstrong, Blair, Butler, Cambria, Clarion, Clearfield, Indiana, Jefferson and Westmoreland counties of Pennsylvania. It operates in three segments: Community Banking, Wealth Management and Insurance. Its Community Banking segment offers services, which include accepting time and demand deposit accounts, originating commercial and consumer loans, and providing letters of credit and credit card services. The Wealth Management segment offers discount brokerage services, services as executor and trustee under wills and deeds.", "external_links": [], "published": "2015-07-29T23:15:00.000+03:00", "crawled": "2015-07-30T01:35:47.766+03:00", "highlightTitle": ""}