{"organizations": ["Samsung"], "uuid": "0c99c16e911153bb330b3c82d8a6bf315957c45a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/samsung-clears-hurdle-way-8-084413243.html", "country": "GB", "title": "Samsung clears hurdle on way to $8 bln shakeup as court rules against U.S. fund", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Samsung clears hurdle on way to $8 bln shakeup as court rules against U.S. fund", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T11:44:00.000+03:00", "replies_count": 0, "uuid": "0c99c16e911153bb330b3c82d8a6bf315957c45a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/samsung-clears-hurdle-way-8-084413243.html", "ord_in_thread": 0, "title": "Samsung clears hurdle on way to $8 bln shakeup as court rules against U.S. fund", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 7, 2015, 10:00 BST - UK Markets close in 6 hrs 30 mins Samsung clears hurdle on way to $8 bln shakeup as court rules against U.S. fund Reuters – 16 minutes ago \nA worker works on a Samsung outdoor advertisement installed atop an office building in central Seoul … \nBy Sohee Kim \nSEOUL (Reuters) - A South Korean court on Tuesday denied an injunction request by a U.S. hedge fund trying to block builder Samsung C&T Corp from selling treasury shares to ally KCC Corp, clearing another hurdle for a proposed $8 billion merger of Samsung Group firms. \nThe ruling comes ahead of a July 17 Samsung C&T shareholder vote on an all-stock takeover offer from Cheil Industries Inc, the de facto holding company of Samsung Group. The verdict allows chemicals and construction materials firm KCC, Cheil's second-biggest shareholder, to exercise voting rights for the treasury shares. \nExplaining its ruling against the request from fund Elliott Associates, the Seoul Central District Court said Samsung C&T violated no laws in selling treasury shares to KCC. With a total of around 6 percent of C&T, including the 5.8 percent stake purchase approved by the court, KCC is the Samsung construction firm's fourth-largest shareholder and will back the Cheil deal. \nElliott said in a statement after the ruling was issued that C&T's treasury sale is \"wholly improper\". The fund has already filed an appeal against the decision, according to court records. \nThe Cheil-Samsung C&T merger is seen as a key step towards a leadership transfer for the Samsung Group's founding Lee family, as it consolidates stakes in key affiliates under the Lee heirs' control. But opposition from Elliott, C&T's third-largest shareholder with a 7.1 percent stake, has led to doubts about whether Samsung C&T can muster enough support from shareholders. \nC&T needs the support of at least two-thirds of the votes cast on July 17 to proceed with the deal, making KCC's voting rights important. Recent reports from two influential proxy advisors calling on C&T investors to reject the takeover offer could bolster Elliott's efforts to block the deal, a rare case of investor activism in South Korea. \nElliott had filed the injunction seeking to block Samsung C&T's stake sale to KCC in June. It has also appealed a court ruling against its other injunction request, which sought to prevent the July 17 shareholder vote for C&T investors taking place. \nThe Seoul High Court will hold a hearing on this appeal on July 13. \nSamsung C&T said in a statement on Tuesday it welcomed the court's ruling and will work to convince shareholders of the merits of the proposed merger. A company spokesman later said Elliott's decision to appeal the ruling was expected and that C&T will respond accordingly. \nA KCC spokeswoman said the court's ruling on Tuesday recognises that its purchase of Samsung C&T's treasury shares was legal. \n(Additional reporting by Joyce Lee; Writing by Se Young Lee; Editing by Kenneth Maxwell)", "external_links": [], "published": "2015-07-07T11:44:00.000+03:00", "crawled": "2015-07-07T12:04:08.000+03:00", "highlightTitle": ""}