{"organizations": [], "uuid": "66ca18353c1a23e65e5ba99000cf4e2476b2d196", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/6iKOjWxTnMXDor2t_Uetbw--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_SILICONALLEY_H_LIVE/Donald_Trump_is_surging_some-dff34ee385dec67188b312c0362c743c.cf.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/donald-trump-surging-more-iowa-150754530.html", "country": "GB", "title": "Donald Trump is surging some more in a fresh batch of polls", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Donald Trump is surging some more in a fresh batch of polls", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T18:07:00.000+03:00", "replies_count": 0, "uuid": "66ca18353c1a23e65e5ba99000cf4e2476b2d196"}, "author": "", "url": "https://uk.finance.yahoo.com/news/donald-trump-surging-more-iowa-150754530.html", "ord_in_thread": 0, "title": "Donald Trump is surging some more in a fresh batch of polls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Jul 26, 2015, 16:41 BST - UK Markets closed Donald Trump is surging some more in a fresh batch of polls By Brett LoGiurato | Business Insider – 34 minutes ago Print \n(AP) Republican presidential candidate Donald Trump speaks at a rally and picnic, Saturday, July 25, 2015, in Oskaloosa, Iowa. Real-estate magnate and Republican candidate Donald Trump has showed no signs of slowing down in presidential primary polls. \nTrump is leading another national poll, from CNN , of the Republican field. And two NBC/Marist College polls place him in first and second, respectively, in the early-voting states of Iowa and New Hampshire. \nHere's a quick breakdown: Nationally: According to the CNN poll , Trump leads with 18% of the vote from Republican voters. He's followed by former Florida Gov. Jeb Bush (15%), Wisconsin Gov. Scott Walker (10%), and US Sen. Ted Cruz of Texas (7%). In New Hampshire: The NBC/Marist poll of the Granite State puts Trump in first, with 21% of the vote from potential GOP primary voters. Bush (14%), Walker (12%), and Ohio Gov. John Kasich (7%) follow Trump. In Iowa: Trump, at 17% sits 2 points behind Walker in the Hawkeye State. They're followed by Bush (12%), retired neurosurgeon Ben Carson (8%), and former Arkansas Gov. Mike Huckabee (7%). \nOne week after controversial comments questioning Sen. John McCain's (R-Arizona) war record, Trump continues to surge in both national and key early-state polls. He's now in first nationally by almost 5 percentage points, according to an average of five recent national polls . He will likely be front and center at the first Republican presidential debate on Aug. 6. \n(Thomson Reuters) Republican presidential candidate Donald Trump gestures at a news conference near the U.S.- Mexico border outside of Laredo, Texas \nThe CNN poll, which was conducted entirely after Trump's comments on McCain, shows that a majority of Republican voters want Trump to stay in the race. That includes about six in 10 voters who describe themselves as conservative or as members of the Tea Party faction of the GOP. \nTrump's supporters also appear to have more enthusiasm. According to the CNN poll, 22% of Republicans who describe themselves as enthusiastic about voting next year would back him, compared with 14% who would choose Bush and 12% who would pick Walker. \nAs always, there are some warning signs for Trump: He is still the least-liked candidate in the field, as 59% of the general population says it has an unfavorable impression of him. \nAnd his comments on McCain do appear to be taking a toll in New Hampshire, at least: According to the NBC poll, which was conducted in days both before and after the McCain comments, his support in the Granite State dropped from 26% before the comments to just 14% after. However, his position in Iowa actually strengthened after those comments.", "external_links": [], "published": "2015-07-26T18:07:00.000+03:00", "crawled": "2015-07-26T18:44:55.178+03:00", "highlightTitle": ""}