{"organizations": [], "uuid": "f7a3c1fa16ec41932a20ae0356b360e3bc7beba1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.euractiv.com", "main_image": "http://www.euractiv.com/sites/default/files/masks_0.jpg", "site_section": "http://www.euractiv.com/sections/euro-finance", "section_title": "Euro &amp; Finance | EurActiv", "url": "http://www.euractiv.com/sections/euro-finance/meps-vote-could-expose-multinationals-tax-evasion-316082", "country": "GB", "title": "MEPs' vote could expose multinationals' tax dodging", "performance_score": 0, "site": "euractiv.com", "participants_count": 1, "title_full": "MEPs' vote could expose multinationals' tax dodging | EurActiv", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T23:59:00.000+03:00", "replies_count": 0, "uuid": "f7a3c1fa16ec41932a20ae0356b360e3bc7beba1"}, "author": "euractiv.com", "url": "http://www.euractiv.com/sections/euro-finance/meps-vote-could-expose-multinationals-tax-evasion-316082", "ord_in_thread": 0, "title": "MEPs' vote could expose multinationals' tax dodging", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A vote in the European Parliament tomorrow could led to European multinational corporations reporting their taxes paid, and profits made, on a country by country basis. Without such a rule, multinationals can shift their profits from country to country with the sole intention of paying less tax, a practice exposed by the LuxLeaks investigation, write Alvin Mosioma and Markus Meinzer.\nAlvin Mosioma is chair of the Financial Transparency Coalition and executive director of the Tax Justice Network Africa, and Markus Meinzer is senior analyst for the Tax Justice Network. He is the author of the forthcoming book Tax Haven Germany.\nEurope has led the way on responding to the wave of fresh concern about tax and transparency in the wake of the LuxLeaks scandal. Last December’s European Union deal to create registers of the real owners of companies is a testament to that.\nIndividual governments have even gone further, with the UK committed to opening their register to the public. But at a time when citizens are asked to accept cuts in public spending, salaries, and pensions, large multinational enterprises seem to still be getting away with paying next to no taxes on their profits.\nThanks to inter-company trading between two subsidiaries of the same parent company, multinational corporations (MNCs) are able exploit loopholes in domestic and international tax law to arbitrarily shift profits from one country to another with the sole intention of reducing their tax bill.\nThese practices came into the spotlight last November when the LuxLeaks investigation profiled more than 340 MNCs that concocted secret deals with the government of Luxembourg to secure extremely low tax rates. In some cases, MNCs were paying less than 1%. And roughly 70 of the 340 companies profiled in LuxLeaks were, in some form, associated with Germany.\nEven though MNCs publish their accounts as a single unified entity, they are taxed individually in each country where they operate. Without detailed information on operations in each country, detecting foul play is incredibly difficult, making it much easier for a corporation to move profits to a jurisdiction with an extremely low tax rate, even when there is no legitimate justification to do so.\nThe lack of country-specific reporting has handed multinational enterprises an advantage that their small and medium sized counterparts don’t possess. But this isn’t a competitive advantage; it’s an artificial one.\nMany small and medium sized enterprises are already reporting the very type of information required for CBCR, as they only operate in one jurisdiction. Why should their larger competitors be exempt?\nTomorrow, the European Parliament will vote on requiring multinational corporations to report on a country-by-country basis, which would make detecting this type of aggressive profit shifting much easier.\nThe measure, part of a package that aims to strengthen the rights of company shareholders, would require MNCs to publicly report things like profits, revenue, taxes paid, and number of employees in each country where they operate.\nThis is why tomorrow’s vote in the European Parliament is so important. It could start the beginning of a process that would see all European multinational corporations report on a country-by-country level.\nCountry-by-country reporting would help resource rich but revenue strapped governments in the global south, as well, who are often some of the first targets for multinational profit shifting. A landmark 2010 investigation by Action Aid, for example, revealed that SAB Miller, one of the biggest beverage corporations in the world, paid less tax in Ghana than a woman who owned a store just outside their production plant.\nA recent report from a panel chaired by former President Thabo Mbeki of South Africa listed public country-by-country reporting as a key initiative to stop the illicit flows that are devastating economies in Africa.\nMany in the business and investment community already support this type of common sense reform. A 2014 poll by PricewaterhouseCoopers, the accountancy firm, found that 59% of CEOs favored public country-by-country reporting.\nAnd it is not hard to imagine why. Investors who are integral to keeping the economy moving forward want to know whether potential business partners are operating in unstable areas, using tax havens, or engaging in aggressive tax planning.\nWhat company wants to end up in the middle of the next LuxLeaks?", "external_links": [], "published": "2015-07-07T23:59:00.000+03:00", "crawled": "2015-07-07T22:45:58.000+03:00", "highlightTitle": ""}