{"organizations": [], "uuid": "b0126ecc722313aba79c24c69f4256ab58512a0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/yeu2xkj87r_5883962627603_9177329590906.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/632749/1/south-africa-high-commissioner-assures-country-is-.html", "country": "US", "title": "South Africa High Commissioner assures country is safe for tourists", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "South Africa High Commissioner assures country is safe for tourists", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T10:06:00.000+03:00", "replies_count": 0, "uuid": "b0126ecc722313aba79c24c69f4256ab58512a0a"}, "author": "", "url": "http://www.modernghana.com/news/632749/1/south-africa-high-commissioner-assures-country-is-.html", "ord_in_thread": 0, "title": "South Africa High Commissioner assures country is safe for tourists", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  29 July 2015 08:06 CET South Africa High Commissioner assures country is safe for tourists By MyJoyOnline \nSouth African High Commissioner to Ghana, Lulama Xingwana, has dispelled fears of a recurrence of xenophobic attacks on African tourists and migrants. \nDescribing the attacks on some African nationals last April as a sad news for her country, she said firm steps have since been taken by the South African government to bring the attackers to book and forestall a repeat of the incident. \nLulama Xingwana was speaking Tuesday at a South African tourism workshop in Accra that brought major stakeholders in the industry together to promote the Rainbow Nation as a preferred travel destination. \nShe said since the attacks, South African security forces have been on high alert to prevent hostilities against foreigners. \nShe revealed that “police and army are patrolling the streets to prevent locals from attacking foreigners”. \nThe High Commissioner also said special committees on defence and safety and on social and economic issues have been set up by her government to deal with the root cause of the attacks. \nSouth African locals attacked their fellow African nationals in April, looting their properties for taking their jobs. \nThe incident was widely condemned worldwide, however, Ms Xingwana said the situation in her country currently is different. \n“Ghanaians, Kenyans, Nigerians and many African brothers and sisters are living happily in South Africa and they are plying their trade, they are doing their businesses; some are actually professionals and they are employed by the South African government,” she said. \nShe said the South African people never forget the part played by Africans, especially Ghana, in the fight against Apartheid, adding that many African nationals in her country are actively involved in efforts to dispel xenophobic fears. \nTourism is one of South Africa’s fastest-growing sectors, and the third-largest contributor to its Gross Domestic Product. The South African government expects the industry to generate nearly $600 million a year by the end of the decade and create 225,000 new jobs. \nThe industry employs over 700,000 people in South Africa, according to industry watchers. \nGhana's Deputy Tourism Minister, Dzifa Gomashie, who was a key note speaker at the event, lauded the Brand South Africa – the umbrella organization that promotes South African tourism – for its success at creating a compelling image for the country. \nShe said her ministry is working with Brand South Africa to promote tourism in Ghana and Africa as a whole. \nDzifa Gomashie said her ministry’s relationship with South Africa tourism will persist “as long as we have interest in one another and realise that there is a brand called Africa and Africans owe it themselves to tell the our story; for as long as we all have that passion, that realization that there is a need for emancipation of mind, of self and seeing that a story about South Africa ultimately affects Ghana, because the world doesn’t look at South Africa and Ghana and Kenya…the world looks at Africa as a country”. \nThe well attended event was represented by the Ghana Tourism Federation (GHATOF), the Ghana Tourism Authority ( GHATA ) and travel and tour agencies from both Ghana and South Africa, among others. \nFormer President of GHATOF, David Nana Anim, said the 25-member trade associations that make up the federation are fully behind South Africa’s bid to promote tourism on the content. \nHe also urged South Africans to continue with their engagements with Ghana, noting “Ghana is the best destination [in Africa] to do business”. \nStory by Ghana | Myjoyonline.com | George Nyavor | [email protected]", "external_links": [], "published": "2015-07-29T10:06:00.000+03:00", "crawled": "2015-07-29T11:54:34.456+03:00", "highlightTitle": ""}