{"organizations": [], "uuid": "dd2abf5b7ae4f5906fbdbd14f7ac1633ef9de578", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/j/l/a/s/image.related.afrArticleLead.620x365.gijkzc.png/1437763983422.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/opinion/columnists/the-labor-party-tones-down-its-support-for-the-us-alliance-20150724-gijkzc", "country": "AU", "title": "The Labor Party tones down its support for the US alliance", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The Labor Party tones down its support for the US alliance | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T10:11:00.000+03:00", "replies_count": 0, "uuid": "dd2abf5b7ae4f5906fbdbd14f7ac1633ef9de578"}, "author": "Tony Walker", "url": "http://www.afr.com/opinion/columnists/the-labor-party-tones-down-its-support-for-the-us-alliance-20150724-gijkzc", "ord_in_thread": 0, "title": "The Labor Party tones down its support for the US alliance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Julia Gillard's cloying speech to the US Congress in March 2011 bore the imprint of an American public relations agency flack. Gary Ramage Share on twitter by Tony Walker While the Labor Party ties itself in knots over the great wedge issue of asylum seeker politics, its triennial national conference this weekend in Melbourne will seek to contemporise its foreign policy to accommodate a changing global and regional environment.\nIn the longer term, this would seem better use of the party's time and energy than haggling over turnbacks, but whether a modernising of Labor's foreign policy platform gets much attention in the midst of one of the party's great existential debates will be another matter.\nBy prevaricating on the asylum seeker issue until the last moment before Conference, the party had managed to \"salami slice itself into oblivion\", as a prominent figure on the left put it.\nHow this issue was left to fester until conference eve tells you more than you need to know about a feckless Bill Shorten leadership.\nLabor will debate \"Australia's place in a changing world\" this Sunday, in which a modernised platform will be adopted, including its most significant alteration.\nThis comes in Clause 40 of Chapter 11. Such a proposed change gets rid of reference to the ANZUS Treaty as \"one of Australia's great national assets\" – like the Barrier Reef or the Melbourne Cricket Ground or Ayers Rock.\nIn its place are the words: \"The United States remains our closest security ally, formalised through the ANZUS Treaty, and a vital global partner.\"\nThis is juxtaposed with clause 43 which describes the \"re-emergence of China\" as \"one of the most significant developments of the 21st century\".\n 'Deepen, extend' engagement The draft platform commits Labor to \"deepen and extend\" Australia's engagement with China.\nThis would seem to get the balance right between what was no doubt calculated in previous platforms to be a \"wedge-proof\" description of Labor's unalloyed commitment to the American alliance, and the modern reality of the need to balance Australia's security and economic interests.\nThis is common sense.\nLabor foreign affairs spokeswoman Tanya Plibersek should be given credit for simplifying and contemporising the party's foreign policy platform to make it both more relevant and more readable.\nPlibersek tells AFR Weekend that changes to the section dealing with the ANZUS alliance were aimed at emphasising a relationship that was \"strong, long and deep but not compliant\".\n\"This is a good place for Labor to be,\" she says.\nDeclarations of undying regard for a great and powerful friend, mirrored in the previous platform, reached their apotheosis, or nadir – depending on your point of view – under the Julia Gillard premiership.\nIngratiating speech Gillard's cloying speech to Congress on March 10, 2011 bore the imprint of an American public relations agency flack, aimed not at asserting Australia's values and interests but at ingratiating ourselves with Congressional representatives, insofar as they were interested.\nCongress was hardly a full house that day.\nForeign aid activists at the national conference will be disappointed there is no reference in the draft platform to the aspirational goal of 0.7 per cent of gross national income as Australia's contribution to development assistance, in line with millennium goals.\nNor is there is a hard and fast commitment to a notional 2 per cent of GDP expenditure on defence.\nPlibersek's explanation for the above omissions is that because the policy document represents a \"broad statement of principles and values\" it would not have made sense to clutter it with too much detail.\nThis will not satisfy the foreign aid lobby.\nSupport for Palestinian state Labor's draft platform contains obligatory support for a \"two-state\" solution in the Arab-Israel dispute and for Israel to live within secure internationally recognised borders and agreed by the parties.\nIt also commits Labor to support for a Palestinian state, but the wording falls short of that being demanded by Labor activists, including former foreign minister Bob Carr.\nA slew of resolutions in state ALP conferences, calling for sterner action to penalise Israel for its settlement-building activities and recognition of a Palestinian state, will add to pressures on conference this weekend to stiffen the anodyne wording of the Palestine section.\nA senior Labor figure tells me that Israeli Prime Minister Benjamin Netanyahu's provocative statements during the recent Israeli election, that he would not countenance a Palestinian state while he was in office, has further soured Labor attitudes.\nShorten, identified with what internal critics describe as the \"Likud faction\" of the Victorian branch, will have his hands full with the Left on asylum seekers. One assumes he will not want a fight on the vexed Palestine issue.\nTony Walker is The Australian Financial Review 's international editor.", "external_links": ["https://twitter.com/http://twitter.com/tonywalker1"], "published": "2015-07-24T10:11:00.000+03:00", "crawled": "2015-07-25T05:14:17.720+03:00", "highlightTitle": ""}