{"organizations": [], "uuid": "298ffec8e4a6b42c4541a9993de6b12bb026df3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/g/s/s/v/image.related.afrArticleLead.620x365.giggg8.png/1437449599966.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/news/special-reports/industry-trends/adding-the-children-to-smsfs-may-not-be-a-good-idea-20150722-giggg8", "country": "AU", "title": "Adding the children to SMSFs may not be a good idea", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Adding the children to SMSFs may not be a good idea | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T22:15:00.000+03:00", "replies_count": 0, "uuid": "298ffec8e4a6b42c4541a9993de6b12bb026df3c"}, "author": "Alexandra Cain", "url": "http://www.afr.com/news/special-reports/industry-trends/adding-the-children-to-smsfs-may-not-be-a-good-idea-20150722-giggg8", "ord_in_thread": 0, "title": "Adding the children to SMSFs may not be a good idea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Teach your children well: some parents choose to bring their children into their SMSF to give their kids visibility of the family's financial situation and to teach them about investment and financial responsibility. Michael Kempf by Alexandra Cain There is a trend at present to promote self-managed super funds as the family super fund and there can be a number of benefits to doing this. But advisers say it's rarely suitable to include children under the age of 18 in a fund and doing so tends to be driven from the parent's tax planning perspective.\nAs Jason McLaren, director, Axiom Super Solutions notes, one of the basic governing rules for SMSFs is that all members must be either individual trustees or directors of the corporate trustee and vice-versa, although there is an exception for single member funds.\n\"So the same rules and responsibilities apply to the children as to the parents in terms of being members and running the SMSF,\" he notes.\nMcLaren points out that from a legal standpoint children under the age of 18 are not able to hold positions of trustee or director so the parents are required to act on their behalf. \"Where this occurs it should be reflected throughout the SMSF's documentation such as membership applications, trustee declarations and meeting minutes.\"\nHe notes that while the parents can represent themselves and their children in both capacities as SMSF trustees and members, they need to remember that they must act in the best interests of all members and not what may suit their needs alone.\nRay Jaramis, an adviser with Treysta Wealth Management says his practice looks after families who are members of the same SMSF because they are comfortable with the investment philosophy that the fund has adopted.\n\"This does not preclude members from having separate investments. It is not unusual to have a different investment portfolio for each member, to ensure individual treatment. You might typically see mum and dad in an investment portfolio that is designed to be more conservative than the risk profile sought by younger members. So we segregate the member balances, which allow us to satisfy contrasting investment mandates within the same SMSF,\" he explains.\nAccording to Jaramis, fee aggregation can work well for younger members in an SMSF. \"On a flat fee arrangement the larger balances of the parents subsidise the fees that are attributed to the smaller balances of the children.\n \"From an intergenerational perspective it can also make sense for the family to be part of the same SMSF. When children have a strong sense of how their parents' affairs are being managed and are part of that journey, the familiarity can help limit the distress around estate planning management.\"\nEstate planning Advisers urge trustees of SMSFs to think carefully about their estate planning. Head of retail bank and wealth management at Citibank Australia, Deirdre Wroth, says trustees should consider reviewing their trust deed and establish binding death benefit nomination, to ensure the assets of the fund are paid out in a way they want them to be, upon their death.\nThere had been some situations where a trustee has only completed a non-binding death benefit nomination. That has led to the benefits being paid out contrary to the wishes of the now-deceased original trustee.\nAs for involving children in an SMSF, Jaramis notes it can be advantageous to have them familiar with the family's investment philosophy and to introduce them to the family's advisers.\nHe says parents who include their kids in their SMSF might also find their children become more financially fascinated than may have otherwise been the case, as a result of being part of the family's retirement nest egg.\n\"Being exposed to sound money management at a young age can have significant advantages later in life. It is good for future generations to have an understanding of the support network that is available to them when the time comes for them to make big financial decisions.\"\nHowever, Jaramis notes that like all trusts, running an SMSF comes with an administrative tail of paperwork and compliance. \"Things like tax returns aren't able to be executed until all trustees have signed the relevant paperwork. When introducing additional members it is important to be clear around the expectations on turnaround time to get relevant documents signed and returned.\"\nFinancial responsibility Greg Einfeld, a director with Lime Super, says some parents choose to bring their children into their SMSF to give their kids visibility of the family's financial situation and to teach them about investment and financial responsibility.\nAnother benefits of including the children is to aggregate super balances to purchase a large asset such as a property.\n\"Despite these benefits, I generally recommend that children don't join their parents' super fund. Depending on the rules in the fund's trust deed and trustee company's constitution, the children might be able to take control of the fund.\n\"This risk arises when one of the parents passes away. There have been numerous cases where children have received their parents' death benefits against their parents' wishes. If parents decide to bring their children into the family SMSF then they should speak to a specialist estate planning lawyer,\" he says.\nSuper small Einfeld also notes that it's important to remember SMSFs can only have up to four members. \"If there are three or more children in the family then someone is going to miss out.\"\nWhen it comes to estate planning and super, Jaramis notes there are no hard and fast rules around what to do. \"It is important to understand that superannuation is not an estate asset, which means super does not automatically form part of your estate when you die.\"\n\"The most significant assets passed down to the next generation are usually the family home and the super assets, including insurances held by super. But there are reasons why you may elect to have your SMSF assets paid directly to a dependent in favour of forming part of your estate to be handled by your will.\"\nThis might be the case, for instance, if a dependent child has a chronic medical condition and will require lifetime treatment.\nSuper is a complex area and it's important to seek advice before bring any children into an SMSF. There may be other ways to teach children about financial responsibility that don't involve them becoming trustees and members of a DIY fund.", "external_links": [], "published": "2015-07-22T22:15:00.000+03:00", "crawled": "2015-07-22T21:59:52.064+03:00", "highlightTitle": ""}