{"organizations": [], "uuid": "cc21b69111760859ca324ba4d2744fb2c5340174", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business/Finance", "url": "http://www.menafn.com/1094287599/Riverbed-Helps-THE-NETAPORTER-GROUP-Deliver-Seamless-Web-Experiences-and-Improve-Network-Performance?src=RSS", "country": "US", "title": "Riverbed Helps THE NET-A-PORTER GROUP Deliver Seamless Web Experiences and Improve Network Performance", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Riverbed Helps THE NET-A-PORTER GROUP Deliver Seamless Web Experiences and Improve Network Performance | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "cc21b69111760859ca324ba4d2744fb2c5340174"}, "author": "Press", "url": "http://www.menafn.com/1094287599/Riverbed-Helps-THE-NETAPORTER-GROUP-Deliver-Seamless-Web-Experiences-and-Improve-Network-Performance?src=RSS", "ord_in_thread": 0, "title": "Riverbed Helps THE NET-A-PORTER GROUP Deliver Seamless Web Experiences and Improve Network Performance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Riverbed Technology, the leader in application performance infrastructure, today announced that THE NET-A-PORTER GROUP has chosen Riverbed SteelCentral„ solutions, including SteelCentral AppResponse, SteelCentral Transaction Analyzer, and SteelCentral Packet Analyzer. \n\nThis new deployment is part of The Group's APM strategy and will aid in optimizing the performance of mission critical SaaS applications and websites, in order to deliver an unparalleled experience for luxury fashion customers worldwide. With SteelCentral solutions, The Group gains a central view of its network traffic, enabling the technology team to detect, analyze, and swiftly resolve any performance related issues. Riverbed's solutions will also address previous gaps on the physical network and protocol aspects. \n\nTHE NET-A-PORTER GROUP is built on a foundation of technology innovation and operates a hybrid IT infrastructure. This includes product and order management, and warehouse logistics all deployed in multiple data centers, and accessed by staff from various locations. The Group sought to ensure that the platform could be integrated simply into the existing infrastructure so that every member of the technology team, from the CTO to system engineers, has access to the data they need, whenever they need it.\n\n\"We needed a solution to replace our current processes, provide us with insightful instrumentation, and increase collaboration across teams so that when network performance issues arise, they can be resolved faster than ever,\" explained Simon Fotakis, Global Network Operations Manager at THE NET-A-PORTER GROUP. \"It was crucial to deploy a solution that could provide us with a consolidated view, something that became evident from Riverbed's very successful proof-of-concept.\"\n\nRiverbed SteelCentral and the Riverbed Application Performance PlatformTM\n\nThe Riverbed SteelCentral product family is a performance management and control suite that combines user experience, application, and network performance management to provide the visibility needed to diagnose and cure issues before end users notice a problem, call the help desk, or jump to another web site out of frustration. Riverbed SteelCentral is part of the Riverbed Application Performance Platform„, a complete platform that gives CIOs end-to-end visibility, optimization and control across an entire enterprise. The Riverbed Professional Services team, with their extensive expertise in providing consulting services, is helping to roll out the solution for THE NET-A-PORTER GROUP.\n\nConnect with Riverbed\n\nFacebook\nLinkedIn\nRiverbed Blog\nRiverbed Community\nTwitter (@Riverbed)\nYouTube\nSlideShare\nGoogle \n\nAbout Riverbed \nRiverbed, at more than 1 billion in annual revenue, is the leader in Application Performance Infrastructure, delivering the most complete platform for the hybrid enterprise to ensure applications perform as expected, data is always available when needed, and performance issues can be proactively detected and resolved before impacting business performance. Riverbed enables hybrid enterprises to transform application performance into a competitive advantage by maximizing employee productivity and leveraging IT to create new forms of operational agility. Riverbed's 26,000 customers include 97% of the Fortune 100 and 98% of the Forbes Global 100. Learn more at www.riverbed.com.Riverbed and any Riverbed product or service name or logo used herein are trademarks of Riverbed Technology, Inc. All other trademarks used herein belong to their respective owners.About THE NET-A-PORTER GROUPTHE NET-A-PORTER GROUP has been creating the future of fashion since 2000. The pioneering multi-brand retailer, media and publishing group is constantly innovating to offer the best experience for its customers, its brand partners and its global monthly audience of 9 million luxury consumers. The Group encompasses NET-A-PORTER.COM, the world's premiere luxury fashion retailer, THE OUTNET.COM, the most fashionable fashion outlet, and MR PORTER.COM, the online destination for men's style. NET-A-PORTER powers three shoppable media platforms created to meet the needs of fashion consumers worldwide: the weekly digital magazine THE EDIT and PORTER Magazine, the game-changing global luxury fashion magazine, which combines the intimacy of print with a state-of-the-art digital shopping experience and The NET SET, the world's first shoppable social media platform. With a team of over 2,500 people across London, New York, Hong Kong and Shanghai, THE NET-A-PORTER GROUP champions innovation and offers an unparalleled experience for the global luxury fashion consumer with unique editorial content, translated and shoppable across multiple platforms, an authoritative multi-brand curation of the best fashion in the world, though partnerships with over 165 of the world's best fashion brands, same day delivery in Manhattan, London and Hong Kong, next day delivery to 172 countries across the globe, and dedicated 24 hour customer service.", "external_links": [], "published": "2015-07-22T03:00:00.000+03:00", "crawled": "2015-07-22T18:00:28.962+03:00", "highlightTitle": ""}