{"organizations": [], "uuid": "c4ed56d937152773bed4fece96b938a7fb33656e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/e/e/c/i/image.related.afrArticleLead.620x365.giciwr.png/1437096381522.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/opinion/david-brooks-why-hillary-clintons-biggovernment-economics-are-way-left-of-bills-20150717-giciwr", "country": "AU", "title": "David Brooks: Why Hillary Clinton's big-government economics are way left of Bill's", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "David Brooks: Why Hillary Clinton's big-government economics are way left of Bill's | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T09:26:00.000+03:00", "replies_count": 0, "uuid": "c4ed56d937152773bed4fece96b938a7fb33656e"}, "author": "David Brooks", "url": "http://www.afr.com/opinion/david-brooks-why-hillary-clintons-biggovernment-economics-are-way-left-of-bills-20150717-giciwr", "ord_in_thread": 0, "title": "David Brooks: Why Hillary Clinton's big-government economics are way left of Bill's", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hillary Clinton is proving to be conventionally left-wing and well to the left of husband Bill. Getty Images/AFP by David Brooks Well, Hillary Clinton hasn't gone crazy. At a time when some in her party are drifting toward Bernie Sanders/Occupy Wall Street-style rhetoric, Clinton delivered her first major economic address of the campaign. It was solidly liberal – very solidly – but in tone and substance it was well within the general election mainstream. If any Republicans were hoping that Clinton would make herself unelectable by wandering into the class warfare fever swamps, they can forget about it.\nThe main narrative of the Sanders camp is that the economic game is rigged against ordinary people. The top 1 per cent controls the fundamental economic conditions. Major transformation is required. There's not much individuals can do given the structure of economic power.\nClinton did some Wall Street bashing in this speech, but it was either meaningless, bland (punish criminals) or broadly sensible (end the carried interest deduction). The main underlying assumption behind her speech was that individuals can rise and succeed if they are given the right helping hand from government.\nThis speech revealed a woman who does not have her heart in class conflict. The most passionate parts of her speech involved classic liberal efforts to give people a boost: early childhood education, family and medical leave, tax credits for job training, affordable childcare programs.\nShe carefully avoided the more radical policy ideas embraced by the left, such as a blanket tax on the rich. She dodged the trade issue. She endorsed a minimum wage hike but didn't commit, as many progressive do, to a $US15 ($20)-an-hour rate.\nThis speech was more Children's Defense Fund than Thomas Piketty​. It was the sort of speech you give if you spend more time listening to voters, especially female ones, than studying the quintiles in the income distribution charts.\n'New paleoliberal' Stylistically, Clinton still sounds as if she is talking down to her audiences. But there was a wonky authenticity to this speech, which would not have been there if she had tried to sound like a pitchfork marauder. She has echoes of Hubert Humphrey or George McGovern in her voice, or a more liberal Michael Dukakis.\n She's way to the left of where her husband was and to the left of where Barack Obama was in 2008 or 2012. But she's responded to the reality of growing inequality with a revived paleoliberalism, not with the edgier, angry economic policy you find among Bernie Sanders and the cutting-edge left. She is best viewed, as the progressive commentator Matt Yglesias put it in a Vox essay, as a new paleoliberal .\nThis neopaleoliberalism is built less on going after Wall Street and the rich and more on a tremendous faith in government to manage the economy more intelligently than the private sector. It's less a negative assault on the elites and more an optimistic faith in the power of planning. The private sector is not evil or power-hungry, just kind of dumb.\nNew Democrats like her husband believed in using market mechanisms to increase economic security. As a neopaleoliberal, Hillary Clinton used her kickoff economic address to embrace the idea that government can write rules to govern how much companies pay their workers. Government can direct investors toward more sensible long-term investments. Government can refashion the way companies distribute equity in their companies. Government can determine how companies should structure and manage themselves.\n\"We'll ensure that no firm is too complex to manage and oversee,\" Clinton declared. One pictures squads of Federal Simplicity Enforcers roaming through the corridors of Midtown Manhattan telling CEOs when their outfits are too mind-boggling.\nIn each case, in this view, government is more competent at steering companies toward their own best interests than the companies are themselves. Clinton's constant refrain in this speech was that these federal interventions would increase growth and productivity, not limit them in the name of fairness.\nPersonally, I find this faith epistemologically naive. Clinton seems to have no awareness that many of the programs she endorsed have been tried and did not work. The Obama administration spent mightily on green energy jobs programs and they did not work to significantly increase employment. Empowerment zones, which she endorsed, have mostly failed to help low-income neighbourhoods. Clinton displayed no awareness that most federal requirements involve difficult trade-offs. According to the Congressional Budget Office, raising the minimum wage to even $US10.10 an hour would increase pay for millions of workers, but would cost roughly 500,000 jobs.\nClinton's unchastened faith in the power of government planning is not shared by most voters. And she has no plausible chance of getting any of this through a divided Congress. But this agenda does pull off a neat trick. It will excite the progressive base without automatically alienating the rest of the country. Substantively she's offered at least a coherent response to today's economic conditions. Politically, she's cleared the first political hurdle in this campaign.", "external_links": ["http://www.vox.com/2015/7/13/8940221/neo-paleo-liberalism"], "published": "2015-07-17T09:26:00.000+03:00", "crawled": "2015-07-17T05:58:33.000+03:00", "highlightTitle": ""}