{"organizations": ["GM Marine Engine Technology"], "uuid": "bf5b99460bf63d1ad8e4d79d359da30a17dad0bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125cnvo8k/*http://www.noodls.com/view/D0FF7C182779061126E635B4B7BAD585083FAFF1", "country": "GB", "title": "MasterCraft Welcomes GM Marine Engine Technology as Presenting Sponsor for the Inaugural MasterCraft Throwdown", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "MasterCraft Welcomes GM Marine Engine Technology as Presenting Sponsor for the Inaugural MasterCraft Throwdown", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T11:57:00.000+03:00", "replies_count": 0, "uuid": "bf5b99460bf63d1ad8e4d79d359da30a17dad0bc"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125cnvo8k/*http://www.noodls.com/view/D0FF7C182779061126E635B4B7BAD585083FAFF1", "ord_in_thread": 0, "title": "MasterCraft Welcomes GM Marine Engine Technology as Presenting Sponsor for the Inaugural MasterCraft Throwdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close MasterCraft Welcomes GM Marine Engine Technology as Presenting Sponsor for the Inaugural MasterCraft Throwdown \nVONORE, Tenn., July 28, 2015 (GLOBE NEWSWIRE) -- MasterCraft (NASDAQ:MCFT) has recruited the biggest names on the water today to compete in the inaugural MasterCraft Throwdown presented by GM Marine set to take place at Millennium Park in Grand Rapids, MI on August 8. MasterCraft is pleased to announce GM Marine Engine Technology as the presenting sponsor with additional sponsorship involvement from Ilmor Marine, Action Watersports, Ronix, Radar, CWB, Connelly, West Michigan Sports Commission and Spectrum Health, all together supporting these world-class athletes as they perform at the highest level. \nAll four of the official MasterCraft towboats will be outfitted with GM Marine engines marinized by Ilmor to ensure the utmost in performance and reliability as the impressive roster of professional athletes attempt to break world records and push the boundaries of the sport. General Motors has been at the forefront of marine engine design for over 40 years, introducing new technologies that have improved performance, fuel efficiency, durability and overall customer satisfaction. The same engine that powers GM's award-winning trucks and SUVs has been specialized to deliver unparalleled performance on the water. \nMasterCraft also enlisted Ilmor Marine, MasterCraft's exclusive marine engine supplier, as an official event sponsor given their proven record both on the track and on the water. With over 25 years of history in the racing world, and a well-earned reputation for winning, Ilmor's Indy-winning engines deliver unrivaled power, performance and reliability. The official MasterCraft towboats will be equipped with Ilmor 7.4L engines to boost athlete performance when it matters most. Ilmor also engineered a special performance motor for the MasterCraft ProStar boat that will be powering Freddy Krueger toward his world record skifly attempt. \n\"MasterCraft has a long history of progressing competitive watersports and the company's approach to hosting the MasterCraft Throwdown presented by GM Marine has really been quite simple - bring together the best of the best to ensure success,\" said Terry McNew, CEO and President of MasterCraft. \"That is why we joined forces with ESPN/World of X Games, the biggest name in action sports today, and invited the world's best riders to compete behind MasterCraft boats powered by GM Marine engines marinized by Ilmor Marine.\" \nOn the consumer-facing side of things, Action Watersports has also signed on as an official sponsor of the MasterCraft Throwdown presented by GM Marine. Voted one of the \"Top 100 Dealers in North America,\" Action Watersports has been serving Michigan's boating community for over twenty years and their high standard of customer service is evidence by their ranking as the number one MasterCraft dealer in the country. \nMasterCraft has also secured the sponsorship involvement of prominent wakeboard and waterski manufacturers including Ronix, Radar, CWB and Connelly. Each of these well-respected companies will have team riders showcasing their latest signature pro models during the competition with attendees able to purchase these products at the Action Watersports retail area. \nThe MasterCraft Throwdown presented by GM Marine will feature the best watersports athletes on the planet in head-to-head elimination heats all vying for the largest cash purse in the history of competitive wakeboarding as well as an attempt by long distance ski jumping legend Freddy Krueger to break the world skifly record of 299 feet. \nAction sports mastermind Gregg Godfrey will be producing the interactive, crowd-engaging event including zany antics such as waterslide \"slip 'n' fly\" stunts, hydroskimming motorcycles and general pandemonium. Wakeboarding legend Parks Bonifay will be emceeing the event and multi-platinum country music star Kip Moore will cap off the entertainment with a special guest performance. \nFor more details or to purchase tickets for the MasterCraft Throwdown presented by GM Marine, please visit www.mastercraftthrowdown.com . The spectator-friendly event is slated to take place at Millennium Park in Grand Rapids, MI on August 8 and will air live beginning at 2:30pm EDT on the World of X Games on ABC. \nAbout MCBC Holdings, Inc.: \nHeadquartered in Vonore, Tenn., MCBC Holdings, Inc. (NASDAQ:MCFT) is the parent of MasterCraft Boat Company, a world-renowned innovator, designer, manufacturer, and marketer of premium performance sport boats. Founded in 1968, MasterCraft has cultivated its iconic brand image through a rich history of industry-leading innovation, and more than four decades after the original MasterCraft made its debut the company's goal remains the same - to continue building the world's best ski, wakeboard and luxury performance powerboats. www.mastercraft.com . CONTACT: Media contact: Daniel Pistoresi // Dispatch 530.307.9839 // daniel@dispatchco.com MCBC Holdings, Inc.", "external_links": [], "published": "2015-07-29T11:57:00.000+03:00", "crawled": "2015-07-29T21:47:44.560+03:00", "highlightTitle": ""}