{"organizations": [], "uuid": "4c890fd79b3c59471253a799602081bd5d66d58e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/personal-finance.html", "section_title": "Personal Finance", "url": "https://www.prbuzz.com/personal-finance/335773-southwest-jewelry-buyers-receive-best-of-local-business-award-for-the-5th-time.html", "country": "US", "title": "Southwest Jewelry Buyers Receive Best of Local Business Award for the 5th Time!", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "Southwest Jewelry Buyers Receive Best of Local Business Award for the 5th Time!", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "4c890fd79b3c59471253a799602081bd5d66d58e"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/personal-finance/335773-southwest-jewelry-buyers-receive-best-of-local-business-award-for-the-5th-time.html", "ord_in_thread": 0, "title": "Southwest Jewelry Buyers Receive Best of Local Business Award for the 5th Time!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FOR IMMEDIATE RELEASE\nJuly 9th, 2015\nFor more information, contact:\nSouthwest Jewelry Buyers\n14300 N. Northsight Blvd. #127\nScottsdale, AZ 85260\n480-773-8004\nhttp://swjbuyers.com/\n(Scottsdale, Arizona) If you're looking to sell jewelry, Southwest Jewelry Buyers will offer the best prices in Scottsdale, Phoenix, and the surrounding Valley. They have just received The USCA \"Best of Local Business\" Award Program recognizes outstanding local businesses throughout the country. Each year, the USCA identifies companies that they believe have achieved exceptional marketing success in their local community and business category. These are local companies that enhance the positive image of small business through service to their customers and community. Nationwide, only 1 in 250 award recipients qualified as four-time Award Winners, and even less qualified as five. Various sources of information were gathered and analyzed to choose the winners in each category. The 2013 USCA Award Program focuses on quality, not quantity. Winners are determined based on the information gathered both internally by the USCA and data provided by third parties. They are the best. They will buy any unwanted jewelry no matter the type, style, size - even broken and damaged jewelry. With their international clientele and unlimited buying power, they can purchase even the largest of estates. Exchanging your jewelry is as easy as an appointment and an evaluation, then you'll receive an instant payment. The focal point of Southwest Jewelry Buyers service is to provide honest and ethical transactions, which is the reason they have been given an A+ rating and an accreditation by the Better Business Bureau. But not only is Southwest Jewelry Buyers focused on the paying the best prices for your jewelry, they want to make sure that you are comfortable with each transaction with them. They provide a discreet and upscale office environment to ensure that your experience is exceptional.\n###", "external_links": ["http://swjbuyers.com/"], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-10T04:49:34.000+03:00", "highlightTitle": ""}