{"organizations": [], "uuid": "c7482e8e5e5458d594ec7ecaa0204533811924ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/.icmUZ0llG_4a85X5xG4aQ--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/FIN_ANZ_AAP_ART_FTP_LIVE_1/2973980_29July_ANZ_1280x720_original.jpg", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/super-body-backs-anz-top-023005019.html", "country": "GB", "title": "Super body backs ANZ top-ups for women", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Super body backs ANZ top-ups for women", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T05:30:00.000+03:00", "replies_count": 0, "uuid": "c7482e8e5e5458d594ec7ecaa0204533811924ab"}, "author": "", "url": "https://au.finance.yahoo.com/news/super-body-backs-anz-top-023005019.html", "ord_in_thread": 0, "title": "Super body backs ANZ top-ups for women", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nThe body that represents Australia's superannuation industry has backed ANZ's move to top up super contributions for some female staff, but says more needs to be done. \nANZ will pay an extra $500 a year to female employees with less than $50,000 in their superannuation kitty in an attempt to close the gender gap in retirement savings. \nSuperannuation contributions on parental leave will also be paid by the bank for up to 24 months. \nThe Association of Superannuation Funds of Australia's chief executive Pauline Vamos welcomed the moves but said employers must address all the reasons why women often find themselves with a smaller retirement fund. \n\"There are many reasons why women do not have the same balances as men,\" she said. \n\"Proactive measures like increasing superannuation guarantee are one of the ways employers can help women besides paying them more. \n\"But this should not be the total solution.\" \nANZ announced the top-ups on Wednesday as it released a report which found women earn on average $700,000 less than men during their careers and are move likely to retire in poverty. \nThe ANZ Women's Report: Barriers to Achieving Gender Equity found that women working full time earn $15,000 a year less than men. \nThat translates to $700,000 over a typical 45-year career. \nWomen are also more likely to end their careers with, on average, around half as much superannuation as men and to be 15 per cent more likely to experience poverty in retirement. \nThat's despite women between the ages of 25 to 29 being more likely to hold a university degree. \n\"They are paid less for the same work and they often revert to part-time jobs to assume child rearing or family responsibilities at some point,\" the report said. \nANZ secured a special 10-year exemption from NSW anti-discrimination laws so it could provide the top-up super payments to some of its female employees. \nThe Australian Human Rights Commission and Sex Discrimination Act also provide for special measures and exemptions. \nANZ boss Mike Smith said the bank was committed to pay equality for women as part of a gender equality agenda that includes equal representation for women in senior leadership roles. \n\"Much more still needs to be done though to achieve full gender equality in the workplace and, while we recognise we're not there yet, today's announcement is about rethinking how we address the imbalances women face in the workplace and in retirement,\" he said. \nThe Greens applauded ANZ's move, but are calling for an inquiry into inequality in women's superannuation savings. \nGreens workplace spokesman Adam Bandt said the party would move for a Senate inquiry into their bill to boost superannuation for women, to investigate the problem of women retiring without enough money. \nBARRIERS TO FINANCIAL GENDER EQUALITY \n* Women make up 35pct of the full-time workforce \n* Women's pay packets are an average 18.8pct less than men \n* Female uni graduates earn on average $3,000 less a year \n* Women spend almost twice as much time on unpaid work \n* Just 20.4pct of ASX 200 board members are female \n* 90pct of women will retire with inadequate savings \n* One-in-five women yet to retire have no superannuation \n(Source: ANZ Women's Report)", "external_links": [], "published": "2015-07-29T05:30:00.000+03:00", "crawled": "2015-07-29T05:49:29.176+03:00", "highlightTitle": ""}