{"organizations": [], "uuid": "d500d07a40a6bd458f5ee5ee289e8262aa5ced18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businessandfinance.com", "main_image": "http://businessandfinance.com/wp-content/uploads/2015/07/DNA-integrative-copy.jpg", "site_section": "http://businessandfinance.com/feed/", "section_title": "Business & Finance", "url": "http://businessandfinance.com/evolving-endeavors/", "country": "GB", "title": "Evolving endeavors", "performance_score": 0, "site": "businessandfinance.com", "participants_count": 1, "title_full": "Evolving endeavors", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T17:24:00.000+03:00", "replies_count": 0, "uuid": "d500d07a40a6bd458f5ee5ee289e8262aa5ced18"}, "author": "Business and Finance", "url": "http://businessandfinance.com/evolving-endeavors/", "ord_in_thread": 0, "title": "Evolving endeavors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 Life sciences and energy | Thu 23 Jul | Author – Business and Finance Enterprise Ireland has been to the fore in establishing and growing a vibrant life sciences industry across the country, explains Tom Kelly. \nIreland took its first steps towards establishing what is now its thriving life sciences sector in the 1960s. Early activity was focused on simple processes such as active ingredient manufacturing and quality assurance. \nToday, this highly evolved sector is a global leader in the development of complex biopharma and medical technology products with a skilled manufacturing base and specialist R&D infrastructure supporting it. \nBetween them, collaborative clusters in pharmaceuticals, biotechnology, medical devices and diagnostics employ around 50,000 people in Ireland and generated export sales of €43bn in 2013. \nOver the last decade the international bio pharmaceuticals industry has invested in the order of $8bn in Ireland – one of the biggest investments in biotech facilities worldwide. Success in the sector has been underpinned by world-leading manufacturing excellence and the number of world-leading biotech plants operating here has grown from two sites in 2003 to 10 in 2013. \nIreland is now one of Europe’s largest medtech hubs and is recognised as an international centre of excellence. There are over 350 Irish and international companies operating in the sector here, including 13 of the top 15 global players. \nEmployment at medtech companies currently stands at over 25,000 people, while annual exports of medical devices and diagnostic products are valued at approximately €8bn. \nSignificant Government funding, channelled through Enterprise Ireland, has supported the development of the broad life sciences sector here at both industry and academic levels. In addition, multi-disciplinary industry-academic collaborations have ensured that the expertise, skills and capabilities of the academic community are leveraged to best advantage by the sector, further driving research and innovation capabilities across the country. \nAlso supporting growth is Ireland’s exemplary compliance record. “There are around 250 life sciences companies that fall within the remit of Enterprise Ireland. This covers small and emerging companies right up to the biggest players in the sector,” Tom Kelly, divisional manager for Industrial, Life Sciences and Consumer at Enterprise Ireland explains. \n“The development within the sector as a whole has been quite remarkable and it is reaching a point where innovation in product development and design, coupled with innovation in management, are becoming increasingly important. We are already very good at what we do. Now the challenge is how to do it even better. This is where initiatives such as our Innovation for Growth programme, where the focus is on developing strategic skills and on developing and selecting ideas with commercial potential, are bearing fruit,” Kelly says. Leadership and increasing ambition are also key elements of the programme. \nIreland’s researchers and companies have been successful in winning €97m of funding through Horizon 2020 \nHaving a large multinational presence in Ireland over many decades has also been important. “It has helped to build skills, expertise and management capability and as a result we now have a strong indigenous base in the sector. We have also seen an evolution among Irish-owned companies that have turned their expertise in precision engineering, for example, towards medical device manufacturing in their own right with great success,” Kelly notes. \n“In addition we have a thriving sub-supplier base supporting the life sciences community here and are working with them to ensure that they remain competitive, innovative and a world class source of whatever local and multinational companies need.” \nKelly says there are also initiatives in place that focus on making the sector as lean as possible in order to improve international competitiveness while maintaining and strengthening the links between industry and the academic community is an ongoing process. \n“The real drive is to move beyond pure research and to build relationships between academia, clinicians and the business community,” he says. “We see evidence of this in expert facilities such as the polymers centre at Athlone IT or the SEAM Centre at Waterford IT. In addition, the Technology Centres in conjunction with Knowledge Transfer Ireland are working to maximise outcomes related to State-funded technology.” \nDRIVING INNOVATION \nKnowledge Transfer Ireland (KTI) works with business, investors, universities, Institutes of Technology, State research organisations, research funders and government agencies to maximise State-funded technology, ideas and expertise getting into the hands of business to drive innovation. \nSo far, Ireland’s researchers and companies have been successful in winning €97m of funding in the first nine months of Horizon 2020, performing well in areas such as ICT and research fellowships. In these areas, Ireland’s researchers have been awarded over €24m and €13m respectively. Ireland has also been very successful in the agri-food (€11m) and health (€10m) areas. Equally, Ireland’s success in competing for European Research Council (ERC) grants under Horizon 2020 has significantly exceeded our performance in previous programmes with funding to ERC grantees in Horizon 2020 reaching over €19m so far. \nEnterprise Ireland CEO, Julie Sinnamon said these results from the EU Commission show that Irish SMEs continue to shine in Europe. \n“We are particularly interested to see our high potential start-ups and established companies with disruptive technologies reaping the rewards of the new SME focused programmes. These programmes offer new and different opportunities to those in previous framework programmes, and are at a scale suited to real impact on company development,” Sinnamon concludes. MED IN IRELAND \nIreland’s largest international medical technologies event, Med in Ireland , takes place on October 29th 2015 at the National Convention Centre in Dublin. \nThis high-profile event, which is coordinated by Enterprise Ireland, will showcase a diversity of companies from the medical technologies sector, device manufacturing and sub-supply to diagnostics, connected health and precision engineered components. The event will be attended by senior executives from the healthcare, medical affairs and regulatory sectors as well as business development executives, investor groups, clinicians and research and development professionals. \nBuyers from medical technology companies from around the world will also attend including representatives from the top 10 global producers whose purchasing power accounts for around 50% of the total global spend on medical technologies. \nFor more information, w: medinireland.ie CLINICAL INNOVATION AWARD \nOne of the highlights of the Med in Ireland event will be the presentation of the 2015 Enterprise Ireland Clinical Innovation Award, in association with the world-leading Cleveland Clinic in Ohio, USA. The award recognises commercial potential in Ireland’s clinical community and is designed to encourage clinicians to engage in the development of new healthcare products and services to improve patient care and benefit through the healthcare system and Ireland’s medical technology companies. \nThe 2014 award was won by Galway-based GP Dr Cliona Murphy who has developed a device that can greatly improve patient outcomes in complex vascular surgery. The Clinical Innovation Award is now in its fifth year and winners get the opportunity to develop the commercial potential of their idea with the assistance of Enterprise Ireland and the Cleveland Clinic. DESIGNED FOR LIFE \nNot surprisingly, given that 2015 has been officially designated the Irish Year of Design, the medical technologies industry will receive a particular focus at Med in Ireland. \nRenowned design director at the Centre for Innovation, Mayo Clinic, Lorna Ross will chair a session on design and will be available to meet companies during the conference and exhibition. Sean Hughes, chief design officer at Phillips Design Healthcare will also be among the presenters.", "external_links": [], "published": "2015-07-23T17:24:00.000+03:00", "crawled": "2015-07-24T12:16:28.288+03:00", "highlightTitle": ""}