{"organizations": [], "uuid": "41995fb8d64b69176e19876912a0ee19cc3ea0b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/9/s/3/6/image.related.afrArticleLead.620x365.gho2ca.png/1437358023125.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/how-a-music-industry-legend-invests-20150720-gho2ca", "country": "AU", "title": "How a music industry legend invests", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How a music industry legend invests | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T10:07:00.000+03:00", "replies_count": 0, "uuid": "41995fb8d64b69176e19876912a0ee19cc3ea0b6"}, "author": "Sue Hoban", "url": "http://www.afr.com/personal-finance/how-a-music-industry-legend-invests-20150720-gho2ca", "ord_in_thread": 0, "title": "How a music industry legend invests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michael Gudinski Jesse Marlow by Sue Hoban Music mogul Michael Gudinski is in a hurry; already running late for an appointment. But he's probably always in a hurry. He may have been at the epicentre of the Australian music industry for more than 40 years, but the pace at which he runs his many-tentacled business and hurtles around the world seems as frenetic as ever.\nIf anything Gudinski, at 64, has been reenergised. His children have now joined the family firm, ensuring the company will survive him (\"something I feel very lucky about\"). And his pet division – Frontier Touring – is having its best year on record.\nGudinski, the son of Russian post-war immigrants, has built his Mushroom Group into one of the world's largest independent music empires, encompassing 20 businesses across the full spectrum of industry activity – booking agencies, publishing, recording, touring and merchandising. He even has a film production business.\nPerhaps unsurprisingly, then, he likes to keep his personal investment activity as straightforward as possible. \"Being an entrepreneur and being involved in such a competitive and a very high-risk business, I've made sure I'm pretty conservative in my investments outside of it,\" he says.\n\"For someone who has been pretty wild in business, I have kept it very non-speculative.\" Gudinski admits some of that conservatism can be traced to early financial struggles, including the collapse of one of his companies in the 1970s. \"In a way I felt lucky that it happened to me early on because it made me realise, no matter how hip or cool you are, if you can't pay your bills you've got no business.\"\nThose financial struggles ended when he sold 49 per cent of his flagship Mushroom Records label to Rupert Murdoch's News Corporation in 1993 and the remainder five years later for a reported $40 million. \"When I did the final part of the deal the bank manager wrote on the bottom of the bank statement, 'Well done Michael' and it was a great feeling to know that I was then in full control of my own destiny.\"\nGudinski says he has relied on the same two trusted financial advisers since he started in business and is content with a portfolio dominated by property. \"It's mostly real estate,\" he says. \"I have done a couple of developments – I developed two of the original Mushroom buildings into apartments. There are some blue-chip share investments but, apart from that, we've stuck to buying and investing in companies in the entertainment business because that's what I know.\"\n ", "external_links": [], "published": "2015-07-20T10:07:00.000+03:00", "crawled": "2015-07-20T23:08:09.175+03:00", "highlightTitle": ""}