{"organizations": [], "uuid": "7151bc1528da94f27abbda4875beaff4af29da32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources1.news.com.au/images/2015/07/29/1227462/315057-70c6f7fc-35d5-11e5-a34b-af8954b82b5f.jpg", "site_section": "http://www.adelaidenow.com.au//business", "section_title": "Business News | Business and Finance News | The Advertiser", "url": "http://www.adelaidenow.com.au/business/amp-drops-home-loan-bombshell/story-fnmxznqb-1227462314560", "country": "US", "title": "AMP drops home loan bombshell | Business News | Business and Finance News | |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 2, "title_full": "AMP drops home loan bombshell | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T04:30:00.000+03:00", "replies_count": 1, "uuid": "0932cb081f862decc8736eb62c6f6ca95a893bb0"}, "author": "Jeff Whalley", "url": "http://www.adelaidenow.com.au/business/amp-drops-home-loan-bombshell/story-fnmxznqb-1227462314560#post-0", "ord_in_thread": 0, "title": "AMP drops home loan bombshell | Business News | Business and Finance News | |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AMP will slam the door on would-be property investors in the most drastic response yet to the banking regulator’s quest to take heat out of the housing market.\nThe wealth manager announced it would cease lending to investment property buyers for at least the next few months. And it will jack up rates for its existing investment home-loan customers — far beyond rate rises announced by several of the major banks in recent days.\nThe group’s banking division, AMP Bank, will hike its variable investment home loan rate by 0.47 percentage points on September 7.\nThat will add about $1000 a year to repayments on a $300,000 mortgage.\nAll investment home loans already approved would be subjected to the 0.47 percentage point increase on settlement, the group said.\nIt is the boldest move yet by a lender, and far outstrips the 0.27 percentage point increase announced last week by the Commonwealth Bank and ANZ. The rise is well above the 0.29 percentage point hike announced by NAB on Monday for all of its interest-only variable home loans — a product favoured by investors.\nAnnouncing its move on Wednesday, AMP would not definitively say when the moratorium on new investment property loans would end. It said it was expected to continue until “later in 2015”, but this depended “on market conditions”.\nAMP — a heavyweight in wealth management — accounts for only a small share of the mortgage market at 1 per cent, with about 100,000 home-loan customers.\nBut the decision reflected the intensity of the push by the banking regulator to rein in the investment property market, analysts said.\nAMP’s investment home-loan book is worth about $3 billion, according to the Australian Prudential Regulation Authority.\nThe watchdog has told the banks it wants lending to property investors to grow at an annual clip of no more than 10 per cent. AMP’s investment home-loan book was growing at a rate of more than 13 per cent.\n“We appreciate the position this puts our customers in and will be working with our distribution network to actively communicate with them,” AMP Bank managing director Michael Lawrence said. The group has cut interest rates on some owner-occupier home loans to 4.12 per cent.\n“Australia’s property market is experiencing high levels of investor property lending growth and we are supportive of the regulator’s intention to slow this growth to appropriate levels,” Mr Lawrence said.\nAMP shares rallied 2 per cent on Wednesday to $6.52.\njeff.whalley@news.com.au\nOriginally published as AMP drops home loan bombshell", "external_links": ["http://www.heraldsun.com.au/business/amp-drops-home-loan-bombshell/story-fni0dcne-1227462314560"], "published": "2015-07-30T04:30:00.000+03:00", "crawled": "2015-07-29T18:56:23.143+03:00", "highlightTitle": ""}