{"organizations": [], "uuid": "253a3b17b2a376a4c18260b61da38b916a2074fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-28/brevan-howard-economist-vlieghe-joins-boe-rate-setting-panel", "country": "US", "title": "Brevan Howard Economist Vlieghe Joins BOE Rate-Setting Panel", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Brevan Howard Economist Vlieghe Joins BOE Rate-Setting Panel - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T16:57:00.000+03:00", "replies_count": 0, "uuid": "253a3b17b2a376a4c18260b61da38b916a2074fc"}, "author": "Fergal O'Brien", "url": "http://www.bloomberg.com/news/articles/2015-07-28/brevan-howard-economist-vlieghe-joins-boe-rate-setting-panel", "ord_in_thread": 0, "title": "Brevan Howard Economist Vlieghe Joins BOE Rate-Setting Panel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gertjan Vlieghe, an economist at Brevan Howard Asset Management, was appointed to the Bank of England’s Monetary Policy Committee, bolstering the panel’s knowledge of financial markets as it nears its first interest-rate increase in eight years.\nChancellor of the Exchequer George Osborne announced the appointment on Tuesday, saying Vlieghe is an economist of “outstanding ability.” BOE Governor Mark Carney endorsed that view, saying his “insight, judgment and perspective will be invaluable to the committee in the coming years.”\nVlieghe, who will replace David Miles, joins at a crucial time for policy at the U.K. central bank. Carney and Miles both said this month that the time to begin tightening is drawing closer, prompting investors to shift bets on when the BOE will start lifting its benchmark rate from a record-low 0.5 percent.\nVlieghe will be one of four so-called external members of the MPC who serve in a part-time capacity. His appointment means Osborne is replacing one MPC member with finance and markets experience with another. Miles previously worked at Morgan Stanley.\n“Monetary policy plays a critical role in our long term economic plan, delivering economic security to working people,” Osborne said. “Dr. Vlieghe is an economist of outstanding ability who brings experience from his time at both the Bank of England and the financial services industry to the role and will be a strong addition to the MPC.”", "external_links": [], "published": "2015-07-28T16:57:00.000+03:00", "crawled": "2015-07-28T12:15:11.553+03:00", "highlightTitle": ""}