{"organizations": [], "uuid": "ef287dda944f1b641e949d6e28277a42198dbefb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/6/y/6/f/image.related.afrArticleLead.620x365.gig7xt.png/1437383715243.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/industrial-relations/liars-and-thugs-in-union-block-work-from-builder-20150720-gig7xt", "country": "AU", "title": "'Liars and thugs' in union block work from builder", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "'Liars and thugs' in union block work from builder | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T17:15:00.000+03:00", "replies_count": 0, "uuid": "ef287dda944f1b641e949d6e28277a42198dbefb"}, "author": "Lucille Keen", "url": "http://www.afr.com/news/policy/industrial-relations/liars-and-thugs-in-union-block-work-from-builder-20150720-gig7xt", "ord_in_thread": 0, "title": "'Liars and thugs' in union block work from builder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A Canberra builder has claimed he missed out on work because he refused to pay bribes to union. Luis Ascui by Lucille Keen A Canberra building company that refused to sign a collective workplace agreement and pay what its owner regarded as bribes to the militant construction union because it is run by \"liars, thugs and not worried about safety\" missed out on contracts, a hearing has heard.\nClaw Constructions owner Troy Armstrong told the Royal Commission into Trade Union Governance and Corruption that the Construction, Forestry, Mining and Energy Union wanted him to agree to pay labourers up to $90,000 a year.\nMr Armstrong said during a meeting between him and union official \"Tony\" at a McDonald's in the Canberra suburb of Fyshwick, he was told if he signed a workplace agreement the union would guarantee building contracts.\nHe claimed he was told if he made donations or paid memberships to the CFMEU it would also help him secure work.\n\"All I see the CFMEU pushing upon me is money, money, money and memberships,\" Mr Armstrong said.\n\"I felt put into a corner. As a result of not signing EBAs … I believe I have missed out on a number of jobs and have been subjected to an unfair level of scrutiny on sites as payback. I never want to sign an EBA with the CFMEU or anything else because they are liars, thugs and not worried about safety. They just use the safety as a method of blackmailing business and people to sign up with them.\"\nMr Armstrong claimed the union official told him he must pay employees' superannuation into Cbus, despite the business owner informing him by law the money could be paid into any fund nominated by the employee.\n\"He definitely threatened to kick me off sites if I did not sign an EBA,\" Mr Armstrong told the hearing in Canberra on Monday.\n Shed didn't have microwave Days after the meeting Mr Armstrong claims the CFMEU visited a construction site and claimed there were a number of problems at the site, including that the site shed did not have a microwave oven.\nHe claimed he was also told by another company that they had been told by the CFMEU to kick him off a site in the suburb of Mitchell and that the union had stopped the pouring of concrete at another site in which it was working as a subcontractor to Claxton Constructions.\nClaxton Construction site supervisor Robert Rossi told the hearing a \"big Maori fella\" was among senior union officials who intimidated a WorkSafe ACT officer into shutting down a building site.\nMr Rossi said the union officials arrive unannounced, claiming they had safety concerns about the site. \"Then I saw the big Maori fella grab hold of a handrail and start shaking it with all his might,\" Mr Rossi said.\nLast week a f ormer organiser for the construction union and a Labor Party branch president , Halafihi \"Fihi\" Kivalu, was arrested in Canberra after it was revealed in the commission that he allegedly extorted more than $150,000 from a building company.\nClaxton Construction owner Zoran Stojanovic, who claims he was \"proud\" to be a former member of the Builders Labourers Federation, told the hearing he could not believe how the union officials acted.\nHe claimed Mr Kivalu told him to work with the union otherwise he'd make \"hell\" for him.", "external_links": [], "published": "2015-07-20T17:15:00.000+03:00", "crawled": "2015-07-20T23:04:41.742+03:00", "highlightTitle": ""}