{"organizations": ["FinTech Sandbox"], "uuid": "9b076c6a762ff73d4fb9b4d64bf5c8a5203e942d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/fintech/wp-content/uploads/sites/10/2015/07/Barchart-Earth-Quaking-Text-Effect.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/fintech/news/barchart-joins-list-of-fintech-sandbox-as-market-data-provider/", "country": "US", "title": "Barchart Joins List of FinTech Sandbox as Market Data Provider", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Barchart Joins List of FinTech Sandbox as Market Data Provider", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T19:56:00.000+03:00", "replies_count": 0, "uuid": "9b076c6a762ff73d4fb9b4d64bf5c8a5203e942d"}, "author": "", "url": "http://www.financemagnates.com/fintech/news/barchart-joins-list-of-fintech-sandbox-as-market-data-provider/", "ord_in_thread": 0, "title": "Barchart Joins List of FinTech Sandbox as Market Data Provider", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Barchart Joins List of FinTech Sandbox as Market Data Provider Barchart Joins List of FinTech Sandbox as Market Data Provider Joining the FinTech Sandbox, Barchart will be providing their market data such as news, historical pricing, APIs, and end of day feeds. Advertising Print This Post \nStartups accepted to the FinTech Sandbox program gained a new market data vendor to tap into their resources, as Barchart has joined as a partner. A non-profit organization, FinTech Sandbox is a consortium of financial and technology companies that provide subsidized or free services to fintech startups that are accepted into the program. \nJoining the FinTech Sandbox, Barchart will be providing their market data services to startups in the program. Included in their list of services being offered are news and fundamental data, historical pricing, APIs, and end of day feeds for stocks, indices, futures and forex instruments. Due to the costs involved with sourcing market data, for startups, they benefit by being able to gain access to market feeds and historical prices as they are developing and first scaling their financial products. \nAs part of FinTech Sandbox, Barchart joins other market data providers such as Xignite, Thomson Reuters and Six Financial Solutions. Mark Haraburda, Managing Director at Barchart commented about joining as he stated “Collaborating with FinTech Sandbox is an exciting step in helping start-ups acquire the data they need to develop their products and services”. Got a news tip? Let Us Know FOUND A MISTAKE How do you feel about the article? Educated 0", "external_links": [], "published": "2015-07-20T19:56:00.000+03:00", "crawled": "2015-07-20T17:10:33.913+03:00", "highlightTitle": ""}