{"organizations": [], "uuid": "a219c4397aad02ad2054aae4fedbea0cbb0b6e2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/nifty-sensex-bank-nifty-rising-on-lower-volumes---thursday-closing-report/42795.html", "country": "IN", "title": "Nifty, Sensex, Bank Nifty rising on lower volumes - Thursday closing report", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Nifty, Sensex, Bank Nifty rising on lower volumes - Thursday closing report", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T17:21:00.000+03:00", "replies_count": 0, "uuid": "a219c4397aad02ad2054aae4fedbea0cbb0b6e2d"}, "author": "Moneylife Digital Team &amp; IANS", "url": "http://www.moneylife.in/article/nifty-sensex-bank-nifty-rising-on-lower-volumes---thursday-closing-report/42795.html", "ord_in_thread": 0, "title": "Nifty, Sensex, Bank Nifty rising on lower volumes - Thursday closing report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Nifty, Sensex, Bank Nifty rising on lower volumes - Thursday closing report 42795 Nifty, Sensex, Bank Nifty rising on lower volumes - Thursday closing report 0 Comments, Be the first to comment Moneylife Digital Team & IANS | 16/07/2015 07:51 PM | The first sign of weakness in Nifty will be a close below 8,550 We had mentioned in Wednesday’s closing report that the NSE’s CNX Nifty uptrend will remain intact until it closes below 8,450. The uptrend continued in Thursday’s trading in the Indian stock markets to record healthy gains across major indices. Positive global and domestic cues lifted investors' sentiments, which helped in sustaining the momentum to the ongoing rally in the Indian equity markets, with a barometer index gaining more than 247 points on Thursday. The 30-scrip S&P BSE Sensex closed Thursday with gains of more than 247 points or 0.88% during day's trade. The wider 50-scrip Nifty also made gains during the day's trade. It closed 84.25 points or 0.99% up at 8,608.05 points. The S&P BSE Sensex, which opened at 28,259.70 points, closed at 28,446.12 points, up 247.83 points or 0.88% from the previous day's close at 28,198.29 points. The Sensex touched a high of 28,478.43 points and a low of 28,245.81 points in the intra-day trade. Markets analysts tracking the day's trade said the exchanges opened on \"a quiet note\" but later traded higher on easing of the concerns over Greece debt crisis. The market participants were also enthused by the announcement of diesel and petrol rate cut announced on Wednesday, analysts said. On Wednesday, Greece legislators passed various austerity laws aimed at paving the way for a European Union (EU) backed bailout package. Investor-anxiety over the US rate hike was also calmed after the initial comments made during the US Fed chairman's testimony to the US Congress suggested a delay in the decision. Investors are also hopeful of a lending rate cut by the RBI in its upcoming monetary policy review in August. Industry insiders expect oil prices to plunge as and when Iran resumes exporting oil at the pre-sanction levels. The west Asian state is believed to have around 25-30 million barrels of oil ready for export. After Tuesday's massive volatility, Brent index stood at $57 and the West Texas Intermediate (WTI) at $52 per barrel on Thursday. WTI had fallen to $44 per barrel on Tuesday. The Indian Government's approval on composite FDI (Foreign Direct Investment) cap resulting in more capital flowing into the system lifted the sentiment. The union cabinet has approved for composite cap for foreign investments in a company. This will remove the distinction between FPI (Foreign Portfolio Investor), FDI and NRI (Non Resident Indian) investments. The decision assumes significance as it can benefit companies, especially private banks, which have separate caps for FII (Foreign Institutional Investor) within the total foreign investment limit. During Thursday's trade, all of the 12 sector-based indices of the S&P BSE closed higher. The S&P BSE bank index soared by 411.26 points, the consumer durables index jumped by 221.16 points, capital goods index was higher by 121.34 points, healthcare index augmented by 185.81 points and the oil and gas index rose by 100.20 points. The major Sensex gainers during Thursday's trade were: Axis Bank, up 4.14% at Rs.608.75; BHEL, up 2.36% at Rs.279.75; HDFC, up 1.62% at Rs.1,362.50; HDFC Bank, up 1.54% at Rs.1,113.55; and Cipla, up 1.43% at Rs.679.45. The major Sensex losers were: Vedanta, down 1.17 percent at Rs.143.70; Mahindra and Mahindra (M&M), down 0.91% at Rs.1,276.05, Wipro, down 0.80% at Rs.573.25, Hero MotoCorp, down 0.38% at Rs.2,650 and Gail, down 0.37% at Rs.372.75. Among the Asian markets, Japan's Nikkei was up by 0.67%, China's Shanghai Composite Index rose by 0.31%, and Hong Kong's Hang Seng gained by 0.43%. In Europe, the London FTSE 100 index was up by 0.56%, the French CAC 40 was higher by 1.61%, and Germany's DAX Index gained by 1.62% at the closing bell here. The closing prices of shares that have been top gainers and losers in the major indices are given in the table below: The closing values of major Asian indices are given in the table below: Among European indices, DAX was at 11,711.12, up 1.76% and FTSE 100 was at 6,782.71, up 0.52%. More in Moneylife", "external_links": [], "published": "2015-07-16T17:21:00.000+03:00", "crawled": "2015-07-16T18:22:09.000+03:00", "highlightTitle": ""}