{"organizations": [], "uuid": "74c2e01da497324ebe862bcf5f22e63a5d650824", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/5/h/x/p/image.related.afrArticleLead.620x365.gi5cl0.png/1436088557772.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/tourism/ski-fields-make-the-most-of-the-lower-dollar-20150705-gi5cl0", "country": "AU", "title": "Ski fields make the most of the lower dollar", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Ski fields make the most of the lower dollar | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T13:53:00.000+03:00", "replies_count": 0, "uuid": "74c2e01da497324ebe862bcf5f22e63a5d650824"}, "author": "Lucille Keen", "url": "http://www.afr.com/business/tourism/ski-fields-make-the-most-of-the-lower-dollar-20150705-gi5cl0", "ord_in_thread": 0, "title": "Ski fields make the most of the lower dollar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Occupancy rates are up at Mt Hotham, with the Australian dollar and snow falling. Supplied by Lucille Keen Australian ski fields are making the most of the fall in the dollar, which has pushed occupancy rates at some resorts to a two-year high.\nAt Victoria's Mt Hotham, spokesman Michael Belfrage said the lower dollar was helping, as was the increasing popularity of skiing among families and large groups. The unpredictable weather was also helping.\n\"Also, there is the fact that people who've travelled to ski overseas in recent years, like New Zealand in the last few seasons, or North America this year, have learned that the snow can be just as unpredictable anywhere,\" Mr Belfrage said.\nHeading into the second week of Victorian school holidays, Mr Belfrage said it had been a cold start to the season, with a mix of natural and man-made snow.\n\"The snowmakers have done an amazing job and our investment in snowmaking infrastructure over the summer has allowed us to open much more terrain than we would have been able to open with this much snow in previous seasons,\" he said.\nVictorian resorts are expected to get more snow this week, with falls on Monday and then from Wednesday to Saturday.\nAcross the mountain range at Falls Creek snowmaking is in full swing, with five of the 14 lifts open.\nOver the border in NSW, Thredbo and Perisher are expected to get more snow towards the end of the week, with the front expected to cause a drop on Thursday to Saturday.\n Last Tuesday Vail Resorts closed on its purchase of Perisher Ski Resort, which was announced in March.\nPerisher sales and marketing manager Richard Phillips said he was pleased with visitor numbers given the conditions and it being relatively early in the season.\nHe expected snow over the next week would improve conditions greatly.\n\"Since 2011 the resort offers guests the chance to buy a Perisher Freedom Pass, which offers unlimited lift access throughout the Australian winter season,\" Mr Phillips said.\n\"However, this year, since the acquisition of the resort by Vail Resorts, the Freedom Pass includes Epic Benefits. The Epic Benefits component of the pass allows access to nine world-class ski resorts in the US, including Vail, Breckenridge and Park City, also owned by the company.\"\nMr Phillips said Perisher was pleased with sales in 2015 and he was confident that with the extra value added, Perisher Freedom Pass holders would look to take the opportunity to ski and board in Vail Resorts' US resorts during the northern hemisphere ski season, which starts in November.\nAnd for ski bunnies heading overseas, Flight Centre has had an increase of ski packages to its New Zealand bookings.\nFlight Centre spokeswoman Kellie Carty said ski packages were the most popular \"add-on\" to bookings made for Queenstown.\n\"And 35 per cent of all ski packages sold are for travel during the school holidays, both June/July, as well as projecting forward to the September school holidays,\" Ms Carty said.", "external_links": [], "published": "2015-07-05T13:53:00.000+03:00", "crawled": "2015-07-05T18:05:26.000+03:00", "highlightTitle": ""}