{"organizations": [], "uuid": "c6c47623214c4faa6f8caf23a5d549e79aed531b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/d/6/w/0/image.related.afrArticleLead.620x365.gid4au.png/1436959632118.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/chanticleer/perpetual-fund-outflows-a-sign-of-the-times-20150715-gid4au", "country": "AU", "title": "Perpetual fund outflows a sign of the times", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Perpetual fund outflows a sign of the times | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T18:13:00.000+03:00", "replies_count": 0, "uuid": "c6c47623214c4faa6f8caf23a5d549e79aed531b"}, "author": "Tony Boyd", "url": "http://www.afr.com/brand/chanticleer/perpetual-fund-outflows-a-sign-of-the-times-20150715-gid4au", "ord_in_thread": 0, "title": "Perpetual fund outflows a sign of the times", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Geoff Lloyd has the right ingredients in place for Perpetual success. David Rowe Share on twitter by Tony Boyd Geoff Lloyd did a sterling job stabilising Perpetual but he must move faster to lift the group's international assets under management or risk a downward re-rating of the company's shares.\nLloyd's recovery strategy for Perpetual, called T15, ended at June 30 leaving open questions about how the company will grow its earnings and protect its shareholders from significant structural changes in the local funds management industry.\nAustralia's compulsory superannuation savings system is growing at a pace that will create a savings pool that dwarfs the local equity market. That is already forcing local investors to seek alternative places to invest to provide diversity and lower the volatility of returns.\nInstitutional and retail investors are reassessing the wisdom of having a heavy exposure to the Australian market, which is heavily concentrated in resources and banks.\nThose who made the change a year ago and shifted their flow of super savings into international shares have already seen the benefits of overseas diversification.\nInternational shares topped the performance league tables for various long-term asset classes over one year and three years, according to data from Morningstar.\nInternational equities returned 25 per cent over one year compared with 5.7 per cent for Australian equities, 20 per cent for real estate investment trusts, 16.9 per cent for emerging markets and 5.6 per cent for Australian fixed interest.\nAnecdotal evidence over the past couple of months about big reductions in the amount invested in Australian equities was given factual basis on Wednesday with the release of Perpetual's quarterly funds under management .\n Perpetual reported net outflows of $1.6 billion in the June quarter including $1.4 billion from the Australian equities institutional business.\nLloyd says these outflows had nothing to do with the switch in Perpetual's head of Australian equities from Matt Williams to Paul Skamvougeras earlier this year.\nBut even companies with strict and long-standing investment processes can lose money because of a change in personalities at the wheel.\nJohn Sevior's departure several years ago had an impact on funds under management despite the fact that he gave the company significant warning of his departure.\nLloyd says the company did not lose any customers or mandates during the June quarter. Also, the company had seven consecutive quarters of positive inflows before the latest result.\nIt can not have helped that Perpetual's flagship Australian Share Fund was ranked 92 out of about 100 long only funds in the year to June, according to the Mercer Investment Surveys.\nThe fund's performance is much better over three years with a ranking of 50 but you have to go out to five years to beat the index benchmark return.\nPerpetual relies on funds management for 70 per cent of its earnings. That explains why Lloyd has to lift the funds under management in the fast-growing overseas shares segment as quickly as possible.\nThe right ingredients He has the right ingredients in place for success including a top-performing fund manager in Garry Laurence, who has been managing the Global Share Fund since January 2011.\nBut Laurence only has $700 million in funds under management, the majority of which was seeded from existing funds under management.\nInternational funds management has been a problematic area for Perpetual.\nThe company tried to build an international funds arm with the purchase of a business in Ireland well before Lloyd arrived. But that was a spectacular disaster. It followed that up by issuing an international mandate to Wellington Management in the US but that manager delivered bottom quartile returns.\nLloyd has told his in-house international funds management team to lift funds under management by $1 billion over three years.\nThat does not look like a very ambitious target given the prediction that Australia's super savings will grow from $2 trillion to about $5 trillion by 2020.\nPerpetual has changed the mandates on many of its funds to allow investment in offshore markets but only minimal amounts have been invested in that way.\nPerpetual is a leader in the corporate trust business and is rapidly growing its private wealth advisory business. It has a dominant position in the securitisation administration market and its funds management strength goes beyond equities.\nMichael Korber, who runs the credit and fixed income division, is one of the unsung heroes of Perpetual. In fact, one of his income funds had the strongest inflows of any fund in the Perpetual group of funds in the year to June.\nQuestions are already being asked in the market about Lloyd's ability to revitalise the Perpetual business.\nNigel Pittaway, at Citi, told clients: \"With a lack of flow momentum and uncertainty about Perpetual's future growth profile post completion of its T15 transformation and Trust Co synergies, we retain our \"Neutral\" call.\"\n\"Perpetual remains leveraged to a rally in the Australian equity market, but aside from this, the attractions seem limited.\"\nPittaway said the fund outflows in the June quarter were much higher than he had expected \"even though we had previously flagged concerns about the residual risks from a recent fund manager departure\".\nDownside protection The release of the Mercer Investment Surveys provided another reminder of how difficult it is for active fund managers to beat benchmark indices.\nHowever, investors who take these relatively poor results as a catalyst for shifting all their investments into passive funds such as exchange traded funds or index funds should think carefully.\nAn alternative way of thinking about the problem of how to achieve alpha while avoiding volatility has been put forward by US fund manager AllianceBernstein.\nChief investment officer Roy Maslen has been going around the market with some 12 month returns which are impressive compared to other active fund managers.\nThe AllianceBernstein Managed Volatility Equities Fund, which was recently opened to retail investors, achieved a gross return in the 12 months to June of 19.33 per cent and total fund returns of 18.78 per cent. The fund carries fees of 55 basis points.\nMaslen told Chanticleer that the fund aims to reduce volatility by investing in high quality securities which have reasonable valuations, high quality cash flows and relatively stable share prices.\nThe fund has managed to provide downside protection as seen from the fact that the mean monthly return when the index was down was negative 0.7 per cent when its benchmark was down 2.8 per cent, in the 14 months to June 2015.\nWhen the mean monthly return was positive, the benchmark was up 2.8 per cent the fund had a similar return.\nIn other words, the structure of the fund means losing less when the market falls.\nMaslen's strategy suggests that Australian investors should be wary of too much concentration of risk in banking and resources stocks. That is really an argument against buying the market through an ETF or index fund.\nThe AllianceBernstein strategy includes the option to invest about 20 per cent of the fund in offshore markets. This is to ensure the fund can invest in the stocks missing from the Australian market such as pharmaceutical companies.\nBest funds Latest data from Morningstar show that the best-performing Australian share strategies over the year to June 30 were Bennelong Concentrated (16.9 per cent), Macquarie High Conviction (14.2 per cent), and Fidelity Australian Opportunities (11.6 per cent).\nMorningstar said global share fund managers achieved outstanding results on average over the past year. The median manager returned 26.1 per cent on an unhedged basis, individual results ranging from 38 to 17.2 per cent. Longer term results were 26.5 per cent over the three years and 15.6 percent over the five years to 30 June 2015.\nCarnegie (38.0 per cent), Magellan (31.8 per cent), and BlackRock (31 per cent) were the best-performing global share funds over the year to 30 June 2015.\nTONY BOYD\nTwitter: @TonyBoydAFR\ntony.boyd@afr.com.au", "external_links": ["https://twitter.com/TonyBoydAFR", "http://twitter.com/@TonyBoydAFR"], "published": "2015-07-15T18:13:00.000+03:00", "crawled": "2015-07-15T16:06:17.000+03:00", "highlightTitle": ""}