{"organizations": [], "uuid": "c12e08924f5fa9944e032d06c0ae393edd8e54a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/c/s/y/k/image.related.articleLeadwide.620x349.gicgi4.png/1436938140807.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/world-business/greek-debt-crisis-panic-buying-as-greeks-fear-losing-savings-20150714-gicgi4.html", "country": "AU", "title": "Greek debt crisis: Panic buying as Greeks fear losing savings", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Greek debt crisis: Panic buying as Greeks fear losing savings", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "c12e08924f5fa9944e032d06c0ae393edd8e54a0"}, "author": "Suzanne Daley", "url": "http://www.smh.com.au/business/world-business/greek-debt-crisis-panic-buying-as-greeks-fear-losing-savings-20150714-gicgi4.html", "ord_in_thread": 0, "title": "Greek debt crisis: Panic buying as Greeks fear losing savings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Business Week: China counts\nBailout ball in Greece's court\nChina's share market turmoil explained\nGreek banks running out of cash\nGreek celebrations leave Germans fuming\nReplay video Return to video Video settings Please Log in to update your video settings\nMal Maiden: The vote is crucial With the IMF stating that Greece is in a tailspin and the EU not budging on debt forgiveness, the Greek parliament is set to vote on the new bailout.\nPT5M5S 620 349 Autoplay On Off Video feedback Video settings ﻿ PM Alexis Tsipras faces Syriza mutiny Eurozone clinches deal with Greece Marousi: Business has been so brisk in the giant Kotsovolos appliance and electronics store in this upper-middle-class suburb of Athens that you might think a sale was on. But, no. It is panic buying, those who work here say.\nIncreasingly concerned that greater economic trouble lies ahead of them, and limited in how much cash they can take out of banks, Greeks have been using their debit cards to buy ovens, refrigerators, dishwashers - anything tangible that can hold its value in troubled times.\nButchers wait for clients in a meat market in central Athens on Tuesday. Photo: AP\n\"We have sold so much,\" said Despina Drisi, who has worked in the store for 12 years. \"We even sold display models. People have been pulling at my sleeves. We're spacing things out now to cover the holes on the shelves.\"\nTo the casual observer, the bustle of everyday life looks unchanged here. Greeks, many of whom long ago traded in their cars for cheaper motor scooters, clog the streets at rush hour on their way to and from work. Tourists pack the Acropolis. Friends meet, greet and sit in cafes, looking for shady spots against the heat.\nBut beneath the surface, Greeks are struggling with growing fear, the strange ramifications of closed banks and the mounting potential for much worse.\nA man begs on the streets of Athens on Tuesday as the bailout deal debate rages on in the Greek parliament. Photo: Getty Images\nSome are watching television and checking their smartphones constantly. Others refuse to follow what is going on with discussions on debt relief. But either way, many are doing what they can to protect themselves financially, buying appliances and jewellery or even prepaying their taxes so they will have taken care of one financial obligation if they end up losing some of their savings to a bank failure, as happened to depositors in Cyprus under a bank rescue plan there in 2013.\n\"Panicked doesn't begin to describe how people feel,\" said Antonis Mouzakis, an Athens accountant. \"I have a huge number of customers wanting to file their taxes right here, right now, to have the tax calculated and paid instantly before a possible haircut. Even if the tax is 40 to 50 thousand euros, they pay it off in one go.\"\nA Greek jeweller, George Papalexis, said a customer had approached him wanting to buy 1 million euros - about $US1.1 million - worth of merchandise. But Mr Papalexis, the chief operating officer of Zolotas, said he had refused because he was more comfortable holding on to the jewels than having money in Greek banks.\nA man sits and begs for money, as pedestrians walk by outside of a National Bank, in central Athens on Tuesday. Photo: AP\n\"I can't believe that there I was, turning away a million-dollar offer,\" he said. \"But I had to turn down the deal. It's a measure of the risk we face.\"\nMr Mouzakis said that many companies were also trying to settle their debts quickly, not wanting to owe money if their deposits are hit in a deal to rescue Greek banks. Others do not want to accept payments for the same reason. When banks in Cyprus had to be bailed out in 2013, depositors with more than 100,000 euros lost about 40 percent of their money.\nBut individuals, too, are doing what they can to protect themselves. At night, many of them are walking the city in search of ATMs that have not been emptied of cash. Others are using computers to spread money to various accounts or to relatives, lowering the total in each account.\nA pensioner arrives to receive part of her pension as police officers stand by at a National Bank branch in Athens on Tuesday. Photo: Reuters\nWith banks closed, Greeks are limited to withdrawals of 60 euros, or $US66, a day from ATMs and cannot make international transactions, factors that have gutted some businesses already.\nThe auction at the downtown fish market, where cash is mandatory, was sparsely attended recently, leaving fishermen fretting. Butchers too, are feeling the pinch. But there are more mundane problems, too. The ATMs give out only 20 euro and 50 euro notes, and they appear to be running out of 20s. Stores are having an increasingly difficult time finding change.\nSome businesses have begun yet another round of layoffs. \"My boss came in and said, 'We are all going to die,'\" said a young woman who works for a small travel agency in Athens. \"He gathered us all together, really, to tell us that.\"\nGreece's Prime Minister Alexis Tsipras interviewed by a television journalist on Tuesday. Photo: AP\nHe then reduced her hours to two days a week, she said, adding that her boss \"was completely, totally panicked\".\nThe agency had been unable to issue tickets because Greek travel agents have been blocked from the global ticketing system.\nPharmacists began to feel the pinch almost immediately when the banks shut down, because most drugs are imported and they had no way to pay for them. Michalis Moschonas, an Athens pharmacist, said his customers had been concerned, if understanding, when he had to turn them away. He was also understanding, allowing many people who were unable to get enough cash to pay for their medicine to owe him money.\n\"I have countless IOUs behind my counter,\" he said.\nA contractor at a Greek energy company, who spoke on the condition of anonymity, said his firm had paid all its taxes for the year to whittle down the funds that could be subject to a deposit tax.\n\"I'm even thinking about buying a car, although I don't need one, to get my cash balance lower,\" he said. \"People want their money in physical assets, not in the bank.\"\nNew York Times", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-15T20:04:27.000+03:00", "highlightTitle": ""}