{"organizations": ["Horizon Group, Inc"], "uuid": "2bd582ff90f04ad59debac3f8d3b74238da0ca92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://media.marketwire.com/attachments/201311/200689_Horizon_Logo_877.jpg", "site_section": "http://www.marketwire.com/rss/mwFSPF.xml", "section_title": "Marketwired - Personal Finance", "url": "http://www.marketwired.com/press-release/one-horizon-group-signs-agreement-factory-install-aishuo-voip-app-chinese-smartphones-nasdaq-ohgi-2043383.htm", "country": "CA", "title": "One Horizon Group Signs Agreement to Factory-Install Aishuo VoIP App in Chinese Smartphones", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "One Horizon Group Signs Agreement to Factory-Install Aishuo VoIP App in Chinese Smartphones", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T14:30:00.000+03:00", "replies_count": 0, "uuid": "2bd582ff90f04ad59debac3f8d3b74238da0ca92"}, "author": "", "url": "http://www.marketwired.com/press-release/one-horizon-group-signs-agreement-factory-install-aishuo-voip-app-chinese-smartphones-nasdaq-ohgi-2043383.htm", "ord_in_thread": 0, "title": "One Horizon Group Signs Agreement to Factory-Install Aishuo VoIP App in Chinese Smartphones", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SOURCE: One Horizon Group, Inc. July 30, 2015 07:30 ET One Horizon Group Signs Agreement to Factory-Install Aishuo VoIP App in Chinese Smartphones \nOne Horizon's VoIP App Aishuo Secures Chinese Smartphone Native Installation \nLIMERICK, IRELAND--(Marketwired - Jul 30, 2015) - One Horizon Group, Inc. ( NASDAQ : OHGI ) (\"One Horizon,\" \"We\" or the \"Company\"), which operates its own Chinese retail VoIP service, branded Aishuo, and develops and licenses a bandwidth efficient mobile voice over Internet Protocol (\"VoIP\") platform for smartphones, announced today that it has signed an agreement with Nanjing Lin Ren Communications (\"Lin Ren\"), a manufacturer of Smartphones, Phablets and Tablets. One Horizon will pre-install its Aishuo App in Android devices prior to shipment from the Lin Ren factory. \nOne Horizon seeks to expand its subscriber base through handset manufacturers' distribution channels by providing manufacturers with a unique recurring revenue opportunity on top of their current device sales revenues. As a part of One Horizon's expansion strategy in China, the Company plans to ally with Chinese handset manufacturers to promote the Aishuo app and, in turn, drive Aishuo In-App revenues. \nAllied with Lin Ren, One Horizon will benefit from Lin Ren's distribution network to increase the pace of the commercial rollout of its Aishuo app in China with no upfront cost for One Horizon. Meanwhile, Lin Ren will benefit from a share of the subsequent Aishuo top-up revenue for the entire life of their device. \nAishuo supports all major Android mobile payment platforms including China UnionPay, Alibaba's Alipay and Tencent's Wechat Wallet and provides subscribers with convenient options to purchase call credit. \nOne Horizon Group CEO Brian Collins noted, \"By continuing to execute our strategy of getting our App to as many Chinese consumers as possible we are finding that working with forward thinking Chinese smartphone manufacturers is a great win-win approach. Instead of manufacturers just getting a one-time profit on device sales, with ever-decreasing margins, Aishuo offers both parties a share in a much longer term revenue stream when they pre-install our App in their phones and phablets.\" \nMr. Sun Zhuangzhi, CEO of Lin Ren, said, \"As a manufacturer in this sector we are always looking to explore new and creative revenue opportunities. By pre-installing the Aishuo Value Added Service on our devices we believe that we will not only improve customer satisfaction but we will also increase our sales and revenues. The Aishuo service differentiates us from our competitors and we expect that it will improve our sale ability to consumers by offering a service that can save them money on phone calls when using our device.\" \nDownloads of the Aishuo retail App have already surpassed 6 million across the 20 Chinese Android App stores including Baidu, Tencent, 360.CN and Xiaomi. The Aishuo rollout to Chinese smartphone users commenced in late February 2015 and the Company is seeking to acquire 15 million new subscribers over a two-year period with a view to leverage this significant user base to achieve industry average revenues per user (ARPU) for similar social media, mobile advertising and mobile VoIP apps. \nOne Horizon delivers an industry leading proprietary optimized-for-mobile VoIP calling solution with competitive per minute call-rates, and an In-App telephone number rental feature that provides a Chinese number for friends and family to call from their landlines or mobile phones, at home or abroad. \nAishuo is available as a FREE download in over 25 smartphone App stores including Apple's iTunes, Baidu's 91.com and Baidu.com , the Tencent App store MyApp.com , 360 Qihoo store 360.cn and Xiaomi on mi.com . \nAbout One Horizon Group, Inc. \nOne Horizon Group Inc.'s business is to optimize communications over the Internet through its wholly owned subsidiary, Horizon Globex GmbH, Zug, which develops and markets one of the world's most bandwidth-efficient mobile voice over Internet Protocol (VoIP) platforms for smartphones, and also offers a range of other optimized data Applications including messaging and mobile advertising. The company controls and operates the Aishuo mobile VoIP service in China. Horizon Globex GmbH is an ISO 9001 and ISO 20000-1 certified company. The Company has operations in Ireland, Switzerland, the United Kingdom, China, India, Singapore and Hong Kong. For more information on the Company, its products and services, please visit http://www.onehorizongroup.com . \nSafe Harbor Statement \nThis news release may contain \"forward-looking\" statements. These forward-looking statements are only predictions and are subject to certain risks, uncertainties and assumptions that could cause actual results to differ from those in the forward looking-statements. Potential risks and uncertainties include such factors as uncertainty of consumer demand for the Company's products, as well as additional risks and uncertainties that are identified and described in Company's SEC reports. Actual results may differ materially from the forward-looking statements in this press release. Statements made herein are as of the date of this press release and should not be relied upon as of any subsequent date. The Company does not undertake, and it specifically disclaims, any obligation to update any forward-looking statements to reflect occurrences, developments, events or circumstances after the date of such statement. Contact Information", "external_links": [], "published": "2015-07-30T14:30:00.000+03:00", "crawled": "2015-07-30T14:58:57.116+03:00", "highlightTitle": ""}