{"organizations": [], "uuid": "1a6b5ef914be67ba7a35dd340688e8aefa137e70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/k/x/0/a/image.related.afrArticleLead.620x365.gidhtx.png/1437037193055.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/street-talk/kkrled-group-withdraws-from-esanda-auction-20150716-gidhtx", "country": "AU", "title": "KKR-led group withdraws from Esanda auction", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "KKR-led group withdraws from Esanda auction | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T22:15:00.000+03:00", "replies_count": 0, "uuid": "1a6b5ef914be67ba7a35dd340688e8aefa137e70"}, "author": "afr.com", "url": "http://www.afr.com/street-talk/kkrled-group-withdraws-from-esanda-auction-20150716-gidhtx", "ord_in_thread": 0, "title": "KKR-led group withdraws from Esanda auction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ANZ chief Mike Smith is counting on asset sales to boost the bank's equity capital levels, which are the lowest of the big four at a time when regulators are demanding banks hold more capital. Daniel Munoz by Sarah Thompson Anthony Macdonald Jake Mitchell ANZ Banking Group will next week crank up efforts to build capital through the sale of its Esanda Dealer Finance unit, as another heavyweight bidder bows out of the auction.\nStreet Talk can reveal Citi-advised KKR & Co has withdrawn from the sale process, following last week's departure of global private equity giants TPG and Blackstone, also revealed by Street Talk.\nKKR had been working with Varde Partners, the fund manager that also backed KKR's acquisition of GE Capital's consumer finance unit in March.\nFor the handful of buyers still eyeing off Esanda's $8.2 billion portfolio of loans, ANZ and its adviser Deutsche Bank will host presentations in Melbourne next week, giving management a chance to make their pitch and extract the most competitive bids.\nThose still in the race include The Carlyle Group, advised by UBS and backed by one of the private equity giant's regional funds, China's HNA Group, and Macquarie Corporate & Asset Finance Group.\nAs Street Talk revealed this week, HNA, a Chinese aviation, logistics and property giant, will be a powerful contender in the race.\nThe Esanda assets up for sale are expected to fetch up to $1.5 billion and include the unit that makes loans to car dealers for floor stock financing, also known as floor plan financing, and a retail arm that allows dealers to provide finance to customers.\nThe sale comes as ANZ chief Mike Smith is counting on asset sales to boost the bank's equity capital levels, which are the lowest of the big four at a time when regulators are demanding banks hold more capital.\n The other obvious assets for ANZ to sell are its minority stakes in Indonesian, Chinese and Malaysian banks.\nHowever, as several analysts have pointed out, ANZ has been trying to flog its 39 per cent stake Indonesia's Panin Bank for several years, and hasn't been able to achieve a high enough price.\nIf ANZ can't sell these assets at satisfactory prices, some investors reckon it may consider an equity raising to deal with the looming hike in how much capital big banks must hold.", "external_links": [], "published": "2015-07-16T22:15:00.000+03:00", "crawled": "2015-07-16T20:13:49.000+03:00", "highlightTitle": ""}