{"organizations": [], "uuid": "5543cdc11098d7e154d4bd13700d27d7b10287b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/mobilenoportability004072015.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/mobile-number-portability-across-circles-are-you-ready-to-switch/42604.html", "country": "IN", "title": "Mobile number portability across circles. Are you ready to switch?", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Mobile number portability across circles. Are you ready to switch?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T11:43:00.000+03:00", "replies_count": 0, "uuid": "5543cdc11098d7e154d4bd13700d27d7b10287b3"}, "author": "Yogesh Sapkale", "url": "http://www.moneylife.in/article/mobile-number-portability-across-circles-are-you-ready-to-switch/42604.html", "ord_in_thread": 0, "title": "Mobile number portability across circles. Are you ready to switch?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Mobile number portability across circles. Are you ready to switch? 42604 Mobile number portability across circles. Are you ready to switch? 0 Comments, Be the first to comment Yogesh Sapkale | 04/07/2015 02:13 PM | Now, you can switch your mobile operators from one circle to another, while retaining the same number. The process for National MNP is quite simple. It just involves sending an SMS, and submitting an application form along with necessary documents Finally, there is some good news for those wishing to retain their mobile number while moving base to other states or circles in India. From 3 July 2015, anyone can use the mobile number portability (MNP) facility, which was available inside the circle, to switch to any mobile operator in any other circle. However, mobile subscribers should use this facility only if they are shifting base to the circle and have necessary documents, mainly address proof, for MNP. For those, who continue to travel between circles, MNP is not the solution. Instead, they can use free national roaming (no incoming charges while roaming) from BSNL and use intra-circle MNP to shift to the state-run operator. Full MNP or National MNP allows a subscriber to retain her mobile number in any part of the country even when she changes the operator or state. This means you can retain your mobile number irrespective of the state or operator. For example, if you are using an Airtel Delhi number and you are relocating to Mumbai, you can continue using the same number in Mumbai by shifting it to Airtel Mumbai, or any other operator in Mumbai of your choice. How to use the National MNP? The process is similar to intra-circle MNP. You need to generate the unique porting code, visit the office, store or gallery of mobile operator you are shifting to and submit a form accompanied by necessary documents. 1. Generate the UPC code using the number to be ported by sending an SMS PORT to 1900. e.g. PORT 9123456789. The word PORT' is not case sensitive and keep space between port and your number. This UPC code will be valid for 15 days. You will receive a reply, which will contain a unique 'porting code' 2. Visit to the nearest office, store or gallery in the visiting state/circle and fill the subscriber enrolment form. Submit requisite documents, like Photo ID, address proof, one passport size photo, porting form, form 60 or copy of PAN card, and complete other formalities, if any. You will have to pay Rs19 as porting charges. However, the new operator has an option to either waive off the fee or give a discount to the subscriber. 3. The new operator will provide you a new SIM for that particular circle, which will be activated after the request is accepted and your number is ported. You may be charged some fee for the new SIM card. 4. The operator where you are porting your number will complete the formalities over next 24-48 hours (minimum), depending upon clearances from your existing operator. National MNP takes at least seven days to complete and may take more time, depending upon the circles. As prescribed by the TRAI, porting will be completed within seven working days except for Jammu and Kashmir, Assam and North East Service Areas where 15 days time has been prescribed. 5. You will also receive an SMS, which will provide the time and date for porting. According to TRAI, it is mandatory for both the existing and the fresh operators to complete the process for number portability within four days after the first SMS. 6. You will receive another SMS from the new operator, confirming the switch. Your mobile phone may remain 'dead' or without network coverage for about two hours while the porting takes place. But don't worry—you will be able to go 'live' again with the new operator—and your old number. Precautions for National MNP 1. Make sure to pay all your outstanding dues (if you are a post-paid subscriber), else your existing operator may reject the MNP request. Your deposit, if any, will be refunded to you by existing operator. The new operator may ask for fresh deposit from you, if you are opting for a post-paid plan. 2. Prepaid subscribers should use most of available balance in their account. Just keep few rupees, in case you needed. This is important as the existing/remaining balance will expire upon successful porting and cannot be transferred to other service provider. 3. Your existing tariff plan is subject to change after porting. So be careful to select the mobile operator and chose your tariff plans accordingly. 4. There may be some charges while porting. Although, most operators claim to waive off the porting charges of Rs19, they may collected it under the pretext of providing new SIM card. 5. Remember, you can change your operator only once in every 90 days. 6. You will have to back up the contacts and the messages stored on the old SIM card before making the porting request. 7. You can cancel your porting request within 24 hours of making the request. It will take 24 hours-within which the porting request can be cancelled. 8. All your value-added services (VAS) with the current operator will automatically be terminated once the number is successfully ported to the new operator. 9. After porting, you will again have to register for National Do Not Call (NDNC). Are there any conditions for MNP? •You should have completed a period of 90 days (from the date of activation of your mobile connection) with your current operator. •You should have cleared all outstanding payments with your current operator. •You should have no pending request for change of ownership of the mobile number. •Your mobile number sought to be ported should not be sub-judice i.e., it should not be involved in any case pending before a Court of Law. •Again, porting of your mobile number should not have been prohibited by a Court of Law. •There should be no ownership change request pending against the number you wish to port. More in Moneylife", "external_links": [], "published": "2015-07-04T11:43:00.000+03:00", "crawled": "2015-07-04T11:59:07.000+03:00", "highlightTitle": ""}