{"organizations": [], "uuid": "eb96f840ee701acae13b75a75654c671a916307f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/f/7/4/w/image.related.afrArticleLead.620x365.gifx51.png/1437343994956.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/mike-baird-backs-rise-in-gst-to-15pc-20150719-gifx51", "country": "AU", "title": "Mike Baird backs rise in GST to 15pc", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Mike Baird backs rise in GST to 15pc | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T06:11:00.000+03:00", "replies_count": 0, "uuid": "eb96f840ee701acae13b75a75654c671a916307f"}, "author": "Primrose Riordan", "url": "http://www.afr.com/news/mike-baird-backs-rise-in-gst-to-15pc-20150719-gifx51", "ord_in_thread": 0, "title": "Mike Baird backs rise in GST to 15pc", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Treasurer Joe Hockey, Prime Minister Tony Abbott and Premier of NSW Mike Baird ... Mr Baird is calling for a higher rate of GST. Edwina Pickles Share on twitter Share on Google Plus by Primrose Riordan NSW Premier Mike Baird has called for the GST to be increased to 15 per cent to fund health spending, as he prepares for a meeting of state, territory and federal leaders this week.\nMr Baird said the change is needed across the country to make sure families earning under $100,000 are no worse off in the face of cuts to health spending from the federal budget.\nThe move will open up friction ahead of the meeting, after Victorian Labor Premier Daniel Andrews rejected any change to the rate or the base of the tax , leaving Treasurer Joe Hockey to declare \"game over\" on GST increases.\nSpeaking in a video released via Twitter, Mr Baird said the budget shortfalls faced by all states could not be made up through efficiencies, and further revenue would be needed.\nIf our health system is to survive, we need our political leaders to bring solutions to the table. I'll go first.\n https://t.co/JiAO5eeFKF\n— Mike Baird (@mikebairdMP) July 19, 2015 He said NSW Government modelling revealed annual budget deficits across the Commonwealth and states are expected to total $45 billion by 2030, $35 billion of which relates to health spending.\n\"We face big problems, in this state and across the country and at the moment the biggest challenge we face is in our health system.\n\"We need revenue, I know it's not popular, but the best way of dealing with it that I see is to increase the GST ... and put all the dollars raised into health,\" he said.\nMr Baird says he will not support a broadening of the base and fresh food, education and childcare should still be quarantined.\n The Premier has long supported changes to the GST and has pushed for the issue to be on the table at this week's leaders' retreat, where Prime Minster Tony Abbott will meet the premiers in an effort to find ways to fund schools and hospitals.\nLast week, Mr Hockey said he would waste no more effort arguing for a tax change from which the Commonwealth would not be a direct beneficiary.\n\"The federal government is not going to be arguing for a tax change that the beneficiary doesn't actually want,\" he said.\n\"If the beneficiary of the reform doesn't want it, it's effectively game over.\"", "external_links": ["https://twitter.com/primroseriordan", "https://t.co/JiAO5eeFKF", "https://plus.google.com/117519411493153561016", "https://twitter.com/mikebairdMP/status/622857885173678080"], "published": "2015-07-20T06:11:00.000+03:00", "crawled": "2015-07-20T04:44:24.778+03:00", "highlightTitle": ""}