{"organizations": [], "uuid": "a57eb45002e7290147a5fa519ad116876dc77d14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/david-cameron-push-iron-gender-000155614.html", "country": "US", "title": "David Cameron’s push to iron out the gender pay gap will be costly and won't work", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "David Cameron’s push to iron out the gender pay gap will be costly and won't work", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:01:00.000+03:00", "replies_count": 0, "uuid": "a57eb45002e7290147a5fa519ad116876dc77d14"}, "author": "", "url": "https://uk.finance.yahoo.com/news/david-cameron-push-iron-gender-000155614.html", "ord_in_thread": 0, "title": "David Cameron’s push to iron out the gender pay gap will be costly and won't work", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Cameron"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 14, 2015, 01:40 BST - UK Markets open in 6 hrs 20 mins David Cameron’s push to iron out the gender pay gap will be costly and won't work By James Quinn | Telegraph – 37 minutes ago \nThe Prime Minister's notions are valid - but his execution is flawed \nEquality in pay is something that should be welcomed, whatever the reason for the disparity. \nTwo people, of the same skill level, the same educational background, the same ability and the same years of experience should be paid roughly similar amounts. \nThe only problem is that trying to find one person who is exactly the same as another person in one’s employ might prove to be very difficult. \nIt is for for that reason that David Cameron’s pledge today to force companies to “ close the gender pay gap ” should be treated with a major pinch of salt. I appreciate that as a man I may have a very different take on this from my female colleagues, but while equality may be an easy concept to define, it is very difficult to measure. \nThe Prime Minister intends to close this gap by forcing companies with more than 250 staff to publish the difference between the average pay of their male and female employees. He hopes to “cast sunlight”on companies which are being unfair to women. \nHis intention is that it will drive women’s wages up. In reality, it is just as likely, over time, to drive wages down or cause other unintended consequences, which will be bad for the economy. \nDavid Cameron, the Prime Minister \nThink for a second how it might do this. \nTake a large retailer for example, which, for whatever reason, has a large percentage of its shop floor workforce who are women. By the nature of their role, they will be paid less than those in other, more skilled parts of the company. \nDistribution, marketing and management layers of the retailer are likely to be evenly more mixed from a gender perspective. By the nature of their roles, they will be paid more. \nUnder Cameron’s new stricture, a retailer in this boat will be shamed, because it will have a large pay gap, on average, between men and women, because it employs more lower paid women. \nOne way of solving it would actually be to recruit more men in lower paying positions - a perverse outcome to an unnecessary problem. \nAnother would be to lower men's wages to bring them in line with their female counterpart. Again, perverse. \nIt is worth pointing out that this announcement comes on the back of the Government meeting its target of getting 25pc of FTSE 100 (NasdaqGS: Z - news ) board rooms to be populated by women - another arbitrary measure which belies the fact that the number of women in chief executive and finance director roles at those companies remains worryingly low. \nQuotas, rules and placing extra costs on business are not the way to ensure diversity in the workplace. Education and a vibrant economy are. \n= Why Platform's £1.35bn takeover of Alent (LSE: ALNT.L - news ) is more interesting than it seems = \nTo the untrained eye, Platform’s £1.35bn purchase of Alent is just another takeover of another slightly dull company few people beyond its employees and suppliers have heard of. But in fact the acquisition by the American corporate raider is far more than that. \nAlent may not ring many bells in the corporate pscyhe - but that’s because it was, until 2011, part of Cookson, the FTSE 250 industrials conglomerate. The questionably named Alent - presumably the brainchild of a well-paid management consultant - is a chemicals company that makes elements that exist in lots of every day items, from iPhones to cars, from shower heads to computer screens. \nDespite its chemicals being intrinsic to many an industry, its wares hadn’t always been appreciated. Its share price oscillated around the 350p mark for the best part of the last year, with a great deal of investors largely ignoring the stock. It is for that reason that Platform has been able to offer a price some 49pc high above Friday’s closing price and still feel it can extract value from the business. \nOne investor who didn’t ignore Alent however was Cevian, the London-based activist hedge fund which owns a 21.9pc stake. It is Cevian which prompted Cookson’s demerger , spinning off Alent and the equally oddly named Vesuvius (Other OTC: CKSNF - news ) , which makes engineering ceramics. Cevian for its part indicated that it was not behind the Platform deal, with sources intimating the two companies had been flirting on and off for some time. \nWhatever the background to the 503p-a-share offer, Cevian is so keen on Alent that it has ensured a rather unusual structure to the offer so it can continue to benefit from the company’s future. The partial share offer allows Alent investors to take shares in Platform, rather than cash, to the value of 21.9pc of the business - equal to Cevian’s stake in Alent. If ordinary investors would rather take cash, Cevian has the right to take up all those Platform shares. \nThe reason for the interest is because Platform, run by veteran dealmaker Martin Franklin, is doing something that Cevian clearly believes will deliver further value in the medium term. \nNot only does he estimate it will deliver around £30m of cost savings, Alent will become part of a vehicle which is now worth £5bn. \nFranklin has form for doing this before. In 2001, he took a 9.9pc stake in Alltrista, which made preserving jars, and became chief executive after he demanded seats on the company’s board. He has since turned that company into Jarden, one of the the US’s largest consumer conglomerates. \nHe is also the brains behind Nomad Foods, an at the time little known vehicle which bought Iglo, the owner of Birdseye , earlier this year, and is now in the process of transfering its stock market listing from London to New York, raising fresh funds for its arsenal in the process. \nBirdseye, part of Iglo, was bought by Franklin's Nomad Foods earlier this year \nFranklin is an acquisitive machine - he also completed on Jarden’s $1.35bn (£871m) purchase of cutlery maker Waddington yesterday - and the Alent deal is testament to that. It just goes to show that, just because a company operates in an unloved and little understood sector, it does not mean that it is boring. \nLittle wonder that Cevian likes what it sees in Platform. Ordinary Alent investors should follow suit. \njames.quinn@telegraph.co.uk", "external_links": [], "published": "2015-07-14T03:01:00.000+03:00", "crawled": "2015-07-14T03:42:22.000+03:00", "highlightTitle": ""}