{"organizations": [], "uuid": "3fdac810de8a45bd997fd20e90142bd676d7ffc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/26/obama-africa-kenya-idUSL5N10508H20150726", "country": "US", "title": "Obama tells Kenyans he wants them to succeed, sees challenges", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Obama tells Kenyans he wants them to succeed, sees challenges | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T14:24:00.000+03:00", "replies_count": 0, "uuid": "3fdac810de8a45bd997fd20e90142bd676d7ffc8"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/26/obama-africa-kenya-idUSL5N10508H20150726", "ord_in_thread": 0, "title": "Obama tells Kenyans he wants them to succeed, sees challenges", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Obama makes first trip by U.S. president to Kenya\n* Security and business ties high on agenda for visit\n* Obama draws on his experience in speech to Kenyans\nBy Jeff Mason and Edith Honan\nNAIROBI, July 26 (Reuters) - Barack Obama told Kenyans on Sunday on his first presidential trip to his father's homeland that there was \"no limit to what you can achieve\" but said they had to deepen democracy, tackle corruption and end exclusion based on gender or ethnicity.\nAfter political talks on Saturday with President Uhuru Kenyatta on security and business, his speech to a packed sports hall in Nairobi struck a personal note, talking of his own experience and Kenya's in the five decades since independence.\n\"I'm here as president of a country that sees Kenya as an important partner. I'm here as a friend who wants Kenya to succeed,\" he said, after being introduced by his sister Auma Obama to a crowd who had secured tickets to attend.\nTo a mixture of applause and laughter, he described being picked up at the airport on his first visit to Kenya in the 1980s by his sister in an old VW Beetle that often broke down. This time, he arrived on Air Force One and travelled in the president's armoured car nicknamed \"the Beast.\"\n\"When it comes to the people of Kenya, particularly the youth, I believe there is no limit to what you can achieve,\" he said, but he told Kenyans building their nation and the economy required personal effort and responsibility.\nOn corruption, an issue often blamed for holding back investment, Obama said money spent on bribes would be better paid to someone \"doing an honest day's work\".\nReferring to ethnic fighting in which 1,200 people died after a disputed 2007 election, he told Kenyans that politics based on ethnicity was \"doomed to tear a country apart.\"\nHe also warned Kenya would \"not succeed if it treats women and girls as second-class citizens.\"\nObama spoke of Kenya's challenge in dealing with attacks by the Somali Islamist militant group al Shabaab, and promised the United States would stand by Kenya as a \"partner\". On Saturday, he offered extra counter-terrorism training and funds.\nKenya's tourist industry has been hammered by attacks by al Shabaab, who raided a Nairobi shopping mall in 2013 and attacked a university in the northeast in April. Hundreds were killed in those and other attacks.\nObama, whose father is buried in western Kenya, wants to boost business ties with Africa, one of the world's fastest growing regions. China overtook the United States as the biggest trader partner in 2009.\n\"The future of Africa is up to Africans,\" he told the crowd at the sports hall.\n\"It was awesome. It was really inspiring especially for us young people,\" said Bramwel Rotich, a 24-year-old student, after the speech.\nAfter Kenya, Obama will travel to Ethiopia, a nation brought to its knees by famine in the 1980s that now boasts some of the fastest economic growth rates in Africa. (Writing by Edmund Blair ; Editing by Raissa Kasolowsky )", "external_links": [], "published": "2015-07-26T14:24:00.000+03:00", "crawled": "2015-07-26T13:53:12.656+03:00", "highlightTitle": ""}