{"organizations": [], "uuid": "aec8350c5ddaecfdc835736d8c9c703b447cea85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/CngP7Awt3g4bQv6mJkAsRg--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/FIN_ANZ_AAP_ART_FTP_LIVE_1/2975956_30July_AndrewForrest_1280x720_original.jpg", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/andrew-forrest-applauds-aus-china-045014580.html", "country": "GB", "title": "Andrew Forrest applauds Aus-China FTA", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Andrew Forrest applauds Aus-China FTA", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T07:50:00.000+03:00", "replies_count": 0, "uuid": "aec8350c5ddaecfdc835736d8c9c703b447cea85"}, "author": "", "url": "https://au.finance.yahoo.com/news/andrew-forrest-applauds-aus-china-045014580.html", "ord_in_thread": 0, "title": "Andrew Forrest applauds Aus-China FTA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrew Forrest"], "text": "View Photo \n\nBillionaire mining magnate Andrew Forrest has thrown his weight behind the Australia-China Free Trade Agreement in the face of a union-led advertising campaign calling for changes to the bilateral deal. \nThe Fortescue Metals Group chairman on Thursday hit out at the anti-FTA ad campaign run by the Construction, Mining, Forestry and Energy Union (CFMEU) which fears the agreement could hurt Australian workers. \nMr Forrest said he didn't believe the ads reflected the truth of the FTA. \n\"I find that advertising to be absolutely misleading,\" the Fortescue Metals Group chairman told reporters on Thursday. \n\"I can't applaud (the FTA) enough and I ask all of us to work against anything which does incite any kind of racism, any kind of pent up xenophobia. \n\"We have to recognise that Australia and Australians have always ... needed outside capital to develop the great projects in the great country we have.\" \nSpeaking at the Boao Forum of Asia in Sydney, Mr Forrest said he unreservedly backed the FTA, including the provision of an investor-state dispute settlement mechanism. \n\"It's actually treating each other as equals,\" Mr Forrest said. \n\"I don't see it as a concern and if it were a concern then the Labor government wouldn't have ratified it so many times with other countries.\" \nMr Forrest's comments come after Prime Minister Tony Abbott criticised Labor for its opposition to the FTA, describing the ALP's stance as xenophobic, short-term politics. \nLabor says it wants answers to genuine questions about the agreement, because it's concerned about jobs and the inclusion of an investor-state dispute settlement mechanism. \nIn a wide-ranging discussion, Mr Forrest said Chinese investors were particularly keen on opportunities in northern Australia, and he'd push the government to establish a framework to facilitate investment in the region. \n\"It will be hundreds of millions of dollars, as well as billion of dollars to really develop northern Australia,\" Mr Forrest said. \nHe said he wasn't concerned about the Chinese economy, despite the recent share market turmoil that prompted Beijing to step in to stabilise equities. \n\"It (China) could be stronger, it could grow faster, but it's still a very strong economy,\" he said. \nOn the outlook for Fortescue Metals, Mr Forrest said low operating costs would continue to benefit the company, despite weaker iron ore prices. \n\"Fortescue is completely safeguarded by the fact that its operating costs in the very long term have become so competitive, and will fall further,\" he said. @y7finance on Twitter, become a fan on Facebook", "external_links": [], "published": "2015-07-30T07:50:00.000+03:00", "crawled": "2015-07-30T08:21:44.515+03:00", "highlightTitle": ""}