{"organizations": [], "uuid": "2d74cc83fa078194c3ffcc7150650a7a53c55f5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15363_1120.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/cfpb-principles-for-faster-payment-31927/", "country": "US", "title": "CFPB: Principles for Faster Payment Systems", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "CFPB: Principles for Faster Payment Systems", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T23:40:00.000+03:00", "replies_count": 0, "uuid": "2d74cc83fa078194c3ffcc7150650a7a53c55f5a"}, "author": "Goodwin Procter LLP", "url": "http://www.jdsupra.com/legalnews/cfpb-principles-for-faster-payment-31927/", "ord_in_thread": 0, "title": "CFPB: Principles for Faster Payment Systems", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=deca9b21-9beb-47ed-925e-a729faf1ba00\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nOn July 9, 2015, the CFPB published a set of Consumer Protection Principles it believes should guide the financial industry in the development of newer, faster methods of payment. These Principles, though merely suggestions, may help members of the financial industry anticipate the expectations of their regulators and develop new products and systems accordingly. \nAs the CFPB noted in its announcement discussing the Principles, many consumers, businesses, and members of the financial industry have begun to view existing payment methods as being too slow to meet their needs – current transactions with credit cards and electronic payments can take hours or days to be completed. The ever-increasing speed with which consumers expect to be able to move their money has prompted the financial industry to work to develop real-time or near-real-time payment methods. For example, in May of 2015 the National Automated Clearing House Association (NACHA) approved an amendment to its operating rules to provide for a new payment system referred to as Same Day ACH . This new payment system will go into effect in three phases beginning in September of 2016 and will enable originating financial institutions to submit transactions for settlement three times a day, rather than once. NACHA expects that this service will significantly enhance transactions like same-day payrolls, business-to-business payments, expedited bill payment, and account-to-account transfers. \nAnticipating the development of NACHA’s Same Day ACH system and other systems like it, the CFPB’s Principles outline the agency’s priorities for ensuring consumer protection, which it proposes should be incorporated into any new payment system that is created. Several of the principles the CFPB proposes may signal the types of regulatory requirements that could be imposed on these new systems in the future, including considerations like: Cost. Faster payment systems will likely mean increased transaction costs for financial institutions. For instance, NACHA’s plan to offer same-day settlement will require receiving financial institutions to make funds available three times a day; this change will necessitate certain increased investment and operational costs that NACHA currently proposes to compensate for with a fee of 5.2 cents per same-day transaction. The CFPB’s Principles highlight the need to disclose these fees to consumers, ensuring that they understand the full cost of the transaction and that they can compare the costs of various payment methods. Fraud and Error Resolution Protections. A consequence of faster settlement times is that there will be less time in which to identify and prevent fraudulent or erroneous transactions. The CFPB emphasizes that faster payment systems should include processes for reversing such transactions once they are identified, and that payment systems should incorporate consumer protections like those required in Regulations E and Z. Consumer Control Over Payments. The CFPB’s Principles state that consumers should retain some control over the payments they authorize using faster payment systems and that they should be able to place limits on their authorizations to control the recipient, duration, and amount of payments. The CFPB also indicates that faster payment systems should also include procedures for allowing consumers to revoke payment authorization easily. Transparency. The CFPB also stresses in its Principles the need for transparency and access to information for consumers. It states that near-real-time transactions must be accompanied by near-real-time information updates concerning things like confirmation of payments and remaining fund balances. The CFPB also notes that providers of faster payment systems should fully disclose to consumers the costs, risks, and security of faster payment options. \nThe prospect of faster methods of payment that will allow consumers and businesses greater flexibility and more control over their funds is an exciting concept that will likely soon be a reality. The CFPB’s Principles indicate that regulators are monitoring the development of these payment systems closely and that they will expect the same types of consumer protections currently required for payment transactions to be incorporated into any new payment system that is developed. By reviewing and addressing the concerns identified in the CFPB’s Principles and other similar regulatory guidance, members of the financial industry can design payment systems to satisfy the regulatory requirements that are likely to be imposed as these faster payment systems become increasingly ubiquitous.", "external_links": [], "published": "2015-07-23T23:40:00.000+03:00", "crawled": "2015-07-23T23:47:53.046+03:00", "highlightTitle": ""}