{"organizations": [], "uuid": "04a1c6f526d977a104799d9e437d44e38340bd0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business2community.com", "main_image": "http://cdn.business2community.com/wp-content/uploads/2015/07/SMAC.jpg.jpg", "site_section": "http://feeds.feedburner.com/B2C_Business", "section_title": "Business & Finance Articles on Business 2 Community", "url": "http://www.business2community.com/human-resources/has-your-job-been-smaced-if-not-yet-it-will-01265375", "country": "US", "title": "Has Your Job Been SMACed? If Not Yet, It Will!", "performance_score": 1, "site": "business2community.com", "participants_count": 1, "title_full": "Has Your Job Been SMACed? If Not Yet, It Will!", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T22:00:00.000+03:00", "replies_count": 0, "uuid": "04a1c6f526d977a104799d9e437d44e38340bd0c"}, "author": "Marc Miller", "url": "http://www.business2community.com/human-resources/has-your-job-been-smaced-if-not-yet-it-will-01265375", "ord_in_thread": 0, "title": "Has Your Job Been SMACed? If Not Yet, It Will!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Has Your Job Been SMACed? If Not Yet, It Will! 0 SHARES July 5, 2015 Human Resources 0 SMAC – Social Mobile Analytics Cloud \nIf you think you are immune from SMAC, I want to take the rest of this post to convince you differently. S Is For Social Or Social Media \nWe are entering the 2nd phase of Social Media marketing. It is called Pay to Play. Effective marketing of your product or service on Social Media is no longer free. The organizations that are most adversely affected are non-profits, which have little or no budget for Social Media marketing. \nYou already know that Social Media has become a prevalent way for employers to find talent. The days of find a job posting on Monster, CareerBuilder, or in the newspaper are largely over. Companies are out looking for talent, and do not care whether you are looking for a job! It is your responsibility to make yourself attractive as a passive candidate. Will Thomson of Bullseye Recruiting wrote a great guest post, 5 Key Traits Recruites look for in a Passive Candidate , which explains this change. Recommended for You \nThe S in SMAC is changing everything. M Is For Mobile \nMobile is changing everything! Even Google is scared of what mobile can do to their business. Google recently changed their search algorithms to favor those websites that are mobile friendly. If you own or work for a small business and your website is not mobile friendly, well…good luck! \nWhen I look at my phone, I will find my calendar, contacts, e-mail, social apps, maps, and other apps that you would expect. I also have Audible so that I can listen to books in the car or at the gym. ESPN and ESPNwatch so I can watch sports. I have two of my local radio station’s apps, so I can listen to them at the gym. Car2Go so that I can find and rent a car. Kindle so that I can read a book anytime anywhere. CNN and Al Jazeera America so I can read the national news. Podcasts so I can listen to podcasts at the gym. WOW! \nIf I walk out of my condo and do not have my iPhone, I feel naked. \nMobile is changing how we shop. Mobile is changing how we find things. Mobile is changing how we pay for things! Mobile is changing how we are found. That is the scary part. \nIf you career has not been affected by mobile yet, it will! \nThe M in SMAC is changing everything. A Is For Analytics \nMore data has been collected in the last few years than was collected in the previous century. A lot of it is coming voluntarily from our activities via Social Media and Mobile. How we shop, where we shop, what we pay with, where we go online, and even how long it takes to get somewhere are some of the things that inform this data. \nEarlier this month, it was reported that Texas Department of Transportation is using bluetooth devices in the cars to determine how long it takes to get from point A to point B . \nDo you remember the movie Minority Report where Tom Cruise walks through a mall and hyper-customized ads displayed everywhere. Analytics is here to stay—and we allow it. \nThe A in SMAC is changing everything. C Is For Cloud \nCloud is changing everything in the technology world. Most of the major technology hardware vendors are seeing portions of their business collapse. A classic example is IBM, who missed the shift and is seeing massive changes in their business. Their hardware business is collapsing. \nCloud computing is sometimes referred to SaaS (Software as a Service). Cloud (SaaS) is causing massive shifts in the background for many businesses. \nSmall businesses can now have access to resources that they only dreamed about in the past. Whether it is e-mail marketing, disk storage, photo editing, or e-mail, you have no need to install software. This change has also allowed for data to be shared with anyone and at any time. \nFor example, every receipt I get is now electronic. Places like Office Depot e-mail me receipts. I save the receipts in a folder in Dropbox . My bookkeeper can access the receipts from Dropbox and enter them into a spreadsheet or even Quickbooks in the cloud. She can be anywhere in the world, and we rarely have to talk. \nThis has made it so much easier for freelancers to service clients, but also for companies to offer their services to customers worldwide. \nThe C in SMAC is changing everything. SMAC And Your Career \nSMAC is eliminating jobs. It is creating new jobs. It has made it easier for you to offer your services to anyone in the world. It has also made it easier for others to compete with you. \nHow has SMAC affected your job?", "external_links": [], "published": "2015-07-05T22:00:00.000+03:00", "crawled": "2015-07-06T03:58:43.000+03:00", "highlightTitle": ""}