{"organizations": [], "uuid": "736b836d8f5efca881528448f94194bd23a21420", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/24/global-economy-idUSL5N10419520150724", "country": "US", "title": "GLOBAL ECONOMY-Second half of 2015 begins on shaky note", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "GLOBAL ECONOMY-Second half of 2015 begins on shaky note | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T13:42:00.000+03:00", "replies_count": 0, "uuid": "736b836d8f5efca881528448f94194bd23a21420"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/24/global-economy-idUSL5N10419520150724", "ord_in_thread": 0, "title": "GLOBAL ECONOMY-Second half of 2015 begins on shaky note", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro zone July flash composite PMI 53.7\n* PMI points to euro zone Q3 GDP growth of 0.4 pct -Markit\n* Flash China PMI falls to 15-month low of 48.2\n* Puts pressure on commodity prices from gold to copper\n* For a graphic on euro zone PMI: link.reuters.com/cuh64s\n* Global PMI comparison: link.reuters.com/zuf89t\nBy Jonathan Cable and Wayne Cole\nLONDON/SYDNEY, July 24 (Reuters) - The global economy started the second half of the year on shaky ground as business activity in the euro zone was weaker than expected and China's vast factory sector appeared to be contracting at the fastest pace in 15 months in July.\nThe surveys come just months after the European Central Bank embarked on a 60 billion euro a month bond-buying programme and as Beijing said it would allow its yuan currency to fluctuate more widely within its trading band as a way to support trade.\nMarkit's purchasing managers' indexes (PMI) are one of the earliest monthly economic indicators and could dampen hopes that ECB bond-buying and the tumbling euro are boosting growth and driving inflation higher in Europe.\nAlthough Athens has accepted the conditions imposed on it by its international lenders, and on Thursday approved a second package of reforms required to start talks on a financial rescue deal, Greece's brush with bankruptcy meant July was a turbulent month for the euro zone.\n\"While the latest data suggest that the Greek crisis has not derailed the euro zone recovery altogether, growth seems to be slowing as the boosts from earlier falls in oil prices and the euro exchange rate fade,\" said Jennifer McKeown, at Capital Economics.\nThe euro has sunk more than 9 percent against the dollar since the start of the year, hit by the ECB's massive cash injection and fears a Greek exit from the bloc would bring the whole union crashing down. That has made the bloc's goods cheaper abroad but done little for demand.\nMarkit's Composite Flash PMI, based on surveys of thousands of companies and seen as a good guide to growth, fell to 53.7 this month from June's four-year high of 54.2. A Reuters poll had predicted a more modest dip to 54.0.\nThe headline index has nevertheless now been above the 50 level that separates growth from contraction since mid-2013.\nMarkit said the data provisionally pointed to third-quarter growth of 0.4 percent, slightly weaker than the 0.5 percent predicted in a Reuters poll published on Thursday. Second-quarter growth is forecast at 0.4 percent.\nA corresponding survey due later from the United States is expected to show manufacturers increased activity at the same modest pace as last month. reuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/econ-polls?RIC=USMPMP%3DECI\nMetal prices hit multi-year lows on Friday after the weaker-than-expected data from China and the euro zone.\nCHINESE APPETITE FADES\nFears of faltering demand in China, the world's largest commodity buyer, piled the pressure on resource prices, sending gold to a five-year low and copper to a six-year trough.\nIt also added to the woes of emerging market nations already struggling with the risk of a rise in U.S. interest rates later this year.\nThe flash Caixin/Markit China PMI dropped to 48.2, the lowest reading since April last year and the fifth straight month under 50. According to government data, industrial output is still rising.\nThe drop confounded forecasts for a rise to 49.7 from June's final reading of 49.4 and slugged the Australian dollar to a six-year low.\nChina is Australia's biggest export market and investors use the currency as a liquid proxy for risk in the Asian giant.\nThe survey of executives in over 420 Chinese manufacturing firms found output, new orders and export orders all decreased.\n\"Today, it's big, bad news with this number well below consensus,\" said analyst Helen Lau of Argonaut Securities in Hong Kong. \"It shows there's no signs of recovery in small and mid-sized business in China, but I think it's also related to the summer weak season for demand.\"\nThe China survey overshadowed better news from Japan where the flash Markit/Nikkei PMI rose to a seasonally adjusted 51.4 in July from a final 50.1 in June, a welcome hint of economic acceleration after a surprise slowdown last quarter.\nNotably, new orders in Japan pushed into positive territory which might help explain recent data showing firms are becoming more confident about increasing capital spending.\nYet the survey also found a slowdown in export orders, a trend that is bedevilling Asia and emerging markets generally.\nExpectations of a U.S. rate rise this year have already dented investor appetite for high-yielding but risky emerging market assets. The latest Reuters poll found a majority of analysts now believe the Federal Reserve will hike in September.\nSouth Africa's Reserve Bank on Thursday raised rates for the first time in a year in an attempt to head off inflationary pressure from a falling rand.\n\"The rand remains vulnerable to global market reaction to U.S. monetary policy normalisation,\" warned Governor Lesetja Kganyago, adding that Fed tightening would likely trigger an \"exchange rate-inflation spiral\". (Editing by Hugh Lawson )", "external_links": [], "published": "2015-07-24T13:42:00.000+03:00", "crawled": "2015-07-24T13:10:07.418+03:00", "highlightTitle": ""}