{"organizations": [], "uuid": "cda24fd07d559fa5b1139ce214a4a5a3f0584040", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/3/c/4/x/image.related.afrArticleLead.620x365.gi3c0z.png/1435831148433.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/mining/miners-mugs-mr-asia--and-bat-droppings-20150702-gi3c0z", "country": "AU", "title": "Miners, mugs, Mr Asia – and bat droppings", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Miners, mugs, Mr Asia – and bat droppings | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T10:45:00.000+03:00", "replies_count": 0, "uuid": "cda24fd07d559fa5b1139ce214a4a5a3f0584040"}, "author": "Trevor Sykes", "url": "http://www.afr.com/business/mining/miners-mugs-mr-asia--and-bat-droppings-20150702-gi3c0z", "ord_in_thread": 0, "title": "Miners, mugs, Mr Asia – and bat droppings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "John Gaskell ... geology led to encounters with murderous drug-runners. Janie Barrett by Trevor Sykes Pierpont's favourite drinking companions are geologists. Their first qualification is that they're always thirsty, having spent their formative years chipping at rocks in the arid outback of Australia, where the nearest pub is usually 100 miles or more away.\nTheir second qualification is that they're literally a down-to-earth bunch. They are quite skilled scientists, but the science of geology inevitably entails plodding around a lot of harsh landscape, so they rarely become academically out of touch with the real world.\nFinally – and best of all – any geologist who's been in the profession for a few decades has an excellent knowledge of which ore deposits are likely to be profitable and which aren't: a characteristic which has saved your correspondent from many an investment disaster.\nSo Pierpont was overjoyed when he heard that John Gaskell had written his memoirs, because John is a boy who has been around. He started life in Wigan but now lives in Australia after a career that has taken him through Malawi, Malaysia, Tennessee and a few other places. As there are rocks all around our planet, most geologists have worked in the backblocks of more than one country, which gives them a good perspective on the world.\nOne of John's most memorable journeys began in Singapore in 1976 when he arrived to do a consulting job. He was met by a tall, handsome, affable Kiwi called Martin who was driving a primrose Jaguar XJ6. John's job was to assess a guano deposit in Malaysia. Guano is a great and valuable source of fertiliser for the world's crops. It is also one of the more repulsive materials a geologist can assess.\nJohn's job was to map guano that had been created by the droppings of bats in six caves below a hill named Kota Tongkat in the middle of a Malaysian jungle. Drilling proved there was hard phosphate rock at the bottom of the deposit, but droppings at the top, where John and his assistants had to wade around, were soft and fresh.\nPierpont does not know what the worst job is that a geologist can have, but assessing guano in a bat cave must be a strong contender. Bats are nocturnal creatures, leaving their caves at night to catch insects and returning before dawn to hang upside down from the roof and digest.\nWhen their routine is disturbed in daytime by geologists and drillers, the bats become nervous and excited and start flying around the cave and dropping more droppings. John said the droppings \"like the quality of mercy, were not strained but droppeth like the gentle rain from heaven upon the place beneath, which in this case was me\". Next day he bought a hat.\n Bats weren't the only inhabitants of the caves. There were vast numbers of brown beetles about the size of cockroaches swarming through the guano, living and dying there. And around the edges of the guano were long white constrictor snakes, who lived off dead bats which fell from the roof. Plus some large white toads sploshing about in the guano. It must have made the parched centre of Australia seem like paradise.\nEven nastier were the mine's potential financiers. John met two called George and Chinese Jack after he had assessed the deposit. When John went to George's hotel room to meet him for dinner, he glanced around the room and noticed a small table on top of which were a briefcase, a clutter of papers and a handgun, which John pretended not to see.\nWhen they went through the jungle next day to see the guano, George turned out to be pathologically fearful of snakes and tigers, so maybe he was carrying the gun for protection.\nJohn left Malaysia thinking he would never see any of the financiers again, but he was wrong. In 1979 he was working for Robertson Research in north Wales, when Martin dropped in and invited John and his wife to dinner. Another chap attending was Andrew Maher, whom Martin treated as a gofer.\nThe next morning Martin left to drive to Scotland with Andy. He never got there. Just outside Preston in Lancashire, Andy pulled the car over and shot Martin in the back of the head. That was the end of Martin Johnstone – also known as Mr Asia and the head of Australia's biggest drug syndicate.\nHe had been murdered on the orders of Terrance Clark, who was in a British jail at the time. Andy mutilated Martin's face, cut off his hands, slashed open his stomach, weighed his body down with stones and threw it into a flooded stone quarry.\nThe body was found by two skindivers soon afterwards and, despite the mutilations, was identified by the police. It took John years to discover who all the financiers were, but court cases and the Underbelly TV series helped. George turned out to be an Auckland drug dealer named George Papaconstantinou, while Chinese Jack was Choo Cheng Kui, who supplied all the heroin and marijuana that the syndicate had peddled. By comparison, even the toads looked nice.\nJohn is still wondering why Asia's largest drug ring should have been interested in a bucket and spade guano operation, unless they had some cock-eyed scheme to smuggle heroin in bags of guano.\nGetting back to mining, John's greatest achievement was for Savage Resources, which had pegged several mining leases in the Cloncurry region in 1974. The most important was ML2671 which was subsequently found to include the rich copper-gold mine called Ernest Henry. The granting of the MLs gave Savage the exclusive right to explore them.\nIn 1984, BHP flew airborne magnetic surveys over much of the ground and drilled a few holes, but relinquished their authorities to prospect (ATPs) and released their data when they discovered Savage held the leases.\nIn 1989, the small explorer Hunter Resources applied for ATPs over similar ground to that which BHP had held. A week later Western Mining applied for the same ground, and later agreed to form a joint venture with Hunter.\nIn 1991, WMC wrote to Savage seeking an option over the leases in return for an annual payment of $1000 per lease and a 1.25 per cent net smelter return royalty (NSR). Savage agreed in principle, but nothing more was heard from WMC until June 1999 when they suddenly sent a draft option agreement to Savage. After a little further negotiation, the option deal was done on October 16, 1999.\nAt about the same time, John joined Savage along with Jim Wall, who was appointed managing director and later became chairman.\nOn December 2, WMC wrote to Savage saying they could not properly define ML2671. Ten days later WMC announced the discovery of (what became) the Ernest Henry orebody following four successful diamond drillholes. From the numbers given by WMC, John roughly worked out that there would be something like 60 million tonnes of ore averaging 1.7 per cent copper and 0.9 grams per tonne gold.\nOn his rough numbers the net revenue for the life of the mine (after deducting smelting charges, marketing, concentrate transport and other costs) would be around $2.6 billion. But John was astonished that WMC could have done enough ground geophysical work to locate and prepare four diamond drillholes, hire a rig, drill the holes, log and split 1317 metres of core and have some of it assayed within the time frame.\nThe orebody was worth a lot more than Savage had agreed to sell the leases for. The suspicion was that WMC had been working on the lease before the option agreement had been signed.\nThis suspicion hardened at a meeting with WMC executives in August 1992. Asked how WMC had discovered the orebody so quickly, one executive said the company had been working the area for months. But he denied that WMC had worked on the lease before finalising the option agreement.\nJohn drafted a letter to WMC seeking assurances they had not trespassed. On September 8, WMC's lawyer, Kirsten Mander, wrote to Savage saying they could not give such assurances because there had been doubt about the position of the pegs that defined the lease. She added that WMC had located two of the lease posts in August 1991. That struck a nerve, because WMC wasn't supposed to have been on the ground there in August 1991.\nThat information sparked one of the biggest claim-jumping disputes in Australian history, with John right in the centre. The case was heard in the NSW Supreme Court in 1993.\nThe claim was that before approaching Savage, WMC had repeatedly and knowingly trespassed on ML2671. By not revealing what it had done, WMC's approach had been misleading and deceptive. It became clear from witnesses that WMC knew Savage had the leases and had done some exploration of them before they renewed their request for an option agreement from Savage.\nSo WMC settled. WMC agreed not to enforce its option agreement and paid Savage's legal costs. Hunter was bought out of the joint venture for $30 million of which $12.5m was paid by Savage.\nMeanwhile MIM Holdings, which owned the Mount Isa mine and saw everything in the neighbourhood as its own fiefdom, had been mightily embarrassed that others had found a rich mine in its backyard. So while the dispute was progressing MIM had offered Savage $85 million for 51 per cent of Ernest Henry if its action was successful. To hedge its bets, MIM had also offered to buy Hunter's 30 per cent of the joint venture with WMC if their side had won. When the smoke cleared Savage had 49 per cent of Ernest Henry and a net $75 million in the bank.\nSo John has had an interesting career (he later spent some time finding and marketing rubies for Kerry Packer) and it's well covered in his biography.\nThe book is From Tasmania to Tennessee and Beyond . If you rush out and buy a copy right now, John can afford to buy Pierpont a drink. So you will be making two souls happy.", "external_links": [], "published": "2015-07-02T10:45:00.000+03:00", "crawled": "2015-07-03T00:14:07.000+03:00", "highlightTitle": ""}