{"organizations": [], "uuid": "dee7e3504638d574bb6d567333abc2842b22f130", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/rajasthan-plans-land-acquisition-bill/42889.html", "country": "IN", "title": "Rajasthan plans land acquisition bill", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Rajasthan plans land acquisition bill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T15:57:00.000+03:00", "replies_count": 0, "uuid": "dee7e3504638d574bb6d567333abc2842b22f130"}, "author": "IANS", "url": "http://www.moneylife.in/article/rajasthan-plans-land-acquisition-bill/42889.html", "ord_in_thread": 0, "title": "Rajasthan plans land acquisition bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Rajasthan plans land acquisition bill 42889 Rajasthan plans land acquisition bill 0 Comments, Be the first to comment + COMMENT IANS | 23/07/2015 06:27 PM | With Resurgent Rajasthan Partnership Summit drawing closer, the state government is now planning to come out with a land acquisition bill in the next assembly session likely to be held in next two months, an official said. \"The demand to table the bill in the state assembly has been felt as the state government is of the view that projects signed during Resurgent Rajasthan summit are not held up due to land acquisition... so they plan to come out with the bill before that,\" a senior state government official told IANS. The summit, slated to be held here November 19-20, will have strategic conferences, panel discussions, roundtable deliberations, presentations and one-on-one business meetings. With the event bringing together investors from all over the world for interacting with policy makers, including the political leadership, government officials and local business leaders on the investment environment and opportunities in Rajasthan, the state government expects a significant surge in investor interest and definite commitment to invest as a result. According to sources in the state government, the bill will aim to provide for, and expedite the process of, land acquisition for public purposes with the least disturbance to owners of the land and other interested parties and to provide for fair and better compensation to the original owners. The bill was earlier introduced in the state assembly in September last year but was referred to select committed due to certain issues and objections. Now again with certain modifications - mainly to simplify procedures and provide farmers better compensation, it is likely to be tabled soon in the assembly. Sources said the bill also seeks to protect, in this desert state, double cropped, or irrigated land, from acquisition except if the acquisition is for infrastructure projects. More in Moneylife", "external_links": [], "published": "2015-07-23T15:57:00.000+03:00", "crawled": "2015-07-23T17:59:04.670+03:00", "highlightTitle": ""}