{"organizations": [], "uuid": "3bc3527fb449aac8bed7fa0eb00a88c83e515625", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/8/9/t/9/image.related.articleLeadwide.620x349.gi7xlo.png/1436411367497.jpg", "site_section": "http://www.smh.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.smh.com.au/small-business/insurance/lack-of-life-cover-hits-the-economy-aia-20150708-gi7xlo.html", "country": "AU", "title": "Lack of life cover hits the economy: AIA", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Lack of life cover hits the economy: AIA", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "3bc3527fb449aac8bed7fa0eb00a88c83e515625"}, "author": "", "url": "http://www.smh.com.au/small-business/insurance/lack-of-life-cover-hits-the-economy-aia-20150708-gi7xlo.html", "ord_in_thread": 0, "title": "Lack of life cover hits the economy: AIA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Damien Mu, CEO of AIA Australia: 'We know that the cost of people not having life insurance is having a growing impact on the cost of government.' Photo: Louise Kennerley\nLife insurers need to better engage the federal government over the costs of underinsurance to the Australian economy, and not just focus on issues such as controversial adviser remuneration models, the head of Australia's third-largest life insurer says.\nDamien Mu, chief executive of AIA Australia, said industry discussions placed a lot of emphasis on problems in the life insurance advice sector but not enough was being done to highlight the severe toll that lack of protection could wreak on the country's economy.\n\"We know that the cost of people not [having] life insurance is having a growing impact on the cost of government. If we combine that with the growing concerns and cost of healthcare, there has to be a way in which the life insurance industry can assist in solving these issues,\" Mr Mu told Fairfax Media.\n\"What's the current cost to government? Billions of dollars as people who haven't had sufficient life insurance cover ... rely on government systems,\" he said.\nAdvertisement Mr Mu, who heads AIA, controlling $1.85 billion in in-force life premiums, said adequate levels of cover remains a big problem. He said getting Australians to understand why measures such as income protection are important remains key to easing growing government costs. \"They're financially protected [in the event of a claim], and they don't need to rely on government systems.\"\nAIA sources about 35 per cent of its business from the retail sector, which involves financial advisers distributing their life products directly to customers. The company controls about 13.4 per cent market share in the life market, which paid more than $7 billion in claims last year.\nIndustry hit hard Mr Mu's comments come as life insurers and advisers struggle to resolve significant problems in the industry, including worsening claims, high lapse rates and lawyers encouraging white-collar clients to claim after losing their jobs.\nGroup life insurers who provide cover to Australians through superannuation funds are paying the price of fiercely competing for business before the global financial crisis. Many have been forced to significantly raise prices of their premiums after taking profit hits from claims, while others have been hit by low investment yields.\nInsurers have also been suffering profit hits on the retail side of their businesses due to financial advisers \"churning\" clients. Churn involves planners moving clients from one insurer to another to receive higher upfront commissions.\nLast year, the Australian Securities and Investments Commission discovered that almost one in two pieces of advice given by financial planners working in the life industry failed to comply with the law. Advisers are paid up to 120 per cent of a first year's premiums in advance commissions for their work, but this is likely to change in the near future following sweeping industry proposals backed by Assistant Treasurer Josh Frydenberg.\nThe government has endorsed changes such as capping advance commissions to 60 per cent of a policy's premium cost in the first year by 2018, and banning volume-based payments. Advisers will also need to work under a code of conduct similar to existing practices in Australia's banking sector.\nBut advisers such as Russell Cain from Life Insurance Direct have lashed out, arguing that planners were receiving far less revenue in reality, due to high fees and administration costs. He said advisers could see their business revenue sourced from advance commissions plunge to just 36.4 per cent of the value of the premiums they sell, if the proposals go through.\nMr Mu said he has \"a lot of empathy for advisers out there, and there's also a lot of emotion and anger\".\n\"What people haven't understood is that there really wasn't a choice here. [Life] insurance got carved out of FOFA [Future of Financial Advice reforms] the first time ... there was a need to respond. And the government made it very clear that the industry had a very small amount of time to come up with a solution,\" he said.\n\"I don't think the industry could have moved from commissions to fee for service [immediately],\" Mr Mu said. \"What has been recognised is that there is a cost to providing advice, and advisers play a fundamentally important role in helping Australians get good insurance – we need to look at how we can continue to provide sustainability in that area.\"", "external_links": [], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-10T15:08:38.000+03:00", "highlightTitle": ""}