{"organizations": ["Bloomberg"], "uuid": "bb0ba8b67164f805d651ffd630a31988bd049b6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/institutional-forex/wp-content/uploads/sites/9/2015/04/EU-Greece.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/institutional-forex/exchanges/greek-stock-market-poised-to-reopen-on-monday/", "country": "US", "title": "Greek Stock Market Poised to Reopen on Monday", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Greek Stock Market Poised to Reopen on Monday", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T01:04:00.000+03:00", "replies_count": 0, "uuid": "bb0ba8b67164f805d651ffd630a31988bd049b6b"}, "author": "", "url": "http://www.financemagnates.com/institutional-forex/exchanges/greek-stock-market-poised-to-reopen-on-monday/", "ord_in_thread": 0, "title": "Greek Stock Market Poised to Reopen on Monday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greek Stock Market Poised to Reopen on Monday Greek Stock Market Poised to Reopen on Monday The Greek stock market is reported to reopen early next week, after having been under lock-down for five weeks. Advertising Print This Post Photo: Bloomberg \nThe chairman of the Hellenic securities regulator is optimistic that trading will resume on the Greek stock market early next week following an anticipated decree from the finance ministry, which will spell out new trading rules, according to Reuters . \nSince June 29, banks have been closed and imposed capital restrictions have limited withdrawals from ATMs and foreign transfers, amongst other measures, to prevent the flight of capital from the struggling Mediterranean economy. \nIncluded in the raft of financial restrictions is the Athens Stock Exchange (ASE), with trading suspended over the five-week period amidst concerns that trading by domestic investors would only accelerate capital outflows. \nWe’re working on the basis of Monday but we’re waiting for the minister’s decision. \nDespite several delayed openings by the ASE this week, Konstantinos Botopoulos, Chairman of the Hellenic Capital Market Commission, is optimistic that trading will resume as early as Monday. “We’re working on the basis of Monday but we’re waiting for the minister’s decision, which is the legal prerequisite for the reopening.” \nUnder the new conditions, which have been approved by the European Central Bank, foreign traders should be allowed to trade as per usual, while domestic investors can expect to face restrictions. Specifically, while local investors would be allowed to buy shares using existing cash holdings, withdrawing cash from their Greek bank account to buy shares would be limited. \nAnalysts are already scrambling to predict how the market will emerge from its slumber. Early indications are that Greek shares may face some headwinds. Indeed, many U.S.-listed Greek equity instruments that are tied to Greece have shown significant decline over this period. \nHow [the ASE Index] will trade will be determined largely by the political news on the Greek governing coalition. \nBoth the GREK exchange traded fund (ETF) (GREK.K) – comprised of U.S. market listings of Greek companies – and the National Bank of Greece’s U.S.-listed equity instruments (NBG.N; NBGr.AT) have dropped by 20% since the ASE closed in June. \nCommenting on the imending opening, Ilya Feygin, Managing Director at WallachBeth Capital, told Finance Magnates that according to his estimate, if the exchange were to open now, “the ASE Index would open between 625 and 645, a decline of between 19.1% and 21.6% from the 797.52 level on June 26. How it would trade from there would be determined largely by the political news on the Greek governing coalition as the ECB payment is not due until August 20.” \nAuthorities will be keeping a keen eye on events when trading resumes, and could potentially temporarily suspend shares should any highly volatile movements occur. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-08-01T01:04:00.000+03:00", "crawled": "2015-07-31T23:18:11.364+03:00", "highlightTitle": ""}