{"organizations": [], "uuid": "64ac8469a138be7095e9778f9ba8bb7fa6b2340d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/17/markets-global-idUSL2N0ZX0LI20150717", "country": "US", "title": "GLOBAL MARKETS-Mixed corporate results hit shares, dollar edges higher", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "GLOBAL MARKETS-Mixed corporate results hit shares, dollar edges higher | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T19:46:00.000+03:00", "replies_count": 0, "uuid": "64ac8469a138be7095e9778f9ba8bb7fa6b2340d"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/17/markets-global-idUSL2N0ZX0LI20150717", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Mixed corporate results hit shares, dollar edges higher", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro zone shares dip after Greek relief rally\n* Mixed U.S., European corporate results hurt sentiment\n* Dollar set for strongest weekly gain in two months\n* Spot gold hits five-year low (Updates to open of U.S. markets; changes byline, dateline, previous LONDON)\nBy Sam Forgione\nNEW YORK, July 17 (Reuters) - Stocks worldwide slipped on Friday after some lackluster corporate reports weighed on indexes and a recent Greece-driven relief rally showed signs of fading, while the U.S. dollar was set for its biggest weekly gain in two months.\nDisappointing corporate reports from companies such as Volvo and Boeing hurt sentiment, while European shares gave up gains from the previous session that were fueled by renewed expectations for a Greek debt deal.\nThe Nasdaq composite index, however, still opened at a record high on Wall Street after strong results from Google .\nForecast-beating corporate reports from mobile network supplier Ericsson, appliance maker Electrolux and Swiss fragrance firm Givaudan limited losses on European shares, which were set for their best week since January despite uncertainty over Greece.\n\"The earnings announcements are mixed and there is a little bit of an anticlimax after the Greece headlines,\" said Markus Huber, trader at brokerage Peregrine & Black.\nStrong consumer price index data, rebounding housing starts and surging building permits bolstered expectations that the Federal Reserve was moving closer to hiking rates, which buoyed the dollar.\nThe U.S. dollar index, which measures the greenback against a basket of six major currencies, has risen more than 1.5 percent so far this week, and was last up 0.16 percent on Friday and on track for its strongest weekly gain since May.\nThe Mexican peso, meanwhile, fell by more than 0.6 percent in early trade to a new historic low against the U.S. dollar of 15.92 pesos, Reuters data showed.\nMSCI's all-country world equity index, was last down 0.19 percent at 431.35.\nThe S&P 500 was last down 0.10 percent, at 2122.20 and the Dow Jones industrial average was down 0.39 percent, at 18049.13. The Nasdaq composite was up 0.58 percent, at 5192.983. The index touched an intraday high of 5,198.33.\nThe FTSEurofirst 300 index of top European shares was last down 0.1 percent at 1607.12.\nThe U.S. Treasury yield curve flattened after the solid inflation and housing data strengthened the view that the Fed was inching closer to hiking rates. Yields move inversely to prices.\n\"The housing sector this year has been one of the only sectors that has shown consistent strength, so that continuing, I think, bodes well for the overall economy,\" said Thomas Simons, a money market economist at Jefferies in New York.\nSpot gold prices fell more than 1 percent to their lowest level since April 2010 of $1,130.80 an ounce and was down 1 percent at $1,131.50 by 1426 GMT, pressured by the strong dollar and increasing bets that the Fed will hike rates.\nBrent crude oil prices slipped even as investors squared positions after a third week of losses on expectations of increased exports from Iran adding to an already heavy supply glut.\nInternational benchmark Brent was last down 26 cents at $56.62 a barrel, while front-month U.S. crude futures were last down 62 cents at $50.29. (Additional reporting by Lionel Laurent and Clara Denina in London and Karen Brettell in New York; Editing by Nick Zieminski)", "external_links": [], "published": "2015-07-17T19:46:00.000+03:00", "crawled": "2015-07-17T19:02:47.000+03:00", "highlightTitle": ""}