{"organizations": ["S&T Bancorp, Inc."], "uuid": "c32a64f746dd7624e5e3d5a8c52ec81a1ca8cda0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vanguardtribune.com", "main_image": "", "site_section": "http://www.google.ca/finance/company_news?q=NASDAQ:STBA&ei=zIG5U_DmF4W-wQOOoICIDQ&output=rss", "section_title": "News for S & T Bancorp Inc - Google Finance", "url": "http://www.vanguardtribune.com/2015/07/27/stock-insights-st-bancorp-inc-nasdaqstba-3/28238/", "country": "IL", "title": "Stock Insights: S&T Bancorp, Inc. (NASDAQ:STBA)", "performance_score": 0, "site": "vanguardtribune.com", "participants_count": 0, "title_full": "Stock Insights: S&T Bancorp, Inc. (NASDAQ:STBA)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T22:18:00.000+03:00", "replies_count": 0, "uuid": "c32a64f746dd7624e5e3d5a8c52ec81a1ca8cda0"}, "author": "", "url": "http://www.vanguardtribune.com/2015/07/27/stock-insights-st-bancorp-inc-nasdaqstba-3/28238/", "ord_in_thread": 0, "title": "Stock Insights: S&T Bancorp, Inc. (NASDAQ:STBA)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stock Insights: S&T Bancorp, Inc. (NASDAQ:STBA) \nInvestors are watching shares of S&T Bancorp, Inc. (NASDAQ:STBA) today as the stock opened the current trading session at 31.19 and at the time of writing the last Bid was at 30.94. In the current trading session the stock reached as high as 31.37 and dipped down to 30.80. S&T Bancorp, Inc., a NMS listed company, has a current market cap of 1.08B and on average over the past 3 months has seen 92148 shares trade hands on a daily basis. \nThere are a number of brokerage firms which offer projections on earnings and future stock movement of the stock. On a consensus basis, Wall Street analysts have a short term price of 32.33 on the equity. The company’s trailing twelve month EPS is 1.92. The consensus analyst estimates according to First Call for the next quarter is 0.55. The current year EPS estimate on the stock is 1.99 and the EPS estimate for next year sits at 2.29. \nOn a technical level the stock has a 50 Day Moving Average of 29.84. Based on a recent trade, this puts the equity at +3.69% away from that average. In comparing the stock’s current level to its extended history, the stock is trading -5.90% away from its 52-week high of 32.88 and +34.11% away from the stock’s low point over the past 52 weeks, which was 23.07. \nThe price to earnings ratio, or the valuation ratio of a company’s current share price compared to its per-share earnings sits at 16.15. This is an important indicator as a higher ratio typically suggests that investors are expecting higher future earnings growth compared to companies in the same industry with lower price to earnings ratios. When calculating in the EPS estimates for the current year from sell-side analysts, the Price to current year EPS stands at 15.55. Investors looking further ahead, will note that the Price to next year’s EPS is 13.51. Share this post", "external_links": [], "published": "2015-07-27T22:18:00.000+03:00", "crawled": "2015-07-28T06:25:20.997+03:00", "highlightTitle": ""}