{"organizations": ["Deutsche Boerse"], "uuid": "a6c0a60d5eac5b4df1d34220b59d33494b5ce16f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/deutsche-boerse-buys-forex-trading-051101940.html", "country": "GB", "title": "Deutsche Boerse buys forex trading platform 360T for 725 million euro", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Deutsche Boerse buys forex trading platform 360T for 725 million euro", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T16:06:00.000+03:00", "replies_count": 0, "uuid": "a6c0a60d5eac5b4df1d34220b59d33494b5ce16f"}, "author": "", "url": "https://uk.finance.yahoo.com/news/deutsche-boerse-buys-forex-trading-051101940.html", "ord_in_thread": 0, "title": "Deutsche Boerse buys forex trading platform 360T for 725 million euro", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Jul 26, 2015, 14:42 BST - UK Markets closed Deutsche Boerse buys forex trading platform 360T for 725 million euro Reuters – 35 minutes ago \nPlastic bull figurines, symbols of the Frankfurt stock exchange are pictured at the Frankfurt stock exchange, … \nBy Arno Schuetze and Andreas Kröner \nFRANKFURT (Reuters) - Deutsche Boerse (DB1Gn.DE) said on Sunday that it will buy the Germany-based foreign exchange trading platform 360T for 725 million euros. \n360T is one of a handful of multi-bank, multi-user platforms which have revolutionised foreign exchange trading over the past decade. Deutsche Boerse beat U.S. commodities and currency exchange operator CME Group (CME.O) in the auction, according to sources familiar with the deal. \nThe deal is the biggest acquisition by Deutsche Boerse since the Frankfurt-based stock-exchange operator bought U.S. derivatives exchange ISE in 2007 for $2.8 billion. It is also the first large deal by the new Chief Executive Carsten Kengeter, who is targeting further buys. \nHe is already in talks with Swiss Six Group to buy the remaining stakes in their index joint ventures Stoxx and Indexium. \nOver the last couple of years, several merger and acquisitions had failed, among others a planned tie-up with the New York Stock Exchange 2012. \nDeutsche Boerse said it expects double-digit million euro revenue synergies in the medium term from the deal, which it expects to be immediately accretive to cash earnings. \nA company spokesman said most of the 360T acquisition will be financed with bonds, while no decision has been taken about a potential small capital increase. He added that Deutsche Boerse aims to keep its indebtedness at a level allowing for the AA rating of its Clearstream unit to remain unchanged. \nWith volatility, volumes and returns booming in the dollar's rally over the past year, currency trading is attracting more attention from banks, retail trading houses and investors. \nDeutsche Boerse's Eurex and other major exchange groups have been positioning themselves to take a role in what they expect with time will be a more heavily regulated market. \nBut those efforts have focussed largely on more complicated instruments like options and futures rather than the spot currency transactions that make up the $5 trillion a day market, in which 360T is one of the biggest non-bank players. \n360T founder Carlo Koelzer is credited a decade ago with helping launch a new generation of forex platforms that allowed European companies to pick and choose which banks they traded currencies with. \nData from industry publisher Euromoney shows 360T is now the third-largest such platform, behind Thomson Reuters-owned FXAll (TRI.TO), FX Connect and just ahead of Bloomberg. 360T Managing Director Alfred Schorno told Reuters earlier this year that trading on 360T was above 100 billion euros a day, although the company has since ceased to publish volume data. \n360T was founded in 2000. Private equity group Summit Partners took a majority stake in 2012, peer Brockhaus has kept a 10.7 percent stake and 360T employees also retained stakes. \nThe deal makes 360T the most valuable German fintech company and in the view of the German Startup Association, the transaction will make it easier for other fintech firms to find investors. \n(Editing by Larry King)", "external_links": [], "published": "2015-07-26T16:06:00.000+03:00", "crawled": "2015-07-26T16:45:51.930+03:00", "highlightTitle": ""}