{"organizations": [], "uuid": "58c16971d32c8e8fe4a1c234af87e9426f00317a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/d/a/h/m/image.related.afrArticleLead.620x365.giebj4.png/1437094625263.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/joe-hockey-hits-back-at-bca-over-blanket-attack-20150716-giebj4", "country": "AU", "title": "Joe Hockey hits back at BCA over 'blanket attack'", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Joe Hockey hits back at BCA over 'blanket attack' | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T07:31:00.000+03:00", "replies_count": 0, "uuid": "58c16971d32c8e8fe4a1c234af87e9426f00317a"}, "author": "Phillip Coorey", "url": "http://www.afr.com/news/politics/joe-hockey-hits-back-at-bca-over-blanket-attack-20150716-giebj4", "ord_in_thread": 0, "title": "Joe Hockey hits back at BCA over 'blanket attack'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"I'm not sure that a blanket attack on everyone is going to be helpful to the debate,\" says Joe Hockey. Josh Robenstone Share on twitter by Phillip Coorey Treasurer Joe Hockey has hit back at Business Council of Australia president Catherine Livingstone, saying her criticism of the quality of political leadership was unhelpful to the reforms process.\nHe said her \"blanket attack on everyone\" was unhelpful after an exasperated Ms Livingstone hit out late Thursday and again on Friday morning following a week in which both major parties tore into each other over reform proposals.\nOn Wednesday, a renewed push by Mr Hockey to have the states reconsider their opposition to increasing the GST was dead by lunchtime when the federal opposition and premiers refused to budge.\nOn the same day, a draft proposal by Labor to price carbon was set on by the government even though it was actual policy.\nMs Livingstone branded Wednesday \"a low point for political leadership in Australia\".\n\"Within hours of the Treasurer outlining a compelling case for the need for fundamental tax reform and rebalancing of the tax mix, both major parties began ruling out key elements of sensible tax reform, including changes to the GST,\" she said in a statement.\n\"At a time of great economic uncertainty, Australia needs and deserves strong leadership, and the opportunity to discuss reform options as a community.\n\"Any policy reform is hard, but that is not an excuse for resiling from the challenge.\n \"Our political representatives are elected and paid by the community to implement policies that will best serve the country. Their leadership responsibility is to ensure that there is a constructive, well informed debate, leading to implementable outcomes; it is not to undermine the debate in the cause of party political positioning.\"\nMs Livingstone backed up on on ABC radio on Friday morning, prompting a rebuke from Mr Hockey.\nHe said there should be a focus on areas of agreement if there were to be reform.\n\"I'm not sure that a blanket attack on everyone is going to be helpful to the debate,\" he said.", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-07-17T07:31:00.000+03:00", "crawled": "2015-07-17T05:06:53.000+03:00", "highlightTitle": ""}