{"organizations": [], "uuid": "8d130d65da3ae9366709132ebb5713567780e39c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/vHv3AkYh7yTir.SK.QkW3Q--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/3ded2d5f38ea0699fe2308ab0a1b99c60dc79cef_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/secretive-turkmenistans-silk-road-heritage-034804744.html", "country": "GB", "title": "Secretive Turkmenistan's Silk Road heritage kept under wraps", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Secretive Turkmenistan's Silk Road heritage kept under wraps", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T06:48:00.000+03:00", "replies_count": 0, "uuid": "8d130d65da3ae9366709132ebb5713567780e39c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/secretive-turkmenistans-silk-road-heritage-034804744.html", "ord_in_thread": 0, "title": "Secretive Turkmenistan's Silk Road heritage kept under wraps", "locations": ["Turkmenistan", "Silk Road"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 17, 2015, 05:07 BST - UK Markets open in 2 hrs 53 mins Secretive Turkmenistan's Silk Road heritage kept under wraps By Anton Lomov | AFP – 19 minutes ago View Photo \n\nThe towering minaret and mausoleums of Konye-Urgench in isolated Turkmenistan cut striking forms against the desert sky, yet few foreign visitors make it to a site once at the centre of the Islamic world. \nLike the fabled Silk Road cities of Samarkand and Bukhara in neighbouring Uzbekistan, Konye-Urgench's rich historical legacy is sheltered behind the borders of a secretive former communist Central Asian state that creates significant obstacles to tourism. \n\"People come here from as far away as Australia, New Zealand and Chile,\" said Aman Amanov, a state guide at the dusty UNESCO world heritage site. \nBut, he said, only 3,000 of the 200,000 annual visitors to the site that claimed UNESCO status in 2005 are international tourists -- between a quarter and a fifth of the volume state officials say Turkmenistan welcomes in a year. \n\"The Turkmen visa was the most elusive of them all,\" said Charlie Grosso, a photographer and travel writer, who visited the country in 2012. \nShe travelled to the isolated state as part of the Mongol Rally, a 10,000-mile journey for charity during which motorists travel from Western Europe to Mongolia, traditionally in small, inexpensive vehicles. \n-'Presence of the state'- \nGrosso said she spent nearly half a day dealing with port officials after crossing the Caspian Sea from Azerbaijan. \n\"The people are lovely -- we were given multiple melons during our trip,\" she told AFP. \"But you are basically faced with this unyielding bureaucracy at every turn.\" \n\"You really feel the presence of the state.\" \nOne of the five Central Asian republics to gain independence from Moscow in 1991, the country of five million people is famous for its eccentric leaders, vast gas reserves and secrecy. \nBut Turkmenistan has had to grapple with a drop in global hydrocarbon prices and is looking for other sources of revenue, like tourism. \nIn April, President Gurbanguly Berdymukhamedov said the government needs to diversify the economy and curb spending. \nIn a recent shakeup, he dismissed several senior officials overseeing the economy after the fall in prices in gas and oil -- which make up more than 90 percent of its exports. The country also steeply devalued its currency, the manat. \n- Welcoming foreigners - \nIn a guide available in English, Russian and Turkmen provided to visitors of Konye-Urgench, a message from Berdymukhamedov reads: \n\"Our duty in front of our forefathers is not only to preserve these riches, but to make them accessible to the whole world.\" \nLocated 480 kilometres north of the white marble-clad capital, Ashgabat, Konye-Urgench was a seat of power for the medieval Khorezm kingdom, whose Muslim rulers controlled much of Central Asia in the 12th century after emerging from the shadow of the mighty Seljuk empire. \nEven (Taiwan OTC: 6436.TWO - news ) after Ghengis Khan's armies razed the city in 1221, Konye-Urgench became one of the most important economic hubs along the Silk Road trade routes carrying riches from China and India to markets in Europe. \nUNESCO credits the government of Turkmenistan with generally good conservation practises, and calls Merv, another listed settlement in the country, \"the oldest and most completely preserved of the oasis cities along the Silk Roads in Central Asia.\" \nLittle is done, however, to ease access to the historic sites for foreign visitors. \n-'Intractable visa regime'- \nThe most commonly-issued visa for visitors to the country is a five-day transit visa, with longer stays generally requiring a state-endorsed tour and guides such as Amanov, who stick to the script and steer clear of politics. \n\"Ultimately, only a more open Turkmenistan might aspire to be a tourist destination,\" said Luca Anceschi, a Central Asia expert at the University of Glasgow, who called Turkmenistan's visa regime \"one of the most intractable on earth.\" \nBut Anceschi said Turkmenistan is unlikely to follow the lead of Kyrgyzstan and Kazakhstan, two other Central Asian states that recently introduced visa-free regimes for citizens of developed countries. \n\"Breaking the isolation will certainly be equated by regime veterans as a source of instability,\" he told AFP. \nAside from the country's Silk Road heritage, tourism officials in Turkmenistan are also hoping to pique international interest in Avaza, a multi-billion dollar resort on the Caspian Sea, as well as a crater of burning gas located in the middle of the Karakum desert that local residents nicknamed \"the door to hell.\" \nThe crater, which resulted from a Soviet-era drilling rig collapse in 1971, is attracting a growing trickle of curious sightseers, a tourism official told AFP on condition of anonymity.", "external_links": [], "published": "2015-07-17T06:48:00.000+03:00", "crawled": "2015-07-17T07:09:05.000+03:00", "highlightTitle": ""}