{"organizations": [], "uuid": "964bbd89e8ad4c71fc597c28d9b4c29621de0bd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/0_zKint.54ULh1pFXKVWiw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/rtx1j44z-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-skynews/?format=rss", "section_title": "Finance News | Sky News - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/greece-votes-no-eu-referendum-174416216.html", "country": "GB", "title": "Greece Votes No In EU Referendum - Poll", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Greece Votes No In EU Referendum - Poll", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T21:19:00.000+03:00", "replies_count": 0, "uuid": "964bbd89e8ad4c71fc597c28d9b4c29621de0bd9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/greece-votes-no-eu-referendum-174416216.html", "ord_in_thread": 0, "title": "Greece Votes No In EU Referendum - Poll", "locations": ["Greece", "EU"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nMore than 60% of Greeks have voted 'No' in a crucial bailout referendum that could ultimately decide whether the country leaves the eurozone, says an official poll. \nWith more than a quarter of the ballot papers counted, 61% rejected further austerity, compared with 39% for the Yes campaign. \nSky (Other OTC: BSYBF - news ) 's Europe Correspondent Robert Nisbet said it was a \"convincing win\" for Greek Prime Minister Alexis Tsipras. \nMr Tsipras said it would allow his government to push for a better bailout package from its creditors - the European Union, International Monetary Fund and European Central Bank. \nInterior Minister Nikos Voutsis said turnout was over 50% and voting took place with \"only a minor amount of problematic behaviour\". \nDefence minister Panos Kammenos tweeted that the Greeks \"proved they don't bow to blackmail, to threats\". \nEU leaders have previously warned a No vote could push Greece out of the euro - forcing a return of its drachma currency. \nFrench President Francois Hollande and German Chancellor Angela Merkel said they will meet in Paris tomorrow to discuss the result. \n\"The talks with the French president from 6.30pm and over dinner will be about a common assessment of the situation after the Greek referendum and the continuation of the close German-French cooperation on this subject,\" said a spokesman for Mrs Merkel. \nFrench Economy Minister Emmanuel Macron said negotiations should resume with Greece tomorrow \"no matter what the result\" of the referendum. \nMr Tsipras had indicated he would step down if the Greek people voted Yes - showing they are in favour of budget cuts and tax increases in return for more financial aid. \nGreece's creditors had asked for major reforms and spending cuts in exchange for extending its bailout deal until November in an offer worth several billion euros. \nWhen talks between the government and creditors collapsed last week, the extension was refused and the bailout ended as scheduled on 30 June. \nGreeks have therefore been voting on an offer which is no longer on the table. \nMany shoppers have been panic buying from supermarkets - purchasing essentials such as pasta and flour - as the country's fate unfolds. \nOn Friday, Greece was officially declared in default by the European Financial Stability Facility - days after the nation fell into arrears with the IMF. \nBanks across the country have been closed over the past week, with customers only able to withdraw €60 a day from cash machines. \nEarlier, when Greek Finance Minister Yanis Varoufakis arrived at a polling station in Athens, he was asked by Sky News why people should believe him when he said the banks would re-open on Tuesday when they were running out of money. \nHe replied: \"You're spoiling a celebration with impertinent questions.\" \nWhen asked again, he was silent. \nMore follows...", "external_links": [], "published": "2015-07-05T21:19:00.000+03:00", "crawled": "2015-07-05T21:29:41.000+03:00", "highlightTitle": ""}