{"organizations": [], "uuid": "91743bb743d731d49085396a60ee03aeb5071013", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-banks/?format=rss", "section_title": "Banking News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/barclays-ceo-antony-jenkins-leave-063957493.html", "country": "US", "title": "Barclays Chairman McFarlane axes CEO to speed up strategic change", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Barclays Chairman McFarlane axes CEO to speed up strategic change", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T23:06:00.000+03:00", "replies_count": 0, "uuid": "91743bb743d731d49085396a60ee03aeb5071013"}, "author": "", "url": "https://uk.finance.yahoo.com/news/barclays-ceo-antony-jenkins-leave-063957493.html", "ord_in_thread": 0, "title": "Barclays Chairman McFarlane axes CEO to speed up strategic change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 8, 2015, 21:37 BST - UK Markets closed Barclays Chairman McFarlane axes CEO to speed up strategic change Reuters - UK Focus – 31 minutes ago \n* Jenkins sacked after three years in post \n* Row with investment bank boss undermined position -source \n* Chairman to assume executive duties until successor found \n* Investors had expected Jenkins to be given more time \n* Shares (Berlin: DI6.BE - news ) up 2 percent \n* Graphic: http://link.reuters.com/weg25w (Adds further details on background to departure) \nBy Matt Scuffham and Sinead Cruise \nLONDON, July 8 (Reuters) - Barclays Chairman John McFarlane has fired the British bank's chief executive after he had lost the support of non-executive directors in a clash over style and the pace of the bank's turnaround. \nThe move comes just three months after McFarlane joined the bank and three years after Antony Jenkins was promoted to CEO, having been the bank's retail chief. McFarlane, who had signaled his intention to speed up Barclays (LSE: BARC.L - news ) ' turnaround efforts when he took the post in April, will assume executive duties until a permanent successor is appointed. \nMcFarlane said on a conference call on Wednesday he had spoken to Jenkins last week about his position after independent directors of the bank complained to him about the CEO's leadership style. \nNicknamed \"Saint Antony\" for his drive to clean up the group's culture after an interest rate-fixing scandal, Jenkins' understated approach, in contrast to the brash style of his predecessor Bob Diamond, rubbed board members up the wrong way. \nJenkins' position was also undermined by a row with the boss of Barclays' investment bank, Tom King, over the future of the business. \nJenkins wanted to slash the investment bank's assets more aggressively, according to a person familiar with the matter, but King resisted saying he would retire early from the bank if such a strategy was pursued. \nThe source said that McFarlane intervened to ensure that King would stay and that the disagreement appeared to have undermined Jenkins's position. \nReuters could not immediately reach Jenkins for comment. King declined to comment. \nJenkins' exit, which will be soothed with a payoff of more than 2 million pounds ($3 million), was confirmed at a board meeting late on Tuesday. \nBarclays is the fourth major European bank to change CEO this year. Deutsche Bank (Xetra: 514000 - news ) , Credit Suisse (NYSE: CS - news ) and Standard Chartered (HKSE: 2888.HK - news ) also named new leaders amid investor disquiet over low share prices and stubbornly high costs. \nAlthough shares in Barclays have underperformed rivals since Jenkins' appointment in August 2012, he was expected by many analysts to be given longer to implement a turnaround strategy involving the divestment of non-core assets, improving returns and cutting costs. \n\"The announcement came as a surprise ... but was not completely unexpected, with returns from the investment banking division still disappointing. The chairman comes with a good reputation and I would back him in his decision,\" said David Smith, co-manager of Henderson High Income fund, which has a stake in Barclays. \nThe investment bank's performance improved in the first quarter as volatility drove trading, but revenue rose just 2 percent, less than Wall Street rivals such as Goldman Sachs (NYSE: GS-PB - news ) . \nShares in Britain's third-biggest bank by market value closed up 2 percent at 260 pence, having dropped the previous session to a two-month low. \nThe move echoes McFarlane's actions at insurer Aviva (Other OTC: AIVAF - news ) , where he took over the full-time running of the insurer in May 2012 having delivered a damning assessment of Chief Executive Andrew Moss's five years in charge. \nWarning signs were evident when McFarlane highlighted the poor performance of Barclays shares in a letter to shareholders after joining the bank in April. \nShares in Barclays are trading at just 0.7 times the value of the bank's assets. In comparison, British rival Lloyds , which only has a small investment banking business, is trading at 1.3 times. \nMcFarlane said under Jenkins shareholder value creation had been pushed \"too far into the future\". He said the bank was in no rush to appoint a successor and the most important thing was to find the right person, adding it would be good to find someone familiar with investment banking. \nINVESTMENT BANKERS WELCOME MOVE \nThe 68-year-old Scot faces a host of challenges as the British bank grapples with regulatory pressures, such as a demand to separate domestic retail banking operations from riskier investment banking operations, while trying to improve its overall performance. \nJenkins' successor will be tasked with accelerating the run-down of Barclays' non-core assets. The bank also needs to resolve allegations over alleged past misconduct, while bringing returns back above its cost of capital and deciding how big to keep its investment banking operation. \nOne senior Barclays executive said the move was seen positively by its investment bankers, noting McFarlane had recently told staff of his commitment to the business. Jenkins had presided over cuts to the investment banking operations involving hundreds of job losses. \n\"It's the best possible public message that we could have wished for. He got rid of the guy who was questioning this,\" said the executive, speaking on condition of anonymity. \nWith his background in retail banking, Jenkins had little affinity with Barclays' investment bankers and McFarlane indicated his successor will need to have a more established track record in investment banking. \nHe also emphasized the importance of the investment bank in Barclays' strategy, seeming to rule out any chance of Barclays exiting it altogether. \n\"It will be good to have someone that has some familiarity with the investment banking business as it's such an important part of the business,\" McFarlane said. \nCandidates to replace Jenkins could include Finance Director Tushar Morzaria, appointed in July 2013 having been chief financial officer of JP Morgan Chase's corporate and investment banking division. \nMorzaria has struck up a strong relationship with McFarlane, according to industry sources. \nAnother internal candidate could be Jonathan Moulds, the former Bank of America Merrill Lynch executive who was appointed to the newly created role of chief operating officer in January. ($1 = 0.6487 pounds) (Additional reporting by Steve Slater, Nishant Kumar, Sinead Cruise, Simon Jessop and Paul Sandle; Editing by David Holmes and Susan Fenton)", "external_links": [], "published": "2015-07-08T23:06:00.000+03:00", "crawled": "2015-07-08T23:40:14.000+03:00", "highlightTitle": ""}