{"organizations": [], "uuid": "9ff28ae21fbbbc4ed4674c9d5137c9a91ac2073a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/imagecache/original-size/images/print-edition/20150725_FNC535.png", "site_section": "http://www.economist.com/rss/finance_and_economics_rss.xml", "section_title": "The Economist: Finance and economics", "url": "http://www.economist.com/news/finance-and-economics/21659727-opening-new-bank-america-provides-hope-more-will-follow-bank-free", "country": "US", "title": "Bank free or die", "performance_score": 0, "site": "economist.com", "participants_count": 1, "title_full": "Bank free or die | The Economist", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "9ff28ae21fbbbc4ed4674c9d5137c9a91ac2073a"}, "author": "From the print edition", "url": "http://www.economist.com/news/finance-and-economics/21659727-opening-new-bank-america-provides-hope-more-will-follow-bank-free", "ord_in_thread": 0, "title": "Bank free or die", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BARREN, dry, desolate. These are words you might choose to describe the terrain left by California’s ongoing drought. But they apply just as readily to the landscape for bank startups in America. In the 25 years before Lehman Brothers collapsed, new banks were licensed at an average rate of 164 per year. Since, the industry has been suffering a seriously arid spell. In 2011 no new banks were licensed, making it the first such year since at least 1934. When Primary Bank, based in New Hampshire, opens its doors on July 28th, it will be just the second lender in America to do so in five years. And it will be a welcome sight, given that small banks play a vital role in the economy.\nThe new bank began in the mind of Bill Greiner, a New Hampshire businessman who had grown frustrated with large banks. In early 2008, he applied for a commercial-property loan from Citizens Bank, then an American subsidiary of the embattled Royal Bank of Scotland. But despite a proven track record and a 50% downpayment, he was turned away. Baffled, he turned to Hampshire First Bank, a local lender. The relationship was happy, but short-lived: in 2012, the bank was purchased by another institution. Soon after, another local bank was acquired. As small banks disappeared from New Hampshire, Mr Greiner detected an opportunity and, joined by four other local businessmen, resolved to open his own.\nIn this section Into the home stretch Bargaining chips The long march to normality Bank free or die Bypassing the voters Much ado about trading Destination unknown New Hampshire United States\nIn a state where residents assert their uncompromising independence with the slogan “live free or die”, it should be no surprise that Mr Greiner found considerable local support. Ownership of the bank is spread across more than 360 shareholders, most of whom are from New Hampshire. Each represents a potential customer or advocate. According to one investor, the bank has created a “buzz in the air”.\nThe banking industry has been consolidating since the 1980s, when lawmakers loosened interstate banking restrictions. The number of commercial banks peaked at around 14,500 in 1984 before falling to 5,570 today (see chart). But even as the growing behemoths of the industry gobbled up their smaller brethren, new banks would always sprout up to help offset the decline.\nResearchers from the Federal Reserve Bank of Kansas City reckon there is a link between consolidation and startups. When large or out-of-state banks acquire smaller ones, service suffers, encouraging new banks to set up shop and fill the resulting void.\nToday there are lots of such voids. Since 2010 hundreds of small banks have been bought by large or distant rivals. But in the wake of the financial crisis, would-be bankers have faced a shaky economy and heightened scrutiny from nervous regulators. Low interest rates have also made life difficult for small banks. Such lenders usually concentrate on the traditional activities of gathering deposits and making loans, and so their profits are largely determined by the spread in interest rates between the one and the other. When rates are low, as they have been since 2010, this spread narrows and lending margins fall.\nThe resultant dearth of bank startups is troubling. Although small banks accounted for just 22% of all bank lending in America in 2014, they held 51% of all small-business loans and 77% of all agricultural loans, according to a study from Harvard University. That is partly because their loan officers can use their personal knowledge of a borrower and the local economy to evaluate credit risk.\nSuch local knowledge does not fit neatly with the impersonal lending procedures used by big banks, which are more geared towards large borrowers which have hard data, such as financial statements and credit ratings. Although new platforms—such as peer-to-peer lenders—are emerging, they are young and limited in size. In the meantime, America’s small businesses hope that more will follow in Mr Greiner’s footsteps.\n ", "external_links": ["http://cdn.static-economist.com/sites/default/files/imagecache/original-size/images/print-edition/20150725_FNC535.png"], "published": "2015-07-25T03:00:00.000+03:00", "crawled": "2015-07-24T06:23:05.731+03:00", "highlightTitle": ""}