{"organizations": [], "uuid": "7dcef4ca45dc41b1cbf0c43cea03a3f24ba21627", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507231224.html", "country": "US", "title": "Zimbabwe: Desperate Women Flock to Cross-Border Trade Despite Risks", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Desperate Women Flock to Cross-Border Trade Despite Risks", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T14:06:00.000+03:00", "replies_count": 0, "uuid": "7dcef4ca45dc41b1cbf0c43cea03a3f24ba21627"}, "author": "", "url": "http://allafrica.com/stories/201507231224.html", "ord_in_thread": 0, "title": "Zimbabwe: Desperate Women Flock to Cross-Border Trade Despite Risks", "locations": ["Uganda", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Uganda: Polygamy - Social Malaise or Necessary Evil? \nZimbabwe's job market has shrunk on the back of an economy that analysts say will stagnate or fall into recession this year. The economy slumped by 45 percent during 1998-2008 at the height of an economic crisis, prompting factory closures, huge unemployment and growing food shortages. \nSome 65 percent of Zimbabwe's 14 million people now rely on the informal sector to survive, according to the African Development Bank. \nDonors have withheld financial aid to the southern African country in protest over President Robert Mugabe's controversial policies, including his seizure of white-owned farms in 2000. \nNow more than three million Zimbabweans, most of whom are women, make a living buying goods in neighbouring South Africa and reselling them across the region, according to Killer Zivhu, head of the Zimbabwe Crossborder Traders Association. \nBut some never make it home. \nThe bodies of two Zimbabwean women, who had been assaulted before being killed, were recently found in Germiston, 15 km (9 miles) east of South Africa's capital Johannesburg. \nAround 25 Zimbabwean women were kidnapped in South Africa between May 30 and July 11, according to a report in the Zimbabwean newspaper The Herald. \nA Zimbabwean gang is believed to be behind the attacks, targeting women at the border town of Musina by offering them transport for the 500 km journey south to Johannesburg, it said. \nOPEN TRUCKS \nMany women say they feel they have no choice but to take the cheapest transport they can find, despite the risks. \nThey can spend up to three months criss-crossing Angola, Mozambique, Zambia, Namibia and Malawi before coming home. \nMatanda travels around 3,000 km northwest, through Zambia, to sell clothes, bed sheets and tablecloths in the remote Angolan town of Saurimo. \n\"The journey by road from Harare takes about seven days and we travel in open trucks through very dangerous terrain,\" she said. \nSome travellers are killed by malaria and yellow fever on route. Accidents are also common on the decrepit roads. \n\"It is difficult and expensive to bring the bodies back to Zimbabwe for burial,\" she said. \nMore than a decade of economic crisis has driven many Zimbabweans to desperation. \nMore than 80 percent of Zimbabweans are unemployed, according to the World Bank, although the government puts the figure at 11 percent. \nMore than 10 companies have shut down each month over the past two years, according to the country's National Social Security Authority. \nFactories lie idle in the once prosperous southern African country's industrial heartlands. \nDespite the risks of cross-border trading, many women say they have no alternative. \n\"I will soldier on,\" said Nora Sithole, 34, a single mother of three, who was robbed of her passport and over $1,000 on the road last year. \nSithole regularly travels over 1,000 km north from the Zimbabwean border town of Mutare to Lichinga city in northern Mozambique to sell blankets and clothes. The journey takes two days. \n\"We cannot help it,\" she said. \"We want to feed our families.\" \n- Reporting by Andrew Mambondiyani; Editing by Katy Migiro and Belinda Goldsmith Zimbabwe \nAfrican Union and SADC chairperson, President Mugabe has called on the continent's leaders to unite against their common … see more » Copyright © 2015 Thomson Reuters Foundation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-23T14:06:00.000+03:00", "crawled": "2015-07-23T14:40:52.757+03:00", "highlightTitle": ""}