{"organizations": [], "uuid": "faac66b9a16bf48c600a484d07dbed1a866d7406", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "http://media.guim.co.uk/0ab54269887252195c9d40bf6fe3fdef6382d45c/18_479_5799_3480/master/5799.jpg", "site_section": "http://www.theguardian.com/money", "section_title": "Personal finance and money news, analysis and comment | Money | The Guardian", "url": "http://www.theguardian.com/society/2015/jul/07/charities-investigated-for-calling-vulnerable-people-for-money", "country": "GB", "title": "Charities investigated for 'calling vulnerable people for money' | Society", "performance_score": 1, "site": "theguardian.com", "participants_count": 47, "title_full": "Charities investigated for 'calling vulnerable people for money' | Society | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T09:21:00.000+03:00", "replies_count": 57, "uuid": "6e5c681863d1abe71a54719523191fbbe03f7156"}, "author": "Dominic Smith", "url": "http://www.theguardian.com/society/2015/jul/07/charities-investigated-for-calling-vulnerable-people-for-money#post-0", "ord_in_thread": 0, "title": "Charities investigated for 'calling vulnerable people for money' | Society", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Information Commissioner’s Office is to investigate four of the UK’s largest charities, following allegations that their fundraisers contacted people registered with the government’s opt-out nuisance call database.\nThe NSPCC, British Red Cross, Oxfam and Macmillan Cancer Support face accusations that their staff made fundraising calls to people registered with the Telephone Preference Service (TPS), designed to stop them receiving unsolicited sales calls. The information rights watchdog confirmed that the charities now face an investigation to see if they have broken data protection laws.\nA spokesperson for the Information Commissioner’s Office, the watchdog responsible for enforcing data protection laws, said: “We’re aware of allegations raised against several charities, and will be investigating whether there have been any breaches of the Data Protection Act or privacy and electronic communication regulations.”\nThe workers at a London call centre fundraising on behalf of the charities are accused of calling, and being prepared to take money from, vulnerable people, including the elderly and those living with dementia, the Daily Mail reports .\nThose with dementia and Alzheimer’s are allegedly being treated as legitimate targets – as long as they agree to the call and are able to answer a few basic questions over the phone, the newspaper reported.\nThe investigation comes after 92-year-old poppy seller Olive Cooke apparently killed herself earlier this year after feeling overwhelmed by fundraising requests from charities.\nGoGen, the call centre at the heart of the investigation, denied “many of the claims”, and said they “do not make cold calls of any kind to TPS-registered data supplied by third parties generated by lifestyle or profiled survey questionnaires”.\nThe spokesman said the company has consulted with the fundraising regulator and “agreed to have the [Fundraising Standards Board] conduct a thorough investigation into these allegations”.\nThe charities concerned said they were aware of the allegations. Tim Hunter, Oxfam’s fundraising director, said the charity only contacts those on the TPS if they have given explicit consent. “I have personally tested the robust measures in place to ensure these standards are maintained and vulnerable people are protected. We monitor calls, carry out undercover spot checks and work with the industry watchdog to make sure our strict guidelines are followed,” he said.\nFacebook Twitter Pinterest Olive Cooke, 92, killed herself after feeling overwhelmed by fundraising requests. Photograph: PA A Macmillan spokeswoman said the charity do not wish to contact people if they are aware it is unwarranted. “We take the requests of our supporters very seriously and all supporters can choose to unsubscribe from communications at any time,” she said.\n“We would not hesitate to take robust action if we found our agencies were not acting with utmost integrity on our behalf.”\nAn NSPCC spokesman said: “We have clear contractual arrangements in place with those that fundraise on our behalf, including strict guidance on vulnerable people, and expect the highest standards of behaviour from everyone who operates under the NSPCC banner.\n“We regularly review the companies we use and will take breaches of those standards extremely seriously.\n“Any suggestion of inappropriate activity is deeply worrying and we would want any concerns to be raised with us immediately so that they can be quickly addressed.”\nA British Red Cross spokeswoman said: “The British Red Cross will not tolerate lapses in maintaining the highest standards to protect vulnerable people.\n“We would never knowingly ask for donations from someone with Alzheimer’s or dementia, and further measures are being put in place to ensure best practice is followed at all times.”\nEarlier this year, the government announced a crackdown on companies that plague households with nuisance calls, allowing for fines of up to £500,000. Last year there were more than 175,000 complaints made to the commissioner regarding nuisance calls and texts.", "external_links": ["https://twitter.com/intent/tweet?text=Charities+investigated+for+%27calling+vulnerable+people+for+money%27&url=http%3A%2F%2Fgu.com%2Fp%2F4aevt%2Fstw%23img-2", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4aevt%2Fsfb%23img-2&ref=responsive", "http://www.pinterest.com/pin/create/button/?description=Charities+investigated+for+%27calling+vulnerable+people+for+money%27&url=http%3A%2F%2Fwww.theguardian.com%2Fsociety%2F2015%2Fjul%2F07%2Fcharities-investigated-for-calling-vulnerable-people-for-money&media=http%3A%2F%2Fmedia.guim.co.uk%2F79cfe4b72bb54d7706facc36525d581345c0b628%2F0_416_2503_1502%2F2503.jpg", "http://www.dailymail.co.uk/news/article-3151533/Shamed-charity-cold-call-sharks-Britain-s-biggest-charities-ruthlessly-hound-vulnerable-cash-try-opt-receiving-calls.html"], "published": "2015-07-07T09:21:00.000+03:00", "crawled": "2015-07-07T13:31:04.000+03:00", "highlightTitle": ""}