{"organizations": ["Western Union", "ADB"], "uuid": "7785c1552e7a964d7b5a5597e688ce763d1ea8d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/f30ldp5ccw_8963567714879_7421018191975.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/633221/1/adbs-ipo-controversy-has-no-bearing-on-our-partner.html", "country": "US", "title": "ADB's IPO controversy has no bearing on our partnership - Western Union", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "ADB's IPO controversy has no bearing on our partnership - Western Union", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T01:06:00.000+03:00", "replies_count": 0, "uuid": "7785c1552e7a964d7b5a5597e688ce763d1ea8d8"}, "author": "", "url": "http://www.modernghana.com/news/633221/1/adbs-ipo-controversy-has-no-bearing-on-our-partner.html", "ord_in_thread": 0, "title": "ADB's IPO controversy has no bearing on our partnership - Western Union", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  30 July 2015 23:06 CET ADB's IPO controversy has no bearing on our partnership - Western Union By Joy Business \nInternational money transfer operator, Western Union has ruled out any possible impact of the ongoing confusion over ADB’s Initial Public Offering on its partnership with the bank. \nAgricultural Development Bank is the pioneer agent for Western Union money transfer services not only in Ghana but the entire African continent. But given the current controversy that led to an injunction on the bank’s IPO, many wonder whether Western Union as a partner is not concerned. \nSpeaking to Joy Business Editor, Emmanuel Agyei during his visit to Ghana as part of his company’s 20 th Anniversary in Africa, Western Union’s President for Africa and other regions, Jean Claude Farah explained, they have no cause for worry. \n“As Western Union, our business model relationship basically ends with our agents, we respect the privacy of our agents. But I heard about the IPO and I even had a discussion on it with the Managing Director of ADB but it was a social discussion. So I’m not sure it’s going to have lots of implications because at the end of the day it is not the way an agent is structured but as long as customers are serviced the right way.” \nHe further explained why the development would have no bearing on their operations. \n“I’m not going to take the example of ADB in specific but take you back to the business model. Basically, If I take you to an agent in let’s say Egypt, the obligation of an agent is to make sure that the money is disbursed to the right recipient, so this is the transaction I am looking for, on the same side someone is collecting the money from the customer but putting it into our system that takes care of its compliance settlement, treasury and everything. So obviously the bank whether privately owned or government owned does not hit that process” he said.", "external_links": [], "published": "2015-07-31T01:06:00.000+03:00", "crawled": "2015-07-31T05:34:46.029+03:00", "highlightTitle": ""}