{"organizations": [], "uuid": "7ff43a613d2fd9943b6a277bc3d736db1be90079", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/27/102867462-GettyImages-477477188.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss/rss.html", "section_title": "Finance", "url": "http://www.cnbc.com/2015/07/29/whats-the-hurry-janet-federal-reserve-commentary.html", "country": "US", "title": "Dear, Janet: What's the hurry?", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "Dear, Janet: What's the hurry?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T00:03:00.000+03:00", "replies_count": 0, "uuid": "7ff43a613d2fd9943b6a277bc3d736db1be90079"}, "author": "", "url": "http://www.cnbc.com/2015/07/29/whats-the-hurry-janet-federal-reserve-commentary.html", "ord_in_thread": 0, "title": "Dear, Janet: What's the hurry?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Janet"], "text": "CNBC.com SHARES \nThe Federal Reserve should not be in a hurry to raise interest rates and the latest Federal Open Market Committee statement shows they know it . Getty Images Federal Reserve Bank Chair Janet Yellen. \nWhile the jobs picture has improved, an inflation rate above 2 percent hasn't materialized. Price stability, or more accurately steady inflation, is the Fed' s second and possibly more important mandate. Despite flooding the economy with unprecedented amounts of free money, the rate of inflation has remained stubbornly low. \nRead More Here's what changed in the new Fed statement \nMore concerning is that the Fed's own actions could push the global economy into outright deflation. \nThe global economy has been broadsided by a deflationary shock. The slowdown in China is one reason for deflationary pressures, but a rising U.S. dollar is just as much to blame. Since most industrial inputs (commodities etc.) are priced in U.S. dollars, a rising dollar pushes prices down. On the surface, one might think that falling input costs area good thing — after all, if a product can be made less expensively, then the corporation should have higher profits. However, this assumes that the price to the consumer remains unchanged. But when falling input prices reflect falling demand (like they are now), the price to the consumer also falls. This means that the company receives no margin benefit from deflation. \nConsumers are also quite savvy about purchasing decisions and falling prices often cause consumers to put off purchases while they await lower prices. In response to falling demand, corporations cut back on production, which leads to a cutback in jobs in the medium run. This deflationary spiral is one of the most difficult economic problems to short-circuit. By its own admission, the Federal Reserve has time-tested tools to fight inflation but its deflation-fighting arsenal is severely lacking. \nRead More Can you guess Janet Yellen's single favorite word? \nOver the last year, the Federal Reserve has gone to great trouble to convince investors that any interest-rate increase will be gradual. However, the Fed has miscalculated investor reactions. Market participants may hear the Fed say that a rate increase is gradual, but the rise of the U.S. dollar indicates that investors are buying dollars in anticipation of the eventual rate-hiking cycle. The problem with this dynamic is that it is pushes prices down on everything from copper and steel to oil. Exacerbating the problem is a slowdown of unknown proportions in the Chinese economy. \nThe flaw in the Fed's logic is that it views declining oil prices as temporary and not necessarily a reflection of a larger slowdown in the global economy. Forecasting is a difficult business, especially when it is about the future, but the reality is that nether I nor the Fed can accurately forecast whether price declines are permanent or temporary. Additionally, not even the Chinese government has an idea of how bad the economic slowdown could be — it was stunned by the stock-market crash, why should we expect it has a better handle on the Chinese economy? \nTo be clear, I am not advocating for a weak-dollar policy, nor am I suggesting that more quantitative easing is the prescription. My only point is this: \nThe Fed has kept interest rates at \"emergency\" levels for six years, knowing that it has better tools to fight inflation rather than deflation and that the extent of the global economic slowdown is unknowable. \nSo, there is only one question to ask Chair Yellen: What's wrong with waiting 6 months? \nRead More Alan Greenspan: This is 'extremely dangerous' \nBrian Kelly is founder and managing member of Brian Kelly Capital LLC, a global macro investment firm catering to high net worth individuals, family offices and institutions. He is also the creator of the BKCM Indexes, benchmarks for multi-asset money managers. He's also the author of the upcoming book, \" The Bitcoin Big Bang: How Alternative Currencies Are About to Change the World .\" Kelly, a CNBC contributor, often appears on \" Fast Money .\" Follow him on Twitter @BKBrianKelly . Brian Kelly Founder and Managing Member, Brian Kelly Capital LLC SHOW COMMENTS", "external_links": [], "published": "2015-07-30T00:03:00.000+03:00", "crawled": "2015-07-30T01:03:18.535+03:00", "highlightTitle": ""}