{"organizations": [], "uuid": "37a0e21d1ca0ab76e37436fddb43a25543fb39f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/UDquEKbEOQjWWK9LgaUCKg--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/cf329a7585fd44a5992f2cbecc82c2483831a530_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/kazakhstan-backs-olympic-promises-oil-204549527.html", "country": "US", "title": "Kazakhstan backs Olympic promises with oil fund", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Kazakhstan backs Olympic promises with oil fund", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T23:45:00.000+03:00", "replies_count": 0, "uuid": "37a0e21d1ca0ab76e37436fddb43a25543fb39f7"}, "author": "", "url": "https://uk.finance.yahoo.com/news/kazakhstan-backs-olympic-promises-oil-204549527.html", "ord_in_thread": 0, "title": "Kazakhstan backs Olympic promises with oil fund", "locations": ["Kazakhstan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 29, 2015, 22:12 BST - UK Markets closed Kazakhstan backs Olympic promises with oil fund AFP – 27 minutes ago View Photo \n\nKazakhstan will break into its $70 billion sovereign wealth fund to help pay the bills if it wins the 2022 Winter Olympics, Prime Minister Karim Massimov said Wednesday ahead of an IOC vote. \nThe International Olympic Committee, which will vote between the former Kazakh capital of Almaty and Beijing on Friday, has said the Central Asian republic's reliance on oil revenues is a risk. \nBut Massimov told a small group of journalists including AFP that Kazakhstan was planning on oil staying at its weakened price of $50 a barrel. \nHe said Kazakhstan's fund was modelled on one used by Norway to hold its oil and gas revenues. Kazakhstan's oil and gas accounted for about a quarter of its gross domestic product in 2013, according to the Extractive Industries Transparency Initiative. \nThe wealth fund \"now stands at $70 billion, some of which would be used for the Olympics if Amaty wins the vote on Friday,\" the prime minister said. \nBeijing is considered the strong favourite to win the 2022 vote. But Massimov said Kazakhstan, which became independent from the Soviet Union in 1991, wanted the Olympics as part of a campaign to put its name on the international map. \nKazakhstan was formally accepted as a member of the World Trade Organization on Monday -- after almost two decades of lobbying -- and Massimov said the government was next targeting membership of the Organisation for Economic Cooperation and Development. \n\"We are a young nation, for us to have something like (the Olympics), it's a big challenge and a big opportunity,\" the prime minister said. \n\"In the international arena it can help to place Kazakhstan on the map and Almaty on the world sports map in the future.\" \nMassimov would not say if the country's authoritarian president, Nursultan Nazarbayev, would come to Kuala Lumpur to promote his country's case. \nThe country has faced strong criticism over the treatment of Nazarbayev's political opponents and ethnic minorities. But China has also been lambasted by rights groups. \nThe prime minister insisted that win or lose, Kazakhstan was determined to modernise. \n\"In the next four to five years, Kazakhstan will come out of an era of low prices for commodities even stronger and more competitive,\" he said. \n\"We want in 2050 to be among the 30 most developed economies in the world. We want to change the image and situation in our country,\" according to Massimov.", "external_links": [], "published": "2015-07-29T23:45:00.000+03:00", "crawled": "2015-07-30T00:13:56.941+03:00", "highlightTitle": ""}