{"organizations": ["GM"], "uuid": "f2c51d4c63a6f17e70582cf3d4496de881339fc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "//s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/gmwithflag.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.thestreet.com/story/13215341/1/gm-cat-aapl-swks-jim-cramers-views.html?puc=yahoo&cm_ven=YAHOO", "country": "GB", "title": "GM, CAT, AAPL, SWKS: Jim Cramer's Views", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "GM, CAT, AAPL, SWKS: Jim Cramer's Views", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T08:00:00.000+03:00", "replies_count": 0, "uuid": "f2c51d4c63a6f17e70582cf3d4496de881339fc3"}, "author": "", "url": "http://www.thestreet.com/story/13215341/1/gm-cat-aapl-swks-jim-cramers-views.html?puc=yahoo&cm_ven=YAHOO", "ord_in_thread": 0, "title": "GM, CAT, AAPL, SWKS: Jim Cramer's Views", "locations": ["NEW YORK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jim Cramer"], "text": "NEW YORK ( Real Money ) -- Jim Cramer shares his views every day on RealMoney. Click here for a real-time look at his insights and musings. \nWhat If Everything Fell Into Place? Yeah, Right \nPosted at 5:59 p.m. EDT on Friday, July 10, 2015 \nWhat are the odds that both China and Greece work out this weekend? What are the odds that most stocks in the Chinese market open and the averages just kind of do nothing? What are the odds that both the radical left in Greece and the hard right in Germany agree? \nMust Read: 10 Ways Your Clothes Can Seriously Hurt You \nPretty much all of those things have to work out not to roll back a lot of these gains, which, frankly, is pretty insane. Yet it sure seemed like people think everything's going to come up aces, as if they know the answer. \nI don't think they do. So the blow could be pretty great if both Greece and China fall apart. I know I would have been tempted at the end of the day to have some puts on the usual suspects of General Motors ( GM - Get Report ) , Caterpillar ( CAT ) and Cummins ( CMI ) in China and the very liquid Deutsche Bank ( DB ) for Germany. But that would have taken, somehow, more bravery than buying calls with the way this tape was flying. (General Motors is part of TheStreet's Action Alerts PLUS portfolio.) \nIn the end, today was the most bullish day we have had in ages, with every sector except for energy screaming, and one has to figure that people seem to be betting that we all got too negative no matter what happens, or at least if we only bat 1-for-2. \nAt the time of publication, Action Alerts PLUS, which Cramer co-manages as a charitable trust, was long GM. China's Moves to Stabilize Stocks May Work \nPosted at 1:36 p.m. EDT on Friday, July 10, 2015 \nChina's in big trouble. Everyone knows it. They didn't know a few weeks ago when its stock market was flying high and millions were flocking into the very capitalist but also very casino-like Chinese stock market. \nNow everyone knows, though, after a 36% fall in its averages from their peak (at about the same speed of the decline in the Nasdaq after it hit its peak in March 2000) that a Chinese bear market is well in the offing. Plus the government seems hapless -- as hapless as the little Dutch boy with his fingers in the dike -- while millions watch their life savings disappear. In an attempt to stem the flow of sell orders, the government has frozen trading in many stocks, stopped a lot of the margin calls and made malicious short selling a crime of some undetermined magnitude. \nNow we know the Chinese government blew this whole attempt to get individuals involved in the stocks and many people -- we don't know how many -- have gotten crushed in the downturn having come in near the top of the frenzied run-up. That makes the once seemingly invincible Communist Party look a lot more like a clown show and the world has now questioned whether, because of the decline in purchasing power from the stock market fallout, the country's growth will decelerate to the extent that it might just turn out to be sluggish even by some Western standards. \nIn fact, the instant slowdown is so bad that we are hearing of weaker auto sales and perhaps a slowdown in cell-phone sales. That's what's got stock of General Motors GM clobbered, as it sells more cars there than here. That's what's gotten Apple ( AAPL - Get Report ) crushed -- taking its semiconductor acolytes, Skyworks Solutions SWKS , NXP Semiconductors ( NXPI ) and Avago ( AVGO ) down with it. \nOK, now enough of the negatives because for the past two days, the Chinese market has had a respite in selling. In fact, the market's roared with back-to-back 5% increases. Which makes me wonder: Is it possible that all the widely scoffed-at measures, the changes in margin rules, the ban on selling by big holders, the end of malicious short selling and the stoppage of new supply (the IPO market) may actually be working? We know that these measures tend to fail and a market destined to go down on the fundamentals will ultimately do so. But what matters in these declines is the velocity, and after these two rip-off-your face rallies it's worth asking if the government's decision to tell the brokers not to margin people out of holdings while at the same time stopping the flood of new stock supply has definitely created a better backdrop that can slow the pall mall decline. \nNot only that, but while there are many Chinese companies' stocks I would never touch in a million years because their financials are totally lacking in transparency, some of the fastest-growing companies, like Baidu ( BIDU ) and Alibaba ( BABA ) have seen their stocks go literally from expensive to cheap (at least on their growth rate) in an almost 0-to-60 mph speed. That's even encouraged some large foreign institutional buyers -- including some huge U.S. mutual funds -- to wade in, further stemming the selling and mopping up supply. \nSure the Communist Party may look like it's lost its nerve, its cool and its brain -- but remember, this is a totalitarian state. While we would presume that people in our country would try somehow to get around these various bans, you might end up in prison or worse if you do it in China. And without the margin-clerk butchers doing their dirty work, the Chinese can hold stocks and quickly wean themselves off margin, something that's occurring with rapid speed in the last weeks. The use of margin's way down already, which is real good for stabilization and makes a market much less prone to a shock. \nNow I am not saying that things are hunky-dorey in China. They aren't. But I did find myself nodding in agreement with a piece my old friend Jim Stewart penned in The New York Times this morning headlined: \"Why China's Stock Market Bailout Just Might Work.\" Yep, China screwed up, we all know it. But it's been wrong to underestimate the power of the PRC to keep growth going in order to maintain civil order, something that's always in question, and after this vicious decline, it might just be wrong to do so once again. \nAt the time of publication, Action Alerts PLUS, which Cramer co-manages as a charitable trust, was long GM and AAPL. \n:", "external_links": [], "published": "2015-07-13T08:00:00.000+03:00", "crawled": "2015-07-13T08:13:18.000+03:00", "highlightTitle": ""}