{"organizations": [], "uuid": "a088fecb68083ea68650d5ebc63f91d6e7e35c10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-BO105_shangh_MD_20131029214007.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/china-has-only-itself-to-blame-for-its-stock-market-collapse-2015-07-24", "country": "US", "title": "China has only itself to blame for its stock market collapse", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "China has only itself to blame for its stock market collapse - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:00:00.000+03:00", "replies_count": 1, "uuid": "39f5340d6bc63c4c9ba52e18a6ed5956d0f5208c"}, "author": "By     Satyajit Das", "url": "http://www.marketwatch.com/story/china-has-only-itself-to-blame-for-its-stock-market-collapse-2015-07-24#post-0", "ord_in_thread": 0, "title": "China has only itself to blame for its stock market collapse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Most things in China are unfamiliar to foreigners — especially its stock market.\nChinese stock markets involve multiple types of shares and convoluted ownership arrangements.\nThere are A-shares: renminbi denominated shares in mainland China-based companies whose ownership is restricted to mainland citizens and foreigners under the regulated Qualified Foreign Institutional Investor system.\nThere are B-shares: Quote: d in foreign currencies (such as the U.S. dollar) and can be purchased by domestic and foreign investors (with a foreign currency account).\nThere are H-shares: Hong Kong dollars denominated shares in Chinese companies which are listed in and trade on the Hong Kong Stock Exchange.\nThere are even shares which are not really shares, such as the rights in Variable Interest Entity used by foreigners to get around ownership prohibitions to acquire stakes in Chinese Internet companies such as Alibaba Group Holding. BABA, -0.32% These are typically Cayman Islands-domiciled companies that use contracts to provide an economic interest in a Chinese business.\niPhone sales in China continue to soar (0:50) Apple lost $60 billion of its market value after company earnings fell short of expectations, but sales of iPhones in China continue to soar as Apple plans further expansion there. Photo: Getty.\nBetween 2013 and mid-2015, the Shanghai Composite Index SHCOMP, -1.29% rose by around 250%. Other Chinese indices, especially the Shenzhen Stock Exchange and the ChiNext index, dominated by smaller and technology shares, also rose sharply. Since peaking in June, the indexes have fallen sharply, by around 30%.\nSimilar corrections occurred in 2001 and in 2007-2008. In the latter, the benchmark Shanghai Composite index also topped 5,000 — a rise of 90% followed by a 70% slide.\nNotably, until this latest boom the performance of the Chinese stock market had not reflected the country’s stellar economic growth. In the past 20-25 years, stock investors have earned a modest 1%-2% annualized on average. Indeed, in the 20 years through June 2013, the Chinese stock market rose only about 20%, compared to gains of around 400%-500% in the S&P 500 SPX, -0.57% and more than 300% in emerging markets. The Shanghai market was until recently valued at around six-to-eight times earnings, well below the 12-15 times of international markets. Investors, especially international fund managers, saw China’s market as undervalued.\nYet the stock market is relatively unimportant within the Chinese system. Equity issues contribute 5%-10% of all capital raising. The vast majority of funding is in the form of debt, primarily from banks. China’s stock market is small relative to the size of the country’s economy. Historically, the total free float value (shares available for trading) in China is around 25%-35% of Gross Domestic Product, well below the levels in the U.S. (150%) and most developed economies (85%-100%).\nRetail investment is modest as well, with only around 10%-20% of household wealth being held in the form of shares, well-below levels in developed countries. Less than 10% of Chinese households actively trade shares while another 4% are exposed to the stock market through mutual funds.\nPrev Page 1 2 Next Page", "external_links": [], "published": "2015-07-24T03:00:00.000+03:00", "crawled": "2015-07-24T14:03:52.996+03:00", "highlightTitle": ""}