{"organizations": [], "uuid": "11865332fa693ec44cd3de23c693a2150665f8a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/sqtdFerjyFKB5DTh4DnJnQ--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/cecbde7c487c675e9817722d74bef819662e9112_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/finnish-parliament-favour-grexit-report-215459553.html", "country": "GB", "title": "Finnish parliament in favour of 'Grexit': report", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Finnish parliament in favour of 'Grexit': report", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T00:54:00.000+03:00", "replies_count": 0, "uuid": "11865332fa693ec44cd3de23c693a2150665f8a9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/finnish-parliament-favour-grexit-report-215459553.html", "ord_in_thread": 0, "title": "Finnish parliament in favour of 'Grexit': report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nFinland's parliament has decided it will not accept any new bailout deal for Greece, media reports said Saturday, piling on pressure as eurozone finance ministers were locked in tortuous talks to stop the debt-laden country from crashing out of the euro. \nLawmakers' decision to push for a so-called \"Grexit\" came after the eurosceptic Finns Party, the second-largest in parliament, threatened to bring down the government if it backed another rescue deal for Greece, public broadcaster Yle reported citing sources close to the talks. \nIn Finland, it is the country's \"Grand Committee\" -- made up of 25 of parliament's 200 MPs -- which gives the government a mandate to negotiate on an aid agreement for Greece. \nMembers of the committee met for talks in Helsinki on Saturday afternoon to decide their position, YLE reported. \nThe Finnish parliament declined to comment on the media report. \nFinnish Finance Minister Alexander Stubb, attending the Greek crisis talks in Brussels, meanwhile tweeted that he could not reveal the mandate given to him by the Grand Committee so long as the Eurogroup negotiations were still ongoing. \n\"The mandate is not public and the Finnish delegation will not discuss it publicly,\" Kaisa Amaral, the delegation's spokesman, told AFP. \nFinns Party leader Timo Soini, who is also the country's foreign minister, has repeatedly argued in favour a \"Grexit\", saying it would be better for Greece to leave the euro. \nFinland is one of several EU countries whose national parliaments must sign off of any debt deal for Greece. \nThe aim of Saturday's Eurogroup meeting was for ministers to come up with a final verdict on leftist Greek Premier Alexis Tsipras's proposals for a third rescue package worth more than 80 billion euros ($89 billion), ahead of a make-or-break EU summit on Sunday. \nAmid German warnings that the talks were \"extremely difficult\", a European source told AFP the German finance ministry had drawn up an \"internal paper\" for Greece to leave the eurozone for five years if it failed to improve its bailout proposals. The paper was not distributed in Brussels, the source added.", "external_links": [], "published": "2015-07-12T00:54:00.000+03:00", "crawled": "2015-07-12T02:14:54.000+03:00", "highlightTitle": ""}