{"organizations": [], "uuid": "e80265815b529ffbaa76957fb7873ab66f6c8cbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/d/c/l/c/image.related.articleLeadwide.620x349.gihp9s.png/1437599188712.jpg", "site_section": "http://www.canberratimes.com.au/business/carbon-economy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/markets/local-investors-turn-bullish-on-japan-as-asx-disappoints-20150721-gihp9s.html", "country": "AU", "title": "Local investors turn bullish on Japan as ASX disappoints", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Local investors turn bullish on Japan as ASX disappoints", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T05:06:00.000+03:00", "replies_count": 0, "uuid": "e80265815b529ffbaa76957fb7873ab66f6c8cbe"}, "author": "", "url": "http://www.canberratimes.com.au/business/markets/local-investors-turn-bullish-on-japan-as-asx-disappoints-20150721-gihp9s.html", "ord_in_thread": 0, "title": "Local investors turn bullish on Japan as ASX disappoints", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Nikkei has outperformed its global peers over the past 12 months. Photo: Reuters\nDon't let Toshiba's $1.7 billion earnings scandal worry you: Australian investors are big on Japan.\nA growing number of Australian funds are bullish on \"cheap\" Japanese equities, as economic reforms and a weaker yen create ideal buying conditions compared with overvalued US markets, volatility in China and uncertainty in Europe.\nThe benchmark Nikkei 225 Index has been hovering near two-decade highs this month, while global investors pour back as economic reforms designed to change the nation's traditional lack of transparency take flight.\nThat tradition was laid bare on Tuesday, after Toshiba's president Hisao Tanaka quit, along with seven top-level executives after \"systematic\" inflation of profits of $1.7 billion was exposed, reportedly because the truth was \"too embarrassing\" to reveal.\nIt is the biggest corporate scandal since Olympus Corporation sacked British-born chief executive Michael Woolford for exposing years worth of covering up losses.\nBut questionable accounting is not deterring Steven Johnson, portfolio manager of Australian-based value hunter Forager Funds.\nAiring troubles a positive sign He said it was a positive sign in Japan's notoriously hush-hush corporate culture that Toshiba's troubles came out into the open.\n\"It does demonstrate how far they have to go, but that is also a large part of the opportunity as well,\" he said.\nPrime Minister Shinzo Abe's economic reforms – the \"third arrow\" of the Abenomics strategy that includes overhauling corporate governance – came into play on June 1.\nMuch of those reforms were already factored into the share prices, Mr Johnson said, and the \"cheap\" stocks had become less so, doubling in value in the past 30 months, but still provided value compared with global counterparts.\n\"You're still going to make a lot of money regardless of what happens in the next six to 12 months,\" he said.\nAMP Capital has been bullish on Japan since Mr Abe's election in 2012, but head of investment strategy Shane Oliver said the best time to get on board was 18 months ago when the Bank of Japan initiated its quantitative easing policy.\n'Good gains are over' The Nikkei has returned 34.4 per cent over the past 12 months, compared with 6.8 per cent in the US and 1.3 per cent in Australia.\n\"I don't think the growth is going to continue at the same rate … a lot of the good gains are over,\" he said.\nAMP Capital said from mid-2013 the market was 20 to 30 per cent undervalued, and that had risen to 5 per cent undervalued.\n\"If you're looking for yield, Australia is still an attractive option. But if you're after capital growth in this environment, you're better off looking abroad, and Europe and Japan are the places to look,\" Dr Oliver said.\nCredit Suisse has also long favoured Japanese stocks, and Australian Private Banking chief investment strategist David McDonald agreed that Japanese equities still offered more upside than their Australian counterparts.\n\"The Bank of Japan is doing huge quantitative easing whereas the Reserve Bank of Australia is likely on hold now – so more stimulus to the economy in Japan,\" Mr McDonald said.\n'Expect further AUD weakness' Japanese companies have also benefited from a weaker yen, boosting export earnings, while the weaker Aussie has not been enough to offset a collapse in commodity prices, he said.\n\"We expect further Australian dollar weakness, which would boost returns from offshore markets for a domestic AUD-based investor.\"\nThe comments come after some giant Wall Street investors returned to buying in Japan. JPMorgan Asset Management chief executive Mary Callahan Erdoes, told a conference last week that the best opportunities were found in \"truly Japanese\" companies who were taking advantage of exporting on a weaker currency.\nForager Funds have invested in smaller companies such as amplifier and microphone maker Toa Corporation for the same reason, but said it was difficult to invest without going through a Japanese bank.\n\"One of the attractive things about Japan is that it has still got its own culture … some of the cons of that is access to management and getting them to care about their share price,\" Forager's Mr Johnson said.", "external_links": [], "published": "2015-07-23T05:06:00.000+03:00", "crawled": "2015-07-24T23:26:48.936+03:00", "highlightTitle": ""}