{"organizations": [], "uuid": "def8b3d10471c4d93cf5a14ae00b69a3e74d2760", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/aust-shares-close-down-third-061910009.html", "country": "GB", "title": "Aust shares close down third day in a row", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Aust shares close down third day in a row", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T09:38:00.000+03:00", "replies_count": 0, "uuid": "def8b3d10471c4d93cf5a14ae00b69a3e74d2760"}, "author": "", "url": "https://au.finance.yahoo.com/news/aust-shares-close-down-third-061910009.html", "ord_in_thread": 0, "title": "Aust shares close down third day in a row", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fri, Jul 24, 2015, 5:06 PM AEST - Australia Markets closed Aust shares close down third day in a row AAP – 27 minutes ago Print \nThe share market has closed lower for a third straight day, following a weak lead from Wall Street and pessimistic manufacturing data from China. \nThe big miners were hit on Friday by news that a key gauge of Chinese manufacturing activity touched a 15-month low in July, with the banks following in their wake. \n\"The share market has tried hard but there has been absolutely nothing going in its favour, including a weak lead from Wall Street on corporate earnings,\" OptionsXpress market analyst Ben Le Brun said. \n\"All those factors have conspired against the market and, with that in mind, it was actually a pretty good performance.\" \nMr Le Brun said it wasn't all doom and gloom, with the energy sector and utilities helping cushion the falls. \n\"When we've got the major miners and the banks out of favour, it's always going to be hard for other sectors to pick up the slack,\" he said. \n\"There's enough to suggest maybe the bargain hunters are happy to pick up stocks around these levels or not too far south of where we are now, so I think we set ourselves up for a reasonably positive start to next week.\" \nWith bellwether copper and aluminium prices at or around six year lows, Newcrest Mining was down 57 cents, or 4.81 per cent, to $11.27 and BHP Billiton lost 23 points, or 0.9 per cent, at $25.27. \nRio Tinto was flat at $51.20, while Fortescue Metals Group bucked the trend with a 1.5 cent increase to $1.66. \nIn the banking sector, Commonwealth Bank was down 49 cents, or 0.57 per cent, at $85.81, while NAB sank by 19 cents, or 0.56 per cent, to $33.91. \nANZ dipped 10 cents, or 0.31 per cent, to $32.05, while Westpac was flat at $34.24. \nKEY FACTS \n* On Friday, the benchmark S&P/ASX200 index was down 24.2 points, or 0.43 per cent, lower at 5,566.1. \n* The broader All Ordinaries index was down 22.2 points, or 0.44 per cent, at 5,556.8. \n* The September share price index futures contract was 21 points lower at 5,512, with 20,020 contracts traded. \n* National turnover was 692.2 million securities worth $1.1 billion. @y7finance on Twitter, become a fan on Facebook Labor takes on wealthy, multinationals AAP \nLabor wants Australia's wealthiest people to pay another $2.5 billion a year in tax but has not made a firm commitment …", "external_links": [], "published": "2015-07-24T09:38:00.000+03:00", "crawled": "2015-07-24T10:08:50.406+03:00", "highlightTitle": ""}