{"organizations": [], "uuid": "2250594f847f0486c6730cbabe2c809925c769db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/24/usa-new-jersey-transportation-idUSL1N1042B920150724", "country": "US", "title": "New Jersey Gov. Christie blames Amtrak for nightmarish commutes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "New Jersey Gov. Christie blames Amtrak for nightmarish commutes | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T02:22:00.000+03:00", "replies_count": 0, "uuid": "2250594f847f0486c6730cbabe2c809925c769db"}, "author": "Hilary Russ", "url": "http://www.reuters.com/article/2015/07/24/usa-new-jersey-transportation-idUSL1N1042B920150724", "ord_in_thread": 0, "title": "New Jersey Gov. Christie blames Amtrak for nightmarish commutes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 24 New Jersey Governor Chris Christie, a 2016 Republican presidential candidate, on Friday blamed Amtrak for a week of nightmarish commutes to and from New York and called on the Obama administration and Congress to \"step up their responsibility,\" and fix the problems.\nNew Jersey pays Amtrak, the national rail operator, $100 million annually so that NJ Transit trains can use Amtrak tunnels and rails, Christie said.\nTravelers using NJ Transit trains were \"victimized\" by extreme delays and cancellations throughout the system this week because of \"Amtrak's indifference to New Jersey commuters and its abject neglect of the infrastructure that New Jersey and our entire region relies upon,\" Christie said in a statement.\nChristie said he had asked the state attorney general to review the matter.\nAmtrak apologized for the delays.\n\"We are actively sharing information with our partners at New Jersey Transit and other agencies and will continue to work closely with them in developing an immediate solution,\" spokeswoman Kimberly Woods said in a statement.\nShe said the power failures that caused problems on the Northeast Corridor this week showed the \"urgent need for a funding solution.\"\nChristie's broader record on transportation is less supportive. Just after taking office in 2010, he cancelled a new Hudson River tunnel project already under construction, called Access to the Region's Core, saying costs were likely to skyrocket and citing his state's lack of funding ability.\nNew Jersey's Transportation Trust Fund, which pays for roads and bridges, is also nearly broke. That has prompted calls from Democrats to raise the state's gas tax, which Christie has rejected.\nNew Jersey Assembly Transportation Committee Chairman John Wisniewski called Christie's comments about Amtrak hypocritical.\n\"His piece-meal approach and lack of long-term planning has left our roads and bridges in shambles,\" Wisniewski said in a statement.\nChristie's cancellation of the tunnel project also \"left New Jersey's trans-Hudson commuters with no choice but to endure Amtrak's delays, a problem that will only be exacerbated as the existing tunnels reach their expected lifespan and must be closed for improvements,\" he said. (Reporting by Hilary Russ; Editing by Tom Brown )", "external_links": [], "published": "2015-07-25T02:22:00.000+03:00", "crawled": "2015-07-25T01:29:48.149+03:00", "highlightTitle": ""}