{"organizations": [], "uuid": "c0d39cdd4b3b934dc1901a10a4692f4adf0f36f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/4/4/b/8/image.related.afrArticleLead.620x365.gin8u1.png/1438243896181.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/solar-on-path-to-beat-diesel-lng-to-power-remote-mines-20150730-gin8u1", "country": "AU", "title": "Solar on path to beat diesel, LNG to power remote mines", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Solar on path to beat diesel, LNG to power remote mines | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T15:00:00.000+03:00", "replies_count": 0, "uuid": "c0d39cdd4b3b934dc1901a10a4692f4adf0f36f3"}, "author": "Angela Macdonald-Smith", "url": "http://www.afr.com/business/solar-on-path-to-beat-diesel-lng-to-power-remote-mines-20150730-gin8u1", "ord_in_thread": 0, "title": "Solar on path to beat diesel, LNG to power remote mines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Solar power in remote mines is likely to win over diesel and gas. Reuters by Angela Macdonald-Smith A green conscience is no longer needed for solar to be the fuel of choice for remote mine sites, with diesel and gas set to lose out.\nThe increased competitiveness of solar power means Sandfire Resources' commitment this month to a combined solar and battery storage project to power its DeGrussa copper mine 900 kilometres north-east of Perth, should signal a trend among miners.\nNumbers presented at a Sydney conference this week revealed how the economics of solar already match up against diesel as an alternative fuel for sites too distant to be connected to a power grid. Competitiveness against liquefied natural gas – the other conventional fuel option for remote sites – was only just around the corner.\n​The calculations presented by Australian Renewable Energy Agency rely on the levelised cost of energy, the typical measure that attempts to compare alternative generation sources. That measure – which divides the cost to build and operate a power plant over its lifetime by its total output – was not the whole story but successfully illustrates the point.\nThe life of the solar project is, however, important in the equations, given a $50 a megawatt-hour or more difference in that levelised cost for a 10-year and a 20-year project, according to ARENA chief financial officer Ian Kay.\nOn ARENA's numbers, a 20-year solar project easily beats a new diesel-based power supply, and is competitive on costs against existing diesel and against a new LNG-based supply. The crossover point against existing LNG comes in 2017.\nCompetitive solar For a 10-year project however, solar becomes competitive against existing diesel in 2017, and not until 2019 against existing LNG with its relatively lower capital expenditure but higher operating expenditure because of fuel costs.\n But the competitive economics of solar do not remove the need for extra help, especially given the up-front capital commitment and nervousness among commercial lenders on financing types of projects with little commercial track record.\nThe $40 million DeGrussa solar project, involving a 10 megawatt solar power plant with 6 MW of battery storage integrated into an existing 19 MW diesel plant, required support from both ARENA and the Clean Energy Finance Corporation.\nARENA provided a $20.9 million grant, while CEFC provided $15 million of debt. Sandfire's contribution would be less than $1 million, thanks to the contribution of French renewable energy player Neoen that will own the plant.\nWhile Mr Kay admitted it was a big chunk of taxpayer money involved, he said ARENA had made its own assessment of the DeGrussa resource life and has determined it will last long enough for the agency to get its money back once the debt and equity are repaid.\nMeanwhile, large-scale grid-connected solar in Australia was closing in fast on onshore wind and new coal-based supply in terms of costs, while lagging behind the global average due to labour and supply chain costs, Mr Kay said. Levelised costs for utility-scale solar in Australia were heading in the right direction, down from $140 to $160 per MWh to $120 to $140 in the last two to three years.\nThe CEFC put the total investment opportunity in solar and wind in Australia at up to $40 billion through to 2020. Utility-scale solar – including grid-connected and remote plants – was seen doubling in capacity in that time, outdoing the 60 per cent increase in small-scale solar PV and near 50 per cent growth in wind.\nRemote winner CEFC chief investment officer Ted Dow said solar already \"wins hands down\" at remote mine sites against diesel that must be trucked in. He forecast a rapid uptake, not just for mines but for hotels and remote communities.\nBut with hefty up-front costs and commercial lenders still getting comfortable with renewable projects, the reliance on the funding agencies looks set to continue.\namacdonald-smith@afr.com.au\nTwitter: @angelamacd", "external_links": ["http://www.smh.com.au/business/mining-and-resources/sandfire-resources-to-build-40m-solar-power-station-20150715-giclxy.html"], "published": "2015-07-30T15:00:00.000+03:00", "crawled": "2015-07-30T14:07:45.779+03:00", "highlightTitle": ""}