{"organizations": [], "uuid": "d41fc36e89641a3dbe8fccf22cf94b4513008527", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/g/2/6/r/image.related.afrArticleLead.620x365.gi4doi.png/1435906212324.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/currencies/australian-dollar-on-brink-of-sixyear-low-after-retail-sales-disappoints-20150703-gi4doi", "country": "AU", "title": "Australian dollar on brink of six-year low after retail sales data disappoints", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Australian dollar on brink of six-year low after retail sales data disappoints | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T13:44:00.000+03:00", "replies_count": 0, "uuid": "d41fc36e89641a3dbe8fccf22cf94b4513008527"}, "author": "Stephen Cauchi", "url": "http://www.afr.com/markets/currencies/australian-dollar-on-brink-of-sixyear-low-after-retail-sales-disappoints-20150703-gi4doi", "ord_in_thread": 0, "title": "Australian dollar on brink of six-year low after retail sales data disappoints", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Australian dollar dropped to US75.67¢ on Friday afternoon. by Stephen Cauchi The Australian dollar was flirting with six-year lows in the wake of worse than expected retail sales data. And the currency expected to breach this floor if a no vote in the Greek economic referendum on Sunday is recorded.\nOfficial retail sales data released on Friday showed growth of 0.3 per cent in May. That was well below expectations of a 0.5 per cent rise.\nHopes of stronger retail activity stemmed partly due to stimulatory policy in the federal budget.\nThe dollar fell 0.8¢ in the wake of the announcement before bottoming at US75.67¢ just after midday AEST. This level is just above the six-year low of US75.32¢, reached on April 2.\nIt had recovered slightly and was trading at US75.88¢ late on Friday afternoon.\n\"It was fairly disappointing figures and they've sparked speculation about a rate cut at next month's Reserve Bank meeting,\" said ThinkForex markets analyst Matt Simpson.\n\"I don't think it will, however, because I'm of the view that the Reserve Bank are assuming that the Federal Reserve will act first, which will take the pressure off.\n\"The problem will occur when the Fed turn around and start delaying that further. I don't think they're going to raise rates this year and that's going to put pressure later in the year for the Reserve Bank to cut rates.\"\n Mr Simpson said that a yes vote in the Greek referendum on Sunday would push the Australian dollar higher and a no vote would push it lower.\n\"If you keep Greece in the euro zone, that will see the euro rebound as well, make the US dollar weaker and support the Aussie.\"\nEconomist Stephen Walters of JPMorgan described the retail sales figures \"disappointing\".\n\"Australian consumer spending failed to bounce back in May, despite what should have been support from the Reserve Bank's early month rate cut and the mid-month federal budget, which included measures aimed at lifting investment by small businesses,\" he said.\nThat was also the view of St. George economist Janu Chan.\n\"Although not far from our expectations, it was disappointing given the spending boost from rate cut from the RBA and some relief after the federal budget was announced. Further, the modest growth in May followed a small contraction in April.\"\nANZ analyst Katie Hill said that the \"disappointing May retail sales print, provides further evidence that consumer spending has failed to pick up in 2015.\n\"While the recent lift in confidence and Commonwealth budget measures may still boost retail in the near term, anaemic wages growth continues to present a formidable headwind to any sustained uplift in consumer spending.\"\nCommsec economist Craig James was more positive. \"Retail sales are still up 4.7 per cent over the year, far above the five-year average of 3.6 per cent,\" he said.\n\"And the data shows that the larger retailers are doing well, with sales up 5.3 per cent over the year.\"", "external_links": [], "published": "2015-07-03T13:44:00.000+03:00", "crawled": "2015-07-03T10:03:30.000+03:00", "highlightTitle": ""}