{"organizations": [], "uuid": "f9bf6661d72bca169c2bb3c6754c614ce8c0a9c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/category-currencies/?format=rss", "section_title": "Currency & Forex News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/stocks-watch-tuesday-220128433.html", "country": "US", "title": "Stocks to watch on Tuesday", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Stocks to watch on Tuesday", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T01:13:00.000+03:00", "replies_count": 0, "uuid": "f9bf6661d72bca169c2bb3c6754c614ce8c0a9c4"}, "author": "", "url": "https://au.finance.yahoo.com/news/stocks-watch-tuesday-220128433.html", "ord_in_thread": 0, "title": "Stocks to watch on Tuesday", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tue, Jul 21, 2015, 8:50 AM AEST - Australia Markets open in 1 hr 10 mins Stocks to watch on Tuesday AAP – 37 minutes ago \nStocks to watch on the Australian stock exchange on Tuesday, July 21: \nA2M - A2 MILK - steady at 66.5 cents \nFNP - FREEDOM FOOD - up five cents, or 1.6 per cent, at $3.11 \nInvestors are weighing up A2 Milk Co's funding needs after the board turned down a takeover offer. \nAFI - AUSTRALIAN FOUNDATION INVESTMENT COMPANY - up five cents, or 0.8 per cent, at $6.30 \nAustralian Foundation Investment Company's profit has jumped 15.5 per cent to $293.5 million. \nANZ - ANZ BANKING GROUP - up 41 cents, or 1.3 per cent, at $32.85 \nCBA - COMMONWEALTH BANK OF AUSTRALIA - up 38 cents, or 0.4 per cent, at $88.36 \nMQG - MACQUARIE GROUP - up $1.64, or two per cent, at $85.15 \nNAB - NATIONAL AUSTRALIA BANK - up 10 cents, or 0.3 per cent, at $34.44 \nWBC - WESTPAC BANKING CORPORATION - up three cents, or 0.1 per cent, at $34.60 \nAustralia's biggest banks will need to hold billions of dollars in extra capital against their home loans, following a move by the banking regulator to strengthen the country's financial system. \nMJP - MARTIN JETPACK - up 4.5 cents, or 6.7 per cent, at 72 cents \nJetpack maker Martin Aircraft will display its wares to the US military in what it is describing as a major step into the lucrative North American market. \nNCM - NEWCREST MINING - down $1.33, or 10.1 per cent, at $11.87 \nNewcrest Mining has suspended work at its Hidden Valley mine in Papua New Guinea following a worker's death. \nQAN - QANTAS AIRWAYS - up one cent, or 0.3 per cent, at $3.64 \nA tell-all book about Qantas's 2011 fleet grounding has been permanently shelved after the airline and the book's author reached an out-of-court settlement. \nSHL - SONIC HEALTHCARE - down 61 cents, or 2.8 per cent, at $21.25 \nSonic Healthcare has warned that its full year earnings will be up to four per cent below its guidance due to weakness in the Australian pathology market. @y7finance on Twitter, become a fan on Facebook Subway's chief marketing officer to leave AAP \nSubway's chief marketing officer Tony Pace is leaving the company to start a marketing consultancy. The news comes …", "external_links": [], "published": "2015-07-21T01:13:00.000+03:00", "crawled": "2015-07-21T01:50:55.313+03:00", "highlightTitle": ""}