{"organizations": [], "uuid": "ec48fffba5e372d8fb208b3e624066f45f41c1c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15428_4422.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/fcc-s-enforcement-bureau-commends-14861/", "country": "US", "title": "FCC’s Enforcement Bureau Commends PayPal for Modifying its User Agreement", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "FCC’s Enforcement Bureau Commends PayPal for Modifying its User Agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T20:23:00.000+03:00", "replies_count": 0, "uuid": "ec48fffba5e372d8fb208b3e624066f45f41c1c7"}, "author": "Drinker Biddle &amp; Reath LLP", "url": "http://www.jdsupra.com/legalnews/fcc-s-enforcement-bureau-commends-14861/", "ord_in_thread": 0, "title": "FCC’s Enforcement Bureau Commends PayPal for Modifying its User Agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "To embed, copy and paste the code into your website or blog: \n\nWe previously advised that the FCC’s Enforcement Bureau, in an unusual move, on June 11 published a letter it sent to PayPal warning that PayPal’s proposed changes to its User Agreement that contained robocall contact provisions might violate the TCPA. These proposed revisions conveyed user consent for PayPal to contact its users via “autodialed or prerecorded calls and text messages … at any telephone number provided … or otherwise obtained” to notify consumers about their accounts, to troubleshoot problems, resolve disputes, collect debts, and poll for opinions, among other things. The Bureau’s letter highlighted concerns with the broad consent specified for the receipt of autodialed or prerecorded telemarketing messages and the apparent lack of notice as to a consumers right to refuse to provide consent to receive these types of calls. \nOn June 29, prior to the revisions coming into effect, PayPal posted a notice on its blog stating: “In sending our customers a notice about upcoming changes to our User Agreement we used language that did not clearly communicate how we intend to contact them. PayPal clarified that it would modify its User Agreement to specify the circumstances under which it would make robocalls to its users, including for important non-marketing reasons relating to misuse of an account, as well as to specify that continued use of PayPal products and services would not require users to consent to receive robocalls. \nThe FCC’s Enforcement Bureau immediately put out a statement commending PayPal for its decision to modify its proposed contact language, noting that these changes to the User Agreement represented “significant and welcome improvements.” The Bureau’s very public actions on this matter signal to businesses everywhere of the need to review existing “consent to contact” policies. Certainly the FCC’s yet to be released Declaratory Ruling on TCPA matters that was voted on", "external_links": [], "published": "2015-07-07T20:23:00.000+03:00", "crawled": "2015-07-07T20:30:35.000+03:00", "highlightTitle": ""}