{"organizations": [], "uuid": "50d60e3aaaa8f8fa1c31bf4cf729d90d1a5287ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iCe5GVztO5Zc/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-29/tsipras-blames-creditors-for-crisis-sees-debt-relief-this-year", "country": "US", "title": "Tsipras Says Greece Won ‘Crucial’ Commitment for Debt Relief", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Tsipras Says Greece Won ‘Crucial’ Commitment for Debt Relief - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T18:02:00.000+03:00", "replies_count": 0, "uuid": "50d60e3aaaa8f8fa1c31bf4cf729d90d1a5287ba"}, "author": "Nikos Chrysoloras", "url": "http://www.bloomberg.com/news/articles/2015-07-29/tsipras-blames-creditors-for-crisis-sees-debt-relief-this-year", "ord_in_thread": 0, "title": "Tsipras Says Greece Won ‘Crucial’ Commitment for Debt Relief", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Alexis Tsipras expressed confidence that Greece’s creditors will grant debt relief and blamed their intractability for worsening the country’s economic plight.\n“The Greek people were prisoners, who after they escaped prison were immediately arrested and returned to an even smaller cell,” Tsipras, who turned 41 on Tuesday, told an Athens radio station.\nAfter six months of talks, which led Greece to the brink of exiting the euro area, Tsipras capitulated to creditors’ demands and accepted terms that were more onerous than the ones rejected by voters in a July 5 referendum.\nTsipras defended his record, saying the brinkmanship allowed Greece to win concessions to emerge stronger from the crisis. The accord reached on July 12 fully covers financing needs for the next three years and paves the way for debt relief, he said. Officials from Greece and creditor institutions are meeting in Athens this week on policies that must be implemented in return for loans of as much as 86 billion euros ($94 billion).\n“What’s crucial is that we got a commitment for debt relief, which will take place after the first review of the program, in November,” Tsipras told his Syriza-party affiliated Sto Kokkino radio station.\nGreece was forced to impose capital controls and close its banks on June 28, following Tsipras’s decision to end talks with creditors and hold a referendum on their latest proposals. Banks reopened with limited services last week, after Tsipras accepted to negotiate a new loan facility attached to austerity measures. The country’s stock market remains closed.\n“I don’t regret anything that’s happened over the past five months,” Tsipras said. “As for the economy, the situation is reversible.”", "external_links": [], "published": "2015-07-29T18:02:00.000+03:00", "crawled": "2015-07-29T14:13:30.833+03:00", "highlightTitle": ""}