{"organizations": ["International Consolidated Airlins Grp SA", "Reckitt Benckiser Group Plc & Domino", "Dignity Plc", "Pizza Group PLC"], "uuid": "c3149997aedf4fdf7d1c88130ad9e84147fd7abf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-retail/?format=rss", "section_title": "Retail News | Retail Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/time-cash-international-consolidated-airlins-111347266.html", "country": "GB", "title": "Is It Time To Cash In On International Consolidated Airlins Grp SA, Dignity Plc, Reckitt Benckiser Group Plc & Domino’s Pizza Group PLC?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is It Time To Cash In On International Consolidated Airlins Grp SA, Dignity Plc, Reckitt Benckiser Group Plc & Domino’s Pizza Group PLC?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T14:13:00.000+03:00", "replies_count": 0, "uuid": "c3149997aedf4fdf7d1c88130ad9e84147fd7abf"}, "author": "", "url": "https://uk.finance.yahoo.com/news/time-cash-international-consolidated-airlins-111347266.html", "ord_in_thread": 0, "title": "Is It Time To Cash In On International Consolidated Airlins Grp SA, Dignity Plc, Reckitt Benckiser Group Plc & Domino’s Pizza Group PLC?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 31, 2015, 16:16 BST - UK Markets close in 14 mins. Is It Time To Cash In On International Consolidated Airlins Grp SA, Dignity Plc, Reckitt Benckiser Group Plc & Domino’s Pizza Group PLC? By Royston Wild | Fool.co.uk – 4 hours ago \nToday I am looking at whether investors should book profits on these four recent risers. International Consolidated Airlines Group \nWith air travel surging across the globe, I believe that International Consolidated Airlines (LSE: IAG) -- or IAG -- is a terrific selection for eager growth hunters. The business has seen shares advance 9% during July, but I believe much more strength can be expected -- the business announced today that revenues leapt 11.3% during April-June, in turn driving pre-tax profit 25.4% higher to ?449m. \nWith a tanking oil price also helping IAG's cost-stripping drive, I believe earnings look set to keep climbing, helped by the firm's likely purchase of Aer Lingus -- the Heathrow firm has previously announced that Ryanair has agreed to sell its stake in the budget carrier. Consequently the City expects IAG to record earnings expansion of 76% and 19% in 2015 and 2016 respectively, producing ultra-low P/E ratios of 10.4 times and 8.4 times. This suggests the firm remains significantly undervalued despite lively price rises more recently. Dignity \nFuneral directors Dignity (LSE: DTY) have also seen their share price ascend steadily during the past four weeks and the business was last 14% higher from levels seen at the end of June. This ascent has been helped by strong financials released this week, revealing that revenues climbed 19.2% in the first six months of 2015, propelling underlying pre-tax profit 44% higher to £46.5m. \nDignity benefitted from a 13% rise in the number of deaths during the period, while a large expansion scheme has also boosted sales -- just this month the firm completed the purchase of 36 shops from Laurel Funerals. Dignity's defensive operations make it a decent candidate for those seeking reliable earnings growth, in my opinion, fully justifying elevated P/E multiples of 24.3 times and 21.6 times for 2015 and 2016 -- the City expects the bottom line to swell 15% this year and 12% in 2016. Reckitt Benckiser Group \nSupported by recovering spend in emerging markets, I reckon household goods specialist Reckitt Benckiser (LSE: RB) should enjoy brilliant earnings expansion well into the future. This week's bubbly trading update reinforced this view, and allowed it to continue the 12% share price gain enjoyed during the past four weeks -- the London firm saw like-for-like sales advance 5% during January-June, with product rollouts like its Scholl Express Pedi and Durex Real Feel helping to drive shopper interest. \nWhile constant innovation across its blue-chip brands has proved a reliable winner for Reckitt Benckiser, the firm also has plenty of cash in reserve to embark on fresh acquisitions and boost sales still higher -- the business is currently in discussions to purchase K-Y Jelly from Johnson & Johnson , for example. Reckitt Benckiser is anticipated to see growth accelerate from 2% this year to 7% in 2016. Although these numbers produce elevated P/E ratios of 24.8 times and 23.2 times, I believe the firm's massive long-term growth potential fully merits this premium. Domino's Pizza Group \nFast food vendor Domino's Pizza (LSE: DOM) has been one of the major gainers after releasing eye-watering numbers earlier this week, and in total the firm has gained 14.7% in July. The dough-kneaders saw like-for-like sales canter 10% higher during January-June, driving pre-tax profit 29% higher to £25.4m. While new store openings are helping to drive custom skywards, Domino's Pizza has found the recipe to unlocking internet sales, and total online orders climbed by 24.4% during the period. \nIn particular, the Domino's 'app' is intensifying the appetite of couch potatoes across the land, and a total of 10 million software downloads to date enabled 'mobile' orders to overtake 'desktop' transactions for the first time in January-June. Propelled by lively web activity the City expects the business to generate earnings growth of 15% and 13% in 2015 and 2016 respectively, generating earnings multiples of 26.9 times and 23.6 times. But like Reckitt Benckiser, I believe Domino's Pizza's brilliant growth potential mitigates such high numbers. \nBut whether or not you share my bullish take on the firms mentioned, I strongly recommend you check out this totally exclusive report that singles out even more FTSE 100 winners waiting to jump-start your investment income. \nOur \" 5 Dividend Winners To Retire On \" wealth report highlights a selection of incredible stocks with an excellent record of providing juicy shareholder returns. Among our picks are top retail, pharmaceutical and utilities plays that we are convinced should continue to provide red-hot dividends. Click here to download the report -- it's 100% free and comes with no further obligation . \nRoyston Wild has no position in any shares mentioned. The Motley Fool UK has recommended Domino's Pizza. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-31T14:13:00.000+03:00", "crawled": "2015-07-31T18:21:02.185+03:00", "highlightTitle": ""}