{"organizations": ["TBWA"], "uuid": "f5a42d73ac9420c2dc51dca81d0466a5cee88cd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/AdvertisingAgencies", "section_title": "Yahoo! Finance: Advertising Agencies Industry News", "url": "http://finance.yahoo.com/news/tbwa-appoints-chris-garbutt-global-223900110.html", "country": "US", "title": "TBWA Appoints Chris Garbutt As Global Creative President", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "TBWA Appoints Chris Garbutt As Global Creative President", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T01:39:00.000+03:00", "replies_count": 0, "uuid": "f5a42d73ac9420c2dc51dca81d0466a5cee88cd2"}, "author": "", "url": "http://finance.yahoo.com/news/tbwa-appoints-chris-garbutt-global-223900110.html", "ord_in_thread": 0, "title": "TBWA Appoints Chris Garbutt As Global Creative President", "locations": ["New York"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Garbutt", "Chris Garbutt"], "text": "Compare Brokers TBWA Appoints Chris Garbutt As Global Creative President Garbutt will oversee creative across TBWA's global accounts and will lead the New York office as Chief Creative Officer TBWA Worldwide 4 hours ago  Content preferences Done \nNEW YORK, June 30, 2015 /PRNewswire/ -- TBWA Worldwide today announced the appointment of renowned creative director Chris Garbutt as its new Global Creative President. No stranger to the TBWA network, Garbutt started his career at TBWAHuntLascaris in South Africa before moving to TBWAParis to become its Executive Creative Director, where he produced some of the agency's most celebrated work for Nissan, Absolut, PlayStation, Canderel and Pedigree. \nGarbutt's appointment continues the network's push for senior creative talent. TBWA has in recent months hired Nils Andersson to oversee creative in Greater China and Gary McCreadie and Wesley Hawes in Sydney, while also elevating Stephen Butler to the role of Chief Creative Officer in Los Angeles in 2014. \nCommenting on the appointment, TBWA Worldwide CEO Troy Ruhanen said: \n\"Our client partners want and deserve the very best minds on their business, and our people throughout the network want to be inspired everyday by creative leaders who are keen on making the unreal real. Chris is one such leader, and not having him wasn't an option in my book – he is one of ours. The richness and volume of his work speaks for itself, and his leadership and thinking will ensure TBWA remains The Disruption Company.\" \nAs Global Creative President, Garbutt will oversee the creative direction for TBWA's hallmark global clients including Nissan, McDonalds, Adidas, Pernod Ricard, and more, while also partnering with newly-appointed CEO Rob Schwartz to helm the network's flagship New York office in the role of Chief Creative Officer. Garbutt will report to Ruhanen and to Worldwide Creative Director, John Hunt. \nGarbutt had this to say: \n\"TBWA is an iconic brand, and the best work they do always sets the bar for others to follow. Today, brands need disruptive, world changing and transformative ideas more than ever. I believe with the talent and commitment of the teams across the global network, we can truly achieve greatness for our clients. I am so excited to join a band of creative mavericks with a burning ambition to rewrite the rules. When a culture is as aligned and motivated as TBWA, anything's possible.\" \nRob Schwartz commented: \"I've long known and long admired Chris' work – He's truly one of the working legends in our business today. I'm really looking forward to partnering with him to make our New York office the center of strategic and creative excellence for the TBWA network.\" \nGarbutt, 43, will join TBWA from Ogilvy & Mather East in New York, where he has served as Chief Creative Officer. As CCO, his oversight and leadership spanned all agency disciplines and he is credited with award-winning campaigns for IBM and Coca-Cola. Prior to joining Ogilvy in New York, Garbutt was Chief Creative Officer of the network's Paris office, where he helped to propel the agency to new creative heights producing global campaigns for Perrier, Louis Vuitton and Google. \nIn 2014, Advertising Age named Garbutt one of the most awarded Chief Creative Officers in the world. He has won nearly 100 Cannes Lions in his career, including three Grand Prix awards, as well as top honors in The One Show, D&AD, Webbys, Clios and Art Director's Club awards. \nA native of Cape Town, South Africa, Garbutt began his career in Johannesburg as a Creative Director at TBWAHuntLascaris, where he spent four years working under the tutelage of then-CCO, John Hunt. \n\"I cannot be more delighted with Chris' appointment,\" said Hunt. \"Having worked with him for so many years, it's been a rare privilege to watch his meteoric rise. It's not often a talent this unique is wrapped in such a decent and hardworking human being, and since no one represents TBWA's DNA better, it's the perfect time for him to come home.\" Notes to Editor: \nAbout TBWA Worldwide TBWA Worldwide ( www.tbwa.com ) is a top ten ranked global advertising network that holds Disruption® at its core to develop business-changing ideas for the brands it works with. TBWA has 11,100 employees across 323 offices in 97 countries and also includes brands such as AUDITOIRE, BEING, Digital Arts Network (DAN), eg+ worldwide, The Integer Group®, TBWAMedia Arts Lab and TBWAWorldHealth. TBWA's global clients include Accenture, adidas, Apple, Energizer, Gatorade, GSK, Henkel, McDonald's, Michelin, Nissan, Pernod Ricard, Pfizer, Standard Chartered Bank, Singapore Airlines, Sotheby's and Vichy. Follow TBWA on Twitter and Instagram and like us on Facebook . \nAbout Omnicom Group Inc. Omnicom Group Inc. ( OMC ) ( www.omnicomgroup.com ) is a leading global marketing and corporate communications company. Omnicom's branded networks and numerous specialty firms provide advertising, strategic media planning and buying, digital and interactive marketing, direct and promotional marketing, public relations and other specialty communications services to over 5,000 clients in more than 100 countries. To view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/tbwa-appoints-chris-garbutt-as-global-creative-president-300107255.html Professional Services", "external_links": [], "published": "2015-07-01T01:39:00.000+03:00", "crawled": "2015-07-01T06:12:20.000+03:00", "highlightTitle": ""}