{"organizations": ["WSFS"], "uuid": "26e3a70fc9cc34c0117e9c81e9bbbd148a2e2656", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/347389?filename=347389.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/industry/8779/Mortgage%20Finance", "section_title": "GlobeNewswire: Industry News on Mortgage Finance", "url": "http://globenewswire.com/news-release/2015/07/23/754752/0/en/WSFS-Reports-2Q-2015-EPS-of-0-43-Core-Net-Revenue-Grew-16-Annualized-and-Loans-Grew-13-Annualized-Over-1Q-2015.html?f=22&fvtc=3&fvtv=8779", "country": "US", "title": "WSFS Reports 2Q 2015 EPS of $0.43; Core Net Revenue Grew 16% Annualized; and Loans Grew 13% Annualized Over 1Q 2015", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "WSFS Reports 2Q 2015 EPS of $0.43; Core Net Revenue Grew 16% Annualized; and Loans Grew 13% Annualized Over 1Q 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T00:10:00.000+03:00", "replies_count": 0, "uuid": "26e3a70fc9cc34c0117e9c81e9bbbd148a2e2656"}, "author": "", "url": "http://globenewswire.com/news-release/2015/07/23/754752/0/en/WSFS-Reports-2Q-2015-EPS-of-0-43-Core-Net-Revenue-Grew-16-Annualized-and-Loans-Grew-13-Annualized-Over-1Q-2015.html?f=22&fvtc=3&fvtv=8779", "ord_in_thread": 0, "title": "WSFS Reports 2Q 2015 EPS of $0.43; Core Net Revenue Grew 16% Annualized; and Loans Grew 13% Annualized Over 1Q 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "% Fee income reflects strong growth over prior quarter Fee income (noninterest income) increased by $1.3 million, or 6% (not annualized), to $22.5 million compared to the first quarter of 2015. The increase included increases in investment management and fiduciary revenue of $614,000 and credit/debit card and ATM income of $435,000. The overall increase from the prior quarter is attributable to organic growth and typical seasonality in fees. When compared to the same period a year ago, fee income (noninterest income) increased $2.8 million, or 14%. This was the result of growth in both banking and banking-related businesses and included increases in investment management and fiduciary revenue of $1.4 million, mortgage banking activities of $565,000 and credit/debit card and ATM income of $452,000. Fee income is now a robust 36% of total revenue and is well diversified among various sources: traditional banking, mortgage banking, wealth management and ATM services (Cash Connect). \nNoninterest expense reflects ongoing expense management \nNoninterest expense for the second quarter of 2015 was $38.7 million, a decrease of $259,000 from $38.9 million in the first quarter of 2015. The decrease was primarily due to a $665,000 decrease in salaries, benefits and other compensation from good expense management and the first quarter has typical seasonal increases for higher employer costs such as higher vacation accrual costs, 401(k) matching costs and certain employer-paid taxes. Marketing expense increased during the second quarter of 2015 to support growth and the introduction of the aforementioned new products and services. When compared to the second quarter of 2014, noninterest expense increased $3.4 million. Excluding notable items in both periods, (n) noninterest expense increased $2.9 million, or 8%. The increase was primarily to support robust organic growth and the September 2014 acquisition of FNBW. Selected Business Segments (included in previous results): Wealth Management segment fee revenue grew by 30% over the prior year The Wealth Management segment provides a broad array of fiduciary, investment management, credit and deposit products to clients through four businesses. WSFS Wealth Investments provides insurance and brokerage products primarily to our retail banking clients. Cypress Capital Management, LLC is a registered investment advisor with approximately $655 million in assets under management (AUM). Cypress’ primary market segment is high net worth individuals, offering a ‘balanced’ investment style focused on preservation of capital and providing for current income. Christiana Trust , with $8.86 billion in assets under management and administration, provides fiduciary and investment services to personal trust clients, and trustee, agency, bankruptcy, custodial and commercial domicile services to corporate and institutional clients. WSFS Private Banking serves high net worth clients by delivering credit and deposit products and partnering with other business units to deliver investment management and fiduciary products and services. Total Wealth Management revenue (net interest income, investment management and fiduciary revenue and other fee income) was $9.0 million during the second quarter of 2015. This represented an increase of $1.7 million, or 24% compared to the second quarter of 2014 and an increase of $803,000, or 10% (not annualized), compared to the first quarter of 2015. Included in this increase, fee revenue increased $1.4 million, or 30%, compared to the second quarter of 2014 and $638,000, or 12% (not annualized), compared to the first quarter of 2015. The year-over-year and quarterly growth reflects the continued expansion of several Wealth business lines, with particular strength in corporate bankruptcy and securitization trustee appointments and retail brokerage services. Total segment noninterest expense (including intercompany allocations of expense and provision for loan losses and credit costs) was $5.9 million during the second quarter of 2015 compared to $4.4 million during the second quarter of 2014 and $4.9 million during the first quarter of 2015. The second quarter of 2015 noninterest expenses were impacted by legal and consulting fees and seasonal client tax return preparation costs totaling $680,000. Excluding these fees in each year, noninterest expense increased $903,000 compared to the second quarter of 2014 and $41,000 from the first quarter of 2015. These year-over-year increases are primarily due to higher legal, consulting and compensation costs necessary to support the robust growth and volume-related commissions and transaction charges. Pre-tax income for the Wealth Management segment in the second quarter of 2015 was $3.1 million compared to $2.8 million in the second quarter of 2014 and $3.3 million in the first quarter of 2015. Excluding the legal fees and seasonal tax expenses discussed above in each year, pre-tax income for the second quarter of 2015 was $3.7 million compared to $3.1 million in the second quarter of 2014 and $3.3 million in the first quarter of 2015. Cash Connect results reflect meaningful growth over 2014 The Cash Connect ® segment is a premier provider of ATM vault cash and related services in the United States. Cash Connect ® services over $557 million in vault cash in over 15,900 non-bank ATMs nationwide and also operates approximately 450 ATMs for WSFS Bank, which has the largest branded ATM network in Delaware. Cash Connect ® recorded $6.9 million in net revenue (fee income less funding costs) during the second quarter of 2015, an increase of $459,000 from the $6.4 million reported in the first quarter of 2015, reflecting continued organic and seasonal growth. Net revenue also increased $712,000, or 12%, compared to the second quarter of 2014. Noninterest expenses (including intercompany allocations of expense) were $5.0 million during the second quarter of 2015, an increase of $42,000 compared to the first quarter of 2015 and an increase of $579,000 from the second quarter of 2014. Cash Connect ® reported pre-tax income of $1.9 million for the second quarter of 2015, compared to $1.7 million in the second quarter of 2014 and $1.6 million in the first quarter of 2015. The year-over-year results reflect continued growth in the business, offset partially by investments in new products and infrastructure to support growth. Most recently, on June 25, 2015, Cash Connect introduced “WSFS Mobile Cash”, offering security, convenience and speed in digital access to cash. It allows customers to securely withdraw cash from ATMs by using our WSFS Mobile Banking App. WSFS is first in the region and fourth in the United States to provide this service. Income taxes The Company recorded a $6.9 million income tax provision in the second quarter of 2015 compared to a $7.3 million tax provision in the first quarter of 2015 and a $7.1 million tax provision in the second quarter of 2014. The effective tax rate was 36.0% in the second quarter of 2015, 36.2% in the first quarter of 2015 and 35.8% in the second quarter of 2014. The slight increase in the effective tax rates for the first and second quarters of 2015 are principally due to certain nondeductible expenses associated with our pending acquisition of Alliance Bancorp. Capital management WSFS’ total stockholders’ equity decreased $5.1 million to $500.4 million at June 30, 2015 from $505.5 million at March 31, 2015, as a result of Company earnings offset by the Company’s ongoing stock buyback program and a decrease in the unrealized gains on the Company’s available-for-sale investment portfolio. For the same reasons, WSFS’ tangible common equity (n) decreased to $443.3 million at June 30, 2015 from $448.1 million at March 31, 2015. WSFS’ tangible common equity to asset ratio (n) decreased by 34 basis points to 8.83%. Tangible common book value per share (n) was $15.88 at June 30, 2015, a $0.03 increase from March 31, 2015 due to the impact of the above and share repurchases discussed below. At June 30, 2015, WSFS Bank’s Tier I leverage ratio of 10.59%, Common Equity Tier 1 capital ratio of 12.60%, Tier 1 capital ratio of 12.60% and total capital ratio of 13.60%, were all substantially in excess of the “well-capitalized” regulatory benchmarks. During the third quarter of 2014, the WSFS Board of Directors approved a stock buyback program of up to 5% of total outstanding shares of common stock. In the second quarter of 2015, WSFS repurchased 455,402 shares of common stock at an average price of $25.81. WSFS has repurchased the equivalent of 839,582 shares to date under this program at an average equivalent price of $25.75 and has 569,818 shares, or approximately 2% of outstanding shares remaining to repurchase under this current authorization. During the first quarter of 2015, the WSFS Board of Directors also declared a three-for-one stock split in our common stock in the form of a stock dividend of two shares for each issued and outstanding share of common stock. The stock dividend was paid on May 18, 2015 to stockholders of record as of May 4, 2015. Finally, the Board of Directors approved a quarterly cash dividend of $0.05 per share of common stock. This dividend will be paid on August 21, 2015, to shareholders of record as of August 7, 2015. Second quarter 2015 earnings release conference call Management will conduct a conference call to review second quarter results at 1:00 p.m. Eastern Time (ET) on Friday, July 24, 2015. Interested parties may listen to this call by dialing 1-877-312-5857. A rebroadcast of the conference call will be available two hours after the completion of the call until August 8, 2015, by dialing 1-855-859-2056 and using Conference ID 82950073. \nAbout WSFS Financial Corporation \nWSFS Financial Corporation is a multi-billion dollar financial services company. Its primary subsidiary, WSFS Bank, is the oldest, locally-managed bank and trust company headquartered in Delaware with $5.1 billion in assets on its balance sheet and $9.5 billion in fiduciary assets, including approximately $1.2 billion in assets under management. WSFS operates from 56 offices located in Delaware (45), Pennsylvania (9), Virginia (1) and Nevada (1) and provides comprehensive financial services including commercial banking, retail banking and trust and wealth management. Other subsidiaries or divisions include Christiana Trust , WSFS Wealth Investments, Cypress Capital Management, LLC , Cash Connect ® , Array Financial and Arrow Land Transfer. Serving the Delaware Valley since 1832, WSFS Bank is the seventh oldest bank in the United States continuously operating under the same name. For more information, please visit www.wsfsbank.com . \nForward-Looking Statement Disclaimer \nThis press release contains estimates, predictions, opinions, projections and other “forward-looking statements” as that phrase is defined in the Private Securities Litigation Reform Act of 1995. Such statements include, without limitation, references to the Company’s predictions or expectations of future business or financial performance as well as its goals and objectives for future operations, financial and business trends, business prospects, and management’s outlook or expectations for earnings, revenues, expenses, capital levels, liquidity levels, asset quality or other future financial or business performance, strategies or expectations. Such forward-looking statements are based on various assumptions (some of which may be beyond the Company’s control) and are subject to risks and uncertainties (which change over time) and other factors which could cause actual results to differ materially from those currently anticipated. Such risks and uncertainties include, but are not limited to, those related to difficult market conditions and unfavorable economic trends in the United States generally, and particularly in the market areas in which the Company operates and in which its loans are concentrated, including the effects of declines in housing markets, an increase in unemployment levels and slowdowns in economic growth; the Company’s level of nonperforming assets and the costs associated with resolving any problem loans including litigation and other costs; changes in market interest rates may increase funding costs and reduce earning asset yields thus reducing margin; the impact of changes in interest rates and the credit quality and strength of underlying collateral and the effect of such changes on the market value of the Company’s investment securities portfolio; the credit risk associated with the substantial amount of commercial real estate, construction and land development, and commercial and industrial loans in our loan portfolio; the extensive federal and state regulation, supervision and examination governing almost every aspect of the Company’s operations including the changes in regulations affecting financial institutions, including the Dodd-Frank Wall Street Reform and Consumer Protection Act and the rules and regulations being issued in accordance with this statute and potential expenses associated with complying with such regulations; possible additional loan losses and impairment of the collectability of loans; the Company’s ability to comply with applicable capital and liquidity requirements (including the finalized Basel III capital standards), including our ability to generate liquidity internally or raise capital on favorable terms; possible changes in trade, monetary and fiscal policies, laws and regulations and other activities of governments, agencies, and similar organizations; any impairment of the Company’s goodwill or other intangible assets; failure of the financial and operational controls of the Company’s Cash Connect division; conditions in the financial markets that may limit the Company’s access to additional funding to meet its liquidity needs; the success of the Company’s growth plans, including the successful integration of past and future acquisitions; negative perceptions or publicity with respect to the Company’s trust and wealth management business; system failure or cybersecurity breaches of the Company’s network security; the Company’s ability to recruit and retain key employees; the effects of problems encountered by other financial institutions that adversely affect the Company or the banking industry generally; the effects of weather and natural disasters such as floods, droughts, wind, tornadoes and hurricanes as well as effects from geopolitical instability and man-made disasters including terrorist attacks; possible changes in the speed of loan prepayments by the Company’s customers and loan origination or sales volumes; possible acceleration of prepayments of mortgage-backed securities due to low interest rates, and the related acceleration of premium amortization on prepayments on mortgage-backed securities due to low interest rates; regulatory limits on the Company’s ability to receive dividends from its subsidiaries and pay dividends to its shareholders; the effects of any reputational, credit, interest rate, market, operational, legal, liquidity, regulatory and compliance risk resulting from developments related to any of the risks discussed above; and the costs associated with resolving any problem loans, litigation and other risks and uncertainties, discussed in the Company’s Form 10-K for the year ended December 31, 2014 and other documents filed by the Company with the Securities and Exchange Commission from time to time. Forward looking statements are as of the date they are made, and the Company does not undertake to update any forward-looking statement, whether written or oral, that may be made from time to time by or on behalf of the Company. \n﻿", "external_links": [], "published": "2015-07-24T00:10:00.000+03:00", "crawled": "2015-07-24T01:39:11.993+03:00", "highlightTitle": ""}