{"organizations": [], "uuid": "216624a24d6b8d5cdf4bf520dec519e578423022", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-22/world-crises-dismissed-as-fed-september-liftoff-odds-stay-at-50-", "country": "US", "title": "World Crises Dismissed as Fed September Liftoff Odds Stay at 50%", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "World Crises Dismissed as Fed September Liftoff Odds Stay at 50% - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T04:15:00.000+03:00", "replies_count": 0, "uuid": "216624a24d6b8d5cdf4bf520dec519e578423022"}, "author": "Christopher Condon", "url": "http://www.bloomberg.com/news/articles/2015-07-22/world-crises-dismissed-as-fed-september-liftoff-odds-stay-at-50-", "ord_in_thread": 0, "title": "World Crises Dismissed as Fed September Liftoff Odds Stay at 50%", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Six weeks of international turmoil from Greece to China have had zero impact on economists’ outlook for the first Federal Reserve rate rise.\nOdds for a September liftoff remain at 50 percent, exactly where they were in June, according to the median of 45 responses in a July 20-22 survey. They assigned 40 percent odds to a later move and saw no chance of a decision when the Federal Open Market Committee gathers July 28-29 in Washington.\nThe outlook for a September move remained intact even as crises in Greece and China temporarily rocked markets and dimmed global economic prospects. Now that those concerns have eased, U.S. policy makers can focus on their dual mandate for full employment and low, stable inflation at home.\n“It’s a pretty close call,” said Scott Brown, chief economist at Raymond James Financial Inc. in St. Petersburg, Florida, who puts the odd of a September liftoff at 50 percent. While policy makers are heartened by improvement in the U.S. job market, they are still concerned that inflation remains too low, he said.\nFed officials have pledged to let the latest economic data determine the timing of their first rate increase since 2006. Before the September meeting, they will see two monthly reports on employment and inflation as well as the second-quarter numbers on gross domestic product, which will appear on July 30, a day after their next meeting.\nIn ranking the factors that could delay a rate increase, almost a third of economists surveyed named an external shock as the most likely. Unemployment and a failure of inflation to accelerate each were ranked first by 15 percent of respondents.\nGradual Pace Policy makers, including Fed Chair Janet Yellen, have emphasized that rates will be raised only gradually after liftoff, and that the timing of the first move is less important than the pace of subsequent increases.\nThose considerations could prompt officials to raise the benchmark federal funds rate in September rather than waiting until later, even if the economic data aren’t as clear-cut as they would like, said Avery Shenfeld, chief economist at Canadian Imperial Bank of Commerce in Toronto.\n“The advantage of moving in September is that you could squeeze in two hikes before the end of the year without doing two in a row,” said Shenfeld, who put odds of a September raise at 70 percent.\nRespondents gave a 10 percent chance of a first move in October. December stood at 20 percent, with a 2016 liftoff at 10 percent. Yellen is scheduled to hold press conferences following the September and December meetings, causing many to discount the likelihood of liftoff at other sessions, though she has said each FOMC is “live” for a rate decision.\nYear-End Liquidity Moving sooner might also help avoid risks associated with lifting off in December, when bond-market and money-market liquidity is typically thinner, upping the odds of a volatile reaction.\nThe FOMC has pledged to raise rates when it sees continued improvement in the labor market and is “reasonably confident” that inflation will move back toward its 2 percent target in the medium term.\nUnemployment in June fell to 5.3 percent, its lowest level in more than seven years. Consumer prices in May rose just 0.2 percent from a year earlier, according to the Fed’s preferred gauge, and have lingered below the target for three years.\nTwenty-eight percent of respondents see the personal consumption expenditures price index showing a third consecutive month of 2 percent or higher readings in the first half of 2016, compared to 48 percent in the June survey. Forty-one percent now say this won’t be reached until 2017 or later.\nGDP Outlook In a separate survey, economists expected the U.S. economy to grow at an annual rate of 2.5 percent in the second quarter, after shrinking at an annual rate of 0.2 percent in the first three months of the year.\nTwenty-five of 51 of respondents in this month’s survey said they expect the federal funds target range to be 0.5 percent to 0.75 percent at the end of the year, implying two quarter-point rate increases.\nMost expect the Fed to stick to their promise of gradual increases through next year. Just seven respondents see the bank raising rates above 2 percent by the end of 2016.\nThey also have low expectations for where the coming tightening phase is likely to peak, with the median response at 3.4 percent.\n“The Fed may have to stop at around 2 percent in early 2017” as the economic cycle starts to mature, said Thomas Costerg, a senior economist at Standard Chartered Bank in New York. “It could be difficult for the Fed to tighten further. The inflation threat is quite low.”\nThe last four tightening cycles, dating back to the late 1980s, crested at 6.9 percent on average.\nAsked if the Fed would prepare financial markets for a September rate increase by changing its forward guidance in the July FOMC statement, 41 percent said yes.", "external_links": [], "published": "2015-07-23T04:15:00.000+03:00", "crawled": "2015-07-22T23:37:51.316+03:00", "highlightTitle": ""}