{"organizations": [], "uuid": "1d24be66316498a5d6b2b2e6b58736650fe39ccf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/1/f/n/3/image.related.afrArticleLead.620x365.giayov.png/1436848349356.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/real-estate/residential/six-signs-of-a-sydney-housing-slowdown-20150714-giayov", "country": "AU", "title": "Six signs of a Sydney housing slowdown", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Six signs of a Sydney housing slowdown | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T11:51:00.000+03:00", "replies_count": 0, "uuid": "1d24be66316498a5d6b2b2e6b58736650fe39ccf"}, "author": "Matthew Cranston", "url": "http://www.afr.com/real-estate/residential/six-signs-of-a-sydney-housing-slowdown-20150714-giayov", "ord_in_thread": 0, "title": "Six signs of a Sydney housing slowdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There is currently about three months worth of Sydney housing supply on the market. The Reserve Bank of Australia said last year that clearance rates were highly correlated to house prices .\nSydney recorded its lowest clearance rate of the year at 80 per cent on the weekend , according to Domain's latest auction data, which is the first sign of a slowing market.\n\"Over the last six weeks we have seen five drops and the trend is clearly down,\" Domain's senior economist Andrew Wilson said.\n\"Not only is the clearance rate falling, it's starting to converge with the rates we had the same time last year. If we see the trend continue we may see the clearance rate fall below where they were a year ago and that would be a very interesting reflection of where we are in the market,\" Mr Wilson said.\n Reserves Another key indicator, but far less empirically reliable, is the gap between the price a house successfully sold at auction and its reserve.\nThere is no measure for that except anecdotal evidence but once the percentage difference comes back down then the confidence of vendors starts to fade.\nListings and speed of sale Vendors confidence forms another key indicator of a slowing market. Generally, that is judged by the volume of listings. The number of old and new listings in Sydney is down 12.8 per cent from this time last year, according to CoreLogic RP Data Property Market Indicator.\nHowever, new listings alone or those which have not been advertised for sale over the past six months climbed to 7690 this week – up more than 25 per cent on the same time this year.\nCoreLogic RP Data's Cameron Kusher said these figures showed stock coming to market was being sold quickly so there was a lower amount in overall listings. And because older stock is being sold so quickly it is encouraging more vendors to bring a greater number of new listings to the market.\n\"You would usually see listings ease at this time of year but we haven't,\" Mr Kusher said.\n\"There is so much urgency in the market. People want to buy properties and even at this slower time of year people are bringing their properties to market.\"\nHe said that because houses were being sold after a record low time on market there was now only about three months supply in Sydney.\nWhile the level of supply and the speed at which they are sold are clearly major components in price determination, the types of demand such as investors, non investors or first home buyers are just as crucial.\nType of buyer In Monday's official housing lending figures, investors showed themselves to be the key borrowers for homes purchases. They accounted for 62 per cent of the market, up from 57 per cent a year ago. While those figures come from the Australian Bureau of Statistics there are other statistics that show different trend.\nAustralia's biggest wholesale mortgage broker AFG reports a large decline in investor property loans over the month of May giving the clearest signal yet that Sydney's housing market is starting to cool.\nThe mortgage broker said investment loans accounted for 36.9 per cent of the national pool of mortgages down from a peak of 43.1 per cent in April.\nInvestors have a deeper pool of funds to rely on when they bid for homes compared with non-investors. Their demand can often fuel how high prices go and when they start to exit the market the prices can soften.\nInterest rates The cost of money is also a clear driver of both demand and price. While some pundits have predicted interest rates will stay low for another 18 months or even hit zero in Australia, others feel the cost of borrowing is heading the other way and will start to dampen house prices.\nCharter Keck Cramer's strategic research principal Toby Adams says rates will soon start to affect the market.\n\"Interest rates have been at record lows and have stimulated a lot of investment. Although I don't want to speculate on interest rates I would expect a ratcheting up of a few basis points which will take some of the heat out of the market.\"\nEmployment The last indicator – and certainly not the least important – is employment. Jobs give people the ability to afford loans to buy homes.\nNSW had the largest increase in employment, in seasonally adjusted terms, in June with an extra 11,300 people employed.\nHowever, the official unemployment rate for NSW has been jumping up and down for the past two years. The rate ticked up to 5.8 per cent in June from 5.7 per cent in May as more people looked for work.\nAs Sydney's house prices have jumped in the past two years, unemployment has increased as well from 5.2 per cent in 2012 and 5.4 per cent in 2013.", "external_links": ["http://www.rba.gov.au/publications/rdp/2014/2014-09/appendix-d.html"], "published": "2015-07-14T11:51:00.000+03:00", "crawled": "2015-07-14T14:06:15.000+03:00", "highlightTitle": ""}