{"organizations": [], "uuid": "ae3d6926d382a64264c5a398458f361855784ea9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneycontrol.com", "main_image": "http://www.moneycontrol.com/news_image_files/2015/356x200/m/man_thinking_356X200_2602_356.jpg", "site_section": "http://www.moneycontrol.com/rss/pfcolumns.xml", "section_title": "Moneycontrol Personal Finance Columns", "url": "http://www.moneycontrol.com/news/credit-cards/how-to-get-outcredit-card-debt-trap_1717621.html", "country": "IN", "title": "How to get out of credit card debt trap", "performance_score": 0, "site": "moneycontrol.com", "participants_count": 0, "title_full": "How to get out of credit card debt trap", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T10:07:00.000+03:00", "replies_count": 0, "uuid": "ae3d6926d382a64264c5a398458f361855784ea9"}, "author": "", "url": "http://www.moneycontrol.com/news/credit-cards/how-to-get-outcredit-card-debt-trap_1717621.html", "ord_in_thread": 0, "title": "How to get out of credit card debt trap", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Source: Moneycontrol.com How to get out of credit card debt trap Credit card debt is a common phenomenon among young executives. The high cost debt can be a burden for many. And here is an action plan to get out of the credit card debt trap. \nSridevi Ganesh Investment Advisor \nWhen I got a call from Mr Yogesh that he wanted to discuss with me his debt issues, little I assumed that it was such a burden for him to come out of the trap for the last 3 years. \nYogesh was earning well and enjoying his life like any other management graduate. He had settled in to a decent job with good salary. He was earning Rs 60000 per month and had a fantastic life with no commitments. He was sold a credit card by a smooth talking tele caller from a reputed bank after six months into his job. His expenses were same but he started paying all his bills through his new credit card. He wanted to get some air miles by spending through the card and want to have a free flight tickets for a domestic vacation. \nWhen he received his first bill, he started paying the minimum amount and enjoyed his credit card spending. As the credit card statement highlighted clearly the minimum amount to be paid, he paid the same and didn’t realize the trouble he would be in, soon. Suddenly he realized his outstanding in his credit card was Rs 225000. From then on he is bent on bringing the outstanding to less than Rs 1 but in vain. He is unable to understand how the bill amount keeps swelling to levels beyond his imagination. \nIf you are in such a situation, you are not alone. There are many young earners who are in this trap. How to get out of this credit card debt trap? \nThere are six simple steps to be followed : 1. Stop using your credit card for any further purchase2. Start paying maximum amount possible every month and increase your payment gradually3. Reduce your expenses and move the surplus to pay credit card outstanding4. Cut all your savings and investments and redirect the quantum to pay off your outstanding5. Talk to your banker and negotiate on the interest6. Opt for cheaper loans to pay of the credit card outstanding \nStop using your credit card for any further purchase \nWhen there are outstanding dues to be paid in your credit card, you do not enjoy any interest free period. Interest will be applicable from the date of your purchase. Credit card interest rates vary from 36% per annum to 48% per annum. Too scary, Isn’t it? By doing this, you are catering to your needs and ignoring the wants for the time being. Paying by cash will cut unnecessary spending too. \nStart paying maximum amount possible every month and increase your payment gradually \nWhen you pay the minimum amount due, balance outstanding amount is not free but is charged an interest of 36% per annum to 48% per annum. So once your salary gets credited, pay off whatever maximum that can be done and do not wait for the due date to initiate your payment. This saves your interest for the rest of the days till the next bill cycle for the amount you are paying. Look at increasing the payment quantum on a gradual basis by cutting down your expenses. If the last payment was 20,000 ensure that you pay at least 22,000 the next month and so on. If you are wondering how to do this, then the answer lies in the next paragraph. \nReduce your expenses and move the surplus to pay your outstanding \nFirst thing you need to work on is your monthly budget. Try to save money by reducing or postponing expenses. There are umpteen ways of cutting down unwanted expenses. Spend money only on necessities. Redirect available cash to service your credit card debt. Unless you follow this strictly, you will get caught in the debt trap! \nCut all your savings and investments and redirect to settle the outstanding \nIt does not make sense to save or invest when you have a credit card debt. Nowhere you get a return of in excess of 36% – 48% per annum. Hence it is prudent to stop all your SIPs and other savings till you settle the credit card outstanding. Debt is a liability. Conventional wisdom says that “Do not get burdened by debt”. That is the simple understanding required to lead a healthy financial life. \nTalk to your banker and negotiate on the interest \nTalking to your banker who issued your credit card may save your interest portion. If you are a credit worthy customer and if you are willing to pay back credit card outstanding, banker will generally reduce the interest burden. A penny saved is a penny earned. Check your CIBIL score before talking to your banker. \nOpt for cheaper loans to pay off the outstanding \nThough this should be the last option, try getting personal loan at cheaper rates to reduce the credit card outstanding. Balance transfer to other credit card if already have one, may work out for some. But paying higher amounts regularly is the best option to close the credit card outstanding. Do not try to get interest free loan from your support system as it may spoil the relationship. You can get low interest loans from your family and friends. Do not overburden yourself with more EMIs. That will become one more trap. \nIf you have multiple loans, assign high priority to credit card outstanding and pay the bill at the earliest possible. Set aside a timeline to come out of credit card outstanding and follow the deadline. \nOnce you are out of this debt trap, be careful to use your credit card. Pay the full outstanding before the due date. Do not fall for minimum amount to be paid option. Check your CIBIL report again and confirm your credit card outstanding is nil. Finally, buy only when you need. \nLiving within your means is an age old wisdom that cannot be ignored. Debt is dirt and dirt is not good! Post Your Comments Have an opinion on this news? Post your comment here. Copyright Â© e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form or medium without express written permission of moneycontrol.com is prohibited.", "external_links": [], "published": "2015-06-30T10:07:00.000+03:00", "crawled": "2015-07-01T02:21:08.000+03:00", "highlightTitle": ""}