{"organizations": ["SEC"], "uuid": "d69fa09cc7cb09af2dab3f228fd415483c7af56f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "biz.yahoo.com", "main_image": "", "site_section": "http://biz.yahoo.com/rss/headline?s=OIS", "section_title": "Yahoo! Finance: OIS Company News", "url": "http://biz.yahoo.com/e/150708/ois8-k.html", "country": "GB", "title": "OIL STATES INTERNATIONAL, INC Files SEC form 8-K, Change in Directors or Principal Officers, Financial Statements and", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "OIL STATES INTERNATIONAL, INC Files SEC form 8-K, Change in Directors or Principal Officers, Financial Statements and", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T06:46:00.000+03:00", "replies_count": 0, "uuid": "d69fa09cc7cb09af2dab3f228fd415483c7af56f"}, "author": "", "url": "http://biz.yahoo.com/e/150708/ois8-k.html", "ord_in_thread": 0, "title": "OIL STATES INTERNATIONAL, INC Files SEC form 8-K, Change in Directors or Principal Officers, Financial Statements and", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Show all filings for OIL STATES INTERNATIONAL, INC \nForm 8-K for OIL STATES INTERNATIONAL, INC \n8-Jul-2015 \nChange in Directors or Principal Officers, Financial Statements and Item 5.02 Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. \n(c) Appointment of Certain Officers. \nEffective July, 1, 2015, Oil States International, Inc. (the \"Company\") appointed Philip S. \"Scott\" Moses to the position of Senior Vice President, Offshore Products. Mr. Moses replaces Charles Moses, his father, who retired from his role as Senior Vice President, Offshore Products effective July 1, 2015. \nMr. Moses joined the Company as a full-time employee in 1996 and has served in several engineering and managerial positions during his tenure. Most recently, since 2013 Mr. Moses has served as the Senior Vice President of Operations for Offshore Products. Prior to such role, Mr. Moses served as Senior Vice President of the Engineered/Industrial Product Group within the Company's Offshore Products business segment, where he had responsibility over several U.S. locations and all of the international locations within that business segment. Mr. Moses holds a B.S. in Mechanical Engineering from Texas A&M University. \nIn connection with his appointment, the Company entered into an Executive Agreement with Mr. Moses, dated as of July 1, 2015 (the \"Executive Agreement\"), which provides for certain compensation and benefits to be payable upon a qualifying termination of Mr. Moses' employment or a \"Change of Control\" of the Company (as defined in the Executive Agreement). \nSpecifically, the Executive Agreement provides for the following termination payments and benefits: \n? Change of Control Severance Benefits. In the event that, during the 24 months following a Change of Control, Mr. Moses is terminated by the Company other than for \"Cause\" or Mr. Moses resigns for \"Good Reason\" (each, as defined in the Executive Agreement), then Mr. Moses will be entitled to receive a lump sum severance payment equal to two times the sum of his base salary and the target annual bonus that may be earned by him pursuant to the Company's annual incentive compensation plan for the year of termination (the \"AICP\"). In addition, upon such termination, Mr. Moses would be entitled to (a) accelerated vesting of all options, restricted shares and restricted stock units, (b) vesting in all qualified and nonqualified retirement plans, (c) a benefit continuation subsidy for up to a 36-month period following termination and (d) outplacement benefits. \n? Regular Severance Benefits. In the event Mr. Moses is terminated by the Company other than for Cause outside of the 24-month period following a Change of Control, Mr. Moses would be entitled to receive a lump sum severance payment equal to one times the sum of his base salary and the target annual bonus that may be earned by him pursuant to the AICP. In addition, upon such termination, Mr. Moses would be entitled to (a) accelerated vesting of all restricted shares and restricted stock units and (b) a benefit continuation subsidy for up to a 24-month period following termination. \nAll severance and other termination benefits payable pursuant to the Executive Agreement are conditioned upon Mr. Moses executing a release of claims in favor of the Company. \nIn addition, the Executive Agreement provides that Mr. Moses will receive accelerated vesting of all outstanding stock options upon the occurrence of a Change of Control (without regard to whether his employment is terminated). \nThe summary above is qualified in its entirety by reference to the Executive Agreement, a copy of which is filed herewith as Exhibit 10.1 and incorporated by reference. Item 9.01 Financial Statements and Exhibits. \n(d) Exhibits.", "external_links": [], "published": "2015-07-09T06:46:00.000+03:00", "crawled": "2015-07-09T01:11:17.000+03:00", "highlightTitle": ""}