{"organizations": [], "uuid": "d0d1810f11be4ed373496ff52bca87b615fffc30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/13/markets-forex-idUSL4N0ZS0PN20150713", "country": "US", "title": "FOREX-Euro slips as Greek deal remains elusive", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "FOREX-Euro slips as Greek deal remains elusive | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T07:20:00.000+03:00", "replies_count": 0, "uuid": "d0d1810f11be4ed373496ff52bca87b615fffc30"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/13/markets-forex-idUSL4N0ZS0PN20150713", "ord_in_thread": 0, "title": "FOREX-Euro slips as Greek deal remains elusive", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro zone says Greece must pass reform laws before bailout talks\n* Yen firmer as safety demand rises (Updates prices, adds comments)\nBy Masayuki Kitano and Ian Chua\nSINGAPORE/SYDNEY, July 13 (Reuters) - The euro fell on Monday, hurt by uncertainty over whether a near-bankrupt Greece can secure more funding as its European partners demanded tough reforms in return for throwing a life-line to the debt-strapped nation.\nThe euro last traded at $1.1145, down 0.2 percent on the day. Earlier on Monday, it had slid as far as $1.1090, having stood at $1.11625 in late U.S. trade on Friday.\nAgainst the yen, the euro fell 0.2 percent to 136.65 yen , having retreated to as low as 135.40 yen earlier on Monday.\nGreece was told to push legislation through parliament this week to convince its euro zone creditors to release funds to avert a state bankruptcy and start negotiations on a third bailout programme estimated at up to 86 billion euros ($95.5 billion).\nA draft decision by Eurogroup finance ministers sent to the leaders showed that Greece must enact measures including tax and pension reforms by Wednesday night, and the entire package endorsed by parliament before talks on a bailout can start.\n\"Having thought that Sunday was the absolute, final deadline, we now have another absolute, final deadline on Wednesday,\" said Callum Henderson, global head of FX research for Standard Chartered Bank in Singapore.\nThe uncertainty has fostered a wait-and-see attitude in markets for now, Henderson said.\nThe emergency euro zone summit meeting in Brussels was set to reconvene in full session early on Monday, a spokesman for summit chairman Donald Tusk said.\nAnalysts expected the euro to bob around $1.10-$1.12 as investors waited to see whether Greek Prime Minister Alexis Tsipras would be able to pass the proposed austerity package amid opposition from his leftist coalition.\n\"I don't think we are going to get a move of more than 2 percent (in euro/dollar),\" said Adam Myers, senior FX strategist at Credit Agricole in London. \"However, if there are signs that Greece is going to go out (of the euro zone), then we could have a bigger move.\"\nAs the safe haven yen edged higher, the dollar eased 0.1 percent to 122.66 yen.\nUncertainty about Greece's future in the euro zone will continue to dominate market sentiment for now, traders said, pushing aside the other big elephant in the room - an eventual U.S. interest rate hike.\nLast Friday, Federal Reserve Chair Janet Yellen said she expected the Fed to raise interest rates at some point this year.\nBoston Fed President Eric Rosengren, one of the Fed's most dovish officials, said September may be the right time to hike rates if the U.S. economy continued to improve.\nInvestors will also be keeping a wary eye on Chinese stocks, which had bounced sharply for a second day on Friday in a sign that Beijing may finally have stabilised the market after rolling out a raft of supportive measures.\nShanghai shares were up 2.1 percent on Monday morning, after having climbed 4.5 percent on Friday. (Additional reporting by Naomi Tajitsu in WELLINGTON; Editing by Shri Navaratnam)", "external_links": [], "published": "2015-07-13T07:20:00.000+03:00", "crawled": "2015-07-13T07:01:40.000+03:00", "highlightTitle": ""}