{"organizations": [], "uuid": "9db5fab815804380b75f9ec28928fed22c75ff8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources.news.com.au/cs/newscomau/images/placeholders/story-thumb-large.jpg", "site_section": "http://www.news.com.au/finance/business/breaking-news", "section_title": "Business Breaking News | Finance &amp; Business News | News.com.au", "url": "http://www.news.com.au/finance/business/greek-voters-perplexed-over-referendum/story-e6frfkur-1227426859511", "country": "AU", "title": "Greek voters perplexed over referendum", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Greek voters perplexed over referendum", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "9db5fab815804380b75f9ec28928fed22c75ff8d"}, "author": "Derek Gatopoulos and Costas Kantouris", "url": "http://www.news.com.au/finance/business/greek-voters-perplexed-over-referendum/story-e6frfkur-1227426859511", "ord_in_thread": 0, "title": "Greek voters perplexed over referendum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COSTAS Christoforidis hasn't decided how to vote in Sunday's referendum on a bailout deal for Greece's troubled economy. The problem is, the 37-year-old farmer isn't sure what he's voting for.\n\"IF it's saying 'No' to austerity, then it's a 'No' from me too. But if we are rejecting Europe, I disagree with that,\" he said - a position that many of Greece's perplexed public find themselves in ahead of one of the most important votes in their country's modern history.\nAs Greek banks and markets on Friday remained closed for a fourth day, rival campaigns scrambled to roll out their messages. And a prediction from the International Monetary Fund that Greece will need piles of additional cash from eurozone countries and others over the next three years put even more pressure on the government. \"Our efforts are focused on overcoming the crisis as fast as possible - with a solution that preserves the dignity and sovereignty of our people,\" Prime Minister Alexis Tsipras said. The popular 40-year-old prime minister is gambling his government on a call to voters to reject austerity measures demanded by bailout lenders, despite coming close to a deal last week. A strong \"No\" vote, he argued, would help Greece win a new deal with the eurozone's rescue mechanism that would include terms to make the country's 320 billion euros ($A464.44 billion) national debt sustainable. Opponents say he is risking the country's future - asking voters to weigh in on a bailout offer that expired at midnight on Tuesday. \"They are making a serious mistake. Because the world will consider a 'No' vote to be a withdrawal from the heart of Europe - the first step toward euro exit,\" former conservative prime minister Costas Karamanlis said, making his first public speech in six years to endorse the \"Yes\" campaign. Tsipras' argument was also dismissed by the head of the eurozone finance ministers' group, Dutch Finance Minister Jeroen Dijsselbloem. \"That suggestion is simply wrong,\" Dijsselbloem told MPs in the Netherlands. European officials and the Greek opposition have warned a `No' outcome on Sunday could be tantamount to a decision to leave the euro. \"The consequences are not the same if it's a 'Yes' or 'No',\" French President Francois Hollande said. \"If it's the 'Yes,' even if it's on the basis of proposals that have already expired, negotiations can resume and I imagine be quickly concluded,\" he said. \"We are in something of an unknown. It's up to the Greeks to respond.\" And in one of the clearest signs yet that the future of the government is on the line in Sunday's vote, the country's outspoken finance minister, Yanis Varoufakis, told Australia's ABC radio he was likely to resign if a `Yes' vote prevails. Tsipras signalled the same earlier this week, declaring on state TV that he was not an \"all-weather\" prime minister - a strong indication he would step down if his proposal is defeated. Tension surrounding the vote has remained high since banks closed this week and were forced to impose strict cash withdrawal limits. On Thursday, elderly Greeks, some struggling with walking sticks or being held up by others, formed large crowds outside the few banks opened to help pensioners without ATM cards get access to money. Elsewhere in Athens, campaigners battled for visibility as time to reach voters was running out. `Yes' posters appeared for the first time around the city, and rival campaign rallies were scheduled for the same time Friday night, 800 metres apart, in the heart of the city. Some 6,000 supporters of the Greek Communist Party attended a rally outside parliament on Thursday, urging voters to cast invalid ballots in protest of Greece's continued membership in the European Union. Greece has been thrown into financial limbo after missing a massive IMF repayment this week when its bailout program expired. Raising the stakes further for Sunday's vote, an IMF report released on Thursday but compiled last week before the talks collapsed, warned that to avoid financial collapse, Greece would need additional debt relief costing 50 billion euros and lasting through 2018 - a bleak prospect for a country that has already endured six years of recession. Ashkoda Mody, a visiting professor in international economic policy at Princeton University, argued that the IMF's call for debt relief should have been made far earlier, before the talks collapsed. \"If the IMF and other creditors had this document while they were negotiating with the Greeks, it is completely unconscionable that they did not discuss deep debt relief,\" he said. Polling data on Sunday's vote has been scarce during the week-long campaign, with one research company saying Thursday that a survey showing a narrow lead for the `Yes' vote was based on an unauthorised leak of partial data it had gathered. One source of confusion is the actual question being posed to voters - 17 lines of bureaucratic language that ends with the `No' option placed above the `Yes'. Considering her response, 64-year-old retiree Eleni Maili said: \"I can't vote 'Yes' or 'No' - both have their pitfalls. And in the end, the lenders will just interpret the result in a way that suits them\". She did have one question of her own, though. \"I do wonder about all that money we got over all those years,\" she said. \"Where is that money? Because the people didn't see any of it.\" ", "external_links": ["http://digg.com/submit?phase=2&url=http://www.news.com.au/finance/business/greek-voters-perplexed-over-referendum/story-e6frfkur-1227426859511?sv=58c7adef57e8d2b11408bcab4380bcca&title=Greek+voters+perplexed+over+referendum", "http://www.facebook.com/share.php?u=http://www.news.com.au/finance/business/greek-voters-perplexed-over-referendum/story-e6frfkur-1227426859511?sv=58c7adef57e8d2b11408bcab4380bcca", "http://www.newsvine.com/_wine/save?popoff=0&u=http://www.news.com.au/finance/business/greek-voters-perplexed-over-referendum/story-e6frfkur-1227426859511?sv=58c7adef57e8d2b11408bcab4380bcca&h=Greek+voters+perplexed+over+referendum", "http://www.kwoff.com/submit.php?url=http://www.news.com.au/finance/business/greek-voters-perplexed-over-referendum/story-e6frfkur-1227426859511?sv=58c7adef57e8d2b11408bcab4380bcca", "http://del.icio.us/post?url=http://www.news.com.au/finance/business/greek-voters-perplexed-over-referendum/story-e6frfkur-1227426859511?sv=58c7adef57e8d2b11408bcab4380bcca&title=Greek+voters+perplexed+over+referendum", "http://www.myspace.com/index.cfm?fuseaction=postto&t=Greek+voters+perplexed+over+referendum&c=GREEKS+are+perplexed+over+how+to+vote+in+Sunday%27s+referendum+with+many+feeling+they+can%27t+vote+yes+or+no.&u=http://www.news.com.au/finance/business/greek-voters-perplexed-over-referendum/story-e6frfkur-1227426859511?sv=58c7adef57e8d2b11408bcab4380bcca"], "published": "2015-07-03T03:00:00.000+03:00", "crawled": "2015-07-05T05:49:24.000+03:00", "highlightTitle": ""}