{"organizations": [], "uuid": "f2d622ce284c559b875ad4276e745b4bbdffa2f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/r/9/f/0/image.related.afrArticleLead.620x365.gidp63.png/1437018720961.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/technology/neil-young-pulls-the-pin-on-music-streaming-due-to-worst-sound-quality-20150716-gidp63", "country": "AU", "title": "Neil Young pulls the pin on music streaming due to 'worst' sound quality", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Neil Young pulls the pin on music streaming due to 'worst' sound quality | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T11:52:00.000+03:00", "replies_count": 0, "uuid": "f2d622ce284c559b875ad4276e745b4bbdffa2f8"}, "author": "afr.com", "url": "http://www.afr.com/technology/neil-young-pulls-the-pin-on-music-streaming-due-to-worst-sound-quality-20150716-gidp63", "ord_in_thread": 0, "title": "Neil Young pulls the pin on music streaming due to 'worst' sound quality", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Singer-songwriter and musician Neil Young has said he won't allow streaming services to carry his songs, due to the poor audio quality. Singer-songwriter and musician Neil Young said on Wednesday he won't allow his music to be streamed any more, not because of disputes over royalties, but rather over poor sound quality.\n\"I don't need my music to be devalued by the worst quality in the history of broadcasting or any other form of distribution,\" the Canadian rocker said in a post on his Facebook page.\n\"I don't feel right allowing this to be sold to my fans. It's bad for my music.\"\nYoung, 69, was one of the biggest rock stars of the 1960s and 1970s with bands like Buffalo Springfield and Crosby, Stills, Nash and Young, and a successful solo career that has included albums like \"Harvest\" and \"Rust Never Sleeps.\"\nTaylor Swift has had a number of run ins with music streaming service providers over the amount of money they make for artists. Kevin Winter He has long complained about digital audio and, as a result, has developed Pono, a portable player that aims to lend a higher quality than streaming or MP3.\nYoung said his decision is \"not because of the money, although my share (like all other artists) was dramatically reduced by bad deals made without my consent.\"\nHis criticism is a new blow to streaming services like Spotify, the target of criticism from artists who complain of meager payments for their work.\nMost notably, top-selling pop star Taylor Swift withdrew her catalogue from Spotify last November, saying the business had shrunk the number of paid album sales drastically.\n Last month, Swift agreed to put her latest hit album \"1989\" on Apple Music, days after Apple did an about-face, agreeing to pay artists during a free trial of its new streaming music service.\nYoung also left the door open to returning to streaming.\n\"When the quality is back, I'll give it another look. Never say never,\" he said.", "external_links": [], "published": "2015-07-16T11:52:00.000+03:00", "crawled": "2015-07-16T10:03:56.000+03:00", "highlightTitle": ""}