{"organizations": [], "uuid": "5e11d2756b319a26c6edf2eee144919f9c25d7ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/royal-gold-provides-operational-transaction-210000498.html", "country": "US", "title": "Royal Gold Provides Operational and Transaction Update", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Royal Gold Provides Operational and Transaction Update", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T00:00:00.000+03:00", "replies_count": 0, "uuid": "5e11d2756b319a26c6edf2eee144919f9c25d7ad"}, "author": "", "url": "https://uk.finance.yahoo.com/news/royal-gold-provides-operational-transaction-210000498.html", "ord_in_thread": 0, "title": "Royal Gold Provides Operational and Transaction Update", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 23, 2015, 22:16 BST - UK Markets closed Royal Gold Provides Operational and Transaction Update Press Release : Royal Gold, Inc. – 16 minutes ago Related Content \nDENVER--(BUSINESS WIRE)-- \nRoyal Gold, Inc. (NASDAQ: RGLD; TSX: RGL) (“Royal Gold” or the “Company”) provides an operational update for its streaming and royalty interests at Mount Milligan, Phoenix and Voisey’s Bay, as well as an update on the status of its streaming transaction with Golden Star Resources Ltd. (“Golden Star”) and its Peak Gold Joint Venture (“Peak Gold”). \nMount Milligan Mine \nFor the quarter ended June 30, 2015, the Company’s wholly owned subsidiary, RGLD Gold AG (“RGLD Gold”), purchased approximately 21,400 ounces of gold from the Mount Milligan mine at a cash price of $435 per ounce as part of its purchase and sale agreement with Thompson Creek Metals Company, Inc. (“Thompson Creek”), and sold approximately 23,000 ounces of gold related to Mount Milligan. In addition, RGLD Gold had approximately 5,300 ounces remaining in inventory as of June 30, 2015. \nPhoenix Project \nOn June 24, 2015, Rubicon Minerals Corporation (“Rubicon”) announced its first gold pour at the Phoenix Gold Project of approximately 741 ounces. RGLD Gold will begin receiving deliveries in the current quarter related to initial commissioning activities and anticipates more substantial gold deliveries as the mine ramps up to design production. \nRubicon will deliver 6.30% of the gold from the Phoenix mine until 135,000 ounces have been delivered, then 3.15% thereafter. RGLD Gold will pay 25% of the spot price at the time of delivery. \nVoisey’s Bay Mine \nWe received the first quarterly royalty payment relating to processing Voisey’s Bay nickel concentrates at Vale’s new Long Harbour hydrometallurgical plant. In response to questions concerning Vale’s determination of the Long Harbour smelter and refining charges deducted from actual proceeds to calculate the net smelter return royalty payable, Vale recently stated that the charges included “the cost of product sold, pre-operating costs, depreciation and cost of capital.” Royal Gold strongly disagrees with Vale’s determination that these charges are permissible deductions pursuant to the royalty agreement and is requesting further clarification of the basis for these charges while aggressively pursuing its legal remedies. \nGolden Star Transaction \nOn May 7, 2015, the Company announced that RGLD Gold entered into a streaming agreement with Golden Star Resources Limited (“Golden Star”). The transaction is expected to close soon, upon satisfaction of remaining closing conditions, with RGLD Gold making an initial upfront payment at closing of $40 million to Golden Star. Royal Gold will simultaneously fund a $20 million dollar term loan as part of the transaction. RGLD Gold expects to make further advance payments totaling $90 million over the next five quarters. Once the initial upfront payment has been made, RGLD Gold expects to receive stream deliveries from Golden Star in the current quarter related to production from and after April 1, 2015. \nGolden Star will deliver to RGLD Gold 8.5% of gold produced from Wassa, Bogoso and Prestea until 185,000 ounces have been delivered, 5.0% until an additional 22,500 ounces have been delivered, and 3.0% thereafter. RGLD Gold will pay Golden Star 20% of the spot price at the time of delivery until 207,500 ounces have been delivered, and 30% of the spot price thereafter. \nPeak Gold \nAs described on the Company’s fiscal third quarter conference call, Royal Gold incurred certain costs associated with the summer exploration program at Peak Gold. The Company estimates approximately $2 million in expenditures will be reported in its financial results ended June 30, 2015. \nCORPORATE PROFILE \nRoyal Gold, Inc. is a precious metals royalty and stream company engaged in the acquisition and management of precious metal royalties, streams, and similar production based interests. The Company owns interests on 196 properties on six continents, including interests on 37 producing mines and 24 development stage projects. Royal Gold, Inc. is publicly traded on the NASDAQ Global Select Market under the symbol “RGLD,” and on the Toronto Stock Exchange under the symbol “RGL.” The Company’s website is located at www.royalgold.com . \nCautionary “Safe Harbor” Statement Under the Private Securities Litigation Reform Act of 1995: With the exception of historical matters, the matters discussed in this press release are forward-looking statements that involve risks and uncertainties that could cause actual results to differ materially from projections or estimates contained herein. Such forward-looking statements include statements about the Company’s receipt of gold from Thompson Creek, Rubicon, and Golden Star in periods after June 30, 2015, its upfront payment to Golden Star, and the Company’s receipt of royalty payments from Vale in periods after June 30, 2015. Factors that could cause actual results to differ materially from the projections include, among others, the timing of shipments, disagreements on assays, losses in transport, performance of and production at Mount Milligan, the Phoenix Gold Project, Golden Star’s Wassa, Bogoso and Prestea operations and Voisey’s Bay; decisions and activities of Thompson Creek, Rubicon, Golden Star and Vale; changes in project parameters and timelines as plans continue to be refined; economic and market conditions; unanticipated grade, geological, metallurgical, processing, regulatory and legal or other problems that Thompson Creek, Rubicon, Golden Star and Vale may encounter; changes in operators’ mining and processing techniques or royalty or stream calculation methodologies; errors or disputes in calculating royalty payments or stream deliveries, or payments or deliveries not made in accordance with royalty and streaming agreements; resolution of legal proceedings (including with Vale regarding Voisey’s Bay); and other subsequent events, as well as other factors described in the Company's Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, and other filings with the Securities and Exchange Commission. Most of these factors are beyond the Company’s ability to predict or control. The Company disclaims any obligation to update any forward-looking statement made herein. Readers are cautioned not to put undue reliance on forward-looking statements. View source version on businesswire.com: http://www.businesswire.com/news/home/20150723006587/en/ Contact:", "external_links": [], "published": "2015-07-24T00:00:00.000+03:00", "crawled": "2015-07-24T00:17:18.036+03:00", "highlightTitle": ""}