{"organizations": [], "uuid": "ea02c52c39eefbe3de056a8dd0074ff304d949e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/09/usa-crime-madoff-konigsberg-idUSL1N0ZP2F720150709", "country": "US", "title": "Ex-accounting executive avoids prison in Madoff fraud case", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Ex-accounting executive avoids prison in Madoff fraud case | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T01:57:00.000+03:00", "replies_count": 0, "uuid": "ea02c52c39eefbe3de056a8dd0074ff304d949e4"}, "author": "Joseph Ax", "url": "http://www.reuters.com/article/2015/07/09/usa-crime-madoff-konigsberg-idUSL1N0ZP2F720150709", "ord_in_thread": 0, "title": "Ex-accounting executive avoids prison in Madoff fraud case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, July 9 A former associate of Bernard Madoff avoided prison on Thursday for his role in perpetuating the fraudster's massive Ponzi scheme because of his extensive cooperation with prosecutors.\nPaul Konigsberg, 79, a lawyer and accounting firm executive, pleaded guilty in June 2014 to charges of conspiracy and falsifying books and records.\nAt the time, his cooperation deal was seen as a signal that prosecutors were still pursuing a criminal case against Madoff's son, Andrew, who died of cancer three months later.\nU.S. District Judge Laura Taylor Swain in New York, citing an otherwise admirable life, said Konigsberg had been punished enough by the loss of his reputation.\n\"You've demonstrated sincere remorse,\" she said.\nProsecutors said Konigsberg was unaware of the scheme but helped by conspiring with Madoff employees to create some of the fraudulent customer statements at its heart.\n\"Not a day goes by that I don't regret that I trusted Mr. Madoff,\" a tearful Konigsberg told Swain. \"As we've all come to know, this man was truly a monster.\"\nKonigsberg's plea last year included references to two unnamed co-conspirators who allegedly received sham tax-free loans from Madoff. Sources told Reuters the two people were Madoff's sons, Mark and Andrew.\nMark Madoff committed suicide in December 2010 on the second anniversary of his father's arrest. Andrew Madoff died in September.\nThe Madoff brothers denied any knowledge of or involvement in their father's fraud. Bernard Madoff is serving a 150-year sentence after pleading guilty to running the Ponzi scheme, estimated to have cost investors $17 billion in principal.\nIn the 1990s, Madoff began steering some of his biggest clients to Konigsberg's accounting firm.\nIn several instances, Konigsberg agreed to return customer account statements to Madoff's firm, to be replaced by amended statements with fraudulent backdated trades. He then filed clients' tax returns based on the revised statements.\nKonigsberg also allowed Madoff to pay a relative for a no-show job at Madoff's firm, prosecutors said.\nKonigsberg has forfeited more than $4 million of commissions his firm received for Madoff clients.\nProsecutors said Konigsberg aided the investigation into Madoff's longtime bank, JPMorgan Chase & Co. The bank agreed in January 2014 to pay $2.6 billion to resolve criminal and civil claims related to Madoff.\nFifteen defendants including Madoff have been convicted in connection with the fraud.\nThe case is U.S. v. Konigsberg, U.S. District Court for the Southern District of New York, No. 10-cr-228. (Reporting by Joseph Ax)", "external_links": [], "published": "2015-07-10T01:57:00.000+03:00", "crawled": "2015-07-10T01:13:32.000+03:00", "highlightTitle": ""}