{"organizations": [], "uuid": "22e66d9a0da320eae6628c4f6c758fe5873beed7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-21/rba-says-growth-likely-slowed-last-quarter-aussie-needs-to-drop", "country": "US", "title": "RBA Says Growth Likely Slowed Last Quarter, Aussie Too High", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "RBA Says Growth Likely Slowed Last Quarter, Aussie Too High - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T09:30:00.000+03:00", "replies_count": 0, "uuid": "22e66d9a0da320eae6628c4f6c758fe5873beed7"}, "author": "Michael Heath", "url": "http://www.bloomberg.com/news/articles/2015-07-21/rba-says-growth-likely-slowed-last-quarter-aussie-needs-to-drop", "ord_in_thread": 0, "title": "RBA Says Growth Likely Slowed Last Quarter, Aussie Too High", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia’s central bank said growth probably slowed last quarter and the currency is offering less assistance than would be expected given weaker commodity prices.\n“Non-mining business investment had been subdued,” the Reserve Bank of Australia said in minutes released Tuesday of its July 7 meeting, when it kept interest rates unchanged at a record-low 2 percent. “Surveys of businesses’ investment intentions suggested that it would remain so over the coming year.”\nThe RBA lowered borrowing costs twice this year as it sought to accelerate a transition toward service industries and manufacturing as a decade-long mining boom winds down. But the easy policy is fueling a housing bubble in parts of Sydney and Melbourne and the central bank would prefer a weaker currency to boost the competitiveness of local industries.\n“Members noted that the exchange rate had thus far offered less assistance than would normally be expected in achieving balanced growth in the economy and that further depreciation seems likely and necessary,” the RBA said. The Australian dollar has fallen more than 4 percent this month.\nThe currency fell after the minutes and was trading at 73.61 U.S. cents at 11:51 a.m. in Sydney from 73.77 cents before the release.\nWhile the economy grew a stronger-than-expected 0.9 percent in the first three months of the year, “early indications were that the strength in the March quarter had not carried through to the June quarter,” the central bank said.\nRBA Governor Glenn Stevens has been looking for an improvement in business confidence as a precursor to higher investment by firms outside the resources sector. Sentiment has begun to pick up, aided by tax cuts and breaks in the government’s May budget, and the labor market shows signs of stabilizing.\nSlower Population Growth The containment of the jobless rate at about 6 percent is explained by a slowdown in population growth to 1.4 percent in the year through December 2014 from 1.8 percent in 2012, according to the minutes.\nThis “helped to reconcile below-average growth in output with the relatively steady unemployment rate,” the central bank said. “Despite recent improvements in labor market indicators, members reflected that there was still evidence of spare capacity.”\nThe central bank noted wage growth remained weak and said inflation pressures were well contained and likely to remain so.\nTraders are pricing in a less than 20 percent chance of a rate cut next month, rising to about 50 percent by year’s end.\n“Information to be received over the period ahead on economic and financial conditions would continue to inform the board’s assessment of the outlook and hence whether the current stance of monetary policy remained appropriate to foster sustainable growth and inflation consistent with the target,” the central bank said.", "external_links": ["http://www.rba.gov.au/monetary-policy/rba-board-minutes/2015/2015-07-07.html\\"], "published": "2015-07-21T09:30:00.000+03:00", "crawled": "2015-07-21T05:21:18.803+03:00", "highlightTitle": ""}