{"organizations": [], "uuid": "9740741c2e899d0fb98bffd5e259b3df222aafdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business/Finance", "url": "http://www.menafn.com/1094286865/IBM-revenue-falls-for-13th-straight-quarter-shares-dip?src=RSS", "country": "US", "title": "IBM revenue falls for 13th straight quarter shares dip", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "IBM revenue falls for 13th straight quarter shares dip | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "9740741c2e899d0fb98bffd5e259b3df222aafdd"}, "author": "The Arabian Post", "url": "http://www.menafn.com/1094286865/IBM-revenue-falls-for-13th-straight-quarter-shares-dip?src=RSS", "ord_in_thread": 0, "title": "IBM revenue falls for 13th straight quarter shares dip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - The Arabian Post) International Business Machines Corp's (IBM.N) revenue fell for the 13th consecutive quarter and missed the average analyst estimate, as it continued to shed low-margin businesses and the strong dollar weighed on Big Blue's results.\n\nShares of the world's largest technology services company fell about 5 percent in after-market trading on Monday.\n\nIBM is deep in transition, and has been selling businesses such as low-end servers, cash registers, and semiconductors to focus on high-growth areas like security software, cloud services and data analytics.\n\nThe company, which sold its x86 server business to Lenovo Group Ltd (0992.HK) last year, has continued realigning its operations by paying contract-chipmaker Globalfoundries Inc to take over its loss-making semiconductor unit this month.\n\nRevenue from what the company calls \"strategic imperatives\", which include cloud and mobile computing, data analytics, social and security software, rose about 20 percent, yet the new businesses have so far failed to make up for revenue lost to divestitures.\n\nIBM said it expected third-quarter revenue to be the same as revenue from the first quarter, or about 19.6 billion.\n\nRevenue from its software business fell 10 percent to 5.8 billion from a year earlier.\n\nRevenue from global technology services such as outsourcing fell 10 percent, hurt by weak discretionary IT spending by clients.\n\n\"Traditional software and services remain under pressure across IT, and we believe M&A remains one of the only glimmers of hope to restore growth back to these traditional tech giants that are starving for growth,\" Daniel Ives, an analyst at FBR Capital Markets, said.\n\nArmonk, New York-based IBM's total revenue fell to 20.81 billion in the second quarter ended June 30, from 24.05 billion a year earlier, missing the average analyst estimate of 20.95 billion, according to Thomson Reuters I/B/E/S.\n\nIBM's quarterly results were also hurt by the strong dollar. The company, which gets more than half its revenue from overseas, said it expected a slightly greater currency impact in the second half of the year.\n\nConsolidated net income dropped to 3.45 billion, or 3.50 per share, for the second quarter, from 4.14 billion, 4.12 per share, a year earlier.\n\nExcluding items, IBM earned 3.84 per share, beating the average analyst estimate of a profit of 3.78.\n\nUp to Monday's close of 173.22, the company's shares had risen about 8 percent this year.", "external_links": [], "published": "2015-07-21T03:00:00.000+03:00", "crawled": "2015-07-21T22:08:45.773+03:00", "highlightTitle": ""}