{"organizations": [], "uuid": "b6009273c811f60493564561e11c6f74a548b54b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125nq9tme/*http://www.noodls.com/view/77FA351358A76FA0E4AE89A68CA9CE19005018D2", "country": "GB", "title": "Results of General Meeting", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Results of General Meeting", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T04:31:00.000+03:00", "replies_count": 0, "uuid": "b6009273c811f60493564561e11c6f74a548b54b"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125nq9tme/*http://www.noodls.com/view/77FA351358A76FA0E4AE89A68CA9CE19005018D2", "ord_in_thread": 0, "title": "Results of General Meeting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Against \n2. \nTo approve, ratify and confirm GMG's entry into the Fund Shareholders Agreement and consummation of the transactions contemplated thereunder by GMG and to authorize any one or more directors of the Company to exercise all the powers of the Company to take all steps as he/she/they may in their opinion consider necessary, desirable or expedient to implement and/or give effect to the terms of the Fund Shareholders Agreement and the transactions contemplated thereunder (with any amendments to the terms of such agreement which are not inconsistent with the purpose thereof as may be approved by the directors of the Company). \n26,190,200 (100%) \n0 \n(0%) \nAs at the date of the GM, the Company had 2,759,212,843 issued Shares. Ms. Wong, Mr. Wong and their respective associates (interested in an aggregate of 1,571,655,517 Shares, representing approximately 56.96% of the total issued share capital of the Company as at the date of the GM), Mr. Ding and his respective associates (interested in an aggregate of 21,230,000 Shares, representing approximately 0.77% of the total issued share capital of the Company as at the date of the GM) and Mr. Chu and his respective associates (interested in an aggregate of 630,000 Shares, representing approximately 0.02% of the total issued share capital of the Company as at the date of the GM) had abstained from voting on the Ordinary Resolutions at the GM. Save as disclosed above, no other Shareholder was required to abstain from voting on the Ordinary Resolutions at the GM. The total number of Shares entitling the holders thereof to vote for or against the Ordinary Resolutions at the GM was 1,165,697,326, representing approximately 42.25% of the total issued share capital of the Company. There were no Shares in respect of which their holders were entitled to attend and vote only against the Ordinary Resolutions at the GM. As 100% of the votes was cast in favour of the Ordinary Resolutions, the Ordinary Resolutions were duly passed by the Independent Shareholders as ordinary resolutions of the Company. Computershare Hong Kong Investor Services Limited, the share registrars of the Company, acted as scrutineers for the vote-taking at the GM. By order of the Board Goldbond Group Holdings Limited \nCompany Secretary \nHong Kong, 9 July 2015 \nAs at the date of this announcement, the Board comprises Mr. Wang Jun, Mr. Wong Yu Lung, Charles, Mr. Ding Chung Keung and Ms. Wong, Michelle Yatyee (all being executive Directors), Mr. Ma Ho Fai SBS JP , Mr. Cheng Yuk Wo and Mr. Ng Chi Keung MH (all being independent non- executive Directors). \n2", "external_links": [], "published": "2015-07-10T04:31:00.000+03:00", "crawled": "2015-07-10T04:48:18.000+03:00", "highlightTitle": ""}