{"organizations": [], "uuid": "901735c6c281e9342e806d0e0f0a869f76f3d6d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-reuters/?format=rss", "section_title": "Finance News | Reuters - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/merkel-again-rules-haircut-greek-131028346.html", "country": "GB", "title": "France urges Greek 'responsibility\"' in return for EU solidarity", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "France urges Greek 'responsibility\"' in return for EU solidarity", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T19:47:00.000+03:00", "replies_count": 0, "uuid": "901735c6c281e9342e806d0e0f0a869f76f3d6d0"}, "author": "", "url": "https://uk.finance.yahoo.com/news/merkel-again-rules-haircut-greek-131028346.html", "ord_in_thread": 0, "title": "France urges Greek 'responsibility\"' in return for EU solidarity", "locations": ["France", "EU"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 9, 2015, 18:03 BST - UK Markets closed France urges Greek 'responsibility\"' in return for EU solidarity Reuters – 16 minutes ago Print \n(Reuters) - Following is the latest news on Greece's debt crisis after euro zone leaders set Athens a deadline of the end of the week to come up with convincing reform proposals. All times are in GMT. \n1351 - French Finance Minister Michel Sapin says Greece leaving the euro zone would damage the credibility of the currency bloc but so too would Greece staying while it continuously violates its financial obligations. \n1316 - German Finance Minister Wolfgang Schaeuble says Greece needs to deliver on concrete prior actions to gain European financial support, adding that it is difficult to see such steps being taken before Sunday. \n1304 - The IMF's chief economist, Olivier Blanchard, says Greece is a small part of the world economy and its possible exit from the euro zone should have limited impact on the rest of the world. However, he warns that similar crises could happen in other countries. \n1301 - Europe must build common tools to fight crises and needs to strike a balance between fiscal discipline and growth to reduce the risk of future turmoil, French Finance Minister Michel Sapin says. \n1203 - German Chancellor Angela Merkel reiterates that a so-called \"haircut\" on Europe's loans to Greece is out of the question. \n1152 - The chances of Greece leaving the euro zone this year have fallen, according to the betting odds of bookmakers Paddy Power and William Hill, three days before the deadline for a comprehensive deal. \n1014 - European Commission President Jean-Claude Juncker will meet members of Greece's opposition parties on Thursday and Friday in Brussels as all sides seek a weekend deal to avert a Greek bankruptcy, a Commission spokesman says. \n1009 - The head of the European Council, Donald Tusk, says the EU's national parliaments have to be persuaded to vote in favour of helping Greece if European leaders reach a good agreement on Sunday. Tusk says a deal on debt should be part of the agreement. \n1005 - Bulgarian Economy Minister Bozhidar Lukarski is quoted as saying Greek-owned banks in the Balkan country are \"under controls\" to prevent funds being sent to Greece. More than a fifth of Bulgaria's banks are Greek-owned. \n0944 - Irish Finance Minister Michael Noonan says he sees a better than 50 percent chance of Greece reaching a deal with its creditors by a weekend deadline following a \"distinct change of mood\" in recent days. \n0852 - Eurogroup chief Jeroen Dijsselbloem has no plans to withdraw his re-election bid, his spokesman says. Dijsselbloem, who is also the Dutch finance minister, is seeking another 2.5 year term in a race against Spaniard Luis de Guindos. He represents European creditors in the negotiations with Greece. \n0830 - The chief executive officer of Greece's natural gas company, DEPA, says the utility can guarantee the unobstructed supply of gas supplies in the country. \n0745 - Greek Energy Minister Panagiotis Lafazanis, leader of the far-left flank of the ruling Syriza party, says he expects an aid deal with creditors \"soon\" but he opposes a third bailout with tough austerity measures that would stifle growth. \n0733 - The European Central Bank is ready to implement a range of \"non-standard\" monetary policy measures if Greece leaves the euro zone, European Central Bank Governing Council member Ardo Hansson tells an Estonian newspaper. \n0714 - Greece's stock exchange will remain closed until July 13, the country's Capital Markets Commission says, after authorities decide to extend a bank holiday and capital controls. \n0700 - The head of Germany's Bundesbank, Jens Weidmann, says capital controls in Greece should remain in place until a new bailout programme has been agreed. He also says no further central bank liquidity support should be given to its banks. \n0634 - Greece is planning a reform package worth 12 billion euros over two years, more than previously planned, to offset a return to recession after months of difficult negotiations with creditors, the Greek daily Kathimerini reports. \n0549 - European Central Bank President Mario Draghi says it will be \"really difficult\" to end the Greek crisis and save the country from bankruptcy, in comments made to Italian financial daily Il Sole 24 Ore. He says he does not believe Russia will come to Greece's rescue. \n0535 - Greek government spokesman Gabriel Sakellaridis says Athens is confident it can clinch a deal with international creditors which can be approved by the country's parliament. \n0519 - The head of the Greek bank association, Louka Katselii, says Greek banks have enough liquidity in cash machines to serve the public until Monday. \n0042 - Japanese Prime Minister Shinzo Abe says he will work with Group of Seven countries and other Asian countries to ensure economic and finance market stability as the euro zone grapples with Greece's debt crisis. \n2044 - Some large Greek banks may have to be shut and taken over by stronger rivals as part of a restructuring of the sector that would follow any bailout of the country, European officials tell Reuters. \n1908 - IMF chief Christine Lagarde reiterates that Greece's massive debt will need restructuring, something Germany is resisting. \"Greece is in a situation of acute crisis, which needs to be addressed seriously and promptly,\" she tells the Brookings Institution think-tank in Washington. \n1903 - Greek banks will remain closed for the rest of the week and a 60-euro per day ATM withdrawal limit will remain in force, Greek state television reported. \n1841 - Greece's government will be encouraged to deliver a \"precise plan\" for its finances to inspire confidence among euro zone currency partners, says French President Francois Hollande \n1800 - Fed officials need more signs of strengthening U.S. economy before raising interest rates, according to minutes of June Fed meeting, cite Greece's debt crisis as serious concern \n1610 - The European Stability Mechanism asks EU experts and the IMF to review Greece's request for a loan \n1607 - Luxembourg Finance Minister Pierre Gramegna tells parliament that euro zone finance ministers would ask the European Commission and European Central Bank to review Greece's bailout request \n1553 - European Central Bank policy setters keep the level of emergency assistance to Greek banks steady, a person familiar with the matter says \n1436 - French Prime Minister Manuel Valls says basics of a Greek deal have been laid out, a deal is within grasp \n1334 - Reuters polling shows for first time economists saying Greece's exit from euro zone is more likely than not \n1323- U.S. Treasury Secretary Jack Lew says Greek meltdown would be geopolitical mistake \n1214- Greece will issue a ministerial decree later on Wednesday to extend a bank holiday that has already lasted for eight working days, a government official says \n1210 - Spanish Prime Minister Mariano Rajoy says the mood music coming from Greece concerning its debt negotiations is more positive than before \n1204- Russian Economy Minister Alexei Ulyukayev says financial aid for Greece is not a subject for the BRICS summit \n1147 - German finance ministry spokesman rejects measures that reduce the current value of Greek debt such as debt reprofiling \n1139 - European Banking Authority says remains vigilant but markets coping well so far with Greek uncertainty \n1130 - Greece proposes to implement as early as next week tax and pension reform measures, letter shows \n1125 - Greece requested a three-year loan from the European Stability Mechanism bailout fund but didn't specify volume of financing sought, a euro zone source tells Reuters \n1125 - European Council President Donald Tusk says without unity on Greece we will in four days wake up in a different Europe \n1122 - If Greece and its creditors don't agree by Sunday to start talks on third bailout, it will be necessary to think about other options, a spokesman for the German finance ministry says \n1117 - Greek Prime Minister Alexis Tsipras tells EU Parliament he will come up with very specific proposals on Thursday \n1015 - Technical experts will review Greece's request for an ESM loan on Wednesday but there will be no conference call among euro zone ministers, a spokesman says \n0956 - Russia is not in a position to help solve the Greek debt crisis, and the EU should resolve it on its on, the chief executive of Russia's second largest bank VTB says \n0947 - Greece lodges formal request for bailout loan with the euro zone's special support fund, a spokesman for the European Stability Mechanism says \n0920 - European Central Bank Governing Council member Ewald Nowotny says hard to imagine that ECB council could increase emergency liquidity for Greece \n0904 - Bank of Italy and ECB member Ignazio Visco says ECB will do what it can to contain financial and economic consequences of Greek crisis. \n0903 - Greece successfully rolls over T-bills to refinance a maturing six-month issue \n0820 - Greek Prime Minister Alexis Tsipras tells European Parliament says will present details proposal to EU in next 2-3 days. \n0812 - Greek Prime Minister Alexis Tsipras tells European Parliament the referendum gave him a mandate to find a socially just and economically sustainable solution to end the crisis. \n0747 - EU Economics Commissioner Pierre Moscovici tells BBC radio an agreement between Greece and its euro zone partners is still possible. \nJULY 7 \n2347 - Euro zone members give Greece until the end of the week to come up with a proposal for sweeping reforms in return for loans \n2135 - Merkel says she hopes to have sufficient reform proposals from Greece this week to be able to ask the German parliament to approve negotiations on a new long-term aid programme for Athens. If the reform list was adequate and Greece took some prior actions to enact first measures, she says she is sure that short-term finance can be provided to help Athens over its immediate funding needs. \n2030 - Austria's finance minister says Greece's request for financial aid from the European Stability Mechanism (ESM) is so far very vague. \n2020 - Summit over; Italian Prime Minister Matteo Renzi says a final meeting on Greece, involving all 28 EU leaders, will take place on Sunday. \n1932 - Greek banks could start to run out of cash over the next two days if creditors do not agree to a new aid deal, two sources familiar with the country's financial system say. \n1753 - Euro zone leaders could hold a further emergency summit on Sunday to approve a plan to aid Greece if creditor institutions are satisfied with a Greek loan application and reform plan, two senior EU sources say. \n1715 - A Greek government official says Greece is asking its euro zone partners for an interim solution to its funding needs that would cover the rest of July while a long-term deal is sought. \n1714 - Irish finance minister says the main elements of an agreement on Greece need to be in place by next Monday, and that the general impression is that a reprofiling of Greek debt would be acceptable. \n1704 - White House says Obama has spoken to Tsipras and Merkel. \n1645 - Prominent economists have called on German Chancellor Angela Merkel in an open letter to change her policy course and stop \"force-feeding\" the Greek people \"never-ending austerity\". \n1632 - German bond yields fall by as much as 15 basis points to their lowest in nearly five weeks amid a rout in commodity markets and mounting doubts about Greece's future in the euro. Greek fears drive the biggest UK bond rally in over three years. \n1618 - Italian Prime Minister Matteo Renzi says a deal with Greece can be found in the coming hours. \n1554 - A Greek government official says proposals Athens made to creditors last week to unlock bailout funds still stand, although some improvements have been made. \n1536 - French President Francois Hollande says immediate aid is available for Greece, but the onus is on Athens to make proposals. \"Greece must make serious, credible proposals. We are waiting for them and they have already been announced. They must be fleshed out now. That's the issue for tonight.\" \n1521 - A Greek government official says PM Tsipras spoke to U.S. President Barack Obama on Tuesday and briefed him on Greece's request for a rescue loan from its euro zone partners. \n1513 - German Chancellor Angela Merkel says Greece must commit to reforms to secure new loans, and stresses that only days are left to secure a deal. \"Without solidarity and reforms it's not possible to go where we want to go,\" she says. \"It's not a matter of weeks but of a few days. We will see what the Greek prime minister will tell us.\" \n1505 - Dutch PM Rutte says if Greece doesn't come up with a proposal soon, euro zone leaders won't be able to help. \n(Compiled by Gareth Jones)", "external_links": [], "published": "2015-07-09T19:47:00.000+03:00", "crawled": "2015-07-09T20:11:26.000+03:00", "highlightTitle": ""}