{"organizations": [], "uuid": "75dd368ce5ab5dc6adc41263065d83c6ccc8b843", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507231172.html", "country": "US", "title": "Egypt: Ferryboat Sinks in Egypt's Nile, Passengers Drown - Official", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Egypt: Ferryboat Sinks in Egypt's Nile, Passengers Drown - Official", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T13:49:00.000+03:00", "replies_count": 0, "uuid": "75dd368ce5ab5dc6adc41263065d83c6ccc8b843"}, "author": "", "url": "http://allafrica.com/stories/201507231172.html", "ord_in_thread": 0, "title": "Egypt: Ferryboat Sinks in Egypt's Nile, Passengers Drown - Official", "locations": ["Egypt", "Cairo", "Giza"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cairo — A ferryboat sunk in the Nile river in Giza, Cairo's twin city on Wednesday leaving passengers dead and injured, the director of Giza investigations said. \nThe number of casualties is yet to be determined, the director, Magdi Abdelaal told Aswat Masriya. \nPolice had earlier received reports that a ferryboat carrying 20 people sunk. \nA Giza health official said a state of emergency has been declared in hospitals in Giza, in case the number of casualties is high. \nIn March, a private company bus carrying workers fell off the ring road and into a canal branching from the Nile river, leaving a dozen dead. Egypt \nMuhammadu Buhari says he's going to get Nigeria's stolen oil billions back. The South African opposition were not … see more » Copyright © 2015 Aswat Masriya. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-23T13:49:00.000+03:00", "crawled": "2015-07-23T14:42:36.005+03:00", "highlightTitle": ""}