{"organizations": [], "uuid": "f49bd65fbb13975d74265032264938f168d6a4f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=13365_626.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/ffiec-tool-helps-you-assess-cyber-risk-31958/", "country": "US", "title": "FFIEC Tool Helps You Assess Cyber Risk", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "FFIEC Tool Helps You Assess Cyber Risk", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:39:00.000+03:00", "replies_count": 0, "uuid": "f49bd65fbb13975d74265032264938f168d6a4f2"}, "author": "Ballard Spahr LLP", "url": "http://www.jdsupra.com/legalnews/ffiec-tool-helps-you-assess-cyber-risk-31958/", "ord_in_thread": 0, "title": "FFIEC Tool Helps You Assess Cyber Risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FFIEC Tool Helps You Assess Cyber Risk more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=15b47d4e-3d37-4f9a-8cbc-e1c5a0874020\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nThe Federal Financial Institutions Examination Council (FFIEC) has released its long-awaited Cybersecurity Assessment Tool (Assessment) to help financial institutions identify the inherent risks faced by a company and determine the level of maturity of a company’s cybersecurity preparedness. The tool is the latest resource developed by the FFIEC to raise awareness among financial institutions and their critical third-party service providers regarding cybersecurity risks in light of the ever-growing volume and sophistication of cyber threats. \nAlthough use of the Assessment is optional, the FFIEC believes the tool can “help management and directors of financial institutions understand supervisory expectations, increase awareness of cybersecurity risks, and assess and mitigate the risks facing their institutions.” The federal Office of the Comptroller of the Currency (OCC) has also announced it will incorporate the Assessment into its examinations of financial institutions subject to its jurisdiction in late 2015. \nThe Assessment and related materials are noteworthy for a number of reasons. First, the FFIEC materials include cybersecurity guidance addressed specifically to CEOs and Boards of Directors. Second, the Assessment provides a ready-to-use risk assessment framework, including risk areas, relevant control activities, definitions, and ratings scales, which can be easily executed by companies. Third, companies that already have an information security risk assessment framework can review their current methodology against the Assessment as a way of gauging the adequacy of that methodology. Fourth, the Assessment builds on and references all of the existing FFIEC guidance on cybersecurity-related control activities, which makes it easier to understand bank regulators’ expectations. Finally, the FFIEC has mapped the Assessment to the National Institute of Standards and Technology (NIST) Cybersecurity Framework as well as the FFIEC IT Examination Handbook. \nThe Assessment consists of two parts: (1) Inherent Risk Profile and (2) Cybersecurity Maturity. Part I identifies risks in the following five categories to determine a financial institution’s Inherent Risk Profile: Technologies and Connection Types Online/Mobile Products and Technology Services Organizational Characteristics External Threats \nThe risk levels (ranging from Least Inherent Risk to Most Inherent Risk) provide insight into the type, volume, and complexity of the inherent risks identified in each category. \nPart II of the Assessment determines the financial institution’s Cybersecurity Maturity levels across each of the following five domains: Cyber Risk Management and Oversight Threat Intelligence and Collaboration External Dependency Management Cyber Incident Management and Resilience \nThe risk levels (ranging from “Baseline” to “Innovative”) provide financial institutions with a measurement of the controls available to manage the inherent risks identified in Part I. \nAccording to the FFIEC, “The Assessment provides a repeatable and measurable process for financial institutions to measure their cybersecurity preparedness over time.” The FFIEC believes that financial institutions can interpret and analyze the results of the Assessment to guide decisions about reducing inherent risk or developing a strategy to improve maturity levels. The FFIEC has also identified the following benefits to financial institutions that choose to use the Assessment: Identifying factors contributing to and determining the institutions’ overall cyber risk; Assessing the institution’s cybersecurity preparedness; Evaluating whether the institution’s cybersecurity preparedness is aligned with its risks; Determining risk management practices and controls that could be enhanced and actions that could be taken to achieve the institution’s desired state of cyber preparedness; and Informing risk management strategies.", "external_links": [], "published": "2015-07-10T03:39:00.000+03:00", "crawled": "2015-07-10T04:41:52.000+03:00", "highlightTitle": ""}