{"organizations": [], "uuid": "b813260a0e6673b34c73db783c0d43ff37f125a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-BY167_bank_o_MG_20140402171131.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/bank-of-america-intel-netflix-earnings-in-focus-2015-07-15", "country": "US", "title": "Bank of America rises on profits; Delta soars on earnings beat", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "Bank of America rises on profits; Delta soars on earnings beat - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 1, "uuid": "f86b7c1ec72462b914035ed1a432b10d925bb973"}, "author": "By     Sue Chang", "url": "http://www.marketwatch.com/story/bank-of-america-intel-netflix-earnings-in-focus-2015-07-15#post-0", "ord_in_thread": 0, "title": "Bank of America rises on profits; Delta soars on earnings beat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AFP/Getty Images Bank of America is on tap to report quarterly earnings. These are the shares likely to make notable moves in Wednesday trade:\nGainers Bank of America Corp. BAC, +0.65% rising 2.4% premarket after second-quarter earnings topped expectations .\nBlackRock Inc. BLK, -0.44% also reported earnings ahead of forecasts , sending the shares 0.1% higher ahead of the bell.\nDelta Air Lines Inc. DAL, +0.67% surged in premarket trade Wednesday after the air carrier posted second-quarter results that were better than Street estimates. Excluding nonrecurring items, earnings per share came in at $1.27, beating the FactSet consensus of $1.21. Revenue increased 1% to $10.71 billion, above the FactSet consensus of $10.65 billion.\nTickers to Watch Bank of America BAC, +0.65% is projected to report second-quarter earnings of 36 cents a share, according to a consensus survey by FactSet. The financial firm reported earnings of 19 cents a share a year ago. The bank is among the stocks that Morgan Stanley is upbeat on ahead of its earnings report.\nIntel INTC, -0.27% is forecast to post second-quarter earnings of 50 cents a share, down from 55 cents a share a year ago.\nA day after its 7-for-1 stock split, Netflix NFLX, -0.71% is expected to post second-quarter earnings of 28 cents a share versus $1.15 a share a year earlier.\nU.S. Bancorp USB, +0.11% is projected to post second-quarter earnings of 80 cents a share, up from 78 cents a share a year earlier.\nBlackRock Inc. BLK, -0.44% is expected to report second-quarter earnings of $4.80 a share, down from $4.89 a share a year earlier.\nAfter Tuesday’s close, Yum Brands Inc. YUM, +0.97% reported second-quarter adjusted earnings of 69 cents a share on sales of $3.1 billion. Analysts had expected the parent company of Pizza Hut, KFC and Taco Bell to earn 63 cents a share on sales of $3.2 billion. Worldwide sales rose 3%, the company said.\nCelgene Corp. CELG, +1.62% plans to buy Receptos Inc. RCPT, +5.11% for $7.2 billion as part of its effort to diversify its revenue source. Celgene also raised its 2015 earnings-per-share outlook to between $4.75 and $4.85 from a previous range of $4.60 to $4.75.\nMead Johnson Nutrition Co. MJN, -1.63% lowered its earnings outlook on slowing sales growth in China and other emerging markets. The baby-formula company now sees adjusted full-year earnings of $3.63 to $3.78 a share, down from its previous estimate of $3.90 to $4 a share.\nRailroad company CSX Corp. CSX, +0.53% said its second-quarter profit rose to $533 million, or 56 cents a share, from $529 million, or 53 cents a share, a year ago. Revenue fell 6% to $3.06 billion, in part due to a 1% drop in freight volume. Operating income at the Dow Jones Transportation Average DJT, -0.07% component rose to $1.02 billion from $997 million a year ago.\nAllegheny Technologies Inc. ATI, -2.05% said it expects to post a second-quarter loss of $16 million to $18 million, or 15 to 17 cents a share. Analysts had expected a profit of 21 cents a share, according to FactSet. Allegheny cited weak demand from energy markets and increased competition in its flat-rolled products segment.\nAfter Wednesday’s close Intel INTC, -0.27% is forecast to post second-quarter earnings of 50 cents a share, down from 55 cents a share a year ago.\nRead: What to watch for in Intel’s earnings\nA day after its 7-for-1 stock split, Netflix NFLX, -0.71% is expected to post second-quarter earnings of 28 cents a share versus $1.15 a share a year earlier.\nRead: What to look for in Netflix’s earnings\nMore from MarketWatch", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-15T15:17:20.000+03:00", "highlightTitle": ""}