{"organizations": [], "uuid": "adfd111c86f28511628c1c25c247c784397c254b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/ftb-targets-406-sacramento-businesses?cid=rss", "country": "US", "title": "FTB targets 406 Sacramento businesses", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "FTB targets 406 Sacramento businesses", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T02:28:00.000+03:00", "replies_count": 0, "uuid": "adfd111c86f28511628c1c25c247c784397c254b"}, "author": "Christian Montgomery, Sacramento Tax Tips Examiner", "url": "http://www.examiner.com/article/ftb-targets-406-sacramento-businesses?cid=rss", "ord_in_thread": 0, "title": "FTB targets 406 Sacramento businesses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FTB targets 406 Sacramento businesses Use your key for the next article Comment \nCalifornia’s Franchise Tax Board (FTB) is targeting 406 Sacramento businesses that it believes failed to file a 2013 income tax return . This is the first step the state taxing agency needs to take to force a tax assessment against a business and begin tax enforcement procedures. This procedure was very successful for the FTB last fiscal year allowing it to collect approximately $36 million from businesses that initially failed to file their tax returns. \nYou may remember earlier this year, the Franchise Tax Board publicized that it was targeting 11,447 people living in Sacramento and 21,084 people in all of Sacramento County for failing to file their 2013 California state personal income tax return with the FTB. Now, it’s time for businesses that are delinquent with their tax filings to comply with their tax obligations, or pay the consequences. \nThe allegedly delinquent Sacramento businesses make up approximately 58% of the Sacramento County businesses that the FTB is investigating this time around. The Franchise Tax Board reviews income records received from the Internal Revenue Service, the State Employment Development Department, the State Board of Equalization, financial institutions, and other businesses. The FTB then matches this financial information against its tax records to identify potential noncompliant businesses. \nThe FTB will first notify the Sacramento businesses that it is investigating them by letter. Their initial correspondence only allows the business 30 days to file a tax return or prove why one is not required. Businesses that fail to respond to the Franchise Tax Board’s initial letter will generally be subject to a forced tax assessment based on income and other information reported to the FTB. The FTB is known to get very creative in how it uses “other information” to prepare a forced tax assessment. The forced tax assessment includes interest, fees, and penalties and allows the Franchise Tax Board to then take steps towards enforcing collection of the FTB tax debt against the business entity. \nUnfortunately, the Sacramento businesses that were defunct or never operated in 2013, and did not have a tax filing requirement usually have the most work to do to prove that they truly didn’t have a filing requirement. They also likely lack the resources or records to effectively fight the FTB, assuming that they even receive the Franchise Tax Board’s initial letter alleging that they failed to file a tax return. So if you own one of the 406 Sacramento businesses targeted by the FTB this year, be sure to promptly respond to prevent the FTB from getting creative and preparing a forced tax assessment against your Sacramento business. \nThis article is not intended as legal advice, and cannot be relied upon for any purpose without the services of a qualified professional.", "external_links": [], "published": "2015-07-29T02:28:00.000+03:00", "crawled": "2015-07-29T05:06:43.688+03:00", "highlightTitle": ""}