{"organizations": [], "uuid": "b02cd18dd6670c77e0086acd6882d087554315b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/31/markets-stocks-usa-idUSL3N10B4SM20150731", "country": "US", "title": "US STOCKS-Futures slip amid lukewarm earnings, fall in commodities", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "US STOCKS-Futures slip amid lukewarm earnings, fall in commodities | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T15:36:00.000+03:00", "replies_count": 0, "uuid": "b02cd18dd6670c77e0086acd6882d087554315b8"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/31/markets-stocks-usa-idUSL3N10B4SM20150731", "ord_in_thread": 0, "title": "US STOCKS-Futures slip amid lukewarm earnings, fall in commodities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Futures down: Dow 28 pts, S&P 4 pts, Nasdaq 9 pts\nBy Tanya Agrawal\nJuly 31 (Reuters) - U.S. stock index futures fell slightly on Friday following a spate of uninspiring corporate results and a drop in prices of crude oil and major industrial metals.\n* Oil prices fell after OPEC indicated there would be no output cuts despite a huge global oversupply, while copper was lower on lingering worries about demand in top consumer China.\n* A sharp selloff in Chinese shares over the past weeks has stoked concerns about a slowdown in growth in the world's second-biggest economy.\n* Wall Street ended flat on Thursday as investors digested ho-hum corporate earnings and new data showed that economic growth accelerated in the second quarter, bolstering a case for a rate hike in September.\n* Exxon Mobil, Royal Caribbean and Chevron are scheduled to report before the opening bell.\n* With more than half of the S&P 500 companies having reported quarterly results, analysts expect overall earnings to edge up 1 percent and revenue to decline 3.6 percent, according to Thomson Reuters data.\n* Valuations remain a concern. The S&P 500 is trading near 16.8 times forward 12-month earnings, above the 10-year median of 14.7 times, according to StarMine data.\n* Data expected on Friday includes the University of Michigan's final July reading on the overall index on consumer sentiment at 10 a.m. ET (1400 GMT), which is estimated to come in at 94.0, a bit higher from a preliminary reading of 93.3.\n* LinkedIn shares fell 6.3 percent to $212.83 in premarket trading after the operator of the biggest social networking site for professionals reported a bigger net loss.\n* FireEye fell 5 percent to $45.35 after the cybersecurity company reported its slowest quarterly revenue growth since going public in 2013, and said its Chief Financial Officer will step down.\n* Expedia rose 8.3 percent to $116.55 after the company posted a second-quarter profit above analysts' expectations and announced a larger dividend.\n* Electronic Arts was down 1.9 percent at $70.90 after the video game publisher's forecast fell short of estimates.\nFutures snapshot at 7:18 a.m. ET:\n* S&P 500 e-minis were down 4.25 points, or 0.2 percent, with 80,608 contracts traded.\n* Nasdaq 100 e-minis were down 8.5 points, or 0.18 percent, on volume of 12,198 contracts.\n* Dow e-minis were down 28 points, or 0.16 percent, with 9,667 contracts changing hands. (Editing by Don Sebastian)", "external_links": [], "published": "2015-07-31T15:36:00.000+03:00", "crawled": "2015-07-31T14:45:25.510+03:00", "highlightTitle": ""}