{"organizations": [], "uuid": "2c9d5ab01084de1aaafb983cc10587c7c9a95a63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/071615_ez_pass_600.jpg", "site_section": "http://www.philly.com/philly/business/personal_finance", "section_title": "Personal Finance, Money and Investing Advice at Philly.com ", "url": "http://www.philly.com/philly/business/transportation/20150717_New_E-ZPass-only_Pa__turnpike_ramps_hit_thousands_with__64_bill.html", "country": "US", "title": "New E-ZPass-only Pa. turnpike ramps hit thousands with $64 bill", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "New E-ZPass-only Pa. turnpike ramps hit thousands with $64 bill", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "2c9d5ab01084de1aaafb983cc10587c7c9a95a63"}, "author": "Paul Nussbaum", "url": "http://www.philly.com/philly/business/transportation/20150717_New_E-ZPass-only_Pa__turnpike_ramps_hit_thousands_with__64_bill.html", "ord_in_thread": 0, "title": "New E-ZPass-only Pa. turnpike ramps hit thousands with $64 bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thousands of motorists are getting an expensive lesson in reading from the Pennsylvania Turnpike Commission.\nAt a newly installed E-ZPass-only interchange on the turnpike's Northeast Extension in Carbon County, 4,537 motorists used the ramps without an E-ZPass between June 30 and July 13, ignoring large green-and-purple-and-yellow signs proclaiming \"E-ZPass Tagholders Only.\"\nNow, each of them can expect to receive a bill of $64.75 in the mail.\nThat includes a $25 administrative fee, plus a $39.75 toll based on the most-distant exit on the turnpike: the Ohio border, 400 miles away.\nMore coverage DRPA approves commuter toll discount Neshaminy Falls toll plaza opens in Jan. Byko: Philly's War on Motorists continues (For a driver with E-ZPass, the cheapest toll at the new ramp would be $1.07.)\nFor the turnpike commission, the non-E-ZPass penalties from the new interchange add up to about $300,000 for the first two weeks.\nSimilar bills have been racked up at E-ZPass-only ramps in Bucks, Chester and Montgomery counties, and drivers' most popular excuse is: My GPS made me do it.\n\"The biggest problem is that people are following their GPSes more,\" turnpike spokesman William Capone said. \"The GPS tells them to get off at that exit, and they do.\n\"The numbers are growing, with more E-ZPass-only entry points,\" he said.\nThe newest E-ZPass-only ramp, which opened June 30, is the fourth such \"slip ramp\" on the turnpike. Other unstaffed, E-ZPass-only ramps were installed in 2000 at Virginia Drive (Mongtomery County), 2010 at Street Road (Bucks County), and 2012 at State Route 29 (Chester County).\nThe Turnpike Commission built the slip ramps as mini-exits: cheap and easy ways for motorists to get on and off the turnpike. But they're only for the 75 percent of turnpike motorists who have an E-ZPass to pay the toll.\nTo punish drivers who intentionally or unintentionally use the ramps without paying electronically, the Turnpike imposes stiff penalties, based on a license-plate photo of the offending vehicle: A toll based on the farthest entry point, the Ohio border. A $25 administrative fee, which rises to $40 if you don't pay up within 30 days. Referral to collection agencies.\nApparently, motorists eventually catch on.\nAbout 11 percent of the drivers who used the new slip ramp in Carbon County at State Route 903 did not have E-ZPasses.\nThat compares to fewer than 5 percent of the motorists who used the older slip ramp at State Route 29 during the same period.\n\"It does tend to decrease over time as things balance out and people learn what E-ZPass is,\" turnpike spokesman Carl DeFebo said.\nDeFebo said motorists can appeal their penalties. If they have an turnpike entry ticket or a receipt from a business that shows where they got on the turnpike, the toll will be reduced to reflect that, he said.\nThe phone number to call for appeals is 877-736-6727.\npnussbaum@phillynews.com\n215-854-4587\n@nussbaumpaul", "external_links": [], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-17T01:05:49.000+03:00", "highlightTitle": ""}