{"organizations": [], "uuid": "6d6a0d030214379a66ddc37ee6fd93b988ee6532", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DQ206_Greece_ZG_20150716061347.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/greeces-anti-austerity-riot-in-pictures-2015-07-16", "country": "US", "title": "Greece’s anti-austerity riot in pictures", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "Greece’s anti-austerity riot in pictures - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 1, "uuid": "e5d6b9b8b15f163d2c63097b1e67fb8606d7ed92"}, "author": "By     Sara Sjolin", "url": "http://www.marketwatch.com/story/greeces-anti-austerity-riot-in-pictures-2015-07-16#post-0", "ord_in_thread": 0, "title": "Greece’s anti-austerity riot in pictures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reuters/Yannis Behrakis Slide 1 of 7 It was a tale of two dramas in Athens last night, as Greece moved a step closer to securing its third bailout program.\nIn an action-packed debate in the Greek parliament Wednesday, Prime Minister Alexis Tsipras fought to win enough backing for a tough reform program demanded by the eurozone in exchange for bailout aid. At the same time, angry protesters took to the streets of Athens against the anti-austerity measures.\nWhat started as a peaceful demonstration on Syntagma Square outside Greece’s parliament suddenly turned violent in the evening . Rioters threw petrol bombs and rocks at police, smashed office windows, and set trash cans and at least one car on fire, according to media reports. The police responded by throwing tear gas into the 12,000-strong crowd.\nSyntagma Square: striking to see the police forces nominally controlled by the Syriza government teargassing the Syriza activist base.\n— Aditya Chakrabortty (@chakrabortty) July 15, 2015 Read on to scenes from Athens as the anti-austerity riot raged.\nReuters/Yannis Behrakis Slide 2 of 7 As night fell in Athens on Wednesday, the protest in front of parliament took a dark turn. Police tried to disperse protesters, sending hundreds of people fleeing in central Syntagma Square.\nReuters/Yannis Behrakis Slide 3 of 7 Masked anti-establishment protesters threw about a dozen petrol bombs at police in front of Greece’s parliament, while chanting angrily. “We have been betrayed,” shouted one demonstrator, according to AFP.\nReuters/Yannis Behrakis Slide 4 of 7 A protester is arrested by riot police after the clashes. About 50 people in total were detained by the authorities, in what has been described as the most serious violence in Greece in more than two years.\nReuters/Yannis Behrakis Slide 5 of 7 A demonstrator bleeding after police responded to the unrest. About four officers and two photographers were injured by flying debris , according to AFP.\nReuters/Jean-Paul Pelissier Slide 6 of 7 Riot police tried to put out fires caused by petrol bombs, which were thrown by a small group of anti-austerity protesters.\nReuters/Yiannis Kourtoglou Slide 7 of 7 Prev Page 1 2 3 4 5 6 7 Next Page You Might Like", "external_links": ["https://twitter.com/chakrabortty/status/621385979463630849", "http://www.afp.com/en/news/we-have-been-betrayed-protest-turns-violent-greece-votes"], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T15:53:04.000+03:00", "highlightTitle": ""}