{"organizations": [], "uuid": "44db8805af0313ade0e6b644442be3d7e096e0b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/z/q/u/b/6/image.related.afrArticleLead.620x365.gi79z7.png/1436317613750.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/policy/tax/how-to-make-people-read-their-superannuation-statements-20150708-gi79z7", "country": "AU", "title": "How to make people read their superannuation statements", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How to make people read their superannuation statements | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T07:51:00.000+03:00", "replies_count": 0, "uuid": "44db8805af0313ade0e6b644442be3d7e096e0b4"}, "author": "Joanna Mather", "url": "http://www.afr.com/news/policy/tax/how-to-make-people-read-their-superannuation-statements-20150708-gi79z7", "ord_in_thread": 0, "title": "How to make people read their superannuation statements", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "John Piggott says super funds should tell account holders how much they will have to live on in retirement. Supplied Share on twitter by Joanna Mather Your superannuation fund should tell you what your income will be in retirement based on your savings now, a simple measure that would force people to focus on their super, an expert says.\nProfessor John Piggott, who heads the ARC Centre of Excellence in Population Ageing Research at the University of NSW, said the simple measure would help shift household perceptions of what super is for.\nThat is, to provide an income in retirement rather than to accumulate wealth.\n\"Everything is cast as asset accumulation,\" he told the Australian Financial Review .\n\"But actually what it should be telling you is if you work until 60 at this wage and making this contribution you might expect to have an income of $32,000 in retirement.\n\"There is a whole kind of framing transition that has to happen away from thinking of super as an asset to thinking about it as an income stream.\"\nProfessor Piggott was part of The Future Tax System review established by the Rudd government in 2008 to examine the tax and transfer system, excluding GST.\nThe report recommended taxing super contributions by employers at marginal tax rates and then providing a refundable tax offset, along with a halving of fund earnings to 7.5 per cent.\n The recent Financial System Inquiry, led by David Murray, recommended that the objectives of the super system be enshrined in legislation. The government has yet to provide a response.\nIt is developing a tax white paper that will consider super and retirement incomes, although Prime Minister Tony Abbott has ruled out any changes to the taxation of super.", "external_links": ["https://twitter.com/https://twitter.com/JoannaMather"], "published": "2015-07-08T07:51:00.000+03:00", "crawled": "2015-07-08T04:08:25.000+03:00", "highlightTitle": ""}