{"organizations": ["PwC", "Reserve Bank of India", "India Inc", "SBI", "ICRA", "State Bank of India"], "uuid": "784a04f03a5d5cdaf6fa30fd915934e261b5624e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48061705,width-600,resizemode-4/power-sector-can-take-npas-to-alarming-levels-sbi-chairperson-arundhati-bhattacharya.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358259.cms", "section_title": "Banking/Finance-Industry-The Economic Times", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/power-sector-can-take-npas-to-alarming-levels-sbi-chairperson-arundhati-bhattacharya/articleshow/48061693.cms", "country": "IL", "title": "Power sector can take NPAs to alarming levels: SBI chairperson Arundhati Bhattacharya", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Power sector can take NPAs to alarming levels: SBI chairperson Arundhati Bhattacharya", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T23:23:00.000+03:00", "replies_count": 0, "uuid": "784a04f03a5d5cdaf6fa30fd915934e261b5624e"}, "author": "", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/power-sector-can-take-npas-to-alarming-levels-sbi-chairperson-arundhati-bhattacharya/articleshow/48061693.cms", "ord_in_thread": 0, "title": "Power sector can take NPAs to alarming levels: SBI chairperson Arundhati Bhattacharya", "locations": ["Greece", "NEW DELHI", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pradeep Kumar Pujari", "Arundhati Bhattacharya", "Rao", "Kameswara Rao", "Girish Kadam", "Modi", "Karthik Srinivasan", "Bhattacharya"], "text": "ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! NEW DELHI: State Bank of India, the country's largest lender, has red-flagged the power sector as a fast-ticking time bomb that could escalate the banking system's non-performing assets (NPAs) to an alarming level over the next couple of months and erode confidence in banks. With the sector accounting for the highest chunk of gross bank credit among industries, State Bank of India chairperson Arundhati Bhattacharya conveyed banks' anxiety to the government in separate interactions with top officials from the ministries of finance and power over the last week. The sector's woes were also discussed at meetings held by the Prime Minister's office on stalled investments in the past week. State electricity boards and discoms had accumulated losses of over Rs 3 lakh crore by March 2014 and owe over Rs 2 lakh crore to banks. The Reserve Bank of India said in late June that Rs 53,000 crore of loans to seven state electricity boards are highly likely to turn into NPAs this month after several rounds of restructuring and a three year moratorium on principal repayment. \"The SBI chairperson has conveyed that an urgent intervention is needed from the Centre and the states in the next few months to pre-empt a surge in banks' bad loans that could severely dent confidence in some public sector banks,\" said a government official aware of Bhattacharya's meetings with top officials, including power secretary Pradeep Kumar Pujari , last week. State Bank of India did not respond to a detailed questionnaire on the issue sent last Thursday by ET. Officials in the know said that financially stressed state discoms are pulling back their demand for electricity, pushing power plants to low utilisation rates and threatening to render generation capacities worth lakhs of crores unviable. \"The fiscal malaise at state power utilities is now infecting the generation sector too. While the plant load factor for India's thermal power sector was 65% last year, it further slipped to 59 per cent by June 2015,\" said a senior government official. Experts say such low utilisation rates were last seen in the early 1990s and indicate that things are getting worse. Touted as a success story of the Modi government's first year in office with a record generation of a trillion units of power in 2014-15, the electricity sector is turning into a 'problem child' that needs immediate attention, they said, adding that the Centre alone can do little to fix the mess. Gas- and coal-fired thermal power generation, that accounts for 85 per cent of India's power capacity, dipped 1.3 per cent in April 2015, rose by 4.6 per cent in May, only to slip by another 0.5 per cent in June 2015, compared to the same months a year ago. As of May 29 this year, gross bank credit to the power sector stood atRs 5,67,400 crore (over $90 billion), as per RBI data. This constitutes over 21 per cent of Indian banks' cumulative exposure to India Inc and 9 per cent of total advances. For the banking system, the challenge is somewhat like that playing out in Greece, namely, the debt is not sustainable at the state utilities' current tariffs and efficiency levels, and lenders have to take the hit sooner or later,\" said Kameswara Rao, leader, energy, utilities and mining at consulting firm PwC, adding there is continued reluctance among policy makers to admitting that this problem needs a radical cure. The repercussions on the generation sector in terms of delayed payments, and the economy as a whole would rapidly get worse unless the current day-today losses are dealt with head-on, Rao said. \"The central government must reformulate tariff policy to mandatorily pass-through inflation and fuel costs into tariffs on a timely basis, and state governments should drive efficiency improvement by giving out at least 30-40 per cent distribution areas to private players on franchise basis,\" he said. Karthik Srinivasan, co-head of financial sector ratings at ICRA, said that public sector banks are already sitting on Rs 2.75 lakh crore of bad loans and have much higher exposure to the stressed power and metals sectors than their private peers, so they are bound to be anxious. \"Given the challenges in the power sector, not just state electricity boards but even a few large corporate exposures are not in the best of health. We expect NPAs to shoot up sharply if there is no change in the status quo over the next few months,\" he said. Though new generation capacities are being commissioned over the past year and more capacity is in the pipeline, albeit with significant cost and time over-runs, low offtake of power by state utilities is making it difficult for these investments to break even. \"Cost over-runs on the generation side have hit debt servicing and promoters are unable to bring in fresh equity. Load-shedding is still happening as state utilities look to limit losses, so the real power deficit in the country is likely at 15 per cent-17 per cent as opposed to the reported level of 3 per cent-4 per cent,\" said Girish Kadam, vice president for corporate sector ratings at ICRA.  ", "external_links": [], "published": "2015-07-13T23:23:00.000+03:00", "crawled": "2015-07-14T01:46:23.000+03:00", "highlightTitle": ""}