{"organizations": [], "uuid": "52077d717391565277b34c03c6b5d9f054f0b3a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-BX152_pfstea_MG_20140320175402.jpg", "site_section": "http://feeds.marketwatch.com/marketwatch/pf/", "section_title": "MarketWatch.com - All MarketWatch News - Personal Finance", "url": "http://www.marketwatch.com/story/obama-administrations-crackdown-on-for-profit-colleges-goes-into-effect-2015-07-01", "country": "US", "title": "Cost of 4th of July BBQ jumps 30%", "performance_score": 0, "site": "marketwatch.com", "participants_count": 0, "title_full": "Cost of 4th of July BBQ jumps 30%", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T14:01:00.000+03:00", "replies_count": 0, "uuid": "66d37e293140039f2b00dbd9caafb64cbe045147"}, "author": "", "url": "http://www.marketwatch.com/story/bbq-sticker-shock-beef-prices-climb-44-2014-07-02", "ord_in_thread": 0, "title": "Cost of 4th of July BBQ jumps 30%", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stephen Mcsweeny"], "text": "Stephen Mcsweeny / Shutterstock.com \nThis July 4th, your backyard barbecue may take a big bite out of your budget. \nThe cost of a 10-person BBQ has jumped more than 30% in the past decade to an average of $68 this year, according to data released Wednesday by Rabo AgriFinance . Even in just the past year, prices on many items have risen: Beef is up 7.3%, lettuce 6.2%, tomatoes 6.8%, bread 4.4% and pickles 3.6%, and chips 1.3%. Even soda and beer have risen in price (0.9% and 0.4%, respectively). \nThere are a variety of factors impacting food prices. Recent hikes in beef prices are due in part to small cattle herds, which hurt supply, and consumers’ demand for more and better beef as incomes have risen. Lettuce and tomato prices were influenced by rough winter weather in some areas. \nTo be sure, some staples are decreasing in cost. The price of a chicken breast has declined 1.9% in the past year (serving this instead of beef could save you 10%), cheese has fallen 2.2% and ice cream 4.4%, according to Rabo AgriFinance. \nStill, prices overall are higher, which means that hosting a barbecue can be costly. Here are some ways to save. \nMake strategic substitutions \nButcher Ray Venezia says that those looking to save money may want to switch to another cut of meat. “Beef brisket is a popular winter holiday cut that becomes very affordable during the summer months — it is well suited for barbecues and can feed a crowd,” he says. He adds that if you want to make traditional burgers, you should purchase regular ground meat because it is cheaper than pre-made beef burgers and adds that handmade burgers can have more flavor anyway. Furthermore, boneless sirloin steak is cheaper than many other cuts, he adds; and “if you are having four or more people at the gathering, sirloin steaks are great because one steak will feed four to six people,” he says. \nIf you’re going the chicken route, he suggests boneless chicken thighs because they are more affordable than boneless breast and have more flavor. “Chicken thighs cut up and placed on skewers are easy to cook, shrink less and come out more flavorful than chicken breasts on the grill,” he says. And Lynette Rice, founder of CleverlySimple.com , says that you should look to buy bigger cuts of meat (the whole pork loin, rather than a bunch of pork chops) as this too will save you money. And, she adds, the butcher might even cut the pork loin up for you at no additional cost. \nFood blogger Jay Ducote says that consumers should forgo the pricey cooking sprays when greasing the grill and instead put canola oil in a spray bottle and grease the grill that way. \nOpt for fresh, not frozen \nAndrea Woroch, a consumer savings expert, says that sometimes you can save by opting for fresh ground beef rather than frozen burger patties. “Frozen patties may seem more economical, but many grocers will put ground beef on special just before the holiday to push sale,” she says. What’s more, “many times they will actually sell these items at near cost to get you in their store for all your holiday food purchases,” says barbecue hobbyist Daniel Vaczi. And grocers often want to get rid of meat that’s close to expiration, so for consumers planning to cook it ASAP this can be a great deal. Stephanie Nelson, founder of CouponMom.com , notes that warehouse clubs are often also a good bet for lower priced meats, and you can freeze any leftovers to have for dinner at a later date. \nSkip the grocery store \nWoroch says it’s worth taking a second trip to the dollar store for items like paper plates, napkins and plasticware, as well as things like serving platters, trays and ice buckets — as the savings can be significant. Rice says that if you need extra glassware, hit up Goodwill in your area, where these items are often $1 or less. \nConserve fuel \nEstimate how much fuel you’ll need ahead of a cookout and you can avoid some unnecessary spending, says Jon Lal, CEO and founder of BeFrugal.com . “For a charcoal grill, you only need approximately three pounds of charcoal for four to six people,” he explains. “Most charcoal is ready after heating for about 15 minutes.” If you have a gas grill, he notes that, once started, it will be ready to cook in about 10 minutes. \nGo high tech \nJessica Fisher, the author of “Good Cheap Eats, Everyday Dinners and Fantastic Feasts for $10 or Less,” says that consumers can find fantastic deals on condiments, charcoal and other seasonal items right now. That’s especially easy to do — and to compare prices — if you use your smartphone to search for grocery coupons. Woroch recommends looking for grocery coupons on CouponSherpa.com. Other good options include: Favado.com and Coupons.com. \nThis article was updated on June 30, 2015. More from MarketWatch", "external_links": [], "published": "2015-07-01T14:01:00.000+03:00", "crawled": "2015-07-01T13:06:40.000+03:00", "highlightTitle": ""}