{"organizations": [], "uuid": "155176b6e60cbb05f91de5401133cd1616c0664e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/europe-close-stocks-rebound-following-174100137.html", "country": "GB", "title": "Europe close: Stocks rebound following China selloff", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Europe close: Stocks rebound following China selloff", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T20:41:00.000+03:00", "replies_count": 0, "uuid": "155176b6e60cbb05f91de5401133cd1616c0664e"}, "author": "", "url": "https://uk.finance.yahoo.com/news/europe-close-stocks-rebound-following-174100137.html", "ord_in_thread": 0, "title": "Europe close: Stocks rebound following China selloff", "locations": ["Europe", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0.4882 -0.0118 \nLONDON (ShareCast) - (ShareCast News) - The European stock market rebounded on Tuesday from losses in the previous session prompted by the selloff in China. \"Investors are enjoying some light reprieve from the selloff, but while markets remain volatile many will remain firmly on the sidelines,\" said Mike McCudden, head of derivatives at stockbroker Interactive Investor . \"Furthermore, investor caution ahead of the Fed meeting may usher in a dead cat bounce for equities over the next few sessions.\" \"However, longer term investors will be keeping an eye on the recent increase M&A activity as a reason to pick up a few bargains. With the pharmaceutical sector still hot and today, following some heavy trading against the trend over recent sessions, it comes as no great surprise that RSA Insurance (LSE: RSA.L - news ) is being approached.\" In the euro-area, Greece remained in focus as a finance ministry official told Reuters the European Union and International Monetary Fund mission chiefs will arrive in Athens on Wednesday for talks on a third bailout programme. \nTechnical talks started on Monday and were expected to end on Friday, the official said. \nMeanwhile, trading on the Athens Stock Exchange is set to restart on Tuesday, according to various reports including ekathimerini. \nUS consumer confidence falls US consumer confidence suffered a sharp setback in July, retreating to its lowest level since September 2014. The Conference Board institute's consumer confidence gauge fell to reading of 90.9 following the previous month's downwardly revised print of 99.8. Economists had been expecting a reading of 100.0. \nUS house prices climbed 1.1% month-on-month in May, according to the Case-Shiller 20-city composite index. When considering a seasonal adjustment, prices declined 0.2%, the report added. \nThe US service sector expanded at a faster rate in July but confidence over the business outlook fell to a three-year low, data released on Tuesday showed. The Markit Flash US Services Purchasing Managers Business Index rose to 55.2 in July, rebounding slightly from the five-month low recorded in June and remained above the 50.0 threshold that signal expansion. However, the figure was lower than the 56.3 reading that represents the average for this year to date. \nThe data comes as the Federal Reserve Open Market Committee kicks off its two-day meeting, with a rate announcement due on Wednesday. No change in rates is expected until at least September but investors will be eyeing any further clues on the possible timing of a move. \n\"The Fed will surely bring the Chinese selloff and commodity rout under their consideration and will tailor their response accordingly,\" said Naeem Aslam, chief market analyst at Ava Trade . \"We do not think Yellen will fan the fire any further by bringing an exact timeline for a rate hike. In fact, there is a strong possibility that she may water down those expectations and use a very dovish approach.\" RSA rallies Shares (Berlin: DI6.BE - news ) in RSA Insurance rocketed after Zurich Insurance (Xetra: ZFI1.DE - news ) confirmed that it was considering a bid for the company. Stock in Zurich Insurance was trading down, however. \nITV (LSE: ITV.L - news ) was also on the front foot after it lifted its interim dividend by 36% and said group earnings before interest, tax, depreciation and amortisation rose 24% to £400m. \nClothing retailer Next (Other OTC: NXGPF - news ) gained after raising its sales and profit guidance for the year as warmer weather at the end of the season boosted second-quarter sales. \nOil giant BP shook off early losses to trade higher. Although the company's second-quarter profit fell short of expectations, analysts said that in many aspects, this was not surprising given the sharp drop in the oil price. In addition, they were encouraged that BP is taking steps in the right direction by cutting capital expenditure. \nElsewhere, French drugmaker Sanofi (NasdaqGM: GCVRZ - news ) advanced as it said it has entered into a research agreement with Regeneron Pharmaceuticals (NasdaqGS: REGN - news ) and will invest $2.17bn to develop new cancer treatments together. \nFrench telecom operator Orange (Taiwan OTC: 4554.TWO - news ) pushed higher after the company's sales and core earnings beat analysts' expectations. \nOn the downside, French tire maker Michelin (Paris: FR0000121261 - news ) fell sharply after its first-half operating profit came in lower than expected, while Norway's Statoil (Xetra: 675213 - news ) slipped into the red after it posted a 16% drop in second-quarter net profit. \nIn London, Royal Mail (LSE: RMG.L - news ) dropped as regulator Ofcom said it had breached competition law due to the way it dealt with door-to-door letter delivery rivals.", "external_links": [], "published": "2015-07-28T20:41:00.000+03:00", "crawled": "2015-07-28T21:00:51.861+03:00", "highlightTitle": ""}