{"organizations": [], "uuid": "d4c298f7d81bc321bcba54f11ba90f66367016d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/why-does-uk-love-eu-174510430.html", "country": "GB", "title": "Why does the UK love the EU when most of Europe seems to hate it?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why does the UK love the EU when most of Europe seems to hate it?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T20:45:00.000+03:00", "replies_count": 0, "uuid": "d4c298f7d81bc321bcba54f11ba90f66367016d5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-does-uk-love-eu-174510430.html", "ord_in_thread": 0, "title": "Why does the UK love the EU when most of Europe seems to hate it?", "locations": ["Europe", "EU", "UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 21, 2015, 18:59 BST - UK Markets closed Why does the UK love the EU when most of Europe seems to hate it? By Jeremy Warner | Telegraph – 14 minutes ago 22.99 +0.74 \nA poll by Ipsos Mori showed UK support for staying in the EU was at its highest level for 24 years \nAs a general rule of thumb, the British will only vote for Europe when they can see that things are notably better over there than they are over here. We have seen this pattern repeated time and again throughout Britain’s often rocky post-war relationship with the EU. \nIn a famous speech in 1946, Winston Churchill proposed “a kind of United (Shenzhen: 000925.SZ - news ) States of Europe” as a way of eradicating Europe’s warring past, but it was fairly obvious that he did not envisage Britain as part of it. “We are with Europe, but not of it. We are linked but not combined. We are interested and associated but not absorbed,” was how Churchill put it, a way of thinking that has defined Britain’s ambivalent attitude to Europe ever since. \nInstead, this would be primarily a Franco-German construct, with Britain pursuing an alternative destiny as part of a Commonwealth of Nations. At the time, Britain still had rationing and austerity, but as the victorious nation, it nonetheless looked in rather better shape than much of the rest of an economically ruined continent. \nThis juxtaposition was not to last long, however, and by the late 1960s, the major European nations had largely caught up with, and in some cases surpass, the victor. With the empire gone, Britain seemed to be quickly slipping into the economic wilderness. Rightly or wrongly, Europe’s relative economic success was widely attributed to the transformational powers of the Common Market. \nAnd so it was that UK citizens voted overwhelmingly for Europe when Britain finally overcame the French veto, and joined what was then the European Economic Community . \nSince then, eurosceptism as a mass movement has ebbed and flowed, largely according to the relative fortunes of Europe’s economies and their supposed vindictiveness towards the UK. When Europe is doing badly, it tends to be at its strongest. When Germany and its fellow travellers are doing well, it subsides. \nHow odd, then, that with another referendum pending and much of Europe mired in austerity and crisis, the opinion polls point to rising support for continued membership. \nBefore attempting to answer why this might be the case, I have a small confession to make. Like most others, I voted in favour of staying in the EEC back in 1975 - the last referendum - and was broadly supportive of the European project, which seemed a noble and economically enhancing endeavour. \nEven (Taiwan OTC: 6436.TWO - news ) the introduction of the euro failed break my faith, though I could readily appreciate the dangers of moving so swiftly towards this much deeper form of economic integration. The sad reality is, however, that monetary union has shattered the European ideal, reducing it to little more than a bad joke; it is hard to see how it can ever recover from the damage that the euro has inflicted on it. \nIn comments reported in The Telegraph , Anders Borg, the former finance minister of Sweden and, until quite recently, a strong supporter of the euro, warned that deeper fiscal integration - exactly the remedy prescribed by most economists - would “tear the eurozone apart”. More prosperous states in the north would not tolerate the higher taxes necessary to subsidise the south, he said, adding for good measure that it would be “decades” before countries such as Sweden and Poland could be persuaded to join, even though European treaties require it for all those without an opt out. \nHis comments are echoed in Polish opinion polls, where the nationalist Law and Justice party is surging ahead on a platform that includes complete repudiation of the euro. “We are not going to lead Poland into the euro,\" its leader, Beata Szydlo, has pledged. All over Europe, the insurrection is growing, stoked by the paralysis of the Greek debt stand-off. \nIt is hard to imagine a more cynical piece of nonsense than the outline terms of the recently announced third Greek bail-out - just harsh enough to persuade German public opinion that their money is not being spent on Greek pensions, yet fiscally far too harsh for Greece plausibly to implement. The deal is little more than a charade. Everyone knows that eventually the fires will break out anew. \nSo why is it that UK opinion polls are swinging so strongly in favour of the EU? Have we finally learnt to love the ridiculous Jean-Claude Juncker? Hard to believe. \nYet a poll last month by Ipsos Mori showed UK support for staying in the EU was at its highest level for 24 years. Meanwhile, the proportion in favour of getting out had fallen to its lowest level since the last referendum in 1975. The ins outnumber the outs by a margin of three to one. \nEuroscepticism passed its high water mark in 2011 at the height of the eurozone crisis, and has been falling ever since. Perhaps just as surprising, support for Europe has been growing despite the general lack of confidence in David Cameron’s ability to win a better deal for Britain in forthcoming negotiations. \nThese are admitedly the findings of just one polling organisation. Other pollsters are less conclusive. What’s more, the numbers of undecided are still very high. And in any case, the unexpected outcome of the UK general election has again reminded us of the limitations of such polling. \nAll the same, something is plainly going on here. The only explanation I can think of is that people have learned to distinguish the trials and tribulations of the euro, which thankfully only indirectly affect the UK, from the supposed wider geo-political and economic benefits, if indeed there are any, of membership of the EU. \nAll this could change fundamentally over the next two years. Europe may prove so intransigent on renegotiation that even Cameron would feel obliged to back the outs. If the Government were to swing behind the no campaign, it would be curtains for British membership of the EU. \nYet there is also a wider point. The eurozone crisis has in a sense rendered the referendum debate largely meaningless. \nIn or out, Britain has little option but to remain part of the single market. Anything else would be a giant economic leap in the dark. The real issue is only that of terms, and ensuring that whatever other madnesses the eurozone inflicts on itself to hold the whole thing together do not directly disadvantage us. As things stand, the eurozone is on a long road to oblivion. It will be a very different, and less blindly integrationist, Europe we will be dealing with 10 years hence, or so we must hope.", "external_links": [], "published": "2015-07-21T20:45:00.000+03:00", "crawled": "2015-07-21T21:01:26.459+03:00", "highlightTitle": ""}