{"organizations": ["Makkawi Qatar First Bank", "Wethaq Takaful", "QFC Regulatory Authority", "Qatar First Bank"], "uuid": "854ed8c9f185990e77a6079f870e11a415708fa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/pr/images/2015/ziad_2015_07_27.jpg", "site_section": "http://www.zawya.com/rssfeeds/islamic_finance.xml", "section_title": "Zawya.com - Islamic Finance News", "url": "http://www.zawya.com/story/Qatar_First_Bank_appoints_CEO-ZAWYA20150727101300/", "country": "AE", "title": "Qatar First Bank appoints CEO", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Qatar First Bank appoints CEO", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T13:34:00.000+03:00", "replies_count": 0, "uuid": "854ed8c9f185990e77a6079f870e11a415708fa9"}, "author": "", "url": "http://www.zawya.com/story/Qatar_First_Bank_appoints_CEO-ZAWYA20150727101300/", "ord_in_thread": 0, "title": "Qatar First Bank appoints CEO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Makkawi"], "text": "Wethaq Takaful total assets rise by 13.1% end FY 2014-15 Ziad Makkawi Qatar First Bank (QFB), the first independent Shari'ah compliant bank authorized by the QFC Regulatory Authority (QFCRA) announced today the appointment of veteran financial services professionalZiad Makkawi as its Chief Executive Officer with immediate effect. \nZiad has a 27 year track record as an entrepreneur and business builder in the financial services arena where he assumed key leadership positions in banking, investment banking, asset management and private equity. Ziad will lead the expansion of QFB's already successful Private Equity business, as well as build a Private Bankingfranchise focused on High and Ultra-High Net Worth individuals. \nZiad spent his early days with JP Morgan on Wall Street. He later joined Elf Aquitaine in Geneva before moving to the Middle East to co-found Lebanon Invest, and then Middle East Capital Group as Managing Director. After moving to Dubai in 2000, Ziad built and ran SHUAA Capital's financial Services business including asset management, proprietary trading, capital markets, research and brokerage. In 2004 Ziad was appointed CEO of Dubai Bank,and in 2006 founded and ran as Chairman and CEO Algebra Capital a MENA focused Asset Management firm he later sold in 2010 to Global Asset Manager Franklin Templeton. Prior to joining QFB, Ziad was the CEO of Istithmar World the PE investment arm of Dubai World, a multi-billion dollar global portfolio spanning five continents and many sectors. Ziad also served as a director on numerous boards of leading financial institutions, companies as well as a number of funds. \nAbdulla bin Fahad bin Ghorab Al Marri,Chairman of QFB, commented, \"QFB is rolling out its strategy of establishing itself as the premier Private Merchant Bank in Qatar, we will continue to build on our successes in the Private Equity area and will build up our Private banking and Investment capabilities to broaden the services we offer our clients and shareholders. We are excited about havingZiad on board to drive this strategy,Ziadbrings a depth of experience to this key role and we are confident that someone ofhis calibre, experience and talent will lead the team and grow the Bank to new heights\".-Ends- About QFB Qatar First Bank (QFB), (formerly known as Qatar First Investment Bank), is the first independent Shari'ah compliant bank authorized by the QFC Regulatory Authority (QFCRA). Launched in 2009, the bank offers alternative investments, private banking and wealth services. QFB has direct investments in the GCC, Middle East, Africa, Turkey and Europe. The bank plans to list on the Qatar Exchange in the near future. \nQFB has an authorized share capital of QAR 2.5 billion (US$ 687mn) and a paid up share capital of QAR 2 billion (US$ 550mn) providing the financial strength to capitalize on lucrative investments. It operates to the highest international regulatory and corporate governance standards and is ISO 27001 certified. \nAdopting an investment strategy that centres on sector and geographical diversification, QFB's target sectors include energy, financial services, industrials, real estate and health care. It has invested a total of QAR 2.4 billion in 21 transactions since inception, in different sectors and across geographies spanning the broader GCC, MENA, Turkey and UK. QFB plans to open its first flagship branch in Q3 2015. \nMedia Contact:", "external_links": [], "published": "2015-07-27T13:34:00.000+03:00", "crawled": "2015-07-27T15:38:42.181+03:00", "highlightTitle": ""}