{"organizations": [], "uuid": "c646b542d348a0d3161fa0ef468c0b412130baf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/4/z/z/r/image.related.articleLeadwide.620x349.gi3y2h.png/1435934026524.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/comment-and-analysis/adani-shown-the-door-by-traditional-owners-20150702-gi3y2h.html", "country": "AU", "title": "Adani shown the door by traditional owners", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Adani shown the door by traditional owners", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "c646b542d348a0d3161fa0ef468c0b412130baf3"}, "author": "", "url": "http://www.smh.com.au/business/comment-and-analysis/adani-shown-the-door-by-traditional-owners-20150702-gi3y2h.html", "ord_in_thread": 0, "title": "Adani shown the door by traditional owners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Adani's Carmichael project has Treasury officials perplexed, traditional owners incensed, environmentalists upset and yet Queensland Labor remains a cheerleader.\nAdani turns to Liberal and Labor lobbyists Treasury perplexed by Adani's mathematics The Wangan and Jagalingou people gathered two weeks ago at a convention centre in Carseldine north of Brisbane.\nThey were there to vote on a proposal to make sure those responsible for their native title claim were truly representative of the Wangan and Jagalingou people. These are the traditional owners of the land in the Galilee Basin, precisely where Indian company Adani aims to build Australia's biggest coal mine, the controversial $16 billion Carmichael project.\nTwice in three years, the Wangan and Jagalingou (W&J) had rejected Adani's advances to sign a land deal for the mine, and twice Adani had dragged them off to the Native Title Tribunal and sought approval for the state to override their opposition to the mine.\nIt was just after 9am on Saturday, June 20, when two charter buses turned up at the Tavernetta Function Centre in Carseldine. Adani had bussed in 150 people in a sly bid to force consideration of a new memorandum of understanding they claimed to have with W&J, despite the previous 'no vote' from W&J. It was an Adani ambush, and it must have cost a fortune: three days of food, accommodation and transport for 150 people.\n\"We saw the buses turn up and we were wondering what was going on,\" says traditional owner and W&J lead spokesman Adrian Burragubba.\n\"They tried to organise their own meeting after ours in order to get the people to agree to their MoU - a kind of tricked ILUA [Indigenous Land Use Agreement] when they knew they didn't have one. Right now we're in the Federal Court precisely because we refused an ILUA and they have tried to override us.\"\nBut Adani's cunning stunt backfired. They hadn't counted on their 150 voters changing their minds after impassioned speeches from the likes of Burragubba. W&J tribal elders are deeply concerned about the effect of the mine on their cultural heritage and the risks it poses to water and wildlife.\nBy the end of the day, Adani's reps had been asked to leave the meeting. Of the W&J's 12 \"new applicants\", or claim representatives, at least seven were against Adani, despite all the money flying about to skew the vote, and three were in favour. The views of the other two appear in the balance.\nBurragubba says Adani has been engaging in tactical skulduggery for years, excluding him from meetings as he represented families which were not in favour of Carmichael.\n\"They claimed I was disruptive,\" he told Fairfax Media.\n\"But they need all applicants in a meeting to do a deal. So there cannot possibly be a legally binding agreement.\n\"Adani has been conniving with these other two people [other Indigenous applicants] to try to get an agreement and undermine the Native Title process and our right to free prior informed consent.\"\nBefore the showdown at the Carseldine convention centre, Adani had co-opted two of the W&J applicants, also directors of the trustee for the W&J's Cato Galilee Trust.\nAdani failed to respond to questions on Friday as to its arrangements with Cato Galilee and with the W&J applicants.\nIts latest public missive on the subject came three days before the W&J meeting: \"Adani deepens partnership with Traditional Owners.\"\nAs far as W&J are concerned nothing could be further from the mark. While Adani has signed up ILUAs with other Indigenous groups – the Juru, Birriah and Jangga Aboriginal people – whose land lies either on the rail corridors from the Galilee or on the coast at Abbot Point where the coal is to be shipped to India, there is only a draft memorandum of understanding intended for the W&J, and one which is not representative of the majority of families at that.\nIt is getting messy. W&J now has a claim before the Federal Court alleging Adani misled the W&J people. The Native Title Tribunal and the state of Queensland are also listed as defendants for failing to properly follow process.\nSo here we have a deal which is no only an utter white elephant on a financial basis but which does not have consent from the traditional landowners in the Galilee Basin. They say the mine will destroy their land, yet the Labor government of Queensland came out this week in ardent support of it.\nWe welcome the \"sustainable development of the Galilee Basin\", was the line from Treasurer Curtis Pitt on Wednesday, notwithstanding revelations in Fairfax Media the day before that Queensland Treasury thought the project unbankable.\nThere is zero chance of \"sustainable development\". Adani's own financial modelling assumes coal prices have to double for the project to make money.\nAs one incredulous hedge fund source pondered this week: \"Peabody does 36 million tonnes per annum and they'd take $2 billion any day of the week ... what am I missing here? Money laundering?\"\nBy week's end the Peabody reference was even more poignant. Here was the US coal giant, with huge mining operations in Australia, desperately fending off its creditors.\nIts share price sank another 20 per cent this week, hitting a record low and a market cap of $US520 million ($680 million). It is down 40 per cent for the month, is carrying $US5.5 billion in debt and is on the hook for nearly $1 billion in mining rehabilitation costs in Australia alone.\nIf Adani had the remotest interest in sane investment and value creation for its shareholders, why would it not just bid for Peabody's mines?: buy immediate cash flow, eliminate project risk, and get higher quality coal at a fraction of the price.\nIn fact, the value equation is 10 per cent less tonnage for four times the price. Adani's plan is to build a 32 million tonne per annum mine, stage one (versus Peabody's production of 36 million tpa).\nThey still need to spend $3.5 billion to build the mine, then another $3.5 billion to build the rail line and then $3 billion for the port expansion.\nThis is far too sensible for Adani and the government of Queensland, who prefer to pursue a project with no prospect of success, unless the coal price miraculously doubles, and with enormous environmental risk in the face of trenchant community opposition.\nEven if it did succeed, against all logic, the job creation would be less than one-fifth what Adani claims; that is, 1400 versus Adani's ambit claim of 10,000. And if it did ever make money, thanks to the structure of Adani Mining any profits would wend their way via Singapore to Mauritius.\nQueensland, the Peabody share price is telling you something, you are riding a white elephant with wings way above a magical landscape of dreams.", "external_links": [], "published": "2015-07-04T03:00:00.000+03:00", "crawled": "2015-07-04T16:08:59.000+03:00", "highlightTitle": ""}