{"organizations": [], "uuid": "330722df53d6ad558583f609e7a9bc957fd342d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wisebread.com", "main_image": "http://www.wisebread.com/files/fruganomics/blog-images/travel_000026468266.jpg", "site_section": "http://www.wisebread.com/taxonomy/term/6/all/feed", "section_title": "Wise Bread (Personal Finance posts)", "url": "http://www.wisebread.com/how-to-use-miles-and-points-for-a-big-award-trip", "country": "US", "title": "How to Use Miles and Points for a Big Award Trip", "performance_score": 0, "site": "wisebread.com", "participants_count": 1, "title_full": "How to Use Miles and Points for a Big Award Trip", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T08:06:00.000+03:00", "replies_count": 0, "uuid": "330722df53d6ad558583f609e7a9bc957fd342d7"}, "author": "Jason Steele", "url": "http://www.wisebread.com/how-to-use-miles-and-points-for-a-big-award-trip", "ord_in_thread": 0, "title": "How to Use Miles and Points for a Big Award Trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » Personal Finance » Credit Cards » How to Use Miles and Points for a Big Award Trip How to Use Miles and Points for a Big Award Trip This post contains references to products from our advertisers. We may receive compensation when you click on links to those products. Please visit our Advertiser Disclosure to view our partners, and for additional details. Wise Bread Picks 0% Balance Transfer Credit Cards \nWould you like to take a big trip to another part of the world? Wouldn't we all! But for most of us, spending tens of thousands of dollars on an epic excursion just isn't in our budgets. \nBut there are people who regularly take these kind of big international vacations by using their points and miles. While many people have used travel rewards for a free domestic flight, or an award night in a hotel, award travel enthusiasts like myself are able to put it all together and redeem their rewards for luxury travel around the world. Here's how you can too. (See also: Best 5 Credit Cards with Travel Rewards ) Start with a Goal \nHaving an award travel goal is not just useful for daydreaming, it actually serves a practical purpose. For example, you will want to know how many points or miles you need. So if your goal is to visit Hawaii, you will need to make sure you collect miles with an airline that offers service there, or at least through its partners. Collect Points and Miles \nFind a credit card that offers redemption options for the airline of your choice. This could be a card co-branded airline card (for example, Delta SkyMiles, AAdvantage, United MileagePlus) or a card that allows you to transfer your points to airline miles . Finally, you can also get a credit card that simply reimburses you for travel expenses, like the Discover it Miles card or Capital One Venture Rewards . These cards offer the most flexibility on travel options, but the value of each point is never more than $0.01. \nDon’t forget about hotel credit cards, too, since you’ll need a place to stay once you get to your destination. Co-branded hotel credit cards that offer elite status can get you valuable benefits. Look for Bonuses \nThe quickest way to get a ton of points is through credit card sign-up bonuses , which can frequently offer tens of thousands of points or miles to new applicants. Nevertheless, these offers should only be used by the most responsible credit card users who avoid interest by paying their entire balance in full each month. In addition, it helps to use credit cards that offer bonus points where you shop the most. For example, the Chase Sapphire Preferred offers double points at restaurants and on all travel expenses, while the Amex Everyday Preferred offers bonus points at gas and grocery stores. (See also: Credit Cards that Offer Bonus Rewards for Groceries ) \nFinally, you should spend a few minutes learning about the airline, hotel, and credit card programs you are a part of, and all the ways you can earn rewards. These programs are partnered with a wide variety of companies that offer rewards, and many feature shopping and dining programs that represent additional earning opportunities. Tips on Putting a Big Trip Together \nTo the surprise of many would-be award travelers, spending the miles can turn out to be even more difficult than earning them. Credit cards are competing with each other to give out ever increasing numbers of points and miles, while travel providers are rapidly curtailing the value of these rewards. Often airlines and hotels are increasing the number of points and miles needed for an award, while other times they reduce the availability of airline seats or hotel rooms offered at the published prices. In fact, Delta Airlines recently took the unprecedented step of removing its award chart entirely, along with any expectation of what its miles were worth. Be Flexible \nThe first thing I will do when I am putting together an award trip is to find my flights. In doing so, I start with my ideal travel dates, but will usually have to be flexible enough to vary it a little bit. Likewise, I will always prefer a non-stop flight or one with a single change of planes, but I am more likely to accept additional flights in order to reach my destination while using my miles as efficiently as possible. Perform Multiple Searches \nAirline award search engines are far from perfect, and will not always present all of the available options. For example, if you are trying to fly from Denver to Paris on United Airlines, it is not enough to simply search for flights between those two cities. I would try to searching to Paris from United's hubs in Chicago, Newark, Houston, and Washington-Dulles. If I found an acceptable flight, I would then perform a separate search from Denver to the gateway city. Finally, I could try to get United's website to ticket this itinerary using a multi-city award search, or perhaps just call their reservations center. Don't Forget Partners \nEvery major airline has a dozen or more partners that you can use your miles to fly with. Yet often, these partner awards are not visible on their web site. To find these awards, you need to search another web site. For example, the American Airlines web site does not show flights on its partner Iberia, but the British Airlines site will. There are also paid services such as Expert Flyer that also provide award search functions. (See also: The Secret to Redeeming Travel Rewards with Airline Partners ) Consider Splitting the Team \nFinding an available award seat can be difficult, finding two seats on the same itinerary can be a real challenge, but finding three or more seats on one flight can seem impossible. So in some cases, it makes sense to split up travelers, at least at the time of booking. Later, as there are schedule changes or even delayed flights, you can try to have the airline re-accommodate you on the same flights, which they can do at their discretion under these circumstances. Consider Purchasing Positioning Flights \nSometimes it is smart to pay for a short flight that will connect you to a valuable award. Perhaps you find a great Delta award flight from Atlanta to Europe in business class, but there is no reasonably price awards from your home airport to Atlanta. In this case, the price in miles for the entire ticket will go up, just because of that one domestic flight. So you might be able to purchase an inexpensive ticket there, which is a small price to pay for the award ticket you need. Just be careful leave plenty of time between your arrival and departure to account for delays, preferably overnight. Find a Hotel \nOnce you have your flights in place, it is time to consider hotels. The web site Award Mapper is a great tool for showing which hotel awards are available in various cities, along with their prices. Remember that programs like Hilton, Hyatt, and Starwood claim to offer any unsold standard room as an award, so if you are unable to book an award night, but they are still selling rooms, you may have to call reservations and remind them of this policy. (See also: Breakdown of Benefits and Value of the Best Hotel Rewards Programs ) \nDo you have any tips on putting together an award trip? Editorial Note: Any opinions, analyses, reviews or recommendations expressed in this article are those of the author’s alone, and have not been reviewed, approved or otherwise endorsed by any bank, card issuer, airline or hotel chain. Our Favorite Credit Card Deals", "external_links": [], "published": "2015-07-07T08:06:00.000+03:00", "crawled": "2015-07-07T08:17:22.000+03:00", "highlightTitle": ""}