{"organizations": [], "uuid": "2f4aa9140c0c7a69c47246928827b7ad085ae167", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/wall-street-slightly-higher-oil-143207069.html", "country": "US", "title": "Wall Street higher as healthcare, energy stocks rally", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Wall Street higher as healthcare, energy stocks rally", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T20:50:00.000+03:00", "replies_count": 0, "uuid": "2f4aa9140c0c7a69c47246928827b7ad085ae167"}, "author": "", "url": "https://uk.finance.yahoo.com/news/wall-street-slightly-higher-oil-143207069.html", "ord_in_thread": 0, "title": "Wall Street higher as healthcare, energy stocks rally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 14, 2015, 18:24 BST - UK Markets closed Wall Street rises as oil prices recovery boosts energy stocks Reuters – 1 hour 18 minutes ago \nTraders work on the floor of the New York Stock Exchange July 14, 2015. REUTERS/Brendan McDermid \nBy Tanya Agrawal \nREUTERS - Wall Street was higher on Tuesday, adding to three days of gains, as energy stocks rallied and Micron Technologies led tech stocks higher on reports of buyout interest. \nTwitter jumped as much as 8.5 percent to $38.82 after a report, purportedly from Bloomberg, that the company was made a $31 billion offer. The stock quickly gave up most of its gains after Bloomberg said the report was fake. \nMicron jumped as much as 12.4 percent and was the biggest gainer on the S&P 500. China's state-backed Tsinghua Unigroup Ltd is preparing a $23 billion bid for the U.S. memory chip maker, Reuters reported, in what would be the biggest Chinese takeover of a U.S. company. \nOil prices steadied after Iran and six global powers reached a landmark nuclear deal that left sanctions on the country in place for now, continuing to limit its crude exports. Oil prices had tumbled earlier on fears that the deal would ease sanctions, allowing more oil into the markets. \n\"The market was short going into the Iran agreement, but the bears did not get the selloff they were hoping, so we're going back up,\" said Scott Shelton, commodities specialist and crude broker with ICAP in Durham, North Carolina. \nAt 11:31 a.m. ET (1531 GMT) the Dow Jones industrial average was up 56.72 points, or 0.32 percent, at 18,034.4. the S&P 500 was up 8.6 points, or 0.41 percent, at 2,108.2 and the Nasdaq composite was up 34.61 points, or 0.68 percent, at 5,106.12. \nAll 10 major S&P 500 sectors were higher, with the energy index's 0.62 percent rise leading the advancers. \nEnergy stocks rose as Brent crude futures and U.S. crude recovered from their lows of the day. Some investors however feel Tuesday's rally will be short-lived and longer-term prospects look dim given excess crude supplies. \nInvestors have also shifted focus to U.S. corporate earnings as worries about Greece and China abate, for the time being at least. \nU.S. companies are expected to report their worst sales decline in nearly six years when they post second-quarter results, while earnings are expected to have fallen 2.9 percent, according to Thomson Reuters estimates data. \n\"We are in the after glow of the Greece and Iran deals,\" said Robert Lutts, chief investment officer at Cabot Wealth Management in Salem, Massachusetts which oversees $600 million. \nLutts said investors were ignoring external worries like China's economic slowdown for the time being and focusing on earnings. \n\"Earnings expectations are pretty modest right now. If the stock market is going to get any help from earnings, we need to see better growth.\" \nThe quarterly earnings kicked off in earnest with JPMorgan and Wells Fargo reporting results. Both stocks rose about 1 percent after their reports. \nAmazon rose to a record high of $466.20 after UBS upgraded the company's stock to \"buy\" from \"neutral\". \nDow component Johnson & Johnson fell 0.7 percent to $99.60 after its revenue declined 9 percent. \nAdvancing issues outnumbered decliners on the NYSE by 1,898 to 1,024. On the Nasdaq, 1,724 issues rose and 914 fell. \nThe S&P 500 index posted 29 new 52-week highs and two new lows, while the Nasdaq recorded 93 new highs and 21 new lows. \n(Editing by Savio D'Souza)", "external_links": [], "published": "2015-07-14T20:50:00.000+03:00", "crawled": "2015-07-14T21:02:25.000+03:00", "highlightTitle": ""}