{"organizations": [], "uuid": "a53ba958507df58140727134d1340847a82c10e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507101717.html", "country": "US", "title": "Ghana: Dollar Hoarders Storm Forex Bureaux for Cedi", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Ghana: Dollar Hoarders Storm Forex Bureaux for Cedi", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T18:48:00.000+03:00", "replies_count": 0, "uuid": "a53ba958507df58140727134d1340847a82c10e8"}, "author": "", "url": "http://allafrica.com/stories/201507101717.html", "ord_in_thread": 0, "title": "Ghana: Dollar Hoarders Storm Forex Bureaux for Cedi", "locations": ["Liberia", "Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Liberia: Report - Maternal Mortality to Rise in Ebola Hit Countries \nSince last week, the cedi recorded gains against the US dollar; it closed trading on Friday last week, gaining 7.8 percent in value over the dollar. This year, the cedi has depreciated 26 percent in value against the dollar. Some forex bureau operators in Accra attributed the sharp decline of the dollar and other major trading currencies to speculation in the market. \nA foreign currencies dealer at the Kwame Nkrumah Circle, Awudu Yakubu, explained to The Chronicle that the market was being driven by speculation rather than the forces of demand and supply. He allured that the recent announcement by the Bank of Ghana that it was going to inject $20 million into the market daily did the magic. \nFollowing this development, Citizens for Good Corporate Governance (CGCG), a leading economic think tank and pressure group, predicted that the cedi was on the brink of a significant rebound, after a dismal performance during the first half of 2015. \nAccording to the Convener of the group, Elorm Desewu, the cedi would recover significant ground against the US dollar and other major international trading currencies during the second half of the year, due to the large quantum of foreign exchange inflows being expected over the coming months, which will reverse the current shortfall in supply of forex on the local financial markets. \nHe said: \"Some US$4 billion in inflows are being expected over the next few months from diverse sources, including this year's international syndicated loan for cocoa purchases of US$1.8 billion; the proceeds of an imminent US$1.5 billion Eurobond issue; the first tranche of recently approved World Bank financing to the tune of US$550 million; development partner bilateral assistance of some US$500 million; and two tranches of the balance of payments support from the International Monetary Fund, cumulatively amounting to over US$200 million.\" \nIndeed, in anticipation of these inflows, and in response to the Bank of Ghana's on-going intervention in the local forex market through increased supply of forex, the cedi has already begun appreciating. The CGCG maintained that their quantitative economic modeling suggests that the cedi could appreciate to GH¢3.2 before the end of the third quarter of this year. Ghana \nSix senior officers of the Ghana Revenue Authority have, on behalf of about 99 other Senior Customs Officers, whose … see more » Copyright © 2015 Ghanaian Chronicle. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-10T18:48:00.000+03:00", "crawled": "2015-07-10T19:42:22.000+03:00", "highlightTitle": ""}