{"organizations": [], "uuid": "17e14b7182eaaf047764541a4e52c4e7e229aa30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507040180.html", "country": "US", "title": "South Africa: Heavy Police Presence in Mamelodi After Violent Attacks", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Heavy Police Presence in Mamelodi After Violent Attacks", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T18:19:00.000+03:00", "replies_count": 0, "uuid": "17e14b7182eaaf047764541a4e52c4e7e229aa30"}, "author": "", "url": "http://allafrica.com/stories/201507040180.html", "ord_in_thread": 0, "title": "South Africa: Heavy Police Presence in Mamelodi After Violent Attacks", "locations": ["Kenya", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya: We Have No Faith in KQ Management, Says Pilot Group \n\"A task team consisting of detectives and crime intelligence officers are already at work to bring those who were responsible for violence to book and they will face the full might of the law,\" Dlamini said. \nPutco cancelled its contract in Gauteng for eight routes, citing financial loss. Mamelodi was one of the routes. Autopax was appointed to fill the void, much to the dismay of taxi owners in the area, who questioned how Autopax was able to get permits while they have to wait a long time. \nTransport MEC Ismail Vadi said the problems in Mamelodi were as a result of the taxi owners not understanding the process of applying for operating permits. He said because the route was already in operation, a new service could be appointed without the need to gazette or put to tender. \nPutco confirmed that the two buses which had been attacked on Friday morning, were however, not travelling on the affected routes. \nThey had been travelling from Mpumalanga on Nellmapius road outside Mamelodi. \nDlamini said the area had been calm since midday on Friday. \n\"Police are also appealing to the commuters to remain calm and expose those who are responsible for violence.\" \nHe said talks between affected parties were underway. \nGauteng Premier David Makhura, who held a briefing in Mamelodi on Friday afternoon, said government would not be held to ransom by aggrieved taxi owners who were opposing the modernisation of public transport. \n\"We will not allow the taxi operators to hold the community to ransom. The commuters must be protected to choose the mode of transport they want to use,\" he said. \nSource: News24", "external_links": [], "published": "2015-07-04T18:19:00.000+03:00", "crawled": "2015-07-04T18:51:14.000+03:00", "highlightTitle": ""}