{"organizations": [], "uuid": "52359bb7e57527a5f39651c2429b9bed5e0853ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-09/australian-employers-added-workers-in-june-jobless-rate-at-6-", "country": "US", "title": "Australian Employers Added Workers in June, Jobless Rate at 6%", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Australian Employers Added Workers in June, Jobless Rate at 6% - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T09:39:00.000+03:00", "replies_count": 0, "uuid": "52359bb7e57527a5f39651c2429b9bed5e0853ea"}, "author": "Michael Heath", "url": "http://www.bloomberg.com/news/articles/2015-07-09/australian-employers-added-workers-in-june-jobless-rate-at-6-", "ord_in_thread": 0, "title": "Australian Employers Added Workers in June, Jobless Rate at 6%", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australian employers added jobs in June, led by full-time positions, indicating improved business confidence is translating into increased hiring.\nThe number of people employed rose by 7,300 from a month earlier, compared with the median forecast of 28 economists for no change, government data showed Thursday. The jobless rate rose to 6 percent from a revised 5.9 percent.\nThe report adds to increasing impetus in housing construction that is soaking up workers who are surplus to requirements at mine sites where an investment boom is winding down. Still, a forecast record decline in business investment and falling commodity prices are damping the economic outlook.\n“Leading indicators of employment point to continuing modest jobs growth over the period ahead,” Michael Blythe, chief economist at Commonwealth Bank of Australia, said in a research report ahead of the release.\nThe Australian dollar rose and traded at 74.38 U.S. cents at 11:33 a.m. in Sydney, from 74.25 cents before the data was released.\nThe number of full-time jobs rose by 24,500 in June, and part-time employment fell by 17,200, the report showed. Australia’s participation rate, a measure of the labor force in proportion to the population, increased to 64.8 percent in June from 64.7 percent a month earlier, it showed.\nAustralia is facing the effects of a fall in prices for its key commodity exports, led by iron ore, which has entered a bear market. The central bank, which cut rates twice this year to 2 percent, is banking on a lower currency to help a transition to industries outside mining.\nSupermarket Hirings “The Australian dollar has declined noticeably against a rising U.S. dollar over the past year, though less so against a basket of currencies,” Governor Glenn Stevens said Tuesday after leaving the cash rate unchanged. “Further depreciation seems both likely and necessary, particularly given the significant declines in key commodity prices.”\nWoolworths Ltd., Australia’s largest supermarket chain, said in June it plans to spend A$650 million ($483 million) and add 2,000 new jobs in the southern state of Victoria over the next three years.", "external_links": [], "published": "2015-07-09T09:39:00.000+03:00", "crawled": "2015-07-09T05:10:41.000+03:00", "highlightTitle": ""}