{"organizations": [], "uuid": "172e74a579e45f810711a53611f351ae01f8591c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DO827_kangad_ZG_20150625120940.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/an-8-year-olds-take-on-uber-for-kids-2015-07-01", "country": "US", "title": "An 8-year-old’s take on ‘Uber for kids’", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "An 8-year-old’s take on ‘Uber for kids’ - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 1, "uuid": "cd03869ebc3a79ecf1d41b7d830c75d98d4445c3"}, "author": "By     Sally French", "url": "http://www.marketwatch.com/story/an-8-year-olds-take-on-uber-for-kids-2015-07-01#post-0", "ord_in_thread": 0, "title": "An 8-year-old’s take on ‘Uber for kids’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Uber-Like Services for Kids Gain Traction (2:04) Some parents have started to use kid car-hailing services like Kangado, Shuddle, and HopSkipDrive to get their kids around when they don't have time to drive. MarketWatch's Sally French takes a test-ride with Kangado and its 8-year-old passenger.\nCatching a ride with a stranger, who may or may not have insurance and likely never had a formal interview, can be terrifying for some .\nThat is one of the biggest challenges facing Uber, which is notorious for garnering media attention like “The Definitive List of Uber Horror Stories” , is banned in numerous cities around the globe , and has triggered violent protests by competing drivers.\nBut a similar service to Uber that is reserved solely for kids? Totally cool. That is what 8-year-old Sam Petrocelli will tell you. (Full disclosure: Sam is the son of MarketWatch reporter Claudia Assis .)\nServices that pick up and drop off kids such as KangaDo , Shuddle and HopSkipDrive have sprung up in the past few years to provide an alternative way for children to get from school to after school activities to playdates — all without their parents.\nUnlike Uber or Lyft, these family-friendly services place drivers through extensive background and DMV checks, as well as vehicle inspections. KangaDo drivers are given an in-person interview and formal training. Shuddle takes the extra step in offering custom insurance for minors, while KangaDo, which is still in private beta, offers booster and car seats.\nFor Sam, that means his mom, Claudia, was able to go straight from her office one afternoon to pick up his cello from the shop before it closed and get home in time to wait for Sam to arrive — all because a driver from KangaDo was able to pick him up at math camp.\nHow KangaDo works\nParents download an app and can schedule rides as far in advance as they need. Once a KangaDo driver has picked up the child, they often send pictures or text updates via the app to parents. The app also offers parents real-time tracking of the driver’s location.\nWe asked Sam to stop by the MarketWatch office on his way home while using KangaDo and give us his review of the ride. As it turns out it was pretty normal (though he says Mom is still a better driver).\nHere’s our Q&A with him:\nMarketWatch: How did you arrive here today?\nSam: I was at math camp and then I came here in a KangaDo.\nMW: So...what is a KangaDo?\nS: KangaDo is a company that drives kids when their mommies and daddies are busy.\nMW: What kind of car was it?\nS: It had a place to hold your phone, it had four seats, a trunk, and no upper window thing.\nMW: Does your parents’ car have an upper window thing?\nS: No, it was basically the same as my parents’ car except this one had a phone holder.\nPrev Page 1 2 Next Page", "external_links": ["http://blogs.wsj.com/totalreturn/2015/03/31/uber-and-auto-insurance-regulators-weigh-in/", "http://www.thedailybeast.com/articles/2014/11/19/the-ten-worst-uber-horror-stories.html", "http://www.kangadoapp.com/", "http://www.wsj.com/articles/uber-faces-civil-suit-from-cities-of-san-francisco-los-angeles-1418168938", "http://www.hopskipdrive.com/", "https://shuddle.us/", "http://www.dailydot.com/business/10-things-uber-drivers-have-done-wrong/"], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-01T20:23:09.000+03:00", "highlightTitle": ""}