{"organizations": [], "uuid": "ec87772f8939b5666072ae60f380b74b1df7c702", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-31/puerto-rico-veers-toward-first-bond-default-questions-answered", "country": "US", "title": "Puerto Rico Veers Toward First Bond Default: Questions Answered", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Puerto Rico Veers Toward First Bond Default: Questions Answered - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T00:51:00.000+03:00", "replies_count": 0, "uuid": "ec87772f8939b5666072ae60f380b74b1df7c702"}, "author": "Michelle Kaske", "url": "http://www.bloomberg.com/news/articles/2015-07-31/puerto-rico-veers-toward-first-bond-default-questions-answered", "ord_in_thread": 0, "title": "Puerto Rico Veers Toward First Bond Default: Questions Answered", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Puerto Rico Governor Alejandro Garcia Padilla wants to negotiate with investors to reduce $72 billion of debt he says the island can’t afford.\nThe U.S. commonwealth has paid bondholders what they’re owed since it was ceded to the U.S. following the Spanish-American War. That may soon change.\nPuerto Rico’s Public Finance Corp., which has sold $1 billion of debt, is likely to miss a $58 million payment due on Aug. 1. The bonds are repaid with appropriations allocated by the legislature. Faced with a budget shortfall, lawmakers didn’t provide enough money to service the debt.\nWhile the securities are a small share of the island’s debt costs, failing to pay would be a warning shot to investors that officials aren’t afraid to default.\nHere are some of the questions you may have, starting right at the very beginning:\nQ: What is a default?\nA: Investopedia.com defines default as “the failure to promptly pay interest or principal when due. Default occurs when a debtor is unable to meet the legal obligation of debt repayment.” Moody’s Investors Service says a missed payment is a default.\nQ: What is the Public Finance Corp.?\nA: It’s a subsidiary of the Government Development Bank, which works on the island’s debt sales. It was created in 1984 to sell bonds on behalf of the commonwealth and its agencies. Most of the proceeds it has raised were used to balance Puerto Rico’s budget.\nQ: Is a default definite?\nA: While officials haven’t said for certain whether they’ll pay the interest and principal bill, it’s likely they won’t.\nNo money was transfered to the trustee in July to make the payment, and Victor Suarez, Garcia Padilla’s chief of staff, said on July 27 that the island doesn’t have the cash.\nInvestors appear to view a default as a near certain: PFC bonds maturing in 2031 traded on July 30 for 16 cents on the dollar.\nQ: What happens if the PFC fails to pay?\nA: Bondholders could sue, but they have few remedies. The legislature isn’t legally required to allocate the money. The commonwealth hasn’t guaranteed repayment and the PFC has no power over taxes to raise funds on its own. Nor are bondholders able to demand early repayment in the event of a default.\nThe PFC has until the end of business on Aug. 3 to make the payment because the first day of August is a Saturday.\nQ: What does a default mean for holders of other Puerto Rico bonds?\nAnalysts and investors say it may cause Puerto Rico securities to lose value by casting doubt on the government’s willingness to pay its other debts. An index of Puerto Rico securities slid this week to a six-year low.\nQ: Why won’t Puerto Rico just find the money, given that it’s not expected to default on other debt payments due the same day?\nA: Commonwealth officials say the island’s available cash is limited. It’s delayed tax refunds, suspended payments to some suppliers and borrowed from its insurance agencies to help preserve cash to continue making payroll and support essential government services.\nThe PFC bonds have the weakest legal protections, so the island will suffer fewer pitfalls from a default on those bonds.\nQ: Which firms are set to receive interest payments on Aug. 1?\nA: OppenheimerFunds Inc., Franklin Resources Inc. and Nuveen Asset Management are among those that held PFC bonds as of June 30.\nQ: What is the federal government doing in response to Puerto Rico’s debt crisis?\nA: Treasury Secretary Jacob J. Lew said July 29 that there isn’t any discussion of a federal bailout. Lew, the White House and the Federal Reserve have urged Congress to work with commonwealth officials. Bills to allow some Puerto Rico agencies to file for Chapter 9 bankruptcy, introduced in both chambers, haven’t advanced so far because of a lack of support from Republican leaders.\nQ: Why can’t Puerto Rico turn to U.S. bankruptcy court to lower its debts, as Detroit and other municipalities have?\nA: Like U.S. states, Puerto Rico’s central government isn’t eligible for Chapter 9 bankruptcy protection, nor would it be under the legislation proposed in Congress. However, the bankruptcy code never gave Puerto Rico that option for its agencies or publicly run corporations, either.\nQ: How much debt does Puerto Rico have?\nA: Puerto Rico and its agencies owe a combined $72 billion. That includes $13 billion of general-obligation debt, which Puerto Rico’s constitution says must be repaid before other expenses, and another $5.5 billion guaranteed by the commonwealth.\nThere is also $15 billion of debt payable from island sales taxes. Other agencies, such as the Puerto Rico Electric Power Authority, the government power company, have also sold bonds.\nQ: Who holds Puerto Rico’s debt?\nA: Hedge funds hold almost $22 billion, while local investors on the island have about $20 billion. More than half of U.S. mutual funds that focus on municipal securities have exposure to Puerto Rico debt, for a combined $10 billion.\nQ: Why can’t Puerto Rico and its localities repay the entire $72 billion?\nA: The commonwealth and its agencies have borrowed for years to paper over budget shortfalls, with the expectation that the economy would improve and the need to keep relying on debt would disappear. It didn’t. Puerto Rico’s economy has declined every year but one since 2006 and, with a population exodus for the U.S. mainland, there’s fewer people around to pay taxes needed to finance the debt.\nAt the same time, health care and retirement expenses are projected to increase. Its employee-retirement system is also deeply underfunded.\nQ: What is Puerto Rico doing now?\nA: Island officials are working on a debt-restructuring plan, to be finished by Sept. 1, and a five-year fiscal plan to improve the economy and balance the budget. Officials have said it’s premature to say by how much it will seek to reduce its debt and which securities could be affected.", "external_links": [], "published": "2015-08-01T00:51:00.000+03:00", "crawled": "2015-07-31T20:22:11.208+03:00", "highlightTitle": ""}