{"organizations": [], "uuid": "df5e4f21a5e01aa2ebae90d02d62be9498805f1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/23/markets-bonds-euro-idUSL5N1031TL20150723", "country": "US", "title": "Southern euro zone yields fall after Greece passes second set of reforms", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Southern euro zone yields fall after Greece passes second set of reforms | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T12:00:00.000+03:00", "replies_count": 0, "uuid": "df5e4f21a5e01aa2ebae90d02d62be9498805f1b"}, "author": "Marius Zaharia", "url": "http://www.reuters.com/article/2015/07/23/markets-bonds-euro-idUSL5N1031TL20150723", "ord_in_thread": 0, "title": "Southern euro zone yields fall after Greece passes second set of reforms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, July 23 Italian, Spanish and Portuguese bond yields fell on Thursday after the Greek parliament approved a second package of reforms required to start talks on a financial rescue.\nPrime Minister Alexis Tsipras contained a rebellion in his left-wing Syriza party. Significantly, only 36 deputies voted against the package, fewer than the 39 who defied him last week.\nThe government has said it hopes negotiations on the bailout can start this week and be wrapped up by Aug. 20. Officials have said early elections are likely in September or October once the package is agreed.\nItalian, Spanish and Portuguese 10-year bond yields were down 3 basis points each at 1.91 percent, 1.96 percent and 2.60 percent, respectively.\nThe three indebted countries are seen as the most vulnerable to spillovers from Greece, although the European Central Bank's bond-buying stimulus programme has limited contagion.\n\"Markets are ... under the spell of the positive outcome of the vote in Greece,\" said Christian Lenk, rate strategist at DZ Bank.\nTen-year Bund yields, which set the standard for euro zone borrowing costs, dipped 1 basis point to 0.69 percent. Traders say large debt redemptions and coupon payments scheduled for next week were pushing all yields lower as the money was expected to be reinvested in bond markets.\nIn the first signs of a return to normal, Greek banks reopened on Monday and Athens paid debts due to the European Central Bank and the International Monetary Fund. The ECB increased its emergency funding by 900 million euros, the same amount it provided last week.\nOn Tuesday, Standard & Poor's upgraded Greece's sovereign credit rating by two notches.\n\"Nevertheless the Grexit risk remains high if the government does not successfully implement the new bailout programme,\" said Eirini Tsekeridou, fixed income analyst at Julius Baer. (Reporting by Marius Zaharia, editing by Larry King)", "external_links": [], "published": "2015-07-23T12:00:00.000+03:00", "crawled": "2015-07-23T11:22:45.424+03:00", "highlightTitle": ""}