{"organizations": [], "uuid": "65a1ecac4893359b2230e0b703e5ce81fbb73563", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iQECQXII7Kpc/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-09/no-more-apologies-at-barclays-as-mcfarlane-sets-sight-on-revenue", "country": "US", "title": "No More Apologies at Barclays as McFarlane Sets Sight on Revenue", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "No More Apologies at Barclays as McFarlane Sets Sight on Revenue - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T21:38:00.000+03:00", "replies_count": 0, "uuid": "65a1ecac4893359b2230e0b703e5ce81fbb73563"}, "author": "Stephen Morris", "url": "http://www.bloomberg.com/news/articles/2015-07-09/no-more-apologies-at-barclays-as-mcfarlane-sets-sight-on-revenue", "ord_in_thread": 0, "title": "No More Apologies at Barclays as McFarlane Sets Sight on Revenue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For Barclays Plc, the time for apologizing is over. Now, the bank needs to get on with making money.\nAs Chairman John McFarlane fired Chief Executive Officer Antony Jenkins, 53, he pledged to focus on growth. Under Jenkins, who took over in the wake of a fine for rigging Libor in 2012, revenue dropped 16 percent, trailing Deutsche Bank AG and UBS Group AG, data compiled by Bloomberg Intelligence show.\n“Cost is important,” McFarlane, 68, told Bloomberg Television’s Jonathan Ferro on Wednesday after the decision was announced. “But it’s actually about revenue and increasing revenue growth way over the cost of capital growth.”\nThe comments signal a break from years of relentless cost cutting as European banks, emerging from the financial crisis, saw earnings eroded by the region’s sovereign-debt turmoil, faltering economies and a barrage of new regulations. in May 2014, Jenkins pledged to eliminate some 14,000 jobs, the toughest round of cuts to date.\nBoth Deutsche Bank and Credit Suisse Group AG also replaced their CEOs this month. Standard Chartered Plc earlier this year brought in Bill Winters after Peter Sands failed to halt two years of sliding profits and a slump in shares.\nAt Barclays, Jenkins clashed with the head of the investment bank, Tom King, over the pace of cuts to the securities business and the loss in potential revenue, said two people with knowledge of the situation, who asked not to be identified because the matter is private. While the CEO pushed for faster cuts, King cautioned against, they said.\nA spokesman for Barclays declined to comment. King didn’t return calls seeking comment.\nUnanimous Decision “After numerous strategic presentations and pledges to do everything” to boost the investment bank’s profitability, “the pace of restructuring has remained slow,” said Arun Melmane, an analyst at Canaccord Genuity in London. “We attribute this largely to the strategy to curtail revenue declines as the scope of the investment banks is narrowed.”\nBarclays’s investment banking operation reported a 2.7 percent return on equity in 2014, down from 8.2 percent the previous year and short of the CEO’s 12 percent group target. While profitability improved in the first quarter, the unit is still the bank’s least profitable part.\nThe board’s decision to replace Jenkins was unanimous, according to McFarlane, whose reputation of deep cost cuts, earned him the nickname “Mack the Knife.” Barclays needed a “new catalyst, a different way of running the bank,” he said.\nInvestors’ Support “The chairman is a man of action and looking to accelerate the implementation of group strategy which must be seen as a positive for shareholders,” said Trevor Green, head of U.K. equities at Aviva Investors, who oversees 21 billion pounds ($32 billion) of assets including Barclays shares.\nMcFarlane met several times with Finance Director Tushar Morzaria without Jenkins since he joined in April, said a person with knowledge of the matter, who asked not to be identified. Morzaria, 46, is seen as the most likely internal successor to the CEO, according to analysts.\nInvestors are backing McFarlane’s move. The shares jumped as much as 4 percent on Wednesday. They dropped about 6.3 percent over the past two years, slumping 10 percent in 2014, as Jenkins struggled to restore investor confidence.\n“In the investment bank, if volumes pick up they ought to be able to leverage some rebound in fixed-income and underwriting activities,” said Joseph Dickerson, an analyst at Jefferies International Ltd. with a buy rating on Barclays.\nJob Cuts Under Jenkins, Barclays announced 3,700 job cuts in 2013, a further 12,000 the following year and some 7,000 in 2015. At the securities division, Richard Ricci, one of the last remaining members of former CEO Robert Diamond’s management team, resigned in 2013, a year after Jenkins took over.\n“The cuts angered powerful figures in the investment bank, who saw their empires being eroded,” said Andre Spicer, a professor at the Cass Business School in London. “This came on top of three years when they went from seeing themselves as the bank’s heroes to being undervalued and even punished.”\nOxford-educated Jenkins, a former consumer banker, was dubbed “Saint Antony” by the British press for his role in cleaning up the bank. While his predecessor, a former Wall Street banker, told lawmakers in 2011 that the “period of remorse and apology” needs to be over, prompting a political outcry, Jenkins vowed to overhaul the bank’s culture.\nLegal Bills His efforts were scuppered by a rising legal bill. The bank paid $2.3 billion for manipulating currency markets and was forced to offer more than 5 billion pounds in redress to customers who were sold payment protection insurance.\nOther large European investment banks have also scaled back their securities business. UBS said in 2012 it would scale back in fixed income to focus on wealth management. The stock has gained 88 percent over the past three years.\nJohn Cryan and Tidjane Thiam, on their first day as CEOs of Deutsche Bank and Credit Suisse, respectively, both signaled they’re ready to remodel their firms to boost profit.\n“It makes sense to invest, grow and take market share as others retrench,” Jefferies analyst Dickerson said. “So that could be McFarlane’s strategy.”", "external_links": [], "published": "2015-07-09T21:38:00.000+03:00", "crawled": "2015-07-09T17:17:40.000+03:00", "highlightTitle": ""}