{"organizations": [], "uuid": "e58dd4702f105f834dffaf107278c3cc870736b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/22/moldova-politics-idUSL5N1021I120150722", "country": "US", "title": "Troubled Moldova edges towards formation of new pro-Europe government", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Troubled Moldova edges towards formation of new pro-Europe government | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T13:58:00.000+03:00", "replies_count": 0, "uuid": "e58dd4702f105f834dffaf107278c3cc870736b7"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/22/moldova-politics-idUSL5N1021I120150722", "ord_in_thread": 0, "title": "Troubled Moldova edges towards formation of new pro-Europe government", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Country in turmoil after $1 billion goes missing from banks\n* Prime minister Gaburici resigned in mid-June\n* Instability holding up agreement with IMF, EU funding\nBy Alexander Tanas\nCHISINAU, July 22 (Reuters) - Three pro-Europe Moldovan parties announced on Wednesday they had agreed to form a new ruling coalition to produce a government to pilot the country towards integration with the European Union and unlock fresh foreign funding.\nThe small ex-Soviet state, sandwiched between Ukraine and EU member Romania, has been in turmoil after a banking scandal involving the disappearance of $1 billion from the banking system and the resignation of Prime Minister Chiril Gaburici in June.\nA statement said the Liberal-Democratic Party of former prime minister Vlad Filat, the Democratic party and the Liberal party had agreed in the early hours on Wednesday to form a new coalition dedicated to European integration.\nBut with only 52 seats in the 101-seat parliament, the three parties have only a slender majority in a country where a considerable part of the 3.5 million population is Russian-speaking, many of whom favour closer economic ties with Moscow.\nMoldova's political instability has held up agreement on a new programme with the International Monetary Fund which has in turn blocked disbursement of EU budgetary support.\nThe first task of the new coalition will be to decide on a prime minister. Filat led the government from September 2009 but was forced from office in March 2013 following charges that his government had been involved in corruption.\nActing prime minister Natalia Gherman, who also doubles as foreign minister, may be asked to stay on though Education Minister Maia Sandu also is a possibility, commentators said.\nAnother pressing task for any new government will be to trace the $1 billion - equivalent to one eighth of Moldovan gross domestic product - which disappeared from three of the country's largest banks, bringing thousands of people onto the streets of the capital in protest.\nLiberal party leader Mihai Ghimpu, one of the three coalition leaders, reiterated on Wednesday that finding the missing cash should be given top priority by any new government.\nMoldova embarked on a pro-Europe course in 2009, after years of communist rule, despite relying hugely on Russian energy supplies and the presence of a pro-Russia self-proclaimed statelet called Transdniestria within its borders.\nBut economic mismanagement and a failure to tackle corruption has kept nostalgia for Soviet times high among large section of the population.\nGaburici himself stepped down in June after his educational credentials were challenged by the opposition.\nEconomic turbulence in Russia, Moldova's main trading partner, has hit the pace of Moldova's growth in 2015 while Russian involvement in the separatist conflict in neighbouring Ukraine has brought further concern to its pro-EU leaders. (Writing By Richard Balmforth; Editing by Dominic Evans )", "external_links": [], "published": "2015-07-22T13:58:00.000+03:00", "crawled": "2015-07-22T13:06:50.009+03:00", "highlightTitle": ""}