{"organizations": [], "uuid": "95dc0200f66ce9318299a9e805183e66be6d95e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-17/electrolux-second-quarter-earnings-exceed-analysts-estimates", "country": "US", "title": "Electrolux Profit Beats Estimates on European Cost-Cutting", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Electrolux Profit Beats Estimates on European Cost-Cutting - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T14:14:00.000+03:00", "replies_count": 0, "uuid": "95dc0200f66ce9318299a9e805183e66be6d95e0"}, "author": "Katarina Gustafsson", "url": "http://www.bloomberg.com/news/articles/2015-07-17/electrolux-second-quarter-earnings-exceed-analysts-estimates", "ord_in_thread": 0, "title": "Electrolux Profit Beats Estimates on European Cost-Cutting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Electrolux AB reported second-quarter profit that beat analysts’ estimates as Europe’s biggest maker of appliances cut costs in its home region, bringing the business there back to profit.\nOperating income rose to 921 million kronor ($108 million) in the three months through June, the Stockholm-based company said in a statement Friday. The average of 11 analyst estimates compiled by Bloomberg was for 800 million kronor. The stock rose as much as 6.4 percent.\nChief Executive Officer Keith McLoughlin has turned around the European business as the company has reduced total staff by more than 2,000 since 2014. Now he’s racing to win a legal battle against the U.S. Justice Department to save his plans for Electrolux to buy General Electric Co.’s appliances unit by year-end.\n“If the proposed deal in the U.S. is stopped, it’s crucial that the underlying turnaround in Europe continues,” analyst Fredrik Nilhov at Swedbank wrote in a note ahead of the results.\nThe stock traded 5.9 percent higher at 268.30 kronor as of 9:01 a.m. in Stockholm.\nEuropean Resurgence Electrolux’s European business swung to operating profit of 426 million kronor from a loss of 901 million kronor a year ago after the appliance maker took efficiency measures and cut jobs in that region. Electrolux benefited from increased sales of its premium brands as well as built-in kitchen products.\nThe maker of Frigidaire and AEG appliances reiterated it estimates the North American market for home appliances will grow 3 percent to 5 percent this year while the European market is seen growing 1 percent to 2 percent.\nSales sales increased 19 percent to 31.4 billion kronor in the quarter, compared with the 29.4 billion analysts anticipated. First-quarter growth had been 14 percent.\nElectrolux reiterated it aims to complete the acquisition of the General Electric unit by year-end. The DoJ says the purchase would harm competition by reducing the number of major suppliers of cooking appliances to U.S. home builders to two from three.\n“Electrolux does not agree with the DOJ’s assessment that the acquisition will harm competition and will vigorously contest this effort by the DOJ to oppose the transaction,” McLoughlin said in a statement.", "external_links": [], "published": "2015-07-17T14:14:00.000+03:00", "crawled": "2015-07-17T10:12:39.000+03:00", "highlightTitle": ""}