{"organizations": [], "uuid": "d6cd2b92f0e66de16e2d128f840f49cbd1eb52f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance-commerce.com", "main_image": "http://finance-commerce.com/files/2015/07/Fed-200x200.jpg", "site_section": "http://finance-commerce.com/feed/", "section_title": "Finance & Commerce", "url": "http://finance-commerce.com/2015/07/fed-holds-steady-on-rates-seeks-further-economic-gains/", "country": "US", "title": "Fed holds steady on rates, seeks further economic gains", "performance_score": 0, "site": "finance-commerce.com", "participants_count": 1, "title_full": "Fed holds steady on rates, seeks further economic gains", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T22:43:00.000+03:00", "replies_count": 0, "uuid": "d6cd2b92f0e66de16e2d128f840f49cbd1eb52f6"}, "author": "The Associated Press", "url": "http://finance-commerce.com/2015/07/fed-holds-steady-on-rates-seeks-further-economic-gains/", "ord_in_thread": 0, "title": "Fed holds steady on rates, seeks further economic gains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apartment Sales Tracker Home / Nation & World / Fed holds steady on rates, seeks further economic gains Federal Reserve Chair Janet Yellen has stressed that any interest rate increase will be driven by the latest economic data. (AP file photo) Fed holds steady on rates, seeks further economic gains By: The Associated Press July 29, 2015 2:43 pm 0 \nWASHINGTON — The Federal Reserve appears on track to raise interest rates later this year but signaled Wednesday that it wants to see further economic gains and higher inflation before doing so. \nA statement from the Fed after its latest policy meeting provided no timetable. Many analysts foresee the first hike in September, though Fed Chair Janet Yellen has stressed that any increase will be driven by the latest economic data. \nThe statement noted that the job market, housing and consumer spending have all improved. The Fed still expects inflation to rise gradually toward its 2 percent target. \nWednesday’s statement made only slight changes in the wording of the previous statement in June. But the few modifications suggested a healthier economy. \nDescribing the job market, the Fed for the first time pointed to “solid” job gains and declining unemployment. The unemployment rate has reached a seven-year low of 5.3 percent. \nIn addition, the Fed said it needs to see only “some further” improvement in hiring, rather than the “further” improvement it said last time — a hint that the job market is nearing full health. \nMichael Hanson, an economist at Bank of America Merrill Lynch, said the Fed’s more upbeat language on the job market suggests that policymakers are nearing the point where they will raise rates. He expects that to occur in September. \nYellen has stressed that when the Fed begins to raise rates, it will do so only gradually. The idea is to avoid weakening an economy that’s still benefiting from low borrowing rates resulting from the Fed’s policies. She has suggested that raising rates in small increments, followed by pauses, will let the Fed assess the effects of slightly higher borrowing costs. \nThe Fed has kept its key short-term rate at a record low near zero since 2008. Once it raises it, other rates — for mortgages, auto loans and corporate borrowing — could rise, too. \nDuring Yellen’s testimony to Congress this month, some Democrats urged her to consider delaying a rate hike given that inflation remains below the Fed’s 2 percent target. The Fed has typically raised rates when it perceives a need to prevent inflation from getting out of control. \n“In my mind, the Fed is very comfortable with a slow, deliberate pace,” said Brian Bethune, an economics professor at Tufts University in Boston. “The Fed doesn’t want to upset the apple cart with any type of market shock that could cause further problems in the global economy whether that is in China or in Europe.” Share this:", "external_links": [], "published": "2015-07-29T22:43:00.000+03:00", "crawled": "2015-07-29T22:47:18.133+03:00", "highlightTitle": ""}