{"organizations": [], "uuid": "8d8753abf18379b3c849a432008965f7e449d4da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-mortgages/?format=rss", "section_title": "Mortgages News | Headlines - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/santander-rakes-current-account-customers-104332861.html", "country": "GB", "title": "Santander rakes in current account customers, but mortgage growth dips", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Santander rakes in current account customers, but mortgage growth dips", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T13:43:00.000+03:00", "replies_count": 0, "uuid": "8d8753abf18379b3c849a432008965f7e449d4da"}, "author": "", "url": "https://uk.finance.yahoo.com/news/santander-rakes-current-account-customers-104332861.html", "ord_in_thread": 0, "title": "Santander rakes in current account customers, but mortgage growth dips", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 30, 2015, 14:57 BST - UK Markets close in 1 hr 33 mins Santander rakes in current account customers, but mortgage growth dips By Tim Wallace | Telegraph – 3 hours ago 10,425.00 +75.00 \nStrong economic growth in the UK boosted demand from business customers, while losses from bad loans shrank \nSantander UK (LSE: 44RS.L - news ) ’s profits have surged as strong demand for business loans and current accounts offset a slowdown in mortgage lending. \nThe healthy results mean the UK provided more profit to Spain-based Santander Group than any other country, outstripping operations in Brazil and even in Santander’s home market. \nProfits at the bank's UK arm reached £753m in the first half of the year, rising 18pc on the same period of 2014 , as business lending increased by a net £1.8bn to £25.7bn, and customer deposit levels rose by 4pc. \nSantander continued to attract customers to its 123-branded current account, with 1.3 million new users signing up to the service over the past 12 months, bringing the total to 4.3 million. \nMeanwhile, loan loss provisions plunged 60pc, helping to drive profit growth. \nHowever, mortgage lending volumes fell amid uncertainty over the outcome of the general election in May. Gross new mortgage lending totalled £11.9bn in the first half of 2015, down from £12.8bn in the same period of 2014. \nSantander has also increased some mortgage interest rates this month in anticipation of the Bank of England increasing the base rate. \n\"Applications continued to be strong in the second quarter, but those won't come through for two to three months,\" said UK chief Nathan Bostock. \n\"We’re seeing overall housing price growth come down, probably more likely to 4pc on average for this year, down from 7pc to 8pc. But there is positive interest, post-election.\" \nThe British arm of Santander has long been considering a stock market listing, but plans to go public have yet to materialise. \nUK finance director Stephen Jones, who joined Santander specifically to oversee a stock market debut, announced his resignation this week , after the flotation appeared to have been postponed. \nMr Bostock confirmed on Thursday that a listing is not yet on the cards. \n\"It continues to be a medium-term objective, and we will continue to build the business and franchise to put the bank in the best shape possible for whenever the decision might be made,\" he said, adding that he does not expect an initial public offering in the next two years. \nThe overall Santander Group made a profit of €3.4bn in the six-month period, up 24pc on the same period last year. \nLending volumes climbed 13pc, while revenues increased by 12pc to €23.1bn. However, changes to foreign exchange rates and higher staff costs meant operating expenses crept up by 10.8pc. \nThe bank’s shares fell 1.6pc in early trading on Thursday.", "external_links": [], "published": "2015-07-30T13:43:00.000+03:00", "crawled": "2015-07-30T16:58:31.489+03:00", "highlightTitle": ""}