{"organizations": [], "uuid": "8eebaaf67b2542b016bb7b8aeeab14e1e6ca3216", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/08/19/100972021-PinkParis.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss/rss.html", "section_title": "Finance", "url": "http://www.cnbc.com/id/102814994", "country": "US", "title": "Why Europe’s City of Love could gain from Brexit", "performance_score": 0, "site": "cnbc.com", "participants_count": 2, "title_full": "Why Europe’s City of Love could gain from Brexit", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 1, "uuid": "540047a912b93484486185880bf71705c0dda475"}, "author": "Katy Barnato", "url": "http://www.cnbc.com/id/102814994#post-0", "ord_in_thread": 0, "title": "Why Europe’s City of Love could gain from Brexit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paris would \"have a card to play\" as a new European financial hub should Britons vote to quit the 28-country union, leading players in the city's financial scene told CNBC.\nAndrea Zanchi | E+ | Getty Images Both the CEO of Euronext Paris and the chief executive of Societe Generale said Tuesday that the French capital—better known for romance, Michelin-starred cuisine and the Eiffel Tower—could gain as a European financial hub in the event of a \"Brexit.\"\n\"Whatever happens, the world will be different after the U.K. referendum,\" Anthony Attia, CEO of Euronext France, told CNBC on Tuesday from Paris.\n\"France has strong assets; we have the CAC 40 companies; we have a strong pool of high-growth (small and medium-sized enterprises) that are being valued by all sorts of investors, so I think we have a card to play there.\"\nThe Greek situation is causing volatility: CEO\nAnthony Attia, CEO of Euronext Paris, talks about the impact of Greece on bond markets and IPOs.\nHistorically, Paris has rivaled Germany's Frankfurt as the financial hub of mainland Europe, but both are dwarfed in terms of global influence by the City of London.\nHowever, the Conservative government in the U.K. has promised a referendum on membership of the political and economic European Union by 2017. Should traditionally \"Euroskeptic\" Britons vote to leave, a Brexit could knock confidence in London as a home of global trade.\nSociete Generale CEO Frederic Oudea said that a Brexit would be bad for Europe overall, given the need to compete with powerhouses like the U.K. and China—but that Paris itself could be a beneficiary.\n\"I think that certainly Paris would have a card to play,\" he told CNBC from Paris.\n\"If we were to look at the euro zone, itself, Europe without the U.K.—of course Paris could try to take advantage of it, in terms of its development.\"\nGreece can keep the euro if it plays by the rules: SocGen CEO\nFrédéric Oudéa, CEO of Société Générale, talks about the possible impact of a Grexit on the markets.\nIn recent months, major U.K. banks Standard Chartered and HSBC have warned that they might opt to re-domicile outside of the country, citing the risk of a Brexit and the tightening banking regulatory regime, which could put the U.K. on more of a par with the rest of Europe.\nSwitzerland's Credit Suisse and the Netherlands' ING have also warned they might reduce their presence in London for the same reasons.\nDescribing the attractions of finance in Paris, Oudea said: \"In Paris, we have concentrated a series of players. We have on the one hand, strong banks, strong intermediaries; we have a strong asset management industry—as far as I know, just behind the U.K.—but well organized. So there is a critical mass in terms of talent, technology and I think we could have definitely a good card to play.\"", "external_links": [], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T20:17:23.000+03:00", "highlightTitle": ""}