{"organizations": [], "uuid": "abfb0bc613dcd44f6d329632adae4dbf6ce69add", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/d/h/c/y/image.related.afrArticleLead.620x365.giezl4.png/1437109744364.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/opinion/columnists/how-to-revive-australias-growth-in-a-global-slowdown-20150719-giezl4", "country": "AU", "title": "How to revive Australia's growth in a global slowdown", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How to revive Australia's growth in a global slowdown | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T22:00:00.000+03:00", "replies_count": 0, "uuid": "abfb0bc613dcd44f6d329632adae4dbf6ce69add"}, "author": "Alan Mitchell", "url": "http://www.afr.com/opinion/columnists/how-to-revive-australias-growth-in-a-global-slowdown-20150719-giezl4", "ord_in_thread": 0, "title": "How to revive Australia's growth in a global slowdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Global productivity growth was slowing even before the global financial crisis. Reuters by Alan Mitchell Don't underestimate the potential challenge facing Australia.\nThe global economy's disappointingly slow recovery from the 2008 global crisis reflects a more persistent problem: a structural decline in productivity growth that began well before the crisis.\nThis pre-crisis decline of productivity growth in the United States and other advanced economies generally is attributed to a natural slowdown after a period of very strong growth due to innovations in information technology.\nHowever, there is less agreement about what will happen to productivity growth in the future. For example, the eminent US economist Robert Gordon argues that the slowdown is permanent, while others maintain that the IT revolution still has a good way to go.\nUnfortunately, business can't delay its big strategic investment decisions until the economic argument is settled. Nor can governments that have to plan and invest for a decade or more ahead.\nAustralia is a case in point. With the terms of trade declining to more sustainable levels, average real per capita national income growth is expected to halve to around 1 per cent a year over the next decade.\nTo maintain the per capita income growth of the past decade and a half, Australia would need unprecedented sustained productivity growth of 2.75 per cent a year.\nThat's why business is rightly agitated about economic reform. Australia needs to lift its productivity growth as much as possible if it wants to keep enjoying anything like the growth in living standards we have all come to accept as the norm.\n But a slowdown in global productivity growth presents a big challenge. It's harder to boost our productivity growth when the global demand for our exports is growing more slowly.\nAustralia also imports a lot of its innovation by copying new techniques developed abroad and importing the technological advances embodied in new capital equipment.\nSlower global productivity growth means there will be less innovation to import.\nFuture of productivity To help governments navigate this more challenging environment, the Organisation for Economic Co-operation and Development has produced a groundbreaking study, The Future of Productivity.\nFortunately, the outlook need not be as grim as it seems if governments are willing to get on with economic reform.\nAccording to the OECD economists, the main source of the productivity slowdown is not a slowing of innovation by the most globally advanced businesses. Rather, it is a slowing of the pace at which these innovations spread throughout the global economy. They call it the \"breakdown of the diffusion machine\".\nSo what can governments do to accelerate the diffusion of new ideas coming out of the most innovative businesses?\nThe OECD says they can fund more basic research, which generates large positive \"spillovers\" for industry, but which cannot earn a commercial rate of return and therefore depends on public funding.\nAnd, going one step further, they can increase the international co-ordination of assistance for basic research and commercial research and development. They can get more bang for their global R&D buck.\nThey also can promote trade openness, the participation by their industries in global value chains and the international mobility of skilled workers. Rising participation in global value chains, the OECD says, magnifies the benefits of lifting barriers to international trade and of easing services regulation.\nAt the same time governments can ensure the efficient working of product, labour and risk capital markets, and that their policies and laws don't get in the way of innovative businesses that are trying to achieve economies of scale by entering global markets and adopting innovations from overseas.\nGovernments must ensure a competitive and open business environment. They must minimise the barriers to entry of new businesses and the exit of unsuccessful ones, and remove impediments to labour mobility and skill acquisition. These impediments include taxes on buying property, stringent planning regulations, inefficient vocational training and insufficient funding for life-long learning.\nAny of this sound familiar?\nAustralian business will hardly need persuading. Nor can the major political parties plead ignorance. The government is edging nervously towards tax reform, has reports urging reform in competition policy and the finance sector, and will soon have a challenging report on industrial relations. At the same time, the Federal Parliament is arguing about the reform of universities, and there is a growing debate about the relative merits of unilateral trade reform and so-called free trade agreements. The challenge is to translate all this into serious action.\nThat's why business has swung behind the economic reform summit planned for next month by The Australian Financial Review and The Australian newspapers.\nWhat we have to do now is get the politicians up to the mark.\n****\nReserve Bank governor Glenn Stevens will address the Australian Business Economists and the Anika Foundation on current issues in economic policy on Wednesday in Sydney. Bookings: abe.org.au", "external_links": [], "published": "2015-07-19T22:00:00.000+03:00", "crawled": "2015-07-20T04:11:30.408+03:00", "highlightTitle": ""}