{"organizations": [], "uuid": "22e3ca20cc0b82c2dd8b7807cc54d297ccbd33a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/MAakQMFtJXYfmZUnea79yQ--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/3b6fd34885cddfd3ef8040f8ff62768ad3f3d46a_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/asian-markets-mostly-higher-wall-030949930.html", "country": "GB", "title": "Asian markets mostly higher after Wall St gains", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Asian markets mostly higher after Wall St gains", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T06:09:00.000+03:00", "replies_count": 0, "uuid": "22e3ca20cc0b82c2dd8b7807cc54d297ccbd33a3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/asian-markets-mostly-higher-wall-030949930.html", "ord_in_thread": 0, "title": "Asian markets mostly higher after Wall St gains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 30, 2015, 04:36 BST - UK Markets open in 3 hrs 24 mins Asian markets mostly higher after Wall St gains AFP – 27 minutes ago View Photo \n\nAsian markets mostly rose Thursday, tracking a second straight rally in New York, while the dollar also pushed higher after the Federal Reserve upgraded its outlook on the US economy. \nWith the mood on global markets a little more upbeat than at the start of the week, oil prices edged up although concerns over a supply glut are keeping a lid on rises. \nTokyo jumped 1.05 percent as the yen weakened against the greenback, while Hong Kong added 0.77 percent, Sydney climbed 0.58 percent and Shanghai was 0.10 percent higher. \nSeoul dropped 0.73 percent, hurt by selling in heavyweight Samsung Electronics after it reported disappointing earnings. \nAfter a two-day policy meeting, the Fed said in a statement that the world's top economy had expanded \"moderately\" in recent months and the jobs market had strengthened, but it noted continued \"soft\" business investment and exports. \nIt also said inflation was below target, though it put much of that down to falling energy prices and to cheaper imports caused by the strong dollar. \nWhile it gave no more clues about its plans for raising interest rates, analysts said the wording suggested September was now a strong possibility for a rate rise. \nOn Wall Street, the Dow rose 0.69 percent, the S&P 500 gained 0.73 percent and the Nasdaq advanced 0.44 percent. The gains were the second in a row after US stocks suffered a five-day losing streak. \n\"The Fed statement was similar to the last and it was a very modest upgrade to previous language,\" said Raiko Shareef, a markets strategist at Bank of New Zealand in Wellington. \n- Samsung woes - \n\"That will make the two following employment reports we get more important, and strong results would support our view of a September liftoff,\" Shareef told Bloomberg News. \nAnd economist Chris Low of FTN Financial added that minor changes in the language showed only that \"the past six weeks data pushed the (policy committee) a little closer to raising rates\". \n\"But they are still waiting for more good news before they actually pull the trigger,\" he said. \nThe chances of an earlier rate rise lifted the dollar. In early Tokyo trade it fetched 124.18 yen, compared with 123.91 yen in New York. \nThe euro bought $1.0970 and 136.12 yen against $1.0990 and 136.19 yen in US trade. \nSeoul was dragged down by Samsung, which tumbled 2.85 percent in morning trade after releasing second-quarter earnings showing net profit dropped 8.0 percent owing to weak sales of its flagship S6 smartphone. \nThe firm has now seen its net profit decline for five straight quarters year-on-year, mainly due to heightened competition in an increasingly saturated smartphone market that it had dominated for years. \nIn oil trade US benchmark West Texas Intermediate for September delivery rose 18 cents to $48.97 and Brent crude for September jumped 34 cents to $53.72. \nPrices rallied Wednesday after data showed an unexpected weekly fall in US crude inventories. The figures provide some respite for dealers after a recent sell-off, although the black gold remains beaten down by fears over a global share glut, a strong dollar, an expected flood of Iranian crude at the end of the year and weak demand. \nGold fetched $1,096.88 an ounce compared with $1,096.20 late Wednesday.", "external_links": [], "published": "2015-07-30T06:09:00.000+03:00", "crawled": "2015-07-30T06:39:14.264+03:00", "highlightTitle": ""}