{"organizations": [], "uuid": "feadf542a246d39d2890fd24bcf16a0c2d0c4478", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/images/print-edition/20150725_FND002_0.jpg", "site_section": "http://www.economist.com/rss/finance_and_economics_rss.xml", "section_title": "The Economist: Finance and economics", "url": "http://www.economist.com/news/finance-and-economics/21659715-world-trade-organisation-draws-close-its-first-deal-nearly-two?fsrc=rss%7Cfec", "country": "US", "title": "Bargaining chips", "performance_score": 0, "site": "economist.com", "participants_count": 0, "title_full": "Bargaining chips", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T17:47:00.000+03:00", "replies_count": 0, "uuid": "feadf542a246d39d2890fd24bcf16a0c2d0c4478"}, "author": "", "url": "http://www.economist.com/news/finance-and-economics/21659715-world-trade-organisation-draws-close-its-first-deal-nearly-two?fsrc=rss%7Cfec", "ord_in_thread": 0, "title": "Bargaining chips", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprints \nITA-II is the first big WTO trade deal since the original ITA and has been haggled over for three years. The slowness of progress was largely due to China, Japan, Taiwan and South Korea fighting over the inclusion of goods produced by infant industries they had been protecting from international competition. India stayed away from the talks altogether, citing the impact that the first ITA had on its fledgling electronics sector. China left early on, worried that South Korean flat-screen TVs and Japanese car radios would outcompete its domestic firms. \nThe final push for ITA-II came last November, when China agreed its own bilateral extension of the ITA with America, spurring the rest of the WTO to finish its deal. China, which has rejoined the deal, has been building up its domestic computer-chip industry for at least 15 years. In 2013 it imported more than $230 billion-worth of materials for its semiconductor industry—more than it spent on oil. \nThe deal is likely to save $13.8 billion a year in tariff payments on the $1.3 trillion global trade in electronic goods, says the WTO. Removing tariffs will open up new markets, particularly China, which has the highest levies on such goods. Tariffs on semiconductors, used in electronic circuits, are as high as 25% in some countries. Although the precise effects of the deal have not yet been studied, it will increase trade in electronics between East Asia, Europe and North America. All three regions both import and export large amounts of electronics—the EU exports €82 billion ($90 billion) and imports €68 billion. \nFew African or South American countries participated in the negotiations, but the WTO believes that all will benefit. More trade should be good news for a global electronics supply chain that buys materials and labour from around the world. As tariffs fall on inputs like semiconductors, the rest of the developing world ought to enjoy cheaper finished electronic goods, which could very well speed innovation at home. High-tech industries played a big part in the South Korean and Taiwanese development miracles. These took place behind tariff barriers, however. Whether those developing countries that adopt ITA-II can advance without such shelter is unclear.", "external_links": [], "published": "2015-07-23T17:47:00.000+03:00", "crawled": "2015-07-23T23:33:39.769+03:00", "highlightTitle": ""}