{"organizations": [], "uuid": "b5702f71b9118097ac497481dd9598bb2cf2fa73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/5-things-know-palm-oil-183300046.html", "country": "US", "title": "5 Things to Know About Palm Oil", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "5 Things to Know About Palm Oil", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T21:33:00.000+03:00", "replies_count": 0, "uuid": "b5702f71b9118097ac497481dd9598bb2cf2fa73"}, "author": "", "url": "https://uk.finance.yahoo.com/news/5-things-know-palm-oil-183300046.html", "ord_in_thread": 0, "title": "5 Things to Know About Palm Oil", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Jul 26, 2015, 20:43 BST - UK Markets closed 5 Things to Know About Palm Oil The Wall Street Journal – 1 hour 10 minutes ago Print Palm oil is a cheap and widely consumed vegetable oil. Controversy has surrounded the palm-oil industry, even as demand for the oil has surged in recent years, as explained in a Wall Street Journal article. Here are five things to know about palm oil and its issues. \n#1: What Is Palm Oil? \nThe oil, extracted from the pulp and seed of the palm fruit, is the most widely used vegetable oil in the world, with consumption increasing tenfold since 1980. Palm oil and its derivatives are used for food products, detergents, cosmetics and biofuel. Roughly half of packaged products in supermarkets world-wide now contain palm oil or a derivative. \n#2: Where Is It Produced? \nAlthough native to West Africa, the oil palm tree is grown commercially in several tropical countries. Indonesia and Malaysia dominate production, together accounting for 85% of global supply. The oil is bought in bulk by large commodities traders such as Cargill Inc., which resells the oil to multinational companies such as Nestlé SA and Procter & Gamble Co. \n#3: Why Is Palm Oil So Popular? \nPalm oil has a long shelf life, which makes it ideal for baked goods and as a frying fat in the snack industry. The growth of palm oil in the U.S. was fueled in part by a 2006 order by the U.S. Food and Drug Administration to label trans fats in foods, prompting snack companies to look for alternatives. \n#4: What Are the Controversies Surrounding Palm Oil? \nPalm oil has been repeatedly named on the U.S. Department of Labor’s list of industries that involve forced and child labor, most recently in 2014. Activists have blamed palm-oil plantations in Indonesia and Malaysia for large-scale deforestation and human-rights abuses. Oil palm growers respond that the palm tree, a high-yield crop, is a useful tool for socioeconomic development. \n#5: What Efforts Are There to Address These Issues? \nAfter years of campaigning by environmental and human-rights groups, large palm-oil companies and multinational buyers have pledged to make the supply chain transparent and accountable. The Roundtable on Sustainable Palm Oil, the best-known certification scheme, says 20% of the world’s palm-oil production was certified sustainable in 2014, up from just 7% in 2010. Activists say certification standards ought to be tightened. More from The Wall Street Journal", "external_links": [], "published": "2015-07-26T21:33:00.000+03:00", "crawled": "2015-07-26T22:43:40.512+03:00", "highlightTitle": ""}