{"organizations": [], "uuid": "c3a8b9ca18150b848499fc201a92de55ae79dc29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/e/7/q/a/image.related.articleLeadwide.620x349.gie6b9.png/1437048154955.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/25/consumer-discretionary", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/property/brisbane-unit-approvals-skyrocket-20150716-gie6b9.html", "country": "AU", "title": "Brisbane unit approvals skyrocket", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Brisbane unit approvals skyrocket", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "c3a8b9ca18150b848499fc201a92de55ae79dc29"}, "author": "", "url": "http://www.smh.com.au/business/property/brisbane-unit-approvals-skyrocket-20150716-gie6b9.html", "ord_in_thread": 0, "title": "Brisbane unit approvals skyrocket", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Artists impression of Mirvac's Art House in South Brisbane. Photo: supplied\nUnit approvals in Brisbane have almost have almost tripled in two years, with analysts pointing to a shift in expectation as the Australian dream of a big backyard increasingly made way for affordability and convenience.\nDwelling approvals for units in Brisbane grew from 3398 in 2012-13 to 11,028 in the 12 months to May this year, an increase of 224.54 per cent.\nAccording to this week's Queensland budget documents, overall dwelling investment grew 4.8 per cent in 2013-14, which was the first increase in six years.\nThis chart from the 2015-16 Queensland budget papers shows the massive increase in unit development. Photo: Queensland Treasury\n\"This recovery accelerated in 2014-15, supported by record low interest rates and increased activity by investors,\" the 2015-16 budget paper two notes .\nAdvertisement \"However, unlike previous growth phases in Queensland, investment in new dwellings is being driven by strong demand for the construction of medium-to-high density dwellings (flats, units or apartments), particularly in inner-city Brisbane.\"\nWhile there was also growth in detached houses, it was just a 32.34 per cent increase from 2520 in 2012-13 to 3335 last financial year.\nMaster Builders deputy executive director Paul Bidwell said it was a sign the \"Australian dream\" of a multi-bedroom home on a 200 square-metre block of land was shifting.\n\"Gone are the days where, in Queensland, it was predominantly detached housing being built,\" he said.\n\"But if we build 40,000 new dwellings a year, it's going to take a long time, with 2 million dwellings in Queensland, before we start to even it up.\n\"There's no fundamental shift in our housing stock, but we're seeing the start of that shift.\"\nMr Bidwell said that was down mainly to demographic shifts and affordability.\n\"For people with young families, our sense is they're still aspiring to that backyard, but that backyard is going to be smaller,\" he said.\n\"It becomes a trade-off for them. Do they go out to the western corridor, or do they go into a unit?\n\"For the single or two-person households, or the older people, they might not want that Australian dream.\n\"They want to be close to the city, close to work and close to all the things they're interested in.\"\nPlace Advisory director Lachlan Walker said new apartments in Brisbane were \"pretty much non-existent\" in the marketplace five years ago.\nMr Walker said that changed in mid-2010, when Devine's Hamilton Harbour project came on to the market.\n\"It went ballistic. It rocked and rolled and they did a fantastic job and got great results,\" he said.\n\"What flowed on from that was that everybody who had a site underfoot reconfigured it from commercial or high-end residential to one- or two-bedroom apartments for the investor, designed for people to buy into cheaply.\"\nMr Walker said he was unconcerned, in the main, that the current rate of unit approvals would result in market oversupply.\n\"I hear the supply argument and I disagree with it at this point in time,\" he said.\n\"Our pipeline's always been pretty big in Brisbane; we've currently got 24,000 apartments that could be delivered in the inner-Brisbane ring in the next 10 years.\n\"Realistically, that's never going to happen. I could, today, put a line through 50 per cent of those DAs and say 'the people who own that site don't have the capacity to deliver it'.\n\"They don't have the balance sheet, but they've gone out to get the DA to add value to the land so they can sell it off for three times the money.\"\nHowever, Mr Walker said the marker was getting to a point of oversupply in one- and two-bedroom stock in areas such as Newstead, Teneriffe, Albion, Hamilton and South Brisbane.\nWhile Brisbane has gone gangbusters, at the same time there has been a marked decrease across all dwelling types in the mining regions.\n\"Looking ahead, investor interest in Queensland is expected to strengthen as house prices are comparatively low compared to major southern states,\" the budget document notes.\n\"Recent large gains in Sydney house prices will prompt interstate and overseas investors to seek more attractive rental yields.\n\"As a result, dwelling investment is forecast to continue to grow at a robust rate in 2015-16 and then moderate as the RBA moves towards a more neutral monetary setting.\"\nCommSec economist Savanth Sebastian said the housing sector was set to be one of the leading lights in a Queensland economy struggling with declining business investment .\n\"What can be done from a macro perspective? Well, rates are already super low and will help to support some of the strength in terms of homebuilding and I think this week's dwelling commencement numbers highlighted that to some degree,\" he said.\n\"Dwelling commencements in Queensland are about 17 per cent above their decade average, so that's one area of positivity and I think, if you look at it, commencements are probably going back to their best levels since September '08.\"\nComment was sought from Brisbane City Council development assessment chairman Amanda Cooper.", "external_links": ["http://www.budget.qld.gov.au/budget-papers/documents/bp2-2-2015-16.pdf"], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T20:47:56.000+03:00", "highlightTitle": ""}