{"organizations": [], "uuid": "e18029fee32166237924fd03b6a04ae640e4c677", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/0/g/j/3/image.related.afrArticleLead.620x365.gi1tgu.png/1436070058965.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/lifestyle/arts-and-entertainment/film-and-tv/movie-reviews-amy-the-mafia-only-kills-in-summer-20150703-gi1tgu", "country": "AU", "title": "Movie reviews: Amy, The Mafia Only Kills In Summer", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Movie reviews: Amy, The Mafia Only Kills In Summer | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T22:15:00.000+03:00", "replies_count": 0, "uuid": "e18029fee32166237924fd03b6a04ae640e4c677"}, "author": "Post to Linkedin", "url": "http://www.afr.com/lifestyle/arts-and-entertainment/film-and-tv/movie-reviews-amy-the-mafia-only-kills-in-summer-20150703-gi1tgu", "ord_in_thread": 0, "title": "Movie reviews: Amy, The Mafia Only Kills In Summer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amy Winehouse in July 2007: she wore eye makeup not seen since Cleopatra and was, according to Tony Bennett in the new documentary, Amy, 'the truest natural jazz singer I've ever heard'. by John McDonald There is a terrible sense of inevitability about Amy . We know where the story is going before it gets started but this doesn't lessen the morbid fascination of Amy Winehouse's descent into the abyss.\nWatching Asif Kapadia's documentary is like watching a boxing match where the TKO should have been applied at round six or seven. Instead the punishment continues to the point where it's almost a relief when the heroine finally checks out at the classic rock star age of 27.\nWhat makes the story all the more tragic is that Kapadia spends the first part of the film creating a portrait of a bright, funny, ridiculously talented performer.\nWinehouse was a Jewish girl from North London with an unfashionable love for classic jazz singers and crooners such as Billie Holiday, Sarah Vaughan and Tony Bennett. It ran in the family. Her paternal grandmother had been a singer, while there were jazz musicians on her mother's side of the family.\nArturo (Pierfrancesco Diliberto) and Flora (Cristiana Capotondi) in the daring film, The Mafia Kills Only In Summer. An early home movie shows Winehouse as a precocious 14-year-old, singing Happy Birthday to her friend, Lauren Gilbert, in a manner that already shows a great sense of style. More womanly than her companions, she would never lack boyfriends during her teens. This may have been partly a result of her father, Mitch, leaving the family while she was still a child. In every story of doomed talent the common factor seems to be the absent father.\nMitch Winehouse does not come across well in a film he has been quick to condemn.\nHaving abandoned the family during his daughter's most impressionable years, he returns to capitalise on her stardom. The low point is when he arrives with a camera crew while Amy is in retreat in St Lucia, trying to piece her life back together. Mitch is one of many characters who appear to have been more concerned with using the singer for their own selfish purposes than providing the help she so badly required.\nA need for approval He may bear more responsibility than most because a subtext to Winehouse's career was the constant need to win her father's affection.\nAs he did with Senna (2010), another tale of a doomed popular cultural icon, Kapadia constructs this film as a montage of interviews, archival videos and newsreel footage. There is no narrator, and most of the interviews are conducted off camera, like a commentary on the action as it unfolds on screen.\nIf one can overcome the increasingly sordid details, it is the music that leaves the strongest impression. Winehouse had a unique, distinctive voice, and the kind of charisma that conquers audiences.\nThe self-penned lyrics of Winehouse's songs are mordant and largely autobiographical. Kapadia runs them across the bottom of the frame so we don't miss a word. They are in the grand tradition of the nightclub chanteuse, filled with infidelity, guilt, lost love and recrimination.\nI cheated myself,\nLike I knew I would\nI told you I was trouble,\nYou know that I'm no good\nFor most of this film, Winehouse is better than good. She's brassy, sexy and self-confident, a natural comedienne. She remains close to her school friends, Lauren and Juliette, and has a friendly, supportive manager in Nick Shymansky.\nIn the liner notes to her debut album, Frank (2003), she is shown standing in the kitchen wearing a t-shirt, and playing pool at the pub. By the time of the long-awaited second album, Back to Black (2006), she has become a tattooed vamp with a beehive hair-do, and a line in eye makeup that hadn't been seen since ancient Egypt.\nA bad romance Winehouse had fallen for Blake Fielder-Civil, who is widely believed to have introduced her to heroin and crack. The relationship was distinguished by drug and alcohol binges, and violent fights. The couple were married in 2007 but the downward spiral had begun the moment Fielder-Civil entered the picture. He provided the subject matter for almost every song on Back to Black .\nOne begins to feel that Winehouse could only write about things she had experienced personally, with maximum blood-letting. As well as her addictions to drugs and alcohol she was depressive and bulimic. Love was another self-destructive narcotic.\nAs her fame and popularity increased, the paparazzi swarmed like locusts, with outrageous incidents producing more desirable photos. It's the oldest of showbiz clichés for a star to be destroyed by her own fame, but Winehouse fits the template precisely.\nThe shock-horror moment arrives in 2008, when the singer wins five Grammy Awards. She had been cleaned up in the weeks leading up to the presentations, and looked as if she were back to her best. In the moment of triumph Winehouse sees an old schoolfriend in the audience, drags her off to the side of the stage and whispers: \"It's just so boring without the drugs.\"\nThere was no turning back from that point, although she carried on until July 23, 2011, dying with five times the legal limit of alcohol in her bloodstream. Winehouse's last performance had been the infamous concert in Sarajevo, when she was so stoned she could barely stand, let alone sing. It seems incredible the people around her couldn't see that this gig was out of the question, but the financial pressures involved made them unwilling to accept the truth.\nOne almost wishes Kapadia's own commitment to the truth was a little less exacting.\nThe second half of Amy is a cross between a disaster movie and a murder mystery, in which we struggle to identify the perpetrator. Winehouse may have been the agent of her own destruction but there were dishonourable roles played by the hapless Blake Fielder-Civil, her opportunistic father, her second agent, Raye Cosbert, and others.\nThe only figure who makes a late appearance and can leave with his head held high is Tony Bennett, who recorded a series of duets with Winehouse. \"She was,\" he says, \"the truest natural jazz singer I've ever heard.\"\nA recipe for cinematic oblivion? To make a romantic comedy about the depredations of the Mafia in Sicily sounds like a recipe for cinematic oblivion. Could this be anything other than a grave error of taste and judgment? It might even prove dangerous if today's crop of crime bosses took offence.\nPierfrancesco Diliberto, better known as Pif, has attempted this feat in his debut as a feature director, winning awards in the process. The Mafia Only Kills in Summer is not simply a romantic comedy; it's also a coming-of-age story set in Palermo. It follows the young Arturo (Alex Bisconti), from the moment of conception to his school days, when he becomes hopelessly infatuated with a pretty blonde girl named Flora (Ginevra Antona).\nIn the second part of the film, the grown-up Arturo is played by Pif himself, who has become a dysfunctional, odd-jobbing reporter. The adult Flora (Cristiana Capotondi) has returned from years in Switzerland as the press secretary for an ambitious politician, and the old spark is reignited. But if Arturo junior is a minor prodigy, the elder version is a klutz who struggles to impress the object of his undying affections.\nThe backdrop to this saga of pre-and-post-pubescent romance is an historically accurate portrait of Palermo, a city wracked by mob violence, as mafia boss, Totò Riina (Antonio Alveario), set about slaughtering rival gangsters, judges and policemen. The movie introduces some of the victims, such as police chiefs, Boris Giuliano and Carlo Alberto Dalla Chiesa, and takes us up to the assassination of Giovanni Falcone, who paid for his successs in bringing criminals to justice.\nDuring Arturo's childhood, everyone seeks to ignore or downplay the regular mob killings. There's always an extenuating factor. One shouldn't be concerned. Besides, as Arturo's father tells him, the Mafia kill only in summer.\nThe gangsters themselves treat murder as a routine form of business, and here Pif's jokes get very dark.\nThe running gag, which must have sent Italian audiences into hysterics, is the young Arturo's veneration for Prime Minister, Giulio Andreotti – a consummate political operator who was given more searching treatment in Paolo Sorrentino's film Il Divo (2008).\nArturo admires Andreotti from a distance, taking his pronouncements at face value and even impersonating him at a school costume party. The fact that Andreotti's links with the Mafia are now so well attested is the comic subtext to Arturo's idolisation. The former PM survived prosecution in 2004 largely because the statute of limitations for his alleged offences had run out.\nPif, who is known in Italy as a TV satirist, performs a miraculous juggling act in getting the crime and politics into a story that teeters always on the brink of farce, with a love motif that would seem corny in any context.\nDespite the presence of the director in the lead role the adult characters are notably less engaging than their childhood counterparts. It is as if all the best writing has been expended on the early part of the story, while the second part hangs on Pif's own persona – so familiar to Italian audiences – and the historical events of the early 1990s, when Sicillians took to the streets in angry protests against the gangsters and their compliant politicians.\nThe Mafia Only Kills in Summer is an impossible beast of a film, but it succeeds in bringing home the gravity of those protests, even as we watch Pif clowning his way through his passion for Flora.\nThose emerging Australian filmmakers who can't seem to find a second dimension could learn a lot from this movie.\nAmy\nWritten & directed by Asif Kapadia\nStarring Amy Winehouse, Nick Shymansky, Lauren Gilbert, Juliette Ashby, Mitch Winehouse, Blake Fielder-Civil, Tony Bennett, Yasiin Bey\nUK, rated MA 15+, 128 mins\nThe Mafia Kills Only in Summer\nDirected by Pif (Pierfrancesco Diliberto)\nWritten by Michele Astori, Pif & Marco Martani\nStarring Pif, Cristiana Capotondi, Alex Bisconti, Ginevra Antona, Claudio Gioè, Barbara Tabita, Rosario Lisma, Antonio Alveario\nItaly, rated M, 90 mins", "external_links": [], "published": "2015-07-03T22:15:00.000+03:00", "crawled": "2015-07-05T08:37:10.000+03:00", "highlightTitle": ""}