{"organizations": ["Ensco"], "uuid": "8eca375a466d27336546185e3e772a59b04a2928", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-businesswire/?format=rss", "section_title": "Finance News | Business Wire - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/ensco-plc-reports-second-quarter-211900061.html", "country": "GB", "title": "Ensco plc Reports Second Quarter 2015 Results", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Ensco plc Reports Second Quarter 2015 Results", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T00:19:00.000+03:00", "replies_count": 0, "uuid": "8eca375a466d27336546185e3e772a59b04a2928"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ensco-plc-reports-second-quarter-211900061.html", "ord_in_thread": 0, "title": "Ensco plc Reports Second Quarter 2015 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 30, 2015, 00:29 BST - UK Markets open in 7 hrs 31 mins Ensco plc Reports Second Quarter 2015 Results Press Release : Ensco plc – 2 hours 10 minutes ago Three-Year Contracts Awarded for ENSCO 110 and ENSCO 104Highgrading Continues with Delivery of Two Ultra-Deepwater DrillshipsStrong Safety Performance \nEnsco plc (NYSE: ESV) today reported earnings of $1.11 per share for second quarter 2015 compared to a loss of $5.07 per share a year ago. The loss from discontinued operations was $0.04 per share compared to a loss of $3.54 per share in second quarter 2014. Earnings from continuing operations were $1.15 per share in second quarter 2015 compared to a loss of $1.53 per share a year ago. \nSeveral items influenced these comparisons: Non-cash impairments of $1.5 billion or $6.47 per share in second quarter 2014: $704 million or $3.02 per share in continuing operations $797 million or $3.45 per share in discontinued operations A loss of $7 million or $0.03 per share included in second quarter 2015 other expense related to a previously announced debt retirement A non-cash impairment in discontinued operations of $7 million or $0.03 per share in second quarter 2015 Gains in discontinued operations on rig sales of $3 million or $0.01 per share in second quarter 2015 and $2 million or $0.01 per share in second quarter 2014 \nExcluding these items, earnings per share from continuing operations were $1.18 compared to $1.49 a year ago, and the loss from discontinued operations improved to $0.02 per share from a loss of $0.10 per share last year. \n“Despite difficult market conditions, we achieved high levels of operational and safety performance including 98% uptime for our jackup rigs and a total recordable incident rate that remains on track to set another record in 2015,” said Chief Executive Officer and President Carl Trowell. “In terms of new business, we earned three-year contracts for two premium jackups — ENSCO 110 and ENSCO 104 — in the Middle East, our largest jackup market. We also recently signed letters of intent for multi-year terms for two jackups in the North Sea, plus a six-month extension for another rig in the region. Newbuild drillships, ENSCO DS-8 and ENSCO DS-9, are also projected to contribute to earnings this year.” \nSecond Quarter Results \nContinuing Operations \nRevenues were $1.059 billion in second quarter 2015 compared to $1.137 billion a year ago primarily due to a year-over-year decline in reported utilization to 76% from 84% a year ago. Also, the average day rate for the fleet declined to $237,000 in second quarter 2015 from $247,000 a year ago. \nContract drilling expense improved to $503 million in second quarter 2015 from $543 million a year ago, as lower compensation and repair and maintenance expense more than offset the reactivation of ENSCO 5004, ENSCO 5005 and ENSCO 5006 following shipyard upgrades and newbuilds commencing contracts. \nThere was no loss on impairment in second quarter 2015. Second quarter 2014 results included a loss on impairment of $704 million related to three floaters. \nDepreciation expense increased to $141 million from $132 million in second quarter 2014 as several rigs were added to the operating fleet. General and administrative expense declined to $30 million in second quarter 2015, from $36 million last year, due to disciplined expense management including lower personnel costs. \nOther expense increased to $55 million from $31 million a year ago. A $7 million loss to complete the previously announced retirement of 3.25% senior notes and other debt maturities contributed to this increase. Interest expense in second quarter 2015 was $51 million, net of $27 million of interest that was capitalized, compared to interest expense of $36 million in second quarter 2014, net of $19 million of interest that was capitalized. Interest expense increased year to year due to previously reported debt offerings of $1.25 billion in third quarter 2014 and $1.10 billion in first quarter 2015. \nThe effective tax rate was 17.5% in second quarter 2015 compared to an adjusted 10.4% a year ago excluding a loss on impairment and other discrete items in continuing operations. The year-to-year comparison was influenced by the mix of earnings from various tax jurisdictions and tax legislation enacted by the U.K. government. \nDiscontinued Operations \nDiscontinued operations include four floaters and two jackups held for sale, as well as rigs and other assets no longer on the Company’s balance sheet. The net loss from discontinued operations was $10 million for second quarter 2015 compared to $818 million a year ago. Second quarter 2015 results included a $7 million loss on impairment to adjust the fair value of a rig held for sale to scrap value. Excluding impairments and rig sales, the net loss from discontinued operations improved to $6 million in second quarter 2015 from $23 million a year ago due to disciplined expense management through proactive cold stacking of rigs held for sale. \nSegment Highlights for Continuing Operations \nFloaters \nFloater revenues were $634 million in second quarter 2015 compared to $680 million in second quarter 2014 primarily due to lower utilization for several floaters in the U.S. Gulf of Mexico that contributed to a decline in the average day rate to $417,000 from $481,000 a year ago. Reported utilization was 76%, unchanged from a year ago. Adjusted for uncontracted rigs and planned downtime, operational utilization was 92%, equal to last year. \nFloater contract drilling expense declined 10% to $278 million in second quarter 2015 from $310 million in second quarter 2014. Lower compensation and repair and maintenance expense more than offset an increase in expenses from reactivating three rigs. \nJackups \nJackup revenues were $384 million compared to $441 million a year ago. The decline was mostly due to fewer operating days for several jackups and the classification of three rigs to the Other segment that were previously sold and are now managed by Ensco on behalf of the buyer. These factors were partially offset by the addition of newbuild jackups ENSCO 121, ENSCO 122 and ENSCO 110 to the active fleet. The average day rate increased to $140,000 from $138,000 a year ago as newbuild, high-specification jackups commenced initial contracts. Reported utilization was 77% compared to 88% in second quarter 2014. Adjusted for uncontracted rigs and planned downtime, operational utilization in second quarter 2015 was 98% compared to 99% a year ago. \nContract drilling expense decreased 13% to $193 million in second quarter 2015. The decline was due in part to lower compensation and repair and maintenance expense, as well as the classification of three jackup rigs to the Other segment as noted above. These items were partially offset by an increase in contract drilling expense from three newbuild jackups. \nOther \nOther is composed of managed drilling rigs. As noted above, three jackups classified to the Other segment increased both revenues and contract drilling expense year to year. Revenues increased to $41 million from $17 million in second quarter 2014. Contract drilling expense increased to $32 million from $12 million a year ago.", "external_links": [], "published": "2015-07-30T00:19:00.000+03:00", "crawled": "2015-07-30T02:33:08.167+03:00", "highlightTitle": ""}