{"organizations": [], "uuid": "b3ed56ec2d702ab242aa75a7e8724d6563c25614", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DO556_Jack_D_ZG_20150622120122.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/analysts-waiting-for-twitters-rollout-of-features-to-simplify-platform-2015-07-29", "country": "US", "title": "Analysts waiting for Twitter’s rollout of features to simplify platform", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "Analysts waiting for Twitter’s rollout of features to simplify platform - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T03:00:00.000+03:00", "replies_count": 1, "uuid": "0823946aa8a8099f411ea1da7938b23c70a1304c"}, "author": "By     Caitlin Huston", "url": "http://www.marketwatch.com/story/analysts-waiting-for-twitters-rollout-of-features-to-simplify-platform-2015-07-29#post-0", "ord_in_thread": 0, "title": "Analysts waiting for Twitter’s rollout of features to simplify platform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Though Twitter beat earnings expectations Tuesday, analysts are cautious as they wait for the rollout and outcome of new features designed to make the platform more understandable and easy to use.\nTwitter TWTR, -14.50% beat profit expectations with earnings per share of 7 cents, excluding one-time items, above the FactSet consensus of 4 cents. It reported sales of $502.4 million, above the consensus of $482 million.\nIt reported a monthly active user growth rate of 12% year-over-year. To combat the weaker growth rate, Twitter executives pointed to the fall launch of Project Lightning , or curated tweet streams, and features like “While You Were Away” that may put the most relevant, rather than recent tweets first.\nHere’s what analysts said:\nNomura analysts:\n“For us, a critical metric is ad revenue per user which at +41% [year-over-year] was above our estimates, but still decelerated for the sixth straight quarter.”\nReiterated neutral rating, reduced price target to $33 from $39.\nSterne Agee:\n“This transition where the focus shifts from “recency” to “relevancy” of content could be tricky if existing users don’t embrace it. We share management’s view that Twitter’s use case remains unclear to the mass market.”\nReiterated neutral rating, no price target.\nJ.P. Morgan:\n“TWTR appears more focused to us than in previous quarters, w/less discussion on logged out users and syndication, and more emphasis on execution. Though we still need to see it in numbers.”\nReiterated overweight rating, reduced price target to $50 from $55.\nCantor Fitzgerald:\n“While uncertainty around user growth in 2H, an integrated marketing campaign this fall and new product launches/enhancements could keep the stock range-bound near-term, we believe that the long-term thesis around Twitter remains intact.”\nReiterated buy rating, $50 price target.\nGoldman Sachs:\n“Management expects similar growth in MAUS until Twitter can reach the mass market, something contingent on improving the user experience and marketing the value proposition of being an engaged Twitter user. While this carries a high degrees of difficulty we do believe the company can accomplish these goals.”\nReiterated buy rating, reduced price target to $49 from $56.\nMore from MarketWatch", "external_links": [], "published": "2015-07-29T03:00:00.000+03:00", "crawled": "2015-07-30T13:06:15.259+03:00", "highlightTitle": ""}