{"organizations": [], "uuid": "e988827a62bc99ac3d02f1e86680124c55e2ece2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/aa3135c1-1723-48af-9fb9-483063bd4bce.img", "site_section": "http://www.ft.com/rss/personal-finance", "section_title": "Personal Finance", "url": "http://www.ft.com/cms/s/0/56a2bb42-1ffd-11e5-ab0f-6bb9974f25d0.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "country": "US", "title": "Living the dream in your self-build home", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Living the dream in your self-build home", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T20:23:00.000+03:00", "replies_count": 0, "uuid": "e988827a62bc99ac3d02f1e86680124c55e2ece2"}, "author": "", "url": "http://www.ft.com/cms/s/0/56a2bb42-1ffd-11e5-ab0f-6bb9974f25d0.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Living the dream in your self-build home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Continue reading \n“One clear advantage is that we were able to build our dream house, containing many bespoke characteristics that we would not have found in something already on the market,” says Mr Elkins, who has spent around £260,000 to date on their three-bedroom, three-storey home on an infill plot on Bristol’s outskirts. \n“But we didn’t just shape the property around our lives and needs, we made sure we maximised our plot value. And at minimised costs, that can really pay off. The house is valued at around £500,000, meaning we’ve already made around 100 per cent profit.” \nAlex Dutton, a sustainability design expert at Barton Willmore, a planning and architecture consultancy says: “There is clearly growing UK consumer demand for the type of aspirational, personalised properties borne from self- or custom-build projects, partly thanks to the popularity of television shows like “Grand Designs” and endorsement by personalities like Kevin McCloud.” “Increasingly, self- and custom-build have huge potential as a viable, cost-effective way into home ownership.” \nThose considering constructing their own home can count on the support of the government . It has thrown its weight behind legislation designed to encourage self- and custom-build, which it believes can help solve the nation’s crippling housing shortage. In their election manifesto, the Conservatives pledged to double — at least — the number of custom-built and self-built homes by 2020. \nThe Self and Custom Build Housing Act 2015, which was implemented this spring, requires local planning authorities in England and Wales to test the demand for self- and custom-build by setting up a register of those looking for land on which to build, and ensuring adequate land provisions are made accordingly over the next five years. ©Bloomberg \nMeanwhile “Right to Build” is a pledge to give those who want to build their own homes in England and Wales the right to buy a plot, alongside a £150m fund to help provide 10,000 serviced plots for custom builders. \nThe first wave of schemes was unveiled last September, with 11 councils sharing £550,000 to invest in projects to create self-build plots and custom-build homes. \n“Whatever your politics, the Conservative majority is good news if you are among the 1m people who say they would like to build their own home over the next five years,” says NaCSBA chairman Michael Holmes. Cost insulation \nPart of the allure for Mr Elkins and Ms Skinner is the use of sustainable building materials , which they say will reduce their running costs to “next to nothing” thanks to the latest insulation techniques and solar panels on their roof. \n“A more energy efficient home frees up so much capital that can then be used on other things,” says Mr Elkins. \nInternational developers who have long capitalised on burgeoning demand for carbon and eco-friendly homes see big opportunities in the UK. \nHuf Haus, a German family-run company, has created some of the world’s most recognisable — and expensive — custom-build flat pack homes and oversees each stage of the design, development, construction and interiors of its properties. Its prices start at about £500,000 before land costs, but often run into the millions depending on the demands of a client. \n“Our homes has incredibly distinctive eco-features such as argon-filled triple-glazing and high levels of insulation, as well as heat pumps and photovoltaic panels — the whole effect is geared towards being aware of, and your life enhanced by, the natural environment around you,’ says Peter Huf, the group’s chief architect in the UK, where it builds around 30 of the 200 homes it sells annually. He believes that properties will accrue future value depending on their eco-efficiency. \n“In Germany virtually every home is built by the person who will live in it, but in the UK all houses are built by developers — I find this approach amazing given it is the biggest investment one will ever make. But we’ve seen a real growth in confidence in the market here lately. People appear less nervous of planning hurdles and see it is much less wasteful when it comes to materials.” \nUnlike other custom or self build homes, which can take years to produce, a Huf Haus prefabricated house can be erected quickly once a plot has been bought and foundations are prepared. Factory production takes four months, after which the flat-pack home is shipped to the UK along with a team of German builders. Assembly of the shell takes a week, with the interiors, including electrics and plumbing, taking a further 12 to 14 weeks. Prefabulous \nQuicker, less stressful and a potentially cheaper than traditional self-building, prefabricated homes are becoming an option for second or holiday homes as well as primary residences. Make sure you know . . . How to sound like you know what you are talking about \nThe term self-build refers to any property where someone directly organises the design and construction of their new home. Custom build homes tend to be those who take a more hands-off approach, where you work with a specialist developer to help deliver your home. Where to look for guidance \nTo find an architect and contractor specialising in self-build, start with the Association of Self Build Architects, the Chartered Institute of Building and Royal Institute of British Architects. Consider a trip to the Homebuilding & Renovating Show at London’s Excel Centre on September 25-27. Websites on your radar should include: selfbuildportal.org.uk ; nacsba.org.uk ; self-build.co.uk ; mycommunityrights.org.uk ; buildstore.co.uk ; habhousing.co.uk ; theweehousecompany.co.uk \nOne start-up in the area is Cocoon 9 , which provides luxury prefabricated homes shipped anywhere in the world. Most enquiries have come from homeowners who want to drop one on their property as extra guest quarters, as well as city dwellers who like idea of adding it to the rooftop of a townhouse. \n“The Cocoons are designed for people who value form and function at a luxury level and are conscious of unnecessary space or energy consumption,” explains Chris Burch , the prominent US retail investor behind Cocoon 9. \nThe majestic Somerleyton Hall in Suffolk was an early UK pioneer when it built a collection of prefab lakeside log cabins 10 years ago in a bid to generate fresh sources of revenue. With 70 eco-friendly cabins currently on site and planning permission for a further 77, lord of the manor Hugh Crossley calls them “the engine room of his family business”. \nCabins can either be rented for between £353 to £1,100 per week, or sold at an average of £150,000, with about five sales currently made per year. \n“The aim is to sell all of them eventually, and we’ve noticed quite a clear trend in terms of buyer demographic — almost all either own or part-own their own businesses. As a result, they all seem to be confident when it comes to the process of owning, designing and building their own home,” he says, adding that most cabin owners let their cabins during high season, earning around £6,000 a year. \nBuilding a home to your own taste is a risk: when the time comes to move on, other people may not want it. Michael Holmes of the NaCSBA says owners should also remain aware of local land prices. \n“People can get a nasty shock if they’ve upscaled their plot with a lavish property with no expense spared, only to find the value dragged down by the average house prices of the nearby area.” Lurking costs \nSelf-builders are unanimous on the need for detailed budgeting before work begins. Banks offer self-build mortgages which differ from conventional mortgages in releasing money in stages as the build progresses. \nIn order to pay for services, a cash cushion is critical — especially given most such loans require you already to have bought a plot and can be dependent on planning permission. Make sure you know . . . How to find the right plot \nTalk to your local councils and estate agencies and take a look at plot search websites like PlotBrowser and Plotfinder.net . BuildStore’s PlotSearch , a land-finding database, features about 8,500 plots across the country. Aim to look for plots with planning consent already granted. When to claim money back \nYou can apply for a VAT refund on building materials and services when constructing a new home or converting a property into a home, provided you keep records and reclaim it within three months of completion. According to NaCSBA, a third of self builders fail to do this. \n“I think people often forget that if you buy your home from a developer then you are essentially delivered a finished product with few hidden costs. But building your own home can be a work in progress for years down the line and you need to get your figures right accordingly,” says Mr Elkins, who estimates a cost of around £2,000 per sq m for a self-build house. \n“It is also critical that you budget in costs like interior decoration and particularly landscaping the outside areas of the property, which will often run into tens of thousands of pounds. It’s easy to get stung.” \nOne way of limiting exposure to materials and service costs is by joining a group of self-builders or small building communities, who together buy a larger single plot together for multiple units. \nA number of grants are also available by building this way, including the Custom Build Serviced Plots Loan Fund — which offers loans to community groups, housing associations and developers for the purchase of land to be divided into plots for self- or custom-building. \nAlthough self-build remains small, the UK’s volume builders have been watching shifts in consumer tastes within the housing market and are keen to deflect accusations that their homes that are smaller, identikit and more expensive than self-build options. \nBut Mark Clare, until last month chief executive of Barratt , the UK’s largest housebuilder , says that for the time being, Britons appear set in their ways in terms of property materials and aesthetic. \n“We have to build what customers want, and that still appears to be traditional red brick properties — and I doubt that will change for some time,” he says, adding that alternative building materials and techniques won’t make a significant dent in the UK housing shortage any time soon. \nBarratt and other builders believe one way to solve this unfolding crisis is investing in and incorporating prefab solutions into its traditional building process. \nMr Clare believes that pre-building modular core components of a home off-site, such as its roof, would speed up construction and free up labour and materials, allowing more houses to be built and bespoke touches for the ever more demanding consumer. But for converts to the self-build route such as Mr Elkins and Ms Skinner, a home built by anyone else is no longer on the cards. \n“There just needs to be better communication directed towards prospective homeowners tackling misconceptions around the build process and the savings that can be made, both now and in the future. You get to live in your dream home, no one else’s, and once you’ve done that, why would you ever go back?”", "external_links": [], "published": "2015-07-03T20:23:00.000+03:00", "crawled": "2015-07-04T01:19:53.000+03:00", "highlightTitle": ""}