{"organizations": [], "uuid": "bd624b3e5da3890a1069b8c9c35a0cfe6a763a03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiplinger.com", "main_image": "http://www.kiplinger.com/kipimages/pages/13690.jpg", "site_section": "http://www.kiplinger.com/about/rss/kiplinger.rss", "section_title": "Kiplinger's Personal Finance", "url": "http://www.kiplinger.com/article/retirement/T020-C013-S002-ethical-for-a-company-to-end-its-pension-plan.html?rss_source=rss", "country": "US", "title": "Is It Ethical for a Company to Terminate Its Pension Plan?", "performance_score": 0, "site": "kiplinger.com", "participants_count": 0, "title_full": "Is It Ethical for a Company to Terminate Its Pension Plan?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T07:00:00.000+03:00", "replies_count": 0, "uuid": "bd624b3e5da3890a1069b8c9c35a0cfe6a763a03"}, "author": "", "url": "http://www.kiplinger.com/article/retirement/T020-C013-S002-ethical-for-a-company-to-end-its-pension-plan.html?rss_source=rss", "ord_in_thread": 0, "title": "Is It Ethical for a Company to Terminate Its Pension Plan?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "print order a reprint Is It Ethical for a Company to Terminate Its Pension Plan? The choice of a lump sum, rather than an annuity, could be a better financial choice for some retirees. Follow @KnightKiplinger \nQ. My husband receives a sizable pension check from his former employer every month. Now this company, which is highly profitable today, has notified him that it is closing the pension plan and offering him either an annuity for life or a lump-sum payment. Is this ethical? See Also: Knight Kiplinger on Honoring End-of-Life Wishes \nA. Yes, assuming the company is honoring the commitments it made to current pensioners and vested active employees in the defined-benefit plan. There is nothing unethical about a company replacing a pension payment from its own plan with the same amount of money from an annuity it buys for plan members. And the choice of a lump sum—which both you and your husband would have to agree to—could be a better financial choice for some retirees. A properly terminated pension plan will have these characteristics: \n-- The monthly amount paid by the annuity will be the same as the current benefit, whether for the life of the individual retiree or with a survivor’s benefit for the spouse, too. -- The annuity payment will come from a financially solid insurer, such as Prudential, John Hancock or MetLife, to name just a few. This is almost as safe as backing by the federal Pension Benefit Guaranty Corp.—and probably more so for an annual pension of more than $60,000, because the PBGC caps its guarantee at that amount. -- The lump-sum alternative is calculated to be the present value of those future monthly payments, assuming average life expectancy (about 16 years for today’s 70-year-old) and a government-set interest rate of just less than 3%. Advertisement \nTalk to a financial planner about whether the lump sum or the guaranteed monthly income for life is the best bet for you and your husband. This will depend on many factors, such as your other assets and income, your financial savvy, your health and the typical life expectancy in your families. \nHave a money-and-ethics question you’d like answered in this column? Write to editor in chief Knight Kiplinger at ethics@kiplinger.com .", "external_links": [], "published": "2015-07-22T07:00:00.000+03:00", "crawled": "2015-07-22T15:40:59.455+03:00", "highlightTitle": ""}