{"organizations": [], "uuid": "d538b037511e4e273184d6bd55f18f141038a944", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.crainsnewyork.com", "main_image": "http://www.crainsnewyork.com/apps/pbcsi.dll/storyimage/CN/20150724/HEALTH_CARE/150729900/AR/0/Anthem-Inc.jpg?maxw=800&imageversion=widescreen&q=70&cci_ts=20150724112536", "site_section": "http://feeds.crainsnewyork.com/crainsnewyork/finance", "section_title": "Finance - Crain's New York Business News Feed", "url": "http://www.crainsnewyork.com/article/20150724/HEALTH_CARE/150729900", "country": "US", "title": "Anthem's acquisition of Cigna creates country's largest health insurance provider", "performance_score": 0, "site": "crainsnewyork.com", "participants_count": 1, "title_full": "Anthem's acquisition of Cigna creates country's largest health insurance provider", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T20:00:00.000+03:00", "replies_count": 0, "uuid": "d538b037511e4e273184d6bd55f18f141038a944"}, "author": "Associated Press", "url": "http://www.crainsnewyork.com/article/20150724/HEALTH_CARE/150729900", "ord_in_thread": 0, "title": "Anthem's acquisition of Cigna creates country's largest health insurance provider", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Bloomberg News Anthem Inc., based in Indianapolis, will become the nation's largest health insurer by enrollment. \nAnthem is buying rival Cigna for $48 billion in a deal that would create the nation's largest health insurer by enrollment, covering about 53 million U.S patients. \nIn just three weeks, starting with Aetna's $35 billion bid for Humana Inc. on July 3, the landscape of U.S. health care has been altered in a buyout frenzy that could transform five massive U.S. health companies into just three, including UnitedHealth Group. \nLarger insurers have negotiating power to squeeze better rates from drug companies and health care providers. But the wave of consolidation is likely to lead to fewer choices for consumers in certain markets. Regulators scrutinizing the two mega-deals will be trying to assess whether these combined companies would have so much power that they could dominate markets and drive already high health-care costs even higher. \nEmployer-sponsored health insurance is growing slowly and with the recent overhaul of the nation's health care system, providers are jostling for the largest share of the millions of people who have signed up. \nThe deal announced Friday is valued at $54.2 billion including debt. Shareholders of Cigna, based in Bloomfield, Connecticut, will receive $103.4 per share in cash and 0.52 shares of Anthem stock for each of their shares. The companies put the total value at $188 per share. \nIndustry analysts have pointed out several advantages to an industry consolidation. \nThe impact these big acquisitions have on consumers likely won't be felt for at least a year, because insurers have already finalized most of their plans for coverage that starts in January. A combination may lead to fewer choices and some price changes for consumers, depending on where they live and who already is in their market. \nAnthem's combination with Cigna will result in a company with a much broader base over which to spread costs and expenses, and it could make technology investments over the industry's biggest customer pool. \nData and technology are playing a growing role in monitoring patients and care. At a very basic level, that means things like tracking whether patients are keeping up with their immunizations. \nInsurers also are trying to give consumers better information on the cost and quality of the care they buy, based on their coverage. Deductibles and other out-of-pocket costs have been rising for years. That leaves a growing number of consumers with bigger bills to pay before most of their insurance coverage starts, so it can encourage more to shop around. \nAnthem officials have noted that a Cigna deal will help build their company's Medicare Advantage enrollment in states like Texas and Florida. Medicare Advantage plans are privately run, fast-growing versions of the federally-funded program for people over age 65 and the disabled. \nAnthem, based in Indianapolis, is currently the nation's second-largest health insurer, while Cigna ranks fourth in terms of enrollment. Anthem Inc. specializes in selling individual coverage and insurance to workers of small businesses. It also has grown its government business, which includes Medicare, Medicaid and coverage of federal employees. \nHealth insurance is Cigna Corp.'s main business, but it also sells group disability and life coverage in the U.S., and it has a growing international segment that Anthem lacks. Much of Cigna's health insurance business involves coverage where the employer pays the claims and then hires Cigna to administer the plan, a growing and less-profitable form of coverage in employer-sponsored health care. \nThe deal is targeted to close in the second half of 2016. Cigna stockholders still need to approve the agreement, and Anthem shareholders need to approve the issuance of shares in the transaction. \nAnthem stockholders will own about 67% of the combined company, with Cigna shareholders owning approximately 33%. \nThe Anthem board will expand to 14 members. Cigna's President and CEO David Cordani and for independent directors from Cigna's current board will join the nine current members of Anthem's board. \nMr. Cordani will serve as president and chief operating officer of the combined business, with Anthem's Joseph Swedish as chairman and CEO.", "external_links": [], "published": "2015-07-24T20:00:00.000+03:00", "crawled": "2015-07-24T20:36:15.492+03:00", "highlightTitle": ""}