{"organizations": [], "uuid": "1789711d2d3b62403fb23fa4c06eed83b09e4ff8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/6/6/l/8/image.related.afrArticleLead.620x365.gibk4z.png/1436866426663.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/mining/iron-ore/vale-swaps-lossmaking-tonnes-as-cost-battle-heats-up-20150714-gibk4z", "country": "AU", "title": "Vale swaps loss-making tonnes as cost battle heats up", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Vale swaps loss-making tonnes as cost battle heats up | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T15:58:00.000+03:00", "replies_count": 0, "uuid": "1789711d2d3b62403fb23fa4c06eed83b09e4ff8"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/mining/iron-ore/vale-swaps-lossmaking-tonnes-as-cost-battle-heats-up-20150714-gibk4z", "ord_in_thread": 0, "title": "Vale swaps loss-making tonnes as cost battle heats up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vale will replace up to 30 million tonnes of unprofitable iron ore with cheaper production. Bloomberg Share on twitter by Amanda Saunders Brazilian iron ore giant Vale is cutting costs by replacing up to 30 million tonnes of unprofitable iron ore with cheaper production, putting more pressure on rival Fortescue Metals Group and high-cost producers battling to survive.\nShares in Vale jumped almost 9 per cent on Monday night after a senior executive confirmed it would cut production by 25 to 30 million tonnes, as it had foreshadowed earlier in the year.\nHowever, Vale is sticking to its supply target of 340 million tonnes this calendar year, meaning the high-cost tonnes it is taking out the market will be replaced by lower-cost iron ore.\nBarclays analyst Amos Fletcher said Vale was not providing price support for the market, but doing \"quite the opposite by effectively lowering the cost curve\".\n\"In effect they are replacing low-quality, higher-cost iron ore with higher-margin material,\" Mr Fletcher wrote in a note to clients. It is also likely to swap in some stockpiled ore, which it can sell at very high margins because the mining costs have already been absorbed.\nFortescue chief executive Nev Power told The Australian Financial Review that the miner welcomed Vale's move, because it \"indicates there is responsible behaviour by them in terms of market supply-demand\".\n\"While we have been told that if BHP and Rio don't expand and oversupply the market then someone else will do it; that doesn't seem to be the case with what Vale is saying,\" Mr Power said. \"So who is it that is going to produce these expansion tonnes if BHP and Rio don't do it?\"\nBut a Rio Tinto spokesman told the Financial Review that Brazil is not reducing supply, \"and any characterisation that they are is a fundamental misread of the market\".\n Vale is bringing on a $US16.5 billion ($22 billion) low-cost expansion, called S11D, next year, which will add up to 90 million tonnes of new capacity and hammer down Vale's costs.\nIron ore is trading at just under $US50 a tonne, after crashing to a decade low of almost $US44 last week. Without the cuts, Vale probably would have exceeded its production target this year. The miner's update came as new figures showed China's iron ore imports fell in the first half, down 0.9 per cent on the year-earlier period, due in large part to a domestic production glut.\n﻿ Vale's production cuts were flagged in April, dependent on market conditions, and its decision to follow through shows the giant is feeling enough heat from the latest bout of price carnage to displace its own production.\nCiti analysts said that Vale management is not willing to sell the company's iron ore resources at losses, and the cuts were being taken on high silica product with an estimated $US60 a tonne breakeven.\n\"Vale is again signalling to its Australian competitors (and investors) a willingness to cushion new supply,\" Citi analysts wrote.\nVale's latest production strategy will lower its overall cost base, and when S11D starts up, costs will fall further still.\nFortescue could be marginal producer ﻿ UBS analyst Glyn Lawcock told the Financial Review that Fortescue could become the marginal producer of the large iron ore players when S11D starts production.\n\"The concern the market has is that the all-in cash-delivered price that FMG needs to be cash-neutral is ultimately going to be the dictator of where the long-term price settles,\" he told the Financial Review earlier this month. Fortescue's break-even is about $US39, against about $US42 for Vale.\n​The tonnes Vale is removing are among the highest cost in its system, from mines in its southern and southeastern networks, and it could have increased capacity but has instead opted to displace existing production.\nThe miner is on track to hit its ultimate target of 450 million tonnes by 2018, but it could still defer that, or come in shy to avoid selling some tonnes at a loss.\nRBC Capital Markets said Vale's production cuts were \"not as large an incremental positive for the iron ore market as we initially thought\".\n\"It is a slight positive for the iron ore market that Vale is exercising discipline to curtail production and maintain its original supply guidance that it was otherwise on track to exceed.\"\nWhen Vale flagged the cuts eight weeks ago, Fortescue chairman Andrew Forrest said, \"We now have the Brazilian supermajor ... stating that they will not fill their infrastructure if the market is not calling for the tonnes.\"\nBut one of BHP's biggest investors, Aberdeen, told the Financial Review that Vale's flagged cuts were not expected to put pressure on Rio and BHP.\nCiti analysts said in April that the flagged cuts \"are a matter of fiscal discipline [v balancing the market]\" and \"Vale should not subsidise losses on this production indefinitely\".\n\"Investors are asking whether this represents a change in strategy, ie, the first attempt to balance supply with demand,\" Citi said. \"Yet this is more reflective of Vale's cost structure and not a change of strategy. It is relevant for investors to understand the world's third-lowest-cost iron ore producer is losing money on some tonnage at current prices.\"", "external_links": ["https://twitter.com/mandaksaunders"], "published": "2015-07-14T15:58:00.000+03:00", "crawled": "2015-07-14T14:07:22.000+03:00", "highlightTitle": ""}