{"organizations": ["Hunting plc & Premaitha Health PLC", "Persimmon plc", "C&C Group PLC", "Low & Bonar plc"], "uuid": "541a3af622873f0677112031967201b6682d1329", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/buy-sell-c-c-group-103104858.html", "country": "GB", "title": "Should You Buy Or Sell C&C Group PLC, Low & Bonar plc, Persimmon plc, Hunting plc & Premaitha Health PLC Today?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Should You Buy Or Sell C&C Group PLC, Low & Bonar plc, Persimmon plc, Hunting plc & Premaitha Health PLC Today?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T13:31:00.000+03:00", "replies_count": 0, "uuid": "541a3af622873f0677112031967201b6682d1329"}, "author": "", "url": "https://uk.finance.yahoo.com/news/buy-sell-c-c-group-103104858.html", "ord_in_thread": 0, "title": "Should You Buy Or Sell C&C Group PLC, Low & Bonar plc, Persimmon plc, Hunting plc & Premaitha Health PLC Today?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 2, 2015, 11:53 BST - UK Markets close in 4 hrs 37 mins Should You Buy Or Sell C&C Group PLC, Low & Bonar plc, Persimmon plc, Hunting plc & Premaitha Health PLC Today? By Alessandro Pasetti | Fool.co.uk – 22 minutes ago 592.00 -8.0000 \nC&C Group (LSE: CCR), Low & Bonar (LSE: LWB), Persimmon (LSE: PSN), Hunting (LSE: HTG) and Premaitha Health (LSE: NIPT) have updated investors today -- barring Persimmon, they were all under pressure in early trade, although they pared some of their losses before midday. Here's my quick take on these five companies. C&C Group: Uninspiring \nAnother disappointing trading update from C&C. Its stock, down almost 3% in early trade, is not far off its multi-year lows. Its forward trading multiples based on net earnings and cash flows are rather low, but first-quarter results released today showed that its growth trajectory remains a problem. \n\" Trading conditions in the first quarter were mixed \", the booze maker argued. The business boasts a decent capital structure, so its forward dividend yield (3.5%) looks safe, although forecasts for cash flow growth into 2017 are not particularly appealing. You may want to wait a bit longer to sell it if you are invested, betting on stronger trading conditions in the second half of the year. Low & Bonar: Taking Profit \nIts stock lost almost 3% of value in early trade: it looks like investors are taking profit after a six-month performance that reads +36%. Its half-year results for the six months to 31 May 2015 showed that profits and returns are up but revenues are down, hit by currency swings, which are set to last in my view. \nIts forward trading multiples are not prohibitive, but the shares of this supplier to the performance materials industry, which offers an appealing forward yield at 4% (well covered by core underlying earnings), may find it more difficult to rally into the second half of the year from this level. Persimmon: A Star Performer \nIts stock is flat at the time of writing, but has risen 30% year to date. The sector is hot property and is my favourite homebuilder based in the UK. Trading metrics and fundamentals suggest that the rally may well continue into the second half of 2015 and beyond; with Persimmon, you'd bet on rising earnings, a stellar dividend and cash returns to shareholders. \nIt updated the market today on its half-year results to 30 June 2015 : new home legal completion volumes increased by 7% to 6,855 units (2014: 6,408); revenues increased by 12% to £1.34bn (2014: £1.20bn); visitor numbers to sites across the UK \"have been in line with the prior year\" while \"cancellation rates have remained at low levels\". It added that c ustomer demand has been favoured by an increasingly competitive mortgage market since early 2015, and that combines with favourable macroeconomic conditions. The average selling price for increased by 4% to about £195,000 (2014: £186,970). Hunting: Ready To Buy Volatility? Its stock was down as much as 6% at the time of writing, and is down almost 30% over the last 12 months. At its current price, you may be tempted to invest in it. Just as Hunting said in its trading update today, \" the outlook continues to remain unclear, however, weekly rig count declines have slowed, some divisions have seen improvement in enquiries/order book and customer sentiment is improving due to their view of oil prices and their reduction in operating costs\". To be honest, Hunting may well be an opportunistic trade, but fundamentals and forward trading multiples suggest that you'd likely add volatility to your portfolio if you decided to pick it up right now. Premaitha Health: The Outlier A tiny company with a market cap of about £40m, Premaitha Health announced today the placing of about 40m of new ordinary shares at a price of 20p (some 21.3% of its existing stock). The £8m issuance pushed the stock down 11% to 21.2p; proceeds will be used to fund existing products, growth opportunities and working capital. One of the highlights from its previous trading update on 19 June was the l aunch of the \" first and only CE-marked in-vitro diagnostic non-invasive prenatal test (NIPT) in February \", which the group said it would position it at the forefront of the emerging NIPT sector in Europe. Back then, it reported o perating losses for the financial year ended 31 March 2015 i n the range of £4.9m-£5.3m (on the back of additional \" development activities of £1m-£1.2m and a provision for litigation costs of £0.5m \"), while c ash held on the books stood at £2.6m (30 September 2014: £5.2m). \nIn this space, I'd rather buy a small-cap stock whose name is included in a brand new report by our Motley Fool analysts. Why? \nAn attractive valuation, more solid cash flows and rising cash balances combine with a strong track record and great prospects for earnings -- all of which suggest that double-digit returns are a distinct possibility! A solid equity investment opportunity, whose identity is disclosed in a report that is f ree only for a limited amount of time , you'd do well to learn more about it now -- so, click here right away ! \nAlessandro Pasetti has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-02T13:31:00.000+03:00", "crawled": "2015-07-02T13:53:26.000+03:00", "highlightTitle": ""}