{"organizations": ["Fed"], "uuid": "d3e1c13442d3a7d063797f9e1cf38072d7e9c2d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/gold-stuck-near-5-1-011452439.html", "country": "US", "title": "Gold edges higher as investors await Fed meeting", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Gold edges higher as investors await Fed meeting", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T17:38:00.000+03:00", "replies_count": 0, "uuid": "d3e1c13442d3a7d063797f9e1cf38072d7e9c2d1"}, "author": "", "url": "https://uk.finance.yahoo.com/news/gold-stuck-near-5-1-011452439.html", "ord_in_thread": 0, "title": "Gold edges higher as investors await Fed meeting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 28, 2015, 15:48 BST - UK Markets close in 42 mins. Gold edges higher as investors await Fed meeting Reuters – 10 minutes ago \nAn employee shows gold bangles to a customer at a jewellery showroom on the occasion of Dhanteras, a … \nBy Jan Harvey \nLONDON (Reuters) - Gold edged higher on Tuesday but remained near 5-1/2-year lows as markets braced for this week's two-day Federal Reserve meeting, at which policymakers are tipped to give further clues on the timing of a U.S. rate increase. \nThe Fed suggested earlier this year that a near-term rate rise was on the cards if economic data supported such a move, but slowing growth in China and a recent drop in commodity prices have led some to question whether it will be pushed back. \nThe dollar rose from a two-week low against the yen on Tuesday as investors focused on the meeting. \nSpot gold was up 0.1 percent at $1,094.86 an ounce at 0955 GMT, while U.S. gold futures for August delivery were down $2.20 an ounce at $1,094.20. Gold hit a low of $1,077 on Friday, its cheapest since early 2010, in a fifth week of losses. \n\"Gold is treading water despite a slight improvement in the dollar and U.S. Treasury yields,\" Mitsubishi analyst Jonathan Butler said. \n\"That would seem to indicate some pricing in of the Fed pushing out interest rate rises further into the future.\" \nRising interest rates pressure gold by lifting the opportunity cost of holding bullion, while boosting the dollar, in which it is priced. \nExpectations a near-term hike may be possible are making investors hesitant to bid up gold despite a price slide, with its failure to benefit from jitters over Greece this year undermining its appeal as a haven from risk. \nInvestor confidence in gold remained shaky after last week's slide accompanied by big trading volumes in New York and Shanghai. The metal lost more than 3 percent last week, the most since March. \nAlso weighing on sentiment, China's net gold imports from main conduit Hong Kong fell to a 10-month low in June, reflecting weak demand from the major consuming nation. \nGFMS researchers at Thomson Reuters said in a report on Tuesday that global gold demand hit its lowest since 2009 in the second quarter as China poured funds into equities, which had promised better returns. \nChina's gold imports could fall as much as 40 percent this year as demand for bullion used to back domestic financing deals decreases, said Michael Mesaric, head of the world's biggest refiner Valcambi. \nSilver was up 0.4 percent at $14.62 an ounce, platinum was up 0.4 percent at $983 an ounce, and palladium was up 0.6 percent at $615.50 an ounce. \n(Additional reporting by Maolo Serapio Jr in Manila; Editing by Dale Hudson)", "external_links": [], "published": "2015-07-28T17:38:00.000+03:00", "crawled": "2015-07-28T17:49:11.932+03:00", "highlightTitle": ""}