{"organizations": [], "uuid": "96237979e497792769220cb484167ddddd894f96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/greece-victim-own-cronyism-corruption-200052221.html", "country": "US", "title": "Greece is a victim of its own cronyism and corruption", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Greece is a victim of its own cronyism and corruption", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T23:00:00.000+03:00", "replies_count": 0, "uuid": "96237979e497792769220cb484167ddddd894f96"}, "author": "", "url": "https://uk.finance.yahoo.com/news/greece-victim-own-cronyism-corruption-200052221.html", "ord_in_thread": 0, "title": "Greece is a victim of its own cronyism and corruption", "locations": ["Greece"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 10, 2015, 21:06 BST - UK Markets closed Greece is a victim of its own cronyism and corruption By Pavlos Eleftheriadis | Telegraph – 5 minutes ago 0.00 \nPostwar Greece never established welfare systems or open institutions - now it's paying the price \nWhy is Greece so different and why does the government of Alexis Tsipras send such mixed messages towards Europe? Many people believe that the origins of Greece’s problems lie in its four-century domination by the Ottomans, which meant that it missed defining moments in European history, such as the Renaissance, the Reformation and the Industrial Revolution, and is following a highly personal and informal model of government that suits an absolutist ruler but which is incompatible with the professional state that is dominated by the rule of law and is a requirement for being a member of the EU. \nBut even though Greece was very poor, it was a pioneer in democratic government. The first constitution of 1822 recognised the equal dignity and freedom of all people, whereas the constitution of 1844 set up the first Parliament in Athens, four years before there was one in Berlin, and established for the first time in Europe universal suffrage for men. \nWhy does Syriza send mixed messages towards Europe? (Photo: AP) \nMost European states were hierarchical and more or less authoritarian before the Second World War. Immediately after the war, however, most states introduced social insurance and welfare that protected the weakest and poorest and gave the promise of equal opportunity for economic success and social recognition. In Britain, this was done through the NHS in 1948 and the introduction of unemployment and housing benefits and the expansion of the university system. European societies that did this became far more egalitarian. Their politics became less confrontational and their economies prospered on the basis of the European social model of openness to markets, combined with social welfare for those that needed it. \nGreece did not follow this path. Absorbed by a ferocious civil war , which lasted three years, killed thousands and divided the country to Right and Left, the post-war settlement never created a welfare state. Even (Taiwan OTC: 6436.TWO - news ) today, with more than one and half million unemployed , there is no universal unemployment or housing benefit. More than 90 per cent of the unemployed receive no help from the state. The poorest rely on charity, mostly offered by the Church and the city of Athens. There is no universal health service, health insurance depends on one’s employment or profession. The intensity of the civil war meant that there was no trust on which to build such institutions or any long-term plan for the redistribution of resources. Greece remained a deeply hierarchical society, where social class, political affiliation and family dominated one’s prospects. Clientelism was a substitute for social insurance. \nPost-war Greece never created a welfare state (Photo: Bloomberg) \nThe wounds of war were only healed in the 1980s, as the Socialist party (PaSoK) won power and the country joined the European Union. Its leader, Andreas Papandreou, remained highly confrontational and embarked on a programme of public spending and of hiring his supporters to public sector jobs, to redress “historic injustices”. Funds from the EU to assist Greece in dealing with the shock of entering the Common Market made his work much easier. \nStarting in the Eighties populist spending and cronyism became the norm for both main parties, PaSoK and the conservative New Democracy party, which followed Papandreou’s practices when it returned to power in the 1990s. The civil service became part of the spoils of government. There was no room for universal benefits or long-term strategies of assisting the poor. Everyone was out to secure the best short-term outcome for themselves. The big winners were the public sector unions, the utility companies’ unions and the professionals: doctors, lawyers, engineers, pharmacists. The economy remained closed and protectionist, working largely for the benefit of powerful special interests. The New Democracy government of Kostas Karamanlis excelled in this mismanagement, appointed an estimated 150,000 civil servants and finally lost control of public finances in 2007-2009. \nWhy didn’t the Greeks resist this slide into cronyism and corruption? In the late 1980s there was a movement to open up radio and television, until then a state monopoly. Under the pretext of “civil disobedience” wealthy businessmen set up seven television channels. There was no competition, no process. Once the channels were established, the government issued “temporary” licences. These channels are still operating under “temporary” licences, virtually without regulation or any safeguards of journalistic independence. They operate at the mercy of the owners who fund them and who use them to support their wider interests (in the oil business, real estate, banking, construction or shipping etc.). The media owners are virtual oligarchs, with immense economic and political power. \nAs a result, the private channels rarely investigate cronyism and corruption and are seen to be biased for the rich, the powerful and their favourite politicians. They have lost the trust of the public . Many Greeks believe that this is the normal way of running an economy and a political system and that this is how Germany, England or France work. The idea that common institutions can work for the benefit of everyone, with impartiality and objectivity, and not just pretend to do so, is remote from Greek public life. This is why Mr Tsipras is believed when he speaks of the EU as an instrument of “extreme neoliberal” capitalists and other elites. \nGreek Prime Minister Alexis Tsipras (Photo: Reuters) \nThe crisis of 2010 meant that Greece could not remain a member of the eurozone without opening up its economy and fixing its deep social injustices. Such reforms required trust, but there was none to be had. The governments of PaSoK and New Democracy largely balanced the books, but refused to destroy the privileges of the special interests that kept them in power. The government of Syriza also resists reform, ostensibly because of hostility to “capitalism”, but in reality because most special interests have switched their allegiance to Syriza as the real anti-reform party and the vehicle of a new cronyism. Hence, Syriza has done nothing to regulate the media oligarchs, open up the economy, or introduce meritocracy in the civil service. It even refused to introduce a universal unemployment benefit by way of a “ minimum guaranteed income ” as proposed by the EU. \nThe deeper foundation on which populists and demagogues thrive is lack of trust in common institutions. As long as the Greek political system does not restore this trust, real reform will prove highly elusive. \nPavlos Eleftheriadis is a barrister and a Fellow of Mansfield College at the University of Oxford. He is also active in Greek politics with the new centre-Left political party, To Potami", "external_links": [], "published": "2015-07-10T23:00:00.000+03:00", "crawled": "2015-07-10T23:08:45.000+03:00", "highlightTitle": ""}