{"organizations": [], "uuid": "24ccf0dd2cf9d8147e16e44fa40a909587768de8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/t/t/4/b/image.related.afrArticleLead.620x365.gihwz4.png/1437559087057.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/opinion/columnists/alan-mitchell/june-quarter-numbers-show-economy-is-doing-well--for-now-20150722-gihwz4", "country": "AU", "title": "June quarter numbers show economy is doing well – for now", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "June quarter numbers show economy is doing well – for now | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T11:46:00.000+03:00", "replies_count": 0, "uuid": "24ccf0dd2cf9d8147e16e44fa40a909587768de8"}, "author": "Alan Mitchell", "url": "http://www.afr.com/opinion/columnists/alan-mitchell/june-quarter-numbers-show-economy-is-doing-well--for-now-20150722-gihwz4", "ord_in_thread": 0, "title": "June quarter numbers show economy is doing well – for now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As much as we may complain about the economy, it is performing extraordinarily well by historical standards. All of this is against the background of the economy suffering a decline in its terms of trade of 27 per cent.\nAs much as we might complain about the economy, it is performing extraordinarily well by historical standards. And it is doing so because of our history of reform.\nNot long ago, this kind of global turbulence would have put Australia in deep recession.\nThe economy has been transformed, but the world is transforming too. Manufacturing is migrating rapidly from high-income economies like Australia to emerging market economies like China and Brazil.\n International trade in services – a key to the future prosperity of developed nations – is accelerating and demanding increased mobility of labour.\nTechnological change and the growth of the emerging market economies have transformed global financial and product markets. They have also created the need for new reform of the developed economies, from their labour markets to their taxation systems.\nIndeed, there is hardly a corner of the Australian economy – of any dynamic Western economy – that will not be affected.\nWe must to adapt to this rapid change.\nAs Stevens says, Australians would not wish to sacrifice the civilising aspects of our society and culture.\n\"But nor will they accept a future in which they are marginalised in the global village because of unwillingness to adapt or to invest, or because of a failure to foster a growth economy.\"\nOf course, economic reform is always difficult, but it might be easier to sell than we realise.\n\"I would suggest that the case for 'reform' needs to be presented as a positive narrative for economic growth,\" Stevens said.\n\"We all know that competitive markets, investment in education, skills and infrastructure and adaptability are key parts of that growth narrative.\n\"These reforms matter because of the gains to incomes resulting from better allocative efficiency.\n\"But they also, ideally, would support entrepreneurship and innovation – 'risk-taking' by another name and of the kind we want.\"\nAs momentous as Wednesday's summit of the Prime Minister and the premiers might seem, the issue they are struggling with is just one part of the change Australia will make.", "external_links": [], "published": "2015-07-22T11:46:00.000+03:00", "crawled": "2015-07-22T21:54:05.996+03:00", "highlightTitle": ""}