{"organizations": [], "uuid": "829c6d54e727c463a3d3c31940ad2aac6ab1cd19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wisebread.com", "main_image": "http://www.wisebread.com/files/fruganomics/blog-images/investment_000039524102.jpg", "site_section": "http://www.wisebread.com/taxonomy/term/6/all/feed", "section_title": "Wise Bread (Personal Finance posts)", "url": "http://www.wisebread.com/5-money-mistakes-to-stop-making-by-50", "country": "US", "title": "Start Investing Today: Acorns Lets You Invest Your Change While You Shop", "performance_score": 0, "site": "wisebread.com", "participants_count": 1, "title_full": "Start Investing Today: Acorns Lets You Invest Your Change While You Shop", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T09:35:00.000+03:00", "replies_count": 0, "uuid": "83dc14bede59ecfd43f7ab16240cebfcdaeca830"}, "author": "Julie Rains", "url": "http://www.wisebread.com/start-investing-today-acorns-lets-you-invest-your-change-while-you-shop", "ord_in_thread": 0, "title": "Start Investing Today: Acorns Lets You Invest Your Change While You Shop", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » Personal Finance » Investment » Start Investing Today: Acorns Lets You Invest Your Change While You Shop Start Investing Today: Acorns Lets You Invest Your Change While You Shop This post contains references to products from our advertisers. We may receive compensation when you click on links to those products. Please visit our Advertiser Disclosure to view our partners, and for additional details. Wise Bread Picks 0% Balance Transfer Credit Cards \nWhat if you were able to automatically invest some money, every day, in small stress-free amounts? Could investing be that simple? Yep. Just sign up for Acorns . \nAcorns' message is simple: plant your acorns of pocket change today for steady investment growth and wealth in the future. Their app allows users to invest small amounts of money frequently in one of its diversified portfolios. Steps to Investing with Acorns \nIntrigued? Here’s how investing with Acorns works. 1. Invest your change and more \nAcorns promotes the idea that you can build a portfolio by investing your virtual change from card transactions, similar to Bank of America’s Keep-the-Change Savings Program . \nCharges to your linked credit cards and debit cards are rounded up to the next dollar amount and eventually invested. So, a $5.10 transaction generates a 90-cent investment. Further, whole-dollar transactions generate a $1 investment by default. When the accumulated change equals $5 or more, it is invested in your chosen portfolio. \nInvestments can also be made on a one-time basis or set up to occur on a daily, weekly, or monthly basis. The minimum investment is just $5 and the maximum daily investment is $10,000. 2. Link your accounts \nThere are two phases to getting started with Acorns. First, sign up for a general account; next, create an investment account. \nTo initiate the investing process, establish your checking account as a funding source from which transfers are made to and from the investment account. \nYou also have the option of setting up linked accounts consisting of credit cards and debit cards. These linked accounts provide the sources of transactions that can be rounded up, accumulated, and then invested when you cross the firm’s $5 investment minimum threshold. \nIf you are a customer of a large financial institution, you may be able to establish a connection between Acorns and your bank or credit card company by entering the username and password associated with your account. 3. Choose a portfolio \nThe investment portfolios offered by Acorns are diversified among stocks, bonds, and real estate. Like many advisory firms, Acorns adheres to the Modern Portfolio Theory (MPT) in constructing its portfolios. Uniquely, the company has engaged the father of MPT on its investment committee, Nobel Prize winning economist Harry Markowitz . \nBased on your responses to a series of questions, a portfolio is suggested. There are five portfolios for various levels of risk tolerance: conservative, moderately conservative, moderate, moderately aggressive, and aggressive. \nEach portfolio contains six ETFs representing large company stocks, small company stocks, emerging market stocks, corporate bonds, government bonds, and real estate. The allocation of asset classes among the ETFs varies with the risk profile. Acorns manages your account with the goal of matching your investment portfolio with the model portfolio. 4. Monitor activity through the mobile app \nYou can monitor and manage investing activity from the firm’s mobile app or its computer dashboard. From either location, review activity, monitor account value, link or unlink round-up accounts and sub-accounts (e.g., your Chase account and various credit cards held with Chase), manage account settings, and evaluate portfolio performance. \nReview and update settings as soon as your account is opened. Specify whether you want your virtual change or round-ups to be invested automatically or manually. Also decide whether you want to invest a full dollar with whole-dollar transactions. Adjust your settings to invest any amount between $0.00 and $1.00. 5. Pay low fees \nAcorns charges a flat fee of $1 per month for accounts valued at less than $5,000. For accounts worth $5,000 or more, you are charged .25% of assets under management annually, billed monthly. \nDividend reinvestment and rebalancing are included in its fee. There are no transaction fees associated with transferring money or buying and selling the ETFs contained in each portfolio. Reasons to Embrace or Avoid Acorns \nThe ability to invest from your phone, easily, quickly, and often is Acorns’ key selling point. Those who like to invest spontaneously and tend to have extra funds in their checking accounts may especially enjoy interacting with the app on a regular basis. \nThe investment portfolios are designed to be diversified, allowing investors to participate in the market. When (and if) markets trend upward, each portfolio should generate steady investment returns aligned with acceptable levels of risk. \nOddly, even though Modern Portfolio Theory is centered on designing portfolios that align expected returns with certain risk levels through asset allocation, I was not asked specifically about my personal risk tolerance when I signed up with Acorns. Based on the firm’s white paper, portfolio recommendations are based on age, net worth, income, time horizon, employment status, and need for liquidity, not necessarily how scared, steadfast, or stimulated you are in turbulent market conditions. \nFees are low and competitive with advisors in the automated investing space . \nAcorns offers regular investment accounts only, not IRAs, IRA rollovers, etc. Because you have a regular taxable account (and not a tax-advantaged one), you can easily withdraw money. However, there are multi-day delays in receiving funds due to standard settlement and bank processing times. \nI love the idea of investing the change but found the implementation of Acorns’ concept to be cumbersome. For starters, setting up the account is relatively easy but time consuming. Further, having to wait for virtual change to build to $5 makes sense in terms of controlling transaction-based costs for Acorns. But the accumulation process is counterproductive to fast and easy investing. \nAcorns offers an innovative way for users to start investing without needing to pull together a large lump sum. If this has been your mental hurtle, Acorns helps you leap over it. For others, it may seem like a lot of effort for small amounts at a time. Invest accordingly. Editorial Note: Any opinions, analyses, reviews or recommendations expressed in this article are those of the author’s alone, and have not been reviewed, approved or otherwise endorsed by any bank, card issuer, airline or hotel chain. Wise Bread Picks", "external_links": [], "published": "2015-07-01T09:35:00.000+03:00", "crawled": "2015-07-01T20:32:42.000+03:00", "highlightTitle": ""}