{"organizations": [], "uuid": "748a435a1cdf4ea0c8477df571964235ac38c5e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/living-wage-very-well-lower-210640364.html", "country": "US", "title": "A living wage is all very well, but lower pay is better than none", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "A living wage is all very well, but lower pay is better than none", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T00:06:00.000+03:00", "replies_count": 0, "uuid": "748a435a1cdf4ea0c8477df571964235ac38c5e3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/living-wage-very-well-lower-210640364.html", "ord_in_thread": 0, "title": "A living wage is all very well, but lower pay is better than none", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 15, 2015, 22:39 BST - UK Markets closed A living wage is all very well, but lower pay is better than none By James Quinn | Telegraph – 32 minutes ago 1,503.00 -4.00 \nAlthough legislating for a national living wage will help improve the standard of living of some, it will also deliver unintended consequences \nPay, at its heart, is a divisive issue. What someone earns for one job may be very different from what another person earns for doing the very same job. And for good reason. As I pointed out earlier this week , following the announcement of David Cameron’s gender pay gap rules an unnecessary diktat which will cause more problems than it solves the issue of averages when it comes to salaries is one that is easy to be an expert on, but one which few truly comprehend. \nDiscussions around the economics of salary formation are well formed. David Ricardo’s subsistence theory , perhaps the most basic, states that the price of labour will always drop to the minimum required to live, and that as the supply of labour increases, so wages will fall, until the point at which workers become so disillusioned that the labour supply decreases and wages drift up again. \nA more advanced theory, and one which is closer to the way the market works today in most industries, is the bargaining theory, which outlines that there is no one principle or force which governs wages, and rather that they are determined by workers, employers and, sometimes, unions, through negotiation. In action, it can lead to a variety of outcomes. \nRail construction workers, according to a report from consultancy NoPalaver Group earlier this year, have, by way of example, recently enjoyed pay rises far greater than those in the general construction industry. \nThe report showed that rail construction workers’ wages had risen by 74pc in the three years to the end of 2014, from less than £500 a week to almost £860 a week. At the same time, average construction wages barely moved, rising less than 1pc from £582.50 to £587.70 in 2014. \nThe reasons are many but the lack of skilled staff in the sector was the significant driving force. Major projects such as Crossrail combined with the upgrade of major stations such as London Bridge have ensured that the value of labour of those with the right skills has only increased. \nThe same lessons are true when it comes to executive pay and the difference between what a chief executive and his worker bees take home. \nData from the High Pay Centre show that the ratio between the pay of the average FTSE 100 chief executive and his average worker itself a rather meaningless statistic rose to 149 times in 2014, from 120 times five years earlier. \nThere were significant disparities in the data, with Sir Martin Sorrell’s £42.9m package in 2014 some 810 times that of the average WPP (LSE: WPP.L - news ) worker, almost five-and-a-half times the average. But what that shows is Sir Martin is in a rather unique situation. A founder of the company he has run for 29 years, whether you agree with the quantum of money he takes home each year, he has managed to get into a situation whereby the board feel he delivers significant shareholder returns, returns which somebody else would not necessarily be able to produce. Put simply, he has bargained himself into a strong and unique position. \nWhat bargaining theory does not account for, however, is government policy and the impact it can have on wages. \nGeorge Osborne’s decision to impose a national living wage at last week’s Budget caught all sides of the political spectrum including his own by surprise. The living wage which will start at £7.20 next April and rise to £9 an hour by 2020 for people over 25 will have a variety of consequences on the economy. \nFor those who benefit the Chancellor estimated some 6m will see their pay rise the move will be welcomed. But not by everyone. \nThe Office for Budget Responsibility (OBR) was quick to point out that it believes that some 60,000 jobs will be directly lost as a result of the new measure. It is right to do so. In Australia, where the minimum wage has risen every year since the late 1990s and the policy has been widely supported, some commentators are now questioning the role it plays in the economy, as the economy there begins to tire. \nAlthough politically astute stealing a Labour policy and making it his own Osborne’s announcement came at an interesting time, given the relative buoyancy of the economy. \nWednesday's pay data showed that total pay grew at the quickest rate in more than five years, up 3.2pc in the three months to May, compared with a year earlier. And accounting for inflation, the growth was the fastest in almost eight years, since before the financial crisis. \nThe increase in wages came at the same time as the first quarterly rise in unemployment since March 2013 which will potentially be exacerbated by the living wage. \nSeveral leading figures in the British pub industry are warning that the impact of the living wage could be disastrous . \nNot only will it lead to discrimination in favour of younger workers below 25 and companies employing fewer staff, business leaders such as Simon Emeny of Fuller, Smith & Turner, and Tim Martin of JD Wetherspoon are predicting it will lead to pub closures. Claiming it could have an ever more seismic impact on the industry than the supermarket industry has had on it to date, what they foresee makes grim reading. \nThe free market for wages works. It doesn’t always work in the same way, and for those at the lower end of the pay scale, the salaries received by chief executives and others can, at times, seem unfair. But although legislating for a national living wage will help improve the standard of living of some, it will also deliver unintended consequences, such as those playing out in the leisure industry, that nobody, not even George Osborne, could have foretold. Consequences that will damage the economy as a whole, reducing the number of jobs. \nIt may be a divisive issue, but lower pay is better than no pay. Few would disagree with that.", "external_links": [], "published": "2015-07-16T00:06:00.000+03:00", "crawled": "2015-07-16T00:39:52.000+03:00", "highlightTitle": ""}