{"organizations": [], "uuid": "7a17cc7f0bd9b690c9634a71cd20cacc1f4c6c01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iRL_eq8.VJuw/v2/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-23/greece-faces-august-deadline-after-tsipras-meets-creditor-terms", "country": "US", "title": "Greece Faces August Deadline After Tsipras Meets Creditor Terms", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Greece Faces August Deadline After Tsipras Meets Creditor Terms - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T18:51:00.000+03:00", "replies_count": 0, "uuid": "7a17cc7f0bd9b690c9634a71cd20cacc1f4c6c01"}, "author": "Eleni Chrepa", "url": "http://www.bloomberg.com/news/articles/2015-07-23/greece-faces-august-deadline-after-tsipras-meets-creditor-terms", "ord_in_thread": 0, "title": "Greece Faces August Deadline After Tsipras Meets Creditor Terms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greek Prime Minister Alexis Tsipras’s 4 a.m. win in Parliament sets the clock ticking on yet another make-or-break deadline: Aug. 20, when Greece will need to wrap up a new bailout in order to make a payment to the European Central Bank.\nThe measures taken by Greece satisfied the terms required by the nation’s creditors, according to a European Commission spokeswoman, who asked not to be identified because the talks are ongoing. Greece has to pay about 3.2 billion euros ($3.5 billion) to the ECB on Aug. 20.\nPassage of the laws paves the way for the so-called Troika of institutions to return to Athens to negotiate terms for as much as 86 billion euros in aid, which would be the nation’s third financial rescue in five years. Tsipras, who echoed the rhetoric of the predecessors he once accused of betraying their country, said he’ll implement the program even though he thinks the policies being imposed are wrong.\n“Conservative forces within Europe still insist on their plans to kick Greece out of the euro,” Tsipras told legislators in the early hours of Thursday. “We chose a compromise that forces us to implement a program we don’t believe in and we will implement it, because the choices we have are tough.”\nBridge Loan The European Commission is studying the possibility of another bridge loan to Greece as a means to avoid a default if the third bailout can’t be arranged in time, according to a Greek government official, who asked not to be named because the discussions are private. European Commissioner Pierre Moscovici told reporters on Wednesday that it’s too early to say if separate short-term financing would be necessary.\nThe legislature in Athens voted 230 to 63 for a bill that will simplify court decisions and transpose European rules on failing banks. Thirty-six lawmakers from the governing party, Syriza, deserted Tsipras in the Thursday ballot. That compared with 39 rebels when the first package was approved last week.\nThe euro gained 0.4 percent to $1.0975 at 12:34 p.m. in Athens as the Euro Stoxx 50 Index climbed 0.2 percent to 3,644. The yield on Greece’s benchmark 10-year bond rose about 1 basis point to 11.7 percent, which is down from a closing high this year of 13.6 percent in April.\nNegotiations between Greece and its creditor institutions, which will start work in Athens soon, should begin swiftly, according to the Commission spokeswoman.\n“The tricky part -- called implementation -- comes now,” Slovak Finance Minister Peter Kazimir wrote in a note on Twitter after the Greek government passed the laws.", "external_links": [], "published": "2015-07-23T18:51:00.000+03:00", "crawled": "2015-07-23T14:18:47.389+03:00", "highlightTitle": ""}