{"organizations": ["Novartis", "U.S. Insurance M&A"], "uuid": "22b88da1d6037c5e2ddc46ba4fae8cd8638ec1a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=NVS", "section_title": "Yahoo! Finance: NVS News", "url": "http://finance.yahoo.com/news/novartis-ceo-says-u-insurance-121917442.html", "country": "US", "title": "Novartis CEO Says U.S. Insurance M&A to Crimp Drug Prices", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Novartis CEO Says U.S. Insurance M&A to Crimp Drug Prices", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T15:19:00.000+03:00", "replies_count": 0, "uuid": "22b88da1d6037c5e2ddc46ba4fae8cd8638ec1a2"}, "author": "", "url": "http://finance.yahoo.com/news/novartis-ceo-says-u-insurance-121917442.html", "ord_in_thread": 0, "title": "Novartis CEO Says U.S. Insurance M&A to Crimp Drug Prices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Simeon Bennett"], "text": "Novartis CEO Says U.S. Insurance M&A to Crimp Drug Prices By Simeon Bennett 21 minutes ago  Content preferences Done \nNovartis AG Chief Executive Officer Joe Jimenez said the consolidation spree among U.S. health insurers is making it harder for drugmakers to increase prices in a market that has for years been a primary driver of growth for the pharmaceutical industry. \n“Across the board in the U.S., the pricing environment is more difficult,” Jimenez said in a phone interview Tuesday. “With a consolidated payer base as well as consolidated providers, you have to assume going forward that price increases in the U.S. are going to be quite limited.” \nMore from Bloomberg.com: The $42 Billion Debt Trap That Putin Has Three Years to Escape \nAetna Inc. agreed this month to buy rival health insurer Humana Inc. for about $37 billion, after Centene Corp. agreed to pay $6.8 billion for Health Net Inc., including debt. The 2010 U.S. health reform law known as Obamacare has spurred deals by introducing rules that push insurers to look for savings, and by creating millions of new customers. \nIn response, drugmakers will need to show they’re providing innovative therapies that will save insurers money by keeping patients out of the hospital, Jimenez said. \nNovartis this month won U.S. approval for Entresto, a heart-failure medicine that the company says will become its biggest seller with revenue in excess of $5 billion. While the drug’s price, at about $4,500 a year , is higher than some analysts predicted, the company hasn’t had pushback from payers because it can prevent hospital stays that cost an average of $11,000, Jimenez said. \nMore from Bloomberg.com: The Biggest Mistake AshleyMadison Customers Made: Using Their Credit Cards No Barrier\n“I don’t think price is going to be a barrier for rapid uptake of Entresto,” Jimenez said. \nNovartis has proposed a pay-for-performance system in which insurers would initially pay a lower price for Entresto, followed by an additional charge if the drug succeeds in keeping patients out of the hospital. While Express Scripts Holding Co., the largest manager of drug insurance benefits in the U.S., has expressed skepticism , other payers have shown interest, Jimenez said. \n“We’ve had a number who’ve had interest, but it’s quite small as a percentage of the total payer universe,” he said. “What we’re going to do is just keep at it. Someday this is going to be the way that pharmaceutical companies and health-care companies are compensated, so we might as well get started now.” \nMore from Bloomberg.com: Commodity Rout Worsens as Prices Tumble to Lowest Since 2002 \nJimenez spoke after Basel, Switzerland-based Novartis reported second-quarter earnings that missed analysts’ estimates and unexpectedly cut the sales forecast for its Alcon eye-care unit. Pharmaceutical division sales fell 4 percent in the quarter to $7.8 billion in U.S. dollar terms, and rose 6 percent excluding currency fluctuations. \nMore from Bloomberg.com", "external_links": [], "published": "2015-07-21T15:19:00.000+03:00", "crawled": "2015-07-21T15:43:03.422+03:00", "highlightTitle": ""}