{"organizations": [], "uuid": "bd3ed9b9e5ad943eafb1e7c53701728968e42f6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business2community.com", "main_image": "http://cdn.business2community.com/B2C_FB.png", "site_section": "http://feeds.feedburner.com/B2C_Business", "section_title": "Business & Finance Articles on Business 2 Community", "url": "http://www.business2community.com/human-resources/4-reasons-collaborative-departments-01276310", "country": "US", "title": "4 Reasons to Have Collaborative Departments", "performance_score": 0, "site": "business2community.com", "participants_count": 1, "title_full": "4 Reasons to Have Collaborative Departments", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T06:32:00.000+03:00", "replies_count": 0, "uuid": "bd3ed9b9e5ad943eafb1e7c53701728968e42f6b"}, "author": "Deborah Sweeney", "url": "http://www.business2community.com/human-resources/4-reasons-collaborative-departments-01276310", "ord_in_thread": 0, "title": "4 Reasons to Have Collaborative Departments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4 Reasons to Have Collaborative Departments 0 SHARES July 20, 2015 Human Resources 0 \nThere’s the marketing meeting, the engineering meeting, the sales meeting, but what about the meeting with more than just one department? Your company’s departments are the epicenters of specialized information. Departments need to work together more than ever before to ensure a strong channel of communication. In today’s times of rapid change and response, that channel of communication will be put to the ultimate test. Understanding Expectations \nThe marketing team needs new products for a particular campaign and the engineering/product design team refuses, saying it can’t be accomplished in the timeframe. The problem isn’t the proposal. The problem comes from the lack of communication between the departments. By having collaborative cross-department meetings, your company is able to manage expectations of each department. This eases the tension and promotes a helpful company culture. Today’s Era of Product Design \nWe have transitioned into an era of marketing that is almost entirely based on product design, data, and consumer relationship. More companies have developed products with little differences, and the need to differentiate using product design and consumer relationships has become a vital practice. This is why the marketing and product design teams should work together closely. Marketing needs strategize so that highlighting the product’s differentiating design properties is one of its main focuses. The overabundance of companies competing in today’s market leaves no room for communication errors between departments. Emphasis on Feedback \nThe marketing team should collaborate with all departments. Why? Marketing is the direct channel for communicating with the consumer. In a time where social marketing is at the forefront of trends, every Facebook comment, and every tweet that is retweeted is potential input for analyzing customer service, product effectiveness, and PR. If your product is seen as too complicated, or your customer service is deemed impolite, it is up to the connected teams to work on analyzing what the feedback means and implementing the necessary changes. Immediate Customer Needs \nIt’s also important for the sales team to know every detail of the product. They need to be ready to answer any possible questions, even about the minutest details. In companies where the sales team does not collaborate with the other departments, salespeople become flustered when answering a technical question. The collaboration between the teams also allows for the design of the product to have special features that the sales team can steer the customer towards. \nAs your company grows and needs more and more specialized departments, the number of cross-department meetings and collaborations should also grow. No one area of your business can survive without the other, and your employees should recognize the importance of staying in constant communication with the other departments. Doing so will result in a more cohesive company culture, and plan for the future.", "external_links": [], "published": "2015-07-21T06:32:00.000+03:00", "crawled": "2015-07-21T09:56:54.660+03:00", "highlightTitle": ""}