{"organizations": [], "uuid": "9b9e07f0280c3bc106fce6180888edb3fa4b2249", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-16/lose-lose-pushing-greece-out-of-euro-is-costlier-than-write-off", "country": "US", "title": "Lose-Lose: Pushing Greece Out of Euro Is Costlier Than Write-Off", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "Lose-Lose: Pushing Greece Out of Euro Is Costlier Than Write-Off - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T17:43:00.000+03:00", "replies_count": 0, "uuid": "9b9e07f0280c3bc106fce6180888edb3fa4b2249"}, "author": "Anooja Debnath", "url": "http://www.bloomberg.com/news/articles/2015-07-16/lose-lose-pushing-greece-out-of-euro-is-costlier-than-write-off", "ord_in_thread": 0, "title": "Lose-Lose: Pushing Greece Out of Euro Is Costlier Than Write-Off", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The hardliners who reject a Greek debt writedown to keep it in the euro are willing to pay much more to drive it out.\nA “Grexit” would cost creditors almost 100 billion euros ($110 billion) more than keeping Greece in the currency union, reckons Alberto Gallo, head of macro credit research at Royal Bank of Scotland Group Plc. Zsolt Darvas at the Bruegel institute estimates that about 75 percent of the debt would not be paid to creditors following the return of the drachma.\n“What this tells you is that policy makers are following politics instead of rational economics,” Gallo said.\nThe fate of Greece’s 313 billion-euro debt load -- most owed to other European governments -- has emerged as the threshold question in returning the beleaguered country to financial health. The International Monetary Fund says it needs relief “far beyond” what creditors have considered. Euro-area leaders reject any cut in the face value of the obligations.\nFor German Finance Minister Wolfgang Schaeuble, the cost is secondary. He and his euro-area counterparts floated a proposal to their bosses at a July 12 summit to suspend Greece from the euro along with the prospect of a debt restructuring.\n“I don’t know, nobody knows, at the moment how this is supposed to work without a haircut,” Schaeuble said Thursday on Deutschlandfunk German radio, “And everybody knows that a haircut is incompatible with euro membership. That’s the situation.”\n‘Big Haircut’ Gallo figures the costs this way: a “big haircut” to keep Greece in the euro would cost about 130 billion euros; a combination of haircuts and eased payment terms would cost about 40 billion euros to 50 billion euros.\nThe minimum tab of Grexit, assuming a 40 percent devaluation of the drachma against the euro, would be 227 billion euros, he said. Beyond that, “you need to add other indirect costs, for example the collateral costs of creating a precedent” for other nations to leave, as the euro would no longer be considered irreversible.\n“If Greece stayed in the euro area it would be able to pay a much larger share of its debt compared to if it leaves,” said Darvas, a senior fellow at Brussels-based Bruegel.\nDrachma Drag Creditors would have to write off most of the debt should it be redenominated into Greece’s former currency, according to Gianluca Ziglio, a fixed-income strategist at Sunrise Brokers LLP in London. Leaving the euro would cost lenders about 240 billion euros to 250 billion euros, he estimated.\n“It is likely you will get a 50 percent -- maybe more -- devaluation of the drachma and that will basically double the debt that is already unsustainable.”\nAs the Greece public languishes in the third week of capital controls and banks bleed cash even when they’re closed, Prime Minister Alexis Tsipras said he surrendered to a new round of austerity in the 17-hour summit that ended Monday morning because he was backed into a corner.\n“I had a choice of a deal I did not agree with, or a disorderly default, or Schaeuble’s choice of a euro exit,” Tsipras said in a parliament debate overnight. Greece “does not have the required currency reserves to support a return to the drachma,” he said in an earlier television interview.\nGreece’s ratio of debt to gross domestic product, a common measure of a nation’s ability to pay, is currently at about 180 percent. The IMF, predicting it to peak at 200 percent in the next two years, sees cuts in the face value of the debt as necessary.\nEuropean Union finance ministers, meanwhile, are struggling to provide temporary, or bridge, financing to allow Greece to meet debt payments on July 20, including about 3.5 billion euros to the European Central Bank.\nDebt Relief Sunrise Brokers’ Ziglio said the probability of Greece leaving the union has gone up a few notches from his 70 percent estimate in April.\nHe said European lenders will need to “grant Greece debt relief and cut the nominal amount of the debt by say 80 billion euros,” with strong “constitutional commitment” that it won’t go into deficit again.\n“That would allow Greece to have a chance at least.”", "external_links": [], "published": "2015-07-16T17:43:00.000+03:00", "crawled": "2015-07-16T13:16:36.000+03:00", "highlightTitle": ""}