{"organizations": [], "uuid": "85af5a5482f5de39b880ebfe06c0391958252d82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-22/bank-of-england-shift-toward-rate-increase-builds-momentum", "country": "US", "title": "Bank of England Shift Toward Rate Increase Builds Momentum", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Bank of England Shift Toward Rate Increase Builds Momentum - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T16:30:00.000+03:00", "replies_count": 0, "uuid": "85af5a5482f5de39b880ebfe06c0391958252d82"}, "author": "Fergal O'Brien", "url": "http://www.bloomberg.com/news/articles/2015-07-22/bank-of-england-shift-toward-rate-increase-builds-momentum", "ord_in_thread": 0, "title": "Bank of England Shift Toward Rate Increase Builds Momentum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Bank of England said a growing number of policy makers have become concerned about rising inflation pressures, indicating building momentum toward the first rate increase in eight years.\n“For a number of members, the balance of risks to medium-term inflation relative to the 2 percent target was becoming more skewed to the upside at the current level of bank rate,” the BOE said in the minutes of its July Monetary Policy Committee meeting published Wednesday. It also said that if the Greek crisis were excluded, the decision whether to raise the benchmark rate from a record low was becoming “more finely balanced.”\nThe minutes indicate a further shift in the MPC’s thinking from June, when two members said the decision was finely balanced. Governor Mark Carney said last week the timing for the first move in rates would become clearer at the end of the year.\nThe committee voted 9-0 for no change in the key rate this month, leaving it at 0.5 percent. The pound remained higher against the dollar after the report.\nIn its analysis, the BOE said domestic news “had generally been positive.” It noted stronger wage growth, though said that the impact of bonuses raised questions on the durability of the strength of the pickup.\nThe MPC had divergent views on the recent softness in labor market data, and whether that indicated a narrowing of the margin of spare capacity in the economy.\n“Overall, committee members agreed that the domestic economy had continued to strengthen over the past year, that the margin of spare capacity had continued to shrink, and that domestic cost pressures had increased,” the minutes said.\nThe MPC also said the recent pickup in the pound would have a direct impact on inflation, though the “speed and degree” of the pass-through was unclear. Persistence in the drop in oil prices might also bolster the deviation of inflation from the target, the minutes said.", "external_links": [], "published": "2015-07-22T16:30:00.000+03:00", "crawled": "2015-07-22T11:48:20.074+03:00", "highlightTitle": ""}