{"organizations": [], "uuid": "584d9f96395846cc33f989887aea7ec2e03733ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/b/p/h/q/image.related.afrArticleLead.620x365.gibocd.png/1436838898231.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/economy/business-confidence-continues-to-strengthen-20150714-gibocd", "country": "AU", "title": "Business confidence continues to strengthen", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Business confidence continues to strengthen | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T09:41:00.000+03:00", "replies_count": 0, "uuid": "584d9f96395846cc33f989887aea7ec2e03733ab"}, "author": "Mark Mulligan", "url": "http://www.afr.com/news/economy/business-confidence-continues-to-strengthen-20150714-gibocd", "ord_in_thread": 0, "title": "Business confidence continues to strengthen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Conditions in services were the strongest, while mining, wholesale and manufacturing were the weakest. Erin Jonasson Share on twitter by Mark Mulligan The slowdown in China and other concerns about global growth have failed to dent business confidence in Australia, according to the National Australia Bank survey for June, which shows a solid pick-up in both sentiment and conditions.\nNAB says its business confidence index rose two points to 10, after a five-point hop in May, while its business conditions index rose five points to 11, after a two-point rise in May.\nThe indicators are based on a survey of more than 400 companies in the final week of June, before escalating fears of a Greek exit from the euro zone and wild fluctuations in the Chinese share market rattled global investors.\nRespondents were particularly upbeat on trading conditions, up eight index points to 20, and forward orders, which climbed three points to five. Capacity utilisation, which reflects job market conditions, rose from 80.9 per cent to 81.3 per cent, the survey found.\nNAB chief economist Alan Oster ascribed the lift in confidence to \"interest rate cuts, the lower Australian dollar, better conditions and a better received federal budget\".\n\"There also appears to have been little reaction to concerns over the Chinese equity market bubble - and its partial unwinding - and ongoing issues with Greece – although the survey was conducted prior to the escalation of Greek concerns following the recent referendum,\" Mr Oster said.\nHe noted that confidence was broad-based across most industry groups, but warned that \"growing jitters on global matters - especially in regards to China - suggests that current levels may be hard to sustain\".\nBy segment, confidence dropped 10 points in retail and eight points in wholesale.\n The trend in business conditions, Mr Oster noted, were at an equal high to May 2010.\nConditions in services were the strongest, while mining, wholesale and manufacturing were the weakest.\n\"Elsewhere, low interest rates continue to support the housing sector, and housing credit growth, while business credit has also been gaining momentum,\" Mr Oster said.\n\"However, the consumer continues to be cautious and it was somewhat surprising that conditions in retail edged down a touch – especially as the budget's small business tax deduction initiatives was expected to have a positive impact on retailers.\"\nHis comments chime with the latest weekly ANZ-Roy Morgan consumer confidence survey, which reported a sharp drop in the week ended July 12.\nAccording to the bank, consumer sentiment fell 3.6 per cent in the week , to 107 points, after a 4.6 per cent drop the previous week. The accumulated decline has wiped off gains following the May budget, and taken confidence to its lowest level in 12 months.\n\"The rapid turnaround in sentiment highlights the sensitivity of consumers towards both domestic and global conditions,\" ANZ chief economist Warren Hogan said.\n\"Chinese stock market volatility and current negotiations surrounding Greece have dominated the news-flow over the past two weeks and spilled over into the local share market.\n\"Despite the stabilisation in the unemployment rate, ongoing weakness in consumer confidence would present a risk to the outlook for household spending.\"", "external_links": ["http://www.smh.com.au/business/markets/household-spending-revival-at-risk-as-consumers-lose-confidence-20150714-gibo5g.html", "https://twitter.com/@MulliganMark"], "published": "2015-07-14T09:41:00.000+03:00", "crawled": "2015-07-14T05:07:28.000+03:00", "highlightTitle": ""}