{"organizations": [], "uuid": "6408448a42c3ae8beb70401fdb552ecf1d9c28d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/download/pic/main/main/csiid/00301162:2111cf96ab77d09910c138362bf91d1b:arc614x376:w1200.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507132819.html", "country": "US", "title": "Africa: Funding the Planet's Future", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Funding the Planet's Future", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T20:45:00.000+03:00", "replies_count": 0, "uuid": "6408448a42c3ae8beb70401fdb552ecf1d9c28d8"}, "author": "", "url": "http://allafrica.com/stories/201507132819.html", "ord_in_thread": 0, "title": "Africa: Funding the Planet's Future", "locations": ["Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Africa: Addis - Strong Partnerships Needed to Turn Billions Into Trillions for Sustainable Development \nThe Sustainable Development Goals (SDGs), drafted by the UN General Assembly and up for approval this September, are a 15-year, 17-point plan for achieving what could be described as the Millennium Development Goals (MDGs) plus peaceful and inclusive societies plus economic capacity and infrastructure. In the midst of this swirl of pressing global needs is the ever more present visage of climate change, which has now been allocated its own goal in the SDGs lineup. \nThis is not the first time that world leaders have convened to consider financing for development (FfD), or how to raise money to fund projects that will improve global welfare. The first UN summit on financing for development took place in Monterrey, Mexico, in 2002. The impetus came from developing countries, many of whom had experienced crippling financial crises only a few years earlier. Moreover, levels of official development assistance (ODA) had stagnated following a sharp slump at the 1992 conclusion of the Cold War. The question these countries raised was: given heart-stopping volatility in financial flows and the paucity of development assistance, exactly where were the resources to finance their development to come from? \nThe Monterrey answer appears to have worked well. Between 2002 and 2015, ODA increased by two-thirds in real terms in the wake of Monterrey donor pledges; annual levels of foreign direct investment (FDI) have roughly doubled and in some years quadrupled, with developing countries now taking the lion’s share of incoming flows; and shored-up finances meant that the next global crisis to occur originated in the developed North, not the developing South. Progress on the MDGs gained momentum, and the rate of extreme poverty in developing countries was cut in half by 2010, five years ahead of schedule, according to the United Nations. \nThe task before the Addis Ababa gathering, however, looks bigger. For example, three of the eight MDGs addressed health needs: reversing the spread of HIV/AIDS, malaria and other killer diseases; improving maternal health; and reducing child mortality. Yet a single goal out of the 17 SDGs dwarfs these three MDGs combined. SDG 3 is to ensure healthy lives and promote well-being for all at all ages. \nWithin SDG 3 are 10 targets, of which only one takes on “universal health coverage, including financial risk protection, access to quality essential health care services and…affordable essential medicines and vaccines for all.” Funding such a target, in contrast to concentrating on a single disease or funding vaccination campaigns, almost certainly will require user-financed health insurance schemes. But incomes and the degree of participation in formal work sectors are so low across the developing world that considerable progress on SDG 1 (poverty eradication) and SDG 8 (inclusive and sustained economic growth and decent work for all) would appear to be prerequisites for SDG 3 achievement. \nAlso to be considered is the sheer extent of the infrastructure required to meet the health goal, in terms of clinics, hospitals, training schools, pharmaceutical production facilities, and others. With health care funding on the decline after an MDG-related string of successes, considerable expansion in investment by large-scale health care companies will be required. Higher average incomes would most likely increase gains by building a more lucrative market. \nFortunately, many health care firms practicing corporate sustainability, which says social and environmental well-being pays off in increased revenue opportunities and business stability, have been developing public-private partnerships. Public partners include but are not limited to global United Nations initiatives on vaccines and on maternal and child mortality. \nNevertheless, examples from the United States indicate the scale of the challenge ahead. If the world’s largest economy is still experiencing challenges in expanding its health insurance coverage, what are the chances of success in countries where, for example, the healthcare infrastructure is severely limited due the lack of resources? \nAs the health care example illustrates, financing the SDGs is likely to be a multifaceted effort. It will require synergies among the various goals and targets and, in contrast to most of the MDGs effort, depend explicitly on business, civil society, philanthropy and scientific and academic institutions, as well as on governments and ODA. \nRather than setting out a numerical budget of expenditures and seeking to balance it with the same amount of credits, the deputy director of strategy and policy for the International Monetary Fund (IMF), Sean Nolan, told Africa Renewal that “it’s more useful to ask, ‘What kinds of policies at national and international levels will generate resources for development?’” \nThe UN Intergovernmental Committee of Experts on Sustainable Development Financing, in its August 2014 report, divided the playing field of sources of finance neatly into four areas: public domestic, private domestic, public international and private international. Some of the leading considerations attracting attention within these four categories are: \nPublic domestic: Taxes provide a major base for development. But the levels of tax collection in low-income countries are at about 10–14% of GDP, according to the Committee of Experts report. This is about one-third less than in middle-income countries, and both rates are in contrast to the 20–30% of GDP collected in high-income nations. \nPrivate domestic: The presence of institutional investors in developing countries is growing, and emerging market pension funds are managing $2.5 trillion in assets, according to estimates cited in the report. In accessing these funds, the trick will be guiding investments to the right destinations. \nPrivate international: Likewise, “There is a realization that profit shifting by multinational corporations is going on,” says the IMF’s Nolan. “These companies are taking advantage of attempts by countries to attract investment with very favourable tax regimes.” Efforts by the G20 and others to crack down on unfair tax regimes could unlock resources from illicit financial flows. \nA more positive trend lies in the realm of FDI. Investors and multinationals are increasingly seeking investment destinations with a protected environment, cohesive social relations and good governance. Governments, for their part, are taking social and environmental impacts into account when approving proposals. The result is often a race to the top rather than the bottom in FDI, according to UNCTAD. \nPublic international: The latest report from the Organization for Economic Cooperation and Development shows ODA hovering in the range of $130 billion to $135 billion a year from 2010 to 2014, a record high. Aid did not nose-dive after the global crisis, as was feared. But faltering economies and nationalist sentiment in the developed world may mean that a plateau has been reached. There is the danger that developing countries will feel betrayed that expected increases are not materializing, which would cloud the prospects for implementation. \nThe report of the committee of experts and the draft FfD document take into account large, often underutilized, resources for development, and possible ways to use them. But bringing the right factors into play will require agile economic and political coordination. Hence experts worry about reports that finance ministers and officials arriving at the spring meeting of the Bretton Woods institutions were seeking out information on the SDGs, indicating they knew scarcely anything about them. More on This \nDespite witnessing exceptional growth in development finance in recent years, Africa is still faced with the arduous … see more » Previous Story", "external_links": [], "published": "2015-07-13T20:45:00.000+03:00", "crawled": "2015-07-13T23:23:40.000+03:00", "highlightTitle": ""}