{"organizations": ["Elvia Travel Insurance Group", "Allianz Worldwide Care Ida Luka-Lognoné", "Allianz Worldwide Partners", "Allianz Worldwide Care Board", "Ireland Allianz Worldwide Care", "Allianz Worldwide Care", "Mondial Assistance Group", "Allianz Group", "Allianz Worldwide Partners’ Executive Committee"], "uuid": "9daeee74cf5306ced867a0b5f4fe143a077d6e04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/new-ceo-appointed-allianz-worldwide-care/44648", "country": "US", "title": "New CEO Appointed to Allianz Worldwide Care", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "New CEO Appointed to Allianz Worldwide Care", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T07:50:00.000+03:00", "replies_count": 0, "uuid": "9daeee74cf5306ced867a0b5f4fe143a077d6e04"}, "author": "", "url": "http://businesswireindia.com/news/news-details/new-ceo-appointed-allianz-worldwide-care/44648", "ord_in_thread": 0, "title": "New CEO Appointed to Allianz Worldwide Care", "locations": ["Africa", "Dublin", "Europe", "Eastern Europe", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ida", "Ron Buchan", "Buchan", "Ida Luka-Lognoné"], "text": "Wednesday, July 29, 2015 10:20AM IST (4:50AM GMT) New CEO Appointed to Allianz Worldwide Care Ida Luka-Lognoné takes the helm at global health and life insurance company Dublin, Ireland Allianz Worldwide Care has announced that Ida Luka-Lognoné, Executive Committee member of Allianz Worldwide Partners, has succeeded Ron Buchan as CEO of Allianz Worldwide Care. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150728005764/en/ Ida Luka-Lognoné (Photo: Business Wire) Ida Luka-Lognoné, Polish and French citizen, has a wealth of experience in the insurance industry. Having joined Elvia Travel Insurance Group in 1992, she was appointed Director of Business Development for Central and Eastern Europe in 1996. Ida became Director of the European Region for Mondial Assistance Group in 2000, and Member of its Executive Committee in 2002. Before joining Allianz Worldwide Partners’ Executive Committee in January 2014, responsible for Strategy, Innovation and Market Management, Ida was CEO for Europe, Middle East and Africa within Allianz Global Assistance. Mr Buchan, who successfully led Allianz Worldwide Care from a start-up to become one of the world’s largest international health insurance companies, recently retired after a long and distinguished career. He has taken up an advisory role as Chairman of the Allianz Worldwide Care Board. Allianz Worldwide Care is the international health and life insurance division of Allianz Worldwide Partners and part of the Allianz Group, which serves more than 75 million customers in over 70 countries worldwide. Allianz Worldwide Partners is the world’s leading B2B2C specialist for international health and life insurance, the global automotive business, and assistance services. Ida Luka-Lognoné commented, “Having worked in the insurance industry for almost 25 years, I understand the dynamic evolution of this sector and I find that hugely motivating and exciting. In just 15 years Allianz Worldwide Care has grown from a greenfield start-up to become the market leader in international health insurance, with a consistent record of robust growth and a GWP of €1.1 billion in 2014. This level of expansion is due to Allianz Worldwide Care’s client driven focus, offering a growing range of products, services and digital innovation. Our MyHealth app, an example of service enhancement through digital innovation, was the first international health app to allow for the submission of medical claims without the need to complete a traditional claim form. In 2016 and beyond, I believe that insurance products and services will increasingly be delivered and supported through mobile and digital technology, providing ever greater levels of convenience and value to our clients.”", "external_links": [], "published": "2015-07-29T07:50:00.000+03:00", "crawled": "2015-07-29T10:36:33.839+03:00", "highlightTitle": ""}