{"organizations": ["Nokia Lumia"], "uuid": "d235e60e3b856c8bccc977e792799523532d155f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507031717.html", "country": "US", "title": "Kenya: Nairobi X - Kenya's Latest 3D Multiplayer Video Game", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Nairobi X - Kenya's Latest 3D Multiplayer Video Game", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T17:12:00.000+03:00", "replies_count": 0, "uuid": "d235e60e3b856c8bccc977e792799523532d155f"}, "author": "", "url": "http://allafrica.com/stories/201507031717.html", "ord_in_thread": 0, "title": "Kenya: Nairobi X - Kenya's Latest 3D Multiplayer Video Game", "locations": ["Nairobi", "Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya: Nokia Lumia 830 Merges Affordability With Functionality \nBlack Division revealed that this is the first time game developers in the region have embraced multiple platforms by making it accessible for Android, IOS and Windows smart phone devices while personal computer users can enjoy the game play on both Windows and IOS operating systems. \nNairobi X's plot revolves around an imminent attack on Nairobi by an unknown alien colony. Player's assume the role of Otero, an elite GSU Recce Squad member who through an unfortunate twist of events emerges as the sole survivor in a special operation tasked to defend his country. \n\"We are glad to launch Nairobi X as the ?rst video game in its series. We expect to release further information on characterisation, setting and plot development with the release of its sequels. The mobile game is a ?rst person shooter based on different locations in the city of Nairobi. The player is assigned various mission objectives and they have to complete the tasks to unlock the next level of the game. \n\"This version was designed to suite the current demands and capacity of the mobile subscriber base in Africa thus efforts were made to ensure the game application was a relatively small ?le making it accessible to a vast majority of smart phone users, optimised to be compatible with high end and entry level smart phones while ensuring a cost effective download cost at an affordable pricing point,\" said Kaggia. \nHe draws his inspiration from Tim Sweeny of Epic games and Hideo Kojima, creator of the Metal Gear Solid franchise. These two people, he believes, have contributed greatly to the global gaming community and personally motivated him to get into game development. \n\"We seek to develop high quality, aesthetically pleasing, culturally relevant and uniquely engaging gaming experiences for the region,\" he says \nHis company Black Division Games is an interactive entertainment and publishing company. \n\"Nairobi X is currently free for download for a time limited period of one week. It features special partnerships with RMA Jaguar Land Rover to use their latest Defender as the players' primary mode of roaming the city. The Kenyatta International Conference Centre (KICC) partnered and featured as the game starting point while Commercial Bank of Africa (CBA) worked with the game team to set up terminal points for the players to save their data and progress through the mission. For mobile is just Sh30 and for PC Sh100,\" he said. \nPlayers can download the mobile version by typing Nairobix and sending that to 21797. The PC version of the game presents a similar FPS genre featuring single campaign missions allowing the players to roam the city or #DefendKenya by engaging the enemies to complete certain tasks issued from the command base. Players on PC can also immerse themselves in two specially designed maps and invite other players for a multi-player challenge allowing up to sixteen players to interact simultaneously for a high grade, fascinating and competitive gaming experience. Kenya \nThe crackdown on manufacturers of illicit brews began on Friday, as police moved to enforce the directive by President … see more » Copyright © 2015 The Star. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-03T17:12:00.000+03:00", "crawled": "2015-07-04T12:30:53.000+03:00", "highlightTitle": ""}