{"organizations": [], "uuid": "4fa70e49c715059fbf79d29fd63c1e1b2b3bc944", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-27/with-china-banks-pinched-by-bailouts-pboc-turns-to-state-allies", "country": "US", "title": "With China Banks Pinched by Bailouts, PBOC Turns to State Allies", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "With China Banks Pinched by Bailouts, PBOC Turns to State Allies - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T06:00:00.000+03:00", "replies_count": 0, "uuid": "4fa70e49c715059fbf79d29fd63c1e1b2b3bc944"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-07-27/with-china-banks-pinched-by-bailouts-pboc-turns-to-state-allies", "ord_in_thread": 0, "title": "With China Banks Pinched by Bailouts, PBOC Turns to State Allies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As China’s leadership pulled together very public efforts to address local-government debt strains and a stock sell-off in recent months, officials took less conspicuous steps to strengthen the state’s lending capacity.\nWith the fixes for the equity market and local authorities relying on credit from commercial banks, a recapitalization of China’s so-called policy banks will help sustain loan growth. The central bank has put $48 billion into China Development Bank Corp., people familiar with the matter said this month. Export-Import Bank of China got $45 billion, Caixin magazine reported.\nThe People’s Bank of China’s stakes in the two lenders make it easier for the central bank to conduct targeted easing through institutions whose loans reflect the social and foreign-policy objectives of the Communist leadership. With exports faltering this year, the moves offer capacity to support foreign projects that could help the commercial sector.\n“The central bank is doing some of the quasi-fiscal jobs” by boosting capital in the policy lenders, said Ding Shuang, chief China economist at Standard Chartered Plc in Hong Kong, who previously worked for the PBOC. “Local governments are finding it hard to keep spending, and the central bank is providing funds to the policy banks to make up the gaps.”\nThe PBOC, CDB and Export-Import Bank all didn’t respond to faxes seeking comment. Included in the recent initiative by the government was 100 billion yuan ($16 billion) from the Ministry of Finance for Agricultural Development Bank of China, also a policy bank, Caixin reported. The magazine has said that the PBOC would become among the two biggest shareholders in CDB and the Exim Bank.\nDomestic Role The move by the PBOC follows action taken in 2014, when it extended 1 trillion yuan in lending support to CDB to fund the clearing of shanty towns in China.\nChina received a fresh warning last week that monetary and fiscal easing to date has had a patchy effect so far, with a private gauge of manufacturing falling to a 15-month low in July.\nPolicy makers are also grappling with an ongoing battle to shore up the stock market. The benchmark stock index on Monday fell the most since February 2007, amid concern a three-week rally sparked by unprecedented government intervention is unsustainable.\n“As foreign capital inflows are slowing down, the PBOC has invented a lot of tools to inject liquidity into the economy,” said Zhao Yang, chief China economist at Nomura Holdings Inc. in Hong Kong. “The current capital injection, in terms of the quantity of liquidity, amounts roughly to one RRR cut,” he said, referring to the required reserve ratio for commercial banks.\nPBOC Governor Zhou Xiaochuan has already lowered the required reserve ratio three times for most banks this year, and cut benchmark interest rates four times since early November.\nGo Abroad Since the capital provided by the PBOC to China Development Bank and Export-Import Bank are denominated in dollars, the funds will mainly be used to finance China’s go-abroad strategy, Zhao said. President Xi Jinping has championed a “one belt, one road” vision of developing economic ties along the land and maritime routes of the old Silk Road.\nExporters are struggling under the weight of a stronger yuan, which is up about 13 percent year-on-year on a real trade-weighted basis, according to Bloomberg Intelligence.\nChina Development Bank has no deposit-taking business and normally relies on bond issuance for funding. Urban-development loans from the bank amounted to 419.8 billion yuan in the first half of 2015, more than for all of last year, out of a total of more than 1.3 trillion yuan in loans.\nFor its part, Export-Import Bank’s job is to boost exports of Chinese mechanical and electronic products and to help homegrown companies invest abroad -- it provided 178.6 billion yuan in loans to Chinese exporters last year, according to its annual report.\nPersonnel Link Hu Xiaolian, a former PBOC deputy governor who used to look after China’s foreign-exchange reserves, is now Export-Import Bank’s chairman. The bank has already signed deals in the Chinese provinces of Jiangxi and Hunan to help companies based in these places to explore markets along the one-belt-one-road routes.\n“Compared to bond issuance, direct government recapitalization also means a low cost of funding for the lenders, and this also serves China’s overall plan of reducing financing costs,” said Yi Xianrong, a researcher with the Chinese Academy of Social Sciences, a research agency that sometimes advises the Chinese government.\nChina also needs policy lenders to finance risky projects, Yi said. “Some projects will be too risky for commercial lenders, and there’s a need for the policy lenders to be active,” he said.", "external_links": [], "published": "2015-07-28T06:00:00.000+03:00", "crawled": "2015-07-28T01:34:11.231+03:00", "highlightTitle": ""}