{"organizations": ["World Bank Approves Huge Budget Support Ghana"], "uuid": "86e7d89682b5abd51a04cccdc6c3b4c63d3a8142", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507190214.html", "country": "US", "title": "Ghana: World Bank Approves Huge Budget Support", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Ghana: World Bank Approves Huge Budget Support", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T23:24:00.000+03:00", "replies_count": 0, "uuid": "86e7d89682b5abd51a04cccdc6c3b4c63d3a8142"}, "author": "", "url": "http://allafrica.com/stories/201507190214.html", "ord_in_thread": 0, "title": "Ghana: World Bank Approves Huge Budget Support", "locations": ["Ghana", "Nigeria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ghana's Economy to Get Major Boost Tagged: Nigeria: Twin Blasts Leave Over a Dozen Dead press release \nThe World Bank Group's Board of Executive Directors today approved US$150 million budget support for Ghana. The credit from the International Development Association (IDA)* supports the First Macroeconomic Stability for Competitiveness and Growth Development Policy Financing (DPF), the first of three development policy financing operations aimed at helping the Government of Ghana stabilize its economy and shore up fiscal control by implementing financial policies and processes that are transparent and predictable. The Board also approved IDA's very first landmark Policy-Based Guarantee (PBG) of up to US$400 million for Ghana, which may be used to support Ghana's future external debt financings. \n\"The proposed credit is the first in a programmatic series that will make policy more predictable and enhance the productivity of public spending.\" says Santiago Herrera, World Bank Task Team Leader for this Project. \"As Ghana transitions from concessional financing towards market-based financing, the cost of public funds will increase, and so would the productivity of public capital to ensure that future obligations can be met. It is our hope that that PBG will minimize costs and risks.\" Related Topics Nigeria: Twin Blasts Leave Over a Dozen Dead \nFollowing a period of high and sustained growth, the Ghanaian economy experienced considerable turbulence reflected in high twin deficits and low growth. Twin deficits exceeded 10% of GDP, and GDP growth collapsed to 4% last year after reaching 14% in 2012. Ghana was hit by a series of external and domestic shocks which have shaken its economy fundamentals very hard. Consequently, international reserves dwindled, the Cedi depreciated, public debt rose quickly, and interest rates rose sharply. Policy uncertainty prevailed and real economic growth slumped. A major obstacle to the restoration of macroeconomic stability in Ghana is the level and composition of government debt: total debt had risen to 65% of GDP at the end of 2014 and amortizations have almost doubled from what they were two years ago. \nIn a recent address to Parliament, Seth Terkper, Ghana's Finance Minister stated: \"... the Government has been intensifying the implementation of measures approved in the 2015 Budget. The purpose is to address the revenue shortfalls, ensure the achievement of the objectives of the ongoing fiscal consolidation, and keep borrowing in line with the levels approved in the 2015 Budget. We will continue to strengthen the Public Financial Management system and deepen structural reforms in the public sector as part of the overall objective of ensuring transparent and accountable economic governance... \" \nIn the context of rising interest rates and a depreciating currency, extending the maturity of public domestic debt became a daunting task, and debt mangers were forced to issue short term debt to avoid committing future budgets at unsustainable high interest rates. While the financial objective was achieved, it was done at the expense of rising rollover and liquidity risks. Amortization of short term domestic debt reached the equivalent of 31% of GDP. Hence, debt composition became a source of risk, trapping debt managers in a vicious circle of short maturity-high risk-currency depreciation-high debt levels. To ensure that there is a significant change in the amortization profile of the current debt, the IDA is being deployed for this purpose. A Bank guarantee is a critical instrument in such circumstances as it leverages limited IDA resources: US$100 million of IDA resources allocated to Ghana would allow the deployment of a US$400 million PBG supporting up to a US$1.0 billion financing by Ghana. \n\"We are delighted to have made history today, by pioneering this innovative policy-based guarantee facility, the first ever by the IDA, to a long standing client who needs it most urgently,\" notes Yusupha B. Crookes, World Bank Country Director for Ghana. \"We hope this will provide additional space to Ghana to sort out some of its short-term economic challenges and continue to provide for its poorest and most vulnerable citizens through its social safety nets programs.\" \nTo ensure that the most vulnerable in society are not inequitably affected by the Government's strong fiscal adjustment, the Bank Group has over the past several years supported the expansion of the Livelihood Empowerment against Poverty (LEAP) program, a social safety net that provides cash transfers to the poorest families in Ghana. This current facility included a component by which about 350,000 poor households will be provided with cash transfers by 2017. Ghana \nGhana Black Queens coach, Yussif Basigi has admitted his charges will be the overwhelming underdogs when they face 'Les … see more » Copyright © 2015 World Bank. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-19T23:24:00.000+03:00", "crawled": "2015-07-19T23:32:31.494+03:00", "highlightTitle": ""}