{"organizations": [], "uuid": "ebcb7ed1dc777b87a662c3eac774380112c6f49a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/h/9/x/i/image.related.afrArticleLead.620x365.giggcm.png/1437475352599.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/cba-boss-ian-narev-says-his-worst-moments-were-facing-victims-of-financial-advice-scandal-20150721-giggcm", "country": "AU", "title": "CBA boss Ian Narev says his worst moments were facing victims of financial advice scandal", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "CBA boss Ian Narev says his worst moments were facing victims of financial advice scandal | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T14:19:00.000+03:00", "replies_count": 0, "uuid": "ebcb7ed1dc777b87a662c3eac774380112c6f49a"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/banking-and-finance/cba-boss-ian-narev-says-his-worst-moments-were-facing-victims-of-financial-advice-scandal-20150721-giggcm", "ord_in_thread": 0, "title": "CBA boss Ian Narev says his worst moments were facing victims of financial advice scandal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ian Narev said in seeking to compensate victims, CBA was not dealing with a simple product recall. Louise Kennerley by James Eyers and Clancy Yeates The chief executive of the Commonwealth Bank of Australia, Ian Narev, has defended delays in compensating victims caught up in the bank's financial advice scandal while describing fronting them to hear their complaints as the worst moments of his career.\nThe advice scandal at CBA involved low-risk financial advice clients being put into high-risk investments that lost money over almost a decade. The bank attempted to cover up the conduct, which was highlighted by a damning Senate committee report last June that followed a series of reports by Fairfax Media .\nIn a lunchtime speech in Sydney on leadership, Mr Narev said in seeking to compensate victims CBA was not dealing with a simple product recall. It was having to reconstruct statements of advice from many years ago, which was proving to be a complex and time-consuming process.\nAsked by an audience member what had been the worst day in his job as chief executive over the past four years, Mr Narev said the worst moments were \"undoubtedly\" those spent meeting customers who had been let down by the bank.\n\"Sitting as the chief executive of an institution opposite a customer who the institution has let down, and even if the institution let down the customer seven, eight, nine, 10 years ago, I'm there representing that institution,\" he said.\n\"Hearing what it was like to deal with the institution through the eyes of that customer are undoubtedly the worst moments, and that has happened particularly in the context of the advice issues but also more broadly – unfortunately there are times we're not doing the right things by customers.\n\"What we weren't doing a good enough job with was listening to those voices saying 'Actually the experience we had wasn't the right experience, and we have more to tell you'.\"\nCBA has paid $52 million in compensation to victims of the advice debacle and is considering claims lodged by many more customers. The bank said in May it had offered compensation to 13 per cent of customers whose files were assessed under its \"open advice review program\", which was established last year after the Senate report. Under that program, which is employing almost 500 full-time equivalent staff, CBA has offered a further $562,513 in compensation as at the end of April.\n Critics of the program were right to say the process is taking a long time, Mr Narev told the lunch, organised by the Financial Services Council and Deloitte. \"But for those of you working in the financial services sector who understand the bespoke nature of advice, you understand [we] are not dealing with a product recall, [but are] having to recreate statements of advice going back a decade.\n\"We have catalogued 900,000 documents. That is the way to listen to customers and put it right. You have to understand in the short term you will bear some criticism from appearing slow. But in the long term you are making sure you are putting things right going back 10 years, paying interest on the money and fast-tracking hardship cases.\"\nMr Narev said he had been confronted by the stories of victims of the scandal and it was their stories rather than external pressure from the media or politicians that made the bank change its defensive stance.\n\"Sitting down face-to-face in front of individual customers affected and hear what it was like for them, their parents, their relations, to have had the bad experience with Commonwealth Bank ... when you heard that experience and listened and put yourself in the shoes of the customer, then the institution took a different view.\"\nIt will be four years on Wednesday since Mr Narev was announced as CEO of CBA.\nAs banks weigh up who will wear $12 billion in extra capital costs, after the prudential regulator said banks need to hold more capital against mortgages, Mr Narev said there need not be any conflict between the interests of customers and shareholders.\nUnder the new rules, CBA will be forced to raise an estimated $4 billion in capital in under a year, and a critical question for investors is whether this extra cost will be borne by bank shareholders or if the bank can pass it on to customers.\nBut Mr Narev argued \"customer engagement\" and \"the profit motive\" could exist side by side. \"Although it is tempting sometimes to characterise the customer engagement goal and the shareholder goal as conflicting, as long as we are thinking for the long term those two things can be achieved together,\" he said.\nHe refused to take questions from the media.", "external_links": ["http://www.smh.com.au/business/banking-and-finance/commonwealth-bank-financial-planning-compensation-offer-exceeds-500k-20150529-ghcah7.html", "http://www.smh.com.au/business/banking-and-finance/apra-lifts-mortgage-capital-on-big-banks-by-billions-of-dollars-20150720-gify5r", "http://www.smh.com.au/business/profit-above-all-else-how-cba-lost-savings-and-hid-its-tracks-20130531-2nhde.html"], "published": "2015-07-21T14:19:00.000+03:00", "crawled": "2015-07-21T18:07:32.954+03:00", "highlightTitle": ""}