{"organizations": [], "uuid": "1033f49f44a0e667a6b5ee40900faaf2693984f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507030810.html", "country": "US", "title": "South Africa: Sick Miners - Time for the Mines to Share the Burden", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Sick Miners - Time for the Mines to Share the Burden", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T12:33:00.000+03:00", "replies_count": 0, "uuid": "1033f49f44a0e667a6b5ee40900faaf2693984f6"}, "author": "", "url": "http://allafrica.com/stories/201507030810.html", "ord_in_thread": 0, "title": "South Africa: Sick Miners - Time for the Mines to Share the Burden", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Govt Threatens to Withdraw Tax Concessions for Mines \nBut Professor Rodney Ehrlich of the School of Public Health and Family Medicine at the University of Cape Town told the parliamentary portfolio committee on mineral resources last month, \"there is still a steady flow of annual silicosis cases in mineworkers still in service, of around 1,5,00 to 2,000 per year.\" \nAnd, he warned, lack of data makes it almost impossible to assess progress. The Medical Bureau for Occupational Diseases (MBOD), which verifies diagnosis of silicosis and TB and conducts autopsies of mineworkers who die of any cause to establish compensable disease, has not published an annual report since 2000 - in spite of a statutory obligation to do so. And not all mining companies comply with the requirement to publish the number of silicosis cases diagnosed at mine hospitals and clinics in their annual reports, leading to a biased database. \n\"Due to the latency period of 15-20 years for silicosis to appear on lung X-rays, we will have to wait until 2028 to know for sure whether the target has been met, though ongoing cardio-vascular organ autopsies on mineworkers who die of any cause in service may give some advance warning,\" Ehrlich told the committee. \nEhrlich runs one of only three specialised clinics dealing with ex-miners, the other two being in Durban and at the National Institute of Occupational Health. He is a world-renowned epidemiologist in the field of silicosis and TB in Southern Africa. He gave expert testimony in the negligence case against Anglo American on behalf of the 30 or so sick former mineworkers who worked at President Steyn mine, which ended after ten years of litigation with an out-of-court settlement in favour of the surviving workers towards the end of last year. \nThe committee also heard from Godfrey Oliphant, Deputy Minister of Mineral Resources, and David Msiza, Chief Inspector of Mines at the Department of Mineral Resources. Their testimony showed that the state is trying to approach the question of prevention of occupational disease in the mines in a coordinated way and to link up prevention, compensation and rehabilitation of ex-mineworkers. \nThe same cannot be said for the mining industry. \nEhrlich recommended several measures that might be taken to ease the \"crisis\" in the under-resourced and under-staffed system of compensation under the Occupational Diseases in Mines and Works Act (ODIMWA), administered by the Department of Health. \nFirst, he suggested that the administration costs of the Medical Bureau for Occupational Diseases and of the of ODIMWA - about R55 million a year - should be financed through the statutory levies that mines must pay to the compensation fund, instead of by the taxpayer. This would imply further increases in the levies. \nSecond, he suggested that the backlog of uncompensated but medically certified claims stuck in the ODIMWA administration, estimated by the Commissioner to be 104,000, could be eased by outsourcing the administration to an agency such as the Rand Mutual Association, \"under the oversight of the ODIMWA Commissioner.\" \nHe said benefits should be inflation-linked: \"the failure of even the meagre benefits available to mineworkers to keep up with inflation since the 1970s should be rectified.\" \nHe also suggested greater flexibility within the Medical Bureau for Occupational Diseases, which has a backlog of 8,000 claims. Currently, the medical director of the bureau must be present at each medical certification. \nPrevention of further disease involved keeping dust levels down through ventilation of underground working places, and wetting down processes, which were incorporated into the Mine and Works Act from the early part of the 20th century. Masks were not effective, Ehrlich said, because workers simply don't use them in the extreme heat underground, especially when they need to communicate with each other for safety reasons. \nEhrlich pointed out that the mines had promised that by 2008, 95% of the dust exposure measurements for mineworkers would be below the statutory exposure limit. According to the department of mineral resources, this target was reached in 2013 - but the limit is twice as high as the internationally recognised safe limit. And there has been no independent verification of the dust monitoring conducted by the mines and reported to the department. \n\"We need independent verification of dust measurements, and public accountability by publishing annual dust reports,\" Ehrlich said. \nThe government is now rolling out centres for sick former miners, Deputy Minister Oliphant told the committee. \nSo far 4,000 former miners have been seen at the centre at the Nelson Mandela Hospital in Mthatha, opened in 2014. A total of 3,000 have been seen at the Carltonville centre, 700 in Kimberley, and in Mpumalanga local doctors and clinics are being drawn into collaboration with the initiative. \nCentres are also being established in Kuruman and Burgersfort, to deal with the legacy of asbestos mining in those areas. Centres are to be opened in other parts of the country and in Lesotho, Swaziland, and Mozambique. \nThe centres provide clinical examinations, rehabilitation and assessment of disability, diagnostic testing, health promotion, TB counselling and testing, assistive devices, and referrals to specialists where necessary,\" he said. The Department of Health was looking into providing meals for miners reporting at the centres. \nOn the track and trace project, Oliphant said that the Home Affairs Department was involved; radio communication was being used to alert former miners to the project, as well as the House of Traditional Leaders. Government was also considering mobile units to contact and serve the needs of ex-miners in remote and isolated districts. \n\"But the Chamber of Mines did not come to the table voluntarily, and came late,\" he said, urging the Chamber to make all data freely available to the government. \nOliphant estimated that there is a backlog of 700,000 files of claims that have not been assessed at the Medical Bureau. \n\"In the last decade,\" the Department of Mineral Resources' Msiza told the committee, \" the number of miners dying in service from mine accidents has come right down, and is now exceeded significantly by the numbers that die from silicosis and TB, which have still not stabilised.\" \nThe department, he said, had issued guidelines to mines under the Mines Health and Safety Act for medical surveillance and personal dust exposure monitoring and reporting, and linking the two in personal medical records. \nThe department was also considering appointing an independent agency to verify dust sampling results submitted by the mines, and was steering legislation through parliament to reduce the exposure limit. The department would not hesitate to use the law to temporarily remove miners from workplaces where the limit was exceeded, Msiza said, and to fine the mines concerned. \n\"Mines are complaining about this, but some CEOs are beginning to respond. \" \nThere was little tolerance in the committee for the tardiness of the mining industry in stepping up to the plate, and a suggestion was made that occupational health of miners should be built into CEOs' performance evaluations. \nMembers pointed out that the argument used by the Chamber of Mines against rises in the compensation premiums paid by mines - that today's mining companies cannot be held responsible for past exposure of miners to dust in companies which no longer exist - had been dealt with over the issue of acid mine drainage. \nIn that case, the courts had ruled that current mines did have responsibility to prevent ground water contamination. The same principle should apply in the case of lung disease, committee members said. \nThe gold mining industry, after doing nothing to address the issue of respirable disease amongst black former mineworkers for 100 years, now finds itself caught between class action litigation over realistic compensation for damages by thousands of sick ex-miners against scores of mining companies, and the increasing ODIMWA premiums that the state is pursuing to build the costs of compensation of sick ex-miners into operating costs for the mines. \nThe government and parliament are uncovering and debating the burden of disease among former miners, and the question of prevention of disease for current and future generations of mineworkers. After decades of obfuscation, denial, and litigation, it is time for the industry to come to the party. \nPete Lewis is a former senior researcher at the Industrial Health Research Unit at the University of Cape Town. The views expressed in this article do not necessarily reflect those of GroundUp. South Africa \nEFF leader Julius Malema will be in Marikana on Friday to lay criminal charges against Deputy President Cyril Ramaphosa … see more » Copyright © 2015 GroundUp. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-03T12:33:00.000+03:00", "crawled": "2015-07-03T18:52:31.000+03:00", "highlightTitle": ""}