{"organizations": [], "uuid": "44811e2a520ff2752ea4af89edb391c28d35d63c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/g/e/2/s/image.related.afrArticleLead.620x365.gig8xl.png/1437389448892.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/economy/low-income-families-hardest-hit-by-15pc-gst-20150720-gig8xl", "country": "AU", "title": "Low income families hardest hit by 15pc GST", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Low income families hardest hit by 15pc GST | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T15:14:00.000+03:00", "replies_count": 0, "uuid": "44811e2a520ff2752ea4af89edb391c28d35d63c"}, "author": "Share via Email", "url": "http://www.afr.com/news/economy/low-income-families-hardest-hit-by-15pc-gst-20150720-gig8xl", "ord_in_thread": 0, "title": "Low income families hardest hit by 15pc GST", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Low-income families would be hardest hit if the GST was increased to 15 per cent a survey has found. Louie Douvis Share on twitter by Misa Han Households should be prepared to pay an average of $2900 more a year if the GST is increased to 15 per cent .\nModelling by NATSEM at the University of Canberra showed the average household would be up for an extra $2915 GST a year, or 9.3 per cent of their income.\nBut the bottom 20 per cent of households would be hardest hit by a 5 percentage point rise; those on average incomes of $41,000 would spend 11 per cent of their income on GST or $4500 a year, while the top 20 per cent, on average incomes of $181,000, would spend $14,000 – or a little less than 8 per cent of their annual income.\nNATSEM's Ben Phillips said the government would be expected introduce a compensation package given the regressive nature of the tax.\n\"Middle and higher income families are saving more and spending a higher proportion of their income on things like education, mortgage and superannuation, which are GST-free.\n\"On the other hand you would find low-income families will be spending most of the money they receive. If you take low-income families, like pensioners or those on unemployment benefits, who are no longer in the tax system, most of the tax they pay would be GST rather than income tax. So if you increase the rate or broaden the GST, you would expect there would need to be a compensation package or increased government support.\"\nSocial Services Minister Scott Morrison said on Monday that increasing the GST was a \"very expensive change\" and he would expect to spend more on welfare payments to compensate those on low incomes.\nThe NATSEM modelling took the most recent Australian Bureau of Statistics survey on household expenditure undertaken in 2009-10 and inflated it to December 2014 levels. The modelling assumed there would be no change in consumer behaviour if the rate increased.\n ", "external_links": ["https://twitter.com/misahan"], "published": "2015-07-20T15:14:00.000+03:00", "crawled": "2015-07-20T22:47:16.415+03:00", "highlightTitle": ""}