{"organizations": ["Zurich Insurance"], "uuid": "b4d5aaa0d616dce259b74321aa04a3a03de4dac4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-insurance/?format=rss", "section_title": "Insurance News | Advice | Guides - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/zurich-insurance-says-rsa-offer-052432324.html", "country": "GB", "title": "Zurich Insurance says any RSA offer likely to be all in cash", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Zurich Insurance says any RSA offer likely to be all in cash", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T08:24:00.000+03:00", "replies_count": 0, "uuid": "b4d5aaa0d616dce259b74321aa04a3a03de4dac4"}, "author": "", "url": "https://uk.finance.yahoo.com/news/zurich-insurance-says-rsa-offer-052432324.html", "ord_in_thread": 0, "title": "Zurich Insurance says any RSA offer likely to be all in cash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 29, 2015, 06:51 BST - UK Markets open in 1 hr 9 mins Zurich Insurance says any RSA offer likely to be all in cash Reuters - UK Focus – 26 minutes ago 291.00 -5.40 \nZURICH, July 29 (Reuters) - Zurich Insurance Group said any offer it might make for British rival RSA would probably be in cash. \nCash-rich Zurich is weighing a bid for RSA which could top $8 billion as insurers look to diversify amid tighter regulations and toughening market conditions. \n\"Further to the announcement issued on July 28, 2015, in relation to RSA Insurance Group plc, Zurich Insurance Group Ltd confirms that it is likely that any offer, if made, will be solely in cash. No disclosure under Rule 2.10 of the City Code on Takeovers and Mergers will therefore be made in relation to securities in Zurich,\" it said in a statement on Wednesday. (Reporting by Michael Shields; Editing by Maria Sheahan) Tax cuts, pensions, childcare, online accounts and beer duty, here's … Related Stock Articles Follow the quotes you care about most. Access timely news and investment updates to stay on top of the market. … More » Yahoo UK & Ireland Finance Terms \nQuotes are real-time for NASDAQ, NYSE, and NYSEAmex when available. See also delay times for other exchanges . Quotes and other information supplied by independent providers identified on the Yahoo! Finance partner page . Quotes are updated automatically, but will be turned off after 25 minutes of inactivity. Quotes are delayed at least 15 minutes. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. Neither Yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. By accessing the Yahoo! site, you agree not to redistribute the information found therein. \nFundamental company data provided by Capital IQ . Historical chart data and daily updates provided by Commodity Systems, Inc. (CSI) . International historical chart data and daily updates provided by Morningstar, Inc . Yahoo! - News Network", "external_links": [], "published": "2015-07-29T08:24:00.000+03:00", "crawled": "2015-07-29T08:52:52.944+03:00", "highlightTitle": ""}