{"organizations": ["KKR"], "uuid": "417edf964439f7704e03f4f30b95ea0e987df82d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=KKR", "section_title": "Yahoo! Finance: KKR News", "url": "https://uk.finance.yahoo.com/news/kkr-reggeborgh-announce-partnership-strong-080100042.html", "country": "GB", "title": "KKR and Reggeborgh Announce Partnership For Strong Expansion Of Deutsche Glasfaser", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "KKR and Reggeborgh Announce Partnership For Strong Expansion Of Deutsche Glasfaser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T11:01:00.000+03:00", "replies_count": 0, "uuid": "417edf964439f7704e03f4f30b95ea0e987df82d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/kkr-reggeborgh-announce-partnership-strong-080100042.html", "ord_in_thread": 0, "title": "KKR and Reggeborgh Announce Partnership For Strong Expansion Of Deutsche Glasfaser", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Jul 20, 2015, 11:22 BST - UK Markets close in 5 hrs 8 mins KKR and Reggeborgh Announce Partnership For Strong Expansion Of Deutsche Glasfaser Press Release : KKR – 2 hours 21 minutes ago +0.01 \nLONDON & RIJSSEN, Netherlands & BORKEN, Germany--(BUSINESSWIRE)-- €450m earmarked for ambitious investment program in the roll-out of fibre optics infrastructure in rural and suburban parts of Germany. \nKKR, a leading global investment firm, and Reggeborgh (“RB”), a leading Dutch investment firm, today announced a partnership for the strong expansion of Deutsche Glasfaser (“DG”). DG plans, constructs, and operates fibre-optic networks in Germany and provides German households and companies with fast broadband connections. KKR will acquire a majority stake in DG, which is currently fully owned by Reggeborgh. In a joint effort, the two partners will provide DG with the long-term capital to embark on an ambitious growth program whereby approximately €450m is to be invested in the further roll-out of the German fibre optics infrastructure over the next few years. \nDeutsche Glasfaser focuses on the rural and suburban parts of Germany and is active across the entire value chain, from passive to active infrastructure up to acting as an internet service provider. As a fibre-to-the-home (“FTTH”) business, DG has already connected about 100,000 German households and companies to its fibre-optic network, which is the fastest broadband access technology in the world. \nData traffic and internet usage are constantly increasing, favoring high bandwidth provisions such as fibre technology. At the same time, broadband penetration in Germany is still significantly below the European average. With its planned investments, DG will help to connect more people with its high-speed fibre-optic network and thereby also support the German government in its ambition to achieve 100 percent broadband coverage with at least 50 megabit per second by 2018. \nJohannes Huth, Member and Head of KKR Europe, Africa and Middle East, said: \"We are excited to partner with Reggeborgh in building a top infrastructure company. With our capital resources and experience, we will bring Deutsche Glasfaser to its next stage of development and thereby also contribute to the ambitious Digital Agenda of the German government.” \nJesús Olmos, Member and Head of European Infrastructure at KKR, said: “Deutsche Glasfaser is a blueprint for the type of investments our infrastructure fund is targeting in Europe: building a partnership with a best-in-class company, and investing significant amounts of capital to grow a business with strong infrastructure characteristics. We are very excited about this new addition to our European portfolio as it opens up opportunities in a new and promising sector – telecom infra – alongside our existing investments in renewables, water, district heating, parking and rolling stock.” \nHenry M. Holterman, CEO of Reggeborgh, said: “We have ambitious plans to bring the fastest broadband access technology in the world to the German citizens. With its deep capital base and its longstanding country and sector experience, KKR is the right partner to accelerate the realization of our ambitions.” \nKKR has a more than 20-year track record of investing in technology and telecommunications. In Germany, KKR built-up Versatel, the leading German fibre-based fixed line telecom provider which owns the second largest fibre infrastructure in Germany after Deutsche Telekom. \nSince 1999, KKR deployed more than $4.7 billion of equity in 15 German companies, working both with trusted German partners such as Siemens, Bosch, Daimler, Linde and Bertelsmann, as well as with innovative entrepreneurs of leading companies such as WILD Flavors and Arago. Currently, 28 of KKR’s global portfolio companies have operations in Germany and employ more than 20,000 people in the country. \nThe investment is funded by KKR’s Infrastructure Fund II. \nThe transaction is subject to customary closing conditions, including relevant antitrust clearance. \nAbout KKR \nKKR is a leading global investment firm that manages investments across multiple asset classes including private equity, energy, infrastructure, real estate, credit and hedge funds. KKR aims to generate attractive investment returns by following a patient and disciplined investment approach, employing world-class people, and driving growth and value creation at the asset level. KKR invests its own capital alongside its partners' capital and brings opportunities to others through its capital markets business. References to KKR's investments may include the activities of its sponsored funds. For additional information about KKR & Co. L.P. (NYSE:KKR), please visit KKR's website at www.kkr.com . \nAbout Reggeborgh \nReggeborgh is a Dutch private investment company and long-established family business. Reggeborgh formed in 1990 and quickly gained a reputation as experts in the construction and infrastructure markets. Since then, Reggeborgh developed into an independent investor focusing on strategic, long-term market opportunities. Reggeborgh has a strong, diverse portfolio with a proven track record. \nAbout Deutsche Glasfaser \nDeutsche Glasfaser’s goal is to become the market leader in the FTTH market in Germany. Deutsche Glasfaser’s strategy and vision is based on the offering of services across the entire FTTH value chain ranging from marketing its services directly to end-users via its own ISPs, providing white label services to other service providers and providing dark fibre services to interested carriers / ISPs. Founded in 2012, Deutsche Glasfaser has its origin in the Reggeborgh Group, a Dutch investment firm which until recently also owned Reggefiber, one of the most important network supplier companies in the Netherlands. For further information, please visit www.deutsche-glasfaser.de . ### View source version on businesswire.com: http://www.businesswire.com/news/home/20150720005459/en/ Contact", "external_links": [], "published": "2015-07-20T11:01:00.000+03:00", "crawled": "2015-07-20T13:23:17.404+03:00", "highlightTitle": ""}