{"organizations": [], "uuid": "192925ab8f8e76a1a250083130cf9f2566325f09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/download/pic/main/main/csiid/00301124:63419ca1e8aa801dbca01c472f3ae447:arc614x376:w1200.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507110033.html", "country": "US", "title": "Africa: International Financial Institutions Announce $400 Billion to Achieve Sustainable Development Goals", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: International Financial Institutions Announce $400 Billion to Achieve Sustainable Development Goals", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T04:13:00.000+03:00", "replies_count": 0, "uuid": "192925ab8f8e76a1a250083130cf9f2566325f09"}, "author": "", "url": "http://allafrica.com/stories/201507110033.html", "ord_in_thread": 0, "title": "Africa: International Financial Institutions Announce $400 Billion to Achieve Sustainable Development Goals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya: 56 Percent of Kenyans Live in Slums, UN Habitat Says \nThe SDGs are ambitious and demand equal ambition in using the \"billions\" of dollars in current flows of official development assistance (ODA) and all available resources to attract, leverage and mobilize \"trillions\" in investments of all kinds--public and private, national and global. \nODA, estimated at $135 billion a year, provides a fundamental source of financing, especially in the poorest and most fragile countries. But more is needed. Investment needs in infrastructure alone reach up to $1.5 trillion a year in emerging and developing countries. Meeting the staggering but achievable needs of the SDG agenda requires everyone to make the best use of each dollar from every source, and draw in and increase public and private investment. The MDBs--the engines of development finance--are looking to a range of options for scaling up. \nMDB development finance has grown from $50 billion in 2001 to $127 billion in 2015. For each dollar invested by its shareholders, MDBs are able to commit $2-5 in new financing each year. The MDBs' own direct private sector investments have increased fourfold over this period. They mobilize an additional $2-5 in private investment for every dollar they invest directly in private sector operations. The vow to increase their contribution to more than $400 billion over the next three years reflects in part efforts to make even better use of their balance sheets. \nAdditional steps to leverage more resources include the development of new approaches and tools to help developing countries play a stronger role in harnessing national resources. The MDBs and the IMF are partnering with countries on, for example, the introduction of a new toolkit to assess and improve tax policies and expanding instruments such as e-procurement to achieve better government spending. \nIncreasing external resource flows to developing countries for investment is essential to achieving the SDGs--but these flows can be expected to materialize only in circumstances where countries have coherent development strategies consistent with maintaining macroeconomic stability while also ensuring the delivery of key public sector services and a business environment supportive of growth. \nThrough their policy advice and technical assistance, the MDBs and IMF support countries in designing economic policies to achieve these objectives; through MDB policy support loans and IMF-supported programs, these institutions provide general financial support towards meeting budgetary and balance of payments needs. \nThe private sector is playing an increasing role in financing goods, services and infrastructure. The MDBs are committed to engaging differently with private sector partners on a wide range of interventions, including connecting investors with opportunities, helping countries make investments more attractive, and building local financial markets. \nThe MDBs are also partnering with others to develop innovative financing approaches to support global needs, such as health and climate, building on extensive work already underway. \nQuotes from Heads of Multilateral Development Banks \nDonald Kaberuka, President, AfDB \n\"2015 is a critical year in charting the development future of Africa - the continent that still has the greatest development needs, and the continent that presents the greatest opportunity - for itself and for the world. The level of collaboration among the MDBs in preparing the Financing for Development conference has been unprecedented, in coming up with innovative solutions to scale up development financing. One such is sovereign exposure exchange, where the African Development Bank is working closely with the World Bank and the Inter-American Development Bank to stretch our balance sheet so that we can scale up lending to our clients in North Africa.\" \nTakehiko Nakao, President, ADB \n\"This is a critical time for governments, the private sector and MDBs to come together to tackle the fundamental development challenges of our time. For its part, ADB has already taken the groundbreaking step to strengthen its lending capacity. By merging concessional and non-concessional lending windows ADB will be able to increase its financing to member countries by 50 percent. With its support to the private sector, including the recent establishment of the Office of Public-Private Partnerships, ADB will intensify its efforts to unlock the enormous private resources available in the Asia and Pacific region for development financing.\" \nWerner Hoyer, President, EIB \n\"Sharing technical and financial experience is crucial to successfully tackle climate change and ensure that sustainable development can benefit future generations. The European Investment Bank has worked closely with the other MDBs for many years to strengthen climate action, infrastructure and private sector investment that improves lives around the world. We share the firm commitment of the world's public banks to further support investment in the years ahead that contributes to achieving the SDG's by unlocking green growth, supporting transition to cleaner energy and fostering innovation.\" \nSuma Chakrabarti, President, EBRD \n\"Scaling up our impact and investment from all sources for sustainable development means we must marshal policy advice and knowledge along with financing. At EBRD we aim to galvanise private finance to support investments, especially in infrastructure, including sustainable energy and the fight against climate change. Crucially, in order to successfully attract private investment to serve these public goals we also advise on policies that improve the regulatory framework and strengthen institutions.\" \nLuis Alberto Moreno, President, IDB \n\"It's essential for multilateral banks and the IMF to work closely with each other, as well as with governments and the private sector to mobilize the additional resources needed to achieve the Sustainable Development Goals. We all share the same goals, which include reducing poverty and inequality, promoting economic growth and productivity that creates well-paid jobs, improving social and physical infrastructure, pursuing sustainable energy policies, ensuring food security and protecting biodiversity, among other pressing challenges. The IDB's recent decision to create a separate entity to deal exclusively with our private sector portfolio shows our commitment to tapping all possible sources of development funding.\" \nChristine Lagarde, Managing Director, IMF \n\"This year marks a once-in-a-generation opportunity for global development. The only way to seize it is through partnership. To go far, we must go together. The IMF--with its global membership and mandate to promote economic growth and stability--is a committed partner. In this pivotal year, we have targeted areas where providing additional support will have strong payoffs: we have just increased access to all our concessional loan facilities by a full 50 percent; we are set to expand our large program of support to developing countries in mobilizing domestic tax revenues; and we will deepen our policy engagement with countries on key development issues such as addressing infrastructure needs and promoting equity and inclusion. \nJim Yong Kim, President, World Bank Group \n\"We must cast away the stereotypes of aid and think about development differently. It's about creating opportunity for all, giving people an equal chance to succeed in life, and preparing the world to deal with the challenges of climate change and the next pandemic. We need trillions, not billions, of dollars to accomplish these goals, and the money will come from many sources: developing countries, private sector investment, donors, and international financial institutions. By working together, we can help people build better lives with good education, quality health care, clean water, and proper sanitation. Those investments in people will help end extreme poverty in just 15 years.\" \nContacts \nJoel Kibazo, j.kibazo@afdb.org, +225 01 22 98 98 \nOlivia Ndong Obiang, O.ndong-Obiang@afdb.org, +225 01 56 05 05 \nAsian Development Bank \nHarumi Kodama, hkodama@adb.org, +63 908 888 6701 \nEuropean Investment Bank \nRichard Willis, willis@eib.org, +352 437982155 \nEuropean Bank for Reconstruction and Development \nAnthony Williams, williama@ebrd.com, +44 7841181878 \nInter-American Development Bank \nPaul R. Constance, paulc@iadb.org, +202-623-2572 \nIMF \n(In Addis Ababa) Andrew Kanyegirire, akanyegirire@imf.org, +202-623-9869 \n(In Washington, DC) Ismaila Dieng, idieng@imf.org, +202-623-9758 \nWorld Bank Group \n(In Addis Ababa) Angela Gentile, agentile@worldbank.org, +202-621-4955 \n(In Washington, DC) David Theis, dtheis@worldbankgroup.org, +202-458-8626 More on This", "external_links": [], "published": "2015-07-11T04:13:00.000+03:00", "crawled": "2015-07-11T17:45:05.000+03:00", "highlightTitle": ""}