{"organizations": ["HDFC Bank"], "uuid": "fc446d4806dfbf896134c4acec09e0e983ab4b42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48212458,width-600,resizemode-4/hdfc-bank-to-roll-out-micro-atms-across-india.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358319.cms", "section_title": "Banking-Banking/Finance-Industry-The Economic Times", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/hdfc-bank-to-roll-out-micro-atms-across-india/articleshow/48212427.cms", "country": "IL", "title": "HDFC Bank to roll out ‘micro-ATMs’ across India", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "HDFC Bank to roll out ‘micro-ATMs’ across India", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T08:58:00.000+03:00", "replies_count": 0, "uuid": "fc446d4806dfbf896134c4acec09e0e983ab4b42"}, "author": "", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/hdfc-bank-to-roll-out-micro-atms-across-india/articleshow/48212427.cms", "ord_in_thread": 0, "title": "HDFC Bank to roll out ‘micro-ATMs’ across India", "locations": ["Tamil Nadu", "Punjab", "MUMBAI", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pandey", "Vikas Pandey"], "text": "ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! MUMBAI: HDFC Bank is rolling out handheld machines across India that could work just like ATMs through which customers in rural areas, where setting up full-fledged ATM kiosks is proving to be commercially unviable, can carry out most banking transactions. Launched less than a year ago, currently through about 1,550 such 'micro ATMs' the bank sees transactions aggregating about Rs 1 crore a month in rural areas. Going forward, these machines could be used in the rural areas for payment to pensioners and direct benefit transfers under MGNREGA, and in the urban areas to ease pressure on bank officers in branches that are crowded with customers, said Vikas Pandey, head-strategic projects, HDFC Bank. Similar to swipe machines used for debit and credit cards payment at malls, shops, restaurants and other merchant establishments, micro-ATMs are capable of even biometric verifications using Aadhaar, including instant e-KYC for customers. \"After an Aadhaar number is fed into the machine and biometric (verification) is done for the same Aadhaar number, it's connected to the UIDAI server which almost instantaneously verifies and gives out the results for KYC,\" the HDFC Bank official said. The e-KYC is in addition to cash withdrawal and deposit, account statement, disbursement of preapproved loans and several other banking transactions that these micro-ATMs are capable of carrying out. For example, in some villages in Punjab, bank's customers are informed of a prefixed time and location (usually the gurdwara in the locality) where they could carry out banking transactions on micro-ATMs, bank officials said. Now the bank is in the process of integrating pension payments for the Tamil Nadu government , which will use biometric verification for added security, Pandey said. The bank sees transactions worth about Rs 1 crore a month in rural areas through about 1,550 such 'micro ATMs'.  ", "external_links": [], "published": "2015-07-25T08:58:00.000+03:00", "crawled": "2015-07-25T09:06:31.461+03:00", "highlightTitle": ""}