{"organizations": [], "uuid": "5a6fea696053eeb921fe4f3ea19e074c50e90c6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DO780_roadtr_MG_20150624193503.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/10-great-cars-for-a-summer-road-trip-2015-06-27", "country": "US", "title": "10 great cars for a summer road trip", "performance_score": 0, "site": "marketwatch.com", "participants_count": 30, "title_full": "10 great cars for a summer road trip - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T03:00:00.000+03:00", "replies_count": 33, "uuid": "dd3706896c12c018b9e89eddce880befbe3f9c5b"}, "author": "By     Wes Raynal", "url": "http://www.marketwatch.com/story/10-great-cars-for-a-summer-road-trip-2015-06-27#post-0", "ord_in_thread": 0, "title": "10 great cars for a summer road trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shutterstock Slide 1 of 11 The mercury is rising. It must be time for that age-old tradition, the summer road trip. Pack the kids (or not) and hit the road. Go on a picnic; head to the beach or the mountains; visit our nation’s capital; drive across the country. Drive to the ice cream store. Heck, the first day of summer was International Surfing Day — ride the waves.\nWhatever the adventure, here are five new and five vintage ways to have fun in the sun. While you’re on the road, remember Robert M. Pirsig’s words in “Zen and the Art of Motorcycle Maintenance”: “Sometimes it’s a little better to travel than to arrive.”\nMercedes-Benz Slide 2 of 11 Mercedes-Benz Sprinter Van Converted for glamping, of course. Benz’s Sprinter is the original Euro-style full-size van and now has an updated front end and four-wheel drive, so it can get you to even more remote campsites. Go for the Airstream camper conversion, known as the Interstate Grand Tour EXT. Why? Because when you put two high-quality corporate entities together like Mercedes and Airstream, good things happen. In this case you can outfit your glamper in one of 11 different layouts. This is truly a wondrous way to travel.\nFord Slide 3 of 11 Mustang or Camaro You really can’t go wrong with either one, so long as you pick the convertible models. Oh, and the V8s. Every time someone on staff gets in either the Chevy or the Ford F, -0.72% , we smile; we know exactly what we’re in for: Great engines, great sounds and fun on-throttle handling. Throw the top down and hit the road. How can you go wrong? They’re both winners; it’s that simple.\nMini Slide 4 of 11 Mini Cooper four-door Perhaps a choice a bit out of left field, but the Cooper four-door is roomy and quick (in Cooper S form, at least) so charging around the country’s back roads should be a hoot. Besides, the cargo area is huge and the rear seats can fold down for sleeping if you’re so inclined.\nVW Slide 5 of 11 Volkswagen Golf SportWagen TDI VW’s MQB modular platform is among the best in the auto biz in terms of solidity and ride/handling, and the auto maker’s 2.0-liter diesel is quiet, smooth and torquey. So not only is the Golf wagon fun to fling around when the road gets twisty, VW VLKAY, -1.68% says the diesel wagon should get 30 mpg in town and 45 on the freeway; in other words, your bladder will need a stop long before the car does.\nMazda Slide 6 of 11 Mazda MX-5 Too easy a choice? A cliché? Nonsense. How can we not include the prototype for all modern roadsters? The MX-5 practically defines summer road trips; if it doesn’t, it should — it’s what we wish every car felt like. The clincher: As cars get heavier, busier and softer, the MX-5 just got lighter, simpler and more lovable.\nAutoweek Slide 7 of 11 Don’t want to take something fresh off the showroom floor? Try these vintage ideas on for size.\nAmphicar You know the old saying: Amphicars were bad as a car, not so good as a boat and yet somehow still completely charming and perfect for heading to, and on, the beach. Don’t expect heart-pounding driving dynamics — or excitement on the high seas for the matter. For the right person, though, (one content to simply putt-putt over land and sea) an Amphicar could be the perfect summer conveyance.\nAutoweek Slide 8 of 11 BMW 2002 This is the 3-series’ ancestor. They’re fast, still cheap, and easy to find parts for and work on. Focus on the earlier ones with round taillights and chrome bumpers. They look way cooler than the later ones and their 5-mph crash bumpers.\nFord Slide 9 of 11 Ford Econoline Has to be a 1979 and has to be in triple green, because, well, that was the road-trip car Autoweek content manager Natalie Neff grew up with — she saw the “whole U.S. of A. in that thing.” Neff reports they played poker (yes, she was only 12) sitting around the big homemade table that unfurled between two big benches. Hers had this “awesome tendency to overheat,” so, “cruising through Zion National Park, with the mercury topping 90 degrees in July, my dad would have to crank the heat in an effort to keep the engine from boiling over. Fun.” Actually, sounds perfect.\nDutchtrikers/Wikipedia Slide 10 of 11 Honda Goldwing To the Econoline, Neff adds a great bike, the Goldwing. She says while they traveled in their Ford they’d see a family of four doing the “exact trip we were doing only in the opposite direction — and on a Honda Goldwing with the two kids in a sidecar while towing a little pop-up camper. The very definition of kick-ass.”\nAlexander Gernhardt/Wikipedia Slide 11 of 11 VW Westfalia Including a Westfalia could, like the Miata, be considered a cliché, but they’re so damned cute we can’t help ourselves. Yeah they’re slow, wheezing and quirky, but you’ll get there eventually. Park one at a campsite overlooking, say, Lake Tahoe, pop a cold one and watch the stars come out. Life’s good.\nThe story “5 perfect classic cars for your summer road trip…and 5 new cars too” first appeared on Autoweek.com.\nAlso read: The 10 most popular national parks for camping\nPrev Page 1 2 3 4 5 6 7 8 9 10 11 Next Page You Might Like", "external_links": ["http://autoweek.com/article/car-life/5-perfect-classic-cars-your-summer-road-tripand-5-new-cars-too"], "published": "2015-07-31T03:00:00.000+03:00", "crawled": "2015-07-31T13:56:03.963+03:00", "highlightTitle": ""}