{"organizations": [], "uuid": "99aa3345ae3008382bc941a0e49c18d8e39a4744", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/d/e/4/4/image.related.articleLeadwide.620x349.gilrwc.png/1438032733090.jpg", "site_section": "http://www.canberratimes.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/markets/oil-at-fourmonth-low-on-china-demand-worries-20150727-gilrwc.html", "country": "AU", "title": "Oil at four-month low on China demand worries", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Oil at four-month low on China demand worries", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T05:32:00.000+03:00", "replies_count": 0, "uuid": "99aa3345ae3008382bc941a0e49c18d8e39a4744"}, "author": "canberratimes.com.au", "url": "http://www.canberratimes.com.au/business/markets/oil-at-fourmonth-low-on-china-demand-worries-20150727-gilrwc.html", "ord_in_thread": 0, "title": "Oil at four-month low on China demand worries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A weaker dollar on Monday cushioned some of oil's losses. Photo: Brendan Esposito\nCrude oil futures hit four-month lows on Monday after a steep drop in China's stock markets sparked concern about the economic health of the world's biggest energy consumer, while evidence of a growing crude glut mounted.\nOil was also pressured by a sharp increase in US drilling activity with data on Friday showing producers added 21 rigs last week, the most in over a year, suggesting a ramp up in output as crude futures recovered from six-year lows seen in the first quarter.\nA weaker dollar on Monday cushioned some of oil's losses as crude and other commodities denominated in the greenback saw higher demand from users of the euro.\nChinese stocks tumbled more than 8 per cent in Asian trading , the biggest one-day drop in eight years, driving European equities markets to a two-week low.\nBrent crude oil settled down $US1.15, or 2 per cent, at $US53.47 a barrel. In post-settlement, it fell to as low as $US52.90, its lowest since mid-March.\nUS crude closed down 75 cents, or 1.6 per cent, at $US47.39. It fell below $US47 post-settlement, the lowest since late March.\n\"The combination of the Chinese stock market rout and creeping crude glut is weighing on oil,\" said Carl Larry, director of business Development for oil and gas at Frost & Sullivan.\n\"That said, Brent's still seeing support above $US50 and US crude is staying above $US45. There's a lot of hedging going on at those levels.\"\nTechnical analysts, however, said US crude could lose another $US15 or more, falling below the lows of the 2007-2009 financial crisis, if the dollar started rallying again on talk of a US rate hike while the oversupply in oil persists.\nMajor oil producers in the Middle East Gulf, competing for market share, were pumping 2-3 per cent more than needed, analysts say.\nExports from Iraq's southern oilfields were on track for a monthly record, having topped 3 million barrels per day so far this month.\nHedge funds and other money managers slashed their net long positions in Brent for the first time in four weeks in the week to July 21, data showed.\n\"In the next couple of months, even if the global oversupply and seasonal weakness are becoming priced in, it is difficult to see where any price uplift will come from,\" said Societe Generale oil analyst Michael Wittner.", "external_links": ["http://www.afr.com/markets/china-stocks-fall-as-economic-rout-fears-return-20150727-gilirg"], "published": "2015-07-28T05:32:00.000+03:00", "crawled": "2015-07-29T14:37:56.333+03:00", "highlightTitle": ""}