{"organizations": [], "uuid": "25e3364704479622f819b94229929bf3b2bfefca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/06/arnold_schwarzenegger_net_worth.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/terminator-genisys-numbers-arnold-schwarzeneggers-net-worth/", "country": "US", "title": "‘Terminator: Genisys’ by the Numbers: Arnold Schwarzenegger’s Net Worth and More", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "‘Terminator: Genisys’ by the Numbers: Arnold Schwarzenegger’s Net Worth and More", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T12:00:00.000+03:00", "replies_count": 0, "uuid": "25e3364704479622f819b94229929bf3b2bfefca"}, "author": "Andrew Lisa", "url": "http://www.gobankingrates.com/personal-finance/terminator-genisys-numbers-arnold-schwarzeneggers-net-worth/", "ord_in_thread": 0, "title": "‘Terminator: Genisys’ by the Numbers: Arnold Schwarzenegger’s Net Worth and More", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Andrew Lisa July 1, 2015 \nAlthough the critics have so far been less than kind to “Terminator: Genisys” — it has earned just 23 percent after 30 reviews on Rotten Tomatoes as of June 30 — it will ultimately be the die-hard fans who decide if the man-vs-machine franchise actually needed another installment. Audience reception is looking favorable with 98 percent of Rotten Tomatoes users indicating they want to see the film, which indicates it will be a blockbuster at the box office. \n“Terminator: Genisys,” which will be released on July 1, was reportedly produced on a budget of $155 million and will be released at 3,700 locations including Imax, reports Deadline Hollywood. The fifth installment in the legendary science fiction franchise has already sold around $400,000 in advance-purchase movie tickets . “Terminator: Genisys” is expected to pull in between $45 million and $50 million on its opening day, followed by a three-day taking of between $27 million and $30 million; in all it’s expected to earn $72 to $80 million in its debut weekend. \nWhat will this box office success mean for the movie’s cast, including the original Terminator Arnold Schwarzenegger? Here’s a look at the net worths and earnings of the stars of “Terminator: Genisys.” ‘Terminator: Genisys’ Cast Members’ Net Worths From Emilia Clarke to Arnold Schwarzenneger Arnold Schwarzenegger Net Worth: $300 Million \nAction icon Arnold Schwarzenegger, who brought the Terminator to life in the 1984 James Cameron-directed original, returns as the Guardian in “Terminator: Genisys.” This will be his fifth appearance as sometimes-good, sometimes-evil cyborgs sent from the future to kill or save a member of the human resistance. \nArnold Schwarzenegger was dominating the world of bodybuilding by age 20 and became the youngest competitor ever to win the Mr. Universe title before heading to Hollywood, where he earned the bulk of his $300 million net worth. Before winning the office of governor of California, Schwarzenegger starred in hits like “Conan the Barbarian,”“Predator,”“Commando” and “Total Recall.” Schwarzenegger has revealed that he will star “Triplets,” an upcoming sequel to the 1988 comedy “Twins,” and has even hinted at a possible appearance in a sixth Terminator film. \nRead: Arnold Schwarzenegger and 19 Other Famous Community College Graduates Emilia Clarke Net Worth: $3 Million \nEmilia Clarke takes on the role of Sarah Connor, the female protagonist of the franchise since the 1984 original. This time, Sarah Connor wanders through a plot fractured by time travel as she is chased by new enemies and aided by new allies. \nRelatively unknown just a few years ago, Emilia Clarkes is set to earn $7 million dollars to film the next season of “Game of Thrones,” as Daenerys, according to The Hollywood Reporter, which is where she earned the bulk of her $3 million net worth. Clarke also portrays Louisa Clark in the upcoming film “Me Before You,” which is slated for release in 2016. \nRelated: ‘ Game of Thrones’ Net Worths of Peter Dinklage, Kit Harington and More J.K. Simmons Net Worth: $5 Million \nIn “Terminator: Genisys,” J.K. Simmons portrays O’Brien, an alcoholic detective who has spent three years following the case of Sarah Connor. J.K. Simmons’ extraordinary career, as well as his earnings that have built his $5 million net worth, dates back to 1986. But Simmons is best known for his roles in “Oz,”“Juno,”“Law & Order” and his Oscar-winning role in 2014’s “Whiplash.” His upcoming work includes “The Lake,” which is scheduled for release in 2016. Jai Courtney Net Worth: $3 Million \nJai Courtney brings the latest incarnation of Kyle Reese to life in “Terminator: Genisys.” Reese is sent to the past by rebel leader and son of Sarah Connor, John Connor. When he arrives in 1984, however, he finds that time travel has warped reality. \nA native of Australia, Jai Courtney’s $3 million net worth has been built on a slew of television and film credits, including another sci-fi movie, “ Divergent .” Courtney is also slated to appear in the much-anticipated “Suicide Squad” in 2016. Jason Clarke Net Worth: $2 Million \nJason Clarke portrays John Connor, the leader of the human resistance in a post-apocalyptic world. While three other actors have held the role in the franchise films before him, Jason Clarke is the first to portray Connor as a half-cyborg villain. \nJason Clarke has been building his $2 million net worth with movie and TV credits dating back to the 1990s but the actor (who is no relation to Emilia Clarke) is best known for his role in 2012’s “Zero Dark Thirty.” He will star in World War II drama “HHHH,” which is set to be released in 2016. Courtney B. Vance Net Worth: $4 Million \nCourtney B. Vance portrays Miles Dyson, a character who first appeared in “Terminator 2: Judgment Day.” The character’s son, Danny Dyson, is played by Dayo Okeniyi. Vance has earned three Tony awards, but he can trace a large part of his $4 million fortune to his role as A.D.A. Ron Carver in “Law and Order: Criminal Intent.”", "external_links": [], "published": "2015-07-01T12:00:00.000+03:00", "crawled": "2015-07-01T13:41:33.000+03:00", "highlightTitle": ""}