{"organizations": ["Hindustan Times"], "uuid": "a36a18c6c194ac342c6c4722194a2a01a86ebb76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2011/1/623a0a10-d26d-4cdd-b0c2-da2b0be4c3f1MediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Business\r", "section_title": "Business News, Personal Finance, Financial News, India Stock Market Investing", "url": "http://www.hindustantimes.com/business-news/food-inflation-rises-as-wholesale-prices-dip/article1-1370088.aspx", "country": "IN", "title": "Pocket pinch: Food inflation rises as wholesale prices dip", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Pocket pinch: Food inflation rises as wholesale prices dip", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T22:46:00.000+03:00", "replies_count": 0, "uuid": "a36a18c6c194ac342c6c4722194a2a01a86ebb76"}, "author": "", "url": "http://www.hindustantimes.com/business-news/food-inflation-rises-as-wholesale-prices-dip/article1-1370088.aspx", "ord_in_thread": 0, "title": "Pocket pinch: Food inflation rises as wholesale prices dip", "locations": ["New Delhi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zia Haq"], "text": "Zia Haq, Hindustan Times , New Delhi | Updated: Jul 17, 2015 02:27 IST \nRohini Mishra, a housewife in an east Delhi locality, saw grocery prices rise sharply last month in her neighbourhood weekly market, one of many that dot the national capital and popular for their cheaper rates. \n“Suddenly, some items were unaffordable,” she said. The spike wasn’t a local glitch, as Mishra suspected. Across the country, retail prices, especially of food, have been rising at a time when wholesale market prices are falling, a skewed divergence economists are finding hard to explain. \nRepresented on a graph, retail or consumer prices over the past six months, especially of food, look as if they are scaling a mighty peak. Data show inflation is getting entrenched in a clutch of protein-rich items. \nTake the consumer price index (CPI) or retail prices for meat and fish, for instance. From a 5.1% increase in January this year, they rose 5.7% in May and 7.1% in June. Milk prices jumped 7.8% last month from a year ago, a slight decline from an 8.2% rise in the previous month. Pulses rose a huge 17.5% in June, compared to an 11.4% climb in May. \nOn the other hand, the NDA government has been trumpeting a rapid decline in the wholesale price index (WPI), which has turned “negative”. It’s what economists call “deflation”, the opposite of inflation. Quite simply, this happens when prices, after not rising at all, start falling. \nWholesale prices have turned negative for the eight consecutive months to stand at minus 2.4%. This isn’t helping middle-class consumers because, unlike the WPI, which is basically a traders’ price index, the CPI is based on the consumption basket of an average Indian household. \nDespite the government hailing the fall in wholesale prices, economists have actually stopped using it to either make predictions or formulate policies. “The RBI now goes mainly by CPI. We should do away with WPI as it is practically useless for any public policy purpose,” said NR Bhanumurthy, an economist at the National Institute of Public Finance and Policy. \nThe fall in wholesale prices isn’t helping consumers because it only captures 40% of the consumption basket, Bhanumurthy said. Tags", "external_links": [], "published": "2015-07-16T22:46:00.000+03:00", "crawled": "2015-07-17T05:57:44.000+03:00", "highlightTitle": ""}