{"organizations": ["FOMC"], "uuid": "e4463738be62334170078ab17f6f4755d904c984", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-sharecast/?format=rss", "section_title": "Finance News | Sharecast - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/bonds-yields-rise-ahead-fomc-182100679.html", "country": "GB", "title": "Bonds: Yields rise ahead of FOMC", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Bonds: Yields rise ahead of FOMC", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T21:21:00.000+03:00", "replies_count": 0, "uuid": "e4463738be62334170078ab17f6f4755d904c984"}, "author": "", "url": "https://uk.finance.yahoo.com/news/bonds-yields-rise-ahead-fomc-182100679.html", "ord_in_thread": 0, "title": "Bonds: Yields rise ahead of FOMC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "284.60 +5.00 \nLONDON (ShareCast) - (ShareCast News) - US: 2.29% (+4bp) UK: 1.98% (+4bp) Germany: 0.72% (+3bp) France: 1.01% (+3bp) Spain: 1.96% (+5bp) Italy: 1.90% (+3bp) Greece: 12.19% (+3bp) Portugal: 2.53% (+1bp) Government bonds dropped across the board on Wednesday as investors played it safe ahead of the US Federal Reserve's policy announcement later in the evening. \nAll eyes were on whether the world's most influential central bank would 'tweak' its post-meeting statement or not - possibly signalling that a September rate hike was indeed on the table - or abstain from doing so, pointing to a first rate rise arriving at a later date. \nThat came as various analysts emphasised the potential impact that the recent large drop in commodity prices might have on consumer price inflation Stateside. \nWriting in the FT on Wednesday morning, Jamie Chisholm pointed out how the US five-year break-even rate - an inflation gauge - was back below 1.4% versus an average of 1.83% over the past five years. In late June it was at 1.75%. \"For now, it is contributing to a feeling that global deflationary pressures are building,\" he warned. \nLow European rates benefiting Gilts Mortgage approvals in the UK increased by 66,600 in June, up from a pace of 64,800 in May, while net lending secured on dwellings picked up to a £2.6bn pace - the highest figure since July 2008. \nAs an aside, Fabrice Montagne and Andrzej Szczepaniak at Barclays (LSE: BARC.L - news ) pointed out how foreign investors had been returning to the GBP market after a long absence throughout 2014. \nThat came as yields across the rest of Europe were set to remain low, they added. However, \"uncertainties related to the UK referendum next year could start to challenge overseas investors again.\" Acting as a backdrop, observers of Greece continued to carefully monitor political events in the country and the risk that snap elections might be called. \nFurther afield, Indian one-year interest rate swaps remained at three-week lows of 7.45%, as analysts continued to wax sanguine about the favourable impact which lower crude prices would have on the country's current account deficit. \nIndeed, it was one of the few emerging economies which most observers coincided in singling out as a beneficiary of the slump in commodity prices. Recent levels of rainfall following a dry spell were also cited as a positive factor.", "external_links": [], "published": "2015-07-29T21:21:00.000+03:00", "crawled": "2015-07-30T00:29:31.644+03:00", "highlightTitle": ""}