{"organizations": [], "uuid": "b76bcc7c2ab8b01d401b21a2f73d8d98121495ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-21/most-wonderful-time-of-the-year-for-fed-liftoff-isn-t-december", "country": "US", "title": "Most Wonderful Time of the Year for Fed Liftoff Isn’t December", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Most Wonderful Time of the Year for Fed Liftoff Isn’t December - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T22:09:00.000+03:00", "replies_count": 0, "uuid": "b76bcc7c2ab8b01d401b21a2f73d8d98121495ee"}, "author": "Jeanna Smialek", "url": "http://www.bloomberg.com/news/articles/2015-07-21/most-wonderful-time-of-the-year-for-fed-liftoff-isn-t-december", "ord_in_thread": 0, "title": "Most Wonderful Time of the Year for Fed Liftoff Isn’t December", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Federal Reserve officials trying to decide when to raise interest rates for the first time in a decade may want to avoid waiting until December to make their move.\nThe reason: Treasury-market liquidity has a clear pattern of thinning out at year-end, potentially exacerbating volatility in reaction to an increase in the Fed’s benchmark rate. A sharp rise in yields could hurt the economy and complicate liftoff.\nThese concerns won’t be a deal-breaker if economic data support a rate rise in December and not sooner, economists say. Still, they could make officials look more favorably upon a September or October start. Fed Chair Janet Yellen has said liftoff will be appropriate this year if the economy evolves as expected.\n“Our sense is the Fed would love to raise in September,” said Lori Heinel, chief portfolio strategist Boston-based State Street Corp., which manages $2.45 trillion. “The longer they wait, other things start to become considerations, including concerns about year-end liquidity and the volatility that may introduce.”\nThe Fed has said it will tighten if the labor market continues to improve and it’s “reasonably confident” inflation will move back up toward its 2 percent objective. While the central bank is nearing its target for full unemployment -- the jobless rate fell to a seven-year low of 5.3 percent in June -- inflation has lingered below the goal for three years.\nSome 76 percent of economists expect the first rate rise at the Federal Open Market Committee’s September meeting, a Bloomberg survey taken July 2-8 shows. Just 6 percent expect a change in October -- a meeting that isn’t accompanied by a press conference -- and 10 percent expect a December move.\nPress Conferences Yellen holds press conferences after every other meeting, and economists say she would prefer to move on raising rates at one of those meetings, although she has said every gathering is live. Just 4 percent of economists in the survey predicted a move at next week’s meeting.\nTurnover in Treasuries has historically dipped during the final weeks of the year. The volume traded through ICAP Plc, the largest inter-dealer broker of U.S. government debt, averaged $288 billion a day back through 2010. In contrast, the average over the final two trading weeks of each year from 2010 through 2014 was $137 billion.\nLiquidity in Treasuries tends to dry up in December when investors ranging from pension funds to banks buy government securities and hang onto them to make their holdings look safer for year-end reporting requirements. Trading volume also declines as dealers leave their desks for the holidays.\nDecember Volatility Thinner year-end markets translate into larger movements in prices. Volatility on options that expire in a few months on two-year U.S. rates, whose short-term maturity makes them most affected by changes in Fed policy, has moved higher during the final month of recent years. Volatility on these three-month options rose 30 percent in December from the prior month, and 50 percent in the final month of 2013.\nOfficials debated the risk of increased volatility at liftoff in April, minutes of the meeting show. They discussed the so-called taper tantrum in 2013, when Treasury yields jumped after then-Chairman Ben S. Bernanke said the Fed might soon start reducing its bond purchases.\nA steep rise in yields might be a bigger drag on the economy than officials would like to see. Yellen, concerned that a sharp rate increase could derail the recovery, last week said she prefers to “tighten in a prudent and gradual manner.”\nReverse Repos In addition, volatility has risen in the final days of the last two quarters for repurchase agreements, the money-market instrument the Fed will deploy to tighten policy, due to banks stepping back from the market to manage their balance sheets. That may make it tougher to achieve a smooth liftoff.\nWhen the Fed decides to raise rates, it will be using a new set of tools that will allow it to navigate the trillions of dollars in excess reserves that it created in the course of three rounds of large-scale asset purchases.\n“This is an unprecedented rate increase, the mechanisms for which are relatively untested, and they will probably want to refrain from doing that at year-end,” said Gennadiy Goldberg, U.S. strategist at TD Securities USA LLC in New York.\nThe Fed has said it will seek to keep the federal funds rate, which represents the cost of reserves that banks borrow and lend in the overnight market, in a 25 basis-point range.\nThe top end of the range will be determined by the interest rate the Fed pays banks on excess reserves, currently 25 basis points, or a quarter of a percentage point.\nRate Floor The bottom end will be set by the Fed’s overnight reverse repurchase agreement program, currently at 0.05 percent. In those agreements, the Fed borrows cash from money-market counterparties and posts bonds from its portfolio as collateral. The next day, the Fed returns the cash plus interest and gets its bonds back.\nEconomists said that if the Fed wants to be confident of achieving a smooth liftoff, and wants to see that its reverse repurchase tool is working as intended, it makes sense to pick a period when liquidity won’t be questionable.\nThe Dec. 15-16 timing of the final FOMC meeting of the year, in the middle of America’s most important retail sales season, may also be a consideration for officials concerned that a rate increase could drive share prices lower and harm consumer confidence.\n“A considerable hit to consumer confidence during the key shopping season of the year, that could substantially reverberate throughout the economy,” Goldberg said. “That’s something the Fed is keen to avoid.”\nDecember Taper On the other hand, the Fed has shown a willingness to overlook technical volatility in the past: Tapering of the Fed’s bond-buying campaign was announced in December 2013. It also raised rates in December 2004 and December 2005, though that tightening cycle got under way in June 2004, and officials weren’t relying on overnight repos to steer fed funds higher.\nWhile December is an imperfect choice, policy makers will opt to move then to avoid pushing liftoff further into the future, economists at BNP Paribas wrote in a July 9 note.\n“December is not ideal for liftoff, given likely thin year-end liquidity,” they wrote. “It’s better than waiting until March. It’s now our central case.” Laura Rosner, U.S. economist at BNP Paribas in New York, said she didn’t view the Jan. 26-27 FOMC as likely for a rate move because it lacked a scheduled press conference.", "external_links": [], "published": "2015-07-21T22:09:00.000+03:00", "crawled": "2015-07-21T17:45:57.425+03:00", "highlightTitle": ""}