{"organizations": [], "uuid": "5aef414608c73d8ba2f6021e1e445d12b53230a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Bangloreclub022715.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/bangalore-club-questions-eviction-order/42872.html", "country": "IN", "title": "Bangalore Club questions eviction order", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Bangalore Club questions eviction order", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T12:02:00.000+03:00", "replies_count": 0, "uuid": "5aef414608c73d8ba2f6021e1e445d12b53230a7"}, "author": "IANS", "url": "http://www.moneylife.in/article/bangalore-club-questions-eviction-order/42872.html", "ord_in_thread": 0, "title": "Bangalore Club questions eviction order", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Bangalore Club questions eviction order 42872 Bangalore Club questions eviction order 0 Comments, Be the first to comment + COMMENT IANS | 22/07/2015 02:32 PM | Bangalore Club, a 147-year-old landmark in the city where British Prime Minister Winston Churchill was once a member when a junior army officer, is facing a eviction threat but asserted it will contest it. \"We too heard that an order to vacate the premises in seven days was issued by assistant commissioner, revenue department, Mahesh Babu though we are yet to receive it,\" club secretary K.D. Murthy told IANS. The eviction order to vacate the 13-acre sprawling area, valued at crores of rupees, was issued on the recommendation of the state legislative committee, which went into the ownership of the land located in the city centre. \"We have recently filed a writ petition in the Karnataka High Court challenging a notice by the revenue department asking us to prove the land ownership,\" Murthy said. The club also submitted a copy of its title deed (khata), encumbrance certificate, property tax receipts and other documents showing the club is the owner of the land since the 19th century. Set up as the Bangalore United Services Club in the tradition of the colonial clubs for officers of the British empire, Churchill used to frequent it during his stint in India in 1896. In 1946, the premise was opened to civilians and was rechristened Bangalore Club. Its stately central building blends the idea and grandeur of the Raj and its resplendent Mysore room and the Gentlemen's Bar preserve its antiquity. Early this month, the club lost its liquor licence after its renewal application was rejected by the Bengaluru Urban district office. \"Our liquor license was cancelled on July 2 and our stock of alcohol was seized on July 3 by the excise department,\" club president G.V. Radhakrishna said. More in Moneylife", "external_links": [], "published": "2015-07-22T12:02:00.000+03:00", "crawled": "2015-07-22T12:17:22.304+03:00", "highlightTitle": ""}