{"organizations": [], "uuid": "4227104eb91ac77109dfe7345e3317e5ba7bff70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "http://a.abcnews.com/images/Travel/GTY_girl_towel_beach_kab_150330_16x9_992.jpg", "site_section": "http://abcnews.go.com/GMA/YourMoney/", "section_title": "Business News, Personal Finance and Money News - ABC News", "url": "http://abcnews.go.com/Business/summer-scams-avoid/story?id=32649328", "country": "US", "title": "9 Summer Scams and How to Avoid Them", "performance_score": 0, "site": "go.com", "participants_count": 1, "title_full": "9 Summer Scams and How to Avoid Them - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "4227104eb91ac77109dfe7345e3317e5ba7bff70"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Business/summer-scams-avoid/story?id=32649328", "ord_in_thread": 0, "title": "9 Summer Scams and How to Avoid Them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images Summer is a time for sun, fun, exploration and relaxation. Unfortunately, as we unwind there are those who gear up to take advantage of our moments of diversion and distraction. Scammers love summer, too.\nHere are a few summer scams that can turn a much-needed break from work into a break-the-bank moment or make for a truly unhappy holiday, and some simple tips to avoid getting got.\n1. The Front Desk Scam You arrive late at your hotel and all you want to do is check in, take a shower and go to bed. As you settle in, or just after you turn in, the phone in your room rings. The “front desk” is calling to tell you that your payment card was declined. Would you be so kind as to confirm your account number, or provide another card? You oblige then promptly forget all about it….that is until your monthly statement arrives (or whenever you check your account) and you get a rude awakening – the “front desk” wasn’t associated with the hotel at all and was really a scammer.\nMore From Credit.com: How to Use Free Credit Monitoring Tools\nTIP: If you get a call from the front desk, hang up and call them back or go down to confirm your payment method in person.\n2. The Hotel Take-Out Scam Room service is closed, and you’re starving. There’s a restaurant flyer either on or near the door to your room—it could be for a diner, pizza joint or Chinese restaurant. It doesn’t matter. You order and give them a credit card number. You wait with eager anticipation for your food but nothing arrives. When you call again, there’s no answer because the person who took your order and asked for your credit card is busy maxing it out.\nMore From Credit.com: Tips for Improving Your Credit: Your Amount of Debt\nTIP: Call the front desk to make sure the flyer is not a scam, or go online to check for reviews.\n3. The Summer Rental Scam You find the perfect late-summer rental. Excited, or maybe a little anxious about losing out on this gem, you contact the person identified in the listing and—score—you get the place. On the appointed day, you show up at the right address, at the right time with bags in hand. You ring the bell and the door opens. The person standing in the doorway looks at you in wonderment as you happily announce that you have arrived. It might be the owner or maybe a tenant. Equally disturbing, you discover an office building, a parking lot or vacant field at the address you were given. Oh, and did I mention that the scammer and your money are long gone?\nTIP: If you used a real estate agent, ask for the agent’s license number and check it, request references if there are no reviews online and confirm that the address is real and the premises are truly available for rent. Some home-rental websites have their own vetting processes and offer guarantees that will protect you in case of fraud. Be sure to read through the details, however.\n4. The Wi-Fi Scam Many destinations, travel stops, restaurants, retailers and public venues provide free Wi-Fi. Unfortunately, free Wi-Fi by no means guarantees secure Wi-Fi. Before you connect to anything that is free, confirm the exact name of the Wi-Fi network and that it is secure. Always be on the lookout for fake networks created by scammers.\nMore From Credit.com: 4 Tips for Better Internet Safety\nTIP: Always check with the network provider or someone of authority at the venue before logging on to any new wireless connection.\n5. 5. The Summer Job Scam You apply for a summer job and your prospective employer informs you that you’re hired, but before they can make a formal offer they have to do a background check. Sounds logical, right? So, you provide your information—including your Social Security number—but never hear back about the job. The reason: You were the job and your identity has been stolen.\nTIP: Due diligence here is key: Never provide sensitive personal information to a job site or anyone claiming to offer a job as a prerequisite to starting the conversation. Always make a few calls or poke around online to make sure the company and the offer are legitimate. Then interact with an authorized representative. If at that point you want to move forward, it is appropriate to supply identifying data.\n6. The Excursion Scam When booking an excursion, double check that the company you’re working with has a good reputation. Call and make sure the number matches contact information online, and that there are reviews from happy customers. Otherwise, you could be just giving a stranger your credit card information and the ability to take you for a ride.\nTIP: Read reviews, and make sure the company is legitimate.\n7. The Mover Scam Summer is the time to move. Your search for a mover yields a company that can do it fast, at what appears to be a reasonable price: but compared to what? Check with the Better Business Bureau to make sure that you are getting a deal rather than being the deal. Many of these sketchy movers will force you to ransom your belongings.\nTIP: Always read the reviews before hiring a mover.\n8. The Concert Ticket Scam Taylor Swift is rolling into town with her celebrated “1989” tour. You just have to have tickets. Are you sure you’re on a legitimate ticket site? You don’t want to find out the hard way.\nTIP: Go to reputable ticket sellers (also check with the concert venues) to make absolutely sure you are dealing with someone who can and will actually deliver the goods to you rather than sell you a bill of goods.\n9. The Home Maintenance Scam Everyone has a punch list of home repairs that needs to get done before winter rolls around.\nA guy shows up at your door, and tells you that his crew is working in the area and about to finish a job with some materials to spare. He offers to give you a deal because it will save him time and you money. No contract, no fuss; you agree to hire him and pay a deposit. Then he and his imaginary crew—along with your dough—are gone with the wind.\nTIP: Check out potential hires through friends, neighbors and online reviews. Also, get a written contract which specifies deliverables, including a definitive start and completion date. Note that many states require home improvement contractors to be licensed and provide written contracts.\nKeeping Your Summer Scam-Free\nThere’s also a cheat sheet on the best practices that can help you keep your summer safe from fraud, courtesy of the Connecticut Better Business Bureau :\nDon’t wire money to strangers – When booking a vacation or renting a property, avoid anyone who only accepts payment by wire transfer. Use a secure method of payment such as a credit or online payment system. Be skeptical about giving out your information – That includes your credit card number. Ignore food flyers under your hotel room door and remember that the front desk at the hotel will never call to ask you for your credit card number over the phone. Is the vacation really free? – It may appear to be, but like anything else, a free vacation is not free if you have to give out your credit card number. Call your financial institutions before leaving town – It may not be enough just to call your credit card company to tell them you are leaving town. Call your bank as well, since your bank generally sets the level of security associated with your credit card. If you don’t do this, your credit card transactions will probably be declined, especially if your purchases don’t match your usual spending pattern, for example, using your card in another state or country. Carefully check your receipts and statements – As soon as you get home, reconcile your credit card and banking statements with your receipts. Extra charges are not necessarily fraudulent. Mistakes do happen, and regardless of whether a charge is an error or unauthorized, you should report the problem as soon as possible. We also want to add to this: Just because you’re on vacation, don’t go on hiatus from checking your credit reports and credit scores. If someone fraudulently opens an account in your name, you may not know about it until it has done a serious number on your credit. Better to catch it as soon as possible so you can deal with it before it becomes a big problem. You can get your credit reports for free every year from each of the three major credit reporting agencies at AnnualCreditReport.com, and you can get your credit scores for free from many sources. A larger, unexpected change in your credit scores can tip you off to potential fraud. Any opinions expressed in this column are solely those of the author.\nAdam Levin is chairman and co-founder of Credit.com and IDT911. His experience as former director of the New Jersey Division of Consumer Affairs gives him unique insight into consumer privacy, legislation and financial advocacy. He is a nationally recognized expert on identity theft and credit. His new book, \"SWIPED: How to Protect Yourself in a World Full of Scammers, Phishers, and Identity Thieves\" will be released this fall.", "external_links": ["http://www.credit.com/personal-finance/4-tips-for-better-internet-safety/", "http://www.credit.com/credit-reports/tips-for-improving-your-credit-your-amount-of-debt/", "http://a.abcnews.com/images/Travel/GTY_girl_towel_beach_kab_150330_16x9_608.jpg", "http://www.credit.com/credit-monitoring/#how-to-use-free-credit-monitoring-tools", "http://www.bbb.org/connecticut/news-events/news-releases/2015/07/connecticut-better-business-bureaus-5-tips-for-avoiding-summer-vacation-scams/"], "published": "2015-07-26T03:00:00.000+03:00", "crawled": "2015-07-26T11:53:39.628+03:00", "highlightTitle": ""}