{"organizations": ["Prudential"], "uuid": "c120ed96c84cd977a06cf7cac93cd96a095b9b69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/vbr1uhg76o_1556349915503_6373945938578.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/627800/1/prudential-enters-3rd-african-market-with-acquisit.html", "country": "US", "title": "Prudential enters 3rd African market with acquisition of Ugandan business", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Prudential enters 3rd African market with acquisition of Ugandan business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T04:06:00.000+03:00", "replies_count": 0, "uuid": "c120ed96c84cd977a06cf7cac93cd96a095b9b69"}, "author": "", "url": "http://www.modernghana.com/news/627800/1/prudential-enters-3rd-african-market-with-acquisit.html", "ord_in_thread": 0, "title": "Prudential enters 3rd African market with acquisition of Ugandan business", "locations": ["Ugandan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  6 July 2015 02:06 CET Prudential enters 3rd African market with acquisition of Ugandan business By Myjoyonline.com \nPrudential plc, one of the world’s oldest and most strongly capitalised life insurers, has entered its third African insurance market with the acquisition of Goldstar Life Assurance in Uganda. \nThe move is an important step forward in Prudential’s strategy of expanding across Africa, following the launch of businesses in Ghana and in Kenya, its East African hub, last year. \nPrudential has also signed a long-term cooperation agreement with Crane Bank in Uganda to explore opportunities to work together to serve customers across the country. \nPrudential now has over a million customers and more than 1,000 agents and employees in Africa. Prudential Ghana, its first insurance business in Africa, has already nearly tripled its number of agents, signed a distribution agreement with Societe Generale and launched the unique Hospital Cash and Farewell plans. \nMatt Lilley, Africa CEO, Prudential said the company wants to become Africa’s leading life insurer. \n“Today’s announcement is an important step toward achieving that ambitious vision. Our talented Ghanaian team have shown over the past year how much we can achieve with the right people, investment and support. We look forward to working with our new Ugandan team, and colleagues across Prudential Africa, to build on this success and bring the benefits of life insurance to more customers across Africa”, he said \nEmmanuel Aryee, CEO, Prudential Ghana, said the acquisition is a reflection of Prudential’s long-term commitment to investing in Africa. \n“With its growing regional presence, Prudential is establishing a firm foothold to provide long-term finance for sustainable development in the continent, as it has done elsewhere in the world. Prudential Ghana benefits enormously from sharing expertise with colleagues across the global business, helping us to develop innovative products and services, increase customer satisfaction, and move closer to our goal of becoming the life insurer of choice for Ghanaians”, he said.", "external_links": [], "published": "2015-07-06T04:06:00.000+03:00", "crawled": "2015-07-06T03:48:01.000+03:00", "highlightTitle": ""}