{"organizations": [], "uuid": "f899a3ead89361cf689e3e2778bec8f062f07c9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125h1ngvp/*http://www.noodls.com/view/35A28D51BCA6884E9049D6140E311C6B30598F84", "country": "GB", "title": "Chevrolet Presents Silverado Midnight Edition to All-Star Game MVP Mike Trout", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Chevrolet Presents Silverado Midnight Edition to All-Star Game MVP Mike Trout", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T17:30:00.000+03:00", "replies_count": 0, "uuid": "f899a3ead89361cf689e3e2778bec8f062f07c9a"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125h1ngvp/*http://www.noodls.com/view/35A28D51BCA6884E9049D6140E311C6B30598F84", "ord_in_thread": 0, "title": "Chevrolet Presents Silverado Midnight Edition to All-Star Game MVP Mike Trout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chevrolet Presents Silverado Midnight Edition to All-Star Game MVP Mike Trout \n2015-07-15 \nDETROIT - The 2015 MLB All-Star Game Most Valuable Player, Mike Trout, chose a Silverado Midnight Edition during the MVP award ceremony presented by Chevrolet at Great American Ball Park in Cincinnati on Tuesday night. \nChevrolet gave Trout, who hit a home run on the fourth pitch of the game and scored another run in the American League's 6-3 victory, his choice between the sixth-generation Camaro Convertible and a Silverado Midnight Edition. \nThis was Trout's second consecutive All-Star MVP award. As the 2014 MLB All-Star Game MVP, Trout chose a Corvette Stingray. \n\"Mike's on-field performance was All-Star caliber and worthy of one of Chevrolet's All-Stars,\" said Brian Sweeney, U.S. vice president, Chevrolet, which has been the Official Vehicle of Major League Baseball® since 2005. \"Chevrolet also encourages future All-Stars through our more than 1,500 dealers who support Chevy Youth Baseball.\" \nIn its 10th year, Chevy Youth Baseball has helped raise more than $18 million to aid local teams, offered more than 200 youth clinics, involving more than 5.2 million young people across America. \nThe Silverado Midnight Edition that Trout chose begins as a black Z71, and adds an all-black front end with body-colored grille, bumper, headlamp bezels, tow hooks and fog lamps; black side moldings and beltline moldings; 18-inch black painted alloy wheels special Z71 badges on the doors and black Chevrolet bowties front and rear. \nFounded in 1911 in Detroit, Chevrolet is now one of the world's largest car brands, doing business in more than 140 countries and selling more than 4.9 million cars and trucks a year. Chevrolet provides customers with fuel-efficient vehicles that feature spirited performance, expressive design, and high quality. More information on Chevrolet models can be found at www.chevrolet.com . \nCristi Vazquez", "external_links": [], "published": "2015-07-15T17:30:00.000+03:00", "crawled": "2015-07-15T17:32:36.000+03:00", "highlightTitle": ""}