{"organizations": ["Biogen"], "uuid": "2c86652a5b229f7a7185da4a69f2e1d64a620200", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-insurance/?format=rss", "section_title": "Insurance News | Advice | Guides - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/buzz-u-stocks-move-apple-130515822.html", "country": "GB", "title": "BUZZ-U.S. STOCKS ON THE MOVE-Apple, Intuitive Surgical, Biogen", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "BUZZ-U.S. STOCKS ON THE MOVE-Apple, Intuitive Surgical, Biogen", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T16:05:00.000+03:00", "replies_count": 0, "uuid": "2c86652a5b229f7a7185da4a69f2e1d64a620200"}, "author": "", "url": "https://uk.finance.yahoo.com/news/buzz-u-stocks-move-apple-130515822.html", "ord_in_thread": 0, "title": "BUZZ-U.S. STOCKS ON THE MOVE-Apple, Intuitive Surgical, Biogen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "38.6526 -1.0774 \n(For faster updates on individual market-movers, Eikon users please use search string \"STXBZ US\"; for the Day Ahead newsletter, http://link.reuters.com/mex49s; for the Morning News Call newsletter, http://link.reuters.com/nex49s ) U.S. stock index futures fell on Wednesday as corporate earnings disappointed, especially from Apple (NasdaqGS: AAPL - news ) , the world's largest company. Dow Jones industrial average futures were down 0.41 percent at 17,793, S&P 500 futures were down 0.51 percent at 2,103.75 and Nasdaq 100 futures were down 1.43 percent at 4,599.75. \n** APPLE INC, Tuesday close $130.75, -7.18 pct premarket \nThe company's fourth-quarter revenue forecast fell short of estimates and it missed some targets for iPhone sales. The forecast overshadowed Apple's strong sales in China, which more than doubled to $13.23 billion from a year earlier. \n** INTUITIVE SURGICAL INC (NasdaqGS: ISRG - news ) , Tuesday close $505.09, +13.14 pct premarket \nThe Robotic surgical equipment maker reported a better-than-expected quarterly profit and forecast surgical procedures to grow 11 to 13 percent this year, sending its shares up 13 percent. \n** BIOGEN (NasdaqGS: BIIB - news ) , Tuesday close $409.5, -5.09 pct premarket \nA 6 mg dose of the drugmaker's experimental Alzheimer's disease drug significantly reduced beta amyloid plaque in the brain but failed to significantly slow mental decline, potentially tempering great enthusiasm that greeted data on two other doses of the treatment earlier this year. \n** MICROSOFT CORP, Tuesday close $47.28, -3.34 pct premarket \nThe company reported a $3.2 billion quarterly net loss, its biggest ever, as the company wrote down its Nokia phone business and demand fell for its Windows operating system. The company took a charge of $7.5 billion in the fourth quarter related to the restructuring of its Nokia handset business, which it bought last year. \n** YAHOO INC (NasdaqGS: YHOO - news ) , Tuesday close $39.73, -2.47 pct premarket \nThe company forecast lower-than-expected revenue for the current quarter as it struggles to revive its core online advertising business and spends more to attract users to its websites. \n** CHIPOTLE MEXICAN GRILL INC (NYSE: CMG - news ) , Tuesday close $673.07, +2.31 pct premarket \nThe Burrito chain reported lower-than-expected quarterly revenue as the removal of pork products from some of its restaurants hurt sales for the second straight quarter. Profit beat estimates. \n** BOEING CO (NYSE: BA - news ) , Tuesday close $145, +2.00 pct premarket \nThe company reported a 33 percent fall in quarterly profit, hurt by a big charge related to its military tanker program, and cut its 2015 earnings forecast. \n** THORATEC CORP (NasdaqGS: THOR - news ) , Tuesday close $57.58, +9.38 pct premarket \n** ST JUDE MEDICAL INC, Tuesday close $76.71, -2.24 pct premarket \nMedical device maker St Jude Medical agreed to buy smaller rival Thoratec Corp for about $3.4 billion to expand its portfolio of heart failure devices. \n** AUTONATION (NYSE: AN - news ) , Tuesday close $64.72, -1.16 pct premarket \nThe largest U.S. auto retailer, reported a 15 percent rise in quarterly profit as an improving economy and low oil prices boosted vehicle sales. \n** BALLARD POWER SYSTEMS INC (Toronto: BLD.TO - news ) , Tuesday close $1.51, +4.64 pct premarket \nThe Canadian fuel-cell product maker to provide 1 MW ClearGen fuel cell distributed generation system for Hydrogene de France. The company said system to be deployed at Akzo Nobel (Amsterdam: AKZA.AS - news ) NV's AKZO.AS sodium chlorate chemical plant in Bordeaux Metropole, France. \n** GOPRO INC (Xetra: A1XE7G - news ) , Tuesday close $62.04, +2.27 pct premarket \nAction camera maker reported a better-than-expected quarterly profit and forecast current-quarter revenue above market estimates, helped by strong sales in Asia. \n** ASTRAZENECA PLC (NYSE: AZN - news ) , Tuesday close $67.64, -0.99 pct premarket \nThe company's much anticipated cancer drug pipeline suffered a modest blow on Wednesday when the experimental drug selumetinib failed to meet its goal in a late-stage trial for a rare cancer of the eye. \n** BHP BILLITON (NYSE: BBL - news ) , Tuesday close $39.68, -3.55 pct premarket \nThe company beat its own production guidance for iron ore in fiscal 2015 and said it was on track for additional growth in the current year following major expansion work. \n** PEABODY ENERGY CORP, Tuesday close $1.2, -1.67 pct premarket \nAnalysts at J.P. Morgan Securities downgraded the coal miner's stock to \"neutral\" from \"overweight\", saying stock has come under \"extreme pressure\" from short-sellers. \n** THERMO FISHER SCIENTIFIC INC (NYSE: TMO - news ) , Tuesday close $136.47, +2.66 pct premarket \nThe world's largest maker of scientific instruments, reported a better-than-expected quarterly profit, helped by lower costs and strength in its life sciences unit. \n** INTERPUBLIC GROUP OF COS INC, Tuesday close $19.8 \nThe Advertising company's second-quarter revenue trumped expectations for the seventh straight quarter as higher advertising spending by U.S. businesses made up for the strong dollar's impact on international revenue. (Compiled by Rosmi Shaji in Bengaluru; Edited by Don Sebastian)", "external_links": [], "published": "2015-07-22T16:05:00.000+03:00", "crawled": "2015-07-22T16:51:36.494+03:00", "highlightTitle": ""}