{"organizations": [], "uuid": "8da4eb2e84a9695df8b3ff0e36a4233f92e5cbbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/csCSIiB98nWlkfguJ_2JZw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/6ae87b6a5f4220664cf282f4fc822f162d6e54da_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/betrayed-protest-turns-violent-greece-213500766.html", "country": "GB", "title": "'We have been betrayed!' Protest turns violent as Greece votes", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "'We have been betrayed!' Protest turns violent as Greece votes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T00:35:00.000+03:00", "replies_count": 0, "uuid": "8da4eb2e84a9695df8b3ff0e36a4233f92e5cbbb"}, "author": "", "url": "https://uk.finance.yahoo.com/news/betrayed-protest-turns-violent-greece-213500766.html", "ord_in_thread": 0, "title": "'We have been betrayed!' Protest turns violent as Greece votes", "locations": ["Greece"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 15, 2015, 22:51 BST - UK Markets closed 'We have been betrayed!' Protest turns violent as Greece votes By Ella Ide and Eve Szeftel | AFP – 16 minutes ago View Photo \n\nFirebombs thrown by furious anti-austerity protesters exploded in front of Greece's parliament Wednesday as anger over a new bailout deal spilled onto the streets of the capital. \nAs lawmakers prepared to vote on the unpopular deal, police fired tear gas to push back dozens of hooded and masked protesters, who threw rocks and stones as they chanted angrily in Syntagma square. \n\"We have been betrayed!\" shouted a man in a balaclava, as police used pepper spray and gas to stop a crowd breaching a security line blocking off the road to the prime minister's office. \nThe violence erupted on the sidelines of a rally of 12,500 people opposed to the passage of the reforms which many fear will increase suffering in the already debt-laden country. \nPrime Minister Alexis Tsipras and eurozone counterparts agreed to the tough reforms on Monday in order to unlock a new rescue for Greece worth up to 86 billion ($94 billion) -- angering many in his anti-austerity party and other leftwing supporters. \nOfficers could be seen dragging protesters away in handcuffs and police sources said some 40 people had been detained. \nClose to 20 police riot vans lined the streets around Syntagma, where ambulance workers and firemen handed out water to protesters caught in clouds of stinging tear gas. \nFour policemen and two AFP photographers were injured by flying debris and a television van parked nearby was set on fire, along with dumpsters and a Greek flag. \nWhile police pushed rioters away from parliament, those retreating vandalised ATMs and a few shop windows as they went. \n- 'Government of traitors' - \nTsipras has thrown his weight behind the reforms and Greece's parliament looked likely to adopt them later Wednesday -- despite rebels in the PM's Syriza party -- in large part thanks to the support of pro-European opposition parties. \nThe majority of Greeks voted against similar austerity terms in a referendum on July 5. \n\"Our government is a government of traitors. We voted 'No' then Tsipras signs up to even worse conditions. It's madness,\" raged unemployed demonstrator Arsenios Pappas, 35, before the violence broke out. \nNext (Other OTC: NXGPF - news ) to a banner showing a 'No' wrecking ball knocking down a wall of austerity measures, primary school teacher Natasia Kokkoli, 53, said the bailout deal \"is simply not fair\" and perhaps leaving the eurozone would be better. \n\"I think Greece is being used as an experiment by Europe. With the banks empty of course it's hard, but without the euro maybe Greece could find its way again,\" she said. \nVendors selling beer, roasted sweetcorn and nuts had been doing a brisk trade before gangs of mainly male protesters in black t-shirts, many sporting big bushy beards or sunglasses over their balaclavas, began taunting police. \n\"People are angry. Yes Tsipras had a choice, he chose to lie to us. This is the result,\" said Maximos, 37, as protesters near him waved a sign reading \"We said 'No', we meant 'No'\".", "external_links": [], "published": "2015-07-16T00:35:00.000+03:00", "crawled": "2015-07-16T00:52:23.000+03:00", "highlightTitle": ""}