{"organizations": [], "uuid": "1779d01da114b523e584c4480ab82f0dbe4f1029", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/j/x/z/a/image.related.afrArticleLead.620x365.giim1q.png/1437975374502.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/technology/why-ashley-madison-hack-exposes-aussie-businesses-and-poses-ethical-questions-20150727-giim1q", "country": "AU", "title": "Why Ashley Madison hack exposes Aussie businesses and poses ethical questions", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why Ashley Madison hack exposes Aussie businesses and poses ethical questions | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T11:22:00.000+03:00", "replies_count": 0, "uuid": "1779d01da114b523e584c4480ab82f0dbe4f1029"}, "author": "Yolanda Redrup", "url": "http://www.afr.com/technology/why-ashley-madison-hack-exposes-aussie-businesses-and-poses-ethical-questions-20150727-giim1q", "ord_in_thread": 0, "title": "Why Ashley Madison hack exposes Aussie businesses and poses ethical questions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US-based adultery website Ashley Madison was breached by hackers claiming to have ethical objections to its services. Share on twitter Share on Google Plus by Yolanda Redrup The hackers who have threatened chaos to the lives of customers of US-based adultery website Ashley Madison have thrown the public spotlight onto the weaknesses of corporate networks, which is particularly stark in Australia according to local experts.\nLeading Australian cyber security expert Chris Gatford of HackLabs, warned that Australia is currently years behind the United States when it comes to cyber crime prevention, and that Australian companies were keeping quiet about breaches on a daily basis.\nMr Gatford said the lack of local mandatory reporting of data breaches meant Australian consumers could be kept in the dark about their details falling into rogue hands.\n\"There's not a week that goes by when we're not contacted by an organisation that's been compromised,\" Mr Gatford said.\nSecurity expert Chris Gatford of HackLabs said the lack of local mandatory reporting of data breaches meant Australian consumers could be kept in the dark about their details falling into rogue hands. \"The industry in Australia is 10 years behind the US security-wise. In 20-odd years there have been dozens of these high-profile attacks, but it attracts interest for a few weeks and then companies forget about it and move on to something else.\"\nThe Ashley Madison hack last week spurred widespread discussions about cyber security, just as it had after Sony and Target were hacked in the US, but Mr Gatford said the topic only stayed at the forefront of a business's attention for a short period of time.\n\"The consciousness of organisations needs to change,\" he said. \"By the time they've finished reading this article they'll have moved on.\"\nBut Australian Centre for Cyber Security education director and University of NSW computer security associate professor, Richard Buckland, said no matter how good an organisation's cyber security was, it would never be good enough to make them safe from all attacks.\n \"It just depends on how attractive a target you are,\" he said.\n\"Ashley Madison was an obvious target. It was actually a case study I was using in my current course about tempting targets. Now I'm going to have to come up with a new case study.\"\nA question of ethics The Ashley Madison breach also raised a salient question about whether or not hacking can be ethical, and whether the nature of some businesses made them more likely, or even appropriate, targets.\nThe website for cheating partners had about 900,000 Australian users, and was hacked by a group calling themselves The Impact Team.\nThe team released selected data from Ashley Madison, and other smaller dating sites owned by parent company Avid Life Media (ALM), but threatened ALM that it would publish all customer records including credit card details unless Ashley Madison and another ALM site, Established Men, were shut down.\nThe rationale behind the hack was that the website had lied about its \"full delete\" service, where Ashley Madison charged customers a fee to delete all their data. On social media many people applauded the team due to the questionable nature of the website, which has the slogan \"Life is short. Have an affair\".\nTo all you people people who are on the wrong end of the #AshleyMadisonHack , you wanted to get f**ked?? Congrats, looks like you made it!\n— Peter Shurman (@shurmanator) July 21, 2015 But within the cyber security industry there was a general consensus that it was wrong to describe the hack as ethical.\nIntelligent Business Research Services (IBRS) information security advisor James Turner said while ALM's business model might be morally disagreeable, it was a legally trading company.\n\"ALM is entitled to the same legal protections as any other commercial entity,\" he said.\n\"The attackers who have apparently breached ALM's customer database may think they are operating ethically, but this position is indefensible. The hackers cannot claim with any credibility that they consider the impact on these families to be justified.\"\nMr Turner said the real impact of the hack would be on the families of the cheaters if the data is released.\nVillains not heroes \"The hackers are effectively claiming to be vigilantes, and for some this will hold appeal, but they are not superheroes. If they release the customer database, in part or whole, they're going to punish the innocent. These hackers are villains, pure and simple,\" Mr Turner said.\nThere are also some in the hacking community who believe The Impact Team is lying about the amount of data they've obtained from Ashley Madison.\nA hacking subreddit user with experience in so-called black-hat (or malicious) hacking, and an alleged former consultant to the FBI, said they had doubts about whether The Impact Team had all the information it claimed.\n\"Much of the mystique of hacking revolves around having the appearance of almost black magic-type powers in order to gain a psychological advantage,\" the Reddit user said.\nInstances of ethical hacking can exist. White hat hackers, computer security experts that specialise in penetration testing and find vulnerabilities in organisations' systems and then report them, have existed for decades.\nIn the hacking community, many have observed that \"ethical\" was just a matter of opinion – as demonstrated by the wide range of opinions on Edward Snowden and Chelsea Manning's classified data leaks.\nOne Reddit user compared the Ashley Madison hack to the raid earlier this month on Italian spyware vendor Hacking Team, where the stolen data revealed the company had allowed its customers to be surveilled on their smartphones and computers.\n\"Here, the raid itself was probably ethical. They saw a company that was doing evil things and targeted it,\" the Reddit user said.\n\"Distributing the results of that hack was certainly also ethical, as [that] company needed its dealings exposed. Lives may be ruined here as well, but [those were] lives responsible for aiding and abetting … oppressive governmental regimes, and they needed to be stopped.\"\nBug bounties In the US \"bug bounties\" are also an increasingly popular way for businesses to protect themselves.\nThrough these programs, individuals who discover vulnerabilities in an organisation's website are rewarded, and the business or government is able to fix the flaw before the public become aware of it.\nEarlier this month, two hackers hit the jackpot, scoring 1 million frequent flier miles each on United Airlines for finding security holes in the airline's computer systems.\nPalo Alto Networks chief security officer Sean Duca said organisations big and small can be targeted by hackers.\n\"Some of the threats have become advanced and sophisticated, but often it's the basic things a business hasn't done, like patching a system or employing security professionals or software that makes them vulnerable,\" he said.\n\"As part of their incident response plan, businesses need to work out their PR approach. Businesses that don't disclose data breaches can by lynched by the public.\"", "external_links": ["https://twitter.com/shurmanator/status/623616420165713920", "https://twitter.com/YolandaRedrup", "https://twitter.com/hashtag/AshleyMadisonHack?src=hash", "https://plus.google.com/https://plus.google.com/114369306974649582739/about"], "published": "2015-07-27T11:22:00.000+03:00", "crawled": "2015-07-27T10:05:32.919+03:00", "highlightTitle": ""}