{"organizations": ["Ford"], "uuid": "b320bdb4211cfc80a16449ebbeee4331918253ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-JO849_LUXTRU_G_20150727163619.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.wsj.com/articles/auto-makers-double-down-on-pricey-pickups-1438020122?ru=yahoo?mod=yahoo_itp", "country": "GB", "title": "Auto Makers Double Down on Pricey Pickups", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "Auto Makers Double Down on Pricey Pickups", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T02:44:00.000+03:00", "replies_count": 0, "uuid": "b320bdb4211cfc80a16449ebbeee4331918253ce"}, "author": "", "url": "http://www.wsj.com/articles/auto-makers-double-down-on-pricey-pickups-1438020122?ru=yahoo?mod=yahoo_itp", "ord_in_thread": 0, "title": "Auto Makers Double Down on Pricey Pickups", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Auto Makers Double Down on Pricey Pickups Buyers with money and desire to flaunt their rides can now spend $60,000 for a F-150 ENLARGE The 2016 Ford F-150 Limited will be available with features that push its suggested price to about $60,000, a move that reflects buyers’ willingness to pay luxury-car prices for pickups. Photo: Ford Motor/Reuters By 45 COMMENTS \nLooking to test the upper limits of what U.S. customers will pay for a pickup truck, Ford Motor Co. F 1.11 % later this year will launch a new version of its best-selling F-150 with one of the highest price tags ever attached to its workhorse truck. \nWith features including “fiddleback eucalyptus” wood trim, massaging seats and panoramic roofs, the Dearborn, Mich., auto maker’s coming F-150 Limited model will start about $60,000, a larger starting price than a Porsche Cayenne sport-utility vehicle. \nIndustry experts say buyers for this class of uber-trucks tend to be blue-collar entrepreneurs who have the money and desire to flaunt their rides. Some have traded in German luxury cars and want the same leather, electronics and luxury appointments in a pickup, dealers say. \nOverall, the share of $50,000 and up pickup trucks sold in the U.S. has more than doubled in the last five years, climbing from 9% in 2010 to 22% this year, according to car-pricing research firm Kelley Blue Book. \nFord has seen its mix of $50,000-plus pickup sales increase to 30% in 2015, up from 13% five years ago, while at Fiat Chrysler Automobiles FCAU -4.88 % NV, the mix is about 21%, up from 10% in 2010, according to KBB. \nAt General Motors Co. GM -0.03 % , the No. 2 pickup seller with the Chevrolet brand, its share of pickups selling for more than $50,000 has jumped from 6% in 2010 to 26% this year, the research firm estimates, a trend bolstered by the popularity of its more premium GMC lineup. \n“We really have a truck that is so versatile it is attracting the high-end luxury car buyer,” said Doug Scott, marketing manager for Ford’s F-series business. “They want to be part of an exclusive club and have the most unique [truck] out there,” he said. Related Ford Projects Up to 20% Mileage Gain in F-150 \nThe average sales price of a F-series hit a record $44,000 in June, $3,600 higher than a year ago, and nearly half of the vehicle’s buyers opt for a higher-end version of the truck. \nSome of Ford’s truck pricing power can be attributed to a recent F-150 redesign that included a move to a lighter-weight aluminum body. When new models are introduced, average sales prices typically increase. The higher prices are particularly welcome because of the higher cost of building the trucks with aluminum. \nOverall, Detroit auto makers are benefiting as customers respond to low gas prices and a growing economy by buying larger and more expensive vehicles. GM and Fiat Chrysler are getting more of their profit from pricey pickups and sport-utility vehicles. In part, demand for their bread-and butter sedans has weakened amid lower gasoline prices and emerging market sales are slumping. ENLARGE \nPickup truck sales grew at about twice the rate of the overall industry in the first half of this year, rising 10% through June, according to Autodata Corp. They now account for about 14% of all U.S. light-vehicle sales. \nOverall, U.S. auto sales are projected to top 17 million in 2015, one of the best years in the industry’s history. The growth is accompanied by record high transaction prices and relatively modest discounts, indicating car companies are in a much healthier position than they were when sales reached similar levels early last decade. \n‘ Customers keep telling us ‘we want more…’ ’ — Bob Hegbloom , Ram brand chief \nA fully-equipped Ram heavy-duty can run north of $70,000. The rush to add more luxury features to trucks won’t stop, said Bob Hegbloom, who runs Fiat Chrysler’s Ram division, because customers “keep telling us ‘we want more in our trucks.’ ” This summer, Ram rolled out a new version of its highest priced truck, the Laramie Limited, loading it up with richer features and adding $1,000 to the price tag. That model starts at about $51,000. \nMonte Clair, a general sales manager at Mac Haik Ford in Houston, said some buyers are trading in German luxury cars for well-appointed pickup trucks. “They’re getting the amenities they want in a luxury vehicle but they can stay with a truck,” Mr. Clair said. He recently had one customer trade in a 2012 Mercedes-Benz C63 AMG for 2015 F-150 Platinum, which had been Ford’s most expensive truck at $52,000. \nJohn Krafcik, a longtime auto executive now running online car buying firm TrueCar Inc., TRUE -14.99 % said Ford’s move isn’t just a clever marketing tactic. “These are successful blue-collar entrepreneurs,” he said. “There is a lot of social status and manufacturers have found a way to tap into it.” ENLARGE The share of $50,000-and-up pickup trucks, like the Ford F150 Limited, sold in the U.S. has more than doubled in the last five years from 9% in 2010 to 22% this year. Photo: Ford Motor Co. \nTrueCar estimates more F-series sell at over $50,000 than any other vehicle on the market, a crown it stole from Daimler AG DDAIY -1.12 % ’s Mercedes-Benz E-Class in 2011. Fiat Chrysler’s Ram is now No. 2 on that list. \nDespite the high prices, Ford’s truck sales have slid this year because dealers haven’t been able to get enough of the new models with one of Ford’s two truck plants down earlier in the year for retooling. \nOn the less expensive XLT version of its F-150, the auto maker recently began advertising discounts of up to $7,050 on the 2015 model. Regionally, some dealers have been offering another $3,000 off on the new truck, prompting some analysts and dealers to question whether demand for the new truck might be softer than the company anticipates. \nFord officials say its promotions are typical of the truck business and are tied to dealers getting healthier supplies of the 2015 model year F-150. \nThrough the first half of the year, Ford’s spending on truck incentives fell about $700 a vehicle, according to Autodata Corp., while it was down $9 for GM and up $95 for Fiat Chrysler. \nWrite to Christina Rogers at christina.rogers@wsj.com 198", "external_links": [], "published": "2015-07-28T02:44:00.000+03:00", "crawled": "2015-07-28T04:46:15.107+03:00", "highlightTitle": ""}