{"organizations": [], "uuid": "9e4285e112266a8bd171027f9de6d5ab8cda9227", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-13/bats-plans-block-trading-service-to-prepare-for-dark-pool-rules", "country": "US", "title": "Bats Plans Block-Trading Service to Prepare for Dark-Pool Rules", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Bats Plans Block-Trading Service to Prepare for Dark-Pool Rules - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T19:06:00.000+03:00", "replies_count": 0, "uuid": "9e4285e112266a8bd171027f9de6d5ab8cda9227"}, "author": "John Detrixhe", "url": "http://www.bloomberg.com/news/articles/2015-07-13/bats-plans-block-trading-service-to-prepare-for-dark-pool-rules", "ord_in_thread": 0, "title": "Bats Plans Block-Trading Service to Prepare for Dark-Pool Rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bats Chi-X Europe will unveil a block-trading initiative within months as markets prepare for European Union rules that will restrict dark-pool trading.\n“We fully intend to facilitate large-in-scale trading and we will be unveiling highly competitive initiatives in the coming months,” Hannah Randall, a spokeswoman for Bats Chi-X Europe, said in an e-mailed statement.\nRegulations that take effect in 2017 will cap trading away from public exchanges except for the biggest orders, under a mechanism known as the large-in-scale waiver. A consortium of banks and asset managers called Plato Partnership Ltd. is developing its own venue to facilitate large or block trades.\nThe European arm of Bats Global Markets Inc. said Monday it had removed itself from the competition to build the consortium’s dark pool.\nAccording to Plato’s website , the firms that appear to be in contention to build the market include Aquis Exchange Ltd., London Stock Exchange Group Plc’s Turquoise and Nasdaq OMX Group Inc. Turquoise introduced its own block-trading service in October.\nWhile EU officials want to make stock trading more transparent, they also want investors to continue making bigger transactions. Block trades are more vulnerable to exploitation from other traders.\nThe package of new regulations, called MiFID II, limits each dark pool to 4 percent of overall trading in an individual security. It also restricts total dark trading to 8 percent of volume per stock. Breaching either cap will lead to trading being suspended.\nThe Bats statement didn’t reveal whether its planned block-trading initiative will be available in its lit or its dark markets. Dark pools don’t display prices before a trade takes place. The regulations that take effect in 2017 will use data from the previous year’s trading, meaning behavior in 2016 will be used to calculate the limits on dark trading.", "external_links": ["http://www.batstrading.co.uk/\\", "http://www.platopartnership.com/polling-page.html\\"], "published": "2015-07-13T19:06:00.000+03:00", "crawled": "2015-07-13T14:38:34.000+03:00", "highlightTitle": ""}