{"organizations": [], "uuid": "f22ab1bd43793e3d84fe65abd2e6a65d077a9e65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/ed/63/ed630c317cacc28bcd03fa0c605b3a7a.jpg?itok=da4xm6MI", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/windows-10-wi-fi-sense-default-options-may-not-be-the-most-sensible-choice?cid=rss", "country": "US", "title": "Windows 10: Wi-Fi Sense default settings may not be the most sensible choice", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Windows 10: Wi-Fi Sense default settings may not be the most sensible choice", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T10:28:00.000+03:00", "replies_count": 0, "uuid": "f22ab1bd43793e3d84fe65abd2e6a65d077a9e65"}, "author": "Linda Foley, Identity Theft Examiner", "url": "http://www.examiner.com/article/windows-10-wi-fi-sense-default-options-may-not-be-the-most-sensible-choice?cid=rss", "ord_in_thread": 0, "title": "Windows 10: Wi-Fi Sense default settings may not be the most sensible choice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comment Play As Europe's biggest computer security event kicks off, Rory Cellan-Jones discovers how a new type of kettle could be compromised by hackers. on.aol.com \nFor those of you who cannot wait to upload the new free upgrade Microsoft is offering starting July 29 for Windows 7 and 8 users, put down the champagne and read all the attached information carefully. This is not like putting together an “easy-to-assemble” toy. \nComputer programs are complex systems that despite the hype, and still need you to pay attention to each and every choice that is required. The controversy’s focus is on Window 10's Wi-Fi Sense and Microsoft’s choice to make the default as “inclusion” unlike Apple’s decision of requiring customers to check opt-in on various privacy settings in their iCloud Keychain program. \nIn Windows 10 operating system there is an important security caution to be aware of before proceeding. In an attempt to create a programmer’s Utopia, Microsoft has set certain items to allow friends and acquaintances access to share your Wi-Fi network. KrebsonSecurity wrote a special article on July 29, the release date, outlining how to protect your information and your computers against unwanted sharing or intrusions. \nAccording to Microsoft’s website : “Wi-Fi Sense automatically connects you to nearby Wi-Fi networks, helping you save your cellular data for when you really need it and giving you more Internet connectivity options.\" It goes on to announce that while the program encrypts your Wi-Fi network password, it does allow anyone in any of your many social networks’ contact lists, or crowd-sourced with, to piggy-back onto your network. \nThat may be okay if they ask permission when at your home, but here is the kicker- should they even be within range of your network they can hop onto it without your knowledge. We are talking about strangers you have never met. \n“For networks you choose to share access to, the password is sent over an encrypted connection and stored in an encrypted file on a Microsoft server, and then sent over a secure connection to your contacts’ phone if they use Wi-Fi Sense and they’re in range of the Wi-Fi network you shared,” the FAQ reads. \nMicrosoft assures that those linking onto your Wi-Fi network will not only be able to access other shared resources such as file shares. However Brian Krebs encourages taking precautions anyway. “Given the myriad ways in which social networks and associated applications share and intertwine personal connections and contacts, it’s doubtful that most people are aware of who exactly all of their social network followers really are from one day to the next.” \nThen there is the decades long password issue. Computer users have been continually told to protect their networks from intruders. With Wi-Fi Sense doors will be opened that may, in the future, have computer security and personal privacy implications. Why the concern? For years, despite thousands of articles advising people to use strong passwords, ones not including widely known information about you, and to not use the same password for more than one purpose, consumers continue to disregard password security protocols. \nThen there are the people who write down their passwords on paper or notepads around their home – the very place where someone can link into your Wi-Fi network. Once a hacker, thief or so-called friend enters the password into his phone they can then link to friends of your friend, etc. Remember Windows 10 can be downloaded onto any mobile device as easily as a PC. \nMicrosoft also adds that Wi-Fi Sense blocks connections to other things on the wireless LAN. Sounds good but Krebs is not convinced. “That sounds wise – but we're not convinced how it will be practically enforced: if a computer is connected to a protected Wi-Fi network, it must know the key. And if the computer knows the key, a determined user or hacker will be able to find it within the system and use it to log into the network with full access.” \nEnsuring the default of “opt in” is switched “off” will simply add another step for you if you wish at one point to link networks, but will make for a more secure IT environment. Readers are urged to read up on this feature of Windows 10 before installing it. Microsoft has provided information about disengaging the Wi-Fi Sense feature along with the pros and cons. \nThis may be one type of crowd-sourcing that you should monitor for six months before joining. After all, we know hackers will find security holes in the system within the next two weeks. Identity theft may be the least of our worries then. Our lives will become an open book. Suggested Links", "external_links": [], "published": "2015-07-30T10:28:00.000+03:00", "crawled": "2015-07-30T10:43:30.510+03:00", "highlightTitle": ""}