{"organizations": [], "uuid": "60cab9d69134e7f04c67431151ceaf89f1217d19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/ao-world-sales-boost-sends-083140474.html", "country": "US", "title": "AO World sales boost sends share price soaring", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "AO World sales boost sends share price soaring", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T11:31:00.000+03:00", "replies_count": 0, "uuid": "60cab9d69134e7f04c67431151ceaf89f1217d19"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ao-world-sales-boost-sends-083140474.html", "ord_in_thread": 0, "title": "AO World sales boost sends share price soaring", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 21, 2015, 09:40 BST - UK Markets close in 6 hrs 50 mins AO World sales boost sends share price soaring By Sophie Jamieson | Telegraph – 9 minutes ago 6.61 +0.043 \nThe company has announced a 6.5% rise in UK revenue, five months after issuing a major profit warning \nShares (Frankfurt: DI6.F - news ) in online retailer AO World soared on Tuesday morning after it announced strong sales figures. \nThe company, which sells white goods in the UK and recently expanded to Germany, reported a 6.5pc rise in UK revenue in the three months ending June 30. \nOrders were up 13.9pc, the retailer said, with 11.2pc revenue growth year-on-year for AO.com. \nAO said: “This growth was delivered through a period of particularly intense competitive activity in the market, compounded by the uncertainty surrounding the general election.” \nShares climbed as high as 6pc in early trading on Tuesday. The sales growth comes on the back of a torrid time for the company, which issued a major profit warning in February . \nThe Bolton-based appliances company was set up by John Roberts after a £1 bet in a pub that he could not start his own business. \nAO World chief executive John Roberts \nA high-profile IPO last year saw AO valued at £1.2bn, but disappointing sales saw the share price plunge . \nJust weeks after AO's profit warning chairman Richard Rose sold 89pc of his shareholding for £10m , causing shares to drop as much as 8.6pc. \nLast month, the FTSE 250 company reported a pre-tax loss of £2.9m for the year to the end of March , compared with profits of £8m in 2013. \nAO is planning to expand further into the European market , with Austria and the Netherlands being mooted as possibilities because of their proximity to the existing German operation. \nIn its trading statement ahead of Tuesday’s AGM, AO said sales were continuing “to build satisfactorily in Germany”. \nThe company added: “As expected we have had a strong start to trading in July and we are encouraged by the indications of growth in housing transactions and disposable income in the broader market. \n“We are mindful of recent volatility and intense competitive activity in the market, however, our customer loyalty continues to increase and we see this coming through in repeat business. \n“The business is operating efficiently and we continue to expect the business model to deliver as expected for the full year.” \nKen Odeluga, a senior market analyst at CityIndex, said AO's update was unlikely to sway investors in the short term. \"As the ambitious European expansion is bedded down, little to no organic profit growth is likely for the next three-to-five years,\" he said. \nThe company's half-year results will be announced on November 24.", "external_links": [], "published": "2015-07-21T11:31:00.000+03:00", "crawled": "2015-07-21T11:41:33.632+03:00", "highlightTitle": ""}