{"organizations": [], "uuid": "0cde566d9f9bf5de38458e14cba12613bf5f380b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/48040349.cms", "site_section": "http://timesofindia.indiatimes.com/news/economy/finance/articlelist/1286551815.cms", "section_title": "News on Government Finance, Public Financing, Indian Finance | Economy News - Economic Times", "url": "http://timesofindia.indiatimes.com/india/India-Kyrgyzstan-to-hold-annual-joint-military-exercises/articleshow/48040337.cms", "country": "IL", "title": "India, Kyrgyzstan to hold annual joint military exercises", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "India, Kyrgyzstan to hold annual joint military exercises - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T21:05:00.000+03:00", "replies_count": 0, "uuid": "0cde566d9f9bf5de38458e14cba12613bf5f380b"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/india/India-Kyrgyzstan-to-hold-annual-joint-military-exercises/articleshow/48040337.cms", "ord_in_thread": 0, "title": "India, Kyrgyzstan to hold annual joint military exercises", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BISHKEK: Seeking a peaceful and secure neighbourhood amidst threat of terrorism and extremism, India and Kyrgyzstan on Sunday signed four agreements including one on bolstering defence cooperation and holding annual joint military exercises.\nPrime Minister Narendra Modi, who arrived here on Saturday night as part of his eight-day six-nation tour to Central Asia, emphasised the need to combat terrorism and extremism which he described as a threat without borders.\n\"We both seek a peaceful and secure neighbourhood at a time of challenges in our region. And, we have shared interest in combating extremism and terrorism that has become a threat without borders,\" he said following his talks with President Almazbek Atambayev.\nThe two countries signed four key agreements including on cooperation in defence and culture fields.\nREAD ALSO: PM Modi hails 'long-standing' ties between Turkmenistan, India\nTwo MoU were also signed for cooperation between the Election Commissions of the two countries and on cooperation in the sphere of Standards, a move that will help economic relations.\nPrime Minister Modi underlined that his visit to the countries in the region \"demonstrates the importance that we attach to a new level of relationship with Central Asia. Kyrgyzstan is a key part of that vision\".\nNoting that the bilateral defence ties are strong, he said a joint exercise 'Khanjar 2015' has just been completed.\n\"We have decided to hold joint military exercises on an annual basis,\" he said.\nModi underlined that the new agreement on defence cooperation would provide a \"framework to broaden bilateral engagement\" which would also include defence technology.\nREAD ALSO: Modi pitches for early implementation of TAPI project\nThe defence agreement signed is aimed at deepening bilateral cooperation in defence, security, military education and training.\nIt also envisages conduct of joint military exercises, exchange of experience and information, and exchange of military observers and instructors besides others.\nhttp://timesofindia.indiatimes.com/followceleb.cms?alias=terrorism and extremism,peaceful and secure neighbourhood,Kyrgyzstan Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-07-12T21:05:00.000+03:00", "crawled": "2015-07-12T10:48:38.000+03:00", "highlightTitle": ""}