{"organizations": ["AP Economics Writer | Associated Press"], "uuid": "a0b4775d5be2a780cc5809a4e7961584f25e945e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/FtdibvZwsrL8OWfzkZfx9g--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/US_AHTTP_AP_FINANCIALTIMES/9a8b3e488dfd461f7c0f6a706700f462_original.jpg", "site_section": "https://au.finance.yahoo.com/news/category-commodities/?format=rss", "section_title": "Commodities Market News - Yahoo!7 Australia Finance", "url": "https://au.finance.yahoo.com/news/us-factory-output-flat-2nd-131646664.html", "country": "US", "title": "US factory output flat for 2nd straight month", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "US factory output flat for 2nd straight month", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T17:20:00.000+03:00", "replies_count": 0, "uuid": "a0b4775d5be2a780cc5809a4e7961584f25e945e"}, "author": "", "url": "https://au.finance.yahoo.com/news/us-factory-output-flat-2nd-131646664.html", "ord_in_thread": 0, "title": "US factory output flat for 2nd straight month", "locations": ["US", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Christopher s. Rugaber"], "text": "Thu, Jul 16, 2015, 2:34 AM AEST - Australia Markets open in 7 hrs 26 mins US factory output flat for 2nd straight month US factory output flat for 2nd straight month, held back by sharp drop in auto production By Christopher s. Rugaber, AP Economics Writer | Associated Press – 2 hours 13 minutes ago Recommend View Photo \nIn this June 22, 2015 photo, a Buick Verano is assembled at General Motors' Orion Assembly plant in Orion Township, Mich. U.S. factory production was unchanged for a second straight month in June, the Federal Reserve said Wednesday, July 15, 2015, as a sharp drop in auto manufacturing was offset by greater output of furniture and chemicals. (AP Photo/Carlos Osorio) \nWASHINGTON (AP) -- U.S. factory production was unchanged for a second straight month in June as a sharp drop in auto manufacturing was offset by greater output of furniture and chemicals. \nThe cutback in auto production comes after three months of healthy gains and is likely temporary. Still, manufacturers are struggling to overcome several challenges, including the strong dollar, weak overseas growth, and cheaper oil. Sales at retail stores also fell in June, suggesting consumers are still cautious about spending, limiting demand for factory goods. \nThe Federal Reserve said Wednesday that overall industrial production — which includes mining output and utilities, as well as manufacturing — rose 0.3 percent, the best showing since November. \nMining, which includes oil and gas wells, rose 1 percent, as oil output increased. Utility output jumped 1.5 percent, the most since February, as people ramped up air conditioning in the summer. \nThere were signs in the report, however, that manufacturing output is recovering from weakness earlier this year. Factory production rose 1.4 percent at an annual rate in the April-June quarter, after shrinking 0.8 percent in the first quarter. \nOutside auto manufacturing, output rose 0.3 percent in June, the most since November. \nThat suggests \"the negative impact from the earlier appreciation in the dollar may be fading a little,\" Steve Murphy, U.S. economist at Capital Economics, a forecasting firm. \nAuto production fell 3.7 percent, likely reflecting a slowdown in sales in June. \nYet car purchases remain healthy. They reached an annual pace of 17.8 million in May, the highest in a decade, according to industry analyst Autodata Corp. Sales fell back to a 17.2 million pace in June. The National Automobile Dealers Association now forecasts that car sales will top 17 million this year for the first time since 2001. \n\"Based on the assembly line schedules from the key manufacturers and the strength of sales, we expect motor vehicle output to bounce back soon,\" Murphy said. \nThe dollar has increased about 14 percent against a basket of overseas currencies in the past 12 months. That makes U.S. goods more expensive overseas, cutting into exports. Yet most of that gain occurred last year. The dollar has leveled off since March. \nAnd falling oil prices have caused oil drillers to cut back on their purchases of steel pipe and other equipment. Oil prices fell to $53 a barrel this month from $60 in the spring. Prices topped $100 a barrel a year ago. \nBut the decline in oil and gas drilling may be bottoming out. New drilling fell 3.7 percent in June, the Fed said, the smallest decline since December. \nThere are other signs that manufacturers are adjusting to these changes and slowly boosting output. \nU.S. factories expanded at a faster pace in June for the second straight month, according to a survey of purchasing executives by the Institute for Supply Management, a trade group. Its index of manufacturing activity rose to 53.5 last month from 52.8 in May. That's the highest reading since January. Any figure above 50 signals expansion. @y7finance on Twitter, become a fan on Facebook", "external_links": [], "published": "2015-07-15T17:20:00.000+03:00", "crawled": "2015-07-15T19:36:45.000+03:00", "highlightTitle": ""}