{"organizations": [], "uuid": "baf3dd15ef9c16210bfdc76d46969c84bddead5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/03/markets-japan-stocks-idUSL3N0ZJ1CK20150703", "country": "US", "title": "Nikkei drifts lower ahead of Greek vote, Fast Retailing slides", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Nikkei drifts lower ahead of Greek vote, Fast Retailing slides | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T07:00:00.000+03:00", "replies_count": 0, "uuid": "baf3dd15ef9c16210bfdc76d46969c84bddead5b"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/03/markets-japan-stocks-idUSL3N0ZJ1CK20150703", "ord_in_thread": 0, "title": "Nikkei drifts lower ahead of Greek vote, Fast Retailing slides", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Nikkei slips 0.4 pct, Topix dips 0.1 pct * Fast Retailing slides after June drop in Uniqlo sales * Cross-shareholding reduction plan lifts SMFG By Shinichi Saoshiro TOKYO, July 3 Japan's Nikkei share average drifted lower on Friday as caution ahead of a Greek national vote over the weekend suppressed investors' appetite for risk, with Fast Retailing Co sliding after it reported a drop in domestic sales. The Nikkei share average lost 0.4 percent to 20,431.25 by mid-morning, weighed down by Wall Street's tepid performance overnight after U.S. non-farm payrolls data that was not quite as strong as expected. Still, a relatively calm view towards the pending Greek referendum limited the Nikkei's fall. \"Some see the Greeks supporting fiscal austerity on Sunday. If they do support austerity, equities will likely rise next week, and such a possibility is curbing the selling today,\" said Tsuyoshi Nomaguchi, a strategist at Daiwa Securities in Tokyo. Greek voters will head to the polls on Sunday to either accept or reject an international bailout deal, a step that could decide the future of their cash-strapped country's place in Europe. Fast Retailing was down 4 percent after it said on Thursday that same-store sales at its Uniqlo clothing outlets in Japan fell 11.7 percent in June from a year earlier. Sumitomo Mitsui Financial Group rose 2.2 percent after a report that it will create targets by this fall to reduce cross-shareholdings. Sumitomo Mitsui Financial's gains were positive for other banking shares such as Mizuho Financial Group Inc, which rose 1.3 percent, and Mitsubishi UFJ Financial Group , which climbed 0.9 percent. The broader Topix fell 0.1 percent to 1,646.13. The JPX-Nikkei Index 400 shed 0.1 percent to 14,867.92. (Editing by Edmund Klamann)", "external_links": [], "published": "2015-07-03T07:00:00.000+03:00", "crawled": "2015-07-03T06:37:54.000+03:00", "highlightTitle": ""}