{"organizations": ["St. James’s Place plc & Lancashire Holdings"], "uuid": "ea6cd3c8b7218d51dfca1a264917cc73e9ca8efd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-oil-gas/?format=rss", "section_title": "Oil News | Gas News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/buy-lgo-energy-plc-premier-135622420.html", "country": "US", "title": "Should You Buy LGO Energy plc, Premier Farnell plc, St. James’s Place plc & Lancashire Holdings Limited After Today’s Updates?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Should You Buy LGO Energy plc, Premier Farnell plc, St. James’s Place plc & Lancashire Holdings Limited After Today’s Updates?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T16:56:00.000+03:00", "replies_count": 0, "uuid": "ea6cd3c8b7218d51dfca1a264917cc73e9ca8efd"}, "author": "", "url": "https://uk.finance.yahoo.com/news/buy-lgo-energy-plc-premier-135622420.html", "ord_in_thread": 0, "title": "Should You Buy LGO Energy plc, Premier Farnell plc, St. James’s Place plc & Lancashire Holdings Limited After Today’s Updates?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Farnell"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 29, 2015, 15:14 BST - UK Markets close in 1 hr 16 mins Should You Buy LGO Energy plc, Premier Farnell plc, St. James’s Place plc & Lancashire Holdings Limited After Today’s Updates? By Jack Tang | Fool.co.uk – 18 minutes ago +6.9999 LGO Energy \nLGO Energy 's (LSE: LGO) operational update confirmed the presence of recoverable hydrocarbons at its latest development well, GY-676, in its Goudron Field development in Trinidad. As some wells near depletion, group oil production in the second quarter of 2015 fell to an average of just 951 barrels of oil per day (bopd), down from 1,550 bopd in the preceding quarter. But this decline in production should be temporary, as new wells are currently being drilled and three new wells have already been started production in June. Shares in LGO Energy fell 9% to 1.60 pence at the time of writing. \nShares in LGO Energy have already benefited from a series of positive news flows concerning its production outlook and its low cost of production, and it seems that much of this anticipated production growth has already been priced into its share price. With so much optimism surrounding the stock, I cannot help but worry about what further production delays would do to its share price. Premier Farnell \nShares in electronics group Premier Farnell (LSE: PFL) fell 15% to 141 pence at the time of writing, following the announcement of a downbeat trading update today. Year-on-year sales growth in the second quarter of 2015 is expected to have slowed to just 1.2%, down from 5.4% in the first quarter. Supply constraints for the Raspberry Pi were cited as a major factor for the slowing revenues, but there also seems to be a slowdown in its core North American and the UK markets. \nManagement now expects adjusted operating profit in the first half of 2015 will be approximately 10% lower than the previous year. Analysts had previously expected Premier Farnell would turnaround its trend of stagnant revenues and declining profitability by this year, but it appears that the company's recovery has not yet taken hold. Unless there are signs that the recovery could be sustained, investors will probably be better off avoiding Premier Farnell's shares. St James's Place \nSt James's Place 's (LSE: STJ) half-yearly report seemed to confirm that the momentum of growing client funds is continuing. It saw strong net inflows of funds under management of £2.7 billion in the first half of 2015. The asset manager also announced today that it had agreed to buy Bristol private wealth manager and broker Rowan Dartington for £34 million. \nOn a more downbeat note, its half-year pre-tax profits fell 6.9% to £72.9 million. Much of this was due to the unexpected increase in the Financial Services Compensation Scheme levy, which took out an additional £13.1 million from its operating profits. \nAs the trend of cash net inflows is more important to the company's long-term financial health than the temporary dip in earnings, St James's Place could still be worth a buy as a long-term holding. Lancashire Holdings \nShares in Lancashire Holdings (LSE: LRE) fell 4.6% to 640 pence by morning trading, as investors became concerned about intensifying competition in the specialty insurance markets. Lancashire benefited from a paucity of major catastrophe losses, but it suffered some substantial losses in the offshore energy, aviation and space lines of insurance. The insurer's combined ratio fell from 70.6% in the same period last year to 75.1% in the first half of 2015. \nAs a conservative underwriter, Lancashire has been willing to see its net premiums written fall 43% to £284.3 million. But despite underwriting so much less risk and suffering from some unexpected insurance claims, Lancashire is still very profitable and continues to have an industry leading combined ratio. Adjusted EPS for the first half of 2015 fell just 15% to $0.46. With a forward P/E of 11.8, shares in Lancashire Holdings are still very attractive. \nSearch for safety? \nIf you are looking for reliable income-generating opportunities, The Motley Fool has a free special report that lists alternatives more aligned with your investing strategy: \"The Fool's Five Shares To Retire On\" . These five large-cap shares have been selected for their income and growth prospects. The 5 companies generate stable cash flows; as they benefit from their dominant market positions and broad global exposure. \nThe special report is free and there's no further obligation. Click here to get your free copy. \nJack Tang has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-29T16:56:00.000+03:00", "crawled": "2015-07-29T17:15:29.133+03:00", "highlightTitle": ""}