{"organizations": [], "uuid": "b41bbbff3e71b1c0f367ca49834ea5fa5f14ba83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canajunfinances.com", "main_image": "http://www.canajunfinances.com/wp-content/uploads/2015/07/RDSP3.jpg", "site_section": "http://www.canajunfinances.com/comments/feed/", "section_title": "Comments for Canadian Personal Finance Blog", "url": "http://www.canajunfinances.com/2015/07/20/rdsp-questions-and-answers/comment-page-1/", "country": "US", "title": "Comment on RDSP Questions and Answers by bigcajunman", "performance_score": 0, "site": "canajunfinances.com", "participants_count": 1, "title_full": "Comment on RDSP Questions and Answers by bigcajunman", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T19:25:00.000+03:00", "replies_count": 0, "uuid": "b41bbbff3e71b1c0f367ca49834ea5fa5f14ba83"}, "author": "bigcajunman", "url": "http://www.canajunfinances.com/2015/07/20/rdsp-questions-and-answers/comment-page-1/", "ord_in_thread": 0, "title": "Comment on RDSP Questions and Answers by bigcajunman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nYet another interview, helped me create this set of questions, and answers, on the topic of Registered Disability Savings Plans . As with all my advice in this area, I start with check the CRA RDSP Web Page Link , and read about this topic yourself, but hopefully some of these answers I put together will help. As for what happened to the article that was to come from this “interview”, I haven’t seen anything yet (I seem to be fun to interview, but the information I give out, isn’t very print worthy). \n1. Approval for the Disability Tax Credit is required before an RDSP can be set up for an individual. It may be for a specified term or indefinite. How hard is it to obtain? Do you think disabled people or their caregivers need the assistance of a consultant (for fee or on commission) to get the approval? For us, it wasn’t too hard, but luckily we had the help of Ottawa Children’s Treatment Centre through CHEO (Children’s Hospital of Eastern Ontario) when my son was diagnosed with Autism. They assigned a social worker to help us, and the Psychologist who did the diagnosis filled in the appropriate forms (T-2201) to get the DTC , and then helped us get the DTC review “backdated” to when my son was born, as Autism is viewed as a disorder of brain development (or as a from birth disability). \nI have been fairly vocal in my dislike of “ for fee or commission ” firms that “help” folks get their DTC, as I think it is something that most folks should be able to do (with the help of their diagnosing physician). Many of these firms take a percentage of the DTC pay out, and some even attach trailers, so that they get a commission every year, which I think is excessive (if not loathsome). \n2. What other free or low cost services are available in the community to help people making an application? \nAs I have said, we got help from OCTC, I would assume that if you lived near a large metropolitan area, the children’s hospital should be able to help you out. Ultimately this is a job for the diagnosing physician. I have been told by a few of my readers that there are help groups in many communities that help folks (for free) get things done, if their physicians are unfamiliar with what needs to get done. Look on-line is my advice to look for this information at sites such as , Autism Ontario , or Children at Risk. \n3. Can you give me some examples of situations where eligibility for the DTC might be time limited and require re-application? \nDepending on the diagnosis or how it is written up it can be either in perpetuity or for a fixed period of time. In our case we will have to reapply in about 5 years, because with some diagnosis (like high functioning Autism), the CRA wants to see if a “disabled” label is still justified. \nMy guess would be that with other permanent disabilities, it would be unlimited, eligibility \n4. Who can set up an RDSP? OK, let me preface this by saying ALL of this information is on line on the CRA’s web page . If the child is under the age of majority, the parents, guardian or any public department or agency, that is legally authorized to act for the child can open an RDSP. If the beneficiary is old enough and competent they can open one themselves, or their legal representative (guardian, parent, etc.,) can do so as well. A Qualified Family Member (QFM) can also do so, under the right circumstances. \n5. What are minimum/maximum ages for participation in an RDSP? \nMinimum age is birth, the maximum age and benefits stop being paid into the plan after the age of 59, so I guess that is the maximum age, but it may not make a lot of sense around that age, as the grants stop being added after the beneficiary turns 49. \n6. When can the funds be withdrawn? At any time, however, the program is designed for long term savings, so the government will ask for all bonds & grants paid over the past 10 years (up to that amount) as a penalty, if money is taken out early. Now if there is a shorter life expectancy (less than 5 years) there are rules to allow for limited withdrawals with less penalties. \n7. Is the money in the fund taxable when it comes out? Yes, parts of the money are taxable, depending on how large the grants were that were put into the plan by the government, and the growth of the money in the fund. \n8. When selecting a financial institution to set up an RDSP, what questions should a consumer ask and what answers should they be looking for? In our case, the obvious questions were: am I going to be able to buy whatever I want? or will I be restricted to only buying specific Mutual Funds or GICs offered by the institution? For our situation, we went with TD Waterhouse because we had a great deal more flexibility in how the money could be invested in (in our cose low management fee index funds and GICs). Also TD Waterhouse was one of the first institutions to offer the savings program (that had this flexibility), and I had accounts already with Waterhouse. \n9. How can funds in an RDSP be invested? \nThat depends on what the institution lets you purchase. If it is a GIC based vehicle that is all you can buy, if it is a Mutual Fund based solution, only the funds available from the provider, but ideally it should be like an RRSP, RESP or TFSA, saving in whatever you want to save in. \n10. In your experience, do fees vary significantly among financial institutions? I am not sure what other institutions charge, I know about the TD set up, but any fees over and above Management Fees for funds strike me as punitive and a bad thing, given who the money is intended to help. \n11. What happens if you don’t have enough money to contribute every year on behalf of your child or dependant? Carry-forward of grant and bond eligibility? The maximum amount eligible to deposit into a single RDSP (you can only have one for each beneficiary), is $200,000, and there is no maximum how much you can put in any year, so in theory, you could put the whole thing in, at the beginning, HOWEVER, the matching grants do have limitations. \n12 . Can a parent, relative or friend transfer money from an RRSP or RRIF to an RDSP? What are the tax implications of doing so? Yes, there is an ability to roll moneys from an RRSP into an RDSP, but it does count against the total $200K limit, and will only get some grants money, for the year. \n13. In what circumstances might it make sense to borrow money to make an annual contribution? That’s a very good question, and I don’t really have an answer on that one. It depends on your ability to withstand interest payments and such? Given the grant and bond money is dependant on the parents’ income (until the age of majority is reached), it becomes a catch-22, should the parents go into debt on this? I think folks need to do the arithmetic for themselves and see whether it is worth taking on that risk. \n14. What happens to the money in the account, the bond and grant money if an individual no longer meets the criteria for the DTC? i.e gets a heart transplant and resumes the normal activities of daily life. Not sure about the heart transplant, I think you are still disabled, but that doesn’t matter. If the DTC is lost, you can apply to have the RDSP extended for a period, but eventually. All grant & bond moneys from the past 10 years must be paid back, but the growth in the fund can be rolled into an RRSP (I believe, not sure on that one though).", "external_links": [], "published": "2015-07-20T19:25:00.000+03:00", "crawled": "2015-07-21T02:21:55.995+03:00", "highlightTitle": ""}