{"organizations": [], "uuid": "a4a45a171665918efec0bc8f54d354d407741d94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/g/o/l/z/image.related.afrArticleLead.620x365.gigv15.png/1437447759541.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/health/health-insurance-premiums-to-rise-by-up-to-10pc-a-year-20150721-gigv15", "country": "AU", "title": "Health insurance premiums to rise by up to 10pc a year", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Health insurance premiums to rise by up to 10pc a year | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T10:29:00.000+03:00", "replies_count": 0, "uuid": "a4a45a171665918efec0bc8f54d354d407741d94"}, "author": "Share via Email", "url": "http://www.afr.com/business/health/health-insurance-premiums-to-rise-by-up-to-10pc-a-year-20150721-gigv15", "ord_in_thread": 0, "title": "Health insurance premiums to rise by up to 10pc a year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The 'real' increase in the cost of private health premiums could hit as high as 10 per cent per annum over the next five years, new analysis by UBS insurance analyst James Coghill shows. Peter Braig PBR Share on twitter Share on Google Plus by Jessica Gardner Households struggling to afford the cost of private health insurance should brace themselves for more bad news.\nThe 'real' increase in the cost of premiums could hit as high as 10 per cent per annum over the next five years, new analysis by UBS insurance analyst James Coghill shows.\nThe data is troubling for customers, but also for insurers like Medibank Private , Bupa and nib, which are facing slowing revenue growth as customers shop around for cheaper deals.\nEach year, private health insurers apply to the Health Minister to approve their premium hikes. Mr Coghill, in a recent note to clients, said these increases were expected to come in at the rate of about 6 per cent per annum in the coming years, which is already more than double the rate of inflation.\nHowever, recently implemented changes to the way the private health insurance rebate is applied will further hit hip pockets.\nThe 30 per cent rebate was introduced in 1999 and along with the lifetime health cover loading, which penalises people who take up health cover in their later years, has been effective in driving take-up of insurance. In 2000, the proportion of the population with private health cover rose to about 45 per cent, from about 31 per cent the previous year.\nBut Labor policy that was enacted last year on July 1 means that the rebate, which costs the government $6 billion a year, has begun to gradually shrink. This is because it is now linked, or indexed, to the economy-wide rate of inflation as opposed to the rate of premium inflation.\nMr Coghill said the combined effect of rising premiums, the scale-back of the rebate and big step reductions in the rebate when people earn too much (due to Labor-implemented means testing, which the Coalition has backed away from repealing), means a policyholder earning $85,000 a year will face an annual increase of 9.7 per cent over the next five years. The \"average\" earner will also face \"one sticker shock increase of [about] 20 per cent for the first income band change.\"\n \"At this rate of PHI [private health insurance] inflation, premiums would increase from 1.7 per cent of disposable income (ie. gross income less tax and Medicare Levy), to 2.3 per cent by 2019-20 and 2.8 per cent by 2024-25,\" he said.\nThis is bad news for the insurers, as Mr Coghill noted. He estimated one in five policyholders could face this level of increase nature over the next three years.\n\"If one third of these react by switching insurers for a better deal, this would theoretically equate to [an approximately] 2 per cent lift in the industry switching rate, which currently sits at [about] 4 per cent,\" he said.", "external_links": ["https://plus.google.com/https://plus.google.com/u/0/+JessicaGardner1/", "https://twitter.com/http://twitter.com/jessigardner"], "published": "2015-07-21T10:29:00.000+03:00", "crawled": "2015-07-21T08:08:00.658+03:00", "highlightTitle": ""}