{"organizations": [], "uuid": "22c392530b709134d382f09025b55120dccd8418", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/1/m/k/t/j/s/image.related.articleLeadwide.620x349.giiv2o.png/1437665598200.jpg", "site_section": "http://www.canberratimes.com.au/business/carbon-economy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/workplace-relations/finance-and-mining-sectors-told-to-lift-game-on-mental-health-20150723-giiv2o.html", "country": "AU", "title": "Finance and mining sectors told to lift game on mental health", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Finance and mining sectors told to lift game on mental health", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T23:33:00.000+03:00", "replies_count": 0, "uuid": "22c392530b709134d382f09025b55120dccd8418"}, "author": "", "url": "http://www.canberratimes.com.au/business/workplace-relations/finance-and-mining-sectors-told-to-lift-game-on-mental-health-20150723-giiv2o.html", "ord_in_thread": 0, "title": "Finance and mining sectors told to lift game on mental health", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mental illness still carries significant stigma in many workplaces, BeyondBlue has warned.\nAustralia's mining and finance giants are being urged to publish more information about how they support the mental health of their staff, with a new report finding these industries lag overseas peers.\nWhile most companies have measures to support the mental well-being of their staff – such as flexible workplace policies – a new study found there is little disclosure on the effectiveness of these programs.\nThe research, commissioned by the Australian Council of Superannuation Investors, found about a third of big financial and mining companies on the ASX 200 published information about the impacts of the mental health programs.\nIn stark contrast to the wide disclosure of physical health outcomes – such as workplace accidents – the report by research group CAER found there was room for improvement when it came to mental welfare.\nAdvertisement For instance, it said there was low disclosure of absenteeism, even though this can be related to mental health claims and is estimated to cost employers billions of dollars a year.\nIn finance, where there are higher-than-average rates of self-stated mental health problems, the report said a third of companies surveyed published data on staff turnover and 25 per cent had figures on workforce satisfaction.\nJust under 60 per cent of financial firms practised \"good\" or \"moderate\" disclosure in these areas, compared with 87 per cent of companies in Britain.\nThe mining industry has also attracted research into workforce mental health because of the strain on personal lives in the fly-in, fly-out workforce model.\nWhile more than half of miners had well-being programs, a minority disclosed details on turnover, worker satisfaction, absenteeism and overtime.\nIt comes as some investors put more pressure on companies to focus on the financial and economic costs of mental health that can lead to increased insurance claims and lower productivity.,\nACSI chief executive Louise Davidson said providing more information in this area was important for helping investors assess environmental, social and corporate governance issues.\n\"A lack of reliable and comparable disclosure of corporate performance, beyond that contained in traditional financial reporting, can undermine effective communication of these longer-term measures of business success by company boards to their owners,\" Ms Davidson said.", "external_links": [], "published": "2015-07-23T23:33:00.000+03:00", "crawled": "2015-07-24T23:23:04.738+03:00", "highlightTitle": ""}