{"organizations": [], "uuid": "581ef8f4b41a590d2e64900f0c50ff4bbbf8d833", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=12833_4517.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/individual-accountability-at-uk-68134/", "country": "US", "title": "Individual Accountability at UK Financial Institutions - All Change", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Individual Accountability at UK Financial Institutions - All Change", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T22:33:00.000+03:00", "replies_count": 0, "uuid": "581ef8f4b41a590d2e64900f0c50ff4bbbf8d833"}, "author": "Dentons", "url": "http://www.jdsupra.com/legalnews/individual-accountability-at-uk-68134/", "ord_in_thread": 0, "title": "Individual Accountability at UK Financial Institutions - All Change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Individual Accountability at UK Financial Institutions - All Change more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=f35fda74-2d96-4732-bb68-c908e99520ca\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nThe new UK senior managers regime, which will come into force on 7 March 2016, is part of a major overhaul of the accountability regime for individuals working in UK banks and investment firms (firms). Katharine Harle explains who it affects, and how, and summarises the key developments in the new regime since it was first announced in June 2014. \nOverview \nThe key features of the new regime have not changed since it was announced: Replacement of the approved persons regime with a senior managers regime (SMR). Key individuals who are ultimately responsible for parts of the bank's business will be approved as senior management function holders (SMFs). Firms will have to allocate responsibility among SMFs for a long list of prescribed responsibilities as well as responsibility for the firm's key business activities. Each SMF must have a Statement of Responsibilities and the whole process must be documented in a Management Responsibilities Map (MRM). Both must be kept up to date. SMFs will be subject to a presumption of responsibility, which means that, in the event of enforcement action for failings in their area, they will have to prove they acted reasonably. Introduction of a certification regime . Individuals who are not SMFs but perform \"significant harm functions\" (certification staff) will have to be assessed by firms and certified as fit and proper at least annually. The PRA's designation of \"significant harm functions\" aligns with those who will be \"material risk takers\" under CRD IV (a criterion for determining whether the CRD IV bonus cap applies to that person). The FCA's definition of certification staff covers those who perform customer-facing roles, roles requiring qualifications (including lawyers), managers of certified persons and other current approved persons such as benchmark submitters, prop traders and those responsible for CASS oversight. Introduction of new high-level conduct rules . New conduct rules will also apply to all bank staff except those performing ancillary functions (e.g. print room). A second tier of conduct rules will apply only to SMFs. Firms will have to train staff on the rules and notify the regulators of breaches. \nKey developments \n1. Application to UK branches of foreign banks \nIn March the regulators decided that the new accountability regime would be extended to UK branches of foreign banks (incoming branches). The FCA and the PRA jointly consulted on how to tailor it to incoming branches. The single market directives reserve certain matters to home state regulators. For this reason, the regulators are proposing that the new rules will apply in a different, more limited, way to UK branches of EEA entities (EEA UK branches) than to UK branches of non-EEA firms (non-EEA UK branches): Senior managers regime . For non-EEA UK branches, there will be a smaller number of SMFs, and a smaller number of prescribed responsibilities to be assigned amongst SMFs, than is the case for UK banks. \nFor EEA UK branches, none of the PRA's proposals will apply and the FCA's proposals will only apply two SMFs (MLRO and EEA branch senior manager). Allocation of responsibilities is reserved for home states so there will be no requirement to allocate prescribed responsibilities amongst SMFs. \nBoth types of branches must still produce an MRM covering the governing body of the branch. Certification regime . For non-EEA UK branches, the types of individuals who must be \"certified\" are the same as for UK banks. For EEA UK branches, those responsible for CASS oversight are excluded, as are any staff based outside the UK. Conduct rules . These will apply to non-EEA UK branches in the same way as for UK banks. They will also apply to EEA UK branches in the same way as for UK banks except that they will not apply to staff based outside the UK (other than SMFs). \n2. Application of the SMR to non-executive directors (NEDs) \nIn the original proposals, the full SMR regime applied to NEDs. This was widely criticised, primarily on the basis that it would force NEDs to perform quasi-exective roles and make it harder for them to provide independent scrutiny. \nThe regulators' revised proposals create two categories of NEDs: Those with a specific role (the Chairman and the Chairs of the Audit, Risk, Remuneration and Nomination committees), who will remain subject to the full regime. Other (so-called \"standard\") NEDs, who will not require approval or be subject to the presumption of responsibility or have any prescribed responsibilities ascribed to them. \n3. Guidance on the presumption of responsibility \nUnhelpfully the FCA's and the PRA's guidance on responsibility is not entirely consistent. Points of note include: Unlike the FCA, the PRA expressly states that, if more than one SMF is responsible, it may choose to pursue one, some or none of those concerned. The guidance from both regulators indicates that proper access to information and evidence that the individual took steps to test and challenge information will be important. The level of detail in the guidance will enable SMFs to use it as a checklist of things they should ensure they have done, and documented that they have done, to protect their position. It is not clear how the regulators will deal with gaps in responsibilities. \n4. Publication of final (PRA) and near-final (FCA) rules \nIn March 2015 the PRA published its final rules, and the FCA a near-final version of its rules. Key points include: \nFCA There will be new prescribed responsibilities for financial crime, remuneration policies and CASS compliance. Handover certificates will not be a compulsory requirement for SMFs. The certification regime may be extended to cover wholesale traders. \nPRA More than one senior manager may hold the same prescribed responsibility but each individual will, in principle, be wholly responsible. The PRA does not expect a significant increase in the number of approved individuals based in a parent or group entity. Firms with gross total assets of £250 million or less will be subject to a limited version of the SMR. \n5. Consultation on transitional aspects of the new regime \nUnder the proposals, it will be possible to \"grandfather\" existing approved persons across to the SMR without needing to go through the new approvals process provided: the regulators are notified (by 8 February 2016); and the individual performs a corresponding role at the date of notification and at the start of the new regime. \nNext steps \nFinal FCA rules, as well as final rules on NEDs and transitional issues, are expected this summer, with final rules for UK branches of foreign banks due later.", "external_links": [], "published": "2015-07-07T22:33:00.000+03:00", "crawled": "2015-07-07T23:14:04.000+03:00", "highlightTitle": ""}