{"organizations": [], "uuid": "a6ea116a24084a4fcdd9329dd472badd05e053e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/fintech/wp-content/uploads/sites/10/2015/07/SWIFT.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/fintech/payments/swift-data-shows-mounting-rmb-popularity-in-south-africa/", "country": "US", "title": "SWIFT Data Shows Mounting RMB Popularity in South Africa", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "SWIFT Data Shows Mounting RMB Popularity in South Africa", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T21:04:00.000+03:00", "replies_count": 0, "uuid": "a6ea116a24084a4fcdd9329dd472badd05e053e8"}, "author": "", "url": "http://www.financemagnates.com/fintech/payments/swift-data-shows-mounting-rmb-popularity-in-south-africa/", "ord_in_thread": 0, "title": "SWIFT Data Shows Mounting RMB Popularity in South Africa", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SWIFT Data Shows Mounting RMB Popularity in South Africa SWIFT Data Shows Mounting RMB Popularity in South Africa For the month ending June 2015, the RMB held the distinction as the fifth-most active currency for global payments by value in the world. Advertising Print This Post \nSWIFT, a global provider of financial messaging services, has reported its latest data showing the number of South Africa’s Renminbi (RMB) payments, according to a SWIFT statement. \nFor the month ending June 2015, the RMB held the distinction as the fifth-most active currency for global payments by value in the world, despite having accounted for just 2.09% of global payments. This figure represents a marginal decline of a -2.18% MoM from May 2015 – however, in terms of valuation, RMB payments managed to increase in value by 9.26% in June 2015. \nSouth African Connection \nMore specifically, SWIFT data shows that payments of the Chinese currency in South Africa have swelled by 33% YoY since July 2014 – under a wider lens however, payments have notched a growth of 191% over the past two years. \nFurthermore, SWIFT’s data showed that in June 2015, 31.3% of direct payments value between South Africa and China/Hong Kong were made in RMB, climbing from just 10.8% in June 2014 and only 4.6% a year prior in June 2013. The steadfast growth in value over the past two years underscores the growing trajectory of RMB payments as a viable payment mechanism. \nIn addition to direct flows between South Africa and Greater China however, SWIFT data also captured that approximately 70% of the number of payments between Greater China are still intermediated by the United States, overwhelmingly denominated in USD. This suggests that the RMB’s use is more of a supplementary means with existing currencies. \nAccording to Hugo Smit, Head of Africa South, SWIFT, in a recent statement on the RMB performance, “The rise of RMB usage in South Africa is another good indicator of the cross border use of the currency.” \n“Much of this growth has to do with the strengthened bi-lateral relations between South Africa and China, which were renewed at the end of 2014 to include trade co-operation and sustainable investment opportunities between the two countries. As a result of this effort, RMB usage in South Africa should continue to grow at a good rate,” he added. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-07-31T21:04:00.000+03:00", "crawled": "2015-07-31T20:44:39.925+03:00", "highlightTitle": ""}