{"organizations": [], "uuid": "cdfcb7173062914a5cbbf46d08fae457dc35b843", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/14/markets-saft-idUSL2N0ZT29Z20150714", "country": "US", "title": "COLUMN-The only game in town: James Saft", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "COLUMN-The only game in town: James Saft | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T08:00:00.000+03:00", "replies_count": 0, "uuid": "cdfcb7173062914a5cbbf46d08fae457dc35b843"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/14/markets-saft-idUSL2N0ZT29Z20150714", "ord_in_thread": 0, "title": "COLUMN-The only game in town: James Saft", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "( James Saft is a Reuters columnist. The opinions expressed are his own)\nBy James Saft\nJuly 14 (Reuters) - The lesson of recent developments regarding Greece, China and the Federal Reserve isn't that officials are losing control, but instead how events confirm the great extent to which they are the key determining force in financial markets.\nIndeed, for an investor, watching officialdom, in its many guises, is becoming something approaching the only game in town. As any gambler can tell you, when there is only one game in town it is hard to get an even break.\nThat's not to say that there aren't many investors doing fundamental analysis and making fine distinctions in how they direct their capital based on the results.\nBut a willingness by central bankers to intervene in markets, and tailor policy so as to support prices has made bureaucrat-watching a full-time job for more and more investors. That's even before we consider the case of China, where government in all its majesty reacted to a recent plunge by taking ever more extreme steps to force prices higher.\nIn the U.S., for example, Federal Reserve policy drives more than half the volatility, or day-to-day movement, in stocks today, according to calculations by hedge fund SLJ Capital. That compares to just 10 or 15 percent two decades ago.\nOne of the most common, and easy to make, mistakes of journalism is to conflate covering a government with covering a country. This is a seductive error, in part precisely because it is so easy to do: government buildings do not move. Similarly, it is a good deal easier for investors to track government policy than it is to, for example, work out the complex impact of new technology on existing and new businesses.\nEasy official-watching may be, but, for good or ill, in the post-crisis era, investors' obsession with policy is not a fault but a rational reaction. Unprecedented control of financial markets by officials is not a temporary aberration but an ongoing feature.\nThis rankles many investors, who fancy themselves as sleuths and seers, not mere second-guessers of politicians and policy-makers. It is a less heroic role, and more like being a lobbyist with no power.\nStill, saying that markets should be allowed to set the cost of capital and direct its allocation is one thing; investing as if this is true when clearly it is not is quite another.\nTHREE STORIES, ONE THEME\nThe three main market-moving stories of the past week, Greece, China and the Fed, all illustrate this point in complementary ways.\nChina is perhaps the clearest, and most egregious example. Having first encouraged small investors to flood the stock market, in part because rising stock market wealth might help encourage the growth of a consumer-based economy, the Chinese government found itself threatened when a sudden sell-off began in June.\nChina took a raft of steps, including allowing up to 50 percent of companies to suspend their shares, twisting executives' and funds' arms to buy or at least not to sell and appointing the Public Security Ministry to head an investigation into alleged manipulation by brokers making bets that stocks would fall. As if that wasn't enough there are now moves to create a 'national financial stabilization fund' to institutionalize government intervention in markets, according to People's Daily, the official newspaper of the Chinese Communist Party.\nArguments that China's stock market fall doesn't matter because thin ownership of equities means it won't hit the real economy rather miss the point. Who cares about or is speculating on the real economy? Certainly not Chinese savers, who are simply flowing through the gates that are opened to them as and when they can and hoping the powers that be smile on their speculations.\nThe ongoing debacle that is Greece and its relations with its euro partners too have transfixed markets, and the very tentative agreements reached Monday were an important factor behind a rally in both European and U.S. shares. While the future of Greece in the euro is economically important, the rally is not much more than relief that European Central Bank chief Mario Draghi's vow to do \"whatever it takes\" to save the euro still prevails.\nIt isn't the economic importance of Greece or even the unwieldy nature of the euro zone that inspires buying and selling, it is the way in which those affect market-supporting measures by the ECB.\nOr consider the Fed's 'Will they? Won't they?' act around raising interest rates later this year. Investors rightly imbue the Fed with great power, but yet much of the argument recently has centered on the idea that the Fed will wait until next year to hike because of - get this - Greece and China.\nFund managers are paid to manage money rather than sit on their hands. Still, when you play in the only game in town you usually ultimately lose. (At the time of publication James Saft did not own any direct investments in securities mentioned in this article. He may be an owner indirectly as an investor in a fund. You can email him at jamessaft@jamessaft.com and find more columns at blogs.reuters.com/james-saft ) (Editing by James Dalgleish )", "external_links": [], "published": "2015-07-14T08:00:00.000+03:00", "crawled": "2015-07-14T07:52:23.000+03:00", "highlightTitle": ""}