{"organizations": [], "uuid": "f20864fc7a260f3ae6994e800adcce1ff88ddf77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/30/spain-economy-idUSL5N10A28820150730", "country": "US", "title": "UPDATE 1-Spanish economy picks up pace as election nears", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Spanish economy picks up pace as election nears | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T11:50:00.000+03:00", "replies_count": 0, "uuid": "f20864fc7a260f3ae6994e800adcce1ff88ddf77"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/30/spain-economy-idUSL5N10A28820150730", "ord_in_thread": 0, "title": "UPDATE 1-Spanish economy picks up pace as election nears", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* GDP grows 1 pct q/q, 3.1 pct y/y\n* July inflation 0 pct, EU-harmonised CPI -0.1 pct (Adds details, economy minister's comments)\nMADRID, July 30 (Reuters) - Spain's economy grew at its fastest quarterly pace in over eight years in the second quarter, underpinning projections for strong growth in the rest of the year that should generate jobs and repair some of the damage wrought by a prolonged crisis.\nEconomic output grew 1 percent quarter-on-quarter in the April-June period, data from the National Statistics Institute showed on Thursday. That was in line with analysts' forecast.\nThe centre-right government, which expects the economy to grow a punchy 3.3 percent in 2015 - faster than its euro zone peers - is banking on that recovery to secure a second term in office in an election expected by year-end.\nIt still faces a major task to persuade voters the turnaround is trickling down to all, however.\nOver 5 million people are out of work, and while numbers of unemployed are starting to fall, with job creation reaching levels not seen in 10 years in the second quarter, many positions are badly-paid and temporary.\n\"We're starting to see the light at the end of the tunnel,\" said Economy Minister Luis de Guindos in a radio interview.\n\"We are now able to return to pre-crisis income levels,\" he also said, adding that Spain's unemployment rate, which dipped to 22.4 percent in the second quarter, was seen falling back to below 10 percent within the next three years.\nThe government has forecast only a modest drop to 19.6 percent next year.\nDe Guindos also suggested that the government could raise civil servants' salaries for the first time in six years when it presents next year's budget on Friday.\nThe second quarter jump in growth came at the start of what is expected to be a record tourist season for Spain as more visitors flock to its shores.\nThat should help drive growth in coming months too, though some economists see signs of a slowdown ahead.\nA revival in household spending, still highly dynamic in the second quarter according to the Bank of Spain, could start easing after an initial rebound effect.\nLow inflation, which has helped give cash-strapped families more disposable income, extended into July, however, with a preliminary reading of 0 percent this month, down from 0.1 percent in June.\nOn an annual basis, prices were down 0.1 percent in July, below a forecast and a June reading of zero. (Reporting by Sarah White and Julien Toyer , editing by John Stonestreet)", "external_links": [], "published": "2015-07-30T11:50:00.000+03:00", "crawled": "2015-07-30T10:56:33.799+03:00", "highlightTitle": ""}