{"organizations": [], "uuid": "5572a9be77c4fddad4d97f1a830fb0f4d1fc00a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/e/f/n/8/image.related.afrArticleLead.620x365.gimuze.png/1438157287655.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/chinese-sharemarket-are-the-markets-just-playing-catch-up-20150729-gimuze", "country": "AU", "title": "Chinese sharemarket: Are the markets just playing catch up?", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Chinese sharemarket: Are the markets just playing catch up? | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T15:42:00.000+03:00", "replies_count": 0, "uuid": "5572a9be77c4fddad4d97f1a830fb0f4d1fc00a4"}, "author": "Philip Baker", "url": "http://www.afr.com/markets/chinese-sharemarket-are-the-markets-just-playing-catch-up-20150729-gimuze", "ord_in_thread": 0, "title": "Chinese sharemarket: Are the markets just playing catch up?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Despite the recent falls, this calender year the Chinese sharemarket is still up 13 per cent. Mark Schiefelbein So there was some lost ground to be made up.\nAnd over the past 12 months Chinese shares did just that. In spades.\nThe Shanghai index has gained 68 per cent, while the local market has gone sideways and the S&P 500 has gained just 6 per cent. This calender year the Chinese sharemarket is still up 13 per cent.\nAll up the rise in the Shanghai index since the middle of 2008 is 45 per cent, 13 per cent for the top 200 index in Australia and 65 per cent for the broader US index.\n Impressive, but clearly not the stand-out.\nYet the fall of around 30 per cent since the middle of June has got investors spooked.\nIt has certainly been savage.\nThe markets know the story. Its elements have been beating investors over the head amid talk that China's growth is slowing.\nThere have also been some big moves in the past, so this is nothing new for seasoned investors.\nThe Chinese sharemarket more than halved from mid-2001 to mid-2005 mainly because of fears that non-tradeable shares may suddenly be dumped onto the market.\nIn July 2005, shares hit their lowest level for eight years, even though the economy was booming.\nGovernment action on shares not unprecedented The government then realised it had to act and sharemarket reform in 2005 triggered another massive rally.\nThe Shanghai Composite rose more than six-fold between July 2005 and October 2007.\nFor those that want to take a longer term view amid all the short term noise, HSBC said in a note to clients that companies like Alibaba, Baidu, Samsonite, Samsung Electronics and Advantech are all worth looking at.\nThe major concern for investors right now seems to surround what sort of impact the fall in the shares will have on the economy.\nBut history says that during the six years when the sharemarket went nowhere it didn't have an adverse impact on the economy.\nBesides, the sell off all happens so fast; consumers simply haven't had time to adjust wealth expectations and spending patterns.\nAnd it's only the last month that has shocked investors.\nOne reason why the sharemarket doesn't have a high correlation with the economy, according to BetaShares chief economist David Bassanese, is the Chinese stock market capitalisation is still only around 30 per cent of gross domestic product.\nThat's compared to around 100 per cent in countries such as Australia and the United States.\n\"And despite their large role in driving share market turnover, the degree of household direct share market exposure is still not especially high by global standards,\" adds Bassanese.\nValuations of shares aren't nearly as over-stretched as they were during the halcyon days of 2007.\nFurthermore, the Chinese government want to have Chinese locally listed shares included in the MSCI's Emerging Market Index as soon as possible.", "external_links": [], "published": "2015-07-29T15:42:00.000+03:00", "crawled": "2015-07-29T16:34:09.813+03:00", "highlightTitle": ""}