{"organizations": [], "uuid": "472e054019fd1c9f58f7710051213f71c32e465c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15107_1745.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/third-circuit-rules-that-actual-harm-28778/", "country": "US", "title": "Third Circuit Rules That Actual Harm Needed for Monetary Equitable Remedy", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Third Circuit Rules That Actual Harm Needed for Monetary Equitable Remedy", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T05:39:00.000+03:00", "replies_count": 0, "uuid": "472e054019fd1c9f58f7710051213f71c32e465c"}, "author": "Proskauer - ERISA Practice Center", "url": "http://www.jdsupra.com/legalnews/third-circuit-rules-that-actual-harm-28778/", "ord_in_thread": 0, "title": "Third Circuit Rules That Actual Harm Needed for Monetary Equitable Remedy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Third Circuit Rules That Actual Harm Needed for Monetary Equitable Remedy more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=935e0fa6-67a1-49dc-88c0-d59f845edb4e\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nThe Third Circuit recently held that a plaintiff was not entitled to a monetary, equitable remedy under ERISA § 502(a)(3) where he failed to prove actual harm. Perelman v. Perelman , Nos. 14–1663, 14–2742, 2015 WL 4174537 (3d Cir. 2015). Appellant Jeffrey Perelman (“Perelman”), a participant in the defined benefit plan (“Plan”) of Appellee General Refractories Company (“GRC”), brought suit in his individual capacity and on behalf of the Plan against his father, brother, GRC, and a former Plan administrator claiming his father, as trustee of the Plan, breached his fiduciary duties by investing Plan assets in companies owned and controlled by Perelman’s brother. Perelman claimed these transactions were not properly reported, reduced Plan assets, and increased the risk of default. Plaintiff sought injunctive relief, attorney’s fees and costs, and monetary relief under ERISA § 502(a)(3) in the form of restitution and disgorgement. The district court held that Perelman lacked constitutional standing to pursue his restitution and disgorgement claims because he did not demonstrate actual injury to himself. The district court dismissed all claims and denied Perelman’s request for attorney’s fees and costs. Perelman appealed seeking monetary relief and attorney’s fees claiming he was entitled to restitution or surcharge because, as a result of his father’s actions, the Plan suffered a diminution in assets, increasing its risk of default. The Third Circuit affirmed the dismissal of Perelman’s monetary equitable relief claims, noting that “[c]laims demanding a monetary equitable remedy . . . require the plaintiff to allege an individualized financial harm traceable to the defendant’s alleged ERISA violations.” First, it held that a diminution in Plan assets was insufficient for standing purposes absent individualized harm, which Perelman could not show because he had received all required distributions. As a result he suffered no financial harm traceable to the alleged ERISA violation. The Court also addressed Perelman’s allegations regarding the risk of default and noted that since the “[P]lan’s assets exceed[ed] its liabilities under a statutorily accepted accounting method, it passe[d] muster as a matter of law” even though the Plan was underfunded according to a different accounting method used by Perelman. Second, the Third Circuit also rejected his disgorgement claim because Perelman failed to show he had a right to any defendant’s profit. Finally, the Court dismissed as unsupported Perelman’s argument that he did not need to prove an individualized injury insofar as he sought monetary equitable remedies on behalf of the Plan. It also affirmed the denial of attorney’s fees because, although Perelman’s suit pressured defendants into significant concessions, an award of fees was not appropriate.", "external_links": [], "published": "2015-07-22T05:39:00.000+03:00", "crawled": "2015-07-22T05:52:21.645+03:00", "highlightTitle": ""}