{"organizations": [], "uuid": "9d4ecb21b7ded65c0d00817408150e4d313dafcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/oracle1.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/632348/1/oracle-extends-full-cloud-portfolio.html", "country": "US", "title": "Oracle Extends Full Cloud Portfolio", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Oracle Extends Full Cloud Portfolio", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T16:19:00.000+03:00", "replies_count": 0, "uuid": "9d4ecb21b7ded65c0d00817408150e4d313dafcf"}, "author": "", "url": "http://www.modernghana.com/news/632348/1/oracle-extends-full-cloud-portfolio.html", "ord_in_thread": 0, "title": "Oracle Extends Full Cloud Portfolio", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  27 July 2015 14:19 CET Oracle Extends Full Cloud Portfolio By Daily Guide \nOracle Executive Chairman and CTO Larry Ellison recently announced new additions to the Oracle Cloud Platform , a comprehensive, integrated suite of services that make it easier for developers, IT professionals, business users and analysts to build, extend and integrate cloud applications. \nWith more than 24 newcloud services, the Oracle Cloud Platform extends Oracle's leadership with the world's broadest and deepest portfolio of SaaS, PaaS and IaaS. \nSome fresh Oracle Cloud services include Oracle Database Cloud, Exadata, Oracle Archive Storage Cloud, Oracle Big Data Cloud, Oracle Integration Cloud, Oracle Mobile Cloud and Oracle Process Cloud. \nThe Oracle Cloud Platform helps customers build new applications, extend existing ones, and easily move existing on-premises workloads to the cloud with no application changes. \nWith the Oracle Cloud Platform, customers and partners are able to take advantage of the industry-leading Oracle middleware and database software that thousands of global organizations already use to run their own businesses, all delivered via cloud. \n'Oracle is growing really fast. We sold $426 million worth of business in SaaS and PaaS last quarter, a 200 percent increase over the same quarter last year. That’s an industry record, no company has ever sold that much in just one quarter,' said Ellison. \n'Oracle is the only company on the planet that can deliver a complete, integrated, standards-based suite of services at every layer of the cloud. Those technology advantages enable us to be much more cost-effective than our competitors. Our new Archive Storage service goes head-to-head with Amazon Glacier and it's one-tenth their price.' \nOracle Cloud Platform is experiencing exponential growth and is already powering some of the world's most recognizable brands and organizations. \nOracle Cloud Platform has more than 1,800 customers with 1,419 added in the last quarter. \nAustralian Finance Group, Avaya and Calixare, a few of the many organizations currently use Database Cloud, Java Cloud, Documents Cloud, Business Intelligence Cloud and the Database Backup Service. \n'According to IDC's CloudView Survey, the top IT benefit of PaaS is having a self-service environment for access to development and deployment tools' and for business users the top benefit is 'built-in integration with my SaaS applications,' said Robert Mahowald, Programme Vice President, Cloud Software, IDC. \nOracle Cloud continues to show strong adoption, supporting 70 plus million users and more than 33 billion transactions each day. \nIt runs on 54,000 devices and more than 700 petabytes of storage in 19 data centers around the world.", "external_links": [], "published": "2015-07-27T16:19:00.000+03:00", "crawled": "2015-07-27T15:56:49.349+03:00", "highlightTitle": ""}