{"organizations": [], "uuid": "debe699efe6b6cd54ff55350e7214f43beba60a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/30/markets-forex-idUSL5N10A47X20150730", "country": "US", "title": "FOREX-Dollar rises as U.S. growth supports rate-hike view", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "FOREX-Dollar rises as U.S. growth supports rate-hike view | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T18:18:00.000+03:00", "replies_count": 0, "uuid": "debe699efe6b6cd54ff55350e7214f43beba60a7"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/30/markets-forex-idUSL5N10A47X20150730", "ord_in_thread": 0, "title": "FOREX-Dollar rises as U.S. growth supports rate-hike view", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* U.S. Q2 GDP data supports view on Fed rate hike\n* Greenback gains against major currencies\n* Commodity-linked currencies struggle again\n* Swedish crown rebounds against euro on GDP data (Updates market action, changes dateline, previous LONDON)\nBy Richard Leong\nNEW YORK, July 30 (Reuters) - The dollar rose to its highest level this week on Thursday as news of faster U.S. economic expansion in the second quarter supported the notion that the U.S. Federal Reserve would raise interest rates, perhaps as early as September.\nThe government's first assessment of gross domestic product growth in the second quarter was 2.3 percent, swifter than the revised 0.6 percent pace in the first quarter but lower than the consensus 2.6 percent rate forecast of analysts polled by Reuters.\nThe latest GDP data followed the Federal Reserve's statement on Wednesday, which some traders saw as bullish for the greenback. Fed policymakers said they felt the economy had overcome a first-quarter slowdown and was expanding moderately, and nodded to \"solid job gains\" in recent months. That left the door open for a possible rate hike when policymakers next meet in September.\n\"The latest GDP report confirms the Fed's narrative that the first-quarter weakness was transitory. The bar for them to hiking rates is not very high,\" said Ian Gordon, G10 currency strategist at Bank of America Merrill Lynch in New York.\nThe dollar index rose 0.55 percent to 97.511 after touching 97.591, its highest this week. The greenback strengthened against major currencies following the second-quarter GDP news.\nIt was up 0.3 percent at 124.31 yen, while the euro shed 0.5 percent to $1.0930.\nWhile recent economic data have raised the chances of a U.S. rate increase, some analysts cautioned that Greece's unresolved debt woes and the turmoil in China's financial markets may worsen again, forcing the Fed to postpone a rate hike in September.\n\"It's not a done deal, but we are still of the view that a September (rate hike) liftoff is on the cards, contingent on the view that the data out of the U.S. continues to be firm,\" said Sue Trinh, RBC Capital Markets' senior currency strategist in Singapore.\nThe dollar's renewed strength put pressure on commodities prices and currencies closely linked to them.\nThe Canadian dollar and Norwegian crown were down 0.5 percent and the New Zealand dollar 1 percent.\nAnother mover was the Swedish crown following data that showed stronger-than-expected GDP in Sweden in the second quarter. ID:nL5N10A2CH]\nThe crown, which hit its lowest since February against the euro on Wednesday, was up 0.3 percent at 9.4581 crowns . It slipped to a three-month low against the dollar, last down 0.3 percent at 8.6575 crowns. (Additional reporting by Patrick Graham in London; Lisa Twaronite in Tokyo; Editing by Catherine Evans and Jonathan Oatis)", "external_links": [], "published": "2015-07-30T18:18:00.000+03:00", "crawled": "2015-07-30T17:26:27.050+03:00", "highlightTitle": ""}