{"organizations": [], "uuid": "c301ac192a69fd44863561978a07f271b0525d71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/chinas-yuan-eases-on-corporate-dollar-demand-set-for-weekly-gain/93987", "country": "IE", "title": "China’s yuan eases on corporate dollar demand, set for weekly gain", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "China’s yuan eases on corporate dollar demand, set for weekly gain | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T18:23:00.000+03:00", "replies_count": 0, "uuid": "c301ac192a69fd44863561978a07f271b0525d71"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/chinas-yuan-eases-on-corporate-dollar-demand-set-for-weekly-gain/93987", "ord_in_thread": 0, "title": "China’s yuan eases on corporate dollar demand, set for weekly gain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China’s yuan weakened on Friday as corporate dollar demand helped offset a stronger official guidance rate set by the central bank, traders said.\nThe People’s Bank of China (PBOC) set the midpoint rate at 6.1160 per dollar prior to market open, 0.02 percent firmer than the previous fix at 6.1171.\nThe spot market opened at 6.2044 per dollar and was changing hands at 6.2062 at midday, down 0.02 percent from the previous close.\nCorporates typically need more dollars in July when overseas-listed Chinese firms pay investors dividends, which is one of the factors driving demand for the U.S. currency.\nDespite China’s central bank cutting official interest rates and banks’ reserve requirement ratio (RRR) simultaneously last Saturday, the yuan rose a bit this week and is set to end the week up 0.05 percent if it closes at the midday level.\nSuch monetary easing measures typically add yuan liquidity to the market and put pressure on the currency’s value.\nBut traders suspected the central bank guided big state-owned Chinese banks to sell dollars to support the yuan whenever the exchange rate fell beyond the level of 6.21.\nThe yuan has mostly traded between 6.20-6.21 per dollar this week.\nTraders forecast that the yuan will continue moving in a narrow range in the short term. The chance for it to break the 6.22 per dollar is small, they said.\nMany Chinese officials have pledged to maintain the stability of the Chinese currency amid the current economic slowdown.\nThe latest macroeconomic data published on Friday showed that activity in China’s services sector slowed to its lowest in five months in June, suggesting the economy still needs further policy support despite some signs of steadying.\nTraders said the data had no immediate impact on market sentiment.\nOffshore yuan was trading 0.02 percent stronger than the onshore spot rate at 6.2054 per dollar.\nFirst Published on July 3, 2015 10:23 am", "external_links": [], "published": "2015-07-03T18:23:00.000+03:00", "crawled": "2015-07-03T09:09:18.000+03:00", "highlightTitle": ""}