{"organizations": [], "uuid": "c1dd5762b307959b7424ef2e50d2d0bcf0956b06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/07/13/12845783/Estate Planning Attorney Birmingham AL.jpg", "site_section": "http://www.prweb.com/rss2/homefinance.xml", "section_title": "Home and Family: Banking / Personal Finance", "url": "http://www.prweb.com/releases/2015/07/prweb12845783.htm", "country": "US", "title": "Alabama Attorney Gives Back to Community Through Birmingham Bar Volunteer Lawyers Program", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Alabama Attorney Gives Back to Community Through Birmingham Bar Volunteer Lawyers Program", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "c1dd5762b307959b7424ef2e50d2d0bcf0956b06"}, "author": "PRWEB", "url": "http://www.prweb.com/releases/2015/07/prweb12845783.htm", "ord_in_thread": 0, "title": "Alabama Attorney Gives Back to Community Through Birmingham Bar Volunteer Lawyers Program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I thank God for this program and for people like Mr. Griffin who don’t mind sharing their knowledge with the less fortunate Birmingham, AL (PRWEB) July 16, 2015\nRecently Alabama lawyer James B. Griffin of James B. Griffin, LLC gave back to the Birmingham community by volunteering his legal services at no cost through the Birmingham Bar Volunteer Lawyers Program. The Birmingham Bar Volunteer Lawyers Program or BBVLP is a program through which attorneys provide low-income citizens with free legal services when they are unable to pay for legal assistance for their civil legal problems.\nThe BBVLP is made up of attorneys and members of the Birmingham Bar Association who want to give back to the community in some capacity. In 2004, more than 2,400 citizens were assisted through the Volunteer Lawyers Program thanks to the time and legal assistance of almost 400 Birmingham Area attorneys. These legal problems include divorce, visitation, child support, evictions, estate and probate, real estate law, collections and garnishments, and other civil problems. BBVLP does not handle criminal cases.\nOne such woman who benefited greatly from BBVLP is Shari Reeves, who could not afford an attorney due to her financial state. She was dealing with divorce, disability, and her father’s death. She then learned the mortgage was not in her name, and her mortgage insurance was cancelled as a result. Without mortgage insurance, the mortgage company would foreclose, even though she was willing and able to assume her father's payments.\nAtty. James B. Griffin of James B. Griffin, LLC assisted Mrs. Reeves with the opening an intestate estate, making her the administrator of her father's estate. As administrator, Mrs. Reeves signed over the deed to herself and her brother - the heirs. She and her brother then put the property in her name alone.\n“I thank God for this program and for people like Mr. Griffin who don’t mind sharing their knowledge with the less fortunate,” shares Mrs. Reeves.\nThe Birmingham Bar Association, together with Legal Services Alabama, established the Birmingham Volunteer Lawyers Program in 1995 - later known as the Birmingham Bar Volunteer Lawyers Program. The non-profit organization operates through generous donations from Birmingham’s legal community and grants from foundations such as the Alabama Law Foundation and Legal Services Alabama.\nJames B. Griffin has over 14 years of experience in the legal field, and has a “Superb” 10/10 Rating on Independent Attorney Review Site AVVO.com. He is a teacher and speaker on Law and Ethics, former chairman of the State Bar of Georgia’s Environmental Law Section, and a member of the Birmingham Bar Association, Society of American Foresters, and Jefferson County Historical Association.\nJames B. Griffin serves clients from all across Alabama and Georgia handling cases related to estate planning & administration, probate, elder law, real estate, property rights, land-use and zoning law, environmental law, and natural resources law. For more information or to schedule a consultation, call (205) 502-2199 or visit http://www.jamesbgriffinlaw.com .\n¹ Alabama Probate Court Case No. 2015-22411", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5qYW1lc2JncmlmZmlubGF3LmNvbQ=="], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-17T07:38:05.000+03:00", "highlightTitle": ""}