{"organizations": [], "uuid": "108673bb2a831c7939dc548a27cee2d09be5ea3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/europe-fails-rid-itself-deflation-122957257.html", "country": "GB", "title": "Europe fails to rid itself of deflation threat", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Europe fails to rid itself of deflation threat", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T15:32:00.000+03:00", "replies_count": 0, "uuid": "108673bb2a831c7939dc548a27cee2d09be5ea3a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/europe-fails-rid-itself-deflation-122957257.html", "ord_in_thread": 0, "title": "Europe fails to rid itself of deflation threat", "locations": ["Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 14, 2015, 13:36 BST - UK Markets close in 2 hrs 54 mins Europe fails to rid itself of deflation threat Reuters - UK Focus – 3 minutes 51 seconds ago \n* Graphic on inflation http://link.reuters.com/nup25w \nBy Jeremy Gaunt \nLONDON, July 14 (Reuters) - Europe is failing to shake off the threat of deflation, with prices falling in Sweden, flat-lining in Britain and barely registering any increase in Germany and Italy. \nData on Tuesday underlined that central banks across the continent are making little headway in boosting inflation despite flooding their economies with cash through rock-bottom interest rates and/or outright money-printing. \nAt the same time, commodity prices, especially for oil, are falling on a number of factors, including an economic slowdown in China, and should feed even lower inflation over time. \n\"It is a worry in particular in the euro zone where you still have spare capacity,\" said Jennifer McKeown, senior European economist at Capital Economics in London, referring to less-than optimal production. \n\"There is a real risk that this becomes more sustained.\" \nEuro zone industrial production figures for May came in far lower than expected, at minus 0.4 percent compared with an expected plus 0.1 percent. \nDeflation -- the sustained falling of prices -- can become an aggravated assault on economies, prompting consumers to put off purchases in search of a better price and hence bringing growth to a halt or worse. \nThere is no firm sign of that to date, but Tuesday's tranche of inflation reports made grim reading for those seeking to get inflation back up to the around 2 percent yearly rate that many consider healthy. \nGermany, Europe's economic engine, reported consumer prices harmonised to compare with other European countries were up just 0.1 percent year-on-year and fell 0.2 percent between May and June. Italy fared slightly better, but still only saw prices rise 0.2 percent. \nConsumer prices in non-euro zone Britain, meanwhile, were unchanged in June from a year before, taking the inflation rate back to its lowest in more than half a century. \n\"The main drivers were the ongoing supermarket price war, which is depressing food prices, while there appears to have been more aggressive than usual clothing discounting in June,\" ING economist James Knightley said in a note. \nPrices plunged in non-euro zone Sweden, falling at an annual rate of 0.4 percent. \nCENTRAL BANK DILEMMA \nThe Swedish number was due to lower mortgage lending costs brought on by the central bank's cut in interest rates to minus 0.35 percent on July 2, a move prompted in part by deflation fears. Stripping out interest rate effects, inflation rose 0.6 percent annually. \nBut the headline data underlines the dilemma facing central banks, which are being forced to keep flooding their economies with cash to boost growth and inflation but are, to date, getting a relatively minor bang for their buck. \nThe European Central Bank has launched a 60 billion euro per month asset buying scheme, but even with this quantitative easing inflation is not expected to return to the ECB's target of just under 2 percent before 2018. \nNow (Other OTC: NWPN - news ) oil prices, which had been recovering from last year's slump have fallen more that 10 percent in the month to date. \nEuro zone inflation data is due on Thursday and is expected to show a year-on-year rate of 0.2 percent -- although this may fall with some of the recent country data. \nMcKeown at Capital Economics reckons the ECB will eventually have to increase or extend its asset-buying scheme to stave off further price negativity. \nIn Britain, there is a hawkish element among Bank of England policymakers that may want to raise interest rates as early as August in the face of an improving economy. \nOthers may also be wanting to hike -- Britain's is one of the first major central banks expected to raise interest rates from crisis-era levels near zero -- but the lack of inflation will most likely keep the shackles on for longer. (Graphic by Vincent Flasseur; Editing by Catherine Evans)", "external_links": [], "published": "2015-07-14T15:32:00.000+03:00", "crawled": "2015-07-14T16:13:36.000+03:00", "highlightTitle": ""}