{"organizations": [], "uuid": "350d9b0bf417b792e96adb72d5df081b52ce081b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/institutional-forex/wp-content/uploads/sites/9/2015/04/European-Securities-and-Markets-Authority-ESMA_880x400.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/institutional-forex/regulation/esma-extends-short-selling-ban-on-greek-equity-markets/", "country": "US", "title": "ESMA Extends Short Selling Ban on Greek Equity Markets", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "ESMA Extends Short Selling Ban on Greek Equity Markets", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:22:00.000+03:00", "replies_count": 0, "uuid": "350d9b0bf417b792e96adb72d5df081b52ce081b"}, "author": "", "url": "http://www.financemagnates.com/institutional-forex/regulation/esma-extends-short-selling-ban-on-greek-equity-markets/", "ord_in_thread": 0, "title": "ESMA Extends Short Selling Ban on Greek Equity Markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ESMA Extends Short Selling Ban on Greek Equity Markets ESMA Extends Short Selling Ban on Greek Equity Markets The measure will remain in place for another week as the disruption of the financial system in the country continues Advertising Print This Post Photo: Bloomberg \nAn official announcement made by the European Securities and Markets Authority (ESMA), confirms that the short selling ban which got implemented in Greece as the country introduced capital controls will remain in place for another week. \nThe prohibition of short selling activities has been imposed on the 30th of June by the Hellenic Capital Market Commission (HMCM). The measure is aimed at reducing the speculative pressure on local indices and to reduce volatility of the stock market. This is the second extension of the short-sale ban after last week the HMCM extended the initial term by one week . \nSimilar measures are typically taken in periods of extreme market volatility. Back in 2008 a number of stock markets across the globe have been hit by a similar ban, whilst the European sovereign debt crisis escalation in 2011 has triggered a series of short sale bans especially in the financial sector. \nIn 2008, fearing that selling stocks short was driving increased market turmoil, U.S. regulators have officially forbidden short-selling of financial stocks. A research study by the New York Fed reveals that the effects of the suspension has been muted. \nIn fact in the aftermath of the ban of short selling financial stocks tumbled and only stabilized after the ban was lifted. \nThe New York Fed’s study has found that on a number of occasions, stocks which are subjected to short-selling restrictions are underperforming unrestricted shares. \nThe new extension to the ban is set to start at 00:00:01 hours (CET) on the 14th of July 2015 and will remain active until 24:00:00 (CET) on July 20th 2015. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-07-14T03:22:00.000+03:00", "crawled": "2015-07-14T00:30:55.000+03:00", "highlightTitle": ""}