{"organizations": [], "uuid": "fd1ba0dc7898b7de3c3d75b9d16f8faff9c71374", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507190211.html", "country": "US", "title": "Angola: Water to Increase to 1.4 Million Cubic Meters in Luanda By 2017", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Angola: Water to Increase to 1.4 Million Cubic Meters in Luanda By 2017", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T23:23:00.000+03:00", "replies_count": 0, "uuid": "fd1ba0dc7898b7de3c3d75b9d16f8faff9c71374"}, "author": "", "url": "http://allafrica.com/stories/201507190211.html", "ord_in_thread": 0, "title": "Angola: Water to Increase to 1.4 Million Cubic Meters in Luanda By 2017", "locations": ["Angola", "Luanda", "Nigeria", "Cameroon"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria/Cameroon: Cameroon, Nigeria Walk Tightrope After Stalemates \nLuanda — Water Supply Company (EPAL-EP) has announced an increase to 750,000 meters cubic of water by December this year and the product may reach to 1.4 million cubic meters by 2017 in Luanda. \nThe Company CEO, Lionidio de Ceita, announced this Friday in Luanda at the end of his visit to the illegal water sales sites in Talatona region. \nThe official also announced an increase to 900,000 cubic meters of water by 2016. \nAccording to him, with the operation of central water treatment in Bita and Kilomga the water is expected to reach about 1.400 million cubic meters in 2017. Angola \nThe National Plan for Staff Training expects to train 140 PhD students in specific areas of science, technology and … see more » Copyright © 2015 Angola Press Agency. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-19T23:23:00.000+03:00", "crawled": "2015-07-19T23:32:32.495+03:00", "highlightTitle": ""}