{"organizations": ["Allot Communications"], "uuid": "5fe68aed9543d1f6d66a9da7ba73c944abeaa29c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://biz.yahoo.com/rss/headline?s=ALLT", "section_title": "Yahoo! Finance: ALLT Company News", "url": "http://finance.yahoo.com/news/rid-allot-communications-allt-now-123212528.html", "country": "US", "title": "Should You Get Rid of Allot Communications (ALLT) Now? - Tale of the Tape", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Should You Get Rid of Allot Communications (ALLT) Now? - Tale of the Tape", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T22:32:00.000+03:00", "replies_count": 0, "uuid": "5fe68aed9543d1f6d66a9da7ba73c944abeaa29c"}, "author": "", "url": "http://finance.yahoo.com/news/rid-allot-communications-allt-now-123212528.html", "ord_in_thread": 0, "title": "Should You Get Rid of Allot Communications (ALLT) Now? - Tale of the Tape", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Content preferences Done \nSimilar to wise buying decisions, exiting certain underperformers at the right time helps maximize portfolio returns. Selling off losers can be difficult, but if both the share price and estimates are falling, it could be time to get rid of the security before more losses hit your portfolio. \nOne such stock that you may want to consider dropping is   (ALLT), which has witnessed a significant price decline in the past four weeks, and it has seen negative earnings estimate revisions for the current quarter and the current year. A Zacks Rank #4/5 (Strong Sell/ Sell) further confirms weakness in ALLT. \nA key reason for this move has been the negative trend in earnings estimate revisions. For the full year, we have seen 1 estimate moving down in the past 30 days, compared with no upward revisions. This trend has caused the consensus estimate to trend lower, going from 17 cents a share a month ago to its current level of a loss of 19 cents. \nAlso, for the current quarter, Allot Communicationshas seen 1 downward estimate revision versus no revisions in the opposite direction, dragging the consensus estimate down to a loss of 13 cents a share from earnings estimate of 1 cent over the past 30 days. \nThe stock also has seen some pretty dismal trading lately, as the share price has dropped 29.7% in the past month. \nSo it may not be a good decision to keep this stock in your portfolio anymore, at least if you don’t have a long time horizon to wait. \nIf you are still interested in the computer-networks sector, you may instead consider a better-ranked stock - Cisco Systems, Inc. (CSCO). The stock currently holds a Zacks Rank #2 (Buy) and may be better selection at this time. \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days . Click to get this free report >> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report", "external_links": [], "published": "2015-07-16T22:32:00.000+03:00", "crawled": "2015-07-16T23:54:28.000+03:00", "highlightTitle": ""}