{"organizations": [], "uuid": "c74a68eaa4616f1748812cc49ff98e23702f2008", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/e/t/q/m/image.related.articleLeadwide.620x349.giedo8.png/1437111527307.jpg", "site_section": "http://www.canberratimes.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/world-business/how-this-app-accidentally-made-7-million-in-two-weeks-20150717-giedo8.html", "country": "AU", "title": "How this app accidentally made $7 million in two weeks", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "How this app accidentally made $7 million in two weeks", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T13:38:00.000+03:00", "replies_count": 0, "uuid": "c74a68eaa4616f1748812cc49ff98e23702f2008"}, "author": "Joshua Brustein", "url": "http://www.canberratimes.com.au/business/world-business/how-this-app-accidentally-made-7-million-in-two-weeks-20150717-giedo8.html", "ord_in_thread": 0, "title": "How this app accidentally made $7 million in two weeks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In Fallout Shelter , players control their very own nuclear bomb shelter which resembles a post-apocalyptic ant farm.\nFor a fleeting moment, mobile gaming meant more than Candy Crush, Game of War, and Clash of Clans.\nAt last month's E3 conference in Los Angeles, Bethesda Softworks, a company normally focused on high-end titles for consoles and PCs, launched a smartphone game called Fallout Shelter , intended to drum up excitement for the next version of its popular Fallout franchise.\nThe main thing it has done is give us more faith that the gaming audience is enormous, and they don't care what device they're playing on.\nTodd Howard, game director at Bethesda In the game, players control their very own nuclear fallout shelter, known as a vault, which resembles a post-apocalyptic ant farm. The cheeky little game was an instant hit.\nLarge releases for consoles can cost upwards of $US100 million to produce and market. Photo: Bloomberg\nIt might not seem surprising that a reputable video game company could make a popular mobile game, but Bethesda's success with Fallout Shelter is actually pretty unusual.\nCompanies that make games for consoles and personal computers have generally not done well with smartphone apps. The mobile gaming market is often discussed as though it's completely distinct from the other wings of the gaming industry, and never the two shall meet.\nThe experience of Fallout Shelter both undermines and reinforces this narrative.\nThe free app brought in $US5.1 million ($6.9 million) in its first two weeks by selling players \"lunchboxes\" that speed along their progress in the game, according to data released Thursday by market-research firm SuperData.\nIt was the most downloaded iPhone game in the US for most of the days over the next three weeks and was one of the 10 top-grossing games in the country almost every day until last Monday.\nAt some point during its brief run, it was the most downloaded iPhone game in 48 countries and the highest-grossing game in 11. But its early success seems to be ending, as it drops down the charts in terms of both downloads and revenue.\nBethesda has been noodling around with the idea for Fallout Shelter for years. You can actually see what looks like the gameplay for it in a 2008 trailer for Fallout 3:\nTodd Howard, the game director at Bethesda, says the company was surprised by the success of the app, which it saw primarily as a way to promote Fallout 4, the next full game in the franchise.\n\"The main thing it has done is give us more faith that the gaming audience is enormous, and they don't care what device they're playing on,\" he says. \"They all have phones and iPads.\"\nPeople might be interested in playing both mobile and console games, but the economics of the two formats are completely different.\nLarge releases for consoles can cost upwards of $US100 million to produce and market, but then bring in huge chunks of cash when people wait in line at GameStop all night to fork over $US60. Mobile games cost much less to make, and the money comes in smaller increments over time.\nHoward declined to say how much Fallout Shelter cost to develop, but he says its success made it almost \"infinitely profitable\".\nStill, $US5 million is a drop in the bucket for a company like Bethesda.\nWhile Nintendo looks to finally be preparing a big bet on the smartphone market, it seems unlikely that many other developers who didn't start off in mobile see smartphones as a large business opportunity in and of themselves.\n\"This is a nice conversation piece during the meetings, but it's not going to make or break the model,\" says Joost van Dreunen, chief executive of SuperData.\nIt's also peanuts compared with what companies such as Supercell and King bring in on their mobile games.\nClash of Clans made $US113 million in revenue in May, while Candy Crush Soda Saga made $US46 million.\nThere are rare exceptions, including Fallout Shelter and Flappy Bird, but they usually fade quickly.\nThe winners in the mobile market have mastered the art of persuading people to pump money into free games with in-app purchases, and they also use their successful games to market their newer ones. So far, it has proven nearly impossible to break their hold on the mobile gaming industry.\nKris Graft, the editor-in-chief of gaming site Gamasutra, says Fallout Shelter's quick decline is unsurprising.\nIt's a relatively short game, leaving people without much new to do once they've gotten the hang of building out their vaults.\n\"They didn't really have a plan to keep it going, to keep extracting money from people who were playing it,\" Graft says.\nHoward acknowledges that Bethesda put practically no thought into how it might make money from a mobile app, and the fact that it made any at all was essentially a bonus.\nBut the company is trying to extend the life of Fallout Shelter.\nIt's coming out with an Android version, and Howard says there are other plans for expansion in the works, although he wouldn't say what they are.\nIf anything, the app's long-term impact is likely to be that other publishers will try to build excitement for their major projects by giving gamers something to do with their smartphones while they wait for the real thing.\nBloomberg", "external_links": ["https://www.youtube.com/embed/iYZpR51XgW0"], "published": "2015-07-17T13:38:00.000+03:00", "crawled": "2015-07-18T07:40:51.000+03:00", "highlightTitle": ""}