{"organizations": ["Investopedia", "Wal-Mart"], "uuid": "d3b616bece1b05e9da298176de78c544bc84d740", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.investopedia.com", "main_image": "http://i.investopedia.com/inv/genericcontentimages/activetrading/133724338.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://www.investopedia.com/stock-analysis/072715/no-jetcom-not-threat-walmart-wmt-aapl-amzn-ebay.aspx?partner=YahooSA", "country": "GB", "title": "No, Jet.com Is Not a Threat to Wal-Mart", "performance_score": 0, "site": "investopedia.com", "participants_count": 0, "title_full": "No, Jet.com Is Not a Threat to Wal-Mart", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T00:04:00.000+03:00", "replies_count": 0, "uuid": "d3b616bece1b05e9da298176de78c544bc84d740"}, "author": "", "url": "http://www.investopedia.com/stock-analysis/072715/no-jetcom-not-threat-walmart-wmt-aapl-amzn-ebay.aspx?partner=YahooSA", "ord_in_thread": 0, "title": "No, Jet.com Is Not a Threat to Wal-Mart", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No, Jet.com Is Not a Threat to Wal-Mart By Investopedia | July 27, 2015 A A A | \nWhether retail behemoth Wal-Mart (NYSE: WMT ) can successfully gain traction with its turnaround remains to be seen, but investors need not worry that e-commerce start-up Jet.com will be the cause if it ends up faltering. \nJet.com generated a lot of buzz and fanfare as it launched operations on Tuesday, and it was immediately hailed as an Amazon-killer due to the similarities in their business models. It was also suggested the online retailer could be a threat to Wal-Mart as, the company has made e-commerce a central component of its recovery. \nHowever, there are enough holes in the Jet story that Wal-Mart investors can breathe easy. First, the start-up is losing money ... lots of it. The company subsidizes customer purchases if necessary and admits its business only works when selling at least $20 billion worth of goods annually. According to The Wall Street Journal , only Amazon, eBay, and Apple have greater online \"gross merchandise volume\" in the U.S. Jet.com also needs 15 million members or more to turn a profit. \nWal-Mart is better positioned. Like Jet.com, the Wal-Mart membership program is $50 a year and gives members the chance to purchase the full breadth of groceries and goods its stores offer and more. And though Jet says it will be ruthless in its pursuit of being the low-price leader, few have managed to ever beat Wal-Mart at that game. \nIn its fiscal 2016 first quarter earnings report, Wal-Mart reported that while global net sales fell 0.1%, e-commerce sales surged 17% from the year-ago period and added 20 basis points of improvement to its comparable-store sales. In fact, mobile traffic to its website more than doubled in the quarter, and it enjoyed higher conversion rates as well (the number of people actually buying stuff once they reached the site). The company has also committed to accelerating its e-commerce division's contribution this year. \nEvery so often, someone comes along thinking it will be able to knock the industry leaders off their pedestals simply because it has a good story. While Jet.com's tale is an interesting one, it is hard to see it successfully challenging Wal-Mart for supremacy. Rather, it looks more like a dot-com era start-up ready to crash and burn. \nThe $18 million fortune about to be ripped from your credit card Bad news for your credit card company. The plastic in your wallet may soon be gone forever. And once it is, it could cost major credit card companies as much as $18 million a day! Good news for you. Because when you're finally able to say \"goodbye\" to the cards stuck in your wallet, a little-known tech company responsible for finally putting an end to plastic could hand its investors life-changing profits. A revealing investor alert from The Motley Fool has the full story. Click here to get it now . \nRich Duprey has no position in any stocks mentioned.", "external_links": [], "published": "2015-07-28T00:04:00.000+03:00", "crawled": "2015-07-28T00:27:55.775+03:00", "highlightTitle": ""}