{"organizations": [], "uuid": "09aabdf47a0fb15c87c02b18168936a4f23eddff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/f/g/4/f/image.related.afrArticleLead.620x365.gig4xw.png/1437633506484.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/sport/wallabies-put-best-foot-forward-as-rugby-world-cup-fever-builds-20150721-gig4xw", "country": "AU", "title": "Wallabies put best foot forward as Rugby World Cup fever builds", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Wallabies put best foot forward as Rugby World Cup fever builds | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T22:30:00.000+03:00", "replies_count": 0, "uuid": "09aabdf47a0fb15c87c02b18168936a4f23eddff"}, "author": "Share via Email", "url": "http://www.afr.com/business/sport/wallabies-put-best-foot-forward-as-rugby-world-cup-fever-builds-20150721-gig4xw", "ord_in_thread": 0, "title": "Wallabies put best foot forward as Rugby World Cup fever builds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rob Horne of the Wallabies runs the ball during the Australia versus South Africa match at Suncorp Stadium in Brisbane on July 18. Getty Images by Jason Clout The Australian Rugby Union is upbeat about its World Cup chances, with chief executive Bill Pulver expecting great results later this year. \"We are going there to win it. We've assembled a very good squad and have an excellent coaching staff,\" Pulver says.\nThe Wallabies, under head coach Michael Cheilka, launched the season in the right fashion with a 24-20 victory over South Africa in Brisbane at Suncorp Stadium on July 18. The Australians were trailing late in the game before centre Tevita Kuridrani forced his way over the line to snatch victory.\nRugby World Cup years necessitate a shortened test series against regular opponents New Zealand, South Africa and Argentina. The Wallabies head to Argentina for their next match in the Rugby Championship on July 25 and then finish with the much-anticipated Bledisloe Cup game against the All Blacks on ANZ Stadium in Sydney on August 8.\nThen the rugby world will focus on the RWC, which kicks off in England on September 18. Australia's first match will be against Fiji on September 23 at Cardiff. The Wallabies play Uruguay on September 27 in Birmingham before concluding their pool matches with two games at Twickenham, facing England on October 3 and Wales on October 10.\nMuch has been made of the challenge the Wallabies have in progressing from what is seen as one of the toughest pools. But Pulver says the Wallabies are looking forward to the challenge. \"You need to beat the best to win a World Cup. Those matches will be better preparation for the later games than a few lopsided matches.\"\nAustralia has a fine record in World Cups staged in Britain. The Wallabies won their first World Cup when they beat England 12-6 in the 1991 final in a tournament hosted by England, France, Ireland, Scotland and Wales. Australia claimed a second World Cup by defeating France 35-12 in the 1999 final in a tournament mainly played in Wales.\nOverseas players One of the reasons Pulver is optimistic about the Wallabies' chances this year is the depth across many positions. \"There are a lot of good players competing for a spot in the squad,\" he says.\n That depth could be crucial in a tight tournament when injuries strike. In addition to the talent playing in the Super Rugby competition, the ARU has elected to further augment the Wallabies by enabling certain overseas-based players to be chosen for Australia. Its goal has been to provide an opportunity for loyal servants of the game to compete in the lucrative overseas competitions while not disadvantaging players who elect to stay here.\nSome countries basically have their top XV players based overseas, Pulver says, \"but that's not what the ARU or the fans here want to happen\".\nInstead the ARU has a policy where a player who has played more than 60 tests and held a professional contract for at least seven years is eligible for Wallaby selection, even if they are playing overseas. A player returning to an Australian Super Rugby club who signs a two-year deal is also eligible for selection immediately they return.\nAfter a tough period, Pulver is also positive about the financial outlook for the game. The ARU has had to trim costs in the past few years but Pulver says the new broadcasting deal – which he hoped would be in place by the time of the World Cup – would give the sport a solid platform.\nFox Sports has massive coverage planned for the World Cup this year. It will have a 24-hour channel dedicated to the RWC and will show all of the 48 tournament matches live in HD and with no advertisements while play is going on. Fox Sports Australia CEO Patrick Delaney says: \"We are big believers in rugby and this Wallaby team.\"\nThe broadcaster will have an Australian commentary team including Greg Clark, John Eales, George Gregan, Phil Kearns, Tim Horan, Greg Martin and Rod Kafer. Delaney says all of the Wallabies matches and other key games will be handled by its team.\nThe RWC also looks set to be a major commercial success. Bernard Lapasset, chairman of World Rugby, the body which runs the sport globally, says this tournament should set new records. Revenues are in line with budget yet ahead of schedule, with all worldwide partnerships completed in record time.\nWorld Rugby CEO Brett Gosper says the RWC could generate £150 million ($317 million) for investment back into the sport.", "external_links": [], "published": "2015-07-21T22:30:00.000+03:00", "crawled": "2015-07-23T16:38:08.214+03:00", "highlightTitle": ""}