{"organizations": [], "uuid": "43f34b5664a2bf67fe4871544c36bffe7b4deb03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static6.businessinsider.com/image/5593c4dc5afbd355428b456f/euro-zone-factory-growth-stutters-as-china-japan-heals.jpg", "site_section": "http://feeds.feedburner.com/TheMoneyGame", "section_title": "Finance", "url": "http://www.businessinsider.com/a-new-poll-has-good-news-for-jeb-bush-2015-7", "country": "US", "title": "Euro zone factory growth stutters as China, Japan heals", "performance_score": 0, "site": "businessinsider.com", "participants_count": 0, "title_full": "Euro zone factory growth stutters as China, Japan heals", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T13:39:00.000+03:00", "replies_count": 0, "uuid": "a938c4fc036ed164fd94c0de4899b6f04baccb22"}, "author": "", "url": "http://www.businessinsider.com/r-euro-zone-factory-growth-stutters-as-china-japan-heals-2015-7", "ord_in_thread": 0, "title": "Euro zone factory growth stutters as China, Japan heals", "locations": ["Japan", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You have successfully emailed the post. Euro zone factory growth stutters as China, Japan heals Jul. 1, 2015, 6:39 AM 0 \nThomson Reuters Worker sits near shovels at a coke plant in the town of Avdiyivka near Donetsk, eastern Ukraine \nBy Jonathan Cable and Ian Chua \n(Reuters) - Asia's largest economies showed hints of healing last month but euro zone factory growth remained tepid as Greek debt talks, and the country's possible departure from the bloc, dominated debate in Europe. \nSpeculation Athens would fail to make June 30's 1.6 billion euro repayment to the International Monetary Fund, heightening expectations Greece would crash out of the currency union, kept the bloc's manufacturing output check. \nHaving now defaulted on that debt and lost frozen international bailout money, Greek Prime Minister Alexis Tsipras wrote to creditors saying he was ready to accept their offer but only with revisions, according to a Greek government official. \nA Reuters poll on Monday said there was a 45 percent chance that Greece would leave the euro and, although it makes up only about 2 percent of the euro zone economy, fears of contagion to other weak members overshadowed recent signs that businesses are in better shape. \nMarkit's final euro zone manufacturing Purchasing Managers' Index (PMI) reached a 14-month high but only nudged up 52.5 last month, from May's 52.2. That was in line with a preliminary reading published before the Greek fears intensified. \nAny reading above 50 indicates growth. A sub index measuring factory output that feeds into the composite PMI, due on Friday and seen as a good guide to growth, came in at 53.6, just above May's 53.3. \nThat PMI outstripped lackluster readings from Germany and France, the euro zone's two biggest economies, for a second month and Markit said manufacturing provided only a modest boost to the wider economy. \n\"It is still only consistent with fairly sluggish growth in euro zone industrial output, suggesting the beneficial effects of the euro's depreciation may already be starting to fade,\" said Jessica Hinds, European economists at Capital Economics. \n\"The country breakdown revealed that industry is still faring well in Spain and Italy, but with worries about Greece intensifying this may not be sustained.\" \nBritish manufacturing growth slowed unexpectedly to its weakest rate in more than two years, dented by subdued export demand from Europe. [GB/PMIM] \nEuropean shares and peripheral euro zone bonds rose and the euro held its own earlier on Wednesday as some investors kept faith with expectations that, despite defaulting, Greece would find a way to stay inside the currency zone. \nLater on Wednesday in the United States, the ISM factory PMI is expected to accelerate, reinforcing views the Federal Reserve could start raising interest rates in September. \nASIAN TIGERS PURRING \nGrowth in China's services sector picked up in June while big Japanese companies planned to ramp up spending at the fastest pace in a decade, offering hope that prospects are improving for Asia's largest economies, despite sluggish factory growth. \nActivity in China's factory sector expanded slightly in June though not as much as expected, official surveys showed, suggesting the economy may be starting to slowly level out after a raft of support measures. \nChina's official manufacturing PMI for June came in at 50.2, unchanged from May, while the services PMI climbed to 53.8 from 53.2. \nJapanese factory business barely expanded but a private report showed a strong pick-up in export orders, while a Bank of Japan survey showed a strong bounce in business confidence and spending plans. \nThat will be a welcome sign for Prime Minister Shinzo Abe's economic revival strategy which has had limited success in nudging firms to boost wages and investment. \n\"When you have two of the biggest economies in the world showing positive readings, that is encouraging. They also come on the back of some good readings out of the U.S.,\" said Craig James, chief economist at CommSec in Sydney. \nAnalysts at ANZ, though, suspect softness in the manufacturing sector would require more policy easing. \n\"Looking ahead, as real interest rates faced by Chinese companies remain elevated, we see that further monetary easing is still highly needed,\" said Liu Li-Gang and Zhou Hao at ANZ. \nOn Saturday, China's central bank cut lending rates for the fourth time since November and trimmed the amount of cash some banks must hold as reserves. The action was the first since the height of the global financial crisis in late 2008. \nIn South Korea, exports fell and factory activity shrank. An outbreak of the deadly Middle East Respiratory Syndrome has prompted some analysts to trim economic growth forecasts and pushed the government to announce a $13 billion fiscal stimulus package. \nReports from India, Taiwan and Indonesia also pointed to challenging conditions for many economies in the region. \n(Additional reporting by Kevin Yao in BEIJING, Leika Kihara and Tetsushi Kajimoto in TOKYO, Christine Kim in SEOUL; Editing by Jon Boyle) Read the original article on Reuters . Copyright 2015. Follow Reuters on Twitter . More from Reuters:", "external_links": [], "published": "2015-07-01T13:39:00.000+03:00", "crawled": "2015-07-01T14:43:22.000+03:00", "highlightTitle": ""}