{"organizations": [], "uuid": "91a9be621b6efa3b4f2d56d5dba1ebed224b36d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://blogs-images.forbes.com/agoodman/files/2015/07/dwight-freeney-de-san-diego-chargers.jpg", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/agoodman/2015/07/27/what-really-happened-in-the-scheme-that-cost-dwight-freeney-millions/", "country": "US", "title": "What Really Happened In The Scheme That Cost Dwight Freeney Millions?", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "What Really Happened In The Scheme That Cost Dwight Freeney Millions? - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T19:01:00.000+03:00", "replies_count": 0, "uuid": "91a9be621b6efa3b4f2d56d5dba1ebed224b36d0"}, "author": "Andrew Goodman", "url": "http://www.forbes.com/sites/agoodman/2015/07/27/what-really-happened-in-the-scheme-that-cost-dwight-freeney-millions/", "ord_in_thread": 0, "title": "What Really Happened In The Scheme That Cost Dwight Freeney Millions?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wherever there are professional athletes with money, people looking to take advantage of them aren’t far behind. The case of Dwight Freeney vs. Bank of America serves as a reminder that one can never be too careful.\nA couple of years ago I wrote an article about how a Washington, D.C. investment firm started a Ponzi scheme that eventually cost dozens of professional athletes millions of dollars. Fast forward to today…not much has changed. Malicious people continue to dupe professional athletes of their hard-earned money as they are ideal targets of financial scams.\nA recent case that caught my attention involved Colts and Chargers defensive end and seven-time Pro Bowler Dwight Freeney and Bank of America Corp. (BofA) Freeney sued Bank of America’s N.A. subsidiary, and Merrill Lynch financial adviser Michael Bock in February of this year. Freeney alleges he was taken advantage of after trusting the bank’s wealth management division with his assets. He was eventually swindled out of more than $20 million.\nThe circumstances of the case warrant a closer look at how financial institutions conduct business, and how the lines between an advisor and the company they represent, in the past or present, can easily become blurred.\nDown the Rabbit Hole\nAccording to his 120-page criminal complaint, Freeney was recruited by Bank of America in 2010 to become a client of its division that services clients with high net worth. But to get the full picture, you have to go back even further. Previously, Freeney worked with Jade Group, the company involved in CFP and Success Trade — the aforementioned Ponzi scheme that swindled more than $18 million out of nearly five-dozen clients (this will come into play later in the story).\nIn a phone interview for this article, Freeney said that when Bank of America approached him during the 2010 Super Bowl, he felt confident that his money would be safe with the nation’s second largest bank. He assumed his money would be backed by insurance and multiple safeguards put in place by the bank. When signing with BofA, Freeney was convinced that he was a bank client, not a brokerage client, because of the broad range of cash management, business planning and investment services marketed to him as a “comprehensive concierge service.”\nThe problem was, the persons actually recruiting Freeney were Michael Bock, Eva Weinberg (Bock’s ex-wife), and Michael Stern (associate of Bock and Weinberg who previously created a $60 million Ponzi scheme). Stern had fled to Uruguay a year prior as details of his Ponzi scheme came to light. Yet he was somehow able to return to the U.S. undetected. Soon after, he began collaborating with Weinberg.\nPage 1 / 3 Continue Get The Forbes Investing Digest", "external_links": ["https://home.commonwealth.com/login/Login.aspx"], "published": "2015-07-27T19:01:00.000+03:00", "crawled": "2015-07-27T19:21:18.293+03:00", "highlightTitle": ""}