{"organizations": ["BKM Management", "Hilton Worldwide", "DoubleTree", "Hilton Hotels & Resorts", "Gilligan’s Beach Bar & Grill", "Aruba Growth Fund", "Hilton Aruba Caribbean Resort & Casino", "Hilton", "Conrad Hotels & Resorts", "United States Hilton Hotels & Resorts", "Hilton Aruba Caribbean Resort & Casino New Beachfront Hilton", "Aruba Welcomes Travelers", "Hilton Hotel Metropolitan", "Waldorf Astoria Hotels & Resorts", "Hilton Garden Inn"], "uuid": "6a7c0abb29265f86b2b22b0a31587895518dca65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/hilton-hotels-resorts-expands-caribbean-portfolio-with-opening-hilton-/44497", "country": "US", "title": "Hilton Hotels & Resorts Expands Caribbean Portfolio with Opening of Hilton Aruba Caribbean Resort & Casino", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Hilton Hotels & Resorts Expands Caribbean Portfolio with Opening of Hilton Aruba Caribbean Resort & Casino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T08:15:00.000+03:00", "replies_count": 0, "uuid": "6a7c0abb29265f86b2b22b0a31587895518dca65"}, "author": "", "url": "http://businesswireindia.com/news/news-details/hilton-hotels-resorts-expands-caribbean-portfolio-with-opening-hilton-/44497", "ord_in_thread": 0, "title": "Hilton Hotels & Resorts Expands Caribbean Portfolio with Opening of Hilton Aruba Caribbean Resort & Casino", "locations": ["Laguna", "Miami", "Va.", "Latin America", "Caribbean", "New York City", "Sunset Grille", "Mexico", "Palm Beach", "Aruba", "Oranjestad", "Curio", "ORANJESTAD"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Potter", "Rob Palleschi", "Rene Kan", "Mira Solo", "Milton Berlinski", "Hampton", "Morris Lapidus", "Justus Martens", "Mclean"], "text": "Thursday, July 16, 2015 10:45AM IST (5:15AM GMT) Hilton Hotels & Resorts Expands Caribbean Portfolio with Opening of Hilton Aruba Caribbean Resort & Casino New Beachfront Hilton in Palm Beach, Aruba Welcomes Travelers to One Happy Island ORANJESTAD, Aruba and Mclean, Va., United States Hilton Hotels & Resorts , the flagship brand of Hilton Worldwide (NYSE: HLT), announced today the opening of the 355-room Hilton Aruba Caribbean Resort & Casino , a 15-acre beachfront oasis in Palm Beach, Aruba. With a privileged location on picturesque white sand beaches, this upscale resort in Aruba welcomes travelers to one of the Caribbean’s most desired destinations. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150715006334/en/ Hilton Hotels & Resorts expands Caribbean portfolio with the opening of the 355-room Hilton Aruba Caribbean Resort & Casino located on the white sand beaches of Palm Beach. (Photo: Business Wire) “Aruba is the quintessential Caribbean island with its strong European influence, long stretches of white beach and eclectic culinary scene,” said Rob Palleschi, global head, full service brands, Hilton Worldwide. “As one of the most revisited destinations in the region, this opening marks an important milestone as we continue to expand our global presence and deliver on our commitment to providing diverse experiences for our guests.” Located on the largest beachfront stretch of Palm Beach and less than 10 miles from the capital city of Oranjestad, Hilton Aruba Caribbean Resort & Casino welcomes guests to a premier resort experience. Featuring glamorous architecture (the hotel was designed by Morris Lapidus, renowned architect of some of Miami's most famous hotels, as well as the The Condado Plaza Hilton and DoubleTree by Hilton Hotel Metropolitan – New York City), unmatched beaches, enchanting gardens, an expansive pool complex, kids club, watersports and dive center, world-class spa, on-site casino and culinary choices for the most discerning palate, this resort offers something for everyone. “The opening of Hilton Aruba Caribbean Resort & Casino is celebrated with pride,” said Tom Potter, senior vice president, Caribbean, Mexico and Latin America, Hilton Worldwide. “This project is a magnificent addition to our Caribbean portfolio with its remarkable connection to the island’s past and exceptional team members who bring traditional Aruban hospitality to life. We are grateful for the opportunity to be a part of this hospitable community, and extend Hilton’s warm welcome to the island’s residents and visitors.” Stay: The upscale Hilton Aruba Caribbean Resort & Casino features 355 charming guest rooms, including executive floor rooms and suites, outfitted with comfortable and luxurious bedding, flat screen TVs, wireless Internet access, coffee maker and more. Rooms offer a tropical décor, views of the gardens, pools or sea, and spacious balconies for outdoor relaxation. Executive floor guests enjoy special access to an executive lounge, private concierge service and rooms featuring custom artwork. Meet: An ideal choice for weddings, corporate events, intimate parties and galas, the property provides nearly 40,000 square feet of indoor and outdoor event space for any occasion. Indoors, the hotel offers more than 15,000 square feet of flexible function space including eight meeting rooms with total capacity for more than 900 guests, five private intimate meeting rooms for smaller gatherings, a Grand Caribbean Ballroom accommodating more than 900 guests and two business centers. Outdoors, approximately 24,000 square feet of lush tropical landscape can accommodate up to 2,000 guests. Eat: Hilton Aruba Caribbean Resort & Casino offers a memorable dining experience with award-winning options offering everything from casual fare to fresh seafood. La Playa Torchlight Dinner offers a romantic beachfront exclusive dining experience with a personal server and four-course dinner, Gilligan’s Beach Bar & Grill is open for breakfast, lunch and dinner offering comfort food favorites in a friendly casual environment, Laguna Restaurant welcomes guests to indoor and outdoor dining featuring Caribbean fare and health-inspired cuisine, Mira Solo, meaning “look at the sun” in Papiamento, is the first and only martini and wine bar in Aruba and Sunset Grille is the resort’s award-winning signature restaurant serving international specialties including steak and seafood dishes. Hilton Aruba Caribbean Resort & Casino participates in Hilton HHonors®, the award-winning guest-loyalty program for Hilton Worldwide’s twelve distinct hotel brands. Hilton HHonors Members always get our lowest price with our Best Price Guarantee, along with HHonors Points, free Wi-Fi, digital check-in and no booking fees only when they book directly through Hilton. To celebrate the opening, Hilton Aruba Caribbean Resort & Casino is offering 5,000 HHonors bonus points per stay through Oct. 31, 2015*. Hilton Aruba Caribbean Resort & Casino is owned by Aruba Growth Fund (representing the main pension funds in Aruba, and their 10,000+ members) and its partners, and managed by Hilton Worldwide. For more information and reservations, visit hilton.com or call 1-800-HILTONS. *Minimum length of stay of three nights required. Other restrictions apply. About Hilton Hotels & Resorts Founded in 1919 as the flagship brand of Hilton Worldwide, Hilton Hotels & Resorts continues to build upon its legacy of innovation by developing products and services to meet the needs of savvy global travelers at more than 550 hotels across six continents. Hilton is the stylish, forward-thinking global leader in hospitality with Team Members shaping experiences in which every guest feels cared for, valued and respected. Access the latest news at news.hilton.com and begin your journey at www.hilton.com or www.hilton.com/offers for the latest hotel specials. Hilton Hotels & Resorts is one of Hilton Worldwide’s 12 brands. About Hilton Worldwide Hilton Worldwide (NYSE: HLT) is a leading global hospitality company, spanning the lodging sector from luxury and full-service hotels and resorts to extended-stay suites and focused-service hotels. For 95 years, Hilton Worldwide has been dedicated to continuing its tradition of providing exceptional guest experiences. The company's portfolio of twelve world-class global brands is comprised of more than 4,350 managed, franchised, owned and leased hotels and timeshare properties, with more than 720,000 rooms in 94 countries and territories, including Hilton Hotels & Resorts, Waldorf Astoria Hotels & Resorts, Conrad Hotels & Resorts, Canopy by Hilton, Curio - A Collection by Hilton, DoubleTree by Hilton, Embassy Suites by Hilton, Hilton Garden Inn, Hampton by Hilton, Homewood Suites by Hilton, Home2 Suites by Hilton and Hilton Grand Vacations. The company also manages an award-winning customer loyalty program, Hilton HHonors®. Visit news.hiltonworldwide.com for more information and connect with Hilton Worldwide at facebook.com/hiltonworldwide , twitter.com/hiltonworldwide , youtube.com/hiltonworldwide , flickr.com/hiltonworldwide , and linkedin.com/company/hilton-worldwide . About Aruba Growth Fund The Aruba Growth Fund is a private equity fund established in 2012, and focuses on investments in well-established Aruban companies. The fund has a range of investors, including the largest pension funds in the country, as well as several respectable private companies and bank. Management of the fund is in the hands of BKM Management, an investment management company run by Rene Kan, Milton Berlinski and Justus Martens. Visit arubagrowthfund.com for more information.", "external_links": [], "published": "2015-07-16T08:15:00.000+03:00", "crawled": "2015-07-16T13:01:51.000+03:00", "highlightTitle": ""}