{"organizations": [], "uuid": "d56a41a94f9e9a17be499aa48361a61fb1956633", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/i/t/s/d/image.related.afrArticleLead.620x365.gijlu5.png/1437719091977.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/world/north-america/donald-trumps-fortune-boosted-by-golf-courses-talks--and-telstra-20150724-gijlu5", "country": "AU", "title": "Donald Trump's fortune boosted by golf courses, talks – and Telstra", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Donald Trump's fortune boosted by golf courses, talks – and Telstra | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T10:23:00.000+03:00", "replies_count": 0, "uuid": "d56a41a94f9e9a17be499aa48361a61fb1956633"}, "author": "Share via Email", "url": "http://www.afr.com/news/world/north-america/donald-trumps-fortune-boosted-by-golf-courses-talks--and-telstra-20150724-gijlu5", "ord_in_thread": 0, "title": "Donald Trump's fortune boosted by golf courses, talks – and Telstra", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paid speeches are lucrative for Donald Trump. AP Speak and pay When Trump talks, people listen – and pay. Trump's company ACN paid him $US450,000 in revenue from speaking engagements, while he charged three other specific retail organisations as much as $US100,00 for speeches. But the biggest gig was for electronics giant Samsung, who shelled out $US150,000 for some wise words from The Donald.\nPaperback writer Get rich quick books ain't what they used to be – making the author, not the reader, gazillions.\n For example, Trump's 2004 How to Get Rich , generated the billionaire zilch, or less than $US201, in royalties, in 2014.\nIn fact, Trump didn't have much luck at all across his 14 titles. Only three delivered the author a royalties cheque, with Think Like a Champion , The Art of the Deal and Time to Get Tough , earning their spot on the bookshelf.\nRainy day On the theme of Time to Get Tough, even billionaires need to plan for less than lucrative times.\nIn Trump's case, he has a pension plan with the Screen Actors Guild, which contributes a modest $US110,228 a year to his wealth.\nSleepy head Not only can you dress like Trump - his menswear licensing deal earned him up to $US5 million in 2014 – you can also sleep like the man.\nAnother licensing deal, this one with US mattress company Serta, also earned him up to $US5 million.\nSerta's website says: \"Trump is a name synonymous with the upscale lifestyle, superior quality and success of Donald Trump and his world-renowned empire. Now, you can enjoy Trump luxury in your own home with our all-new Trump Home iSeries mattress collection\".\nThankfully, it makes no mention of the pyjama games of billionaires.\nTee off The main driver of the business magnate's fortune is his 16-related golf businesses, which are worth $US550-675 million.\nThat's more than half of his net worth, which the filing said was at least $1.15 billion.\nTrump himself, however, says he is worth closer to $10 billion. But it's impossible to determine an exact figure just looking at the 92-page financial disclosure .\nThat's because any asset worth more than $50 million gets counted the same, and Trump is claiming 23 of those, such as his aircraft, the Mar-A-Lago Club in Palm Beach, Florida and a golf course in Scotland.\nWatch but don't learn Trump skills as an entrepreneur haven't translated into education as it might have hoped. A company called The Trump Entrepreneur Initiative, which says its underlying assets are a \"seminar program\" had revenue of just $US11,819 since the beginning of 2014.", "external_links": ["http://www.smh.com.au/cqstatic/gijjsk/trumptax.pdf"], "published": "2015-07-24T10:23:00.000+03:00", "crawled": "2015-07-24T10:05:53.381+03:00", "highlightTitle": ""}