{"organizations": [], "uuid": "ac1e3a302827b113d8c27d7bc9210c8608a486d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business/Finance", "url": "http://www.menafn.com/1094272571/New-Market-Research-Report-Bath-and-Shower-in-Italy?src=RSS", "country": "US", "title": "New Market Research Report Bath and Shower in Italy", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "New Market Research Report Bath and Shower in Italy | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "ac1e3a302827b113d8c27d7bc9210c8608a486d5"}, "author": "Press", "url": "http://www.menafn.com/1094272571/New-Market-Research-Report-Bath-and-Shower-in-Italy?src=RSS", "ord_in_thread": 0, "title": "New Market Research Report Bath and Shower in Italy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) During 2014 consumers in Italy were still led by the tough economic environment which forced them to look for products which allowed them to save money. As a consequence consumers’ focus was on everything from large convenience packs to discounted products whether branded or not. Because of this major growing channels were beauty specialist retailers and discounters where consumers can find branded products at lower prices and unbranded conveniently packaged items respectively.\nCompetitive Landscape\nDove from Unilever Italia led bath and shower with a 10% value share in 2014 followed by Neutro Roberts from Società Italo Britannica L Manetti - H Roberts (The Bolton Group) with 8% and Neutromed by Henkel Italia with 7%. Dove is one of the most successful brands in Italy in bath and shower as it combines bath properties with one quarter hydrating cream thus ensuring a more moisturising effect on the skin. The success of Neutro Roberts and Neutromed is due to the pH-neutral properties of both products.\nFull Report Details at\n - \nIndustry Prospects\nIn the forecast period bath and shower is expected to see a negative value CAGR of 1% at constant 2014 prices due to a negative CAGR of 4% in body wash/shower gel and a negative CAGR of 1% in bath additives from bath oils and pearls to bath salts and powder. The reason for the poor performance of bath additives is due to the fact that average homes today do not have a bath tub but only a shower due to space constraints. Moreover hectic lifestyles drive consumers towards more time-convenient solutions.\nReport Overview\nDiscover the latest market trends and uncover sources of future market growth for the Bath and Shower industry in Italy with research from Euromonitor's team of in-country analysts.\nFind hidden opportunities in the most current research data available understand competitive threats with our detailed market analysis and plan your corporate strategy with our expert qualitative analysis and growth projections.\nIf you're in the Bath and Shower industry in Italy our research will save you time and money while empowering you to make informed profitable decisions.\nThe Bath and Shower in Italy market research report includes:\n * Analysis of key supply-side and demand trends\n * Detailed segmentation of international and local products\n * Historic volumes and values company and brand market shares\n * Five year forecasts of market trends and market growth \n * Robust and transparent market research methodology conducted in-country\nOur market research reports answer questions such as:\n * What is the market size of Bath and Shower in Italy?\n * What are the major brands in Italy?\n * How are sales of private label products evolving?\n * What is the importance of intimate washes in the overall category context?\nReasons to Get this Report\n * Gain competitive intelligence about market leaders\n * Track key industry trends opportunities and threats\n * Inform your marketing brand strategy and market development sales and supply functions\nReport Table of Contents:\nBATH AND SHOWER IN ITALY\nEuromonitor International\nJune 2015\nLIST OF CONTENTS AND TABLES\nHeadlines\nTrends\nCompetitive Landscape\nProspects\nCategory Data\nTable 1 Sales of Bath and Shower by Category: Value 2009-2014\nTable 2 Sales of Bath and Shower by Category: % Value Growth 2009-2014\nTable 3 Sales of Bath and Shower by Premium vs Mass: % Value 2009-2014\nTable 4 NBO Company Shares of Bath and Shower: % Value 2010-2014\nTable 5 LBN Brand Shares of Bath and Shower: % Value 2011-2014\nTable 6 LBN Brand Shares of Premium Bath and Shower: % Value 2011-2014\nTable 7 Forecast Sales of Bath and Shower by Category: Value 2014-2019\nTable 8 Forecast Sales of Bath and Shower by Category: % Value Growth 2014-2019\nTable 9 Forecast Sales of Bath and Shower by Premium vs Mass: % Value 2014-2019\nBeiersdorf SpA in Beauty and Personal Care (italy)\nStrategic Direction\nKey Facts\nSummary 1 Beiersdorf SpA: Key Facts\nCompetitive Positioning\nSummary 2 Beiersdorf SpA: Competitive Position 2014\nMirato SpA in Beauty and Personal Care (italy)\nStrategic Direction\nKey Facts\nSummary 3 Mirato SpA: Key Facts\nCompetitive Positioning\nSummary 4 Mirato SpA: Competitive Position 2014\nExecutive Summary\nItaly at Risk of Deflation\nPerfumeries Shows Signs of Improvement\nLocal Organic and Natural Manufacturers Gain Share\nFashion Designers Invest in Beauty Products\nMultifunctional Products Go Mainstream\nKey Trends and Developments\nConsumers Look for An Omni-channel Strategy\nMen's Grooming Products Increase in Accordance With Product Education\nOne Level Up: the Advent of Super-premium\nMarket Data\nTable 10 Sales of Beauty and Personal Care by Category: Value 2009-2014\nTable 11 Sales of Beauty and Personal Care by Category: % Value Growth 2009-2014\nTable 12 Sales of Premium Beauty and Personal Care by Category: Value 2009-2014\nTable 13 Sales of Premium Beauty and Personal Care by Category: % Value Growth 2009-2014\nTable 14 NBO Company Shares of Beauty and Personal Care: % Value 2010-2014\nTable 15 LBN Brand Shares of Beauty and Personal Care: % Value 2011-2014\nTable 16 Penetration of Private Label in Beauty and Personal Care by Category: % Value 2009-2014\nTable 17 Distribution of Beauty and Personal Care by Format: % Value 2009-2014\nTable 18 Distribution of Beauty and Personal Care by Format and Category: % Value 2014\nTable 19 Forecast Sales of Beauty and Personal Care by Category: Value 2014-2019\nTable 20 Forecast Sales of Beauty and Personal Care by Category: % Value Growth 2014-2019\nTable 21 Forecast Sales of Premium Beauty and Personal Care by Category: Value 2014-2019\nTable 22 Forecast Sales of Premium Beauty and Personal Care by Category: % Value Growth 2014-2019\nSources\nSummary 5 Research Sources\nAbout Fast Market Research\nFast Market Research is a leading distributor of market research and business information. Representing the world's top research publishers and analysts we provide quick and easy access to the best competitive intelligence available.  Our unbiased expert staff is always available to help you find the right research to fit your requirements and your budget.\nFor more information about these or related research reports please visit our website at or call us at 1.800.844.8156 (1.413.485.7001 Int'l)\n \n\n\n ", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-06T13:00:59.000+03:00", "highlightTitle": ""}