{"organizations": [], "uuid": "b29ce1f2094553de2a24be0d54cc9596d4113f87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/20150731_110223.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/633311/1/ecg-tackles-illegal-connections.html", "country": "US", "title": "ECG Tackles Illegal Connections", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "ECG Tackles Illegal Connections", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T15:02:00.000+03:00", "replies_count": 0, "uuid": "b29ce1f2094553de2a24be0d54cc9596d4113f87"}, "author": "", "url": "http://www.modernghana.com/news/633311/1/ecg-tackles-illegal-connections.html", "ord_in_thread": 0, "title": "ECG Tackles Illegal Connections", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  31 July 2015 13:02 CET ECG Tackles Illegal Connections By Daily Guide \nThe Electricity Company of Ghana (ECG) has begun a nationwide tracking of illegal electrical connections to homes and offices that have cost the company millions of Ghana Cedis. \nThe exercise would officially begin on August 1, this year across the country. \nRecently at Dodowa, near Accra, an ECG Taskforce, in the company of police and military personnel, arrested 111 people. \nCharges were preferred against the persons, who were charged an amount of GH¢100,000. \nMichael Dwamena, acting Managing Director of ECG, who disclosed this to journalists yesterday in Accra, appealed to members of the public to provide the company with information on illegal connections in their neighbourhoods in order to help address revenue losses to ECG. \nSome unscrupulous elements in ECG are alleged to have teamed up with some electricians and contractors to carry out the nefarious activities. \nThe MD said his outfit would not hesitate to sack any of the staff who would be found culpable. \nMr Dwamena stated that ECG incurs losses when people engage in illegal connections and unauthorized re-connection of officially disconnected premises. \nHe explained that with illegal direct connection customers connect electricity supply to their premises without meters, adding that some customers/applicants move legally installed meters from original locations to other places without the approval of ECG. \nMeter tampering 'In meter by-pass a customer connects portions or all of his or her load (gadgets) without passing through the meter although a meter has been installed for the customer.' \nHe also warned those who engage in i llegal network extension to their sites without approval from ECG. \n'Here the premises might have been connected to the new construction or not yet connected. In some cases, the illegal construction is unearthed several months after a legal meter has been installed on the illegally constructed network,' he noted. \nApplicants/customers who acquire power supply legally but decide to extend the supply to their neighbours and others without a written authorization would be severely dealt with, same as those who engage in self-reconnection after disconnection. \nNo mercy for defaulters ECG does not disconnect customers for nothing; they may be disconnected for violation of any of the above, debts, safety reasons, default on an agreed payment.' \nOfficials of the company could not provide any factual response when asked about looses incurred by the company over the last couple of years as a result of illegal connections. \nCurrently, ECG puts its revenue leakage at 23.5 percent and plans to reduce it to 21 percent by end of year.", "external_links": [], "published": "2015-07-31T15:02:00.000+03:00", "crawled": "2015-07-31T14:15:38.429+03:00", "highlightTitle": ""}