{"organizations": [], "uuid": "c9a7859176f07edbce624396255b8777f2cf2d3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wisebread.com", "main_image": "http://www.wisebread.com/files/fruganomics/blog-images/money_in_pocket_000061029288.jpg", "site_section": "http://www.wisebread.com/taxonomy/term/6/all/feed", "section_title": "Wise Bread (Personal Finance posts)", "url": "http://www.wisebread.com/3-pearls-of-financial-wisdom-from-dave-ramsey", "country": "US", "title": "3 Pearls of Financial Wisdom From Dave Ramsey", "performance_score": 0, "site": "wisebread.com", "participants_count": 1, "title_full": "3 Pearls of Financial Wisdom From Dave Ramsey", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T16:00:00.000+03:00", "replies_count": 0, "uuid": "c9a7859176f07edbce624396255b8777f2cf2d3b"}, "author": "Mikey Rox", "url": "http://www.wisebread.com/3-pearls-of-financial-wisdom-from-dave-ramsey", "ord_in_thread": 0, "title": "3 Pearls of Financial Wisdom From Dave Ramsey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » Personal Finance » 3 Pearls of Financial Wisdom From Dave Ramsey 3 Pearls of Financial Wisdom From Dave Ramsey 0% Balance Transfer Credit Cards \nBetween his best-selling books , radio show, and motivational speeches, Dave Ramsey has been giving solid personal finance advice for more than two decades. He takes a no-nonsense approach to managing money — just the way I like it — while offering advice that's practical, actionable, and guaranteed to put you on the path toward financial freedom. Ramsey's pearls of financial wisdom can help you get ahead and gain control of your finances. Here are three of my favorites. 1. Don't Worship Stuff \nMany people grow up thinking they need stuff to be happy. We often confuse our wants with our needs, and convince ourselves we \"need\" a big house, a fancy car, and everything else in between.The more we have, the more successful we feel. The problem, however, is that stuff costs money — money we might not have. \nIn his book, The Total Money Makeover: A Proven Plan for Financial Fitness , Ramsey nails it when he says, \"We buy things we don't need with money we don't have to impress people we don't like.\" Ain't that the truth. \nSome of us become so obsessed with keeping up that we sacrifice our future financial health and willingly go into debt just so others will think we're successful and can afford a certain lifestyle. However, the joke's on us because this type of thinking gets us nowhere financially — and fast. \nThe best thing you can do for your money is stop worrying about the opinions of others and realize stuff doesn't make you happy or richer. Ramsey encourages \"living substantially below your means.\" Just because you make $75,000 a year doesn't mean you have to spend $75,000 a year. Simplicity is key to acquiring financial freedom. 2. Build a $1,000 Emergency Fund — Now \nAccording to Ramsey, this is the first step to financial stability. This doesn't suggest you can't have more in your emergency fund. Like many other financial experts, Ramsey speaks about the importance of having a sizable cash cushion — at least three to six months of income. But since this takes time, Ramsey's Financial Peace University program recommends baby steps and starting with a $1,000 emergency fund. \nThis ensures enough cash to handle life's curveballs, so you don't have to rely on credit cards. This might come as a shock, but building a small emergency fund takes priority over paying off debt (although you'll still need to make minimum debt payments while growing a small emergency fund). \nDo whatever you can to build this emergency fund. For example, sell stuff you don't need at a yard sale, work overtime, or get a side hustle. The idea is to fund this account as soon as possible. You'll enjoy peace of mind knowing you can handle an emergency, and it's only after building an emergency fund that you can start improving other areas of your personal finance. 3. Don't Be a Slave to a Lender \nWe live in a world where anything can be financed — from electronics to houses. And some people fall in the trap of thinking they can afford something as long as they're able to make the minimum payments. \nRamsey's financial philosophy revolves around living debt-free. He's a big believer in not carrying any type of debt, including an auto loan and a mortgage. In fact, he says he would rather ride a bike than take out a car loan. \nIn his book, Financial Peace Revisited , Ramsey says, \"We want it all, and we can borrow to get it all, before we can afford it all.\" For some, getting a loan or credit card has never been easier. But the more debt you have, the more you have to work, and the less money and time you'll have to enjoy your life. \nOnce you have a small emergency fund, Ramsey says it's time to tackle your non-mortgage debt. Not just your credit card debt — all of your debt. He feels that debt-free living isn't just about paying off revolving debt, but also paying off student loans and car loans. \nHe recommends the debt snowball method, in which you pay off your smallest balance first. You'll make large payments toward this debt every month, while making the minimum payments on all your other debts. After you get rid of the smallest balance, take the money you were using to pay off this balance and apply it to the next smallest balance, and so on. You'll eventually pay off your debts, at which point you can start increasing your $1,000 emergency fund, aiming for three to six month's worth of income. \nAfter paying off debt and building a \"real\" emergency fund, Ramsey puts the focus on your mortgage and encourages paying off this debt as fast as you can. Becoming mortgage-free might feel like a stretch, but since you don't have other debts hanging over your head, you're able to increase your mortgage payments without breaking a sweat and pay off this debt years sooner. \nThat's the American dream if I've ever heard of it. \nAre you a student of Dave Ramsey's school of financial thought? What are some of your takeaways? How have Ramsey's philosophies helped improve your own situation? Let us know in the comments below. Wise Bread Picks", "external_links": [], "published": "2015-07-16T16:00:00.000+03:00", "crawled": "2015-07-17T08:39:47.000+03:00", "highlightTitle": ""}