{"organizations": [], "uuid": "e95831b031abeccbfbc60083eb4bedb8f9d84174", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507050105.html", "country": "US", "title": "Tunisia: \"Unprecedented Opportunity for Tunisia to Unlock Economic and Institutional Reforms\" WB", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Tunisia: \"Unprecedented Opportunity for Tunisia to Unlock Economic and Institutional Reforms\" WB", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T04:23:00.000+03:00", "replies_count": 0, "uuid": "e95831b031abeccbfbc60083eb4bedb8f9d84174"}, "author": "", "url": "http://allafrica.com/stories/201507050105.html", "ord_in_thread": 0, "title": "Tunisia: \"Unprecedented Opportunity for Tunisia to Unlock Economic and Institutional Reforms\" WB", "locations": ["Tunisia Beach Massacre", "Tunisia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tunisia: Tributes Pour in for Victims of Tunisia Beach Massacre \nFor the WB, substantial and timely action is now required to trigger the structural transformation of Tunisia's economy, which would ensure sustained, sustainable and inclusive growth. \nGrowing evidence suggests that improving access to economic opportunities and social services and tackling disparities are not only about \"fairness\" and building a \"just society\", but also about realising a society's aspirations Of economic prosperity. \nProgress toward increased and shared prosperity will depend, on whether or not specific group can participate in, and benefit from, economic growth. \nThe Diagnostic recommends the need to strengthen the link between growth and social growth and social progress, notably through the channel of more and higher quality employment opportunities, remain imperative and will determine the extend to which Tunisia could embark on a more robust, sustainable and inclusive growth path. \nThis will further require institutional changes, notably in the public sector, to best serve the economic transformation and social inclusion agenda. \nRestoring macro and fiscal sustainability is an essential precondition for fostering economic growth \nAccording to the WB, while Tunisia has remained vulnerable to shocks, lower growth and greater external unbalances threaten macro economic and fiscal sustainability. \n\"For the three year since the Revolution, Tunisia has been running down its policy buffers. The macroeconomic space for expansionary policies has now vanished. While public and external debt remained at an acceptable level compared to international standards, they are expected to reach unsustainable level if reforms are not implemented.\" \nThe WB specialists remind in this connection, that expansionary fiscal policy since the Revolution resulted in growing fiscal deficit and public debt. The fiscal deficit increased from 1% of GDP to 6.2 % between 2010 and 2013 and the public debt from 40.7 of GDP to 44.8% during the same period. \n\"While this increase was an acceptable range, public debts is expected to reach 56% of the GDP by 2017 before slowly declining over the medium term, according to the baseline scenario of the most recent debt sustainability analysis. \nThis baseline scenario assumes the fiscal consolidation and growth pick up in 2015, however if fiscal consolidation are not implemented, it would result in growing public that could reach around 63% of GDP by 2019, while a permanent negative growth shock would increase public debt that could reach around 67% of GDP by 2019. \nHowever, assuming the intensification over the medium term, the deficit is expected to gradually decline from 6.5% of GDP in 2014 to 3.2% in 2019. \nThis Systematic Country Diagnostic identifies some key areas where opportunities that build on Tunisia's multiple strengths arise, which could help guide the future development policy of the country. \nStimulated growth by the private sector \nIn this context, this Diagnostic identifies the promotion of private-sector-driven growth (and job creation) and the improvement of equality of opportunities as the two key drivers of change where it is advisable to decisive policy initiatives. \nThe WB recommends the establishment of a sound macro economic framework and a stable socio-political context which are necessary conditions toward the development of a truly inclusive economic model. \nAmong the policy actions needed to maintain debt sustainability and assure macro and financial sector stability, the World Bank cites \"consolidating fiscal support to public enterprises, while reinforcing their governance and containing the increase in the public sector wage bill.\" \nThese also include \"rationalising consumption subsidies and social assistance programmes so that the composition of expenditure can be rebalanced toward productive and growth-enhancing investment as well as key social services, notably in disadvantaged regions. \nIncrease the performance of the economy by improving the business environment \nOn the reform of the business environment, the World Bank recommends \"removing the barriers to entry and competition that would substantially improve the performance of the Tunisian economy and boost the ability of the most productive firms to grow and create good quality jobs. \nThe removal of barriers to market competition should s tart with backbone services sectors, which were the most shielded from competition in the past and sector with high potential for jobs creation, notably commerce and telecommunications to significantly increase investment in these sectors. \nThe World Bank urges the initiation of a public-private dialogue to accompany deeper regulatory reforms. \nHowever, many of the regulations and practices that create market power rents still exist and many companies continue to benefit from them. \n\"A drastic simplification of the pool of regulations hindering the private sector activity with a view to reducing the room for discretion in their implementation is critical for a private sector-driven growth and ultimately inclusion. \nNational financial sector strategy to increase economic opportunities \nIt is important for WB experts to develop a national financial sector strategy to increase economic opportunities, since improving access to financial services for both households and firms is critical. \n\"The goal is to catalyse private sector development, improve access to essential services and increase economic opportunities for the most vulnerable. \nThere is also need to \"strengthen access to credit for firms, particularly those with no credit history or limited collateral (mostly MSMEs and startups) by developing alternative sources of finances.\" \nAt the household level, increasing financial inclusion (access to and use of formal financial services such as accounts, consumer and housing finance and insurance) is critical to support access to basic services (housing, education, etc.), spur income generation and employment as well as help manage economic shocks. \n\"Improving the governance, institutional and regulatory framework to allow both more accountable and efficient services would incentivise investment and allow more viable service provision, hence reducing enduring inequality in access and quality across regions. \nThe SCD concludes: \"the fiscal consolidation will require continued action on wage bill discipline in the public sector, further phase-out of subsidies, SOE restructuring and public sector pensions system. Tunisia \nHigher Islamic Council (HIC) President Abdallah Loussaief was revoked, Saturday, for \"administrative overruns,\" the … see more » Copyright © 2015 Tunis Afrique Presse. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-05T04:23:00.000+03:00", "crawled": "2015-07-05T05:05:08.000+03:00", "highlightTitle": ""}