{"organizations": [], "uuid": "cfb4e6abda9af426d71f023167930782974a491f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/hillaryclinton_070715getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/249050-clinton-dodges-on-glass-steagall", "country": "US", "title": "Clinton dodges on Glass-Steagall", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Clinton dodges on Glass-Steagall", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:02:00.000+03:00", "replies_count": 0, "uuid": "cfb4e6abda9af426d71f023167930782974a491f"}, "author": "esmilowitz@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/249050-clinton-dodges-on-glass-steagall", "ord_in_thread": 0, "title": "Clinton dodges on Glass-Steagall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Kevin Cirilli - 07/23/15 08:02 PM EDT Democratic presidential frontrunner Hillary Clinton on Thursday declined to endorse legislation championed by Sen. Elizabeth Warren (D-Mass.) that would break up big banks. Warren and other liberals — including Clinton's 2016 primary opponents Sen. Bernie Sanders (I-Vt.) and former Maryland Gov. Martin O'Malley — are pushing to reinstate legislation that President Bill Clinton repealed in 1999 called Glass-Steagall. ADVERTISEMENT Earlier this month, Warren reintroduced a bill that would require banks to divide their commercial and investment banking. \"I think this is a much more complicated issue than to just point at any one piece of legislation and say, if we just pass that, everything would be fine,\" Clinton said when asked about it while campaigning South Carolina. \"It's a more complicated assessment that just any one piece of legislation might suggest.\" \"I am not interested in just saying there’s one answer to the too-big-to-fail problem,\" Clinton said. \"We have a too-big-to-fail problem still and we have to figure out the best way to address it, and I will be talking more about that. But I am not going to be pointing at any one change and saying, you know, ‘that’ll solve all our problems.’ Because I just don’t think that is an accurate assessment.\" Earlier Thursday, O'Malley challenged all of the Democratic candidates to endorse reinstating Glass-Steagall. “Any Democrat running for president who expects to succeed in the general election I believe will need to make basic commitments … to pass a modern version of Glass-Steagall,\" O'Malley said. Clinton said in South Carolina she thinks the first goal should be \"to implement fully and effectively\" the 2010 Dodd-Frank Wall Street Reform law. \"That’s where I part company with candidates on the other side of the aisle, all of whom want to either repeal it or, you know, stop enforcement of it, or diminish its impact,\" Clinton said. \"Let’s fully implement Dodd-Frank, let’s fully take stock of where the banks are today, because remember, the banks are not the only problem.\" She said that \"if you go back and look at what happened in the great recession, it was mortgage companies, it was insurance companies, it was noncommercial banking entities who were as big, if not bigger, contributors to the collapse.\" Clinton said she has consulted with both former Sen. Chris Dodd (D-Conn.) and former Rep. Barney Frank (D-Mass.), the co-authors of Dodd-Frank. In an interview with The Hill earlier this week, Frank said he did not support re-instating Glass-Steagall. \"I do think further steps are wise, as Hillary Clinton has talked about, for de-complicating some of these large financial institutions,\" Frank said. \"But going to [Glass-Steagall] and doing that in a uniform way that applies to every financial institution is not the best way to do it.\"", "external_links": [], "published": "2015-07-24T03:02:00.000+03:00", "crawled": "2015-07-24T09:05:32.806+03:00", "highlightTitle": ""}