{"organizations": [], "uuid": "84df23f61e06ae6916d849f48fe831d9ed89d2fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/2/e/c/p/q/image.related.afrArticleLead.620x365.gihctc.png/1437475052164.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/economy/gen-y-households-ride-the-living-standards-wave-20150721-gihctc", "country": "AU", "title": "Gen Y households ride the living standards wave", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Gen Y households ride the living standards wave | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T22:00:00.000+03:00", "replies_count": 0, "uuid": "84df23f61e06ae6916d849f48fe831d9ed89d2fc"}, "author": "Jacob Greber", "url": "http://www.afr.com/news/economy/gen-y-households-ride-the-living-standards-wave-20150721-gihctc", "ord_in_thread": 0, "title": "Gen Y households ride the living standards wave", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Young households continue to get most of gains in living standards according to modelling - but the findings fly in the face of a report by the Grattan Institute. Leigh Henningham Share on twitter by Jacob Greber Gen Ys continue to enjoy the fastest-growing standards of living compared to older generations, according to new modelling that confirms overall income growth slowed in the March quarter.\nIn findings that undermine oft-heard complaints from younger generations that they are not winning a fair share of the economic pie, the research shows households under 35 saw living standards surge 58.4 per cent between 1988 and 2011.\nBy contrast, those aged 35 to 49 enjoyed an increase of 52 per cent, the smallest gain, with those aged 50 to 65 enjoying real growth of 54.9 per cent.\nCanberra University's Ben Phillips, who heads the SAS-NATSEM quarterly household budget report, said the boost to younger generations was largely driven by the fact that cost of living pressures are lower, while younger families have also undergone a significant shift towards dual-income households.\n\"There are structural factors that are driving this,\" Mr Phillips told The Australian Financial Review . \"Young families today tend to be more likely to be dual-income households, women are putting off having kids for longer and when they do have kids they're still going to work.\"\nBig societal shifts Compared to several decades ago, today's women also tend to be more educated, opening access to higher paying jobs.\n\"These are big societal shifts over the last 30 to 40 years,\" he said.\n Tempering the evidence that younger households enjoy higher standards of living than older generations is the fact that the research doesn't take into account the different levels of assets and welfare flows to the different age groups.\nResearch paper questions modelling The Grattan Institute last year published a major research paper that suggested younger Australians were likely to be the first generation to have lower standards of living than their parents without curbs to overly generous pension and healthcare services.\nThe Grattan paper found that while most age groups were wealthier than they were in 2003, the average 55 to 64-year-old household was $173,000 better off in real terms by 2011-2012 compared to a household of the same age eight years later.\nPart of that was due to rising house prices, but also because of increased spending on health and aged care, which tends to flow to older cohorts.\nMr Phillips indicated that living standards are often an \"assets versus income story.\n\"In terms of assets, boomers are more likely to own a house than younger generations.\n\"What we're looking at here are incomes and cost of living changes.\"\nMortgage rates for the lucky few One example is the fact that younger households are enjoying some of the lowest mortgage rates ever experienced in Australia , the NATSEM research suggests.\n\"While it may be difficult to get into a house, those that do may be benefiting from record low interest rates,\" Mr Phillips said.\nOverall, the SAS-NATSEM modelling shows living standards rose just 0.2 per cent in the three months through March 31 and 1.2 per cent from a year earlier.\nThe increase was driven by the fact that while household incomes were weak – up just 1.9 per cent for the year – cost of living growth was just 0.7 per cent for the same period.\nThat translates into a gain for the average Australian household of $897, with the biggest increase recorded in the Northern Territory at $3535.\nThe average ACT household was $697 a year worse off, the nation's worst performance.\n\"[Overall] incomes are still rising but not by as much as they used to, but the cost of living isn't going anywhere.\n\"There's a lot of talking down of the economy… but this is not too bad a result after 20 years of incredible growth. To still be heading in the right direction is a good outcome.\"", "external_links": ["https://twitter.com/jacobgreber"], "published": "2015-07-21T22:00:00.000+03:00", "crawled": "2015-07-21T18:04:14.818+03:00", "highlightTitle": ""}