{"organizations": [], "uuid": "dcbcb8b2ec25df61fd71da96e51388c93d8c2b87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/why-greece-going-start-printing-160054027.html", "country": "US", "title": "Why Greece is going to have to start printing its own money", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why Greece is going to have to start printing its own money", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T19:00:00.000+03:00", "replies_count": 0, "uuid": "dcbcb8b2ec25df61fd71da96e51388c93d8c2b87"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-greece-going-start-printing-160054027.html", "ord_in_thread": 0, "title": "Why Greece is going to have to start printing its own money", "locations": ["Greece"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Jul 6, 2015, 17:19 BST - UK Markets closed Why Greece is going to have to start printing its own money By Raoul Ruparel | Telegraph – 19 minutes ago Print \nThe gaps between Greece and creditors look too large to bridge \nFollowing the No vote in yesterday’s Greek referendum , the battle lines are being drawn around Europe. The Greek crisis is forcing the eurozone to face up to the existential question which it has dodged since the crisis hit whether to integrate further or whether to adjust its membership. However, not unexpectedly, a number of countries have different reactions to this question and the splits are already emerging. \nOne thing all sides agree on is the need for more talks they do love a good emergency summit in Europe. Of course, it would be nearly impossible to reject new talks out of hand, as it would seem as if eurozone leaders were rejecting the democratic vote in Greece, which would play into Greek Prime Minister Alexis Tsipras’ game of blaming the creditors for all of Greece’s woes. \nThe substance of the talks is an entirely different matter though. A German government spokesman drove this home saying the “preconditions have not been met” for a new bail-out deal for Greece and debt restructuring is not on the table. France’s Finance Minister Michel Sapin went a bit easier saying there is “nothing automatic” with regards to Grexit, adding that there is “a basis for” negotiation. The Baltics and the Dutch unsurprisingly rallied around the German hard line, while Italian Prime Minister has tempered his initially tough tone somewhat. * Follow our coverage live The fault lines and divisions across Europe have once again been exposed by the crisis. The difference this time is that papering them over will prove much harder. There is little wiggle room in these current talks. Tsipras has made it clear he believes Greece needs some kind of debt relief and is unlikely to budge after being emboldened by the strong No. Given that 76 per cent of Greek debt is held by taxpayer-backed institutions this would inevitably involve some kind of transfer, which will have to be explained to taxpayers across the eurozone. It is clear there is no consensus around such a prospect and pushing it through would be democratically and legally impossible. \nBeyond the longer term implications for the eurozone, which are at the forefront of German minds, there are also domestic implications which weigh heavily on other European states. Spain does not want to feed the rise of Podemos. Other governments which have implemented tough austerity simply do not want to look as if they took such a hard path for no reason. \nThe customary response to such divisions is for Europe to seek a fudge. But there is not an obvious one on the table this time. With Greek banks now shut and capital controls in place it will be impossible for them to reopen without further ECB support. This is hard to imagine without a new deal, which is itself a huge ask. So where does this leave us? Well, with an eventual Grexit. The negotiations may rumble on for a bit but the gaps between Greece and creditors as well as within the creditors look too large to bridge. Ultimately, if Greece ever wants to reopen its banks it will have to start printing its own currency, marking an important step towards full Grexit.", "external_links": [], "published": "2015-07-06T19:00:00.000+03:00", "crawled": "2015-07-06T19:21:46.000+03:00", "highlightTitle": ""}