{"organizations": ["The Times Subscribe now Virgin Money", "Nigel Roddis/Reuters Katherine Griffiths Banking"], "uuid": "acc133f41917a7374d588bab8121bd4cedb305bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thetimes.co.uk", "main_image": "http://www.thetimes.co.uk/tto/multimedia/archive/00948/70c983da-354b-11e5-_948529h.jpg", "site_section": "http://www.thetimes.co.uk/tto/business/industries/banking/rss", "section_title": "Banking and Finance | The Times", "url": "http://www.thetimes.co.uk/tto/business/industries/banking/article4510755.ece", "country": "GB", "title": "Virgin Money surprises by announcing first dividend", "performance_score": 0, "site": "thetimes.co.uk", "participants_count": 0, "title_full": "Virgin Money surprises by announcing first dividend", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T14:04:00.000+03:00", "replies_count": 0, "uuid": "acc133f41917a7374d588bab8121bd4cedb305bb"}, "author": "", "url": "http://www.thetimes.co.uk/tto/business/industries/banking/article4510755.ece", "ord_in_thread": 0, "title": "Virgin Money surprises by announcing first dividend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jayne-Anne Gadhia"], "text": "Welcome to your preview of The Times Subscribe now Virgin Money surprises by announcing first dividend Virgin Money, run by Jayne-Anne Gadhia, reported strong growth in the mortgage market Nigel Roddis/Reuters Katherine Griffiths Banking Editor Published at 12:01AM, July 29 2015 \nVirgin Money surprised investors with a maiden dividend and revealed strong growth in the mortgage market. The challenger bank predicted that profit margins might rise in the intensely competitive mortgage market in the second half of the year. It added that it was well placed to develop its credit card business so that it was not so reliant on 0 per cent balance transfers for growth. \nVirgin Money, which floated last November, reported a 37 per cent jump in first-half profit to £82 million, sending its shares up by nearly 11 per cent to close at 415p. \nThe bank has \nTo see the full article you need to subscribe Subscribe \nPeople expect you to know things and, when it comes to gender equality, people expect me to be some sort of role... Published at July 28 2015 \nVirgin Money, the challenger bank which floated in November for £1.25 billion, may be poised to swoop on fresh... Last updated at March 6 2015 \nThe bank has secured investors at 283p a share and the issue price, valuing the bank at £1.25 billion, will be... Published at November 13 2014 Sponsored Editorial \nAfrica Travel has more than 30 years of experience providing every trip imaginable to spectacular destinations More from Banking and Finance Shawbrook’s profits leap in tough environment Published at 12:01AM, July 29 2015 \nPolitical uncertainty in the run-up to the general election made certain parts of the property market bumpier, the challenger bank said Santander executive quits after IPO stalls Last updated at 12:01AM, July 29 2015 \nStephen Jones, a leading executive at the British division of Santander, has quit the bank, citing its repeatedly delayed stock market listing RBS to shed £1.4bn of shares in Citizens Last updated at 12:01AM, July 29 2015 \nRoyal Bank of Scotland is planning to sell another £1.4 billion of shares in the American lender as it shrinks its business and builds up its capital Bank admits blunder over tax bill for directors   Bank of England was left red-faced after admitting it failed to pay the correct tax on some former senior directors’ travel and hotel costs Find", "external_links": [], "published": "2015-07-28T14:04:00.000+03:00", "crawled": "2015-07-29T08:03:09.562+03:00", "highlightTitle": ""}