{"organizations": [], "uuid": "1f24ea61c8741a362676365817d7efcd1be4dbd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://blogs-images.forbes.com/emmajohnson/files/2015/07/Kari-Warberg-Block-forbes.jpg", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/emmajohnson/2015/07/27/how-this-mom-built-a-10m-pest-control-business-from-home/", "country": "US", "title": "How This Mom Built a $10M Pest-Control Business From Home", "performance_score": 2, "site": "forbes.com", "participants_count": 1, "title_full": "How This Mom Built a $10M Pest-Control Business From Home - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T18:59:00.000+03:00", "replies_count": 0, "uuid": "1f24ea61c8741a362676365817d7efcd1be4dbd1"}, "author": "Emma Johnson", "url": "http://www.forbes.com/sites/emmajohnson/2015/07/27/how-this-mom-built-a-10m-pest-control-business-from-home/", "ord_in_thread": 0, "title": "How This Mom Built a $10M Pest-Control Business From Home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It all started at the perfume counter.\nKari Warberg Block was living in Western North Dakota, living with her farmer boyfriend, and selling fragrances at the local department cosmetics counter. “Every evening I would come home with a headache from being around the perfume,” says Block, who never wore the stuff she sold.\nHowever, she happened to have a big bottle of flowery fragrance in her purse when, one day, her boyfriend asked her to help start a truck that had stalled. The vehicle, it turns out, was infested with mice, which promptly ran from the engine, into the cab and into the crotch of shorts-wearing Block. “I grabbed the bottle of perfume out of my purse and sprayed them, sending them running to the floorboards,” says Block. “I figured if it gave me headaches, it would give them headaches, too.”\nBlock and the farmer eventually married. One of her jobs on the farm was to maintain the equipment, which suffered a major rodent infestation. The standard cure — poison — was hardly optimal, as it was dangerous to the farm pets and the couple’s two children. “Plus, with poison, you have to clean up the dead bodies,” she says. The obvious alternative was to deter the pests, “a female approach to an old problem,” she says.\nHer mission became creating an effective, organic, no-kill pest control product. There was no such thing on the market at the time, she says.\nRemembering the effectiveness of the perfume spritz, Block started experimenting, spraying fragrances on pine cones and tossing them into the cabs of farm vehicles. It worked. She gave them to neighboring farmers. They loved it. She started working with the local state university to develop a no-kill, organic pest control sachet product for market, winning in 1993 a $5,000 farm diversification grant from the state of North Dakota (the family was living on $12,000 per year in income from the farm), and creating a patented product.\nIt was then she realized her work was now in the territory of the Environmental Protection Agency, which requires extensive studies proving efficacy before it can be sold commercially. Block was told this process would cost no less than $2 million.\n“I went home and cried. I gave up,” she remembers. “Then it hit me — I can’t give up. Somebody has to do this. It might as well be me.”\nPage 1 / 3 Continue", "external_links": [], "published": "2015-07-27T18:59:00.000+03:00", "crawled": "2015-07-27T19:24:14.642+03:00", "highlightTitle": ""}