{"organizations": [], "uuid": "8d0599e0ba996b17c8df53e6051547a03ce6209a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-oil-gas/?format=rss", "section_title": "Oil News | Gas News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/unloved-hsbc-boosted-broker-upgrade-182059171.html", "country": "US", "title": "'Unloved' HSBC boosted by broker upgrade", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "'Unloved' HSBC boosted by broker upgrade", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T21:20:00.000+03:00", "replies_count": 0, "uuid": "8d0599e0ba996b17c8df53e6051547a03ce6209a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/unloved-hsbc-boosted-broker-upgrade-182059171.html", "ord_in_thread": 0, "title": "'Unloved' HSBC boosted by broker upgrade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Jul 20, 2015, 21:07 BST - UK Markets closed 'Unloved' HSBC boosted by broker upgrade By Tara Cunningham | Telegraph – 1 hour 46 minutes ago 24.94 -0.30 \nA bullish note from Citigroup (NYSE: C - news ) sent shares in HSBC higher, despite its exposure to China. \nShares (Frankfurt: DI6.F - news ) in HSBC climbed higher after analysts upgraded the stock, citing a boost to capital from upcoming divestments. \nIn a bullish note entitled “Unloved, de-rated and upside catalysts ahead”, Citigroup raised the stock from “neutral” to “buy” and revised the target price to 635p from 625p. The bank’s experts noted that HSBC and Standard Chartered stand out as trading on the lower end of their valuation range, reflecting profit pressures and valuation de-rating from lower interest rates, regulation and slower emerging markets growth. \nHSBC has also announced the sale of its units in Brazil and Turkey, which analysts say could increase capital faster than expected. \nDespite China’s stock market crisis, Citigroup maintains that “the Asian business is a jewel for HSBC”, generating two-thirds of its underlying pre-tax profits in Asia, with Europe and America dragging the group’s performance down. \nWith several large lenders, such as Barclays (LSE: BARC.L - news ) and Deutsche Bank (Xetra: 514000 - news ) , losing their chief executives this year, Ronit Ghose, of Citigroup, reckons the clamour for change at HSBC will increase further. As a result, a possible change at management level serves as an additional reason for a rating upgrade. Failure to improve the stock price will increase pressure on Stuart Gulliver, chief executive, and Douglas Flint, chairman. Mr Ghose believes “a new chairman could serve as a catalyst for acceleration of restructuring”. \nThe announced reshuffle in management at Standard Chartered (Other OTC: SCBFF - news ) on Sunday helped it advance 0.9pc to £10.27. HSBC closed 6.5 points, or 1.1pc, higher at 586.7p. \nIn the wider market, European bourses were rose marginally as Greek banks reopened and the country began paying its creditors. The German DAX and the CAC in Paris added 0.5pc and 0.4pc, respectively. \nJameel Ahmad, of ForexTime, said “improved sentiment around Europe, now the potential risks of a Grexit have been avoided, helped European stocks extend their rally for a ninth consecutive day”. \nBritain’s benchmark index also inched higher, boosted by bullish broker notes. However, lower commodity prices weighed on mining stocks. The FTSE 100 advanced 13.61 points to 6,788.69. * Greece news live: Government clears its debts as banks reopen for first time three weeks Gold miners were hit after the spot price of gold tumbled to its lowest level in more than five years . Sellers in China sold off the metal on Monday morning, amid expectations of a Federal Reserve interest rate hike. \n“Gold appears to be in the process of having one last sell-off and capitulation,” Mark O’Byrne of GoldCore said. \nHowever, as the possibility of an interest rate rise in the US has been well flagged, Mr O’Byrne said he’d be surprised if it was not already priced into the market. \nNonetheless, Fresnillo (Other OTC: FNLPF - news ) was off 29p, or 4.4pc, to 629p, and Randgold Resources slipped 187p to £38.17. Mid-cap gold mining stocks nosedived, with Centamin (Toronto: CEE.TO - news ) falling 9.1pc to 53.6p, Lonmin (LSE: LMI.L - news ) 4.2pc off at 77.7p and Acacia Mining (Other OTC: ABGLF - news ) edging 13.7pc lower to 239p. * Commodities crash could turn Australia into a new Greece Sports Direct raced to the top of the FTSE 100 as Exane BNP Paribas declared the retailer was “in good shape”. The bank upgraded the stock to “outperform”, lifting the target price from 800p to 860p and describing the business as dominant and well-positioned. \nAnalyst Graham Renwick said “management are actively seeking out deals and are confident an acquisition can be made over the next 12 months”. The online business has also accelerated from the successful introduction of Click & Collect. The stock was changing hands at 772.5p - up 25.5 points, or 3.4pc. * Sports Direct aims to lower bonus target Among the risers, software engineering company Aveva soared 484p, or 27.3pc, to £22.56 after it announced a potential deal to buy Schneider Electric (Swiss: SNE.SW - news ) assets , in what will be classified as a reserve takeover. Julian Yates, of Investec (LSE: INVP.L - news ) , said “while the combined business is likely to be 'lowish’ growth, its diverse base and opportunity for cost savings address the forecast pressure for Aveva”. \nTullow Oil (LSE: TLW.L - news ) hit its lowest level since September 2005, down 5.1pc to 267.1p, after saying it would review its production forecast for this year. The review comes as technical issues at its Jubilee field in Ghana caused the suspension of gas exports and constrained oil output. The company indicated that gas supply is not expected to resume until mid-August. \nGerry Hennigan, of Goodbody, said that “any disruption to supply from Jubilee is a concern in the context that production from Ghana is forecast to be a rising contributor to overall group production”. \nMeanwhile, online takeaway ordering service Just Eat (Other OTC: JSTLF - news ) was back on the menu at Bank of America Merrill Lynch. In a bullish note, the bank said the company’s half-year results could help drive the stock back towards highs of 500p. The share price rose 12p to 449.9p. \nGVC Holdings (LSE: GVC.L - news ) slipped in afternoon trading, falling 5.3pc to 409.5p, amid speculation it is considering another bid for Bwin.Party without the backing of Canadian gambling giant Amaya (NasdaqGS: AYA - news ) . On Friday, 888 Holdings announced it had clinched a deal to buy Bwin.Party for £898.3m. Bwin.Party rose 1.6pc to 105.7p. \nWincanton (LSE: WIN.L - news ) edged 4.2pc higher to 192p following a new contract win with BAE Systems (LSE: BA.L - news ) to support its Military Air & Information operations. \nFinally, Aim-listed XLMedia (LSE: XLM.L - news ) jumped 5pc to 63p as a trading update revealed the company expects to generate revenues of at least $36.4m in the first six months of the year. Management also anticipate a solid performance in the second half, driven by acquisitions and ongoing organic growth. \nJason Holden, of Liberum, noted “after several company profits warnings in the marketing and advertising technology sector, investors have decided to take a backseat”. \nHowever, Mr Holden reckons XLMedia’s track record of earnings delivery and M&A activity will shift investor sentiment.", "external_links": [], "published": "2015-07-20T21:20:00.000+03:00", "crawled": "2015-07-20T23:08:43.630+03:00", "highlightTitle": ""}