{"organizations": [], "uuid": "6d9dec65980a88987d732d9cbd1f10b06b063fcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.livemint.com", "main_image": "http://www.livemint.com/rf/Image-330x220/LiveMint/Period1/2015/07/15/Photos/sebi-GAFR-koAH--621x414@LiveMint.jpg", "site_section": "http://www.livemint.com/money", "section_title": "Livemint- Money, news on finance, stock markets, personal finance, loans and more", "url": "http://www.livemint.com/Money/vofxWbPVMjeX20SjYbLk5H/Sebis-new-rules-for-derivative-contracts-may-have-unintende.html", "country": "IN", "title": "Why Sebi’s new rules for derivative contracts may have unintended consequences", "performance_score": 0, "site": "livemint.com", "participants_count": 2, "title_full": "Why Sebi’s new rules for derivative contracts may have unintended consequences - Livemint", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T23:21:00.000+03:00", "replies_count": 1, "uuid": "2aa87946a4f95e4f58ad9f452e9bab1628e34abb"}, "author": "Mobis Philipose", "url": "http://www.livemint.com/Money/vofxWbPVMjeX20SjYbLk5H/Sebis-new-rules-for-derivative-contracts-may-have-unintende.html#post-0", "ord_in_thread": 0, "title": "Why Sebi’s new rules for derivative contracts may have unintended consequences", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Capital markets regulator Securities and Exchange Board of India (Sebi) wants to limit the participation of retail investors in the equity derivatives segment. It has increased the minimum contract size for the segment from Rs. 2 lakh to Rs. 5 lakh. But its plans may fail. Here’s why. Options contracts account for four-fifths of total turnover in the equity derivatives segment. Within the options segment, traders have shown a preference for out-of-the-money options, which entail a fairly low investment outlay. For instance, it took all of Rs. 1,900 for a Rs. 2 lakh exposure on the Nifty 8,500 call options contract on Tuesday. When the contract size is increased, a similar contract will cost Rs. 4,500 or so, hardly a constraint for small-time traders who frequent the offices of myriad brokers across the country.\nAnd even if it proves to be a constraint, all they need to do is shift their attention to a contract that’s further out-of-the-money. The Nifty 8,700 call, for instance, costs just Rs. 444 for the current Rs. 2 lakh exposure, and with the increase in contract size, it will cost Rs. 1,065. There are even cheaper options that are fairly liquid, such as the 8,800 call ( See chart ). The problem, of course, is that by pushing traders towards further out-of-the-money contracts, they will unwittingly be encouraged to take far greater risks. The chance of a deep out-of-the-money option contract turning profitable is far less likely than a contract that settles closer to prevailing prices. Ironically, Sebi’s attempt to safeguard interests of retail investors may end up having the exact opposite effect.", "external_links": [], "published": "2015-07-14T23:21:00.000+03:00", "crawled": "2015-07-15T04:48:53.000+03:00", "highlightTitle": ""}