{"organizations": [], "uuid": "e5d04fae9651ffc79f4951313a6834b2c8c9d795", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/b/d/t/9/image.related.afrArticleLead.620x365.giazoj.png/1436829900155.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/smsf-action-to-take-if-a-trustee-dies-20150713-giazoj", "country": "AU", "title": "SMSF action to take if a trustee dies", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "SMSF action to take if a trustee dies | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T16:57:00.000+03:00", "replies_count": 0, "uuid": "e5d04fae9651ffc79f4951313a6834b2c8c9d795"}, "author": "Sam Henderson", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/smsf-action-to-take-if-a-trustee-dies-20150713-giazoj", "ord_in_thread": 0, "title": "SMSF action to take if a trustee dies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Once a fund member dies, you have six months to appoint a new trustee. Phil Carrick by Sam Henderson Changing ownership documents when a trustee of a two-person SMSF dies is time-consuming and can be costly, writes Sam Henderson, who answers your questions on superannuation.\nQ: I have a few questions around what happens if a trustee or member of a two-person self-managed superannuation fund dies. Is it necessary to change the trustee on all of the SMSF's assets? What are the time limits under legislation for the surviving trustee to appoint a replacement trustee and the SMSF's assets to be changed to the new trustees' names?\nA: Yes, it is necessary to change the ownership documents on all the assets, and this can be a time-consuming and possibly costly exercise. Institutions and state governments may charge fees to undertake this process for you and it could take a long time or require considerable administration depending on the number and complexity of assets held in the SMSF. In terms of a replacement trustee, you will have six months to appoint a new one and to pay out a death benefit. The Australian Taxation Office may look poorly on a situation that takes longer than this without good reason.\nA legal personal representative (LPR) will be appointed at death, and the LPR steps into the shoes of the deceased with respect to the operation of the SMSF. What with funds previously operating under the direction of two individual trustees, it may be worth considering switching to a corporate trustee, at added expense, to avoid having another individual non-member trustee such as an adult child.\nOften the option of a second individual trustee involves introducing one of the adult children to act as a non-member trustee, possibly giving them control of the fund if the original remaining member passes away. This would allow them to omit other siblings from the inheritance in the event of a rivalry. Appointing a corporate trustee will further assist to avoid this situation.\nAlso for consideration will be whether the fund continues to meet the Section 17A SIS Act (Superannuation Industry Supervision Act) definition of an SMSF. If the fund does not restructure in the given time frame, it risks losing its definition of an SMSF. This can be challenging when in a state of grief.\nThat said, it may even be a preferred option to close the SMSF if the decision-making and controlling member passes away. Rolling the money into an industry, corporate or other public offer super fund may be a preferred option for the surviving trustee to eliminate the obligations of running a DIY fund.\nIf the fund is kept going, you have six months for the assets to be changed to the new trustee's name.\nIt's worth taking advice and to do a comparison between individual and corporate trustees. There is a fr ee online video called \"SMSF Trustee – individuals or corporate\" on the Australian Taxation Office (ATO) website that you should watch. Corporate trustees may cost more but they are a better structure and save some serious time and effort further down the path. They are also the preferred structure of many SMSF specialists, including myself.\n ETFs Q: I've heard exchange traded funds (ETFs) are becoming very popular among investors and replacing the use of managed funds. What are some popular ETFs that might be suitable for my SMSF?\nA: ETFs are one of the fastest growing areas of interest for SMSF investors. I invest hundreds of millions of dollars of client money each year and I like ETFs as they are generally much cheaper than managed funds and around 80 per cent of managed funds underperform their relative index. For example, an institutionally-owned Australian share fund may underperform the ASX 200 in up to 80 per cent of cases over the long term according to Morningstar research so I'm a little sceptical of managed funds for this reason.\nThe number of ETFs available on the Australian share market is growing rapidly, with ANZ being one of the newest players in the space. Companies that provide ETFs include Blackrock iShares, Vanguard (well-known for its popular index funds), State Street Global and Beta Shares. These companies provide access to international shares, Australian shares, commodities, bonds and even cash.\nFor example, you can buy the S&P500 from the United States in US dollars under the ticker code IVV. This is a Blackrock iShares product and it costs just 0.07 per cent (or seven basis points) which is very cheap indeed. In comparison, popular international managed funds can cost up to 1.54 per cent or more. You may also be interested in iShares ETF IOO which represents the top 100 companies globally to get international diversification. For access to China consider IZZ. Blackrock has many others and although I can't recommend any of these without giving you specific advice, I think ETFs are a great way to obtain diversification often not seen in SMSF portfolios.\nIn the Australian market Vanguard ETF VAS is designed to replicate the Australian ASX 300 and STW from State Street Global is designed to replicate the ASX 200. You can even buy gold under the ticker code GOLD from Beta Shares that is not currency hedged.\nFor more information, search the ASX website at asx.com.au for informative videos on ETFs and other exchange traded products.\nFinancial planner Sam Henderson, chief executive of Henderson Maxwell, will be answering your questions while veteran The Australian Financial Review DIY super columnist John Wasiliev is on indefinite medical leave. To submit a question, please email smartmoneyquestions@fairfaxmedia.com.au . Readers wanting to pass on their best wishes to John should email dcleveland@fairfaxmedia.com.au .", "external_links": ["http://www.asx.com.au/products/etf-and-other-etp.htm", "https://www.ato.gov.au/super/self-managed-super-funds/setting-up/choose-individual-trustees-or-a-corporate-trustee/"], "published": "2015-07-13T16:57:00.000+03:00", "crawled": "2015-07-14T05:05:57.000+03:00", "highlightTitle": ""}