{"organizations": ["Bratz Bratz"], "uuid": "c353935f5d3de1ca4d5c8f633dd4d99f2763f52d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/21/102851109-Unknown.1910x1000.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=MAT", "section_title": "Yahoo! Finance: MAT News", "url": "http://www.cnbc.com/2015/07/21/bratz-says-toy-commercial-is-no-longer-enough.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=102851696", "country": "US", "title": "Bratz says toy commercial is no longer enough", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "Bratz says toy commercial is no longer enough", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T21:14:00.000+03:00", "replies_count": 0, "uuid": "c353935f5d3de1ca4d5c8f633dd4d99f2763f52d"}, "author": "", "url": "http://www.cnbc.com/2015/07/21/bratz-says-toy-commercial-is-no-longer-enough.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=102851696", "ord_in_thread": 0, "title": "Bratz says toy commercial is no longer enough", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bratz"], "text": "Source: Bratz Bratz dolls on social media? \nBratz is trying to stage its comeback, but playtime isn't the same as it was a decade ago. In order to introduce the doll brand to a generation of digitally native kids, owner MGA Entertainment is starting a multi-faceted online and mobile campaign. \n\"You need to go where the customer is, whether it's toys or any other brand,\" MGA Entertainment CEO Isaac Larian said. \"If they are digitally savvy and involved, that should be at least one element of your marketing.\" \nIn 2006, Barbie creator Mattel filed a lawsuit against the doll brand, alleging that the designer for Bratz came up with the idea when he was employed by their company. Bratz owner MGA Entertainment countersued, saying Mattel used its designs for the My Scene dolls. While Mattel initially won the lawsuit, the ruling was overturned in a federal court in favor of MGA. \nRead More Federal Court Rejects Mattel's 'Bratz' Copyright Claim \nLarian isn't ready to write traditional linear TV ads off just yet, but he explained that the trends show that kids are watching less scheduled TV. In May 2015, the Bernstein Research audience tracker said that year-over-year children's TV viewership dropped 22 percent. \n\"You see the ratings for these TV channels,\" he said. \"They are declining because kids are on their smartphones and Netflix . That's where they are.\" \nStill, it doesn't mean that TV advertising is dead. A media buyer who asked to remain anonymous said that interest in buying ads on kids' programming was up this Upfront season, especially for the fourth quarter. Still, networks like Nickelodeon and Cartoon Network have been touting their \"total video\" advertising options, which include an emphasis on their digital video and apps. \nBut, MGA Entertainment is betting big on digital content to get kids interested in the four original dolls and the newest addition. For example, the \"Bratz #SelfieSnaps\" playset will allow kids to share their selfie pictures and Bratz emoji icons with their friends, which were created by Swyft Media. It's also working with multichannel network Fullscreen to connect with online influencers to help promote the toys. \nEvan Wray, co-founder of Swyft Media, explained that the Bratz Gen Z target demographic is one of the hardest to reach. However, communicating with them in the language they understand—emojis and mobile stickers—is a more concrete tactic. According to a 2012 Pew Internet study, older teen girls (between 14 and 17) send an average of 100 texts a day. Wray said the number is well over 100 today, and in the first few hours, the Bratz app was downloaded more than 5,000 times. \n\"The core group of brand advocates is young teenagers,\" Wray said. \"So if your friends are using it, you will use it. We're seeing a nice ripple effect of the Bratz brand across all social interactions. The reality of the situation is kids today are absolutely glued to their smartphones.\" \nIn addition, stop motion production house Stoopid Buddy Stoodios is creating an online animated series featuring the dolls. The 10-episode run has an average episode length of 2.5 minutes. \nBefore the project, executive producer David Brooks talked to children to see what they liked to watch and how they were watching it. Most of the kids couldn't name the channel the shows they were watching aired on since everything they saw was online or on demand. \n\"Kids today are consuming content in such a different way than they were in the past,\" he said. \"No one said, 'I flipped to Nickelodeon or Disney.' \" \nRead More Barbie v. Bratz: How Much $$$ For Mattel? \nKen Madden, head of engagement at shopper engagement agency Shoptology, said combining physical toys and digital games is a strategy many toy brands are employing today. Companies like Lego, My Little Pony, American Girl and Disney have successfully bridged the gap. \nFor example, Disney Infinity doesn't allow you to play the online game without buying the actual toys. It gives brands a way to expand the scope of playtime, while capturing how kids lead digital-first lives. \n\"As kids live more of their lives online, Infinity is a great example of how kids will also expect their toys to have on- and offline lives,\" Madden said. \nAnd kids today aren't wary of branded entertainment. According to the 2015 Cassandra Report by creative agency Deep Focus, 26 percent of Gen Z have played online games that are from brands—and 23 percent wish there were branded digital games for them to play. About a quarter of them follow brands on social media, and 30 percent have liked brands online. \n\"It's really important for them to be in this world and this universe they are living in,\" Deep Focus Chief Marketing Officer Jamie Gutfreund said. \"They are truly digitally native.\"", "external_links": [], "published": "2015-07-21T21:14:00.000+03:00", "crawled": "2015-07-22T05:18:14.073+03:00", "highlightTitle": ""}