{"organizations": ["SEC"], "uuid": "bea8375ff67e70e5adc64ddd8efc3214d8353f24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/newlogoforadb300x220.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/630368/1/adb-ipo-injunction-is-in-the-right-directionsec.html", "country": "US", "title": "adb IPO Injunction Is In The Right Direction—SEC", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "adb IPO Injunction Is In The Right Direction—SEC", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T19:25:00.000+03:00", "replies_count": 0, "uuid": "bea8375ff67e70e5adc64ddd8efc3214d8353f24"}, "author": "", "url": "http://www.modernghana.com/news/630368/1/adb-ipo-injunction-is-in-the-right-directionsec.html", "ord_in_thread": 0, "title": "adb IPO Injunction Is In The Right Direction—SEC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Adnan A. Mohammed"], "text": "  17 July 2015 17:25 CET adb IPO Injunction Is In The Right Direction—SEC By Adnan A. Mohammed || The Economy Times \nThe Union of Industry, Commerce and Finance Workers (UNICOF) last week secured a 10-day injunction on 10th July 2015 to prevent management of adb Bank from proceeding any further with the share-sale in it controversial Initial Public Offering (IPO). \nadb has subsequently announced a temporary halt in its IPO process. According to the bank, all offer applications and payments received prior to the injunction will however remain valid until otherwise determined. \nIt is because of this that, the Securities and Exchange Commission (SEC) has described the interim injunction place on the IPO of adb as normal development that only shows the country’s capital market is growing. \nAccording to the SEC, it is in the interest of the market for all parties to allow the court process to take its course. \nThe Director General, Adu Anane Antwi explained to an Accra based radio station, stating that “We ourselves as SEC were sent to court over the HFC but we still waited for the court to make its decision, and then we went back to work. So in the same vein, let’s allow the court processes to go through and then we shall all be winners.” \n“I can tell you that cases in the US are many – about hundred times if not thousand times more than in Ghana because our market is small, you don’t have many of this cases. But as we are developing, and we are getting more companies and more investors coming in, there is a likelihood that some people will raise some issues about some of these developments but it’s all part of the process. \n“And it’s also positive because after we have gone through them, the people are happy that in Ghana when there are issues about investment and securities, they go through the court for resolution,” he concluded. \nThe SEC is the regulatory institution for the capital market that approved ADB’s Initial Public Offering after the due diligence. Mr. Adu Anane Antwi emphasized the SEC is officially unaware of the concerns of the workers because such internal issues are considered a part of the requirements for approval of an IPO. \n“If workers had a case pending in court, that’s when it would have been disclosed in the prospectus for investors to know and make informed decisions during the IPO. But this is not a court case and so whatever concerns may not be too relevant. I don’t even know exactly what the workers’ concerns are but our job is to ensure that adequate disclosure of information is made by the company to enable investors make a decision in buying the shares,” he said.", "external_links": [], "published": "2015-07-17T19:25:00.000+03:00", "crawled": "2015-07-17T22:44:10.000+03:00", "highlightTitle": ""}