{"organizations": [], "uuid": "7dc008c71d10883e83c037daa1c6ac9852c402db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/07/boss_wont_give_raise.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/7-reasons-boss-wont-give-raise/", "country": "US", "title": "7 Reasons Your Boss Won’t Give You a Raise", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "7 Reasons Your Boss Won’t Give You a Raise", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T12:00:00.000+03:00", "replies_count": 0, "uuid": "7dc008c71d10883e83c037daa1c6ac9852c402db"}, "author": "Holly Hammersmith", "url": "http://www.gobankingrates.com/personal-finance/7-reasons-boss-wont-give-raise/", "ord_in_thread": 0, "title": "7 Reasons Your Boss Won’t Give You a Raise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Holly Hammersmith July 29, 2015 \nRaise your hand if you would like a raise. Raises and end-of-year bonuses signify a job well done and the value you provide to your employer, and they help pay your bills and fund your retirement. \nRead: How to Double Your Salary in Two Years \nMany workers would like a raise that at least covers inflation, which the Federal Reserve is predicting to run about 2 percent. Workers this year can expect to receive an average raise of about 3 percent, according to USA Today . While this number might not seem large, every little bit counts. An employee making $60,000 per year would earn $61,800 with a 3 percent raise. That’s maybe an extra mortgage payment, a vacation or maybe enough to pay off some consumer debt . \nBut there are multiple reasons why bosses don’t give raises. Avoid these situations, and your chances of receiving that coveted raise are likely to be much higher. Reason No. 1: You Made It Too Personal \nYou told your boss that the rising cost of living was one of the reasons why you should receive a raise. Oops. Raises are actually about performance and bringing in money for your employer, not about your personal needs. \nDo not cite your medical bills, children’s college tuition, the cost of gasoline going up or any other personal issues when asking for a raise. Everyone has personal issues, and not everyone is given a raise. Instead, explain to your boss why you deserve the money, not why you need it. Reason No. 2: You Didn’t Practice Your Pitch \nYou went in cold. You decided to wing it. You were overly confident or underprepared. For whatever reason, your boss wasn’t buying it. Instead, thoroughly plan your pitch, including your reasons for deserving a raise and rebuttals to any common questions your boss may ask. \nYou might practice your pitch in front of your significant other, a friend or the mirror to fine-tune your presentation. Keep in mind your pitch includes not just your words but also your body language and your demeanor. \nRelated: See the Best-Paying Jobs by City Reason No. 3: You Didn’t Have a Backup Plan \nMaybe you went in with a great pitch and explained why you deserve a raise and why you provide value to the company. But it turns out nobody is receiving a raise this year. The company is strapped for cash, and your boss would like to give you a raise but simply can’t. End of story? It does not have to be. \nThink of other elements outside of the bottom dollar. Maybe you can negotiate extra personal days or vacation time in the coming year. Perhaps a work-from-home arrangement one or two days a week would really ease your pocketbook when it comes to your commute. Reason No. 4: You Ask for Raises Too Often \nResearch shows there are huge differences between raise expectations among different generations. The millennial generation — roughly those born between 1981 and 2000 — typically expect a raise, bonus or promotion every year or every other year, according to a Society for Human Resource Management post. On the flip side, baby boomers — those born between 1945 and 1964 — take a more reserved approach and tend to view raises and bonuses as an earned reward, not a guaranteed right. \nIf your work performance is through the roof year after year, and you can demonstrate an increase in the value that you provide to your employer year after year, such as increased sales, then perhaps your request for a raise is warranted. If not, you might want to step back and put yourself in your boss’ shoes and cool your raise-seeking jets. Would you want someone asking you for a raise every year just because he thought he was entitled to it? \nRelated: 25 Ways to Double Your Paycheck in One Month Reason No. 5: You Didn’t Raise the Bar \nMany employers simply need to see that their workers are providing value — and increased value at that — year after year. \nPerhaps your performance review was “better than average,” but did you truly excel at your job? When your value is undeniable and you continually push yourself to go above and beyond your boss’ expectations, your boss will more often see why a raise is warranted . Going forward, be honest with yourself about your performance, and if you need to up your game, do it before you ask for a raise. Reason No. 6: You Didn’t Offer a Specific Figure \nWhen you asked for a raise, your boss said the company was open to the idea, and then your negotiation stalled. What happened? If you didn’t provide research to back your request, that could have been the issue. Don’t leave it up to your boss to provide a figure. Instead, tell your boss what you would like to be paid first. \nYou can offer a percent increase, a bonus amount or maybe an hourly increase. Before you do, research what jobs like yours are paying. Having figures and studies — websites such as Glassdoor.com, PayScale.com and Salary.com can help — to back up your number are invaluable in your negotiations. Reason No. 7: You Didn’t Ask, Period \nWhoops! You sat back and thought your boss would hand over a raise during your annual performance review. Or maybe you thought your company would offer a cost-of-living raise across the board. Neither happened, and here you are with a paycheck no higher than it was last year. \nBe proactive in the future. Don’t be afraid to be the one to initiate the raise conversation with a superior. Your peers probably already are. \nShare This Article", "external_links": [], "published": "2015-07-29T12:00:00.000+03:00", "crawled": "2015-07-29T15:53:29.872+03:00", "highlightTitle": ""}