{"organizations": [], "uuid": "5f3f6916cc7c246644441f592846d63873b9592d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=1257ic7hq/*http://www.noodls.com/view/21561CAF20D93630F7DED6AB63D764774BB069C9", "country": "GB", "title": "Announcements and Notices - Completion of Placing of New Shares under General Mandate", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Announcements and Notices - Completion of Placing of New Shares under General Mandate", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T14:52:00.000+03:00", "replies_count": 0, "uuid": "5f3f6916cc7c246644441f592846d63873b9592d"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=1257ic7hq/*http://www.noodls.com/view/21561CAF20D93630F7DED6AB63D764774BB069C9", "ord_in_thread": 0, "title": "Announcements and Notices - Completion of Placing of New Shares under General Mandate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close E150731790Ann.indd \nHong Kong Exchanges and Clearing Limited and The Stock Exchange of Hong Kong Limited take no responsibility for the contents of this announcement, make no representation as to its accuracy or completeness and expressly disclaim any liability whatsoever for any loss howsoever arising from or in reliance upon the whole or any part of the contents of this announcement. \nThis announcement is for information purposes only and does not constitute an invitation or offer to acquire, purchase or subscribe for the securities. \n(Incorporated in Bermuda with limited liability) (Stock Code : 630) PLACING OF NEW SHARES UNDER GENERAL MANDATE Placing Agent Gransing Securities Co., Limited \nThe Board is pleased to announce that the condition set out in the GM Placing Agreement was fulfilled on 21 July 2015 and completion of the GM Placing took place on 24 July 2015 in accordance with the terms of the GM Placing Agreement. An aggregate of 61,200,000 GM Placing Shares, representing approximately 16.64% of the issued share capital of the Company as at the date of this announcement immediately after completion of the GM Placing, have been successfully placed to not less than six Placees who and whose ultimate beneficial owners are Independent Third Parties. The net proceeds from the GM Placing are approximately HK$19.2 million. \n* For identification purposes only \n1 \nReference is made to the announcement of AMCO United Holding Limited (\"Company\") dated 14 July 2015 (\"Announcement\") in relation to, among other matters, the GM Placing under the General Mandate. Capitalised terms used in this announcement shall have the same meanings as defined in the Announcement unless otherwise stated. The Board is pleased to announce that the condition set out in the GM Placing Agreement was fulfilled on 21 July 2015 and completion of the GM Placing took place on 24 July 2015 in accordance with the terms of the GM Placing Agreement. An aggregate of 61,200,000 GM Placing Shares, representing approximately 16.64% of the issued share capital of the Company as at the date of this announcement immediately after completion of the GM Placing, have been successfully placed to not less than six Placees at the Placing Price of HK$0.328 per GM Placing Share. To the best of the Directors' knowledge, information and belief having made all reasonable enquiries, (i) each of the Placees and their respective ultimate beneficial owners, is an Independent Third Party; and (ii) none of the Placees has become a substantial shareholder (within the meaning of the Listing Rules) of the Company upon completion of the GM Placing. The net proceeds from the GM Placing are approximately HK$19.2 million, which will be utilised for general working capital of the Group. EFFECTS ON SHAREHOLDING STRUCTURE OF THE COMPANY \nThe table below sets out the changes to the shareholding structure of the Company as a result of the completion of the GM Placing: Shareholders (Note 1)", "external_links": [], "published": "2015-07-24T14:52:00.000+03:00", "crawled": "2015-07-24T15:43:18.081+03:00", "highlightTitle": ""}