{"organizations": [], "uuid": "59a8187a54a6b57bd9400403689d386f0cefa892", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/13/mideast-markets-wrap-idUSL5N0ZT2YA20150713", "country": "US", "title": "MIDEAST STOCKS-Gulf markets rally modestly on Greece; Egypt falls", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "MIDEAST STOCKS-Gulf markets rally modestly on Greece; Egypt falls | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T18:29:00.000+03:00", "replies_count": 0, "uuid": "59a8187a54a6b57bd9400403689d386f0cefa892"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/13/mideast-markets-wrap-idUSL5N0ZT2YA20150713", "ord_in_thread": 0, "title": "MIDEAST STOCKS-Gulf markets rally modestly on Greece; Egypt falls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Foreigners net buyers across Gulf\n* Dubai leads gains\n* Saudi petrochemicals slip on weak oil, ex-dividend SAFCO\n* Other Gulf stocks sensitive to oil also fall\n* Egypt's rally falters as local investors resume sell-off\nBy Olzhas Auyezov\nDUBAI, July 13 (Reuters) - Gulf bourses rose on Monday in line with a global equities rally due to the Greek bailout agreement, but a drop in oil prices because of a likely Iran nuclear deal limited gains in the region.\nBrent crude fell 1.8 percent as Tehran and six world powers were on the brink of finding a nuclear deal that would bring sanctions relief and more oil to the already oversupplied market.\nSaudi Arabia's bourse, the most sensitive in the Gulf to oil prices because of its heavyweight petrochemical sector, was the weakest performer on Monday and edged up just 0.2 percent.\nThe petrochemical sector index fell 0.4 percent, although that was to a large extent because of Saudi Arabia Fertilizers Co (SAFCO), which dropped 3.1 percent as it went ex-dividend.\nBut other sectors were mostly positive, supported by some strong second-quarter earnings. Food maker National Agriculture Development Co surged 5.9 percent after posting a 25.4 percent year-on-year increase in quarterly profit.\nNational Shipping Co of Saudi Arabia (Bahri) added 0.9 percent. It said after trading closed that its second-quarter net profit more than doubled thanks to increased fleet size and rates for transporting spot crude.\nUAE, EGYPT\nThe region's biggest gainer of the day was Dubai which, as a regional logistics and financial hub, could benefit the most from increased foreign trade and investment in Iran if the sanctions are lifted.\nThe emirate's index rose 0.9 percent with most stocks positive. Heavyweights Emaar Properties and Dubai Islamic Bank added 2.1 and 1.5 percent respectively.\nNeighbouring Abu Dhabi's bourse gained 0.6 percent and Qatar edged up 0.4 percent. But oil-sensitive stocks in both markets were weak. Abu Dhabi National Energy Co tumbled 6.9 percent and petrochemicals giant Industries Qatar lost 0.7 percent.\nThe more positive news on Greece boosted global appetite for risk so investors from outside the region were net buyers on all major markets in the Middle East, data from local bourses showed.\nBut their buying failed to support Egypt's market, which fell 1.4 percent as local investors resumed a sell-off, after a drop in trading volume in the previous session indicated that the market's rally was faltering.\nThe Cairo benchmark had risen in the two previous days after sinking to a one-year low on concerns over exchange rates, security and an energy shortage.\nThe property sector came under particularly heavy pressure on Monday. Palm Hills Development tumbled 4.8 percent and Medinet Nasr Housing lost 4.5 percent.\nMONDAY'S HIGHLIGHTS\nSAUDI ARABIA\n* The index edged up 0.2 percent to 9,270 points.\nDUBAI\n* The index rose 0.9 percent to 4,053 points.\nABU DHABI\n* The index added 0.6 percent to 4,758 points.\nQATAR\n* The index edged up 0.4 percent to 11,938 points.\nEGYPT\n* The index fell 1.4 percent to 7,587 points.\nKUWAIT\n* The index rose 0.5 percent to 6,203 points.\nOMAN\n* The index added 0.3 percent to 6,479 points.\nBAHRAIN\n* The index gained 0.3 percent to 1,335 points. (Editing by Andrew Torchia and Keith Weir )", "external_links": [], "published": "2015-07-13T18:29:00.000+03:00", "crawled": "2015-07-13T17:48:13.000+03:00", "highlightTitle": ""}