{"organizations": [], "uuid": "065da52a5542f0c00b51a9865946810ca073ec35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/noeurogreekgraffiti.jpg", "site_section": "http://feeds.thestreet.com/tsc/feeds/rss/personal-finance", "section_title": "Personal Finance", "url": "http://www.thestreet.com/story/13205251/1/greece-inspired-volatility-proves-value-of-alternative-mutual-funds.html?cm_ven=RSSFeed", "country": "US", "title": "Greece-Inspired Volatility Proves Value of Alternative Mutual Funds", "performance_score": 0, "site": "thestreet.com", "participants_count": 1, "title_full": "Greece-Inspired Volatility Proves Value of Alternative Mutual Funds", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T13:15:00.000+03:00", "replies_count": 0, "uuid": "065da52a5542f0c00b51a9865946810ca073ec35"}, "author": "twocents@thestreet.com (Gregg Greenberg)", "url": "http://www.thestreet.com/story/13205251/1/greece-inspired-volatility-proves-value-of-alternative-mutual-funds.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Greece-Inspired Volatility Proves Value of Alternative Mutual Funds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint \nNEW YORK ( TheStreet ) -- The spike in volatility as a result of the Greek debt crisis has the market on edge and the VIX, or so-called fear index, spiking over 30% to almost 19. Jonathan Angrist, portfolio manager for the Cognios Market Neutral Large Cap Fund, said this choppiness may be rough on investor nerves, but it proves the value of market neutral and other alternative mutual funds. \n\"Market-neutral funds tend to do better than the index when the market's going down,\" said Angrist. \"The reason is that we have shorts so when the market's going up, our long book is making money and our short book is losing money. When the market's going down, our long book tends to lose money and our short book tends to make money. So we tend to do worse than the market when the market's going up and we're better than the market when the market's going down.\" \nAngrist said his Cognios Market Neutral Large Cap Fund differs from the other long-short equity funds on the market because its long book is not equal to the size of its short book which means the fund tries to hedge out all of the risk of the market. \n\"Most other neutral market products are targeting risk-free rates and we think we're one of the only funds that does that,\" said Angrist. \"So if we're taking all the risks of being a market neutral product, we're still trying to deliver attractive returns.\" As to where alternative, or hedged, funds fit into an investor's portfolio, Angrist said the percentage has traditionally been less than 20%. Nevertheless, he said the length of the bull run has many investors seeking additional protection. \nMust Read: Greece and Puerto Rico Won't Kill the Bull Market \n\"As investors get more and more scared of equity evaluations and get more and more dissatisfied with the bond yields they're getting, we think the entire alternative class, and our market neutral fund in particular, has some potential to take some of the allocation away from traditional equities and traditional bond funds,\" said Angrist. And while most investors are watching their stock funds with trepidation, Angrist said alternative funds will gather the most assets from bond fund withdrawals. \"Equities are a little above average, but bonds are the nearly the highest they've ever been,\" said Angrist. \"So what we're seeing is more people taking allocations, their bond portfolio, and putting it into alternatives in specifically market neutral equity.\" Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-07-04T13:15:00.000+03:00", "crawled": "2015-07-04T15:05:40.000+03:00", "highlightTitle": ""}