{"organizations": [], "uuid": "1fab6712febf0bee2fe17da5cbeb05d25a94bab9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/currency_dollar_052814thinkstock.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/trade/248181-senators-push-adminstration-on-currency-manipulation", "country": "US", "title": "Senators push adminstration on currency manipulation", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senators push adminstration on currency manipulation", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T19:04:00.000+03:00", "replies_count": 0, "uuid": "1fab6712febf0bee2fe17da5cbeb05d25a94bab9"}, "author": "bgoad@thehill.com (Vicki Needham)", "url": "http://thehill.com/policy/finance/trade/248181-senators-push-adminstration-on-currency-manipulation", "ord_in_thread": 0, "title": "Senators push adminstration on currency manipulation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senators push adminstration on currency manipulation Thinkstock By Vicki Needham - 07/16/15 12:04 PM EDT A bipartisan group of senators on Thursday urged the Obama administration to crack down on global currency manipulation they argue hurts U.S. exporters. Led by Ohio Sens. Sherrod Brown (D) and Rob Portman (R), eight Senate Finance Committee members wrote a letter to U.S. Trade Representative Michael Froman and Treasury Secretary Jacob Lew, calling on them to push for stronger enforcement provisions in ongoing negotiations of a massive Asia-Pacific trade deal. “As you continue negotiations on the Trans-Pacific Partnership, we urge you to prioritize combatting currency manipulation by our competitors,” they wrote. Portman and Sen. Debbie Stabenow (D-Mich.) failed to get stronger currency manipulation language into trade promotion authority legislation, or fast-track, that was signed last month month by President Obama. That legislation included negotiating objectives that explicitly call on the White House to tackle currency manipulation through the ongoing trade negotiations. “American workers can compete and win in the global economy if given a level playing field,” they wrote. \"Currency manipulation is one of the most egregious efforts undertaken to harm the competitiveness of hard-working manufacturers, farmers and small businesses throughout the U.S.,\" they wrote. The letter also was signed by Sens. Michael Bennet (D-Colo.), Charles Schumer (D-N.Y.), Bob Menendez (D-N.J.), Chuck Grassley (R-Iowa) and Richard Burr (R-N.C.), all members of the Senate Finance Committee. Past: 1 day Yellen urges Congress to be wary... Yellen warns proposed changes could undermine Fed's ability to support... Sanders rains on Hillary's parade Sanders grabs the mic as Clinton visits Democrats on Capitol Hill. Poll shows Sanders gaining on... Poll also shows her support could erode more if Joe Biden enters race. Poll: Trump's popularity soars... Fifty-seven percent of Republicans see Trump favorably. Obama to CBS reporter: 'You should... The president was asked why four Americans held in Iran were not included... Trump tops national poll for... Trump gets 17 percent compared to 14 percent for Jeb Bush. Fake applicants kept ObamaCare... The report found 11 of 12 fictitious applicants were automatically re-... Cotton blocks Senate from... The Arkansas Republican suggested the court doesn't need extra judges. Court: Nuns must comply with... An appeals court dealt another blow to challengers of the controversial... Cheney: Iran deal moves us toward... Cheney says Obama has \"in effect sanctioned\" an Iranian nuclear bomb. Reporter scolded by Obama: '... CBS's Major Garrett said he wanted to be provocative with question. Planned Parenthood: Anti-abortion... The group fiercely disputes that the conversation involved selling \"fetal... GOP crafts Iran deal attack plan Republican leaders in Congress are crafting their attack plan against the... Sanders challenges Clinton on... Democratic presidential candidate Sen. Bernie Sanders challenged his rival... Republicans seize on Planned... A Planned Parenthood executive discusses the transfer of aborted fetal... Obama calls out Rand Paul on Iran... President Obama challenged Republicans to back the nuclear agreement with... C-SPAN to preempt first GOP debate The network has invited all 17 of the GOP presidential hopefuls to a forum...", "external_links": [], "published": "2015-07-16T19:04:00.000+03:00", "crawled": "2015-07-17T03:53:11.000+03:00", "highlightTitle": ""}