{"organizations": [], "uuid": "3c7c0d0c3804763e13f77bf17003ec883979540e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/b/k/v/w/image.related.afrArticleLead.620x365.gibksn.png/1436831182953.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/tax/ato-told-to-lift-its-game-on-debt-collection-20150713-gibksn", "country": "AU", "title": "ATO told to lift its game on debt collection", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "ATO told to lift its game on debt collection | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T07:32:00.000+03:00", "replies_count": 0, "uuid": "3c7c0d0c3804763e13f77bf17003ec883979540e"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/policy/tax/ato-told-to-lift-its-game-on-debt-collection-20150713-gibksn", "ord_in_thread": 0, "title": "ATO told to lift its game on debt collection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The ATO's debt collection strategy is being scrutinised. Tanya Lake Share on twitter by Joanna Mather Concerns about how junior officers within the Australian Tax Office go about collecting debt have been raised by an independent umpire.\nThe Inspector General of Taxation, Ali Noroozi, says junior debt collectors have too much latitude to issue garnishee notices and should be better supervised.\n\"Junior officers have been authorised to make important decisions, without senior officer approval, such as garnishing taxpayer bank accounts up to $50,000,\" he says in a report released on Tuesday.\nOutstanding annual debt to the ATO reached $20 billion in 2013-14. Most debt is owed by individuals and micro businesses. These two taxpayer segments account for approximately 60 per cent, or $12.3 billion, of total collectable tax debt.\nTax Commission Chris Jordan announced in March that the ATO would act more swiftly to recover payment and initiate bankruptcy procedures.\nBut Mr Noroozi is urging caution. He said debt officers were sometimes unaware of legal proceedings already under way. This had led to officers garnishing accounts without taking account of the fact there may be matters in dispute.\n\"I have recommended a range of improvements to decision-making processes and staff capability, including requiring team leader approvals in more instances, training to increase commercial awareness and better assurance of staff adherence to policies,\" Mr Ali Noroozi says.\nThe inspector general's role is to identify systemic issues in the administration of tax law.\n Mr Noroozi also says there is strong opposition to the ATO's use of external debt collection agencies.\n\"I have recommended that the ATO make public its reasons for using external debt collection agencies and transparently share the intended benefits and outcomes to assuage concerns,\" he says.", "external_links": ["https://twitter.com/https://twitter.com/JoannaMather"], "published": "2015-07-14T07:32:00.000+03:00", "crawled": "2015-07-14T05:47:53.000+03:00", "highlightTitle": ""}