{"organizations": [], "uuid": "b4590ac0ac429f3ad5a85ed2d694195d401e86b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-23/moody-s-says-low-oil-price-here-to-stay-as-russia-bleeds-capital", "country": "US", "title": "Moody’s Says Low Oil Price Here to Stay as Russia Bleeds Capital", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Moody’s Says Low Oil Price Here to Stay as Russia Bleeds Capital - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T20:54:00.000+03:00", "replies_count": 0, "uuid": "b4590ac0ac429f3ad5a85ed2d694195d401e86b9"}, "author": "Agnes Lovasz", "url": "http://www.bloomberg.com/news/articles/2015-07-23/moody-s-says-low-oil-price-here-to-stay-as-russia-bleeds-capital", "ord_in_thread": 0, "title": "Moody’s Says Low Oil Price Here to Stay as Russia Bleeds Capital", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Low oil prices are just the tip of what ails Russia, according to Moody’s Investors Service.\nWith its dependence on commodities and a slump in investment, Russia will have a hard time recovering from its record economic slump as global oil prices are bound to remain lower for a long time, Yves Lemay, managing director in the sovereign risk group at Moody’s in London, said in an interview on Wednesday. As much as a quarter of Russia’s gross domestic product and two-thirds of its exports are linked to the energy industry, according to the rating company.\n“Our assessment is that low oil prices are here to stay,” Lemay said. “Without major investment in the infrastructure, modernizing the equipment, oil production in Russia is unlikely to rise and may slowly decline in the coming years.”\nCrippled by its first recession since 2009, Russia is starved of investment as U.S. and European Union sanctions over the conflict in Ukraine limit access to international capital markets and curb imports of drilling technology. Fixed-capital investment has fallen for 18 months, and the Economy Ministry predicts capital outflows may reach $90 billion in 2015 after last year’s record of more than $150 billion.\nWhile Russia’s oil output has remained above 10 million barrels a day for almost six years and reached a post-Soviet record in January, sanctions have raised the cost of borrowing and barred technology exports needed for new, more complex oil projects. OAO Rosneft, the world’s biggest publicly traded oil company by volume, and gas producer OAO Novatek are among firms targeted for Russia’s actions in Ukraine.\nAffect, Constrain “Lower oil prices, combined with capacity constraints, are likely to affect and constrain Russia’s growth prospects in the coming years,” Lemay said.\nCrude will average $60 a barrel this year, potentially going as high as $65, according to the latest prediction by the credit assessor. This forecast and the assumption of an increase “of a few dollars” next year may be compromised by the fact that China’s economic growth is moderating, Iran may return to global oil markets and U.S. shale producers show greater resilience than anticipated to lower prices, according to Lemay.\nThe ruble may come under pressure again because of depressed oil prices and the risk of another flare-up in hostilities in eastern Ukraine, according to Lemay. The currency has gained 5.8 percent against the dollar to become this year’s best performer among 24 emerging-market currencies tracked by Bloomberg, rebounding from a rout in 2014 when it lost almost half its value.\nMost Volatile The Russian currency’s three-month implied volatility, a measure of exchange-rate swings, is at 17 percent, the highest globally, according to data compiled by Bloomberg.\nLemay said a weaker ruble may curtail the central bank’s ability to help the economy with further interest-rate cuts after four consecutive reductions this year to 11.5 percent from 17 percent. Russia’s economy will contract 3 percent this year and stagnate in 2016, according to Moody’s.\nRussia has been unsuccessful in its attempts to reduce its reliance on commodities production, and a meaningful shift would require “significant investment,” he said.\nRussia’s innate institutional weaknesses and risks arising from the Ukraine conflict are putting a brake on investment, Lemay said. Moody’s rates Russia Ba1, its highest junk grade, with a negative outlook.\n“The challenge for Russia is to improve the investment climate,” Lemay said. “Institutional challenges, weak rule of law for instance, and the geopolitical situation mean that we are not seeing a favorable investment climate.”", "external_links": [], "published": "2015-07-23T20:54:00.000+03:00", "crawled": "2015-07-23T16:32:36.020+03:00", "highlightTitle": ""}