{"organizations": [], "uuid": "9f5501410758321125ea791742896f5dbd0964a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/2/d/d/c/image.related.afrArticleLead.620x365.gi9ncm.png/1436514076867.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/tax/new-push-for-standard-deduction-for-work-expenses-20150710-gi9ncm", "country": "AU", "title": "New push for standard deduction for work expenses", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "New push for standard deduction for work expenses | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T15:41:00.000+03:00", "replies_count": 0, "uuid": "9f5501410758321125ea791742896f5dbd0964a1"}, "author": "Joanna Mather", "url": "http://www.afr.com/news/policy/tax/new-push-for-standard-deduction-for-work-expenses-20150710-gi9ncm", "ord_in_thread": 0, "title": "New push for standard deduction for work expenses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tax returns must be lodged before October 31. AFR by Joanna Mather The pesky task of keeping receipts to claim work-related expenses at tax time could be a thing of the past if a fresh push to allow standard deductions succeeds.\nA few years ago Australia came close to having a $500 standard deduction amount for anybody who was willing to tick a box rather than bothering to make a detailed claim for things like uniforms, telephone calls, self-education and use of a motor vehicle.\nThe standard amount of $500 would also cover tax agent fees.\nBut after announcing the policy would take hold in mid-2012, the former Labor government scrapped it just months prior to its inception, banking the $2 billion that had been budgeted for the measure.\nNow, some in the accounting world have reprised the idea.\nIn submissions to the government's tax review, The Tax Institute and Chartered Accountants Australia and New Zealand are peddling the idea as a means for simplifying the tax system and saving on compliance costs.\nThey suggest taxpayers have the option of a standard deduction amount or claiming actual expenses using receipts.\n\"It's one of the things that is defiantly worth having back on the table,\" Tax Institute national president Stephen Healey says. \"If you look at the whole digital and data agenda more broadly, compliance is going to become more automated.\"\n The idea will be opposed by some and trade-offs would be required, Chartered Accountants says in its submission. \"A trade-off in terms of a reduced personal tax rate (as part of overall reform) would seem necessary to garner community support,\" it says.\nIn 2011-12, around 8.5 million Australians claimed work-related expenses totalling nearly $19.4 billion, although around 38 per cent of tax filers had claims of less than $500.\nThe Henry tax review found Australia's work-related deductions regime was complex compared with countries like the UK and New Zealand.\nNew Zealand got rid of work-related deductions in the 1980s by trading the allowance off against a small income tax reduction.\nThe National Tax and Accountants Association, which represents agents who perform much of the personal tax return work, does not like the idea.\n\"To deny employees the right to claim tax deductions would simply be the raising of additional revenue in an unfair and unjust manner,\" the association says in its submission.\n\"To justify such an action using words such as 'simplicity' and 'reform' would be an exercise in political sophistry.\"\nTradespeople, medical staff and teachers would disapprove of such a move, the association adds.\n\"Such a reform is likely to be challenged by not only occupational groups but also trade unions whose members may be adversely affected by such a reform.\"\nThe government's tax discussion paper says there could be significant compliance savings, although people with few expenses would effectively be over-claiming.", "external_links": [], "published": "2015-07-10T15:41:00.000+03:00", "crawled": "2015-07-11T02:50:53.000+03:00", "highlightTitle": ""}