{"organizations": [], "uuid": "156e3bf8c7f58c890547bec7525a1df34b6ea859", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/talktalk-bills-no-sense-161053734.html", "country": "US", "title": "'TalkTalk bills make no sense'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "'TalkTalk bills make no sense'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T19:10:00.000+03:00", "replies_count": 0, "uuid": "156e3bf8c7f58c890547bec7525a1df34b6ea859"}, "author": "", "url": "https://uk.finance.yahoo.com/news/talktalk-bills-no-sense-161053734.html", "ord_in_thread": 0, "title": "'TalkTalk bills make no sense'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 28, 2015, 17:37 BST - UK Markets closed 'TalkTalk bills make no sense' By Jessica Gorst-Williams | Telegraph – 26 minutes ago 17.95 +0.14 \nOur consumer expert helps a reader who is now paying more than double their normal monthly fee for telephone and broadband services \nMy problems are twofold. The first comes in my capacity as honorary secretary for a block of 10 flats and a TalkTalk emergency telephone line to the two lifts. TalkTalk cut off this line without telling anyone. I ended up speaking to 14 different people and was told I had asked for it to be done. This is nonsense. \nThe last person I spoke to said the line could only be reconnected if I also had broadband which would be ridiculous in a lift. This issue remains unresolved. \n• 'TalkTalk sent me threatening letters after I was bereaved' \n• 'TalkTalk has left me unable to talk to anyone for months' \nThe second surrounds the transfer of my telephone and broadband to my new address. TalkTalk now, without explanation, charges for my few overseas calls, which were previously free in my package. When I phoned to ask for a refund, it added £3.30 to my monthly bill, again without reason. It also charged me £16 a month for previously free line rental. \nI agreed to pay £10 extra a month for “super fast” fibre broadband which in fact is no quicker than the previous speed I obtained before I moved. It added an extra fee of £7.50 a month. My monthly charges have risen to an average of £62 from £28 before. \nI am committed to an 18-month contract. Is there anything you can do to help? BI, Surrey \nFurther to my contacting TalkTalk, it came back an exasperating four months later after constant nagging saying: “We have set up a TalkTalk Business account for the building he manages, which is better suited to his needs, and apologised for giving the wrong information when he called to ask about his services.” \nWhen I rang you to see how things were, interference on it was so bad we couldn’t communicate. I alerted TalkTalk and it is now OK. \nRegards the lift, TalkTalk relented and let you have a telephone-only contract, which it says it no longer allows for new customers. However, it tried to charge a £90 reconnection fee. \nNow (NYSE: DNOW - news ) , after more talking, TalkTalk has refunded the difference in cost between the original and new charges for the lift for the last six months, dropped the reconnection charge, and given six months free line rental. \nAs to your home problems it has paid £150 to cover various charges and some goodwill. \n• If you want to contact Jessica, click here", "external_links": [], "published": "2015-07-28T19:10:00.000+03:00", "crawled": "2015-07-28T19:38:18.662+03:00", "highlightTitle": ""}