{"organizations": ["Fed"], "uuid": "0090d7f1fc5f7b8aa739f625405b12257edd9e44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bankrate.com", "main_image": "", "site_section": "http://www.bankrate.com/syndication/news-stories.xml", "section_title": "Bankrate.com: Personal finance Headlines", "url": "http://www.bankrate.com/finance/federal-reserve/what-did-federal-reserve-say.aspx", "country": "US", "title": "Say what? The Fed statement for dummies", "performance_score": 0, "site": "bankrate.com", "participants_count": 0, "title_full": "Say what? The Fed statement for dummies", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "0090d7f1fc5f7b8aa739f625405b12257edd9e44"}, "author": "", "url": "http://www.bankrate.com/finance/federal-reserve/what-did-federal-reserve-say.aspx", "ord_in_thread": 0, "title": "Say what? The Fed statement for dummies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Claes Bell", "Sheyna Steiner"], "text": "By Sheyna Steiner and Claes Bell • Bankrate.com \nIt could be the beginning of the end of a historic era in monetary policy. This could be the last meeting of the Federal Open Market Committee at which the central bank adopts an unequivocally accommodative, ultra-loose monetary policy stance. Notice the strategic use of the word \"could.\" \nThe September meeting looms large. That's when rates could go up for the first time in nearly a decade, but there's no telling what could happen -- or is there? Did the Federal Reserve give the world any hints about its plans in the statement issued at the close of this week's two-day policy meeting? \nHere's what Fed officials said and what they really meant. What the Fed said: \nInformation received since the Federal Open Market Committee met in June indicates that economic activity has been expanding moderately in recent months. Growth in household spending has been moderate and the housing sector has shown additional improvement; however, business fixed investment and net exports stayed soft. The labor market continued to improve, with solid job gains and declining unemployment. On balance, a range of labor market indicators suggests that underutilization of labor resources has diminished since early this year. What the Fed meant: \nThe economy continues to slowly improve. Households are spending more and real estate is doing better. But companies aren't making as many long-term business investments or exporting as many goods overseas as we'd like. \nOn the plus side, more people who want to find work are able to do so. What the Fed said: \nInflation continued to run below the Committee's longer-run objective, partly reflecting earlier declines in energy prices and decreasing prices of non-energy imports. Market-based measures of inflation compensation remain low; survey based measures of longer-term inflation expectations have remained stable. What the Fed meant: \nRemember what we said last month about energy prices stabilizing? Yeah, that's not the case anymore. Bargain-basement oil prices, along with falling prices on other imported goods, are probably going to continue to keep inflation low in the short-term. \nGood for consumers, bad for economists hoping for a little more sizzle from inflation. What the Fed said: \nConsistent with its statutory mandate, the Committee seeks to foster maximum employment and price stability. The Committee expects that, with appropriate policy accommodation, economic activity will expand at a moderate pace, with labor market indicators continuing to move toward levels the Committee judges consistent with its dual mandate. The Committee continues to see the risks to the outlook for economic activity and the labor market as nearly balanced. What the Fed meant: \nThe central bank has two basic jobs: fostering an economy that keeps businesses flourishing so lots of people are working, while also controlling inflation. The labor market is cooperating nicely, so the Fed is one for two. What the Fed said: \nInflation is anticipated to remain near its recent low level in the near term, but the Committee expects inflation to rise gradually toward 2 percent over the medium term as the labor market improves further and the transitory effects of earlier declines in energy and import prices dissipate. The Committee continues to monitor inflation developments closely. What the Fed meant: \nInflation may be stalled now, but once the impact of low energy prices blows over and the dollar stops rampaging over other currencies, prices will heat up faster than a midnight showing of \"Magic Mike XXL.\" © Ferdaus Shamim/ZUMA Press/Corbis What the Fed said: \nTo support continued progress toward maximum employment and price stability, the Committee today reaffirmed its view that the current zero to 1/4 percent target range for the federal funds rate remains appropriate. In determining how long to maintain this target range, the Committee will assess progress -- both realized and expected -- toward its objectives of maximum employment and 2 percent inflation. What the Fed meant: \nThere will be no change to interest rates today. In fact, we're not even going to give the markets any hint about our timing. Rates could stay near zero until Taylor Swift and Katy Perry patch up their blood feud. Or until the next FOMC meeting in September, whichever comes first. What the Fed said: \nThis assessment will take into account a wide range of information, including measures of labor market conditions, indicators of inflation pressures and inflation expectations, and readings on financial and international developments. The Committee anticipates that it will be appropriate to raise the target range for the federal funds rate when it has seen further improvement in the labor market and is reasonably confident that inflation will move back to its 2 percent objective over the medium term. What the Fed meant: \nWe added one word to this part of the statement to mess with you, but the plan is the same as it was last month: We're going to keep an eye on the garbage fire that is European economic policy, hope China doesn't have an economic meltdown, and watch inflation and the jobs market closely for a sign that it's time to raise rates. What the Fed said: \nThe Committee is maintaining its existing policy of reinvesting principal payments from its holdings of agency debt and agency mortgage-backed securities in agency mortgage-backed securities and of rolling over maturing Treasury securities at auction. This policy, by keeping the Committee's holdings of longer-term securities at sizable levels, should help maintain accommodative financial conditions. What the Fed meant: \nThe central bank will keep hoarding Treasuries and mortgage-backed securities, because that's good for the economy. Rolling over maturing investments drains the pool of available securities, which pushes prices up. Bond prices move inversely to yields, so as prices go up, yields go down. Consumer borrowing costs track those yields, so the upshot should be lower rates for long-term loans, such as mortgages. What the Fed said: \nWhen the Committee decides to begin to remove policy accommodation, it will take a balanced approach consistent with its longer-run goals of maximum employment and inflation of 2 percent. The Committee currently anticipates that, even after employment and inflation are near mandate-consistent levels, economic conditions may, for some time, warrant keeping the target federal funds rate below levels the Committee views as normal in the longer run. What the Fed meant: \nDon't get too excited when rates do finally do achieve liftoff. Geologic strata may form in the time it takes to reach a normal level of interest rates. What the Fed said: \nVoting for the FOMC monetary policy action were: Janet L. Yellen, Chair; William C. Dudley, Vice Chairman; Lael Brainard; Charles L. Evans; Stanley Fischer; Jeffrey M. Lacker; Dennis P. Lockhart; Jerome H. Powell; Daniel K. Tarullo; and John C. Williams. What the Fed meant: \nYou know that feeling when you're in a room full of people who vote the same way you do? It makes the world seem less crazy. Share this story", "external_links": [], "published": "2015-07-29T03:00:00.000+03:00", "crawled": "2015-07-31T00:46:06.429+03:00", "highlightTitle": ""}