{"organizations": [], "uuid": "344cc8eef767a8eac106bd175bef791099b928ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507021721.html", "country": "US", "title": "Mozambique: Access to Electricity Fundamental, but Not Free", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Mozambique: Access to Electricity Fundamental, but Not Free", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T17:55:00.000+03:00", "replies_count": 0, "uuid": "344cc8eef767a8eac106bd175bef791099b928ba"}, "author": "", "url": "http://allafrica.com/stories/201507021721.html", "ord_in_thread": 0, "title": "Mozambique: Access to Electricity Fundamental, but Not Free", "locations": ["Angola", "Mozambique"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Angola: Putin-Style Presidential Decree Ends NGO Independence in Angola \nAn electricity company “operates as an economic unit, and there is no alternative to this”, he insisted. “To say otherwise would be pure demagogy, and the companies would be unsustainable”. \nOpposition speakers the previous day had denied the government slogan that “Cahora Bassa is ours”, apparently because the largest slice of the power produced at the Cahora Bassa dam on the Zambezi is exported to South Africa. But Couto thought it absurd to argue that electricity companies “must not be involved in foreign trade”. \nOn the contrary, involvement in the southern African energy market was essential. Mozambique was a member of the Southern African Power Pool (SAPP) “and we're not going to leave it”. \nCouto pointed out that Mozambique could not build a new dam based solely on its own electricity needs. It would make sense to build a dam that could generate 1,500 megawatts, but there must be buyers for this power, and they could not be found in Mozambique alone. \nHe insisted that “Cahora Bassa is indeed ours”. The company operating the dam, HCB, “belongs to us, but it must be sustainable, and it must respect the contracts it has signed” (the largest of these contracts, and the one which guarantees HCB's financial health, is with the South African power utility, Eskom). \nCouto rejected the claim made by MDM deputy Venancio Mondlane that there has been no rural electrification, because the district capitals electrified over the past decade are all supposedly urban. Couto pointed out that, on the way to the district capitals, the power lines also supply smaller places, such as administrative post headquarters, localities and even villages. \nSo far the public electricity company, EDM, had electrified the capitals of 125 of the 128 districts that existed when the plans were drawn up (subsequently some districts have been split in two, so there are some new district capitals that need electrification). \nCouto pointed out that during this work, 295 administrative posts, localities and villages had received electricity. This year the remaining three district capitals, seven other small towns and 20 administrative osts would be connected to the national grid. \nBut the power was not free of charge. “The consumers sign contracts as clients of EDM”, said Couto. “That's how things work”. \nCouto also told the Assembly that a wildcat strike against redundancies at the dredge mine in Moma, on the coast of the northern province of Nampula, operated by the Irish company Kenmare Resources, ended on Wednesday, and the strikers have returned to work. \nCouto said the problem for Kenmare was that the prices for the minerals it mines at Moma (ilmenite, rutile and zircon) have fallen sharply, and the Chinese market for these minerals has shrunk by 12.5 per cent. \nCost cutting measures, such as redundancies, were thus inevitable. At first Kenmare wanted to sack 375 of its workforces, but after tripartite discussions between the company, the workers' trade union and the Labour Ministry, the number of redundancies was scaled back to 160. \n“The workers received their redundancy pay and an extra bonus of between 15 and 60 per cent”, said Couto. \nThis was not enough to avoid the unofficial strike which broke out on 24 June. Couto said the police only intervened to clear the entrance to the mine and none of the strikers were injured or killed. \n“Companies working in mining and energy must be sustainable”, said the Minister. “When they run into labour problems, these are solved in tripartite negotiations”. Mozambique \nThe Mozambican police on Wednesday arrested two young men in the western city of Tete accused of attempting to kidnap a … see more » Copyright © 2015 Agencia de Informacao de Mocambique. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-02T17:55:00.000+03:00", "crawled": "2015-07-03T09:54:59.000+03:00", "highlightTitle": ""}