{"organizations": ["Exxon Mobil"], "uuid": "3ea8f59a54a7daaf4a6ccd43fefec93354619227", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-oil-gas/?format=rss", "section_title": "Oil News | Gas News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/tumbling-oil-prices-slam-profit-173238799.html", "country": "US", "title": "Tumbling oil prices slam profit at Exxon Mobil, Chevron", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Tumbling oil prices slam profit at Exxon Mobil, Chevron", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T20:32:00.000+03:00", "replies_count": 0, "uuid": "3ea8f59a54a7daaf4a6ccd43fefec93354619227"}, "author": "", "url": "https://uk.finance.yahoo.com/news/tumbling-oil-prices-slam-profit-173238799.html", "ord_in_thread": 0, "title": "Tumbling oil prices slam profit at Exxon Mobil, Chevron", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 31, 2015, 18:42 BST - UK Markets closed Tumbling oil prices slam profit at Exxon Mobil, Chevron Reuters - UK Focus – 9 minutes ago \n(Adds comments from analysts and company officials, updates trading) \nBy Ernest Scheyder and Anna Driver \nJuly 31 (Reuters) - Weak oil prices shriveled quarterly profit at Exxon Mobil Corp and Chevron Corp on Friday, compelling both companies to rethink operations and plan for what many expect to be a sustained period of cheap crude. \nEarnings at U.S. oil majors Exxon, which were the worst in a decade, and Chevron (Swiss: CVX.SW - news ) missed analysts' expectations, adding to concerns that perhaps executives had not acted quickly enough to mitigate the impact of an over-50-percent drop in oil prices since last summer. \nThe results highlight how smaller and more nimble U.S. shale oil companies have slashed costs faster and more aggressively than global majors. Some shale producers have cut back drilling by 60 percent or more. \nEvan Calio, an analyst with Morgan Stanley (Xetra: 885836 - news ) , said on Exxon's earnings conference call that the oil giant appeared to be less vocal than its peers about cutting costs. \nJeff Woodbury, Exxon's head of investor relations, responded that the company was constantly focused on capital efficiency and cost management. \nStill, Exxon is sticking for now with its plans to spend $34 billion this year, although that figure has a downward bias because of cost savings and efficiencies, Woodbury said. \nChevron also still plans to spend $35 billion this year, but said it would spend less in 2016 and 2017 as several mega projects come online. \nCUTS AT EUROPEAN RIVALS \nExxon and Chevron's European peers such as Royal Dutch Shell (Xetra: R6C1.DE - news ) Plc have taken more aggressive action. BP Plc cut its budget for the second time this year, while Shell (LSE: RDSB.L - news ) said it would lay off 6,500 workers. \nExxon's profit fell by more than half, with the biggest drop in its exploration and production business, where earnings slumped by nearly $6 billion \nChevron's profit plunged 90 percent, a starker drop and one exacerbated by a $2.22 billion loss in its exploration and production division. \nPat Yarrington, Chevron's chief financial officer, seeking to head off complaints about cost management, said the company had slashed about $3 billion in spending so far this year, and wasn't done. Still, analysts peppered her throughout the earnings call for details. \nThough production grew at both companies, they missed the estimates of many analysts who had expected the energy giants to pump more. \nShares (Berlin: DI6.BE - news ) of both slumped more than 3 percent in afternoon trading. \nBRIGHT SPOT \nTo be sure, the two companies benefited from their refining divisions, which make gasoline and other fuels. \nRefining units tend to be far more profitable when oil prices are low, providing Chevron and other integrated energy companies with an internal hedge during times when core operations, such as oil production, are weighed down by weak prices. \nBoth companies stressed their ability to weather the price doldrums and emerge stronger. \nChevron's Chief Executive John Watson, for instance, bluntly described the results as \"weak.\" He laid off 2 percent of its staff earlier this week. \n\"I think in general the industry is putting a sharper pencil to cost cutting,\" said Brian Youngberg, senior oil company analyst at Edward Jones in St Louis. \"I think they are realizing the days of $100 a barrel (oil) are over.\" \nExxon also said Friday it would slow its share repurchase program. The company purchased $1 billion of its own stock in the second quarter, but expects to spend roughly half of that on repurchases in the third quarter. \nChevron earlier this year scrapped its entire repurchase program. (Reporting by Ernest Scheyder in Williston, N.D., and Anna Driver in Houston; Editing by Terry Wade and Bernadette Baum)", "external_links": [], "published": "2015-07-31T20:32:00.000+03:00", "crawled": "2015-07-31T20:43:04.652+03:00", "highlightTitle": ""}