{"organizations": [], "uuid": "cd41463c96d246f1cc6234764db92bd16d8486ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/e/f/h/i/image.related.afrArticleLead.620x365.gil0q3.png/1437955941975.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/media-and-marketing/media-wars-its-silicon-valley-vs-independent-publishers-20150727-gil0q3", "country": "AU", "title": "Media wars: It's Silicon Valley vs. independent publishers", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Media wars: It's Silicon Valley vs. independent publishers | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T08:12:00.000+03:00", "replies_count": 0, "uuid": "cd41463c96d246f1cc6234764db92bd16d8486ce"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/media-and-marketing/media-wars-its-silicon-valley-vs-independent-publishers-20150727-gil0q3", "ord_in_thread": 0, "title": "Media wars: It's Silicon Valley vs. independent publishers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CEO of AppNexus, Michael Rubenstein, says \"Google and Facebook may just take over the internet, in which case independent publishing is dead, journalism is dead and AppNexus is dead.\" by Paul McIntyre The future for media and content is either a \"monolithic, homogenised internet\" controlled by Facebook, Twitter, Apple and Google or alliances of independent media companies who collaborate to resist global consolidation of content into a handful of Silicon Valley aggregators.\nIt's a real and increasingly sobering tale and the problem, according to the chief executive of AppNexus, Michael Rubenstein, is that \"no-one knows which way it's going to play out yet\".\nMr Rubenstein, who has built his own fast-growing US tech company priming the current boom for automation and trading exchanges in the global US$600 billion media advertising market, known as programmatic, says many \"independent\" media companies have already resigned to Facebook and it's ilk dominating global content distribution.\n\"Google and Facebook may just take over the internet, in which case independent publishing is dead, journalism is dead and AppNexus is dead,\" he told the Financial Review.\n\"We will all go away and maybe that's how this plays out. But we are fighting hard and our media partners are fighting hard for a world of thriving independent players, be they brands or media companies, which we think enriches the internet and creates a better internet than everyone just going to Facebook or Google for their content.\"\nMr Rubenstein said media companies have one of two decisions to make – give up and \"basically become an ornament on Google and Facebook's Christmas tree\" or \"you fight and try to thrive as an independent with scale and some level of differentiation.\"\nBut when The New York Times acknowledges visitor numbers to its homepage collapsed – almost by half – in just two years while readers still devour its stories through social media channels, early surrender to the Silicon Valley gatekeepers is an understandable retreat.\n\"There's no question the biggest challenge that all media companies are thinking about right now is how do they continue to succeed and thrive as independent companies in the face of competition from companies coming from Silicon Valley like Google, Facebook and Apple who are increasingly asserting more and more control over distribution and the economics of the industry,\" he said.\n \"Distribution advantages from the internet have by and large flowed from local media companies to the global platform players and now I think it's incumbent on local players to see what they can do to take it back. There are a lot of people who are in that situation where they are trading short-term rewards for long-term strategic value.\"\nMr Rubenstein, lands in Australia this week to headline the Australian Premium Exchange Summit staged by APEX, a joint venture for programmatic trading of mobile advertising between Fairfax Media and Nine Entertainment's Co's Mi9. Other publishers are expected to join the alliance, but Mr Rubenstein said these new publisher alliances like APEX require once fierce media rivals to collaborate to survive.\n\"It's hard to know how it is all going to play out but we are positioning ourselves to align with independent media companies, agencies and brands and help them envisage a future in which they do control their own destinies,\" he said.", "external_links": [], "published": "2015-07-27T08:12:00.000+03:00", "crawled": "2015-07-27T10:11:05.512+03:00", "highlightTitle": ""}