{"organizations": [], "uuid": "6d09fd01f3508e21cdba4200d21220eedf345703", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/uk-capitalise-growing-wealth-chinese-051501692.html", "country": "US", "title": "How the UK can capitalise on the growing wealth of Chinese consumers", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "How the UK can capitalise on the growing wealth of Chinese consumers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T08:15:00.000+03:00", "replies_count": 0, "uuid": "6d09fd01f3508e21cdba4200d21220eedf345703"}, "author": "", "url": "https://uk.finance.yahoo.com/news/uk-capitalise-growing-wealth-chinese-051501692.html", "ord_in_thread": 0, "title": "How the UK can capitalise on the growing wealth of Chinese consumers", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Jul 29, 2015, 06:48 BST - UK Markets open in 1 hr 12 mins How the UK can capitalise on the growing wealth of Chinese consumers By Lauren Davidson | Telegraph – 33 minutes ago Print \nAlmost half of Chinese tourists to the UK plan to spend even more in British shops over the next year, a new survey has found \nBritish high streets are set for a boom from Far Eastern travellers as rising disposable incomes in China leave its growing population with more money for travel and shopping. \nThree quarters of Chinese consumers in the UK have bought at least one luxury item worth more than £500 in the past year, while 21pc have purchased three or four and 18pc have splashed out on five or more and a large chunk of these shoppers intend to spend more. \nAlmost half, 46pc, of respondents said they plan to increase their luxury spending in the UK over the next year , according to a survey of almost 2,000 Chinese consumers by the marketing agency Wei Consulting. \nAround a third of people said they would spend the same amount, while 18pc said they would be likely to spend less. \nDisposable income per capita in China rose 7pc to a record high of 28,844 yuan (£2,978) last year, reaching significantly higher levels in more prosperous cities such as Shanghai and Beijing. \nThis has left Chinese consumers with heavier purses to spend on travel, with the number of outbound tourists from China surpassing 100m for the first time last year, increasing by 19pc to reach 107m. \nThat is expected to grow to 174m by 2019, according to Bank of America Merrill Lynch. \nThe UK which is among the top 10 most popular destinations for Chinese tourists is in a strong position to capitalise on the wanderlust of China’s wealthy . \nThe Wei Consulting survey found that almost half of respondents plan to spend most (75pc or more) of their luxury budgets in the UK in 2015 and an additional 28pc intend to make at least 50pc of their premium purchases here. \nThe Government recently relaxed certain visa restrictions for Chinese travellers following pressure from UK plc, who argued that the country was losing out on more than £1bn a year from the world’s second-largest economy. \nHowever, prominent business leaders such as IAG boss Willie Walsh have said that these measures have not been “radical” enough , after data from the Office for National Statistics showed that visits from China fell by 8.8pc last year, dragging spending down by 1pc, while the overall number of tourists rose 7.6pc. \nOxford Street remains the top destination for Chinese shoppers, with 64pc of travellers actively planning visits to the West End. However, the survey found that Bicester Village and Heathrow Airport are more popular than other central London locations including Regent Street, Mayfair, Covent Garden and Knightsbridge. \nA recent report from duty-free payments service Global Blue found that Chinese shoppers account for a fifth of all tax-free spend in the West End , with an average transaction of £1,450. \nBags are the most sought-after luxury purchases from Chinese travellers in the UK, followed by clothing, beauty products and technology devices. \nSeven in 10 shoppers splash out on treats for themselves, while 20pc split their shopping between their own wish lists and gifts for others, and 9pc of people prioritise purchases for friends and family.", "external_links": [], "published": "2015-07-29T08:15:00.000+03:00", "crawled": "2015-07-29T08:48:59.808+03:00", "highlightTitle": ""}