{"organizations": [], "uuid": "533f21540e2cb0464582b5b71334fa016434bdc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://images.forbes.com/media/assets/forbes_1200x1200.jpg", "site_section": "http://www.forbes.com/finance/", "section_title": "Forbes - Personal Finance Information and Personal Finance News - Forbes.com", "url": "http://www.forbes.com/sites/advisor/2015/07/20/5-best-tips-to-save-1-million-for-retirement/", "country": "US", "title": "5 Best Tips to Save $1 Million for Retirement", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "5 Best Tips to Save $1 Million for Retirement - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T00:17:00.000+03:00", "replies_count": 0, "uuid": "533f21540e2cb0464582b5b71334fa016434bdc4"}, "author": "Barry Glassman", "url": "http://www.forbes.com/sites/advisor/2015/07/20/5-best-tips-to-save-1-million-for-retirement/", "ord_in_thread": 0, "title": "5 Best Tips to Save $1 Million for Retirement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Everyone knows that they need to save for retirement especially with company pensions becoming extinct over the next generation. At some point, you’re going to stop working and will have to live on whatever you have saved plus what you’re entitled to receive from Social Security.\nHaving worked with many people who have saved $1 million or more, there are patterns of behavior that they all possess that have helped them to accumulate their wealth. While there’s no denying that it helps to start with a well-paying job, earning more money is no guarantee that you’ll be set for retirement. If you want to have $1 million or more saved for retirement, here are 5 tips to help you join the millionaire retiree ranks.\n1. Start saving now:\nRegardless of your age, make saving a priority. Those who begin to save in their 20s and 30s will need to put aside a smaller amount on a regular basis since they have more years to save and invest. But what if you’re in your 40s and haven’t saved much? You still have at least 25 years of savings ahead of you.\nBloomberg’s 401k Savings Calculator is easy to use and will give you a pretty good idea of how much you will need to save to reach your retirement savings goals. Let’s say that you are 40 years old, you make $100,000 a year and you haven’t saved anything for retirement thus far. We will be very conservative and assume that your 401k offers no employer match and you expect to make an annual investment return of 6%. To have $1 million in your 401k by age 65, you will need to put aside $18,000 or 18% of your annual salary every year. In fact, $18,000 is the maximum amount that you can defer in 2015. If you are over 50, you can defer an additional $6,000 per year.\nDoing this exercise may feel like having cold water thrown in your face – after the initial shock, you’re wide awake. Once you make the decision to know your situation, you can act to change and improve it.\n2. Make it automatic:\nThose who have accumulated wealth made a decision to save a portion of what they earned and have practiced this discipline over time. The first place most start is with their 401k or other employer-based retirement plan. Decide what percent or dollar amount to defer from each paycheck and stick with that plan. The calculator mentioned about will give you a good idea of what you should set aside to meet your retirement goal. If you’re juggling debt and saving, then defer a smaller amount this year. As you pay off the debt, consider increasing the amount you’re saving rather than spending it all.\nPage 1 / 3 Continue Get The Forbes Investing Digest", "external_links": ["http://www.bloomberg.com/personal-finance/calculators/401k/"], "published": "2015-07-21T00:17:00.000+03:00", "crawled": "2015-07-20T23:32:51.010+03:00", "highlightTitle": ""}