{"organizations": [], "uuid": "b29deab471cf39e7a2ad842daca7ae182ad43d73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/f/0/p/m/image.related.afrArticleLead.620x365.gieti1.png/1437353012593.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/policy/education/young-male-drift-from-engineering-and-science-alarms-industry-20150720-gieti1", "country": "AU", "title": "Young male drift from engineering and science alarms industry", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Young male drift from engineering and science alarms industry | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T08:43:00.000+03:00", "replies_count": 0, "uuid": "b29deab471cf39e7a2ad842daca7ae182ad43d73"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/policy/education/young-male-drift-from-engineering-and-science-alarms-industry-20150720-gieti1", "ord_in_thread": 0, "title": "Young male drift from engineering and science alarms industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia needs more young engineering graduates like Jimmy Yang, pictured taking a selfie at a University of Newcastle graduation ceremony last year. Ryan Osland Share on twitter by Ben Potter Business is alarmed at a continuing drift by young male university students away from the science, technology engineering and maths disciplines that experts say will dominate future jobs.\nThe Household Income and Labour Dynamics Australia (HILDA) survey reported last week that fewer men aged 25-34 held science, technology, engineering and maths (STEM) degrees in 2012 - the last year of the survey - than in older age groups.\nMore young women took up STEM disciplines but from a very low base and barely enough to offset the decline in male STEM graduates.\nOnly 22 per cent of young men aged 25 – 34 held engineering and related degrees in 2012, compared to 31 per cent of 45 to 54 year olds. Just 3.4 per cent of women graduates aged 25-34 took engineering, but this was sharp increase on estimates for higher age groups.\n\"This suggests that the significant attention on STEM disciples in university in recent years has yet to bite with young people, leaving the economy deficient in STEM-related skills,\" Ai Group chief executive Innes Willox said.\nMr Willox said industry worried about the low take-up in engineering and sciences by young men. More young men and young women are studying information technology related disciplines, but not enough to offset the shrinking share of young men graduating in engineering and science.\nStephen Durkin, chief executive of Engineers Australia, said young Australians' lack of enthusiasm for STEM disciplines was a worry because they were needed both to support a growing population with infrastructure and for Australia to engage with the global knowledge economy.\n\"We need the capability in place to be able to support the implementation of infrastructure to support population growth,\" Mr Durkin said.\n \"More importantly, we think it's really critical that we have a broader capability building in Australia as we move from a knowledge based economy to a high technology economy.\"\nThe HILDA survey is conducted by the Melbourne Institute of Applied Economic and Social Research at Melbourne University.\nThe drift from STEM subjects comes despite a crescendo from business and careers experts that these are the skills that will determine employability for an increasing majority of job seekers in the future. The number of graduates has increased, meaning the absolute number of STEM grads is up even though their share is down.\nBut business is campaigning for a bigger effort in STEM education because those disciplines are expected to be required for more new jobs in the future.\nIn April Business Council of Australia president Catherine Livingstone told the National Press Club that an estimated 75 per cent of the fastest-growing occupations, including those in the creative industries and humanities, will require STEM skills and knowledge.\nMs Livingstone called for urgent action on a ten year plan to close Australia's digital skills gap compared with rival nations, and BHP Billiton said it would put $22 million into a program to boost the maths performance of girls in schools and lifting the skills of maths teacher.\nA PwC report, A Smart Move , predicted that automation and the \"internet of things\" - in which everything is connected - will decimate non-technological jobs such as personal assistants, account and sales clerks, bus and train drivers, and many trade jobs in the next 20 years. The trend would ncrease the premium on the critical thinking and problem solving skills that STEM education fosters, PwC predicted.", "external_links": ["https://twitter.com/http://twitter.com/OBenPotter"], "published": "2015-07-20T08:43:00.000+03:00", "crawled": "2015-07-20T04:03:29.717+03:00", "highlightTitle": ""}