{"organizations": ["New York International Auto Show", "Ford", "United Auto Workers", "Build New Lincoln Continental", "Lincoln Continental"], "uuid": "f2813dfdcede45f92df0c81e90ca9ba9c76db15f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-JK116_fordli_G_20150715132921.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.wsj.com/articles/ford-to-build-new-lincoln-continental-in-michigan-1436980482?ru=yahoo?mod=yahoo_itp", "country": "GB", "title": "Ford to Build New Lincoln Continental in Michigan", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "Ford to Build New Lincoln Continental in Michigan", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T05:52:00.000+03:00", "replies_count": 0, "uuid": "f2813dfdcede45f92df0c81e90ca9ba9c76db15f"}, "author": "", "url": "http://www.wsj.com/articles/ford-to-build-new-lincoln-continental-in-michigan-1436980482?ru=yahoo?mod=yahoo_itp", "ord_in_thread": 0, "title": "Ford to Build New Lincoln Continental in Michigan", "locations": ["Michigan Ford", "Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael"], "text": "Ford to Build New Lincoln Continental in Michigan Announcement precedes labor talks between manufacturer and United Auto Workers union ENLARGE Ford showed off a concept version of its coming Lincoln Continental luxury car at the New York International Auto Show earlier this year. Photo: Michael Nagle/Bloomberg News By 4 COMMENTS \nFord Motor Co. F -0.41 % disclosed plans to build a coming flagship luxury car in Michigan, marking a win for U.S. auto workers as talks on a new labor contract with the United Auto Workers union kick into gear this week. \nJohn Fleming, the auto maker’s global manufacturing chief, said the coming Lincoln Continental—a car that is intended to mark a more luxurious direction for the brand—will be made at its Flat Rock, Mich., assembly plant. The Flat Rock plant currently employs 3,100 workers building the Mustang sports car and Fusion midsize sedan. \nThe new Continental flagship, a top-of-the-line sedan that revives one of the brand’s most recognizable nameplates, goes on sale next year (likely as part of the 2017 model year) and is aimed at growing Lincoln’s presence in China, where big, cushy sedans with roomy back seats are in high demand. \nMr. Fleming, who revealed the location during an event on Wednesday in Dearborn, Mich., offered no other specifics, other than to say that the vehicle has been well received. Ford unveiled a prototype of the car’s design this spring in New York. “I think it will do very, very well,” Mr. Fleming said. \nThe Continental replaces the Lincoln MKS, which has been manufactured in Chicago. Related Ford to Trim Compact Car Production (April 23) \nHis remarks follow Ford’s announcement last week that it would move production of its Focus compact car and C-Max hybrid from Michigan, likely to a factory outside the U.S. \nLabor talks between Ford and the union begin next week and securing U.S. jobs for UAW-represented workers will be a priority for the union because much new auto investments lately has flowed to Mexico, where labor costs are cheaper. UAW officials said they were told by the company that Focus production would be moved from the U.S. in 2018. \nBecause small cars earn lower margins than trucks and sport-utility vehicles, auto makers have struggled to build them profitably in the U.S. Earlier this year, Ford said it was laying off 700 workers at a Wayne, Mich., plant. Low gas prices and rising demand for roomier trucks and crossovers have sapped demand for small, fuel-efficient vehicles. Ford already builds U.S.-sold Fiesta subcompacts in Mexico. \nMr. Fleming said the decision to relocate the Focus and C-Max wasn’t tied to contract talks but rather preparations for the next-generation models. “It’s normal business,” he said. “It’s just that normal business sometimes intersects with other things that are happening.” \n“From our perspective, we needed to move forward because our process is geared, where we have suppliers involved and we have engineering teams doing work.” He declined to say where the Focus and C-Max would be built or what Ford might assemble next at the Michigan factory. He said those moves will be discussed during negotiations. \nUAW President Dennis Williams on Monday declined to comment specifically on the Focus and C-Max relocation, saying he will wait until next week when the union officially kicks off labor talks with the No. 2 U.S. car maker at a ritual handshaking ceremony. \nGeneral Motors Co. GM -1.07 % Chief Executive Mary Barra said earlier this week she sees no need to follow Ford’s move because she is confident the company can profitably build its small cars in the U.S. GM builds its Chevy Sonic subcompact and Cruze compact in the Midwest. \nWrite to Christina Rogers at christina.rogers@wsj.com 263", "external_links": [], "published": "2015-07-16T05:52:00.000+03:00", "crawled": "2015-07-16T06:25:48.000+03:00", "highlightTitle": ""}