{"organizations": ["Consumer Goods & Services", "Accenture", "EEO", "Computer Science", "Life Sciences", "Industry Infrastructre & Transportation", "AP"], "uuid": "079bb0aedaa3cac3c63185e8d18a10d04bfc66a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.simplyhired.com", "main_image": "", "site_section": "http://www.simplyhired.com/a/job-feed/rss/o-13205", "section_title": "Finance jobs | Simply Hired", "url": "http://www.simplyhired.com/job/lgngfq6fmd", "country": "US", "title": "Oracle Financials Analyst at Accenture (Atlanta, GA)", "performance_score": 0, "site": "simplyhired.com", "participants_count": 0, "title_full": "Oracle Financials Analyst at Accenture (Atlanta, GA)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T13:08:00.000+03:00", "replies_count": 0, "uuid": "079bb0aedaa3cac3c63185e8d18a10d04bfc66a8"}, "author": "", "url": "http://www.simplyhired.com/job/lgngfq6fmd", "ord_in_thread": 0, "title": "Oracle Financials Analyst at Accenture (Atlanta, GA)", "locations": ["United States", "US", "Atlanta"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Source: A Mighty River Join Accenture and help transform leading organizations and communities around the world. The sheer scale of our capabilities and client engagements and the way we collaborate, operate and deliver value provides an unparalleled opportunity to grow and advance. Choose Accenture, and make delivering innovative work part of your extraordinary career.People in our Client & Market career track drive profitable growth by developing market-relevant insights to increase market share or create new markets. They progress through required promotion into market-facing roles that have a direct impact on sales. Business and Systems Integration professionals analyze, design and/or develop best practice business changes through technology solutions. Job Description Oracle professionals design, implement and deploy Oracle solutions to achieve defined business goals. Maintain skills in Oracle applications process design and configuration; Oracle application design, development, integration, testing and deployment; and Oracle application technical architecture. EBS-F and EP professionals design, implement and deploy Oracle financial solutions for finance, accounting, cash management, treasury management and asset management. PRD-Cross Industry professionals develop and deliver business solutions across all Products industries. A professional at this position level within Accenture has the following responsibilities: Analyzes and solves problems that are lower complexity and may be routine in nature, requiring varied responses depending on the situation. Interacts with peers within Accenture before updating supervisors. Likely has some interactions with non-management levels at the client and/or within Accenture.Receives minimal instruction on daily work tasks and a moderate level of instruction on new assignments.Decisions impact own work and may impact the work of others.Individual contributor and/or oversees a small work effort and/or team. Basic Qualifications: * 1 year Minimum experience with Oracle EBS * 1 year Minimum experience in 1 or more of the following modules: General Ledger (GL), Sub Ledger Accounting (SLA), Accounts Receivable (AR), Accounts Payable (AP), Fixed Assets (FA), Project Accounting, E-Business Tax, Procurement (PO), iProcurement, Billing, Financial Accounting Hub (FAH). * 1 year Minimum experience with configuration of modules (including working with their clients to design configurations) * 1 year Minimum experience with design of solutions (Functional Design) around these modules and supporting processes * 1 year Minimum experience with testing of the applications and custom solutions * Minimum of Bachelor's degree Preferred Skills * Experience with Oracle EBS Release 12 (R12) * Oracle EBS R12 experience, including Sub Ledger Accounting * Consulting background with recent client facing experience * 1 years experience in business process analysis with Finance and Accounting focus * Bachelor of Science degree in Industrial Engineering, Information Systems/Technology, Computer Science, Computer Engineering, Electrical Engineering, Electronics Engineering or an engineering degree with specialized course work in mathematics, statistics, operations research/management, computer science/engineering or information systems/technology. * Recent experience in Consumer Goods & Services, Auto, Industry Infrastructre & Transportation, Life Sciences, Retail or equivalent industries Professional Skill Requirements * Proven success in contributing to a team-oriented environment * Proven ability to work creatively and analytically in a problem-solving environment * Desire to work in an information systems environment * Excellent leadership, communication (written and oral) and interpersonal skills All of our consulting professionals receive comprehensive training covering business acumen, technical and professional skills development. You'll also have opportunities to hone your functional skills and expertise in an area of specialization. We offer a variety of formal and informal training programs at every level to help you acquire and build specialized skills faster. Learning takes place both on the job and through formal training conducted online, in the classroom, or in collaboration with teammates. The sheer variety of work we do, and the experience it offers, provide an unbeatable platform from which to build a career. Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status). Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration. Accenture is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities. Equal Employment Opportunity All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Accenture is committed to providing veteran employment opportunities to our service men and women.", "external_links": [], "published": "2015-07-20T13:08:00.000+03:00", "crawled": "2015-07-20T14:18:13.783+03:00", "highlightTitle": ""}