{"organizations": [], "uuid": "004784101bb3a09cf32b35b0b69993e03e99c44e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canajunfinances.com", "main_image": "http://www.canajunfinances.com/wp-content/uploads/2014/10/Friday.jpg", "site_section": "http://www.canajunfinances.com/comments/feed/", "section_title": "Comments for Canadian Personal Finance Blog", "url": "http://www.canajunfinances.com/2015/07/17/loosest-money-weddings-greece-and-bestmoneystories/comment-page-1/", "country": "US", "title": "Comment on Loosest Money, Weddings, Greece and #BestMoneyStories by Michael James", "performance_score": 0, "site": "canajunfinances.com", "participants_count": 1, "title_full": "Comment on Loosest Money, Weddings, Greece and #BestMoneyStories by Michael James", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T16:27:00.000+03:00", "replies_count": 0, "uuid": "004784101bb3a09cf32b35b0b69993e03e99c44e"}, "author": "Michael James", "url": "http://www.canajunfinances.com/2015/07/17/loosest-money-weddings-greece-and-bestmoneystories/comment-page-1/", "ord_in_thread": 0, "title": "Comment on Loosest Money, Weddings, Greece and #BestMoneyStories by Michael James", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \nThe Bank of Canada decided that the best way to wean an economy that is addicted to stimulation is to lower the interest rates ? To be honest, Canada does seem to be in a recession, but lowering Interest Rates is an interesting way to deal with it. Their exact statement about the economy (which they now claim won’t recover until mid-2017): \nThe lower outlook for Canadian growth has increased the downside risks to inflation. While vulnerabilities associated with household imbalances remain elevated and could edge higher, Canada’s economy is undergoing a significant and complex adjustment. Additional monetary stimulus is required at this time to help return the economy to full capacity and inflation sustainably to target. CAD/USD Noon Rate \nWhat did that do to the Canadian Dollar, you might ask? Have a look at this graph (on the right). \nWeddings? Yes, my eldest daughter ( Daughter 1.0 ), was married this past weekend and it was a wonderful event. She looked radiant, and it was interesting to be back in Kitchener. I thought Ottawa’s construction problems were insane, but Kitchener has taken it to a new level, ripping up King Street. \nFor those who have not participated in a wedding as a parent of one of the participants, it is a very different experience, and I was not really ready about how emotionally draining it was, and yet another event that reminds you of your own mortality. \nGreece? Seriously? Who is writing this stuff? Anybody investing in Greece trying to maybe make some quick money? You are? You are NUTS !!! My Writings for Week Ending July 17th \nI was recovering from my daughter’s wedding, so not much new from me this week, but maybe some more helpful family posts : I did do a commentary on the jobs story from last week with More Full Time Jobs in Canada in June , there were actually less jobs total in June. For those who may have missed one of my parenting tip posts, Parenting Tip #327: Large Expenditures (Weddings and Education) . Did I pay for the wedding? An interesting comment from Michael James on the Parenting Tip reminded me I also wrote about Lifestyles with Boomerang Kids , bricking up rooms is an option. You can check out many of my University Cost rants in the RESP section of this site, however, one of my faves is University Costs How Much (I wrote it before my kids went to school). \nI did buy something on Amazon Prime day, but what was the impact of Amazon? The Economist has something for you: Is there such a thing as Economic Ritalin ? \nMark from the Blunt Bean Counter claimed he was taking the summer off, however, it looks like he will leave us with something to read with, The Best of The Blunt Bean Counter – Cottages – Cost Base Additions, are They a New CRA Audit Target? They are a pretty big target, that is for sure. Speaking of the CRA, remember how they pay out is going to change and Government Cheques are Going Away. \nYou do realize that as you age, your career planning goals need to change to, correct? Mark from Second Career search, reminds us of this with, Career Planning for The Over 55 Crowd (I am almost in that bracket). When you retire you will have to change your spending patterns, but Barry from Money We Have wants to know Are you a seasonal spender? No, I squander my funds all year round. In an interesting twist Larry MacDonald did a piece on Tom Drake (another friend of this site) in the Globe and Mail, Financial analyst lowers investing fees with Vanguard and iShares . Stats Canada may publish monthly inflation numbers, but Marie from Boomer and Echo brings us The Real Cost of Living . \nSpeaking of retirement, Michael James takes on a contentious subject, Another Take on Retirement Withdrawal Strategies . There are folks who don’t take inflation into their retirement planning? If you can find anyone who retired in the 70’s, ask how that worked for them. Mark from My Own Advisor continues on his tell-all angle with How I used to sabotage my portfolio , he is a brutally honest man (well worth reading to learn some NOT how to hints). Do you know what your investments are worth? The Canadian Couch Potato wants to help with Calculating Your Portfolio’s Rate of Return . UCCB Changes Explained \nPreet has an older video where he explains the new UCCB rules coming into play, now: How to Survive with No Sleep \nSupplied as a public service announcement 2015 Random Thoughts", "external_links": [], "published": "2015-07-17T16:27:00.000+03:00", "crawled": "2015-07-17T17:21:58.000+03:00", "highlightTitle": ""}