{"organizations": [], "uuid": "820866409c4786089813a81c17a3e41fb4d9ac71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/companies-put-offshore-bond-issues-on-hold/97553", "country": "IE", "title": "Companies put offshore bond issues on hold", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Companies put offshore bond issues on hold | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T09:02:00.000+03:00", "replies_count": 0, "uuid": "820866409c4786089813a81c17a3e41fb4d9ac71"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/companies-put-offshore-bond-issues-on-hold/97553", "ord_in_thread": 0, "title": "Companies put offshore bond issues on hold", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies that had initiated steps to raise funds through overseas bond issuances have put their plans on hold owing to heightened market volatility in the wake of the Greek crisis.\nAdani Ports and Special Economic Zone (APSEZ) and Power Finance Corporation (PFC), having already concluded their investor roadshows, are now waiting on the sidelines for some signs of stability before pricing their issues, said a foreign banker.\n“The two companies received good response from investors during the roadshows. But both the issuers and investors are waiting for some sort of stability in the market,” said the banker.\nThe country’s largest lender, State Bank of India, has reportedly delayed its plans to raise $1.5 billion through an overseas bond issue. The public sector lender’s bond issues attract considerable interest from international investors. The bank managed to raise $1.25 billion in April last year.\nYields on overseas bond issues by SBI and Exim Bank are considered as quasi-sovereign as there is no dollar-based sovereign yield curve for India.\nBond market experts believe unless the markets see some sort of solution to the Greek crisis, it would be difficult to expect much activity in the bond markets.\nKaustubh Kulkarni, managing director & head of debt capital markets, South Asia at Standard Chartered, said Greece is the primary concern as of now and any news regarding the same is a trigger for global markets today.\n“Because of high volatility over the last few weeks, both bond issuers and investors have decided to adopt a wait-and-watch strategy. An active bond market like that of the US has seen a primary issuance after six days, which is indicative of the heightened concerns among market participants,” said Kulkarni.\nEver since the spectre of a Greece default on IMF loan arose, the US treasury yields — based on which overseas bonds are priced — went haywire. The 10-year treasury yield surged to 2.48% levels from 2.17% in a matter of few days before falling back to 2.20% in recent times.\nGreece has now asked for another bailout loan under the European Stability Mechanism ahead of a European Union summit on Sunday. “Unless there is an indication of some solution to the Greek crisis, we will continue to see inactivity in the bond market,” Kulkarni added.\nIndian companies have so far raised close to $7 billion through overseas bonds in CY15 with many issuances attracting good investor interest. Recently, Bharti Airtel raised $1 billion through 10-year bonds at a coupon rate of 4.375%.\n 09, 2015 1:02 am", "external_links": [], "published": "2015-07-09T09:02:00.000+03:00", "crawled": "2015-07-11T01:40:44.000+03:00", "highlightTitle": ""}