{"organizations": ["Vodafone"], "uuid": "0573f245f60f8c7d27d7e01773fb6f44b4fe5c90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/17/590x/Crusader-589242.jpg", "site_section": "http://express.co.uk//posts/rss/21/finance", "section_title": "Daily Express :: Finance Feed", "url": "http://www.express.co.uk/finance/crusader/589242/Crusader-switched-on", "country": "", "title": "Why it pays to be switched on", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Why it pays to be switched on", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T02:00:00.000+03:00", "replies_count": 0, "uuid": "0573f245f60f8c7d27d7e01773fb6f44b4fe5c90"}, "author": "", "url": "http://www.express.co.uk/finance/crusader/589242/Crusader-switched-on", "ord_in_thread": 0, "title": "Why it pays to be switched on", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tony", "Tony Marshall"], "text": "Why it pays to be switched on Why it pays to be switched on NEVER switch off your attention after you switch tariffs or you could be heading for trouble. PUBLISHED: 00:00, Mon, Jul 6, 2015 | UPDATED: 19:53, Mon, Jul 6, 2015 GETTY Always study bills and statements when you change tariffs At this stage, the job is only half done. So always follow through and check statements to ensure the correct new payments have been taken and that all previous direct debits have been cancelled. Trusting that everything has gone through without a hitch, be it for a phone, energy or anything else, is all too easy. Unfortunately, it's an approach that can lead to over-charging errors that quickly multiply and are hard to rectify. It's a tale we hear all too often at Crusader and Tony Marshall's recent experience was a variation on the theme. When he retired two years ago he changed his mobile phone number. In the process, he took up the retailer's offer to put him on a new tariff that would cut his costs in half. But the paperwork was not completed properly and his old direct debit was not cancelled. When Tony picked up the problem earlier this year, he called his network provider, Vodafone, which eventually agreed he was owed about £200 - confirmed by a Vodafone text. But when he found himself waiting ages for the refund, he asked Crusader for help. He said that when he called the company and got through the identity checks, \"I only hear an auto voice and scratchy music. I'm 75 and it is getting me down,\" he told us rather sadly. We asked Vodafone if it could help Tony over the finishing line on this one and he is now relieved to have his money back. Related articles", "external_links": [], "published": "2015-07-06T02:00:00.000+03:00", "crawled": "2015-07-07T00:25:14.000+03:00", "highlightTitle": ""}