{"organizations": [], "uuid": "2047ed42c7ef289b119658fe29b4b5f961a38a36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/29/markets-usa-bonds-idUSL1N1092FJ20150729", "country": "US", "title": "TREASURIES-Prices stay lower after Fed says U.S. economy improving", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "TREASURIES-Prices stay lower after Fed says U.S. economy improving | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T23:08:00.000+03:00", "replies_count": 0, "uuid": "2047ed42c7ef289b119658fe29b4b5f961a38a36"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/29/markets-usa-bonds-idUSL1N1092FJ20150729", "ord_in_thread": 0, "title": "TREASURIES-Prices stay lower after Fed says U.S. economy improving", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts after Fed decision)\n* Fed leaves interest rates unchanged\n* Treasury prices hold steady with modest losses\n* Statement bolsters those arguing for September rate rise\nBy Daniel Bases\nNEW YORK, July 29 (Reuters) - U.S. Treasury prices, which had already lost ground on Wednesday, had little reaction to the Federal Reserve's assessment of an improving U.S. labor market as it kept the door open for an interest rate hike, possibly as soon as September.\nShorter-dated Treasuries initially gained ground on the Fed's statement, which highlighted that the economy had overcome a first-quarter slowdown and was now \"expanding modestly.\" The Fed, as expected, left in place its zero interest rate policy.\n\"It looks like from the statement they slightly upgraded their language on the labor market,\" said Shyam Rajan, head of U.S. interest rate strategy at Bank of America Merrill Lynch.\n\"They slightly lowered the hurdle for a rate hike by adding the word 'some' to their conditions required for further improvement in the labor market. Once the market got wind of that change some of the early dovish interpretation was taken out. Therefore some of the rally in the front end prices faded,\" he said.\nThe Fed, in its policy statement at the close of its two-day meeting, said: \"On balance, a range of labor market indicators suggest that underutilization of labor resources has diminished since early this year.\"\nAfter the initial trading reactions, two-year U.S. Treasuries were nearly unchanged at an interest rate of 0.699 percent.\nThe longer-end of the curve, which is more sensitive to inflation expectations, remained weaker, albeit off their session lows.\nBenchmark 10-year U.S. Treasuries were down 5/32 of a point in price, pushing the yield - which moves in the opposite direction - up to 2.27 percent. Earlier, the 10-year yield hit a session high of 2.29 percent\nThe 30-year Treasury bond lost 10/32 of a point in price with the yield up to 2.98 percent. The yield had reached a session high of 3.03 percent.\nWith no meeting scheduled in August, the Fed will have two months of data to analyze when it meets in September. There were no dissents in Wednesday's vote to leave rates unchanged. The Fed last hiked rates in 2006.\n\"The statement tried to just give an update on the state of the economy, which is showing some modest improvement. It's that simple,\" said Guy Haselmann, head of U.S. interest rate strategy at Scotiabank in New York. \"They were trying not to create extra volatility in a market already on edge, given some challenges in China and the commodity complex. So they didn't want to be disruptive and they weren't.\" (Additional reporting by Michael Conner in New York; Editing by Andrew Hay and Leslie Adler)", "external_links": [], "published": "2015-07-29T23:08:00.000+03:00", "crawled": "2015-07-29T22:15:44.422+03:00", "highlightTitle": ""}