{"organizations": [], "uuid": "0d62a91d640bf8280212699f8dac3364969a7652", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/lifestyle/health/obesity-related-inflammation-may-trigger-type-2-diabetes/111371", "country": "IE", "title": "Obesity-related inflammation may trigger type 2 diabetes", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Obesity-related inflammation may trigger type 2 diabetes | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T20:51:00.000+03:00", "replies_count": 0, "uuid": "0d62a91d640bf8280212699f8dac3364969a7652"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/health/obesity-related-inflammation-may-trigger-type-2-diabetes/111371", "ord_in_thread": 0, "title": "Obesity-related inflammation may trigger type 2 diabetes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles From 'Olaf' to 'Alex,' this mom sure knows how to make food 'fun' Black men likelier to die from prostate cancer than white counterparts Potential 'game-changer' Ebola vaccine proves 100 percent successful in trials Medical researchers have identified a new molecular mechanism which may play a role in development of type 2 diabetes.\nNew research from Harvard T.H. Chan School of Public Health describes a surprising connection between inflammation and endoplasmic reticulum (ER) dysfunction which are known to be involved in the development of type 2 diabetes and suggests that targeting this connection could aid in the development of new therapies for the metabolic disease.\nER function is critical for the liver and other organs to maintain proper glucose levels in the body.\nThe researchers studied liver cells to demonstrate that obesity-associated inflammation can lead to increased production of nitric oxide (NO), a powerful gas that can cripple the ER, a mini-organ inside cells that plays a key role in the synthesis of many proteins and lipids.\nSenior author Gokhan S. Hotamisligil said that the results established that in an environment suffering from chronic inflammation, mini organs lose their vitality through a specific link that was identified in their study, and suggested that therapies that target inflammatory pathways, including nitric oxide production, could be effective strategies in the treatment of metabolic disease.\nIn the presence of obesity, the ER is unable to initiate a cascade of intracellular events called the unfolded protein response (UPR), which relieves ER stress and restores function. The new study states that the sequence might be the opposite, it is obesity-related inflammation that impairs the UPR response and thus ER function.\nIn an innovative approach, the researchers engineered a form of IRE1 that could not be modified by NO, and found that it protected against the detrimental consequences of inflammation and improved metabolic control in obese mice.\nThe study is published in the journal Science.\nFirst Published on July 31, 2015 12:51 pm", "external_links": [], "published": "2015-07-31T20:51:00.000+03:00", "crawled": "2015-07-31T18:26:11.085+03:00", "highlightTitle": ""}