{"organizations": [], "uuid": "6f22feb212099df42ab274f446fbf01815dc71a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/b/8/8/6/image.related.afrArticleLead.620x365.gib8fu.png/1436783388348.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/world/middle-east/iran-poised-to-reengage-with-major-trading-nations-as-nuclear-deal-comes-close-20150713-gib8fu", "country": "AU", "title": "Iran poised to re-engage with major trading nations as nuclear deal comes close", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Iran poised to re-engage with major trading nations as nuclear deal comes close | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T15:46:00.000+03:00", "replies_count": 0, "uuid": "6f22feb212099df42ab274f446fbf01815dc71a5"}, "author": "Tony Walker", "url": "http://www.afr.com/news/world/middle-east/iran-poised-to-reengage-with-major-trading-nations-as-nuclear-deal-comes-close-20150713-gib8fu", "ord_in_thread": 0, "title": "Iran poised to re-engage with major trading nations as nuclear deal comes close", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Iranian Foreign Minister Mohammad Javad Zarif gestures as he talks with a journalist. Critical points of difference with the US included lifting of sanctions and continuation of arms and ballistic missile bans. Reuters Share on twitter by Tony Walker As the world contemplates a nuclear deal between the United States, its fellow United Nations Security Council members and Iran, the importance of such an agreement can hardly be overstated.\nWhat is at stake is a way forward in attempts to freeze an Iranian nuclear program that is threatening a nuclear arms race in the Middle East.\nUS President Barack Obama has staked his own foreign policy legacy to an extent on a successful conclusion of negotiations in Vienna, involving Iranian Foreign Minister Mohammad Javad Zarif, the US and representatives of the UN Security Council.\nHe will face determined opposition in the Senate to an Iran nuclear deal, in wrangling that could go on for days if not weeks.\nCongressional approval would be required for an end to sanctions that have been ramped up over the past decade.\nThe UN Security Council will also need to fashion a new resolution – or resolutions – to unwind sanctions.\nThe president is invested heavily in an agreement with Iran that would push any requirement to consider a military option against Iran's nuclear facilities well into the next administration.\nInevitably, an agreement with Iran, under whatever terms, will become an issue in American presidential-year politics, with a likely conservative push-back against the terms of a deal that does not require Iran to fully dismantle its nuclear program.\n Israel's Prime Minister Benjamin Netanyahu has been a vociferous critic of any negotiated outcome that stands the remotest chance of securing Iran's agreement. He enjoys the support of powerful figures in Congress.\nIt would be stretching a point to liken a breakthrough agreement with Tehran with president Richard Nixon's opening to China in 1972, but the possibility of a normalisation of relations between the US and Iran would be a Middle East event of unusual significance.\nNot that any such breakthrough would ensure an end to a tense relationship between Washington and Tehran over a range of issues, including Iran's support for groups such as Hezbollah in Lebanon, which the US regards as a terrorist organisation.\nIran's backing for militant Shiite groups such as the Houthis in Yemen is also a continuing source of tension between Tehran and Washington, and US allies in the Gulf.\nBig step A nuclear deal would be merely an early step – albeit a big one – towards improved relations, severed following the fall of the Shah in 1979.\nWhat cannot be excluded is that such a deal would shift a Middle East power balance in which Iran's aspirations as a regional super-power were enhanced at the expense of the Saudi Arabian-led block.\nSaudi Arabia and its moderate Arab allies are viewing with suspicion any deal that would enable Iran to maintain the option of converting itself from a nuclear threshold to a nuclear-capable state.\nUnder the terms of the Vienna agreement Iran would remain a nuclear \"threshold\" state, but that threshold would be extended beyond the current 2-3 months, out possibly to a year, or more.\nOutstanding issues have included the timing of the lifting of sanctions and the continuation of arms and ballistic missiles bans. The Vienna talks have missed three deadlines, and have dragged on for weeks.\nNegotiators say a negotiating document, which has stretched to 100 pages from 80, would deal with an inspections regime and a phased removal of sanctions.\nWestern business is poised to re-enter the Iranian market to take advantage of opportunities, principally in the energy sector.\nBut wider possibilities also present themselves in an economy buffeted by sanctions over more than a decade. Iran's long-running war with Iraq between 1980 and 1988 took its toll.\nIn the end, any agreement struck by Iranian negotiators in Vienna will need to be approved by Iran's supreme leader Ayatollah Khamenei.\nIn a pronouncement at the weekend, Mr Khamenei described the US as the \"ultimate embodiment of arrogance\". He advised Iranians to \"get ready to continue combating the arrogant power\".\nThese remarks might have been read as a last hurrah before sanctioning an agreement with the \"Great Satan\", or a leader taking out a bit of insurance in case the talks fall over at the last minute.\nEither way, old rhetoric dies hard.\nTony Walker is the AFR's International Editor", "external_links": ["https://twitter.com/http://twitter.com/tonywalker1"], "published": "2015-07-13T15:46:00.000+03:00", "crawled": "2015-07-13T21:07:43.000+03:00", "highlightTitle": ""}