{"organizations": [], "uuid": "95d1123590bf9c18da948f1981e5503550afbf14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/23/590x/football-prices-594429.jpg", "site_section": "http://express.co.uk//posts/rss/23/personalfinance", "section_title": "Daily Express :: Personal Finance Feed", "url": "http://www.express.co.uk/finance/personalfinance/594429/How-to-watch-football-on-Sky-and-BT-for-the-cheapest-possible-price", "country": "", "title": "How to watch football on Sky and BT for the cheapest possible price", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "How to watch football on Sky and BT for the cheapest possible price", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T19:26:00.000+03:00", "replies_count": 0, "uuid": "95d1123590bf9c18da948f1981e5503550afbf14"}, "author": "", "url": "http://www.express.co.uk/finance/personalfinance/594429/How-to-watch-football-on-Sky-and-BT-for-the-cheapest-possible-price", "ord_in_thread": 0, "title": "How to watch football on Sky and BT for the cheapest possible price", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How to watch football on Sky and BT for the cheapest possible price How to watch football on Sky and BT for the cheapest possible price AS the new season approaches, football fans across the country will soon be wondering how to lock in the cheapest deals to watch matches - and they face a bewildering array of options. PUBLISHED: 17:26, Tue, Jul 28, 2015 | UPDATED: 17:45, Tue, Jul 28, 2015 GETTY Don't pay more than you need to watch the game \nGames are actually around 20 per cent cheaper for viewers to watch than last year, despite the huge costs paid by broadcasters to show matches, according to analysis by comparethemarket.com.Overall, BT is the cheapest option for viewers who expect to watch every one of the 154 televised games in the 2015/16 season, including live UEFA Champions League. The package gives access to matches shown on Sky Sports and BT Sport and works out at £3.27 a game or a total of £503.83. Virgin offers a smiler package but games work out as £3.99, or a total cost of £613.95, found comparethemarket.com. Pay less if you include broadband and go through a cashback site However, you can pay less to watch football if you take out broadband through BT at the same time.If you are already a BT broadband customer you can add the BT Sport Pack, which include the UEFA Champions League and Europa League for £5 a month (£60 a year). BT broadband deals start from around £23.74 a month (£284.85 a year) and would take the entire cost including Sport to £344.85 a year. However, you can currently get a cashback deal through Quidco, which would take the entire cost for BT Broadband plus TV (including sport) to £178.88 a year. The deal includes unlimited fibre broadband use and weekend calls and to qualify you'll need to sign up to BT's Unlimited Infinity 1 deal through Quidco. The deal costs £26.99 a month (including line rental), plus a £35 activation fee, taking the total to £258.88 - however you'll get £180 in cashback from Quidco to bring the overall cost to £178.88.You can then add Sky Sports for an additional £22 a month (£264 a year) to bring the total cost to £442.88. Alternatively, you can use Now TV to buy day, week or month passes to watch Sky Sports - prices start at £6.99, £10.99 and £31.99 a month respectively - and if you're a new customer you'll get £8 back if you buy through Quidco. Related articles The simple loopholes that mean you don't have to pay the TV... \nOn the other hand, fans who are happy to just see games shown by Sky Sports, which doesn't include games UEFA Champions League, can opt for a Virgin Media package which is £433.95 a year - £69.88 a year less than the BT equivalent package - and equals £3.44 a game, according to comparethemarket.com. James Padmore, head of utilities, comparethemarket.com, said: \"With the season approaching and the transfer market heating up, football fans will be eager to find the best deal to enable them to follow all the action. \"With BT becoming a bigger player in the market, the increased competition seems to be helping in significantly reducing the average cost per game and annual fees for TV packages. “When preparing for this season, make sure that you are on the latest deals, as these could be cheaper than older packages.\" Related articles", "external_links": [], "published": "2015-07-28T19:26:00.000+03:00", "crawled": "2015-07-29T09:15:00.803+03:00", "highlightTitle": ""}