{"organizations": ["El Palacio de Hierro Department Stores"], "uuid": "7b1a301bcb5dcd7c4cdb5908a473511abbda9e98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=MAT", "section_title": "Yahoo! Finance: MAT News", "url": "http://finance.yahoo.com/news/american-girl-opens-doors-first-100000058.html", "country": "US", "title": "American Girl Opens Its Doors for the First Time in Mexico with El Palacio De Hierro", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "American Girl Opens Its Doors for the First Time in Mexico with El Palacio De Hierro", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T13:00:00.000+03:00", "replies_count": 0, "uuid": "7b1a301bcb5dcd7c4cdb5908a473511abbda9e98"}, "author": "", "url": "http://finance.yahoo.com/news/american-girl-opens-doors-first-100000058.html", "ord_in_thread": 0, "title": "American Girl Opens Its Doors for the First Time in Mexico with El Palacio De Hierro", "locations": ["Mexico", "Interlomas", "Benefit Mexico"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "American Girl Opens Its Doors for the First Time in Mexico with El Palacio De Hierro New Boutiques Open July 4 th at El Palacio de Hierro Department Stores in Interlomas and Perisur. Grand Opening Events to Benefit Mexico’s Make-A-Wish Foundation. American Girl 3 hours ago  Done \nMIDDLETON, Wis.--(BUSINESS WIRE)-- \nAmerican Girl, a subsidiary of Mattel, Inc. ( MAT ), is pleased to announce the grand opening of its first-ever American Girl shop-in-shop boutiques in Mexico with El Palacio de Hierro, the country’s largest and best-established high-end retailer. Located at El Palacio de Hierro Interlomas and Perisur locations, the new boutiques, ranging in size from 1,500- to 2,000-square feet, open Saturday, July 4, 2015, and mark the second international retail presence for American Girl. \n“We’re delighted to partner with El Palacio de Hierro to bring the American Girl experience to girls and their families in Mexico for the first time,” said Jean McKenzie, president of American Girl. “Our locations at El Palacio de Hierro beautifully showcase our brand and are sure to become popular family destinations. We look forward to a new audience of fans joining our celebration of girls and all that they can be.” \n“We are happy to have a brand like American Girl at El Palacio de Hierro; it is an honor to reach our market through this incredible brand. We are confident that we will have a great impact where we will be promoting values in a fun way,” said Ernesto Izquierdo, commercial director of El Palacio de Hierro. \nThe American Girl boutiques will feature a curated assortment of dolls from the company’s Girl of the Year ™ and Truly Me ™ collections, as well as an occasional spotlight character from the historical BeForever ™ line. The new boutiques will also include a selection of popular doll accessories and Dress Like Your Doll ™ girl-sized clothing, plus a variety of American Girl’s best-selling books , the 2015 Girl of the Year movie , and American Girl ® magazine —all available in Spanish. Beyond shopping, girls can also treat their dolls to a new hairstyle or ear piercing at the signature Doll Hair Salon and participate in girl-friendly events throughout the year. \nAmerican Girl’s expansion into Mexico amplifies Mattel’s decades-long presence in the country and its commitment to making a meaningful difference in the lives of children and families there. In addition to employing thousands, Mattel has built homes and schools for children with disabilities and has made significant monetary and toy donations to local communities and organizations that serve children. Most recently in Mexico City, Mattel provided a grant of $80,000 to Save the Children to help improve reading, writing, and socio-emotional skills at five elementary schools, and $20,000 to Make-A-Wish Mexico to help grant wishes for children with life-threatening medical conditions. Make-A-Wish is Mattel’s largest philanthropic non-profit partner in Mexico City, as well as the beneficiary of American Girl’s grand opening events at Interlomas and Perisur on July 3 rd and 4 th respectively. \nABOUT AMERICAN GIRL \nAmerican Girl is a premium brand for girls and a wholly owned subsidiary of Mattel, Inc. (NASDAQ:MAT, mattel.com ). The Mattel family of companies is the worldwide leader in the design, manufacture, and marketing of toys and family products. Since its inception in 1986, American Girl has been devoted to celebrating girls ages 3 to 12 through age-appropriate, high-quality dolls and accessories, books, clothes, movies, and unforgettable experiences. Best-selling lines include Truly Me ™ , Girl of the Year ™ , Bitty Baby ™ , and the classic historical character line BeForever ™ . Headquartered in Middleton, WI, the company sells products exclusively at americangirl.com ; at all American Girl retail locations nationwide; through American Girl’s award-winning catalogue; and at American Girl specialty boutiques at select Indigo ™ and Chapters ™ locations in Canada and at El Palacio de Hierro Interlomas and Perisur locations in Mexico. By inspiring girls to be their best, American Girl has earned the loyalty of millions of girls and the praise and trust of parents and educators. To learn more about American Girl, visit americangirl.com , facebook.com/americangirl , or twitter.com/american_girl . To request a free catalogue, call 1-800-845-0005. \nABOUT EL PALACIO DE HIERRO \nEstablished in 1888, El Palacio de Hierro is owned by the Bal Group and is the point of reference in Mexico when it comes to style and trends. The retailer has 13 stores, eight in Mexico City and the metropolitan area and the remainder in Puebla, Monterrey, Guadalajara, Villahermosa and Queretaro, as well as Casa Palacio Antara and Santa Fe, and concept store La Boutique Palacio in Acoxpa, Acapulco, and Cancun. \nCoined in 1996 by the president of Bal Group, Don Alberto Baillères, the iconic phrase “Soy Totalmente Palacio” (I’m Totally Palacio) has become the DNA of its corporate culture. \nExclusive distributor of brands including Burberry, CH Carolina Herrera, Tiffany & Co, H.Stern, Christian Dior, Loewe, and Strategic Commercial Partner of the main brands at LVMH Group, Kering, Estee Lauder, L’Oréal and Richmont, and owner of Mango, Springfield, Bebe, Aldo, UGG® Australia, Tory Burch, and Michael Kors boutiques, El Palacio de Hierro has been able to create a true “Totally Palacio” lifestyle. www.elpalaciodehierro.com \nMAT-AG View source version on businesswire.com: http://www.businesswire.com/news/home/20150702005103/en/ Consumer Discretionary", "external_links": [], "published": "2015-07-02T13:00:00.000+03:00", "crawled": "2015-07-02T16:54:14.000+03:00", "highlightTitle": ""}