{"organizations": [], "uuid": "995fe0657769ced1cc57a2ad96969110377863c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/HMYvfei2szGahD_601xQeg--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/storage-tanks-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/energy-wholesale-costs-five-low-054032895.html", "country": "US", "title": "Energy: Wholesale Costs 'At Five-Year Low'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Energy: Wholesale Costs 'At Five-Year Low'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T09:04:00.000+03:00", "replies_count": 0, "uuid": "995fe0657769ced1cc57a2ad96969110377863c5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/energy-wholesale-costs-five-low-054032895.html", "ord_in_thread": 0, "title": "Energy: Wholesale Costs 'At Five-Year Low'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nEnergy firms are being urged to slash their bills further following the publication of a report suggesting wholesale prices are at their lowest quarterly average for five years. \nThe market pricing body, ICIS, cited steep falls in the price of oil over the past year and strong supply from liquefied natural gas earlier in 2015. \nHowever, its report predicted the falls in wholesale prices would stall in the third quarter of the year, largely because the UK was holding less gas in storage and continental gas markets may need more supply from the UK. \nZoe Double, head of power at ICIS, said: \"The falling oil price and the currency impact from ‘Grexit’ ( Greek exit from the eurozone ) fears are pushing down UK gas prices, and the effects are clear on the UK power price as well. \n\"The UK continues to draw liquefied natural gas from all over the world, as the number of trading counterparties means Britain can absorb more than other markets. \n\"Meanwhile, power prices are coming down as more renewable generation is installed.\" \nThe cost of raw energy makes up about 50% of an energy bill. \nEnergy firms responded to the falls of more than 50% in oil prices earlier this year by trimming standard tariffs by between 3% and 5%. \nThe report was released just days before the Competition and Markets Authority is due to publish the preliminary findings of its investigation into the UK market . \nAnn Robinson, director of consumer policy at uSwitch.com, said of the conclusions by ICIS: \"Cuts by the big six suppliers earlier this year were mere token gestures, leaving the average standard tariff customer a mere £28 a year better off. \n\"Now (NYSE: DNOW - news ) is the time for suppliers to do the right thing by passing on proper, double-digit reductions that better reflect falling wholesale costs. \n\"If the market was working properly, competition would be driving suppliers to cut their prices at any opportunity in order to attract new customers. \n\"All eyes will be on the Competition and Markets Authority next week when it publishes its recommendations on how to boost competition.\"", "external_links": [], "published": "2015-07-03T09:04:00.000+03:00", "crawled": "2015-07-03T09:19:23.000+03:00", "highlightTitle": ""}