{"organizations": ["Army"], "uuid": "6a7f6dc905df54432a4c7fd6a105e21dbd750c70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507010422.html", "country": "US", "title": "South Africa: Apron Buses Got Duty Exemption from KRA – Firm", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Apron Buses Got Duty Exemption from KRA – Firm", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T11:37:00.000+03:00", "replies_count": 0, "uuid": "6a7f6dc905df54432a4c7fd6a105e21dbd750c70"}, "author": "", "url": "http://allafrica.com/stories/201507010422.html", "ord_in_thread": 0, "title": "South Africa: Apron Buses Got Duty Exemption from KRA – Firm", "locations": ["Malawi", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malawi: Army, FAM Sued Over Football Fan's Death Following Assault \n“Relief and Mission Logistics wishes to refute claims reported in the media about the apron buses provided by the firm. KRA provided clearance and exemption for the buses vide the attached letter under 5th schedule Part B, item 1(b) (IV) of the EAC Customs Management Act,” he stated. \nThe company is now seeking audience with the Parliamentary Committee on Transport to clarify the matter after KAA’s Director Kevin Kihara made the accusations. \nA letter from the Kenya Revenue Authority revealed that an application was made by the firm seeking duty exemption for one of the buses. \n“We have received an application letter dated 18th September, 2014 from Ms Relief & Mission Logistics seeking exemption of duty on an apron bus they are importing for the sole use at JKIA. Ms Relief and Mission is a contracted passenger transfer services provider by the Kenya Airports Authority vide letter Ref; KAA /JKIA/752 dated 9th May, 2014,” the letter stated. \nThe letter further indicated that the bus was cleared to be imported duty free. \n“They are importing an apron bus for conveyance of passengers at the runway. Details of the consignment are contained in invoice No:- 290028733 dated 20th June, 2014. You are therefore advised to allow clearance of the equipment on duty free basis in accordance with the provisions of the 5th schedule Part B item 1 (b) (iv) of the East African Community Customs Management Act, 2004,” it stated. \nThe saga has cost three top KAA officials their jobs, including Lucy Mbugua who was sacked from the Managing Director’s post. \nThe contract for the buses operation at the airport was cancelled last week by KAA Chairman David Kimaiyo. \nOn Tuesday, Kihara said the concessionaire did not pay the requisite duty to the Kenya Revenue Authority. \nKihara said one shuttle bus made by Portuguese manufacturer – Cobus Industries – costs about Sh45 million, according to copies of invoices and Kenya Revenue Authority (KRA) tax receipts. \nHe told the Parliamentary Transport Committee, that the sacked MD did not also get approval of the board in undertaking the project. \nKAA Chairman David Kimaiyo told the committee that the concessionaire – Relief & Mission Logistics – had invoiced the authority some Sh42 million. South Africa \nThe government has sold its 13.91% stake in Vodacom to the Public Investment Corporation to help fund the R23bn … see more » Copyright © 2015 Capital FM. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-01T11:37:00.000+03:00", "crawled": "2015-07-01T14:37:41.000+03:00", "highlightTitle": ""}