{"organizations": [], "uuid": "c5217187aa92b683e47c9f0a4560c76def44faa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/alent-plc-jumps-over-40-084954081.html", "country": "GB", "title": "Alent PLC Jumps Over 40% On £1.4bn Offer From Platform Specialty Products Corp", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Alent PLC Jumps Over 40% On £1.4bn Offer From Platform Specialty Products Corp", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T12:52:00.000+03:00", "replies_count": 0, "uuid": "c5217187aa92b683e47c9f0a4560c76def44faa3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/alent-plc-jumps-over-40-084954081.html", "ord_in_thread": 0, "title": "Alent PLC Jumps Over 40% On £1.4bn Offer From Platform Specialty Products Corp", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Jul 13, 2015, 11:06 BST - UK Markets close in 5 hrs 24 mins Alent PLC Jumps Over 40% On £1.4bn Offer From Platform Specialty Products Corp By Rupert Hargreaves | Fool.co.uk – 13 minutes ago 488.90 +151.2000 \nAlent (LSE: ALNT) has fallen prey to Platform Specialty Products Corp after the US group made a 503p per share cash offer for FTSE 250 chemicals company. \nPlatform Specialty is a chemicals industry consolidation vehicle -- a cash shell, in other words -- which is going around acquiring undervalued businesses in the chemical industry, and rolling them into one group. \nThe industry consolidator is willing to pay a hefty premium for its targets. Today's offer for Alent is 49% above Alent's Friday closing price of 338p. Alent's shareholders will have the option to receive to receive shares in the new company in lieu of cash, up to 21.9% of the new entity's issued share capital. \nAnd taking a portion of the offer in stock might be a sensible decision for Alent's shareholders. Platform Specialty is well placed for long-term growth. \nCost saving synergies \nAs a standalone company, City analysts had expected Alent to report earnings per share growth of around 10% per annum during 2016 and again in 2017. A combination of cost savings, revenue growth and margin expansion were expected to help Alent to grow pre-tax profit by 44% during the next two years. \nAs part of the larger Platform Specialty group, Alent should be able to achieve significant cost efficiencies, widening margins further. Platform reckons the combined group can achieve annual pre-tax cost synergies of at least $50m. \nWhat's more, Platform already owns MacDermid Inc., a specialty chemicals company that is a direct competitor of Alent's US-based Enthone division that produces coatings for mobile phones and cars. \nSo, there's more to this deal than just simple cost-saving synergies. Platform Specialty is removing a key competitor from the market and increasing production simultaneously. However, as the deal will create a company that has a certain amount of control over key markets, it will require antitrust approval. \nRapid growth \nPlatform Specialty's strategy is to buy companies that are leaders in niche businesses and require little capital investment. These companies usually generate a large amount of cash, which can be used for future bolt-on acquisitions to further boost growth. \nIndeed, over the past 12 months Platform Specialty has been on an acquisition spree, rolling up several smaller peers into its group structure. \nThis bolt-on strategy is set to achieve results. According to Wall Street analysts, before today's announcement Platform Specialty's earnings per share were on track to jump 83% during 2016 and 24% during 2017. The acquisition of Alent should only boost this growth. \nUsing Wall Street estimates, Platform Specialty's shares that trade on the New York Stock Exchange are currently trading at a 2017 P/E of 11.7. \nThe bottom line \nAll in all, Platform Specialty's offer to buy Alent looks to be a great deal for shareholders. Shareholders are receiving a hefty premium for their shares, and the enlarged Platform Specialty will be well placed to generate rapid growth in the short-term as synergies flow through, and the company dominates key markets. \nBut if Platform Specialty is not for you, or you're concerned about investing overseas, The Motley Fool's top analysts have recently identified a company that they consider to be one of the market's \"top small caps\" . \nOur analysts reckon that the shares of this company could have a potential upside of 45%! And the company in question has a strong cash balance, proven advantage and is supported by some of the biggest players in its industry. \nAll is revealed in our new free report entitled \"Is This Stock Tomorrow's Big Winner?\" \nDon't delay, download the free report today -- but hurry, it's only available for a limited time. \nRupert Hargreaves has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-13T12:52:00.000+03:00", "crawled": "2015-07-13T13:07:40.000+03:00", "highlightTitle": ""}