{"organizations": [], "uuid": "86ee4fa29975b3ee0f43fc91c56ffbb2376d614e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/b/4/m/8/image.related.afrArticleLead.620x365.ghr2xo.png/1438284193058.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/afr-magazine/luxury-brands-become-victims-of-chinas-clampdown-on-conspicuous-consumption-20150730-ghr2xo", "country": "AU", "title": "Luxury brands, casino developers victims of China's austerity crackdown", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Luxury brands, casino developers victims of China's austerity crackdown | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T22:00:00.000+03:00", "replies_count": 0, "uuid": "86ee4fa29975b3ee0f43fc91c56ffbb2376d614e"}, "author": "afr.com", "url": "http://www.afr.com/brand/afr-magazine/luxury-brands-become-victims-of-chinas-clampdown-on-conspicuous-consumption-20150730-ghr2xo", "ord_in_thread": 0, "title": "Luxury brands, casino developers victims of China's austerity crackdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Luxury goods retailer Patricia Cheong: “There are fewer customers now and everyone is fighting for them.” Carmo Correia by Lisa Murray Angus Grigg At the Wynn Casino in Macau, with its gleaming bronze facade, the heavens open every half hour. A giant golden dragon rises through the lobby and breathes fire into the sky as tourists, gamblers and shoppers look on, their smartphones suspended high in the air recording the spectacle.\nWhile it’s a dramatic show, amplified by the latest in lighting and special effects, the real action takes place down the hall. Along a white marble corridor, inlaid with heavy red carpet, lies a strip of 28 luxury shops. All the usual names are there – Louis Vuitton, Chanel, Bulgari and Prada – packed tightly together and broken up only by a smoking balcony, cash machine and jellyfish aquarium.\nBut there is nothing usual about this collection of boutiques. For a time this strip of shops sat at the very apex of global consumption. It was the most lucrative strip of luxury shops on the planet. “In terms of sales per square foot, it was the best in the world,” says Hong Kong-based financial analyst Aaron Fischer, who has been researching the global luxury goods market for more than 15 years. He estimates these shops collectively generated $US1 billion ($1.28 billion) in sales in 2013, when more than 18 million visitors from the Chinese mainland made their way to the former Portuguese colony to gamble and shop. They poured into Macau because the taxes on luxury goods are lower there and because it is the only place in China where casinos are legal.\nFischer, who works at investment bank CLSA, says “power brands” such as Louis Vuitton, Prada and Hermès were generating annual sales of about $US100 million at their stores on this strip during the peak.\nThe golden dragon feature inside the Wynn Casino at Macau draws a crowd. Carmo Correia Then the world changed. Suddenly, Macau, long acknowledged as a convenient place for mainlanders to move money out of the country, found itself at the centre of the Chinese government’s anti-corruption campaign, which had been introduced shortly after President Xi Jinping assumed power in November 2012. For the first year, the edicts from Beijing banning officials’ spending on lavish gifts, first-class travel, gambling at casinos, five-star hotels and sumptuous banquets failed to make a mark almost 2000 kilometres away in Macau. But after record gaming revenue and luxury sales in 2013, the messages began arriving the following year.\nImpact on Australia And they were heard as far away as Melbourne. Australia’s biggest casino operator, James Packer, watched as the VIP gaming revenue at his Macau joint venture, Melco Crown, began to slide . By the end of this year it will be down by $US1.6 billion, according to CLSA. As Packer admitted to CNBC in May: “The slowdown in Macau is more severe than, probably in truth, any of the operators foresaw.”\nFor luxury retailers, the impact was more delayed. It took a visit from the Chinese President at the end of last year to drive the news home. He made it clear the days of lavish displays of wealth and carefree gambling at casinos by officials were over.\n The mall of luxury goods shops inside the Wynn Macau where sales have plummeted. Carmo Correia “I can remember the exact day it changed,” one luxury store manager, who prefers to remain unnamed, says. “It was December 19, the day Xi Jinping arrived in Macau. Business was great during the first two weeks of December but in the last two weeks we should not have bothered opening.”\nOfficial figures back up this claim of a sudden change. From annualised growth of 28 per cent in November 2014, tourism to Macau from mainland China turned negative in January 2015, dropping 1 per cent. Gaming revenue fell 17 per cent and 49 per cent respectively for the first two months of the year, compared with the same period in 2014, and luxury goods retailers say sales went into freefall. Managers of three luxury stores told the AFR Magazine sales were down about 40 per cent so far in 2015.\nPut simply, Macau became ground zero for Xi’s anti-corruption and austerity drive , which has endured longer and had a broader impact than anyone predicted. It has struck fear into the hearts of local government officials, ministers, former political leaders, army generals and state-owned company chief executives. And it has changed the way the economy operates, affecting everything from property deals to liquor sales.\nIt has also thrown China’s political system into turmoil, as the new leadership team under Xi takes on powerful and privileged interest groups. “This is a fight for survival,” says Huang Jing, from the Lee Kuan Yew School of Public Policy at the National University of Singapore. “Neither side can afford to compromise.”\nThe Wynn Casino. Macau, long acknowledged as a convenient place for mainlanders to move money out of the country, found itself at the centre of the Chinese government’s anti-corruption campaign. Carmo Correia Impact on Macau The campaign took shape in December 2012, when the government released a set of rules on how officials were to conduct themselves with the aim of removing showy displays of excess and restoring the Communist Party’s reputation. No more red carpets or expensive banquets to mark government events, overseas visits were to be short and delegations small, cadres should not have expensive cars or big houses, and officials were banned from accepting gifts or using public funds to buy presents for those in other departments.\nIn a blow for Macau, officials were explicitly “prohibited from organising and taking part in any gambling activities”.\nMore importantly, lest anyone suspect the new rules were just for show, the government began a series of corruption investigations. Over the past two and a half years, as a result of the campaign, more than 250,000 party cadres, including 56 officials ranked at or above the level of vice-minister, have been sacked, demoted, investigated or punished.\nInitially it looked like Macau, which last year overtook Switzerland to become the world’s fourth richest territory per person in the world, would escape the fallout from this battle. But in the end it became one of the most important fronts, as officials feared even entering the gambling precinct and having their financial transactions scrutinised. “Macau will continue but it will no longer be a place to go where money changes hands or where you can launder your money,” says Huang. “It will have to do legitimate, fair business.”\nCLSA’s Fischer estimates the anti-corruption campaign has wiped $US10 billion from Macau’s economy, based on gaming revenue alone. Across the whole of China, the impact of the campaign is estimated at 10-times that amount.\n“Since June and July last year, it started getting obvious there were less high-rollers and customers were choosing goods with smaller price tags,” says Patricia Cheong, a former Miss Macau who owns and runs a luxury goods company that caters to private VIP gaming rooms in top casinos. “When Xi was here he emphasised the point that the anti-corruption campaign won’t stop or slow down any time soon.”\nUntil the President’s visit to mark the 15th anniversary of the return of Macau to Chinese control, casino operators and luxury retailers had hoped the campaign would run its course and business would return to normal. But Xi made it very clear on that rainy day in December that it would be an enduring feature of his term in office.\nSign of things to come Two years before Xi visited Macau, seven men walked on to a stage at Beijing’s Great Hall of the People. It was November 15, 2012, and a rare moment of political theatre in China. Every 10 years, power is handed to the next generation and while it was widely known Xi Jinping and current Premier Li Keqiang would be first and second onto the stage, the make-up and rank of the remaining five positions on China’s top leadership body, the Politburo Standing Committee, was still the subject of much speculation.\nIn sixth place, the only man in a blue tie (all the others wore red) was Wang Qishan. The initial analysis was that Wang, now 67, who had a strong track record on foreign policy and the economy, had missed out. Rather than a high-profile role heading China’s financial reform agenda, the man known as the fire chief in the party for his trouble-shooting capabilities was put in charge of the Central Commission for Discipline Inspection (CCDI).\nAt the time, there was no hint of the clout that position would carry but many long-time China watchers today regard Wang as the country’s second-most powerful man. “Xi Jinping’s close relationship with Wang Qishan has arguably been the most important factor in the consolidation of Xi’s power and the implementation of his new policy initiatives since the political succession,” prominent China expert Cheng Li, from the Brookings Institute, wrote in a paper about Xi’s inner circle.\nWang has a long-established reputation as the go-to man in the party. When Beijing faced an outbreak of severe acute respiratory syndrome (SARS) in 2003, he was appointed mayor. He was on the steering committee of the 2008 Olympic Games which showcased China to the world and before that, he had proven his financial credentials by cleaning up Guangdong’s debt problems in the late 1990s. Xi and Wang have also been close friends since their teenage years. They spent time together after being sent to neighbouring counties in Shaanxi province as part of Mao Zedong’s program to re-educate youths in the countryside during the Cultural Revolution.\nStill, the pair’s anti-corruption drive is treated with cynicism by some political experts, who regard it as an old-fashioned Communist Party purge; a way for Xi to dispense with rivals. They also point out the CCDI is an internal party organisation with no judicial oversight and a reputation for using harsh interrogation methods. “He has used the anti-corruption campaign to take out political enemies at high levels,” says Willy Lam, a professor at the Chinese University of Hong Kong. It’s a compelling argument given the two biggest names to be taken down so far are Bo Xilai, a charismatic politician who at one time was considered a candidate for the party’s top leadership body and Xi’s chief rival, and Zhou Yongkang, the powerful former public security chief and a strong supporter of Bo. Zhou’s corruption conviction in June following a secret trial, which resulted in a life sentence, broke an unwritten rule of indemnity for retired party leaders. Bo, too, is serving life in prison.\nThere’s little doubt both men had used their positions to amass large fortunes but their downfalls also enabled Xi to consolidate power. At the same time, the longer the campaign goes on, the more people are starting to view Xi and Wang’s efforts as part of a long-term plan to clean up government and fight off an existential threat for the party.\nChange to China's economy When Xi took over as Communist Party chief, most China analysts were focused on how his new team would address the slowing economy after three decades of turbo-charged double-digit growth. However, in hindsight perhaps it’s not surprising the anti-corruption campaign became his signature policy. He came to power just as news headlines were dominated by the bad behaviour and lavish lifestyles of the political elite. The Bo Xilai scandal was breaking, which included revelations of a $US4.5 million villa in France, an all-expenses-paid safari trip to Africa and a son educated at the elite Harrow School and Oxford University in the UK, followed by Harvard in the US.\nThe most eye-catching story to hit the front pages in the months leading up to the leadership transition was a Ferrari crash involving the son of Ling Jihua, a close political adviser to Xi’s predecessor Hu Jintao. The son was killed, while two female passengers were badly injured. All three were reportedly “scantily clad” when the crash occurred.\nWhile these were the extreme examples of power and privilege, almost more galling for the general public were the numerous reports of low- to mid-level officials living it up. A photograph of a local mayor and his two deputies in the south-eastern city of Wenzhou went viral after bloggers noticed they wore Hermès belts. And netizens actively went after an official in Shaanxi province, who was pictured with an untimely grin at the scene of a horrific bus crash that killed 36 people; they dug out photos of Yang Dacai wearing five different luxury watches. These were then posted online and eventually he was jailed for 14 years for corruption.\nBefore handing over the reins to Xi, Hu Jintao, who did little to address the problem himself, warned in his last major speech that no one was above the law and failure to tackle corruption “could prove fatal to the party and even cause the collapse of the party and the fall of the state”.\nBut no one knew how seriously Xi and his new team would take the warning. “It has changed China’s economy,” says academic Huang. “It has made people reduce their rent-seeking behaviour and made economic transactions more transparent.”\nIn 2008, four years before Xi took over, China was preparing for the Beijing Olympics. It was a chance to show off the emerging superpower to the world and the capital hosted an endless series of networking events. Companies wanting to impress decision makers and ambitious officials looking to get ahead in their careers went on a gift-buying frenzy. Luxury goods companies started to do a roaring trade.\nSun Duofei, who owns an online shopping website called The Fifth Avenue, says China has always had a gift-giving culture but people started spending more money during the Olympics and officials began demanding only the best brands. She says it was not uncommon for people to buy 10 Swiss watches or Chanel bags and up to 60 Hermès scarves to give to their contacts. “Between 2010 and 2012 was the peak time for luxury goods to be given as gifts,” Sun says. “Around that time, there were lots of new rich created from the coal and iron ore boom and property speculation.”\nRich with no taste So rampant was this culture of excess that China even came up with its own term for this new class of people. They became known as “tuhaos”, which translates as rich with no taste. “These tuhao liked to use luxury items to show their wealth and they also liked to give them as gifts,” says Sun. “A culture developed. China is a society based on relationships and people like to use gifts to maintain a good relationship.” She says purchases are more “rational” now. “Those were crazy days.”\nIt was these crazy days that underpinned the expansion plans and business strategies of the biggest names in luxury retail. Italy’s Prada, which also owns the Miu Miu and Church’s brands, became so focused on greater China, it decided to list in Hong Kong in 2011. That year, sales of luxury goods on the mainland alone grew more than 25 per cent, with expensive watches and bags leading the way. By last year, that rapid growth had turned into a 1 per cent drop.\nAfter a successful listing just four years ago, Prada’s fortunes also reversed. The group reported a 28 per cent drop in net income to €451 million ($661 million) in 2014, the first earnings decline since its float. Management cited a significant deterioration in market conditions for Hong Kong and Macau during the second half.\nRupert Hoogewerf, publisher of the Hurun Report, which chronicles the lives and spending patterns of China’s wealthy and is best known for its annual rich list, estimates the money doled out for gifts has fallen 30 per cent over the past two years. “The biggest impact of the corruption crackdown has been on the gifting and entertainment industry,” he says.\nAs officials reined in their travel and spending, star-rated hotels across the country began to suffer. After reporting a combined profit for 2012 of 5 billion yuan, hotels saw their income tumble into negative territory just a year later, with a 2.1 billion yuan loss, according to the China Tourism Academy. Remarkably, some hotels even sought to lose a star so they could meet the strict new accommodation guidelines of government departments.\nChanging strategies In a report for Bank of America Merrill Lynch last year, then chief economist Lu Ting estimated that declining activity in the Chinese economy as a result of the campaign was probably the equivalent of 1 per cent of gross domestic product, or more than $US100 billion. But he still believes it will be good for the economy in the long-term. It “cleans up governments, cuts bribes and reduces red tape,” he says. It also “makes jobs in the government much less attractive”, reducing the dominance of state-owned enterprises on the economy. “As talent moves to the private sector, I expect the Chinese economy will operate in a new way,” says Ting, who is now head of research at Chinese broker Huatai Securities.\nWhile the impact of the campaign was delayed in Macau, it was all the more spectacular given the gambling hub’s rapid rise. When it was opened to foreign casino operators in 2004, its revenue was slightly less than the Las Vegas strip. A decade later not only had it overtaken America’s most famous casino precinct, it had grown to seven times the size with total gaming revenue in 2013 of $US45 billion. More than two-thirds of that came from VIP gamblers, who were also the main buyers of luxury goods.\nGlobal casino magnates including Sheldon Adelson, Steve Wynn and James Packer scrambled to open more properties. In 2012, just as Packer and his business partner, Lawrence Ho, were planning Studio City, Melco Crown’s newest casino complex in Macau – due to open around October – some analysts predicted gaming revenue could reach as high as $US80 billion within five years. But those forecasts now appear the stuff of fantasy. On CLSA’s numbers gaming revenue will drop 26 per cent this year to $US33 billion.\nAndy Rothman, a former US State Department official who is now an economist with fund manager Matthews Asia, says the anti-corruption campaign is about creating a more sustainable political environment where Chinese people will be less resentful about corruption and opulence within the Communist Party. Over the long term, he believes it will create a more sustainable environment for many sectors of the economy, including luxury goods retailers. “Demand will be more focused on ‘real’ consumption of luxury goods, as opposed to demand connected to corruption,” he says.\nCompanies are already responding. Casinos, luxury goods retailers, hotels and restaurants are all shaping their business strategies around a new type of consumer, the “premium mass-market” one. “We have seen the emergence of the so-called affordable luxury brands like Coach or Michael Kors,” says Hoogewerf. “These brands have seen huge growth.”\nThose at the higher end are also adapting. Earlier this year, Chanel surprised the Chinese market, reducing prices by more than 20 per cent on three of its most popular bags. It became the first big luxury brand to standardise prices between Europe and Asia, citing a weak euro, which had exacerbated the already sizeable price difference for those markets. The Chanel move was quickly followed by Gucci and watchmakers Patek Philippe and Tag Heuer. None of them used the word “discount”. For Gucci it was about running down old stock, while the others used words like “price-equalisation”.\nLuxury must adapt Their competitors are sure to follow. “The luxury market has to change,” says Macau-based retailer Patricia Cheong. “Prices have to be marked down. There are fewer customers now and everyone is fighting for them.”\nThere are already growing examples of companies that have weathered the fallout from the campaign and are starting to thrive again. Few brands were hit harder by the crackdown than Chinese spirit maker Shui Jing Fang, which counts global beverages giant Diageo as its controlling shareholder. The maker of high-end baijiu, the fiery white spirit often drunk during Chinese banquets, saw its sales slide 78 per cent in 2014. Prior to the crackdown Shui Jing Fang didn’t sell any bottles for less than 958 yuan ($200). These days its “core business” bottles are priced at 428 yuan a bottle.\nThis brutal change in strategy began to pay off towards the end of last year when sales bottomed. Then in the first quarter of this year, the growth began anew with sales up 255 per cent compared with the same quarter in 2014, putting the business on track for 600 million yuan in sales this year. Nevertheless, it’s still a far cry from the 1.6 billion yuan of sales achieved in 2012 and explains why Diageo took a £264 million write-down on the business in July last year. Closer to home, Treasury Wine Estates, which owns blue chip brands like Penfolds Grange, expects a big rebound in wine sales across China this year after a difficult 24 months.\nIn Macau, the future is less certain. While revenues are expected to gradually recover, the impact of Xi and Wang’s campaign lingers, crimping the spending that created the world’s most lucrative luxury shopping strip. James Packer, for one, is circumspect. He said in May that “as an Australian investor in China and Macau, it’s very hard to be critical of a corruption crackdown…[but] when and how that ends is something that no one knows.”", "external_links": [], "published": "2015-07-30T22:00:00.000+03:00", "crawled": "2015-07-31T00:08:17.029+03:00", "highlightTitle": ""}