{"organizations": ["Eagle Bancorp, Inc", "Indirect Consumer Loan Portfolio Eagle Bancorp, Inc"], "uuid": "9976184fb95412e4edc2ccaf39ee560249e31517", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/213629?filename=213629.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/17/Financing%20Agreements", "section_title": "GlobeNewswire: Financing Agreements", "url": "http://globenewswire.com/news-release/2015/07/27/755132/10143132/en/Eagle-Bancorp-Inc-Announces-Completion-of-Sale-of-Indirect-Consumer-Loan-Portfolio.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "country": "US", "title": "Eagle Bancorp, Inc. Announces Completion of Sale of Indirect Consumer Loan Portfolio", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Eagle Bancorp, Inc. Announces Completion of Sale of Indirect Consumer Loan Portfolio", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T13:15:00.000+03:00", "replies_count": 0, "uuid": "9976184fb95412e4edc2ccaf39ee560249e31517"}, "author": "", "url": "http://globenewswire.com/news-release/2015/07/27/755132/10143132/en/Eagle-Bancorp-Inc-Announces-Completion-of-Sale-of-Indirect-Consumer-Loan-Portfolio.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "ord_in_thread": 0, "title": "Eagle Bancorp, Inc. Announces Completion of Sale of Indirect Consumer Loan Portfolio", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eagle Bancorp, Inc. Announces Completion of Sale of Indirect Consumer Loan Portfolio July 27, 2015 06:15 ET | Source: Eagle Bancorp, Inc. \nBETHESDA, Md., July 27,   Eagle Bancorp, Inc. (NASDAQ: EGBN ), the parent company of EagleBank, today announced that it has completed the sale of its Indirect Consumer Loan portfolio to MainStreet Bank (OTCQB:MNSB). The transaction amounted to approximately $80 million at July 24, 2015. This portfolio was acquired in the merger with Virginia Heritage Bank completed in the fourth quarter of 2014. The sale of this non-strategic loan class will allow the Company to deploy the funds into commercial loans, its core competency, improve its yield on earning assets and reduce operating expenses. Additional information may be obtained in Eagle Bancorp's quarterly earnings release dated July 22, 2015. \nAbout Eagle Bancorp: The Company is the holding company for EagleBank, which commenced operations in 1998. The Bank is headquartered in Bethesda, Maryland, and operates through 22 branch offices, located in Montgomery County, Maryland, Washington, D.C. and Northern Virginia. The Company focuses on building relationships with businesses, professionals and individuals in its marketplace. \nForward-looking Statements: This press release contains forward-looking statements within the meaning of the Securities and Exchange Act of 1934, as amended, including statements of goals, intentions, and expectations as to future trends, plans, events or results of Company operations and policies and regarding general economic conditions. In some cases, forward-looking statements can be identified by use of words such as \"may,\" \"will,\" \"anticipates,\" \"believes,\" \"expects,\" \"plans,\" \"estimates,\" \"potential,\" \"continue,\" \"should,\" and similar words or phrases. These statements are based upon current and anticipated economic conditions, nationally and in the Company's market, interest rates and interest rate policy, competitive factors, expectations as to the Company's ability to successfully integrate Virginia Heritage Bank's business and customers and to achieve anticipated cost savings and business enhancements related to the merger, and other conditions which by their nature, are not susceptible to accurate forecast and are subject to significant uncertainty. Because of these uncertainties and the assumptions on which this discussion and the forward-looking statements are based, actual future operations and results in the future may differ materially from those indicated herein. For details on factors that could affect these expectations, see the risk factors and other cautionary language included in the Company's Annual Report on Form 10-K for the year ended December 31, 2014 and in other periodic and current reports filed with the SEC. Readers are cautioned against placing undue reliance on any such forward-looking statements. The Company's past results are not necessarily indicative of future performance. EAGLE BANCORP, INC. CONTACT: Michael T. Flynn 301.986.1800 Related Articles", "external_links": [], "published": "2015-07-27T13:15:00.000+03:00", "crawled": "2015-07-27T13:27:41.686+03:00", "highlightTitle": ""}