{"organizations": ["Sainsbury"], "uuid": "d8c6fa24bd147a6fae1ae939ae345377666540ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-retail/?format=rss", "section_title": "Retail News | Retail Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/sainsbury-seeks-salvation-superstores-190759211.html", "country": "GB", "title": "Sainsbury’s seeks salvation for superstores", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Sainsbury’s seeks salvation for superstores", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T22:07:00.000+03:00", "replies_count": 0, "uuid": "d8c6fa24bd147a6fae1ae939ae345377666540ae"}, "author": "", "url": "https://uk.finance.yahoo.com/news/sainsbury-seeks-salvation-superstores-190759211.html", "ord_in_thread": 0, "title": "Sainsbury’s seeks salvation for superstores", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Jul 18, 2015, 22:36 BST - UK Markets closed Sainsbury’s seeks salvation for superstores By Graham Ruddick | Telegraph – 2 hours 28 minutes ago -0.05 \nMike Coupe says the death of the out-of-town superstore has been exaggerated \nWhen Mike Coupe officially became chief executive of J Sainsbury (Other OTC: JSAIY - news ) after the grocer’s annual meeting last July, his first duty was to head to his old comprehensive school. \nIt was just the relief that the new Sainsbury’s supremo needed after the shock he had endured in the months leading up to the AGM. \nBetween being named the new Sainsbury’s boss in January and actually succeeding Justin King six months later, the grocery industry had unravelled spectacularly. Morrisons issued a major profits warning that kick-started a brutal price war, while Tesco (Xetra: 852647 - news ) imploded. After a decade of growth, Sainsbury’s sales fell into decline. \n“It was really good to juxtapose the quite intense period up to the AGM with going back to your roots and speaking to a bunch of school kids about what you have done with your career,” Coupe recalls of his trip to Weald Community School in West Sussex. \nDespite the pressure on Sainsbury’s and the turmoil in the industry, Coupe insists he was not handed a hot potato by his predecessor. The downward pressure on supermarkets “happened very suddenly”, according to the 54-year-old. \n“Some of the things that we have seen in the market have also been extraordinary in the last year,” he says. \nNow (NYSE: DNOW - news ) a year into the job, Coupe has steadied the ship at Sainsbury’s. Although sales are still falling in like-for-like terms, sales volumes and customer numbers are up. \nThe company has also avoided the dramatic tumble in operating profits endured by its listed rivals Tesco and Morrisons. Sainsbury’s was criticised under King for having the lowest profit margins of the “big four”, but now it has the highest. This has come at a price: hundreds of workers have lost their jobs at offices and stores as Coupe has been forced to cut costs to adapt to falling sales. \nNow, after laying the groundwork, Coupe is about to take on perhaps his biggest challenge yet and one that could define his tenure as chief executive he wants to reinvent the supermarket. \nSainsbury’s is drawing up plans for six new-format supermarket trials that will launch later this year. The company wants to drag the supermarket into the modern era of retailing and help it to challenge the discounters, convenience stores, and online shopping. \nThe plans and locations for the new supermarkets remain under lock and key, but the aim is to make the stores more convenient. So, products being bought for use today or tomorrow will be moved to the front of the store, while longer-term purchases such as loo roll will be further in. \nSainsbury’s also wants shoppers to get in and out of its stores quicker, so it is developing self-scan technology that works with a small trolley and mobile phone apps that tell you where the product you want to buy is located. Kiosks, such as customer service and tobacco stands, will be used more and geared up to cope with shoppers making smaller purchases. At the same time, Sainsbury’s is opening Argos concessions in ten stores and wants to run more in-store services, such as foreign exchange points. \nCoupe believes the biggest challenge facing Sainsbury’s is a change in shopping habits that has put pressure on large out-of-town stores. \n“The world of the one-stop shop, the big shop, and building large shops has changed,” he said. \n“For 25 years our industry was driven by that dynamic build larger shops, build more shops and customers will come. Whether it is driven by the recession or whether it is driven by the rise of technology, what we are seeing is a world where customers have more choices available to them than ever and they are choosing to shop in a different way. \n“They are still shopping in larger shops but they are also choosing to shop in smaller shops, convenient shops. They are tending to shop more frequently and when they shop they buy less. Of course with the rise of the internet, increasingly they have options online. Online groceries have grown in prominence, but as you look forward, things like subscription-based models for certain products that you buy regularly will just turn up. \n“Increasingly the challenge for businesses like ours is what I characterise as the difference between my mother and my daughter. My mother is a 78-year-old lady who wants to shop in a proper shop, does it on a reasonably frequent basis, sees it in part as a social experience, and wants a particular level of customer service. \n“My youngest daughter shops almost exclusively online, not just for groceries but everything else in her world, and her life is built around her mobile phone and a much more digital interaction. \n“So, the challenge for us is to both get our offer to work for my mother, but also to accept and continue to enhance the experience for people like my daughter, who are the next generation coming through.” \nDespite the technological revolution, Coupe insists that the weekly supermarket shop is not dead. \n“Even (Taiwan OTC: 6436.TWO - news ) in the most pessimistic scenario, well over half of the groceries in the UK will be sold out of large out-of-town superstores,” he says. “I think I have said on a number of occasions that the death of the superstore is grossly exaggerated. But our challenge is to reinvent the superstore for the next generation. \n“If you characterise last year as building a plan and making sure we had the financial capacity to execute the plan, this year for us is all about experimentation and starting to understand how we can make our larger stores in particular different for the future. \n“My measure of long-term success would be how and when we change the dynamic of our superstore business. We are certainly looking to push the boundaries of what we might do with those formats in the future.” \nSainsbury’s supermarkets could be helped by economic factors swinging back in favour of larger stores. \nCoupe says there is likely to be a “rebalancing between supply and demand” due to the “big four” dramatically scaling back plans to build new supermarkets, while household income is also growing again and price deflation should eventually end. \nThere is a debate in the industry about when deflation which has been caused by falling commodity prices and the supermarkets cutting prices to be closer to the discounters will turn back into inflation. \n“Whenever I have been on the public record I have said early 2016,” Couple says. “But it’s also unpredictable in the sense that it’s largely dependent on a couple of factors exchange rates, and who knows where they might move to in the future, and also the size or otherwise of the harvest in the northern hemisphere.” \nAnother boost for Coupe is that he no longer has an Egyptian jail sentence hanging over him. The chief executive was sentenced in his absence over a row with a former business partner of Sainsbury’s that took place before he even joined the company in 2004. In order to resolve the legal battle, Coupe had to fly to Egypt to appeal the ruling. \n“It was one of the more unusual things I have had to deal with,” he says. “Actually it didn’t make a huge difference to me. There were lots of our people in Egypt dealing with the issue. I just had to make a day trip one weekend to visit Egypt, but apart from that it didn’t really impinge on my day-to-day job. \n“For those who know me well I don’t actually get flustered by many things, if anything.” \nMeanwhile, the supermarket industry continues to have new challenges thrown at it. \nLast week the Competition and Markets Authority claimed some supermarket promotions were misleading shoppers. \n“I would strongly push back on the allegations that are made in these types of reports,” Coupe responds. “We set out to do the right things for our customers, and we set out to make sure that our pricing is transparent.” \nThe Government has also introduced a new national living wage that means Sainsbury’s will have to pay all staff aged over 25 £9 per hour by 2020. At the same time, business rates are set to rise £4.9bn, or 17.5pc, over the next five years. \nCoupe says Sainsbury’s is the sixth largest taxpayer in Britain despite only being the 75th largest corporation. It pays roughly 2.5 times more in business rates than corporation tax. “It is not an easy issue to solve,” he says. \nAt Sainsbury’s most recent AGM earlier this month Coupe said in response to a question about the living wage that the grocer might have to reconsider benefits such as the 10pc staff discount in order to increase base pay. However, he confirmed that the retailer would meet the Chancellor’s new rules without scrapping benefits. \n“The actual question was around would we make our benefits more flexible. The answer to that is yes, if that is what our colleagues want,” he says. “If you are a young person you may want a different approach to pensions compared to somebody who is reaching a retirement age, as one example. But the headline of give up discount card, get higher rate of pay, no.” \nThat will be music to the ears of Sainsbury’s staff, and so will Coupe’s pledge to invest in modernising its supermarkets. A year into the job, Sainsbury’s chief executive is stamping his mark on one of Britain’s most famous names.", "external_links": [], "published": "2015-07-18T22:07:00.000+03:00", "crawled": "2015-07-19T00:41:41.000+03:00", "highlightTitle": ""}