{"organizations": [], "uuid": "af6456826c1cd10df58775f3dfeac72b1ed36151", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thefinancebuff.com", "main_image": "http://lh4.googleusercontent.com/-RHWRQcDFLYc/VOPKBG10BoI/AAAAAAAABvk/ORgIjhe_NTo/s800/ohio-national-term-life-brochure.jpg", "site_section": "http://thefinancebuff.com/feed/rss", "section_title": "The Finance Buff", "url": "http://thefinancebuff.com/term-life-insurance-conversion-options-worth-it.html", "country": "US", "title": "Conversion Options In Term Life Insurance", "performance_score": 0, "site": "thefinancebuff.com", "participants_count": 1, "title_full": "Conversion Options In Term Life Insurance", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T16:51:00.000+03:00", "replies_count": 0, "uuid": "af6456826c1cd10df58775f3dfeac72b1ed36151"}, "author": "Harry Sit", "url": "http://thefinancebuff.com/term-life-insurance-conversion-options-worth-it.html", "ord_in_thread": 0, "title": "Conversion Options In Term Life Insurance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "like a friend telling you about money ... Conversion Options In Term Life Insurance by Harry Sit on 1 Comment \nAs I mentioned in a previous post, I’m buying term life insurance from Ohio National. Ohio National sells two types of tem life policies: a regular or basic term policy and a Term Plus policy. What’s the difference between the basic policy and the Plus policy? The conversion right. What’s Conversion? \nConversion means converting the term life policy to a permanent life insurance policy offered by the same company, at the same health rating without another health exam. \nConverting doesn’t mean that your term policy will just turn into a permanent policy at the same low premium for the term policy. You still have to pay the higher premium for the permanent policy. It’s just you can lock in your health rating. Why Convert? \nYou must have heard that a term policy is usually better than a permanent policy. That’s why I’m buying a term policy to begin with. Why would I ever want to convert it to a permanent policy? \nSuppose I develop some illness, such as cancer, that shortens my life expectancy but doesn’t kill me before the level-premium term ends. By converting the term policy to a permanent policy, I would then get a good deal from the insurance company. I would pay the rate for a healthy person when I have a shortened life expectancy. Price of the Conversion Right \nIf the insurance company is giving you the right to convert, which has value, you bet they are not giving it to you for free. If your term life insurance policy comes with conversion right, the price is built into the premium. \nOhio National’s basic term policy says: \nDuring the first ___ policy years, but not after the policy anniversary nearest the insured’s 70th birthday, the company will make a permanent plan of insurance to which you may convert all or part of this policy without proof of insurability or medical evidence. \nNote it says “ a permanent plan of insurance.” It’s possible that this permanent policy is a special policy just for conversion, with a much higher premium than other permanent policies because the company knows that people who choose to convert tend to have poor health. If that’s the case then this conversion option isn’t worth much because you are paying the price set for the less healthy when you are less healthy, unless you know you are even less healthy than the average less healthy. \nThe Plus policy says: \nDuring the first ___ policy years, but not after the policy anniversary nearest the insured’s 70th birthday, you may convert all or part of this policy to any Universal Life, Variable Universal Life or Whole Life insurance then offered by the company without proof of insurability or medical evidence. \nNow you are on equal footing with other new customers buying permanent life insurance from the company. If you have poor health and you are paying the price set for a healthy person, you are getting a better deal. \nWhat’s the price for the enhanced conversion option? About 5% extra in annual premium for the coverage amount I want. Will I develop something that shortens my life expectancy but doesn’t kill me within the term period, serious enough to make buying permanent life insurance worthwhile? I don’t know. Is the chance of such outcome and the economic benefit I derive from it worth the 5% extra premium? I have no idea either. \nNot knowing any better, I would assume the insurance company knows and they price it accordingly, if they don’t over-price it. There’s no way I can beat them. \nI asked my agent. She didn’t push it. She only said I should consider it if I ever want a permanent policy, otherwise I can just go with the basic policy. Other than betting/insuring that I will have a shortened life expectancy but I won’t die within X years, I can’t think of any reason that I will suddenly want permanent life insurance. \nI decided to get just the basic policy. If I’m picking the term correctly, that’s the period of time I need protection for. If I die soon afterward, it would be unfortunate but my family should be out of the woods by then. \nDid you care about the conversion options on your term life insurance? See All Your Accounts In One Place \nTrack your net worth, asset allocation, and portfolio performance with free financial tools from Personal Capital .", "external_links": [], "published": "2015-06-30T16:51:00.000+03:00", "crawled": "2015-07-01T06:42:17.000+03:00", "highlightTitle": ""}