{"organizations": [], "uuid": "86ab4e92229a17f872115d10336365e802bdf4b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/f4/e8/f4e83cd9971ab15a56db44ee5f7fe6cb.jpg?itok=ZVLGVL-u", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/why-are-energy-storage-and-management-systems-so-important?cid=rss", "country": "US", "title": "Why are energy storage and management systems so Important?", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Why are energy storage and management systems so Important?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T01:16:00.000+03:00", "replies_count": 0, "uuid": "86ab4e92229a17f872115d10336365e802bdf4b6"}, "author": "Robert Benedict, SF Internet Business Examiner", "url": "http://www.examiner.com/article/why-are-energy-storage-and-management-systems-so-important?cid=rss", "ord_in_thread": 0, "title": "Why are energy storage and management systems so Important?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why are energy storage and management systems so Important? By: SimpliPhi Energy View all 5 photos \nWhy are energy storage and management systems so Important? \nEnergy storage and management systems effect the power industry like cell phones did for the communications industry: allow freedom of access, anytime, anywhere. \nAt Intersolar I met with SimpliPhi Power, Inc. who is a growing and innovative technology company that designs, builds and sells a portfolio of intelligent, non-toxic, efficient, energy dense power storage and management systems that seamlessly integrate renewable energy in conjunction with or independent of the grid. \nEnergy storage ensures renewable energy is available \nWithout energy storage, renewable sources of power are intermittent and unpredictable, as is the grid in emergency and black out scenarios in which the centralized delivery of power breaks down. SimpliPhi technology creates power security and resilience by taking the intermittency out of any source of power generation, including the centralized grid, whether it is from solar, wind or fuel-based-generators. \nSimpliPhi’ s technology mobilizes people and power beyond the limits of transmission lines. Effectively putting power back into the hands of people, enabling them to harvest, store and utilize their own personal power supply at home, work or on the go. These turnkey power storage solutions created to address and sold into multiple markets: Such as portable, emergency response, residential, commercial, utility and military markets. \nPower unplugged available anytime, anywhere. \nSimpliPhi offers an entirely new model of power generation, transmission and distribution that is decentralized, local, and sustainable. SimpliPhi technology utilizes patented, licensed lithium ferrous phosphate (LFP) cells are state-of-the-art proprietary management boards, circuitry, cell architecture and methods of assembly to create safe, intelligent and energy dense storage and management systems. \nOne of the most significant competitive advantages of SimpliPhi batteries is that they do not generate heat. They do not require active ventilation or cooling for optimum performance. Thus creating significant savings and efficiencies in amounts of power that is typically required to store power (no HVAC or ventilators). Additionally, SmipliPhi’s footprint and weight of any given installation is less as it is based on pounds of raw materials per kWh delivered. No additional cooling or performance enhancing products are required. \nSimpliPhi batteries are used and endorsed by; U.S. Marine Core, Army and ATEC and have been deployed and integrated across a robust and diversified portfolio of on-grid and off-grid installations. SimpliPhi’s residential and commercial systems are warranted for 10 years with an expected 15 to 20 year life. They offer roundtrip efficiency charge and discharge rates of 98%, are up to 32% more powerful, and 18% smaller and lighter. Last, but potentially most important they do not pose the risk of thermal runaway or excessive heat build-up characteristic found in other lithium ion batteries. \nSimpliPhi batteries are less than a 1/3 the weight and size of traditional lead acid AGM or SLA batteries (for the same amount of energy storage), offering charge times 4 to 5 times faster. There is nominal self-discharge and loss in capacity due to excessive use or non-use seen in back-up and emergency storage scenarios. There is an extended operating temperature range to accommodate extreme field conditions (-4 to 140 F), are non-toxic and require absolutely no maintenance, ventilation or cooling for optimum performance. \nIn conclusion, \nSimpliPhi Power can provide Net Zero homes, businesses and communities mobile power anywhere in the world; SimpliPhi Power provides unprecedented freedom, independence, sustainable and reliable power generation, storage and management. If you have any questions, comments or would like to speak to a representative at SimpliPhi Power please contact me at rbenedict@securett.com or 916-284-8841. Suggested Links", "external_links": [], "published": "2015-07-27T01:16:00.000+03:00", "crawled": "2015-07-27T03:28:49.663+03:00", "highlightTitle": ""}