{"organizations": ["Sirius Minerals PLC"], "uuid": "5d88e75a53e3ddd7c284c124079e4deeee586a3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/another-milestone-sirius-minerals-plc-131027540.html", "country": "GB", "title": "Another Milestone For Sirius Minerals PLC", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Another Milestone For Sirius Minerals PLC", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T16:10:00.000+03:00", "replies_count": 0, "uuid": "5d88e75a53e3ddd7c284c124079e4deeee586a3a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/another-milestone-sirius-minerals-plc-131027540.html", "ord_in_thread": 0, "title": "Another Milestone For Sirius Minerals PLC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Jul 14, 2015, 14:34 BST - UK Markets close in 1 hr 56 mins Another Milestone For Sirius Minerals PLC By Alan Oscroft | Fool.co.uk – 23 minutes ago +1.070 \nSirius Minerals (LSE: SXX) has been a risky investment so far, and still is. \nTo date it's been regulatory hurdles that have been holding the company's development back, as its vast deposit of high-quality potash lies under the North York Moors National Park -- and project developments in such sensitive spots can be faced with serious opposition. But this one has the backing of just about everyone so far, including local people who relish the job prospects it brings. \nNo public inquiry \nAnd another milestone has been reached today, after the Secretary of State for Communities and Local Government has decided that there will be no need for a public inquiry -- such a process could be been very lengthy. That leaves management of the ongoing approvals process with the relevant local authorities, with Sirius chief executive Chris Fraser saying \" This is yet another positive step forward on our pathway to developing the project and increasing shareholder value \". \nIt comes a couple of weeks on from the crucial 1 July decision, by the North York Moors National Park Authority, to grant permission for the mine and mineral transport system planning application, subject to various finalisations. \nSirius shares spiked up immediately after today's announcement, but by early afternoon they're only up a penny on the day -- though at 18.5p it's still a 5.7% jump. And the shares have still trebled since their lowest point of the year, in February. \nA good investment? \nSo should we buy Sirius Minerals shares now? Well, there's still a very long way to go before there's any prospect of profit. The company is hoping to get all of its final decision notices issued before the end of September, and that certainly would have been scuppered had a public inquiry been needed. \nBut that's the relatively easy part, being followed as it is by the rather important steps of actually digging the mine and building the transport system -- oh, and finding the cash to pay for it. \nIn a 10 July update on the plans, we were reminded that \" The company has always maintained that the project will require multiple financings and these will be carried out when required, when opportunities present themselves and always with the best value to shareholders in mind \", with the firm telling us that a high-leverage strategy should be \" in the best long term interests of shareholders \". \nDebt and risk \nThat means there will be plenty of debt taken on, and it does raise the risk associated with delays and other unforeseen problems -- in the oil business we've recently see Afren effectively handed over to its creditors with almost nothing left for shareholders. The value of an investment in Sirius now is utterly unquantifiable, with nobody even guessing when first profits will be achieved. But on the upside, all that potash should be very valuable indeed. \nWhat all this means is that Sirius is really not a suitable investment for hanging your retirement plans on. But if you're happy to invest a small portion of your cash in the occasional high-risk growth hope, Sirius is one that could prove to be a winner. \nBut if you want a safer-looking growth prospect, our hot new report identifies 1 Top Small-Cap Stock From The Motley Fool that's looking good. It's a smaller company that has already rewarded its shareholders with a stonking performance, yet the Motley Fool's top analysts reckon there could be a further 45% upside to come . \nWant to know the name of this potential small-cap winner? Just click here to get your completely free report today . \nAlan Oscroft has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-14T16:10:00.000+03:00", "crawled": "2015-07-14T16:34:38.000+03:00", "highlightTitle": ""}