{"organizations": [], "uuid": "e5fffd531da4377eda067e2def2444ff6fed4f43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201507031602.html", "country": "US", "title": "South Africa: Court Dismisses Eviction of Retired Montagu Farmworker", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Court Dismisses Eviction of Retired Montagu Farmworker", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T16:32:00.000+03:00", "replies_count": 0, "uuid": "e5fffd531da4377eda067e2def2444ff6fed4f43"}, "author": "", "url": "http://allafrica.com/stories/201507031602.html", "ord_in_thread": 0, "title": "South Africa: Court Dismisses Eviction of Retired Montagu Farmworker", "locations": ["South Africa", "Montagu Farmworker South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa: Thousands Sign Uber Cape Town Petition \nAndries Joostenberg, 64, and his family of nine were living in the farmhouse for more than 26 years when they were evicted for the second time 2014. The family was first evicted in about 2012 but they refused to move. \nDuring the second eviction, all the family's belongings were removed from the premises. The farm owner, Raymond Charles, also ordered that the house's roof and windows be removed to discourage the family from reoccupying. \nSince then, the family has relied on the charity of a neighbouring farm owner who made land temporarily available to them, where they have erected a three-room wendy house. \nJoostenberg was unavailable for comment on Friday, but his daughter Sylvia said the family were elated by the ruling. \n\"We are so happy to hear that my parents can move back home. We all grew up there. My mother was the one who took all of this the hardest because I don't think she was expecting it. We will fight for them until the end,\" she said. \nThe judgment read out in court stated that Joostenberg, who had been working on the farm since 1964 and living in the farmhouse with his family since 1988, signed a new contract when farm owner Raymond Charles bought the farm in 2008. The new contract stated that Joostenberg's accommodation was dependent on his employment, the judgement read. \nHowever, Joostenberg was dismissed following disciplinary proceedings for misconduct in January 2012. \nIn May 2012, the Montagu Magistrates Court approved the Charles' application to evict Joostenberg stating \"keeping livestock without permission, erecting unauthorised structures, and the cutting and selling of wood on the premises\" as reasons for granting the order. This was among several other disputes that occurred between the two over that period. \nIn September 2014, Joostenberg relocated his family to the neighbouring farm. His lawyer, Johan van der Merwe, also filed an urgent application for leave to appeal the eviction order. \nIn his affidavit to the court, Van der Merwe said that Joostenberg was not notified of his right to appeal the eviction order when his family was put out for the first time in July that year. Van der Merwe continued to stress that Joostenberg and his family had no suitable, alternative accommodation. \nPresiding over the hearing, acting judge president Yasmin Shehnaz Meer and acting judge Tembeka Ngcukaitobi in their judgement said that while there were a number of allegations and counter allegations between the parties, it was not enough to validate the eviction. \n\"I find that the eviction order ought not to have been granted for the reason that there was non-compliance with Section 9 [of the Extension of Security of Tenure Act (ESTA)]. I however express my concern at the discord between the parties. [Joostenberg] must appreciate the rights he has as a long term occupier are accompanied by obligations towards the land owner on whose land he resides,\" it stated. \nAccording to the judgement, Section 8 of ESTA, the basis for which the Joostenbergs' eviction was granted, gives long-term occupants the right to remain on the land if they are over the age of 60 and has been an employee of the owner. These requirements were met by Joostenberg. \nThe family's lawyer, Johan van der Merwe, said while they celebrated the ruling, he also cautioned Joostenberg about moving back without having gone through a process of mediation. \n\"Since the evictions, there has been so much conflict between the Joostenberg family and the landowner. I will be recommending that my clients appoint a mediator to facilitate their return the the farm. Before they can move back, the issues and conflict with the landowner should preferably first be resolved,\" he said. \n\"The landowners still have a right to appeal this ruling. However, if they do appeal, the process will be very costly. I don't think they [the landowners] have sufficient merit, and such an appeal in my view shall fail. However, there is also nothing in the law preventing them from making a completely new application for an eviction order against the family,\" he said. \nVan der Merwe added that while law around the occupancy has improved and evictions were a more complex process. He said people in the community were still not aware of their rights and responsibilities. \n\"Before, landowners had absolute power over what happened on their properties. Now the constitution has changed all of that. The rights of the landowner must be weighed against human rights of the occupants, which protects their dignity,\" he said. \n\"The value of ownership is now related to the value of the dignity of other persons living on the land. I don't think people are aware of this change, and they don't know their rights. The Joostenbergs were long term occupants on the farm which gives them more rights than ordinary occupiers,\" he said. South Africa \nEFF leader Julius Malema will be in Marikana on Friday to lay criminal charges against Deputy President Cyril Ramaphosa … see more » Copyright © 2015 GroundUp. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-07-03T16:32:00.000+03:00", "crawled": "2015-07-03T18:51:51.000+03:00", "highlightTitle": ""}