{"organizations": ["S&T Bancorp, Inc."], "uuid": "50c339c1bacbaa7768f17fe3c40afda210804542", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.otcoutlook.com", "main_image": "", "site_section": "http://www.google.ca/finance/company_news?q=NASDAQ:STBA&ei=zIG5U_DmF4W-wQOOoICIDQ&output=rss", "section_title": "News for S & T Bancorp Inc - Google Finance", "url": "http://www.otcoutlook.com/short-interest-update-of-st-bancorp-inc-nasdaqstba/647216/", "country": "IL", "title": "Short Interest Update of S&T Bancorp, Inc. (NASDAQ:STBA) | OTC Outlook", "performance_score": 0, "site": "otcoutlook.com", "participants_count": 0, "title_full": "Short Interest Update of S&T Bancorp, Inc. (NASDAQ:STBA) | OTC Outlook", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T10:06:00.000+03:00", "replies_count": 0, "uuid": "50c339c1bacbaa7768f17fe3c40afda210804542"}, "author": "", "url": "http://www.otcoutlook.com/short-interest-update-of-st-bancorp-inc-nasdaqstba/647216/", "ord_in_thread": 0, "title": "Short Interest Update of S&T Bancorp, Inc. (NASDAQ:STBA) | OTC Outlook", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hank Fransworth"], "text": "by Hank Fransworth July 15, 2015 \nS&T Bancorp, Inc. (NASDAQ:STBA) reported a drop of 3% or 25,013 shares in its short interest. The short figure came in at 2.4% of the total floats. The average daily volume of 155,226 shares suggests that the days to cover 809,112 short positions, as on June 30,2015, will be 5. On June 15,2015, the short interest was 834,125 shares. The information was released by Financial Industry Regulatory Authority, Inc (FINRA) on July 10th. \nShares of S&T Bancorp Inc. rose by 2.19% in the last five trading days and 6.24% for the last 4 weeks. S&T Bancorp Inc. is up 5.34% in the last 3-month period. Year-to-Date the stock performance stands at 2.95%. \nS&T Bancorp, Inc. (NASDAQ:STBA) witnessed a decline in the market cap on Monday as its shares dropped 0.13% or 0.04 points. After the session commenced at $30.48, the stock reached the higher end at $30.8799 while it hit a low of $30.25. With the volume soaring to 82,561 shares, the last trade was called at $30.29. The company has a 52-week high of $30.8. The company has a market cap of $1,054 million and there are 34,796,000 shares in outstanding. The 52-week low of the share price is $23.07. \nOn a different note, The Company has disclosed insider buying and selling activities to the Securities Exchange, According to the information disclosed by the Securities and Exchange Commission in a Form 4 filing, the Officer (SR EXECUTIVE VICE PRESIDENT) of S&T Bancorp Inc, Antolik David G, had purchased 1,015 shares in a transaction dated on April 24, 2015. The transaction was executed at $27.59 per share with total amount equaling $28,004. The company has received recommendation from many analysts. The shares has been rated as hold from 3 Wall Street Analysts. 2 analysts have suggested buy for the company. \nS&T Bancorp, Inc. (S&T) is a bank holding company and has three wholly owned subsidiaries, S&T Bank, 9th Street Holdings, Inc. and STBA Capital Trust I. The Company also owns certain interest in Commonwealth Trust Credit Life Insurance Company. As of December 31, 2012, the Company had approximately $3.4 billion in loans and $3.6 billion in deposits. S&T Bank is a full service bank. It provides its services to its customers through offices located in Allegheny, Armstrong, Blair, Butler, Cambria, Clarion, Clearfield, Indiana, Jefferson and Westmoreland counties of Pennsylvania. It operates in three segments: Community Banking, Wealth Management and Insurance. Its Community Banking segment offers services, which include accepting time and demand deposit accounts, originating commercial and consumer loans, and providing letters of credit and credit card services. The Wealth Management segment offers discount brokerage services, services as executor and trustee under wills and deeds. Posted In", "external_links": [], "published": "2015-07-15T10:06:00.000+03:00", "crawled": "2015-07-16T02:03:08.000+03:00", "highlightTitle": ""}