{"organizations": [], "uuid": "ef34a63d60f63e2034eeced3f504f1c3a08c90fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/business/finance", "section_title": "Winnipeg Free Press: Personal Finance", "url": "http://www.winnipegfreepress.com/business/finance/no-time-or-interest-in-managing-your-money-target-date-funds-may-be-the-answer-312871901.html", "country": "US", "title": "No time or interest in managing your money? Target date funds may be the answer", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "No time or interest in managing your money? Target date funds may be the answer - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T12:01:00.000+03:00", "replies_count": 0, "uuid": "ef34a63d60f63e2034eeced3f504f1c3a08c90fc"}, "author": "Craig Wong, The Canadian Press", "url": "http://www.winnipegfreepress.com/business/finance/no-time-or-interest-in-managing-your-money-target-date-funds-may-be-the-answer-312871901.html", "ord_in_thread": 0, "title": "No time or interest in managing your money? Target date funds may be the answer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA - For investors who don't have the time or the interest to manage their retirement savings, target date funds might be a solution worth considering.\n\"You're busy doing your day-to-day job, so what we do here is manage an appropriate amount of risk to achieve a goal of return for 65 years,\" said Peter Walsh, institutional portfolio manager at Fidelity Investments.\nTarget date funds are used when you're saving for a specific objective such as retirement or in a child's registered education savings plan.\nThey gradually decrease the proportion of stocks and increase their holdings of fixed income and short-term funds as they close in on their target date.\nFunds that are decades from their target take an aggressive stance, with a high proportion of their money in stocks, while those closer to their target are far more conservative.\nThat compares with a typical balanced mutual fund which has 60 per cent of its money in stocks and 40 per cent in bonds, and doesn't change much from that mix regardless of your individual needs.\nWalsh said an additional advantage of target date funds is that the investment manager will constantly rebalance your portfolio to ensure the appropriate asset mix.\n\"Even though we all think we are investment-savvy, we all tend to make the wrong decisions at the right time,\" he said.\n\"As people work in their full-time jobs, they don't have enough time to do a simple task like rebalancing.\"\nLarry Moser of BMO InvestorLine says that as you approach your retirement, you still need to be sure that the asset mix in your target date fund remains appropriate for your individual plan.\n\"This has to be looked at as something you invest in for the time being, and if your own circumstances change and something is not right with your investment, you always have to go back and revisit it,\" he said.\nAnd Moser notes that target date funds aren't for everyone, saying they're \"less appropriate for someone who wants a say in how their money is being managed, someone who really does understand the marketplace and feels a little bit more comfortable building their portfolio.\"\nInstead, he says, you could build your own portfolio tailored to your personal risk tolerance and periodically rebalance the holdings depending on the fund performance and how close you are to your planned retirement or investment goal.\nBut doing that requires you to be willing to make at least some investment decisions, and commit time to regularly update your plan.\nReport Error Submit a Tip Refund Refund", "external_links": [], "published": "2015-07-09T12:01:00.000+03:00", "crawled": "2015-07-09T23:29:54.000+03:00", "highlightTitle": ""}