{"organizations": [], "uuid": "12076b2c55944b49a19897d5152b8cfde39c82d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/tqb2J2dTr1yy-f5qmFkI-744Ii0VNiqt/promo259543876&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.news.com.au/finance", "section_title": "Finance | Business and Finance News | News.com.au", "url": "http://www.news.com.au/finance/real-estate/could-first-home-buyers-be-the-new-drawcard-for-developments/story-fncq3era-1227425561021", "country": "AU", "title": "First home buyers: Could they be the new drawcard for developments?", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "First home buyers: Could they be the new drawcard for developments?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "12076b2c55944b49a19897d5152b8cfde39c82d1"}, "author": "CHARIS CHANG", "url": "http://www.news.com.au/finance/real-estate/could-first-home-buyers-be-the-new-drawcard-for-developments/story-fncq3era-1227425561021", "ord_in_thread": 0, "title": "First home buyers: Could they be the new drawcard for developments?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FINALLY, there could be good news for first home buyers as one scheme seems to identify this disenfranchised group as a selling point for developments.\nIn an unlikely twist, developers and real estate agents are seeing the potential for developments aimed squarely at younger buyers, and the benefits they bring as residents.\nCPM Realty managing director Sam Elbanna is handling the sale of The Eden development in Sydney, which has launched a new initiative giving first homeowners priority over investors.\nFirst home buyers will be given first dibs ahead of investors to buy 47 of the 202 apartments and townhouses off-the-plan at The Eden.\nResidential development Eden, in Greenacre. Source: Supplied\nThe development in Greenacre in Sydney’s southwest is also aimed at luring aspirational owner-occupiers to consider shifting further out west into areas they would traditionally look past.\n“It’s not like other developments in the area; it’s more like you would find in the inner city. There are polished wooden floors, airconditioning and stone bench tops, because we know that first home buyers are actually aspirational,” Mr Elbanna said.\nEver since the plan became public on Monday, Mr Elbanna said he had received about 200 inquiries about the development, many from first home buyers.\nHe said he had received a lot of calls from the parents of potential buyers who hoped to help their children get on the property ladder, but also from people in more affluent areas who would not normally consider Greenacre.\n“We did a lot of research about selling in areas outside of the inner city and found first home buyers all wanted the same thing: a cool apartment, with nice finishes, a place to show off to their friends,” Mr Elbanna said.\nThese kinds of features were traditionally not provided in Sydney’s west, Mr Elbanna said. But potential buyers were coveting the fabulous properties being advertised in Sydney’s inner west, which they did not have access to because they were too expensive.\nThe Eden: First home buyers want a “cool” apartment. Source: Supplied\n“We thought, if they want it, we’re going to give it to them. Sure it’s more expensive, but we’ll have happier clients and a faster take-up rate,” Mr Elbanna said.\nHe said that while the apartments were more expensive because of their design and finishes, he did not think marketing to first home buyers would add a premium to the properties.\n“The price is the same irrespective of who buys ... so certainly it’s not a selling point now,” Mr Elbanna said.\nHowever, he said apartments that had more owner-occupiers generally saw more “capital growth” because they tended to take better care of their properties.\nIn a large apartment complex, having 20 per cent of owner-occupiers could also be a drawcard for investors.\nThe practice of property hoarding, where investors buy apartments but then leave them empty, has also become a concern, with some worried that the Melbourne suburb of Docklands could become a suburb of “ghost towers” .\nProfessor Hal Pawson, associate director of the University of NSW’s City Futures Research Centre, said more owner-occupiers meant there would be fewer renters and absentee landlords, who don’t necessarily manage properties as well.\n“If other developers pick this up, we could see a little bit of a premium value placed on property for people who are first home buyers, who may be more attracted to blocks that have only owner-occupiers and won’t have absentee landlords,” Prof Pawson said.\nHe said The Eden’s offer could also be an experiment to see whether there was demand for developments aimed only at first homeowners, and whether people would be willing to pay a bit more for this.\n“It could be an experiment to see whether a well-publicised offering of this kind can generate demand for properties priced at ‘normal’ levels,” he said.\n“That is, factoring in the possibility that first home buyers could be willing to pay slightly more for a flat in a block where all other homes are being sold to other first home buyers and none to absentee landlords,” he said.\nTwo-bedroom apartments at The Eden are priced from $550,000. The median price for a two-bedroom unit in Greenacre is $438,500, however this figure includes new and existing properties.\nTwo bedroom apartments start at $550,000. Source: Supplied\nA one-bedroom apartment starts at $450,000, while there are three bedrooms from $635,000. All fall well within the First Home Owner Grant Cap of $750,000 so will be eligible for the NSW Government’s $15,000 grant.\nMr Elbanna said the idea to target first home buyers was developed more than a year ago, but it took a while to find the right developer to deliver the scheme but also the right property, which needed to have access to desirable features such as open space and nearby shops and transport.\nHaving seen how difficult it was for first home buyers, and with young adult children of his own, Mr Elbanna said he wanted to make it fairer for them.\n“I fear Sydney is becoming like New York, London and Paris, a city of renters but not because we chose to be but because we can’t afford to buy,” he said.\nAs the head of CPM Realty for the past 19 years, he has seen how first home buyers were disadvantaged when it came to buying new properties.\n“Sydney is tough ... if you have 100 apartments, generally the first 50 or 60 buyers will be investors, which makes things a bit difficult for first home buyers,” Mr Elbanna said.\n“First home buyers are not seasoned property buyers, they generally need more time to get organised. Firstly, they need to get finance organised which can take longer. Investors don’t need to worry; if they have equity they can jump in and buy.\n“First home buyers also generally seek advice from their parents or other people they trust and want to get those people to check out the property, which takes longer.\n“Investors have seen contracts before and know what to look for, so they can just check out the important parts and they’re fine. First home buyers want to get a solicitor to check out the contract.”\nIn order to give first home buyers more time, Mr Elbanna will release contracts for The Eden early, about five weeks (instead of a week) before they need to be signed so first home buyers can get them checked over and consult with their family and friends.\nThere’s stiff competition for housing, especially when you are a first home buyer. Picture: Tim Hunter Source: News Corp Australia\nOn signing day, Mr Elbanna said appointments with first home buyers would be scheduled first, giving them the ability to sign contracts ahead of investors.\n“There is this forlorn attitude that buying property is no longer possible but we want to make it possible because it’s good for everyone ... it creates a more sustainable economy. If people own their own property, they work hard to pay their mortgage.”\nHouse hunters Richard Zock and Vicki Shaw told The Daily Telegraph that buyers needed all the help they could get.\n“(The Eden sale) is a brilliant idea. I wish more developers did it in other locations,” Mr Zock said.\nMr Elbanna said first home buyers who had called him were sounding excited and enthusiastic because they actually felt they had a chance to buy. He said he also hoped to prioritise first home buyers when he rolled out another development in February.\n“In an ideal world, I would love to see this happen across many developments throughout Sydney,” Mr Elbanna said.\n ", "external_links": ["http://digg.com/submit?phase=2&url=http://www.news.com.au/finance/real-estate/could-first-home-buyers-be-the-new-drawcard-for-developments/story-fncq3era-1227425561021?sv=8745e9207586e0a47cb46849c4f93be9&title=Some+good+news+for+first+home+buyers", "http://www.myspace.com/index.cfm?fuseaction=postto&t=Some+good+news+for+first+home+buyers&c=FINALLY%2C+something+to+make+first+home+buyers+cheer+up.+One+scheme+seems+to+identify+this+disenfranchised+group+as+a+selling+point+for+developments.&u=http://www.news.com.au/finance/real-estate/could-first-home-buyers-be-the-new-drawcard-for-developments/story-fncq3era-1227425561021?sv=8745e9207586e0a47cb46849c4f93be9", "http://www.kwoff.com/submit.php?url=http://www.news.com.au/finance/real-estate/could-first-home-buyers-be-the-new-drawcard-for-developments/story-fncq3era-1227425561021?sv=8745e9207586e0a47cb46849c4f93be9", "http://www.facebook.com/share.php?u=http://www.news.com.au/finance/real-estate/could-first-home-buyers-be-the-new-drawcard-for-developments/story-fncq3era-1227425561021?sv=8745e9207586e0a47cb46849c4f93be9", "https://www.realestate.com.au/neighbourhoods/greenacre-2190-nsw", "http://www.theage.com.au/victoria/ghost-tower-warning-for-docklands-after-data-reveals-high-melbourne-home-vacancies-20141111-11kkxz.html", "http://del.icio.us/post?url=http://www.news.com.au/finance/real-estate/could-first-home-buyers-be-the-new-drawcard-for-developments/story-fncq3era-1227425561021?sv=8745e9207586e0a47cb46849c4f93be9&title=Some+good+news+for+first+home+buyers", "http://www.newsvine.com/_wine/save?popoff=0&u=http://www.news.com.au/finance/real-estate/could-first-home-buyers-be-the-new-drawcard-for-developments/story-fncq3era-1227425561021?sv=8745e9207586e0a47cb46849c4f93be9&h=Some+good+news+for+first+home+buyers"], "published": "2015-07-02T03:00:00.000+03:00", "crawled": "2015-07-02T21:18:53.000+03:00", "highlightTitle": ""}