{"organizations": ["BBC"], "uuid": "a59e8466f2c6cd5de4bed7ab181aa5a9ceb3d829", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-targetukfocus/?format=rss", "section_title": "Finance News | Reuters - UK Focus - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/uks-osborne-hit-bbc-fund-233507856.html", "country": "US", "title": "UK's Osborne to hit BBC to fund welfare cuts -Sunday Times", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "UK's Osborne to hit BBC to fund welfare cuts -Sunday Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T02:35:00.000+03:00", "replies_count": 0, "uuid": "a59e8466f2c6cd5de4bed7ab181aa5a9ceb3d829"}, "author": "", "url": "https://uk.finance.yahoo.com/news/uks-osborne-hit-bbc-fund-233507856.html", "ord_in_thread": 0, "title": "UK's Osborne to hit BBC to fund welfare cuts -Sunday Times", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Osborne"], "text": "Print \nLONDON, July 5 (Reuters) - British finance minister George Osborne plans to launch a 650 million pound raid on the BBC to help cover the country's benefits bill, forcing the corporation to meet the cost of free television licences for the over-75s, the Sunday Times said. \nIt quoted senior government sources as saying a deal is close that will force the BBC to take on the cost of the 4.5 million licences - worth 145.50 pounds each - from the Department for Work and Pensions. \nThe move, it said, is part of a package of 12 billion pounds of welfare cuts, widely expected to be unveiled in a budget bill on Wednesday. \nIn return, the paper said, the BBC will be allowed to make up some of the lost revenue by charging for use of its iPlayer and other online catch-up services to try to stem the loss of licence fee revenue caused by people turning to the Internet and abandoning their televisions. \nThat will return at least 150 million pounds to BBC coffers, the paper added, but the 650 million pounds benefits bill represents the loss of around a fifth of the corporation's annual 3.7 billion pounds licence fee income. \nThe details, including the timing of the change, are still under negotiation but it is likely to be phased in after 2017, when the number of over-75s claiming a free licence will have risen further, the paper said. \nIt also reported that Osborne will announce that wealthy people living in social housing will have to pay their own way from 2017. \nAlthough budget plans are kept under strict wraps ahead of delivery, Prime Minister David Cameron on Saturday outlined plans to accelerate house-building over the next five years and raise the inheritance tax threshold on family homes to the psychologically important 1 million pound mark. \nThe plans include steps to build discounted homes for first-time buyers, unlock public land for new homes and back small builders with planning changes. \nCameron and Osborne were writing in the Times newspaper ahead of next Wednesday's budget, which will be the first time the newly elected Conservatives have been able to present a financial agenda free of the constraints of their previous, left-leaning Liberal Democrat coalition partners. \nThey have already said they plan to reduce borrowing faster this year and cut the annual welfare bill by 12 billion pounds($18.7 billion). \n(Reporting by Stephen Addison; Editing by Eric Beech)", "external_links": [], "published": "2015-07-05T02:35:00.000+03:00", "crawled": "2015-07-05T04:12:56.000+03:00", "highlightTitle": ""}