{"organizations": [], "uuid": "3504188c6a48700c548f9338ba933157d05f8d59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/5/c/q/w/image.related.afrArticleLead.620x365.gi6n68.png/1436239412057.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/australian-investors-guide-to-global-calamity-20150707-gi6n68", "country": "AU", "title": "Australian investors guide to global calamity", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Australian investors guide to global calamity | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T11:23:00.000+03:00", "replies_count": 0, "uuid": "3504188c6a48700c548f9338ba933157d05f8d59"}, "author": "Matthew Smith", "url": "http://www.afr.com/personal-finance/australian-investors-guide-to-global-calamity-20150707-gi6n68", "ord_in_thread": 0, "title": "Australian investors guide to global calamity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Globalisation means everything is connected, but for most Australians potential contagion from a Greek fallout will be limited. Reuters by Matthew Smith When Larry Norman wrote the 1969 psychedelic rock anthem Nothing Really Changes , featuring the opening lyrics \"Nothing really changes / Everything remains the same\" – he may as well have been whispering directly into the ears of Australian investors this week.\nAt a time when there is no shortage of activity on the global economic front, with Greece pushing itself to the brink of default and Asian markets slipping and dipping on the Chinese government's engineering of its economic transition, the prevailing narrative for Australian investors remains as it has been and will continue to be for the time being.\nAs boring as it sounds, the narrative is still this: while interest rates remain low, and while bonds aren't offering the yield or the defensive characteristics they once did, investors will continue their search for dividend-paying investments and are pushing into the equities market.\nThat's not to say investing in equities is without its risks, but it does mean that investors with a medium to long-term horizon shouldn't be concerned about timing their entries and exits based on these global events dominating newspaper headlines.\nGreece will resolve itself one way or another. China's sharemarket will eventually attract enough investors to support its government's capital markets plan.\nIn the meantime, investors need to think about the variables and the circumstances they have some control over or at least understand.\n\"You've got to recognise things don't go in a straight line. We're in a part of the market now where earnings and dividend yields have to do the hard work,\" says Paul Moore, chairman and chief investment officer of investment firm PM Capital.\nValuations of listed companies are a long way from lower levels, he says, and future returns will be more dependent on companies' ability to grow earnings and dividends.\n Moore is exposed to possible disruptions from the still unfolding Greek debt crisis, given the PM Global Companies Fund's significant exposure to European banks.\nWhile he expects some volatility, given the significant share price returns over the past three years, he remains confident in his long-term view for European banks.\n\"Things will jump around a bit, but you just want to be patient,\" he says.\nBig four hold appeal Closer to home, the big four Australian banks will continue to be of particular interest to investors, says Paul Kasain, head of asset management at Equity Trustees.\nTaking into account earnings growth in mid-single digits the banks will be generating a pre-tax return of more than 8 per cent this year, Kasain explains.\nThe banks were among the stocks most heavily sold off during the recent 8 per cent fall in the Australian equities market since the S&P/ASX 200 brushed the 6000 level in late April.\n\"At this stage the banks look attractive. They have a strong regulator that isn't out to harm them. While interest rates are low it's hard to say bad debt will get out of control,\" he says.\nAway from the noise of the Greek crisis, the prevailing narrative globally remains along the same lines as in Australia, with central banks around the world keeping interest rates at record lows as monetary authorities continue to show their willingness to support equities markets.\nEurope, Japan and the United States continue to show willingness to pursue favourable monetary policy for equity markets.\n\"Even if markets get a bit wobbly you'll still get 4 per cent [dividend yield] from equities,\" says David McDonald, Credit Suisse Private Banking & Wealth Management chief investment strategist.\nBut for most self-directed investors who are steering their own superannuation funds, it's unlikely there's too much to worry about from the direct impact of what's happening on the other side of the world.\nAccording to the most recent Australian Taxation Office statistics, the majority of money invested in self-managed superannuation funds is in listed shares on the ASX.\nAccording to the ATO data, more than 32 per cent of the close to $600 billion in DIY super funds is held in domestically listed shares, compared with less than 0.5 per cent in overseas shares. Twenty-six per cent of funds is held in cash, less than 10 per cent in unlisted trusts and 3 per cent in listed trusts.\nYes, globalisation means everything is connected, but for most Australians potential contagion from a Greek fallout will be limited.\nIn a worst-case scenario, a Greek \"blow-up\" could lead to Spanish and Italian bonds being repriced, which could lead more \"skittish\" markets, Moore says.\nHowever, market watchers this time around are confident the European Central Bank will step in quickly to cordon any knock-on effect compared to the debt crisis in 2009 and again in 2011.\nSupply/demand the wild card Closer to home, the effect of the Chinese government's tinkering with supply and demand dynamics continues to be a wild card in terms of its effect on the Australian sharemarket in both the short and long term.\nOn the one hand, state-controlled iron ore producers increasing their supply has had tangible effects on global commodity prices and brought some of the higher-cost Australian producers to their knees.\nMeanwhile, the opening of the local China sharemarkets to global investors and the feeding of those markets with stimulatory policy has seen the Shanghai and Shenzhen stock exchanges register significant gains followed by dramatic falls.\nProfessional investors see this as part of the China's transition from a fast-growing fixed-asset investment-driven economy to a more long-term sustainable consumer-driven economy.\n\"You've seen what happened in the Chinese stock market didn't really have a bearing on what's happening in the broader economy,\" says Johan Carlberg, principal and portfolio manager of Alphinity Investment Management.\nCarlberg is referencing the 150 per cent-plus rise in the Shanghai Composite Index since November last year and then its dramatic 20-plus per cent nose-dive since mid-June.\nWhat remains the biggest issue in the world economy at the moment is still the effect US monetary policy will have on global markets as the Federal Reserve gets closer to raising interest rates and reversing years of stimulatory monetary policy.\nThe longer-term issue Australian investors should be most concerned about is the lack of earnings growth in the domestic economy.\nWhile the demand for equities created by the lack of alternatives in cash and bonds will continue to be positive for Australian equity markets, \"those positive returns will be capped by a lack of earnings growth\", Carlberg says.\nAlthough it looked like there would be no end to the local sharemarket's climb earlier this year when investors had the 6000 number in their sights, there could be some revising down of expectations of where we will end up this year and next.\nA survey of a handful of funds managers and equity strategists reveals it's unlikely the ASX 200 will reach 6000 this calendar year or even during the 2015-16 financial year.\n\"As long as people rebalance their expectations for returns, they should be fine. The problem is a lot of investors tend to look at the past 12 months and expect they'll get the same returns over the next 12 months. That's unlikely to happen,\" says Moore.\n\"We should be thinking about high single-digit returns. In a low inflation world that's not bad,\" he says.\nBright spot One bright spot on an otherwise dull horizon for Australian equities could be the falling Australian dollar, which pundits are predicting will continue to lose value as it seems likely to US dollar will continue to strengthen.\nAs has been the case during the past six months, investors will hope Australian companies with overseas exposure will continue to see their earnings bolstered by a falling Australian dollar.\nBut when all is said and done, the story for Australian investors is likely to remain similar to the story that's been already told so many times over the last couple of years.\nCost cutting will continue to account for a lack of expected growth and investors will look to invest where they can get sustainable dividend yields, at least in the medium term.\nNothing really changes. Everything remains the same.", "external_links": [], "published": "2015-07-07T11:23:00.000+03:00", "crawled": "2015-07-07T09:02:19.000+03:00", "highlightTitle": ""}