{"organizations": [], "uuid": "7f15aaf6b4dd177d833aeabbff8d508ace5bbd7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-16/california-teachers-fund-misses-goal-with-4-5-investment-gain", "country": "US", "title": "California Teachers’ Fund Misses Goal With 4.5% Investment Gain", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "California Teachers’ Fund Misses Goal With 4.5% Investment Gain - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T20:45:00.000+03:00", "replies_count": 0, "uuid": "7f15aaf6b4dd177d833aeabbff8d508ace5bbd7d"}, "author": "James Nash", "url": "http://www.bloomberg.com/news/articles/2015-07-16/california-teachers-fund-misses-goal-with-4-5-investment-gain", "ord_in_thread": 0, "title": "California Teachers’ Fund Misses Goal With 4.5% Investment Gain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The California State Teachers’ Retirement System, the second-largest U.S. pension, earned 4.5 percent last fiscal year, missing its target as market volatility reduced returns, according to its chief investment officer.\nIt was the weakest gain for the $191.4 billion fund, known as Calstrs, since a 1.8 percent return in 2012. It falls short of the fund’s 7.5 percent annual target, which it needs to earn to avoid falling further behind in its obligations to 879,000 current and retired teachers and their families. The pension reported it earned 18.6 percent a year earlier.\nWest Sacramento-based Calstrs joins the California Public Employees’ Retirement System in failing to reach its goal as financial-market fluctuations depressed stock and bond returns. Calpers, the largest pension, which oversees $304.6 billion, earned just 2.4 percent in the year ended June 30.\n“The one-year number is just the pace in a marathon,” Christopher Ailman, the chief investment officer, said in an interview Thursday on Bloomberg Television. “When you run a marathon, you hit hills. This may be a hill where we have a slower pace for a couple of years.”\nCalstrs is among the largest U.S. public pensions under pressure to boost investment returns as their unfunded liabilities tripled to almost $2 trillion from 2004 through 2013, according to Moody’s Investors Service.\nIn June 2014, Democratic Governor Jerry Brown signed a bill to close the fund’s $74 billion funding gap over 32 years by requiring higher payments by teachers, school districts and the state.", "external_links": ["http://www.calstrs.com/news-release/calstrs-reports-second-year-healthy-investment-returns-2013-14\\"], "published": "2015-07-16T20:45:00.000+03:00", "crawled": "2015-07-16T21:02:44.000+03:00", "highlightTitle": ""}