{"organizations": [], "uuid": "ebae79afcef73003819c6c3926f0e2e82e95a6c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/q/h/2/3/image.related.afrArticleLead.620x365.gib8m0.png/1436782740744.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/energy/electricity/ausnet-pitches-for-nsw-power-20150713-gib8m0", "country": "AU", "title": "AusNet pitches for NSW power", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "AusNet pitches for NSW power | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T22:15:00.000+03:00", "replies_count": 0, "uuid": "ebae79afcef73003819c6c3926f0e2e82e95a6c4"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/energy/electricity/ausnet-pitches-for-nsw-power-20150713-gib8m0", "ord_in_thread": 0, "title": "AusNet pitches for NSW power", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AusNet could find itself bidding against its own shareholders. Bloomberg by Matthew Stevens AusNet Services will fulfil expectations on Tuesday that it aims to translate its substantial Victorian power base into national relevance by confirming it has joined the $9 billion race for the best chunk of the NSW electricity network being offered for privatisation.\nAusNet has delivered an expression of interest that it fully expects will see it through to the preferred bidder stage of a sell-off that everyone anticipates will attract vigorous – and state-budget enriching – international and local interest from a handful, and more of still formulating, investment consortia.\nThe target of AusNet's desire is TransGrid, the entity that owns and operates the state's high-voltage network. It is the choicest gem in the NSW power privatisation process because the government is prepared to sell 100 per cent of a 99-year lease over the asset and because this main-line transmission network is the least vulnerable of the three networks being sold, to the changing shape of Australian power demand.\nOne of the interesting aspects of the NSW sale plans is that its commitment to sell only 49 per cent of the state's poles and wires, is a net-net number. The intention is to balance the sale of 100 per cent of the TransGrid's lease by retaining 49.6 per cent of the two urban distribution networks, Ausgrid and Endeavour Energy, and 100 per cent of the operator of the regional distribution business, Essential Energy.\nThe fact that AusNet has opened its campaign by flying solo reflects an impressive internal confidence that its Victorian base leaves it the most natural owner and operator of the least upstream parts of the NSW power network. But it reflects, as much, anticipation of some considerable mobility within the ownership and funding alliances that are presently forming to enter this opening round of the premier state's great power bid off.\nTo appreciate the reasons for this ownership and capital fluidity you need look no further than AusNet itself. The one certainty of its engagement with this process is that there is no way it can successfully prosecute the mission without partners. But there is no way it can finalise an ownership or funding structure until it is clear whether or not its biggest owners are with it or against it.\nCompeting bids AusNet is a listed Australian entity that is 31 per cent owned by Singapore Power and 19.9 per cent owned by State Grid Corporation of China (courtesy a Singapore sell-down). Rather confusingly for all concerned, it is speculated that both are actively engaged with potentially competing bids for TransGrid.\n The bloke running AusNet's bid, lead independent director Tony Iannello, says this potential makes it difficult to finalise a bid structure or its funding. But it does not remove AusNet's preference for the active support of one or both of its major shareholders.\nIt is clear that Iannello would like both senor owners to come along for the AusNet ride, either as discrete joint venture partners or as lead contributors to whatever capital raising might need to be made to progress this thing. It is clear, too, that clarity about who might fall under the AusNet orbit will be shaped by whether or not Singapore and China end up aligning themselves with their Australian listed option.\n\"We value them as strong and supportive shareholders (and would) dearly love them to support any bid we put forward,\" Iannello said. \"But what they decide to do is up to them,\" he said, noting that the big two had been informed of AusNet's intentions.\nMind you, they would have been pretty dim not to have guessed given that Iannello is the head of the independent bid committee formed to defend the integrity of its bid.\n\"The conflicts of interests are being appropriately managed,\" he said before noting that the board nominees of both State Grid Corporation of China and Singapore Power had been (and would continue to be, for the moment) excluded from any discussion of the bid and its long preparation.\nContemplation of NSW and the privatisation that will fund the state's infrastructure ambitions had us recalling the regulatory bunfight over the recently divested Port of Newcastle and the increased charges that have followed that landmark deal.\nAs you doubtless recall, Australia's biggest coal exporter, Glencore, has gone to the National Competition Council seeking regulation of some mission critical prices by the Australian Competition and Consumer Commission after the port's new owners promptly increased charges on use of Newcastle's very busy shipping channel.\nSelf interest As ever in these sorts of regulatory bunfights, the \"interested party\" submissions invited by the NCC stands as impressive expressions of overwhelming self interest. Port customers, from individual miners such as Glencore to the port operators and shippers have recommended declaration in the national interest. The new port owner and the state government, on the other hand, reckon that the light-touch oversight installed ahead of the $1.5 billion sale should be enough to sate everyone's concern over a price increase that is steep but at the margins of the overall cost of moving coal boats in an out of Newcastle's terminals.\nThere is, though, one surprising exception to this rule of thumb among the first round of NCC submissions. Its father is the Victorian Department of Treasury and Finance and it is striking because the submission takes self-interest to a whole new level and, in doing so, sees Victoria take a polar opposite view on one key element of the processes that the NCC might trigger.\nAs we have discussed here previously, Victoria's port privatisation has been blighted by controversy over a proposed 750 per cent rent increase demanded of its biggest customer, DP World. As a result, DP in alliance with fellow operators and customers, is preparing to follow Glencore's lead by seeking declaration of the port with the ambition of introducing the ACCC as a pricing regulator.\nAs you might imagine, neither government nor presently state-owned port operator are keen on this idea. But neither are they prepared yet to step back from the rent increases they are seeking in an effort to rebase the port's revenue outlook and thus inspire the sale process to the top of the $6 billion price range.\nIt is very difficult to avoid this home-grown contest as the shaping context of the VDTF submission to the NCC on the potential regulation of a shipping channel in Newcastle.\nA starting point of these highly technical competition cases is the identification of who the NCC should pass its recommendations to for a final decision.\nIn this case, for example, the ACCC reckons the \"designated minister\" should be the Commonwealth Minister for Small Business, Bruce Billson. But the NSW government advised the NCC of legal advice that says the matter should end in the hands of the Commonwealth Treasurer.\nVictoria, on the other hand, says that the final arbiter of the Newcastle matter should be the NSW Premier. It sustains that position by arguing that the shipping channel remains a state-owned asset even though its management has been sold into private hands and those hands have moved quickly to increase charges.\nThis is an interesting idea but no one promulgated by any other party that has so far expressed an interest.\nSo why is that so self-serving?\nWell, it does rather look like Victoria is seizing an opportunity to establish that the sort of long-term lease it contemplates for the Port of Melbourne will not alter that fact that the assets in question remain under state ownership and that effectively removes them from the oversight of the national competition regime.\nIt is hard to imagine that Victoria might be prepared to pursue the legalities of the Newcastle matter to much further than this submission stage. But I would bet things will be quite different when it comes to the Port of Melbourne and the currently live potential that DP World is attempting to spoil the privatisation party.", "external_links": [], "published": "2015-07-13T22:15:00.000+03:00", "crawled": "2015-07-13T20:03:54.000+03:00", "highlightTitle": ""}