{"organizations": [], "uuid": "eabc09b1277c4ace46f938eb0dec5cee0dea20b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/68/f4/68f45b299ddaa518617d113dfa562647.jpg?itok=hnds6Yne", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/stock-market-preview-for-the-week-of-july-6-2015?cid=rss", "country": "US", "title": "Stock market preview for the week of July 6, 2015", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Stock market preview for the week of July 6, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T02:46:00.000+03:00", "replies_count": 0, "uuid": "eabc09b1277c4ace46f938eb0dec5cee0dea20b6"}, "author": "Ronald Zimba, Traverse City Investing Examiner", "url": "http://www.examiner.com/article/stock-market-preview-for-the-week-of-july-6-2015?cid=rss", "ord_in_thread": 0, "title": "Stock market preview for the week of July 6, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stock market preview for the week of July 6, 2015 Use your key for the next article Volatility returned to the US markets in the past week as the S&P 500 saw its first daily retreat of 2% or greater since October. Photo by Bryan Thomas/Getty Images \nThe S&P 500 saw volatility return Monday in a 2.09% retreat and that downturn took the index to a fourth significant retreat from the 100 L resistance. The next two sessions regained some of the losses before Thursday finished the holiday shortened trading week with a small loss, giving the index a 1.18% weekly loss. It was the second consecutive weekly loss and the fourth setback in the past six weeks. The index has finished lower in 21 of the last 38 sessions. \nMonday’s volatile downturn was the first 2% or greater setback on the S&P 500 since an Oct 9, 2014 slip of 2.07% and the largest daily loss on the index since a 2.09% retreat on April 10, 2014. Most of the world’s major indexes saw a volatile retreat on Monday in reaction to news that Greece would likely default on loans. Greece will vote to overturn or accept a referendum on the last terms for a continued bailout on Sunday. \nAlthough the US markets appear to have settled quickly, several of the world markets have seen volatile market moves continue. China’s markets continued to unravel during the past week. The Shanghai Composite saw volatile moves in all five sessions, and has moved in excess of 2% higher or lower in 13 of the past 15 sessions while shedding over 25% of its value in past three weeks. The Shenzhen Composite also saw five volatile moves in the past week along with 12 in the past 15 as it has shed a nearly a third of its value since breaking lower. \nSeveral Eurozone markets have shown increased volatility too. German’s DAX Composite saw two volatile moves in the past week along with four in the last 18. France’s CAC 40 Index has seen two volatile moves in the past ten. Italy’s FTSE MIB has seen six volatile sessions in the past 20. Although it remained closed during the past week, Greece’s Athens General Share Index has also been volatile, seeing 12 moves of 2% or greater in the past 19 sessions. \nSeveral of the world’s major indices have slipped below the 200 DMA in recent downturns. Several have seen falls that have reached or exceeded the 10% required to be considered a correction and some have reached the 20% or greater needed for a crash. World markets appear to be showing signs of stress as the stocks pushing them higher have become highly overvalued. Nearly all have stalled near or have begun to bend lower from recent highs and many have settled into downtrend channels in these retreats. \nThe New York Stock Exchange and Dow Jones Industrial Average also slipped below their 200 DMA in Monday’s retreat. The Dow has since rebounded back above its 300 DMA. The S&P 500 neared the 200 DMA in the past week’s retreat, but turned higher above it. \nRising numbers of US stocks have seen breaks below the 200 DMA and rising numbers are remaining below their 200 DMA after these breaks. The downturn on Monday took over half of the constituents of the S&P 500 to finishes below their 200 DMA, as 259 constituents closed below their 200 DMA. The session finished with 293 constituents either below the 200 DMA or less than one dollar above it. The index rebounded somewhat off those lows into the end of the holiday shortened week. By the close on Thursday the number finishing below the 200 DMA had shrunk to 246, but six finished the session less than five cents above their 200 DMA. There were 279 that finished the week either below the 200 DMA or less than one dollar above it. \nThe S&P 400 also finished Monday with over half of its constituents below their 200 DMA; although the exact number was unknown due to a lack of upkeep of this index at Monday’s close. As a result Monday finished with over half of the largest 900 publically traded companies below their 200 DMA. An update of the S&P 400 constituent changes were completed in time for Thursday’s close and it finished the week with 179 constituents below the 200 DMA. The index also finished with 226 of the 400 either below their 200 DMA or less than one dollar above it. \nEven with large numbers of stocks in retreats reaching or continuing below their 200 DMA, the indexes have maintained rather closely to their highs. This has resulted in many of the stocks remaining in the runs that pushed the indexes to these highs reaching highly overvalued levels. According to The Wall Street Journal , after Friday’s close the Russell 2000 had a TTM P/E of 78.00, the NASDAQ a TTM P/E of 22.30 and S&P 500 a TTM P/E of 21.30. \nForward earnings projections could also still be too high. Many continue to believe earnings will rebound faster than they have historically during similar conditions. Current conditions look very bullish for long term earnings; however the benefits of these conditions could take up to four years to fully develop. Many stocks are over four years forward on these potentially high expectations. \nThe S&P 500 saw three constituents change names and symbols and three constituent changes during the past week. Zimmer Holdings, Inc. (ZMH) completed its acquisition of Biomet on June 24 and after completing the transaction, changed its name and ticker symbol to Zimmer Biomet Holdings, Inc. (ZBH). It began trading under the new ticker symbol on Monday. \nGannett Co. Inc. (GCI) completed its spinoff of the “new” Gannett Co. (GCI) and changed its name to TEGNA Inc. (TGNA) after completing the distribution. It began trading under the new ticker symbol on Monday. The parent company TEGNA remained in the S&P 500 while the “new” Gannet was added to the S&P 400. \nS&P 500 constituent MeadWestvaco Corp. (MWV) completed its merged with S&P 400 constituent Rock-Tenn Co. (RKT). Post-merger the company changed its name and ticker symbol to WestRock Co. (WRK). It began trading under the new symbol on Wednesday and remained in the S&P 500. \nS&P 400 constituent J.B. Hunt Transport Services Inc. (JBHT) replaced Integrys Energy Group Inc. (TEG) in the S&P 500 after the close of trading on Tuesday. The change was made in anticipation of Wisconsin Energy Corp. (WEC) completing its acquisition of Integrys. \nBaxter International Inc. (BAX) completed its spinoff of Baxalta Inc. (BXLT). Baxalta replaced QEP Resources Inc. (QEP) in the S&P 500 after the close of trading on Tuesday. QEP was included in the S&P 400. \nNiSource Inc. (NI) completed its spinoff of the Columbia Pipeline Group Inc. (CPGX) on Wednesday. Columbia Pipeline replaced Allegheny Technologies Inc. (ATI) in the S&P 500, and Allegheny was included in the S&P 400. \nThere were several other S&P 500 constituent spinoffs and acquisitions completed recently. A few of the more notable were: \nMasco Inc. (MAS) completed its spinoff of TopBuild Corp. (BLD). Masco remained in the S&P 500 after completing the spinoff while TopBuild was included in the S&P 600 after the close on Tuesday. E. I. du Pont de Nemours and Co. (DD) completed its spinoff of the Chemours Co. (CC). Du Pont remained in the S&P 500 while Chemours was included in the S&P 400 after the close on Tuesday. Verizon (VZ) completed its acquisition of S&P 400 constituent AOL Inc. (AOL) on June 23. \nThe effects of many of these mergers and spinoffs have not yet been fully assessed by analysts. As a result the recent changes left three of these companies without current year or quarterly estimates at the time of publication. The results in weekly changes below reflect the omission of these earnings projections. These companies will probably not report earnings until next quarter, so their absence in current quarter estimates has little affect. One of the companies that completed a merger expects increases in earnings that do not appear to be fully reflected in the most recent current year earnings projection download or in other sources checked. Although some of the earnings changes due to the past week’s activities seem to be reflected, it is not unlikely the recent mergers or spinoffs will continue to increase or decrease expected current year per share earnings in the coming weeks. \nAlthough the S&P 500 constituents saw a $1.93 weekly decrease in expected current year earnings, the absence of the three constituents’ current year projections was a large factor in this reduction. It is likely an increase would have been seen due to the recent index changes that deleted low or negative earnings constituents. Even so the changes are not likely to reduce the even weighted forward earnings projections on the index much if at all. There were only 39 constituents that saw increases over the projections of the previous week, while 72 constituents saw decreases. The reduction seen would have been larger if not for an increase of $1.96 seen in current year projections for Assurant Inc. (AIZ). \nThe constituents that have yet to report saw the total of their current quarter earnings expectations decrease by $0.52 from the previous week’s estimates. Although decreases continue to be seen, the decrease in the current quarter projections continues to be smaller than those seen during the two previous quarters. \nIndicators \nThe featured and supporting indicators discussed below are not always correct, but they have been many times. Being so they are worth reading about and taking note of. \nThe 100 L, –/(+) 90 D, (-)/(+) 90 D, +2% H, -2% H and 90 E indicators are currently active. See a more detailed description of most of the indicators developed through research and featured in these articles here . \nThe volatile retreat on Monday sent the S&P 500 below the 3% required to be considered a significant pullback. Monday’s close of 2057.64 was 3.43% below the May 21 highest close of 2130.82. The drop to significant levels was the fourth significant retreat seen within the influence of the 100 L resistance. \nMonday began this retreat after a gap lower to the session high of 2098.63. It slipped to a low of 2056.64 and found support slightly above the 2035 to 2055 MRL. Tuesday started with a gap higher, but fell to a low of 2056.32 to retest earlier support above the 2035 to 2055 MRL. The high of 2074.28 found resistance and retreated below the 100 L lower boundary at 2075 before falling to a finish of 2063.11 and below support of the 2065 to 2070 MRL. Wednesday opened with a gap higher at the session low of 2067.00 within the 2065 to 2070 MRL. The high of 2082.78 neared but was turned lower prior to reaching likely resistance from 2085 to 2100 in the lower half of the 100 L, before falling to a close of 2077.42 near the lower boundary of the 100 L at 2075. Thursday also opened with a gap higher to 2078.03, but slipped to a low of 2071.02 to cover this gap and find support above the 2065 to 2070 MRL. The high of 2085.06 pushed slightly into the likely resistance from 2085 to 2100, but this resistance turned the index back as it slipped to a close of 2076.78 and only a little above the 2075 lower boundary of the 100 L. \nThe index left an open gap lower on Monday and open gap higher on Wednesday. Both of these gaps are likely to be filled eventually. \nThe rebound off lows appeared to lack strength and failed to reach the 13 EMA after three days, being a bearish indication. Likely resistance from 2085 to 2100 in the lower half of the 100 L may have regenerated; as it sent the index lower prior to reaching it on Wednesday and after the index moved only slightly into it on Thursday. \nAn increasing number of constituents are seeing failures at the 200 DMA, as Monday saw over half of the constituents break and finish below this moving average. These failures are also being seen in the S&P 400, with Monday’s finish seeing over half of the largest 900 largest publically traded companies finish below the 200 DMA. Many managed to finish the week only slightly above their 200 DMA in the ensuing rebound, as 505 of the 900 companies finished Thursday below or less than a dollar above their 200 DMA. \nThe S&P 500 is near oversold conditions, but a continued rebound from oversold conditions is not a given. The lack of a quick rebound to and above the 13 EMA along with a possible renewal at the likely resistance in the lower half of the 100 L appears potentially bearish. Constituent charts show many are in potentially bearish failures. These failures probably added to the index’s failure to move quickly back to and above the 13 EMA and to the potential renewal of resistance in the lower half of the 100 L. \nThe –/(+) 90 D indicator that became active on Feb 26, 2015 will expire after Tuesday’s close. It has performed as follows to this point in the standard format: highest close / lowest close / last close. \n+0.95% / -3.34% / -1.61% \nThe (-)/(+) 90 D that became active on May 22, 2015 appears to have bearish potential. It has performed as follows to this point in the standard format: highest close / lowest close / last close. \n+0.80% / -2.36% / -1.45% \nThe -2% H indicator saw a correct indication on Monday. A spike in volatility indicators appeared to give a leading indication prior to this volatile move; however the outcome was delayed considerably in comparison to the majority of past correct occurrences of these indicators. Volatility indicators remain at levels that suggest a higher than normal chance for volatile conditions still exists. Although the US market appears to have become docile after this first volatile move, several other world markets have seen a marked increase in volatile activity since these indicators spiked. It still seems possible this volatile activity could spill over into US markets. \nThe +2% H indicator failed to provide a correct indication in the past week. The presence of a volatile retreat increases the chances of a volatile counter move, although it seems possible a further retreat could be needed before a volatile rebound is seen. Volatile rebounds are often seen at market lows; however they do not always signal a market low. If a volatile rebound is seen after a return to lows, caution should be exercised. \nThe 90 E was again present during a volatile market move and as the index retreated to significant levels. These types of market conditions are common during the presence of this indicator. Current chart formations and market conditions make it seem possible conditions could worsen, making it seem possible further volatile conditions could be seen. \nThe average daily volume increased 3.65% above the previous week. The highest volume was seen during Tuesday’s session and lowest on Thursday. The five day volume variance increased by 1.85% to finish the week at 67.71%. The five day volume variance maintained within potentially bearish levels during the past week. Volume levels into Monday’s retreat failed to reach levels that are normally seen during capitulator sell offs making a further retreat seem possible. Volume increases into the gapping rebounds makes it seem possible selloffs were occurring into these gaps. \nCurrent Cautions \nMarket breadth appears to be slipping towards a majority of stocks entering retreats below their 200 DMA. Over half of the 900 largest companies slipped below their 200 DMA on Monday. Although a weak rebound since has reduced the number to less than half, 505 of the 900 companies in the S&P 500 and S&P 400 finished Thursday in retreats below their 200 DMA or less than one dollar above it. \nThe Greek referendum is reported as to close to call. Many believe that the Greek people will cower due to the bank closures and supply disruptions and accept the referendum. Based on the huge bank withdrawals leading into these closures, it seems likely many expected this outcome prior to its occurrence. Many Greeks had no money in the bank, or otherwise, to begin with so have little to lose. Germany has already opened the door for talks after the referendum and others have already softened stances taken prior to the referendum proposal, including accepting the possibility of haircuts on debt. It seems likely many Greeks could see that a no vote puts them in the driver seat. Even those that wish to remain in the Eurozone could see that being the driver allows them to negotiate remaining in the Eurozone. A yes vote could keep them in the Eurozone, but makes them a passenger along for the ride and greatly reduces leverage in these negotiations. \nSeveral potentially bearish indicators are active. Volatility indicators appeared to be a leading indicator into recent volatility; although this volatility was somewhat slower to appear than in most past correct occurrences. These indicators continue to suggest a much higher than normal chance of volatile market moves still exists. \nChina’s Shanghai Composite index continued to show extreme volatility. It has shed nearly a quarter of its value since turning lower three weeks ago, exceeding the 20% required to be considered a crash. Several of China’s other major indices have seen retreats reach a third. Many of the overpriced indices throughout the world appear to be showing signs of stress. Market failures often begin abroad, before spreading and eventually reaching the US. \nForeign markets generally fall much further than the US market in retreats; making investments abroad look very risky. Most foreign markets are further overpriced than the US; however the US markets are also at levels that make them appear overpriced on a historical basis. \nThe S&P 500 constituents saw the current year earnings projection decrease in the past week. Although a decrease was seen, it was likely due to the lack of current year earnings projections in a recently merged constituent and two spin off additions to the index. Even though nearly twice as many constituents saw current year projection decreases as increases in the past week, it seems very likely an overall increase would have been seen if these three earnings projections were available; mainly due to low or negative earnings constituents being replaced during recent index changes. \nCurrent quarter projections continued to moderate in the past week. The drop in earnings projections is so far at a slower pace than that seen in the two previous quarters. \nChart formations continue to mimic past occurrences of these formations. These formations along with past timelines and worldwide stock overvaluations continue to make it seem possible the S&P 500 could see a large retreat before the end of the year. \nThe next likely resistance level above the 100 L at 2100 could be seen at the 2140 to 2160 MRL. Earlier highs on the S&P 500 could have seen the effects of this resistance level, but the index is still within the influence range of the 100 L since it has not yet reached this resistance level. Therefore this resistance is not yet considered active. This resistance appears to have the potential to cause a significant pullback. \nPlease note there is no established resistance in the MRL levels before the index has reached these levels. Several instances have proven to hold resistance once reached; however MRL levels that the index has not yet reached are only the most likely levels that resistance will be seen based on research. Back tests of the data used to project these resistance levels work well, but they are not always exact, and these resistances could react sooner or later than expected, it is also possible the resistance will not be seen at all. \nData provided for the S&P 500 was derived from the historical daily data tables, similar data can be found at AOL Finance . Earnings information was gathered from Yahoo Finance , CNBC , Edgar Filings , Scottrade Elite, AOL Finance and Morningstar , although other websites, including company websites, may have contributed small amounts of information. Stock and Treasury charts used for analysis and commentary were provided by StockCharts.com , Scottrade Elite or from those that Ron created from his data. Gold charts used for analysis and commentary were provided by Kitco . \nHave a great day trading. \nDisclosure: Ron currently has investments in GCI, TGNA, NI, MAS, BLD, VZ and AIZ. Ron had no investments in ZMH, ZBH, MWV, RKT, WRK, JBHT, TEG, WEC, BAX, BXLT, QEP, CPGX, ATI, DD, CC or AOL. Ron is currently about 57% invested long in stocks in his trading accounts reflecting an increase over the past week’s investment level. The increase was the result of the purchase of one issue and dividend reinvestments in two issues with the cost of these purchases partially offset by dividend payments. The recent addition was the repurchase of one of two core positions in an issue that were sold prior to a recently completed spin off. Those sales were made due to a current lack of interest in the spun off portion of that company. He plans to reinvest the second core position in the parent company at a later date. He will receive dividend payments from six issues in the coming week and ten in the following week. If no further investment changes are made during this time frame, these dividend payments would not change his investment level. \nDisclaimer: The information provided in the Stock Market Preview is Ron’s perception of the current conditions and what he thinks is the most probable outcome based on the current conditions, the data collected and extensive research he has done into this data along with other variables. It is intended to provoke thought of the possible market direction in his readers, not foretell the future. Ron does not claim to know what the stock market will do. If the stock market performs as expected, it only means he is applying the stock market history to the current conditions correctly. His perception of the data is not always correct. \nThis article is intended to provoke thought about investment possibilities. Acting on the information provided is at your own risk. You are urged to do your own research, and where appropriate, seek professional investment advice before acting on any information contained in these articles.", "external_links": [], "published": "2015-07-04T02:46:00.000+03:00", "crawled": "2015-07-04T04:33:20.000+03:00", "highlightTitle": ""}