{"organizations": ["Reuters Pensions"], "uuid": "8c31f8dc3363a27f5fadcbc483143573562fb862", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/134404e5-9666-4f5b-b4b7-564f72e42d62.img", "site_section": "http://www.ft.com/rss/personal-finance", "section_title": "Personal Finance", "url": "http://www.ft.com/cms/s/0/4feba1ec-3501-11e5-bdbb-35e55cbae175.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "country": "US", "title": "Executive pension tax breaks face axe", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Executive pension tax breaks face axe", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T00:02:00.000+03:00", "replies_count": 0, "uuid": "8c31f8dc3363a27f5fadcbc483143573562fb862"}, "author": "", "url": "http://www.ft.com/cms/s/0/4feba1ec-3501-11e5-bdbb-35e55cbae175.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Executive pension tax breaks face axe", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ros Altmann", "George Parker", "Josephine Cumbo"], "text": "Death knell sounds for UK executive pensions Josephine Cumbo and George Parker ©Reuters Pensions minister Ros Altmann said the review was 'genuinely open' \nMinisters are considering scrapping “regressive” pension tax breaks for higher earners, amid claims that executives at the UK’s biggest companies already plan to stop saving for their pensions. \nGeorge Osborne, chancellor, has been whittling away at pension tax relief, prompting claims that executive pensions could soon become a thing of the past. More Labour vets would-be voters for leader \nNow Ros Altmann, pensions minister , has confirmed that the government is considering abolishing the remaining special tax relief for high earners as part of a review of pensions. \nThe pensions expert and former consumer champion told the Financial Times that the current system, which offers extra tax relief to higher earners according to their tax band, was “bound to be regressive”. \nAsked if she favoured a flat rate of tax relief, Ms Altmann said: “That’s one of the things we will consider in the consultation.” \nShe added that the review was “genuinely open” and retaining the status quo was also an option. \nThe review is expected to conclude in October, allowing Mr Osborne to contemplate more pension reforms in his Autumn Statement. Higher earners are already making alternative plans. \nConsultants say previously announced moves by Mr Osborne to restrict pension tax relief , which come into force next year, will lead to the “death” of pension arrangements for the top rung of company management. \nBoardroom executives have moved away from pensions, as cuts to tax relief have made it more attractive to receive a cash top-up to their salary instead, even though pensions are tax-efficient. \nA survey of FTSE 100 companies predicts that this trend will accelerate thanks to the Summer Budget decision to introduce new curbs on top-end tax relief — a move described as “bonkers” by previous pensions minister Steve Webb . \nThe changes will see individuals with adjusted annual income of more than £150,000, including pension contributions, subjected to a tapered annual pension-saving allowance. However, people with incomes of £110,000 or more could also be caught by the taper if pension contributions, including their own and those paid by employers push them over the limit. \nActuarial consultants Lane Clark & Peacock, said the FTSE 100 executives who took part in its survey would be affected by the pension changes, which would mean that their annual tax-free pension allowance will drop from £40,000 to £10,000. \n“For the executives in our survey, this signals the end of the road as we know it for defined benefit and defined contribution executive pensions,” said Mark Jackson, partner with LCP. “As a consequence, we expect the move to cash will accelerate further over the next year. We expect the death of executive pensions by April.” \nMr Jackson said employers faced a “challenge” to communicate the tapered allowance and its “many moving parts” to employees. \nMr Webb, who was Liberal Democrat pensions minister in the 2010-2015 coalition, has been a fierce critic of the tapered allowance, saying it is far too complex to implement. \nUnder the reforms, for every £2 of income an individual has over £150,000, their annual allowance will be reduced by £1 until it has fallen to £10,000 for those earning £210,000 or more.", "external_links": [], "published": "2015-07-29T00:02:00.000+03:00", "crawled": "2015-07-29T18:14:48.476+03:00", "highlightTitle": ""}