{"organizations": [], "uuid": "29b5be48e3bbbae6a03ffe531bc66ccbd23cb7cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/13/usa-shell-arctic-idUSL2N0ZT26020150713", "country": "US", "title": "UPDATE 1-Shell's damaged Arctic drilling support ship heads to Oregon", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Shell's damaged Arctic drilling support ship heads to Oregon | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T01:30:00.000+03:00", "replies_count": 0, "uuid": "29b5be48e3bbbae6a03ffe531bc66ccbd23cb7cb"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/13/usa-shell-arctic-idUSL2N0ZT26020150713", "ord_in_thread": 0, "title": "UPDATE 1-Shell's damaged Arctic drilling support ship heads to Oregon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details, background on Portland port)\nBy Timothy Gardner\nJuly 13 (Reuters) - Royal Dutch Shell PLC said on Monday an icebreaker crucial to planned Arctic oil drilling will be sent to Portland, Oregon to repair a gash in its hull, but the issue is not expected to delay the beginning of drilling off Alaska later in July.\nShell crew on the Fennica icebreaker last week found the 39-inch (1 meter) gash in the hull, likely caused by an uncharted shoal. Voyage time between Portland and southern Alaska should not delay the company's plans to begin drilling off northern Alaska in the Chukchi Sea later this month, Shell spokesman Curtis Smith said.\nShell believes that drilling can proceed while the Fennica is being repaired so long as it does not extend into the undersea zone bearing oil and gas. It plans to build the foundations of wells and do other preparatory work before drilling into that zone.\n\"We do not anticipate any impact on our season as we don't expect to require the vessel until August,\" Smith said.\nThe Fennica is one of two ice management vessels in Shell's fleet of nearly 30 ships it expects to bring to the Chukchi off northern Alaska this summer. It contains the capping stack, or emergency equipment designed to contain a blown-out undersea well, required for the drilling.\nThe gash in the Fennica was the second recent setback to Shell's Arctic ambitions. On June 30, the Interior Department informed Shell that established walrus protections prevent it from drilling two wells simultaneously that are less than 15 miles (24 km) apart, which means the company has to adjust its drilling this year.\nThe Fennica is being repaired in Portland and not in ports in and near Seattle, where two Shell oil rigs had been stored before departing for Alaska, because those facilities are only available for light maintenance, Smith said.\nShell has not drilled in the Arctic since 2012 when after the summer drilling season, an enormous drilling rig it was leasing broke free and grounded. If Shell discovers oil, it could begin producing in 10 or 15 years. After this season, it will have spent about $7 billion on Arctic drilling off Alaska before producing oil.\nThe company needs two minor permits from the Department of Interior before it can start drilling. (Reporting by Timothy Gardner; Editing by Leslie Adler and Marguerita Choy)", "external_links": [], "published": "2015-07-14T01:30:00.000+03:00", "crawled": "2015-07-14T00:54:49.000+03:00", "highlightTitle": ""}