{"organizations": [], "uuid": "52e654081059a450f4c6174e89b1d97baa5ad759", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-technology/?format=rss", "section_title": "Technology News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/fed-daily-grind-top-20-171404167.html", "country": "GB", "title": "Fed up with the daily grind? These are the top 20 employers for work-life balance", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Fed up with the daily grind? These are the top 20 employers for work-life balance", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T08:00:00.000+03:00", "replies_count": 0, "uuid": "52e654081059a450f4c6174e89b1d97baa5ad759"}, "author": "", "url": "https://uk.finance.yahoo.com/news/fed-daily-grind-top-20-171404167.html", "ord_in_thread": 0, "title": "Fed up with the daily grind? These are the top 20 employers for work-life balance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "14,000.00 -250.00 \nThere's more time for fun if you work for one of these 20 companies in the UK \nThe UK has a reputation for poor work-life balance. Britons work some of the longest hours in Europe, with full-time workers putting in an average of 39.2 hours per week - although many are known to work well above 40. \nA quarter of professionals are dissatisfied with their work-life balance, research suggests, with Londoners the most unhappy over how much time they spend at the office. \nBut there are many companies making sure their employees have a good ratio between home and office life. \nJobs website Glassdoor has picked out the top 20 employers for work-life balance, based on reviews by employees. Companies were given a total score out of five and had to have a minimum of 20 reviews relating to work-life culture. \nHere are the top 10: \n= 1. Euromonitor International = \nScore: 4.6 out of 5 \nLondon-based market intelligence firm Euromonitor, which specialises in producing country-specific data such as beer sales across the world , takes first place for the UK company with the best work-life balance. Reviewers praised its \"relaxed environment\" and the fact there is little-to-no-work done outside office hours. \n\"9.30-5.30 hours in London is a rarity,\" said a research assistant currently working at the firm. \n= 2. Bank of England = \nScore: 4.6 \nThe Old Lady of Threadneedle Street, the UK's Central Bank, sets monetary policy and is responsible keeping the nation's economy stable. The Bank employs more than 3,500 people, working across roles including finance, IT and HR. \nThe company has a flexible benefits package which includes up to 35 days holiday for full-time staff. One analyst described the company culture as \"really warm, relaxing, not too much stress\", while an economist praised the bank for its \"excellent secondment opportunities and great indoor facilities\". Another said it was very easy to take time off. \n= 3. Mediamath = \nScore: 4.6 \nTechnology company Mediamath has received consistently good feedback from current and former employees. The company, which is headquartered in New (KOSDAQ: 160550.KQ - news ) York but has offices across Europe and Asia, was described by one London-based worker as a \"great company that cares about its employees, with great benefits like flexible work hours, free food, company drinks and team building\". \nAnother said the company \"respects personal and work life balance, enriching both simultaneously\". \n= 4. Unibet = \nScore: 4.6 \nOnline gambling company Unibet was praised by employees for its \"great people, opportunity to try new things and useful employee benefits\".[ \n• Are these the top 25 jobs in the UK? \n= 5. Equal Experts = \nScore: 4.6 \nSoftware (Xetra: 330400 - news ) company Equal Experts is frequently ranked as one of the best technology companies to work for in the UK. The company, which counts Camelot and Telefonica among its clients, was described as \"an amazing and inspiring place to work\" by a current employee, while others praised efforts made by the firm to organise team lunches and family barbecues. \n= 6. Holiday Extras = \nScore: 4.6 \nHoliday Extras, which was founded in 1983, arranges airport hotels at discounted rates for travellers looking for an overnight stay before a flight. Based in Kent, the company was praised for the way it treats its staff. \n“The flexible working is fantastic, and home life always comes first. The office is laid-back but everyone works hard, just as it should be,” said one employee. Another added there is \"always something going on that staff can get involved with, for example parties, career development and competitions\". \n= 7. Financial Force = \nScore: 4.5 \nCalifornian cloud applications company Financial Force was only founded in 2009, and the company places a high value on its staff. The firm's UK office is in Harrogate. \n\"The company is flexible on working hours, which makes it far easier to manage things like personal appointments, or having workmen visit your house etc,” said a UK-based software developer. \n= 8. Aspire = \nScore: 4.5 \nAspsire, a media and digital recruitment agency with offices in London and Manchester, received high praise from employees, with one saying the company makes improvements for staff its top priority. \n“With flexible working hours you can maintain a good work-life balance - after seven years of working here I still enjoy coming to work,” added a senior consultant. \n= 9. Swiss Re (Xetra: A1H81M - news ) = \nScore: 4.4 \nSwiss insurance company Swiss Re, which has its London headquarters in The Gherkin, was described as a great employer for those wanting flexible working. \"Training opportunities and support are provided, excellent salary and benefits, good work-life balance and friendly co-workers,\" said one business analyst. \n= 10. Pentland = \nScore: 4.4 \nPentland, the British family business that owns brands including Berghaus, Speedo and Kickers, recently notched up more than £2bn of sales for the first time in its history. \nThe firm is controlled by the Rubin family from its headquarters in Finchley, north London. “It's a great place to work, with a swimming pool, gym, staff shop and great restaurant,” said one employee. \n= 11-20 : = \n12. Hitachi Data Systems - score: 4.4 \n13. Standard & Poor's Rating Services - score: 4.4 \n14. HomeAway - score: 4.4 \n15. Peer 1 Hosting - score: 4.4 \n16. Investigo - score: 4.4", "external_links": [], "published": "2015-07-24T08:00:00.000+03:00", "crawled": "2015-07-24T08:26:48.677+03:00", "highlightTitle": ""}