{"organizations": ["Alabama Rouse Properties", "Bel Air", "Alabama Rouse Commences Major Redevelopment", "Bel Air Rouse Properties, Inc."], "uuid": "98aa0cbe052c37f429a348e6fe95a80cf69ac7be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/PropertyManagement", "section_title": "Yahoo! Finance: Property Management Industry News", "url": "http://finance.yahoo.com/news/rouse-properties-announces-belk-open-203800948.html", "country": "GB", "title": "Rouse Properties Announces Belk to Open Flagship Store at Bel Air in Mobile, Alabama", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Rouse Properties Announces Belk to Open Flagship Store at Bel Air in Mobile, Alabama", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T23:38:00.000+03:00", "replies_count": 0, "uuid": "98aa0cbe052c37f429a348e6fe95a80cf69ac7be"}, "author": "", "url": "http://finance.yahoo.com/news/rouse-properties-announces-belk-open-203800948.html", "ord_in_thread": 0, "title": "Rouse Properties Announces Belk to Open Flagship Store at Bel Air in Mobile, Alabama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rouse Properties Announces Belk to Open Flagship Store at Bel Air in Mobile, Alabama Rouse Commences Major Redevelopment and Will Rebrand the Center The Shoppes at Bel Air Rouse Properties, Inc. 1 hour ago  Done \nNEW YORK--(BUSINESS WIRE)-- \nRouse Properties, Inc. ( RSE ) (“Rouse”) today announced it has signed a lease with Belk, Inc. to open a new 237,000 square foot flagship store at The Shoppes at Bel Air in Mobile, Alabama. Belk will be taking the place of an existing Sears, and expanding on its already integral presence at The Shoppes at Bel Air. \nBelk is the nation’s largest family owned and operated department store retailer, with more than 300 fashion department stores in 16 states, offering premium brands of apparel, shoes and accessories for the whole family, in addition to large selection of cosmetics and home merchandise. \nRouse also announced it will commence a complete transformation of the center including the redevelopment of enclosed mall space into an engaging streetscape with retail and high-volume restaurant concepts fronting on Airport Boulevard. Rouse has recently executed a lease with first-to-market P.F. Chang’s, a national, upscale Asian restaurant chain, set to open a 6,000 square foot location, and Grimaldi’s Pizzeria, which will open a 3,500 square foot restaurant, both with entrances on the newly designed streetscape. As part of the transformation of the center, Rouse will perform an interior cosmetic revamp to update and enhance the common areas with new flooring, improved lighting, interior landscaping, soft seating, and high end finishes and amenities, complementing the free Wi-Fi which has already been installed throughout the entire center. Rouse is pleased to present these plans in conjunction with the support of the City of Mobile. \n“The combination of Belk’s expanded presence along with the planned renovations will help solidify The Shoppes at Bel Air as the dominant shopping destination in the Gulf Coast region” said Andrew Silberfein, President, and Chief Executive Officer of Rouse Properties. “When we acquired The Shoppes at Bel Air last year, we saw an incredible opportunity. The interest level from retailers has been even greater than anticipated, as evidenced by Belk’s confidence to open a flagship store and nearly double its footprint. We are creating a highly appealing experience which seamlessly mixes shopping, dining and entertainment options all under one roof and are excited about the future of The Shoppes at Bel Air” Silberfein added. \nAbout Rouse Properties \nRouse Properties, Inc. ( RSE ) is a publicly traded real estate investment trust headquartered in New York City and was founded on a legacy of innovation and creativity. Among the country's largest publicly traded regional mall owners, the Company's geographically diverse portfolio spans the United States from coast to coast, and includes 35 malls and retail centers in 21 states encompassing approximately 24.1 million square feet. For more information please visit: www.rouseproperties.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20150720006388/en/ Belk", "external_links": [], "published": "2015-07-20T23:38:00.000+03:00", "crawled": "2015-07-21T01:07:39.977+03:00", "highlightTitle": ""}