{"organizations": [], "uuid": "f3578f8bba4ac158ba09e45dcb18c1fb14aeb073", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/0/q/m/5/o/image.related.articleLeadwide.620x349.gi7i9j.png/1436321548165.jpg", "site_section": "http://www.smh.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.smh.com.au/business/banking-and-finance/sp-raises-risk-warning-on-australian-life-insurers-from-very-low-to-low-20150708-gi7i9j.html", "country": "AU", "title": "S&P raises risk warning on Australian life insurers, from 'very low' to 'low'", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "S&P raises risk warning on Australian life insurers, from 'very low' to 'low'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "f3578f8bba4ac158ba09e45dcb18c1fb14aeb073"}, "author": "Ruth Liew", "url": "http://www.smh.com.au/business/banking-and-finance/sp-raises-risk-warning-on-australian-life-insurers-from-very-low-to-low-20150708-gi7i9j.html", "ord_in_thread": 0, "title": "S&P raises risk warning on Australian life insurers, from 'very low' to 'low'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"We no longer consider Australia superior to other 'low risk' life insurance markets,\" says S&P. Photo: James Davies\nRatings house Standard & Poor's has dialled up its risk warnings for Australian life insurers after a spike in expensive claims and some of the worst business conditions on record.\nS&P's Ratings Services changed its insurance and industry country risk assessment for life companies to \"low\" from \"very low\", noting that the change did not affect Australian insurers directly.\nS&P analysts Mark Legge and Caroline Strahan said: \"The revised IICRA outcome reflects the structural deterioration in the performance of the life insurance risk sector over recent years, with lower returns that are related to higher claims costs, including prior-year reserve strengthening and heightened lapse rates.\n\"Although these issues have stabilised more recently, there is still potential for industry dislocation. As such, we no longer consider Australia superior to other 'low risk' life insurance markets.\"\nAdvertisement Australian life insurers have been slugged with a series of problems including worsening claims, high lapse rates from financial advisers moving clients between insurers to pocket bigger commissions, and lawyers encouraging clients to claim on life policies.\nAMP, Suncorp, NAB take hits Adding to the insurers' conundrum are dodgy financial advice practices, increasing scrutiny from the government, and worsening investment income amid volatile markets. Insurers such as AMP and Suncorp Life have taken hits to their bottom lines from the problems plaguing the industry. National Australia Bank struck a deal with a reinsurer to take on 21 per cent of its troubled retail life insurance book earlier this year.\nAssistant Treasurer Josh Frydenberg gave his support to a series of changes proposed by the life industry, including capping controversial advance commission for advisers to 60 per cent of a policy's premium cost in the first year by 2018. Advisers have criticised the reforms. Some, such as Russell Cain from Life Insurance Direct, say that if government and industry proposals go through, their business revenue could plunge to just 36.4 per cent of the value of the premiums they sell.\nCompounding industry pressures was increased competition in the wider wealth management industry, said S&P.\n\"While the wealth-management sector of the industry continues to produce good profitability, competitive tensions in the industry remain elevated,\" the analysts said.\n\"Recently proposed reforms, which include caps on upfront commission rates for financial advisers, might improve lapse rates. However, there remains some uncertainty as to whether these would discourage financial advisers from selling life insurance and shrink the pool of financial advisers actively involved in life insurance distribution.\"\nAustralia is one of eight countries to be assigned a \"low risk\" score for its life insurance sector, alongside France, Hong Kong, New Zealand, Singapore, Switzerland, the UK and US, according to the S&P ratings.", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-10T15:04:59.000+03:00", "highlightTitle": ""}