{"organizations": [], "uuid": "933dd28d795f6e7f009c4205bb9f37af1495a3d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-personal-household-goods/?format=rss", "section_title": "Personal & Household Goods News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/5-reasons-bullish-future-shares-143320126.html", "country": "US", "title": "5 Reasons To Be Bullish On The Future For Shares: National Grid plc, Royal Bank Of Scotland Group plc, Persimmon plc, Countrywide PLC & Electrocomponents plc", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "5 Reasons To Be Bullish On The Future For Shares: National Grid plc, Royal Bank Of Scotland Group plc, Persimmon plc, Countrywide PLC & Electrocomponents plc", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T17:33:00.000+03:00", "replies_count": 0, "uuid": "933dd28d795f6e7f009c4205bb9f37af1495a3d2"}, "author": "", "url": "https://uk.finance.yahoo.com/news/5-reasons-bullish-future-shares-143320126.html", "ord_in_thread": 0, "title": "5 Reasons To Be Bullish On The Future For Shares: National Grid plc, Royal Bank Of Scotland Group plc, Persimmon plc, Countrywide PLC & Electrocomponents plc", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "351.60 +6.50 \nWhile an agreement between Greece and its creditors may have been reached, defensive stocks such as National Grid (LSE: NG) still have huge appeal. A key reason for this is the company's attitude towards dividend per share increases, with it being committed to raising dividends by at least as much as inflation over the medium term. And, while inflation may be near-zero at the present time, history tells us that a low interest rate and improving global and UK economy are likely to mean that increases in the general price level are much higher in future years. \nFurthermore, National Grid already offers a very appealing yield of 5.2% and, with its shares trading on a price to earnings (P/E) ratio of just 14.7, it appears to offer good value as well as strong income prospects. \nAlso trading on a low valuation is RBS (LSE: RBS). Despite its share price having risen by 68% in the last three years and the bank now set to be highly profitable, it still trades on a P/E ratio of only 12.9. And, with the government having stated that it will aim to sell off half of its stake within the next two years, this could further improve sentiment in the bank. Meanwhile, its strategy of shrinking its balance sheet, divesting non-core assets and improving the efficiency of its business all contribute to a bright outlook that could lead to further upward reratings. \nOf course, house builders such as Persimmon (LSE: PSN) also have exceptional medium to long term prospects. They are set to benefit from a continued loose monetary policy, with Persimmon forecast to increase its earnings by 18% in the current year and by a further 14% next year. Certainly, interest rates will not remain at 0.5% indefinitely, but the scale of the supply/demand imbalance in the UK housing market as well as a managed rise in rates should mean that further double-digit earnings growth numbers are very achievable for Persimmon. \nAlso set to benefit from the booming property market is estate agent and property services company, Countrywide (LSE CWD). Like Persimmon, it has posted superb growth numbers in recent years and, with its bottom line set to rise at an annualised rate of 11.5% during the next two years, investor sentiment could pick up and help to continue Countrywide's share price rise that has seen it soar by 20% already this year. And, with it yielding 4.4%, Countrywide remains a superb income play - especially since it has a dividend coverage ratio of 1.75. \nClearly, when it comes to dividends, electronics distributor, Electrocomponents (LSE: ECM), takes some beating. That's because it currently yields a whopping 5.7% and, with its dividend coverage ratio set to reach 1.25 next year, its shareholder payouts appear to be reasonably sustainable. Furthermore, Electrocomponents is expected to post earnings growth of 11% in 2016 and, despite this, its shares have a price to earnings growth (PEG) ratio of just 1.3. This indicates that they offer growth at a very reasonable price and, alongside the likes of RBS, National Grid, Persimmon and Countrywide, look set to provide investors with considerable cheer over the medium to long term. \nOf course, finding great value stocks is never an easy task. That's why The Motley Fool has written a free and without obligation guide called 7 Simple Steps For Seeking Serious Wealth. \nIt's a step-by-step guide that could make a real difference to your portfolio returns in 2015 by helping you to find the best stocks at the lowest prices. \nClick here to get your copy - it's completely free and comes without any obligation. \nPeter Stephens owns shares of National Grid, Persimmon, and Royal Bank of Scotland Group. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-13T17:33:00.000+03:00", "crawled": "2015-07-14T00:17:04.000+03:00", "highlightTitle": ""}