{"organizations": [], "uuid": "43982e1c284d2708782492fa33d29fed69e72044", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/07/06/12832366/original_ben_flipped_r.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/07/prweb12832366.htm", "country": "US", "title": "ExpenseWatch Hosts Webinar on the Art of Managing Organizational Spending", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "ExpenseWatch Hosts Webinar on the Art of Managing Organizational Spending", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "43982e1c284d2708782492fa33d29fed69e72044"}, "author": "PRWEB", "url": "http://www.prweb.com/releases/2015/07/prweb12832366.htm", "ord_in_thread": 0, "title": "ExpenseWatch Hosts Webinar on the Art of Managing Organizational Spending", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"This webcast will give participants an understanding of the many benefits an automated spend management system can provide, not only in cost and time savings, but also in enabling a culture to manage organizational spending.\" Plymouth Meeting, PA\nParticipants can learn how to master the art of organizational spending in a special webcast presentation from ExpenseWatch, July 21, 2015 at 1 p.m. Eastern .\nTargeted to financial services organizations, this webcast will:\n Uncover what it really costs an organization to manage spending processes Learn about the spending challenges companies face and the benefits that can be achieved after implementing an automated system See ExpenseWatch in action and find out how automation can empower organizations to spend with confidence\nA special guest from Philadelphia Federal Credit Union will share how ExpenseWatch’s automated system has transformed organizational spending processes and opened the door to new levels of visibility and control not possible before, while achieving a 65 percent ROI from their investment.\n“Financial services organizations are experts at managing client assets,” said John Neri, vice president of sales and customer satisfaction for ExpenseWatch. “This webcast will give participants an understanding of the many benefits an automated spend management system can provide, not only in cost and time savings, but also in enabling a culture to manage organizational spending with the same diligence used to take care of client assets.”\nThe webcast is open to anyone interested in learning more about managing organizational spending and is especially targeted to financial services organizations, such as banks, credit unions, financial planners, financial consultants, insurance brokers, wealth managers, venture capitalists, and more. Participants may register for this event here .\nAbout ExpenseWatch ( http://www.ExpenseWatch.com )\nExpenseWatch automates manual, time consuming paper-based processes, for visibility and control over organizational spending, empowering customers to spend with confidence. Modules for expense reporting, purchasing and payable invoices resolve specific spending issues, or can be combined to provide a comprehensive spend management suite. The company was founded in 2000, released the first version of its spend control service in 2003, and currently manages almost $3 Billion in annual spend transactions on behalf of its customers. The company is privately held with headquarters in Plymouth Meeting, PA, a suburb of Philadelphia.\n###", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9hdHRlbmRlZS5nb3Rvd2ViaW5hci5jb20vcmVnaXN0ZXIvNzczNTEwNDI1MTM1Nzk1Nzg4OQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5leHBlbnNld2F0Y2guY29t"], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T23:47:36.000+03:00", "highlightTitle": ""}