{"organizations": [], "uuid": "0c9a225885ce6a1f39efe57ab2f3928ad062db19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/north-korea-economy-grows-1pc-093547526.html", "country": "US", "title": "North Korea economy 'grows 1pc' but remains crippled by food shortages", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "North Korea economy 'grows 1pc' but remains crippled by food shortages", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T12:35:00.000+03:00", "replies_count": 0, "uuid": "0c9a225885ce6a1f39efe57ab2f3928ad062db19"}, "author": "", "url": "https://uk.finance.yahoo.com/news/north-korea-economy-grows-1pc-093547526.html", "ord_in_thread": 0, "title": "North Korea economy 'grows 1pc' but remains crippled by food shortages", "locations": ["North Korea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 17, 2015, 10:49 BST - UK Markets close in 5 hrs 41 mins North Korea economy 'grows 1pc' but remains crippled by food shortages By Elizabeth Anderson | Telegraph – 13 minutes ago Print \nThe secretive nation's economy is now worth 34.2 trillion won but is facing a difficult year after the worst drought 'in a century' \nNorth Korea's economy grew at around 1pc in 2014, the fourth consecutive year of positive growth, according to South Korea's central bank. \nHowever, the figures are only an estimate as the secretive nation doesn't release economic data. South Korea economists use \"basic data compiled by related organisations\", which are thought to include figures based on satellite photos. \nThe Bank of Korea put the North's nominal gross national income at 34.2 trillion won (£19.05bn) in 2014 - equivalent to just 2.3pc of the South's economy. \nThe estimate does not take into account the North's sizeable black economy, which has grown significantly in recent years. \nFollowing a 0.5pc contraction in 2010, North Korea's economy is thought to have expanded 0.8pc in 2011, followed by 1.3pc in 2012 and 1.1pc in 2013. \nForeign trade increased slightly from £4.66bn in 2013 to £4.86bn, with exports shrinking 1.7pc during the year to £2.02bn, and imports up 7.8pc at £2.84bn. Clothes, textiles and coal are among North Korea's largest exports, and China is its main trading partner. \nChinese companies make up the bulk of North Korea’s investors and did $6.39bn (£4.24bn) worth of business in 2014. \nNorth Koreans sell small food items from a roadside stall on the outskirts of Pyongyang, North Korea \nHowever, the situation remains grim for North Korea's 25 million people, as the Communist country stagnates under the banner of economic \"self-sufficiency\" and rigid centralised planning. \nNominal GDP per capita in North Korea is among the lowest of any country in the world, ranking it 180th out of 193 countries according to the UN. Around half of the country's population, or 12 million people, are estimated to live in \"extreme poverty\". \nA drought this year is expected to compound food shortages. The state said last month it had been hit by its worst drought in a century, resulting in extensive damage to agriculture during its main planting season. \n• Six charts that show how North Korea became the most miserable place on earth \nThe United Nations says that approximately 70pc of North Korea's population are not able to access an adequate nutritious diet to live healthily, a legacy from a devastating famine in the 1990s saw between 600,000 and 2.5 million people die of hunger. \nNorth Korea leader Kim Jong-un \nThe state, led by Kim Jong-un, has strict controls on the movement of its people, and North Koreans are finding it more difficult than ever to flee the regime. \nJust 1,420 people defected to South Korea in 2013, according to the latest available data - down from 2,929 in 2009.", "external_links": [], "published": "2015-07-17T12:35:00.000+03:00", "crawled": "2015-07-17T12:52:05.000+03:00", "highlightTitle": ""}