{"organizations": [], "uuid": "80741473ec47c45568515a3b738c318e4fab2268", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/global-fatty-acids-supplements-market-112900053.html", "country": "US", "title": "Global Fatty Acids Supplements Market to Witness Growth in Most Segments Till 2020: PMR", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Global Fatty Acids Supplements Market to Witness Growth in Most Segments Till 2020: PMR", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T14:29:00.000+03:00", "replies_count": 0, "uuid": "80741473ec47c45568515a3b738c318e4fab2268"}, "author": "", "url": "https://uk.finance.yahoo.com/news/global-fatty-acids-supplements-market-112900053.html", "ord_in_thread": 0, "title": "Global Fatty Acids Supplements Market to Witness Growth in Most Segments Till 2020: PMR", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Content \nNEW YORK--(BUSINESS WIRE)-- \nPersistence Market Research has announced the release of a comprehensive research document titled “ Global Market Study on Fatty Acids Supplements: Marine Oil Segment to Witness Highest Growth by 2020 ”. \nBrowse Report: http://www.persistencemarketresearch.com/market-research/fatty-acids-supplements-market.asp \nThe report lists all the factors that contribute to the growth of the global fatty acids supplements market, including advancements in technology in and consumer preference of improving taste of fatty acids by controlling their oxidation. Other market drivers include health related advancements such as the use of fatty acids in eye treatment, and in therapeutic measures in heart diseases and hair issues. One of the biggest causes of an increase in consumption in the global fatty acids supplements market is the advent of geriatrics from the baby boomer population. \nThe largest region in the global fatty acids supplements market is North America. The region held nearly 35% of the omega-3 fatty acids’ market’s share in 2013. Europe is showing signs of increased consumption as well, after rising levels of awareness about the health benefits of omega-3 fatty acids. \nFull Press Release: http://www.persistencemarketresearch.com/mediarelease/fatty-acids-supplements-market.asp \nThe fastest growing region in the global fatty acids supplements market is Asia Pacific. More and more consumers are becoming conscious of their dietary requirements and the population as a whole is increasing rapidly in the Asia Pacific region. Within segments of the global fatty acids supplements market, marine oils were the largest. It weighed in at 102.7 tons in 2013 and will grow at a CAGR of 12.7% to reach 235.4 tons in 2020. \nThe dietary supplements segment was the largest of all the application segments. This segment grew at a CAGR of 8.5% from 2010 to 2013, to reach US$1,204.5 million in 2013. The highly consolidated market has 5 companies holding 75% of the market. \nThe global fatty acids supplements market is highly consolidated, with the top five companies holding around 75% market share. DSM leads the market, followed by Epax AS and Croda Health Care. \nRequest Sample: http://www.persistencemarketresearch.com/samples/2802 \nAbout Us \nPersistence Market Research (PMR) is an innovative provider of market research reports and consulting services. The three PMR pillars of strength that have helped us win clients for years are: Quality Research, Quick Research, and In-depth Research. View source version on businesswire.com: http://www.businesswire.com/news/home/20150710005252/en/ Contact:", "external_links": [], "published": "2015-07-10T14:29:00.000+03:00", "crawled": "2015-07-10T14:59:12.000+03:00", "highlightTitle": ""}