{"organizations": [], "uuid": "7d2653f06150fd2506729f5f2c52230d3e481f29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-oil-gas/?format=rss", "section_title": "Oil News | Gas News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/shell-cut-jobs-spending-cope-065142204.html", "country": "US", "title": "Shell to axe 6,500 jobs and cut spending to cope with lower oil prices", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Shell to axe 6,500 jobs and cut spending to cope with lower oil prices", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T12:58:00.000+03:00", "replies_count": 0, "uuid": "7d2653f06150fd2506729f5f2c52230d3e481f29"}, "author": "", "url": "https://uk.finance.yahoo.com/news/shell-cut-jobs-spending-cope-065142204.html", "ord_in_thread": 0, "title": "Shell to axe 6,500 jobs and cut spending to cope with lower oil prices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Jul 30, 2015, 09:48 BST - UK Markets close in 6 hrs 42 mins Shell to axe 6,500 jobs, cut spending to cope with lower oil prices Reuters - UK Focus – 40 minutes ago \n* Shell (LSE: RDSB.L - news ) slashes 2015 spending by 20 pct from 2014 \n* Q2 profits drop by 37 percent after oil price slump \n* Plans $30 bln asset disposals between 2016-2018 (Adds details, shares) \nBy Ron Bousso and Karolin Schaps \nLONDON, July 30 (Reuters) - Royal Dutch Shell (Xetra: R6C1.DE - news ) is to axe 6,500 jobs this year and step up spending cuts to deal with an extended period of lower oil prices which contributed to a 37 percent drop in the oil and gas group's second-quarter profits. \nThe Anglo-Dutch company also said it was planning more asset disposals as it pushes ahead with its proposed $70 billion acquisition of BG Group (LSE: BG.L - news ) , bringing total asset sales between 2014 and 2018 to $50 billion. \n\"We have to be resilient in a world where oil prices remain low for some time, whilst keeping an eye on recovery,\" Chief Executive Officer Ben van Beurden said. \nShell said it anticipated 6,500 staff and direct contractor reductions in 2015 from a total of nearly 100,000 employees. And the group said it would reduce 2015 capital investment for the second time this year to $30 billion, down by 20 percent from a year ago as it expects the downturn in oil prices to last for several years. \nBig oil companies have cut 2015 spending by 10 to 15 percent from 2014 to cope with a halving of oil prices over the past year to below $55 a barrel. Rivals BP and Total (Swiss: FP.SW - news ) announced further cuts this week. \nShell said its operating costs were expected to fall by $4 billion, or around 10 percent, in 2015 as part of a broad efficiency drive to boost its balance sheet. \nIt also expects $30 billion of asset sales between 2016 and 2018, on top of a total of $20 billion in disposals for 2014 and 2015 combined. \nThe company announced on Thursday the sale of a 33 percent stake in the Showa Shell refinery in Japan to Idemitsu for about $1.4 billion. \nBG DEAL \nShell hopes to complete its BG deal by early 2016 and is still awaiting key regulatory approvals from the European Union, China and Australia after Brazil, the United States and South Korea formally cleared it. \nThe deal is expected to generate pretax benefits of around $2.5 billion per year starting 2018. The tie-up will turn Shell into the world's leading liquefied natural gas company and one of the largest deepwater oil producers with a focus on Brazil. \n\"We see significant value in the combined entity which over time will reduce the breakeven price,\" analysts at Bernstein, who rate the stock as \"outperform\", said. \nShell shares rose more than 2 percent, while the European oil and gas sector was up just over 1 percent. \nShell's second-quarter cost of supplies earnings, excluding identified items, the company's definition of net income, came in at $3.835 billion, down from $6.13 billion a year earlier and $3.25 billion in the previous quarter. The results beat expectations of $3.18 billion, according to an analyst consensus provided by the company. \nThe drop in earnings is against a backdrop of lower oil prices, which averaged $60 a barrel in the second quarter of 2015, up around $5 a barrel from the previous quarter but down from $110 a barrel a year earlier. \nA sharp decline of around 75 percent in revenue from oil production was once again offset by refining and trading, where earnings more than doubled in the second quarter from a year earlier. \nShell maintained its quarterly dividend at 47 cents per share and committed to rewarding shareholders with at least the same payout in 2016. (Editing by Ed Davies and Jane Merriman)", "external_links": [], "published": "2015-07-30T12:58:00.000+03:00", "crawled": "2015-07-30T13:10:55.133+03:00", "highlightTitle": ""}