{"organizations": [], "uuid": "c994b762b66c48d49cd41f14a9d5698ac96c28bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/ile-camera/rss/627", "section_title": "Ile Camera : Personal Finance", "url": "http://business-news.thestreet.com/ile-camera/story/8-cars-with-the-most-cargo-space-you-can-buy/13227626", "country": "US", "title": "8 Cars With The Most Cargo Space You Can Buy", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "8 Cars With The Most Cargo Space You Can Buy", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T19:30:00.000+03:00", "replies_count": 0, "uuid": "c994b762b66c48d49cd41f14a9d5698ac96c28bc"}, "author": "", "url": "http://business-news.thestreet.com/ile-camera/story/8-cars-with-the-most-cargo-space-you-can-buy/13227626", "ord_in_thread": 0, "title": "8 Cars With The Most Cargo Space You Can Buy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Notte"], "text": "8 Cars With The Most Cargo Space You Can Buy Written by: Jason Notte 07/22/15 - 12:30 PM EDT \nNEW YORK ( MainStreet ) –- The final summer vacations are on the itinerary, the college freshmen are packing for school, the kids' practices are starting up again and those fall home sales are right around the corner. \nDoes your car have the cargo space to survive any of it? \nCargo space is getting tough to track and even tougher to purchase as automakers make cars lighter and more fuel efficient while packing in the perks. Beyond that, as the folks at Cars.com explained last year, there isn't a uniform standard for measuring a vehicle's interior volume, leaving most consumers scratching their heads about how much space they're actually getting. More Headlines You'll Be Surprised at How the Gift Tax Works -- And How It Might Impact Your Finances \nFortunately, there are independent arbiters keeping track of such things and making sure you can stuff in as much furniture, luggage, soccer gear, school supplies, beach chairs, storage trunks and other items as you can. We spoke with the folks at automotive pricing and review sites Edmunds and Kelley Blue Book about vehicle cargo space and received a deluge of data in return. In searching for the vehicles with the most cargo space, we eliminated pickup trucks -- which can be loaded in various configurations and measure their capacity in payload rather than cargo -- and cargo vans, which are generally limited to commercial use. \nAlong the way, we also had to trim designations for hybrid and luxury vehicles, as it brought up some awkward questions about the qualifications for each category. Instead, we pared down our selections to eight categories: Two-door hatchbacks, four-door hatchbacks, coupes, sedans, SUVs/crossovers, convertibles, wagons and minivans. In doing so, luxury and alternative-energy vehicles just kind of drifted to the top of some category lists: \nThe following eight vehicles have the most cavernous maximum cargo space of their class and a surprising amount of space even with all seats up. We leave it to you to determine which is the best fit for you and your stuff: 1", "external_links": [], "published": "2015-07-22T19:30:00.000+03:00", "crawled": "2015-07-22T20:07:21.958+03:00", "highlightTitle": ""}