{"organizations": [], "uuid": "1c52cbce80408b67a889d8579c26c5e81a8f042a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/im5GkrzfitjY/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-06/here-s-the-most-interesting-thing-in-gselevator-s-new-book", "country": "US", "title": "Here's the Most Interesting Thing in GSElevator's New Book", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "Here's the Most Interesting Thing in GSElevator's New Book - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T19:55:00.000+03:00", "replies_count": 0, "uuid": "1c52cbce80408b67a889d8579c26c5e81a8f042a"}, "author": "Tracy Alloway", "url": "http://www.bloomberg.com/news/articles/2015-07-06/here-s-the-most-interesting-thing-in-gselevator-s-new-book", "ord_in_thread": 0, "title": "Here's the Most Interesting Thing in GSElevator's New Book", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The most scandalous episodes in the new book by @GSElevator aren&apos;t the many salacious stories of deviance, debauchery, and excess but rather alleged bond market practices that include horse-trading of favors between bankers and investors—and a secret handshake agreement struck in a Hong Kong hotel.\nJohn Lefevre, who ran the GSElevator Twitter account anonymously before his identity was exposed by the New York Times last year, worked as a banker for several years in Asia (although not, crucially, for Goldman Sachs). While GSElevator&apos;s tweets and articles can veer toward the satirical, parts of his new book— Straight to Hell: True Tales of Deviance, Debauchery, and Billion-Dollar Deals— are worth exploring in relation to the wider bond market and the habits of syndicate bankers charged with selling bonds.\nWho are these syndicate bankers, you ask?\nMichael Lewis’s description in Liar&apos;s Poker remains the most compelling: They are the “omniscient, omnipotent, omnivorous presence” on every trading floor. They are the ones who connect would-be borrowers with would-be investors. And they have a unique position that straddles various banking functions, which means there are opportunities for all sorts of chicanery in relation to selling bonds on behalf of companies and governments.\nWhen it comes to the process of allocating new bond deals—that is, determining which investors will get the new debt and how much—a syndicate banker may come under pressure to ensure that clients of the bank in other areas, such as sales and trading, receive an outsize proportion.\nHere&apos;s an excerpt from GSElevator&apos;s book:\n\"Side deals and favor trading are still a huge part of the allocation process. It&apos;s amazing the number of times I get invited out by a hedge fund in the days leading up to the pricing of a hot deal. Sure, a nice bottle of wine over lunch will probably get him a few extra million bonds the next day. ... However, much of our allocation pressure also comes from within. If prime brokerage is wooing some hedge fund and they want to impress them, they call us and say, \"Take care of my guy on this deal, and then tell me before you release allocations.\" Their intention is to front-run the news by calling the hedge fund and taking credit for hooking them up with a generous allocation.\"\nMeanwhile, there&apos;s also the subject of fees charged by banks underwriting a bond deal. For instance, a relatively low fee of just 0.15 percent on a $1 billion bond deal will generate $1.5 million for the banks chosen to underwrite the transaction. Since multiple banks are often hired to underwrite a single deal, the temptation to \"sound each other out\" on fees can be a strong one.\nWhile bankers may compete with each other to do deals for ultra-low fees—since underwriting debt can lead to other types of business for the bank—they are loathe to do so for long.\nHere&apos;s GSElevator recounting one way banks sought to fight back against lower fees:\n\"There was actually an off-the-record meeting held at a hotel in Hong Kong several years ago, attended by most of the senior Asian syndicate managers from the big Wall Street firms, to try to stem the tide of banks undercutting one another on underwriting fees. I know because I was there. We covered the full spectrum, from high-yield corporates to sovereign frequent issuers—namely Indonesia, Korea, and the Philippines, where underwriting fees had dropped to as low as 0.02%. Some guys flew in from Singapore just to attend the meeting, and then following a handshake agreement, we all went out drinking. … The secret syndicate meeting was long overdue. We needed to find a better way—there wasn’t enough lucrative business to go around to sustain or subsidize doing deals for free, especially once we started cutting high-yield fees down under 1%. During this meeting, all the bankers agreed to set fees at minimum levels, and we all promised to not be the ones to break the agreement. Of course, a truce like that was never going to last long.\nWe reached out to a few bankers who were working in Asia around the time of the purported meeting. One former managing director in debt capital markets in Asia said he remembered the alleged 2007 agreement. Two others said they could not recall such an event, though oddly enough, they remembered a similar agreement struck in the aftermath of the financial crisis. All the bankers declined to be named for obvious reasons.\nThe book shines yet another unflattering light on a fuzzy corner of the global financial market that has remained stubbornly immune to stronger scrutiny. While the market for initial public offerings of stocks went through a period of intense regulatory scrutiny last decade, the corporate bond market has so far escaped a similar fate. An investigation by the U.S. Securities and Exchange Commission of \"allocations of and trading in fixed-income securities,\" which came to light a year ago , has yet to yield any public results. An SEC commissioner noted earlier this year that the securities watchdog employs just one person to supervise a corporate bond market that is now worth more than $7.8 trillion.\nIn other words, the practice of selling bonds remains a morass of opacity, and there seems to be little examination of the practices surrounding how the securities are issued. The bond market, it should be noted, has been on a multiyear bull run that some argue has helped to conceal structural weaknesses in the way such securities are initially priced, sold, and then traded. In recent years, as the competition to buy new-issue debt has intensified, there have also been accusations that banks have been favoring big, powerful investors when they sell hot new debt deals .\nIn their defense, syndicate bankers continuously describe the process of pricing bond deals as more of an art than a science. The challenge of judging market conditions, gauging investor demand for a new security, and creating a consensus within a disparate group of underwriters can be a tricky thing. Sometimes, these bankers say, it may make sense to put bonds in the hands of the biggest investors with the most influence and the deepest pockets.\nMark Leahy, who has held senior syndicate roles in Asia at such banks as Nomura, Deutsche Bank, and UBS, says: “I do think the lack of transparency and the subjectivity in the pricing is a flaw in the system. At the same time the counterpoint to that is the sheer difficulty of getting a multi-headed syndicate in a global deal to agree. That might mean there are some inefficiencies in the way a particular deal is allocated, but at least it&apos;s allocated. That kind of evens out in the long-run.\"\nStraight to Hell: True Tales of Deviance, Debauchery, and Billion-Dollar Deals is out July 14.", "external_links": ["http://www.bankofengland.co.uk/markets/Documents/femr/icma.pdf\\", "http://www.ft.com/intl/cms/s/0/55406aea-a30a-11e3-ba21-00144feab7de.html?siteedition=intl#axzz2uwdq8qqf\\", "http://dealbook.nytimes.com/2014/02/24/gselevator-tattletale-exposed-he-was-never-in-the-goldman-elevator/?_r=0\\", "https://twitter.com/gselevator\\", "http://www.ft.com/intl/cms/s/0/54b12ce2-c1a2-11e4-8b74-00144feab7de.html#axzz3dmz96k46\\", "http://www.bloombergview.com/articles/2014-03-05/sec-mad-that-banks-were-nice-to-their-best-clients\\"], "published": "2015-07-06T19:55:00.000+03:00", "crawled": "2015-07-06T15:25:52.000+03:00", "highlightTitle": ""}