{"organizations": [], "uuid": "66990075cad66d59c75be0cfcd418fa758c0e845", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiplinger.com", "main_image": "http://www.kiplinger.com/kipimages/pages/13685.jpg", "site_section": "http://www.kiplinger.com//about/rss/kiplinger.rss", "section_title": "Kiplinger's Personal Finance", "url": "http://www.kiplinger.com/article/investing/T052-C000-S002-negative-yields-fixed-income-bonds.html?rss_source=rss", "country": "US", "title": "Making Sense of Negative Bond Yields", "performance_score": 0, "site": "kiplinger.com", "participants_count": 0, "title_full": "Making Sense of Negative Bond Yields", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T07:00:00.000+03:00", "replies_count": 0, "uuid": "66990075cad66d59c75be0cfcd418fa758c0e845"}, "author": "", "url": "http://www.kiplinger.com/article/investing/T052-C000-S002-negative-yields-fixed-income-bonds.html?rss_source=rss", "ord_in_thread": 0, "title": "Making Sense of Negative Bond Yields", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gabriela Hasbun/Redux"], "text": "Making Sense of Negative Bond Yields Will you have to pay someone to hold your cash? Probably not. Follow @CarolynBigda Gabriela Hasbun/Redux \nKiplinger's spoke with Kathy Jones (pictured left), the fixed-income strategist at the Schwab Center for Financial Research, about the effects of global negative bond yields on investors. Here's an excerpt from our interview. \nA number of European bonds have had negative yields recently. What about in the U.S., where the rate on new I-bonds just hit a 0% floor, at least through October? We’ve seen extremely low yields and 0% rates, but not much in the way of negative yields. Since the financial crisis there have been momentary slips in, say, a very short-term T-bill. We’ve escaped negative yields because the U.S. generally has had positive economic growth and inflation. See Also: 9 Ways Retirement Savers Can Boost Investment Income \nWhy the negative yields in Europe? Protracted economic weakness there has led to several months of deflation. With no inflation to erode their purchasing power, investors accept lower yields. Also, the European Central Bank said earlier this year that it would buy bonds to stimulate economic growth. The amount of bonds that the ECB indicated it would buy was so great relative to the supply that it caused speculative buying, pushing down yields, which move in the opposite direction of prices. \nHow do negative yields work? Do you actually pay someone to hold your money? Say you buy a German T-bill. Usually, you’d buy at a discount. So, you might pay $99.50 and get back $100 at maturity. But in this case, you would pay $101 and get back $100 at maturity. You literally get back less than you deposited. But in periods of deflation, when prices overall are falling, even if you earn 0% or less on your savings, you still come out ahead. \nWhen will U.S. savers get some relief? The ECB has said that it will buy bonds through the end of September 2016. That will likely keep a lid on our rates because a lot of money invested in our market comes from overseas. A two-year Treasury, which today yields 0.7%, looks attractive relative to everywhere else in the world. Advertisement \nThe Federal Reserve is expected to start raising rates soon. Won’t that help? A rate hike here would attract a lot of money from abroad. So even if the Fed raises rates, our rates shouldn’t go up very much. \nWhat advice do you have for income-hungry investors? Buy intermediate-term bonds. A five-year Treasury bond yields 1.7%. Next year that becomes a four-year bond yielding 1.7% and the year after, a three-year bond yielding 1.7%. The Fed would have to raise rates a fair amount for that bond not to make sense. Or buy some high-quality, floating-rate notes. Their rates reset every 90 days, so they will adjust upward if the Fed starts raising rates. Right now, floating-rate notes yield about 1%. Not spectacular, but better than zero.", "external_links": [], "published": "2015-07-08T07:00:00.000+03:00", "crawled": "2015-07-08T15:53:29.000+03:00", "highlightTitle": ""}