{"organizations": [], "uuid": "10b6645c98a214b81b72840a4f4cb6e6e280b15c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/l/y/0/s/image.related.afrArticleLead.620x365.gilfrq.png/1438047980795.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/opinion/columnists/for-australians-houses-in-the-hamptons-are-cheap-20150728-gilfrq", "country": "AU", "title": "For Australians, houses in the Hamptons are cheap", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "For Australians, houses in the Hamptons are cheap | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T14:06:00.000+03:00", "replies_count": 0, "uuid": "10b6645c98a214b81b72840a4f4cb6e6e280b15c"}, "author": "Jennifer Hewett", "url": "http://www.afr.com/opinion/columnists/for-australians-houses-in-the-hamptons-are-cheap-20150728-gilfrq", "ord_in_thread": 0, "title": "For Australians, houses in the Hamptons are cheap", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This five-bedroom Hamptons-style home at 15 Mountain Road Austinmer is one of many luxury properties on the market that are tipped to sell for more than $1 million. Dusk.jpg lturk@illawarramercury.com.au Share on twitter by Jennifer Hewett Damn. I seem to have missed my moment. I too could have been part of the Hamptons set, sipping cocktails at all the best summer parties, mixing with the other glamorous people. Naturally wearing designer white, set off by some colourful jewellery and a smooth tan. And where's my red convertible?\nNow I know I should be concentrating on serious issues such as whether the Trans Pacific Partnership negotiations will succeed. Or what Labor's new ambition for renewable energy really means. Or why it's so hard to get back to trend growth in the Australian economy and what Joe Hockey is going to do about it (nothing much).\nBut perhaps because such alternatives are waiting to tax both my brain and my wallet. I have come back from a brief summer sojourn in the US irresponsibly obsessed with housing and lifestyle fantasies. Call me shallow – at least for a day or so.\nThis form of mental escapism actually started several years ago when I was amazed by Hamptons real estate prices. Not how high they were – but how remarkably low.\nOf course, this didn't include huge estates on hectares of tended lawns, tennis courts and pools by the ocean's edge, usually hidden behind massive thick hedges.\nEven when the Australian dollar was strong, I was never going to be quite up to the $US30 million or so required to set up my new imaginary luxury life.\nBut only a couple of kilometres from these mansions, in gloriously wooded quiet streets, there are also beautiful shingled homes of the classic Hamptons look. That includes graceful porches looking over large, lush gardens, five or six bedrooms and that indefinable sense of style.\nMore brutalist than beautiful More importantly, a lot of these homes were available at prices well under $US1 million ($1.3 million). As the Australian dollar strengthened and Australian house prices surged over the last few years, I held onto the dream – if never to any actual real estate proposition.\nThe psychological lure is still there, if more tantalisingly unrealistic. It's because the towns and villages of the Hamptons – near the end of Long Island and a few hours from Manhattan – are small and exquisite wonders of good taste and privilege. Nothing too brash permitted here, not even large supermarkets or big chain department stores. Certainly not freeways. Money offers its own protection from mass consumerism. Even beach parking handily requires evidence of residency to keep away the hordes.\nBut the Hamptons style always makes me wonder why so much of Australian architecture, even at the more expensive end, is so ugly. More brutalist than beautiful. And despite the natural glory of the Australian landscape, especially near the water, many of the houses and apartments are far nicer to look out of than to look at.\nYet what's been built or bought here comes at ever greater cost.\nWhen I mention the average house price in Sydney is now around $1 million ($US720,000) I am used to the stares of disbelief from the Hamptons denizens, even when converted into much lower sums courtesy of our now struggling exchange rate.\nNot that Hamptons prices have stood still while my thoughts and finances meandered through the last decade. After falling sharply when the enforced financial sobriety of the financial crisis reverberated around Wall Street, average prices have climbed again to be modestly above where they were, more so in the high end luxury market. These days, investment bankers no longer fear for their financial survival or how to pay the kids' school fees. The age of inequality is alive and well in Manhattan.\nAccording to the New York state Comptroller, Thomas diNapoli, Wall Street's bonus pool increased to $US28.5 billion last year. That directly translates into how many people are keen to purchase second homes in the Hamptons.\nSo the carefree summer crowds are flooding out to the Hamptons along the single lane road that defines the essence of selectivity and wealth. Locals complain the traffic is exponentially worse this summer.\nEven so, for a Sydney resident, or someone looking for a comfortable coastal holiday home or investment a couple of hours from the Sydney, Melbourne or Perth CBDs, real estate in the Hamptons still screams an unlikely \"bargain\".\nIn the local paper, I see I can buy what is described as \"East Hampton elegance\" for under $US2 million. A gorgeous looking two story shingle house with deck on an acre of land, four bedrooms, three bathrooms, chef's kitchen, heated Gunite pool (not that I am entirely sure what that is).\nIn nearby Bridgehampton, I spot a traditional looking farmhouse with its own waterfront dock, set on 1.53 acres of fertile looking land and overlooking a pond and 20 acres of agricultural reserve. All for $US1.75 million.\nFor more modest tastes and buying power, I can purchase a modern three level townhouse with deck and wooded land just 5 kilometres outside of East Hampton village for $US595,000.\nDespite the exchange rate that last option is close to some of the 1960s style unrenovated red brick apartments near where I live in Sydney. But even allowing for the big city premium, these house prices also look pretty appealing compared to far more stolid looking holiday houses on the Central Coast. Or in places like Victoria's Mornington Peninsula or Western Australia's Margaret River.\nSo that leaves the puzzle of why Australian house prices are so expensive relative to what those dollars buy. The comparison can't be all about demand exceeding supply (certainly not in the Hamptons). Or interminable arguments over negative gearing or low capital gains taxes (the US has both). But cheaper housing here is still more likely to result from a weaker economy than from any attempted policy fix. Style's another issue entirely. Sigh, back to reality.", "external_links": ["https://twitter.com/http://twitter.com/jennifer_hewett"], "published": "2015-07-27T14:06:00.000+03:00", "crawled": "2015-07-28T05:03:24.362+03:00", "highlightTitle": ""}