{"organizations": [], "uuid": "8b970898a90957a5d123b5ef50f134ea6f9d9a78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/cricket027715.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/what-is-left-of-cricket/42908.html", "country": "IN", "title": "What is left of Cricket?", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "What is left of Cricket?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T12:50:00.000+03:00", "replies_count": 0, "uuid": "8b970898a90957a5d123b5ef50f134ea6f9d9a78"}, "author": "Ramesh S Arunachalam", "url": "http://www.moneylife.in/article/what-is-left-of-cricket/42908.html", "ord_in_thread": 0, "title": "What is left of Cricket?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Life » Public Interest » What is left of Cricket? 42908 What is left of Cricket? 0 Comments, Be the first to comment Ramesh S Arunachalam | 27/07/2015 03:20 PM | The commercialisation of cricket, ably led by India, has wreaked havoc and will continue to take interest away from the game for cricket lovers With all the muck in Indian cricket flying around on a daily basis, there is very little of the game to look forward to although the proposed signing of the ‘conflict of interest declaration’ by all cricket administrators and others did send a hugely positive signal after a long, long time. And as a cricket lover, I can attest for the fact that in the recent years, we have rarely had the actual game and contests on the field dominating the headlines in India. First came the Lalit Modi extravaganza – what is now famously called as the “Indian Premier League” or IPL. Then came the string of serious controversies that dogged N Srinivasan’s tenure in his various capacities at the Board of Control for Cricket in India (BCCI) and these have indeed continued for a long time. In between, we had the molestation case in the IPL and related (IPL) scandals followed by betting and match fixing accusations (with supposed linkages to the underworld). In fact, a book even claimed that the International Cricket Council (ICC) World Cup semi-final match between Indian and Pakistan was claimed to be fixed in 2011 . And let us not forget the recent protesting cricketers from Bihar, who have even threatened to lock up the BCCI headquarters. And of the course, the icing on the cake is the suspension of Rajasthan Royals (RR) and Chennai Super Kings (CSK) as IPL teams coupled with the almost simultaneous let off of three cricketers whom, the former Delhi Police Commissioner (and currently, the chief advisor to BCCI’s Anti-Corruption Unit), Neeraj Kumar had proclaimed as guilty. Without any doubt, that the actual game of cricket has not hogged the limelight in India for several years now is very clear. All of these have left me thoroughly disillusioned with Indian cricket and as an ordinary fan, I have over the last few years turned my attention to the real cricket game which is played out so brilliantly between other countries such as Australia and England – aka The Ashes . And for cricket lovers like me who just want to see a good game of cricket, a great tussle is just building up in the ongoing England versus Australia Ashes (Investec) series, whose third test begins on 29 July 2015. While England trounced Australia by 169 runs in the first test at CARDIFF, in the second test at LORDS, Australia walloped England by over 400 runs – a huge margin by any standards. And one man again (albeit suddenly) seems to be looming large as England’s nemesis – the unpredictable Mitchell Johnson . The barmy army may have their Mitchell Johnson song and continue to jeer and boo him but good old Mitch had the last laugh at the Mecca of Cricket (LORDS) in the recently concluded second Ashes cricket test. And as in 2013-14, Mitch, if he gets it right, promises to be a major, if not key, difference between two sides whose cricket rivalry is unparalleled in terms of cricketing folklore. Fast bowling is an art and nothing more fascinating to view than a fast bowler at his prime and in full flow. Something which Mitchell Johnson did so briefly at the Mecca of cricket, LORDS, during the recent second Ashes (Investec) Test and hope he continues in the same vein. Never has one person dominated the animated post-match discussions as much as Mitchell Johnson has done in the recent years – whether it was in 2013-14 Ashes, South Africa (2014) or at LORDS on 19 July 2015. Just Google Ashes 2015 and Mitchell Johnson and you will see a large number of articles that carry his name and an analysis of his bowling clearly illustrating the psychological impact that he has had not just on the opposition but also the commentators and experts worldwide! What makes Mitchell Johnson dangerous as a fast bowler? Of course, he has the raw pace but more importantly, his slinging action means that batsmen rarely get to pick the length and line (of the ball) in advance. Besides, the transfer of the ball from right to left hand at the very last moment gives the batsmen very little advance cues about where the ball is going to actually land. The (mildly) swinging fuller ball that surprised Gary Ballance (and perhaps finished his career as England’s number 3 batsman) is a case in point as is the nasty bouncer that cost Moeen Ali his precious wicket. It is pertinent to note that if the ball had not got Moeen Ali’s wicket, it would have certainly grabbed his throat! And of course, add to this the unpredictability of Johnson’s wrist position at time of delivery – when wrong, his wrist sprays the ball on either side of the wicket as the barmy army song so correctly depicts but when in the right position, there is perhaps no better bowler in sight in today’s modern cricket game. In summary, several factors make Mitchell Johnson the demon he currently is: his raw pace, his natural skill to bowl in-swinging yorkers (especially), the inability of batsmen to pick and/ or predict line or length (in advance) due to his unconventional action, capacity to generate variable bounce apart from high speed and especially, overall unpredictability as a bowler. As a well-known commentator once argued , “ To watch terrifying fast bowling is one thing. To watch it on a flat pitch where no other bowler has been able to generate anything like the same sense of danger is quite another. Plenty of pacemen have succeeded when the going is fast, the bounce and carry providing ample encouragement, and even through the development of a pack mentality. But spells of the kind conjured by Johnson are rare enough to be summed up in the space of a single paragraph. ” And that is exactly what recently happened at LORDS during the second Ashes (Investec) Test when in a space of five balls after Tea on a supposedly placid DEAD wicket, he picked up Jos Butler and Moeen Ali so effortlessly and set the tongues wagging. So, folks do tune into the third Ashes Test at Edgbaston on 29th July as some great cricketing action is on the anvil. And as far as Indian cricket is concerned, the off field battles will continue as the multiple factions with their respective old boy’s network, backed by politicians of varying hues, continue to slug it out at the cost of the actual game. The commercialisation of cricket, so ably led by India, has wrecked havoc already and there is no doubt that it will continue to take interest away from the game for ordinary cricket lovers like me. And until that changes (although unlikely), people like me will hope to get their satisfaction from watching a real game of cricket across the world where contests between bat and ball are not riddled with controversies and politics, as in India. Ramesh S Arunachalam has been a novelist, columnist, entrepreneur, microfinance/ development practitioner, film maker and strategic advisor over the past 25 years. He has worked in financial sector regulation and supervision, financial inclusion, microfinance, livelihoods and MSMEs, Gender and microfinance, ERP systems for microfinance and infrastructure finance, urban development, infrastructure financing, GIS for urban planning and e Governance etc. Ramesh has completed over 240 professional assignments and worked in 546 districts of India apart from travelling/working in over 25 countries in Asia, Africa, North America, Europe and the Caribbean for diverse projects in senior positions. His clients have included governments, bi-lateral agencies, multi-lateral agencies, regulators, commercial banks, investment banks, microfinance institutions, private sector firms and several other stakeholders globally. He has authored numerous reports/studies/papers as part of his assignments, several of which have been published internationally and received global recognition. His blog on microfinance has been well received and he has also penned two books - The Journey of Indian Microfinance and An Idea Which Went Wrong: Commercial Microfinance in India – both of which, have received critical acclaim. His latest work is an entertaining crime thriller – Where Angels Prey – released in April 2015.", "external_links": [], "published": "2015-07-27T12:50:00.000+03:00", "crawled": "2015-07-27T13:52:33.084+03:00", "highlightTitle": ""}