{"organizations": ["Queen's Wharf"], "uuid": "bda151de23c563d74a753528f7e8574e8d4dcb65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/echo-wins-queens-wharf-tender-074208346.html", "country": "GB", "title": "Echo wins Queen's Wharf tender in Brisbane", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Echo wins Queen's Wharf tender in Brisbane", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T10:42:00.000+03:00", "replies_count": 0, "uuid": "bda151de23c563d74a753528f7e8574e8d4dcb65"}, "author": "", "url": "https://au.finance.yahoo.com/news/echo-wins-queens-wharf-tender-074208346.html", "ord_in_thread": 0, "title": "Echo wins Queen's Wharf tender in Brisbane", "locations": ["Brisbane AAP", "Brisbane Mon", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mon, Jul 20, 2015, 6:28 PM AEST - Australia Markets closed Echo wins Queen's Wharf tender in Brisbane AAP – 46 minutes ago Print \nEcho Entertainment has won the right to develop the prime riverfront land of the Queen's Wharf precinct in Brisbane. \nThe proposal from Echo, which operates the Treasury Casino in Brisbane, includes an iconic arc-shaped building with a ballroom, publicly accessible sky deck, 50 restaurants and bars, a new lyric theatre at South Bank and a moonlight cinema. \n\"We know what this means for Brisbane - making it a premium tourist destination,\" Premier Annastacia Palaszczuk said on Monday. @y7finance on Twitter, become a fan on Facebook AAP \nBIS Shrapnel associate director Kim Hawtrey expects 2014/15 was probably the peak in home building activity and … Terms \nQuotes are real-time for NASDAQ, NYSE, and NYSEAmex when available. See also delay times for other exchanges . Quotes and other information supplied by independent providers identified on the Yahoo! Finance partner page . Quotes are updated automatically, but will be turned off after 25 minutes of inactivity. Quotes are delayed at least 15 minutes. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. Neither Yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. By accessing the Yahoo! site, you agree not to redistribute the information found therein. \nFundamental company data provided by Capital IQ . Historical chart data and daily updates provided by Commodity Systems, Inc. (CSI) . International historical chart data and daily updates provided by Morningstar, Inc . Yahoo7 News Network", "external_links": [], "published": "2015-07-20T10:42:00.000+03:00", "crawled": "2015-07-20T11:30:01.407+03:00", "highlightTitle": ""}