{"organizations": [], "uuid": "5afcc326871aa26c6254077352f8e2131199112c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/48254255.cms", "site_section": "http://timesofindia.indiatimes.com/news/economy/finance/articlelist/1286551815.cms", "section_title": "News on Government Finance, Public Financing, Indian Finance | Economy News - Economic Times", "url": "http://timesofindia.indiatimes.com/world/china/China-conducts-air-sea-drills-in-South-China-Sea/articleshow/48254236.cms", "country": "IL", "title": "China conducts air, sea drills in South China Sea", "performance_score": 0, "site": "indiatimes.com", "participants_count": 6, "title_full": "China conducts air, sea drills in South China Sea - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T02:52:00.000+03:00", "replies_count": 5, "uuid": "54047deded2505fbac61ddc0dcf9acb7b4a6316e"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/world/china/China-conducts-air-sea-drills-in-South-China-Sea/articleshow/48254236.cms#post-0", "ord_in_thread": 0, "title": "China conducts air, sea drills in South China Sea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING: China said it conducted air and sea drills in the South China Sea on Tuesday as it stakes an increasingly assertive claim to virtually the whole sea despite rival claims by neighbors.\nThe live-ammunition drills involved more than 100 ships, dozens of aircraft, information warfare units as well as the nuclear force, the state-backed China Military Online said in a report posted on the defense ministry's website.\nIt did not specify where exactly the exercises took place.\nChina claims most of the potentially energy-rich South China Sea, through which $5 trillion in ship-borne trade passes every year, and rejects the rival claims of Vietnam, the Philippines, Brunei, Malaysia and Taiwan.\nThe United States has called on claimants to settle differences through talks and has said its Pacific Fleet aims to protect sea lanes critical to US trade with Southeast Asia and the oil-rich Middle East.\nChina rejects US involvement in the dispute and its more assertive approach recently, which has included land reclamation and construction on disputed reefs, has raised tension.\nThe latest exercises focused on integrating information warfare systems with air and naval forces, as well as testing the combat effectiveness of new weapons and equipment, China Military Online said.\nThe military achieved \"new breakthroughs\" in several areas including engaging high-speed low-altitude targets, anti-submarine warfare and intercepting supersonic anti-ship missiles with surface warships, it added.\nThe drills used \"all sorts of information technology tactics\" to create simulated reconnaissance, surveillance, and early warning systems to detect air and sea targets in real time, it said.\nThe exercises were conducted in \"a complex electromagnetic environment\" involving many types of missiles, torpedoes, shells and bombs, it said.\nChina's navy on Saturday played down its recent exercises in the South China Sea and criticized other countries for \"illegally\" occupying islands and reefs. http://timesofindia.indiatimes.com/followceleb.cms?alias=South China Sea,Sea Drills in South China Sea,China Military Online,air and sea drills Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-07-29T02:52:00.000+03:00", "crawled": "2015-07-28T19:44:17.252+03:00", "highlightTitle": ""}