{"organizations": [], "uuid": "4da46c7390cd9ed4357ed54f09ca98628cc3d7b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/airasia-s-reuters.jpg", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/companies/airasia-ceo-tony-fernandes-cried-after-last-years-plane-crash-report/106099", "country": "IE", "title": "AirAsia CEO Tony Fernandes cried after last year’s plane crash: report", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "AirAsia CEO Tony Fernandes cried after last year’s plane crash: report | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T23:11:00.000+03:00", "replies_count": 0, "uuid": "4da46c7390cd9ed4357ed54f09ca98628cc3d7b7"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/companies/airasia-ceo-tony-fernandes-cried-after-last-years-plane-crash-report/106099", "ord_in_thread": 0, "title": "AirAsia CEO Tony Fernandes cried after last year’s plane crash: report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles HolidayIQ to raise $15 mn from Makemytrip Wipro Q1 net profit up 4 per cent to Rs 2,188 crore Want to eat 'chips'? This London restaurant will offer you just that AirAsia CEO Tony Fernandes, a Malaysian of Indian-origin, cried after the crash of flight QZ8501 in December last year killing all 162 on board, but he wept in private so that his team would not be affected.\n51-year-old Fernandes said that words could not describe how he felt after the news broke that an AirAsia plane had disappeared on a flight from the Indonesian city of Surabaya to Singapore on December 28, 2014.\nSpeaking in an interview with a Singapore radio, 938LIVE, Fernandes said the aftermath of last year’s crash was an emotional period, Channel News Asia reported today.\n“I cried alone. I’ve never said that. I think when you’re with your people, you need to be as strong as possible,” he said.\n“The first step was, ‘Do I turn up or do I not go?’, and the first decision was ‘No, you shouldn’t go. This is the Indonesian airline'”, he added.\n“But the airline is so closely linked with me, it would have been wrong not to have gone and my staff needed me, my people needed me and most importantly, it had to be seen by the relatives that the very top was there,” Fernandes said.\nAll the 162 people on board died in the disaster.\nFernandes said while he needed to be seen as a leader, the tragedy had a deeply personal impact.\n“When you take a young woman back to her home to bury her, when you meet the families of our pilots, and whole families were wiped out. But whatever remorse you do feel, you can’t feel what they went through, so that’s very emotional,” he said.\nIn March, Indonesian search and rescue teams ended recovery operations in the Java Sea, where the plane’s fuselage and victims’ remains were found.\nA total of 56 people remain unaccounted for.\nFernandes is the founder of Tune Air and introduced the first budget no-frills airline, AirAsia, to Malaysians with the tagline “Now everyone can fly”.\nFernandes managed to turn AirAsia, a failing Malaysian government-linked commercial airline, into a highly successful budget airline and a publicly-listed company. AirAsia flies to six destinations in India.\n 23, 2015 3:11 pm", "external_links": [], "published": "2015-07-23T23:11:00.000+03:00", "crawled": "2015-07-23T14:56:13.459+03:00", "highlightTitle": ""}