{"organizations": [], "uuid": "5b932223d10a7cf3654bf847c06aad3bf31594d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "null", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-07-09/in-an-about-face-treasuries-post-gain-for-2015-as-stocks-fall", "country": "US", "title": "In an About Face, Treasuries Post Gain for 2015 as Stocks Fall", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "In an About Face, Treasuries Post Gain for 2015 as Stocks Fall - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T09:28:00.000+03:00", "replies_count": 0, "uuid": "5b932223d10a7cf3654bf847c06aad3bf31594d0"}, "author": "Wes Goodman", "url": "http://www.bloomberg.com/news/articles/2015-07-09/in-an-about-face-treasuries-post-gain-for-2015-as-stocks-fall", "ord_in_thread": 0, "title": "In an About Face, Treasuries Post Gain for 2015 as Stocks Fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Call it trading places in the financial markets. Treasuries are up for the year and U.S. shares are down -- an about face from just a few weeks ago.\nAfter rallying for five straight sessions as of Wednesday, the Bloomberg U.S. Treasury Bond Index has now returned 0.7 percent for 2015. That’s a relief for investors in the world’s biggest bond market following three months of losses from April through June. The Standard & Poor’s 500 Index is down 0.6 percent for the year, with the gauge falling from a record in May.\nWhat changed? Greece is struggling to stay in the euro currency union and Chinese shares are plunging, driving demand for the relative safety of U.S. government debt. The Federal Reserve acknowledged the potential risks from overseas crises, boosting speculation it will delay increasing interest until next year.\n“Stock prices have been overvalued,” said Yusuke Ito, a senior fund investor at Mizuho Asset Management in Tokyo. Greece and China “are going to be triggers for risky assets to come down. The decline in Treasury yields will continue” as prices rise, he said.\nThe benchmark 10-year U.S. yield was little changed at 2.20 percent as of 10:21 a.m. in Tokyo, according to Bloomberg Bond Trader data. The price of the 2.125 percent note due in May 2025 was 99 11/32. The yield fell to 2.17 percent Wednesday, the lowest level in five weeks.\nThe S&P 500 slumped 1.7 percent Wednesday to its lowest close since March.\nGreek Package Greece is working on an economic package to convince European leaders that it can keep the euro. The leaders of all 28 European Union countries will meet in Brussels on Sunday to decide their response.\nThe Shanghai Composite Index plunged almost 6 percent Wednesday, and it has fallen 32 percent from its June peak.\nFed officials in June saw the U.S. economy moving toward conditions that would support an interest-rate increase, according to the minutes of the meeting issued Wednesday. Some policy makers said consumer spending wasn’t meeting expectations, and several noted risks in China and Greece.\nThe central bank will raise borrowing costs in the first quarter of next year, according to a Morgan Stanley index that’s based on futures trading.", "external_links": [], "published": "2015-07-09T09:28:00.000+03:00", "crawled": "2015-07-09T04:51:18.000+03:00", "highlightTitle": ""}