{"organizations": ["SOCAR", "Statoil"], "uuid": "6227144536a599ff454de65e97f5cbe45bf4f497", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-utilities/?format=rss", "section_title": "Utilities News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/statoil-leave-tap-gas-pipeline-120948315.html", "country": "GB", "title": "Statoil to leave TAP gas pipeline project - Azerbaijan's SOCAR", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Statoil to leave TAP gas pipeline project - Azerbaijan's SOCAR", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T15:09:00.000+03:00", "replies_count": 0, "uuid": "6227144536a599ff454de65e97f5cbe45bf4f497"}, "author": "", "url": "https://uk.finance.yahoo.com/news/statoil-leave-tap-gas-pipeline-120948315.html", "ord_in_thread": 0, "title": "Statoil to leave TAP gas pipeline project - Azerbaijan's SOCAR", "locations": ["Azerbaijan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "+0.10 \n(Adds details, background) \nBAKU, July 20 (Reuters) - Norway's Statoil (Xetra: 675213 - news ) is to sell its 20-percent stake in the Trans Adriatic Gas Pipeline (TAP) project that will carry gas from Azerbaijan to Europe, the president of Azeri state energy firm SOCAR said. \n\"Statoil has decided to leave the TAP project completely, and there is a company which is ready to buy its stake,\" Rovnag Abdullayev told Azeri ANS TV late on Friday. \n\"Several companies have expressed an interest in buying Statoil's stake, and it would be better if several companies would buy it,\" he added. \nStatoil did not comment on the news. \n\"We generally do not comment on speculations on adjustments to our portfolio,\" Statoil's spokesman told Reuters. \nThe TAP pipeline is a part of project that is designed to transport 16 billion cubic metres (bcm) of gas from Azerbaijan's Shah Deniz II field in the Caspian Sea, one of the world's largest gas fields, by the end of the decade. \nThe 870 kilometre (545 mile) pipeline will connect with the Trans Anatolian Pipeline (TANAP) near the Turkish-Greek border at Kipoi, cross Greece and Albania and the Adriatic Sea, before reaching southern Italy. \nStatoil has already sold its shares in Azerbaijan's Shah Deniz gas field as well as the South Caucasus Pipeline (SCP) to SOCAR, BP and Malaysia's Petronas. \nItalian gas infrastructure company Snam (Milan: SRG.MI - news ) said last month that it could take a stake of up to 20 percent in the TAP project that is designed to reduce Europe's reliance on Russian gas. \nCEO Carlo Malacarne said that as gas buyers are signing binding, long-term ship-or-pay contracts for the Azeri gas, the transmission revenue is guaranteed and this opened the way for regulated infrastructure players like Snam to enter the project. \nOfficials decline to comment on the price, but insiders say a 20 percent TAP stake could be valued at around 400 million euros ($433.72 million). \nTAP's shareholders are BP (20 percent), SOCAR (20 percent), Statoil (Stockholm: 63644.ST - news ) (20 percent), Belgium's Fluxys (19 percent), Spain's Enagas (16 percent) and Swiss company Axpo (5 percent). ($1 = 0.9223 euros) (Reporting by Nailia Bagirova; Additional reporting by Nerijus Adomaitis; Writing by Margarita Antidze; Editing by Alexander Winning and Louise Heavens)", "external_links": [], "published": "2015-07-20T15:09:00.000+03:00", "crawled": "2015-07-20T16:32:12.643+03:00", "highlightTitle": ""}