{"organizations": [], "uuid": "51f0f0d0fb0d9c3d50e3f744749bed637f39a788", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/07/02/12829123/IMG_2547.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/07/prweb12829123.htm", "country": "US", "title": "Sean McGinnis Joins CLEARLINK as Executive Vice President of Home Services Marketing", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Sean McGinnis Joins CLEARLINK as Executive Vice President of Home Services Marketing", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "51f0f0d0fb0d9c3d50e3f744749bed637f39a788"}, "author": "PRWEB", "url": "http://www.prweb.com/releases/2015/07/prweb12829123.htm", "ord_in_thread": 0, "title": "Sean McGinnis Joins CLEARLINK as Executive Vice President of Home Services Marketing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There is nothing more inspiring than being part of a high-growth company. I am already inspired by both the people around me during the day and the beauty that Utah has to offe Salt Lake City, Utah\nSean McGinnis joins Salt Lake City, Utah-based CLEARLINK to lead the 100+ person home services digital marketing team. McGinnis and his family will relocate from Chicago, IL, where he served as a digital marketing executive at Sears Holdings Corporation.\n“My family and I were drawn to Utah because of the enormous opportunity to get outside and explore the many great places and mountains across the state, the active lifestyle and the incredible infrastructure and thought that went into making it all accessible,” said McGinnis. “There is nothing more inspiring than being part of a high-growth company. My role at CLEARLINK allows me to bring my three passions together: leading teams and people, having end-to-end marketing responsibility across a full breadth of digital channels, and being part of growing and thriving culture. I am already inspired by both the people around me during the day and the beauty that this area has to offer.”\nMcGinnis brings extensive experience building and leading marketing teams and deep knowledge across digital marketing practices. In his role, he will lead the search marketers, front-end developers, content strategists, affiliate marketers, web designers, community managers and outreach specialists that drive online traffic to a host of Fortune 500 brands in the home services sector. He will also be instrumental in continuing to foster the rich culture that draws top Utah sales professionals and marketers to CLEARLINK.\nPrior to Sears Holdings, McGinnis spent 14 years at Thomson Reuters in various roles, including three years leading a large search engine optimization (SEO) team for a legal web agency, FindLaw.\n“Sean’s passion for innovating and driving growth in the digital marketing field will continue to grow our partners’ business. His approach to work, team-building and enjoying life meld perfectly with our culture. His proven leadership skills will help guide the next chapter of CLEARLINK,” said Sam Funk, President of Home Services and CFO at CLEARLINK. “Not only are we fortunate to have him and his family as part of the CLEARLINK family, the Salt Lake community is getting an amazing addition.”\nTo learn more about CLEARLINK, watch the linked video . To see open jobs on the CLEARLINK marketing team visit here .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly92aW1lby5jb20vMTExNDY5ODM0", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5jbGVhcmxpbmsuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5jbGVhcmxpbmsuY29tL2pvYnMvc2FsdC1sYWtlLWNpdHktc2FsZXMtbWFya2V0aW5nLWpvYnMuaHRtbA=="], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-06T15:52:43.000+03:00", "highlightTitle": ""}