{"organizations": [], "uuid": "87582864280387f60c44b587e3daa2c8dd3b4d68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://specials-images.forbesimg.com/imageserve/472582764/640x434.jpg?fit=scale", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/mariannehudson/2015/07/22/avoiding-the-catch-22-of-angel-investing/", "country": "US", "title": "Avoiding The Catch-22 Of Angel Investing", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "Avoiding The Catch-22 Of Angel Investing - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T00:56:00.000+03:00", "replies_count": 0, "uuid": "87582864280387f60c44b587e3daa2c8dd3b4d68"}, "author": "Marianne Hudson", "url": "http://www.forbes.com/sites/mariannehudson/2015/07/22/avoiding-the-catch-22-of-angel-investing/", "ord_in_thread": 0, "title": "Avoiding The Catch-22 Of Angel Investing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Becoming a new angel investor is a Catch-22 . You need experience to be a good angel investor, but you can’t gain the experience until you actually invest.\nNew angels can really benefit from experienced angels for insider tips to start their angel journey. One great resource is Troy Knauss , vice chair of the Angel Resource Institute . He presented an ACA webinar on what new angels need to know before their first investment.\nKnauss’s first angel investment came about in the late 1980s, before there was much research to drawn on. So he did what others tend to do—go with their gut. He had the chance to invest in a wood composite decking material company and/or a plastic toy company.\nKnauss decided to invest all his $100,000 into the wood composite company. Unfortunately, after many years, he ended up with a $0 return on investment. The other company, K’NEX , would have made him $10 million. Ouch.\nIf only he knew then what he knows now. New angels can learn from this.\n“What I learned at that moment was portfolio diversification and the value of putting a little bit of money to work in a lot of deals. If I would have put $50,000 in each company, I still would have walked away with $5 million.”\nAll experienced angels have made mistakes along the way. Sometimes it takes a failure to learn what to do well. For new angel investors hoping to side step a few missteps, here are five key things to know before writing your first checks.\n(Andrew Caballero-Reynolds/AFP/Getty Images)\nKnow the Risks\nGetting to know your entrepreneur’s background and motivation is key to predicting whether the company will later produce a return on investment. So ask him/her a few key questions:\n“Are you looking for personal income this year or greater wealth down the road?” If they are looking for wealth, they are in it to make money long-term, a good indicator of potential ROI for an angel.\n“Is raising money just as important as the idea?” Another way to put this is “Are you interested in building a high growth business?” If the answer is yes, then as an angel you know this entrepreneur has the vision to bring the idea to fruition, another good indicator of ROI for an angel.\nAdditional questions to assess risk:\nIs the entrepreneur willing to give up control/ ownership of the company? Will the company have significant revenues in three to seven years? Is there potential for a significant return for investors? (strive for 10-20 times investment) Is the entrepreneur coachable and willing to listen? Is there a good exit strategy in three to seven years?\nPage 1 / 2 Continue", "external_links": ["http://www.knex.com/", "http://www.angelresource.org/", "https://www.anymeeting.com/WebConference-beta/RecordingDefault.aspx?c_psrid=E057DF84884C", "http://www.angelresourceinstitute.org/about-us/person.aspx?p=j0KQy4qpKUWm7I6ryMeYjQ&ar=7zjyFPuCxEWUj9cco-Zn5Q", "http://specials-images.forbesimg.com/imageserve/472582764/640x0.jpg?fit=scale"], "published": "2015-07-23T00:56:00.000+03:00", "crawled": "2015-07-23T02:20:34.542+03:00", "highlightTitle": ""}