{"organizations": [], "uuid": "633755a1c8e47bba28f942cb9457592f9b07b432", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/barclays-must-face-u-class-220106686.html", "country": "GB", "title": "Barclays must face U.S. class action over Libor", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Barclays must face U.S. class action over Libor", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T01:01:00.000+03:00", "replies_count": 0, "uuid": "633755a1c8e47bba28f942cb9457592f9b07b432"}, "author": "", "url": "https://uk.finance.yahoo.com/news/barclays-must-face-u-class-220106686.html", "ord_in_thread": 0, "title": "Barclays must face U.S. class action over Libor", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 04:14 BST - UK Markets open in 3 hrs 46 mins Barclays must face U.S. class action over Libor Reuters - UK Focus – 5 hours ago 0.00 \nBy Jonathan Stempel \nNEW YORK, Aug 20 (Reuters) - Barclays Plc (LSE: BARC.L - news ) shareholders who accused the British bank in a lawsuit of inflating its stock price by manipulating the interest rate known as Libor may pursue their case as a class action, a U.S (Other OTC: UBGXF - news ) . judge ruled on Thursday. \nU.S. District Judge Shira Scheindlin in Manhattan (Hamburg: 32U.HM - news ) , whose May 2013 dismissal of the case was overturned by an appeals court, said the claims were similar enough to justify letting the shareholders sue as a group. \nShe (Munich: SOQ.MU - news ) nonetheless said in a 77-page decision that the shareholders face \"significant obstacles\" to proving damages, including over whether any stock price inflation had dissipated once Barclays started reporting Libor accurately. \nClass actions make it easier for plaintiffs to recover larger sums at lower costs than if they sue individually. \nBarclays spokesman Marc Hazelton declined to comment. \nShareholders led by Carpenters Pension Trust Fund of St. Louis and the St. Clair Shores Police & Fire Retirement System in Michigan accused Barclays of inflating the price of its American depositary shares from July 10, 2007 to June 27, 2012. \nThe class period ended on the day Barclays agreed to pay roughly $453 million of fines in settlements with U.S. and British regulators, and admitted to artificially depressing Libor submissions from August 2007 to January 2009. Barclays' ADS price fell 12 percent the next day. \nShareholders said the depressed Libor submissions caused Barclays to understate its borrowing costs. \nThey also said defendant Robert Diamond, then Barclays' president and later its chief executive, deceived them on an Oct (HKSE: 3366-OL.HK - news ) . 31, 2008 conference call by denying that Barclays' borrowing costs were higher than those of rivals, and saying: \"We're categorically not paying higher rates in any currency.\" \nLibor underpins hundreds of trillions of dollars of transactions, and is used to set rates on credit cards, student loans and mortgages. \n\"We're very pleased that the judge is allowing us to move forward,\" said David Rosenfeld, a partner at Robbins Geller Rudman & Dowd representing the lead plaintiffs. \nSeveral other banks have also settled with U.S. and European regulators over alleged Libor manipulation. \nThe case is Carpenters Pension Trust Fund of St Louis et al v. Barclays Plc et al, U.S. District Court, Southern District of New York, No. 12-05329. \n(Reporting by Jonathan Stempel in New York; Editing by Christian Plumb)", "external_links": [], "published": "2015-08-21T01:01:00.000+03:00", "crawled": "2015-08-21T06:16:16.910+03:00", "highlightTitle": ""}