{"organizations": ["U.S. Chamber of Commerce", "GM", "Michigan Veterans Affairs Agency", "GM Supports Hiring Our Heroes Career Expo Joins Detroit Tigers"], "uuid": "1c0f31c42385fc3d163762437a0d4f63ccabfdab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125trstqt/*http://www.noodls.com/view/46ABAAD6C37C95385DD90421C4E0A8EC57A76238", "country": "GB", "title": "GM Supports Hiring Our Heroes Career Expo", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "GM Supports Hiring Our Heroes Career Expo", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T16:04:00.000+03:00", "replies_count": 0, "uuid": "1c0f31c42385fc3d163762437a0d4f63ccabfdab"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125trstqt/*http://www.noodls.com/view/46ABAAD6C37C95385DD90421C4E0A8EC57A76238", "ord_in_thread": 0, "title": "GM Supports Hiring Our Heroes Career Expo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close GM Supports Hiring Our Heroes Career Expo Joins Detroit Tigers, Michigan Veterans Affairs Agency and U.S. Chamber of Commerce to find jobs for military veterans \n2015-08-20 \nDETROIT - General Motors is partnering with the Detroit Tigers, Michigan Veterans Affairs Agency (MVAA), U.S. Chamber of Commerce and more than 50 local employers at a Hiring Our Heroes job fair and career training workshop for U.S. military veterans and their families today at Comerica Park. \nThe event begins with a career training expo at 9 a.m., followed by brief remarks and a hiring fair from 11:15 a.m. to 2:30 p.m. \n\"Our ongoing support of Hiring Our Heroes is a 'win-win' for our company, veterans and their families,\" said GM Chief Diversity Officer Ken Barrett, a retired U.S. Navy captain. \"The program offers our team access to a diverse and talented group of candidates while offering returning vets the opportunity to discover rewarding careers with top companies in their local community.\" \nU.S. military veteran members of the GM Veterans Group, GM Human Resources and the United Auto Workers (UAW) will answer prospective candidates' questions during the career fair. \nGM is a national supporter of the Hiring Our Heroes program, which has helped find jobs for more than 500,000 veterans since 2012. Earlier this year, GM was the only automaker independently recognized as a top employer for veterans by Military Times and MVAA. \nFor additional event details, visit hiringourheroes.org . \nAbout General Motors Co. General Motors Co. (NYSE:GM, TSX: GMM) and its partners produce vehicles in 30 countries, and the company has leadership positions in the world's largest and fastest-growing automotive markets. GM, its subsidiaries and joint venture entities sell vehicles under the Chevrolet, Cadillac, Baojun, Buick, GMC, Holden, Jiefang, Opel, Vauxhall and Wuling brands. More information on the company and its subsidiaries, including OnStar, a global leader in vehicle safety, security and information services, can be found at http://www.gm.com . \nAbout Hiring Our Heroes Hiring Our Heroes is a nationwide initiative to help veterans, transitioning service members, and military spouses find meaningful employment. Working with the U.S. Chamber of Commerce's vast network of state and local chambers and other strategic partners from the public, private and nonprofit sectors, Hiring Our Heroes has helped hundreds of thousands of veterans and military spouses find meaningful employment through more than 900 job fairs in all 50 states, Puerto Rico, the District of Columbia, and Germany; a suite of free online career-based resources; and the Hiring 500,000 Heroes campaign. \nThe U.S. Chamber of Commerce Foundation is dedicated to strengthening America's long-term competitiveness and educating the public on how the free enterprise system improves society and the economy. To learn more, visit HiringOurHeroes.org . \nTom Rippinger", "external_links": [], "published": "2015-08-20T16:04:00.000+03:00", "crawled": "2015-08-20T17:58:24.752+03:00", "highlightTitle": ""}