{"organizations": [], "uuid": "1e82661e6b863206348633783971b75e9d8a4ee7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/09/29/102041532-115648502.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss/rss.html", "section_title": "Finance", "url": "http://www.cnbc.com/2015/08/11/bill-gross-janus-fund-doing-well-but-still-seeing-outflows.html", "country": "US", "title": "Bill Gross Janus fund doing well, but still seeing outflows", "performance_score": 0, "site": "cnbc.com", "participants_count": 2, "title_full": "Bill Gross Janus fund doing well, but still seeing outflows", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 1, "uuid": "e4613064c00066b6b9347ccc657995e57b4ad4f4"}, "author": "Jeff Cox", "url": "http://www.cnbc.com/2015/08/11/bill-gross-janus-fund-doing-well-but-still-seeing-outflows.html#post-0", "ord_in_thread": 0, "title": "Bill Gross Janus fund doing well, but still seeing outflows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bill Gross discussion has 'subsided': Allianz CFO\nDr. Dieter Wemmer, CFO of Allianz, played down the continued impact of Bill Gross's departure from investment firm Pimco.\nInvestors continue to pull money out of Bill Gross' new bond fund, though the exodus slowed somewhat in July.\nDespite comparatively strong performance against its peers, the Janus Global Unconstrained Bond Fund saw $2.4 million in outflows for the month, bringing its total assets to $1.47 billion, according to data Morningstar released Tuesday.\nAs a percentage of total assets, the monthly outflows amount to less than two-tenths of a percent—essentially a rounding error—but are part of a recent pattern of flight from the fund. Gross started the Janus offering after his highly publicized departure from Pimco in September 2014.\nThe fund has surrendered $53.2 million over the past three months, thanks in large part to $39.1 million in June redemptions. Year to date, it has pulled in about $77.5 million, according to Morningstar. The fund's size pales in comparison to the one Gross ran at his old firm, the Pimco Total Return , which once boasted $292.6 billion in assets and was the largest in the world.\nRead More Pimco ETF outflows doubled ahead of SEC warning\nSince the departure of Gross and former Pimco CEO Mohamed El-Erian , Total Return has lost its No. 1 standing, with its assets slumping to $101 billion.\nPerformance-wise, the new Gross fund is holding its own, up 1.73 percent in total return year to date and, interestingly, 2 percent in the three-month time frame of high outflows, during which it has ranked in the top percentile compared to its peers, according to Morningstar.\nBond funds in general have struggled in 2015, with the Barclays U.S. Aggregate Bond index up just 0.4 percent year to date. By comparison, the S&P 500 stock market index has gained 1.25 percent, though the Dow Jones industrial average is off 2.3 percent.\nJanus officials declined comment for this report.", "external_links": [], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-11T20:08:32.454+03:00", "highlightTitle": ""}