{"organizations": [], "uuid": "351bed39a09c482f66e12cc660ffe4920c716eb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/n/q/x/c/image.related.thumbnail.320x214.gj9oy1.png/1440743468917.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/mining-and-resources/bhps-growing-pains-give-rio-edge-in-a-buyers-market-20150828-gj9oy1.html", "country": "AU", "title": "BHP's growing pains give Rio edge in a buyer's market", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "BHP's growing pains give Rio edge in a buyer's market", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "351bed39a09c482f66e12cc660ffe4920c716eb7"}, "author": "", "url": "http://www.smh.com.au/business/mining-and-resources/bhps-growing-pains-give-rio-edge-in-a-buyers-market-20150828-gj9oy1.html", "ord_in_thread": 0, "title": "BHP's growing pains give Rio edge in a buyer's market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Constant comparison is the lifeblood of the rivalry between BHP Billiton and Rio Tinto.\nEver since BHP failed to take over its smaller rival, the two big miners have moved in something akin to lockstep, challenging investors to tell them apart.\nBoth are spinning similar stories amid the current commodity rout – lower spending and improved productivity is allowing shareholder returns to be increased, despite sliding profits.\nBut there is always a difference to be found, and most analysts believe Rio has the edge, based on the less-compromised growth pipeline it has between now and 2020.\nAdvertisement \"We forecast Rio significantly outstrips BHP on a production basis over the next few years,\" Citi analyst Clarke Wilkins said earlier in August.\nPart of Rio's growth advantage comes from expectations that BHP will have an underwhelming 2016 financial year because of the Escondida copper mine churning through low-grade ore, lower output from fewer rigs in the US petroleum division, and reduced coking coal production with the Crinum mine closing.\nWhile Rio will also feel the impact of Escondida's downturn, it will should start to enjoy the benefits of the expanded Oyu Tolgoi copper mine in Mongolia, which documents leaking out of Mongolia on Friday morning showed should be approved in April 2016, with digging starting in June 2016.\nRio will also enjoy increased output at the Kennecott copper mine in the US, and has further growth to come in its world-beating iron ore division, not to mention the low-cost, top-tier bauxite project it is expected to develop near Weipa in this financial year.\nThose factors prompted Deutsche analyst Paul Young to describe Rio recently as having \"sector-leading\" growth prospects.\nShaw Stockbroking analyst Peter O'Connor agrees that BHP will have a tough 2016, but thinks the perception that BHP is lacking growth options has been exaggerated.\nHe said 2016 would not be not a good year for BHP in terms of growth but after that it would grow about a 4 per cent compound annual rate of growth.\n\"I think there is going to be better liberation of returns from that less-sexy volume growth than people are expecting.\"\nDifferent era Some investors had growth expectations that were more befitting the boom time, and needed to accept the mining sector had shifted into a different era, he said.\n\"We are back to what it used to be – things will grow at a typical GDP-type growth. Commodity prices will be more normal and based on marginal costs, not incentive prices, and growth will be in similar increments,\" he said.\nSo when trying to pick a winner in the mining sector, where should investors look?\nBoth companies have 50 per cent of their Australian analysts recommending a \"buy\", but in Britain, where a \"hold\" is the dominant rating for both miners, only 41 per cent are calling a \"buy\".\nBoth companies have few \"sell\" recommendations, but Rio attracts more in Australia and Britain.\nSince June 1, and excluding the South32 demerger, BHP has been sold down more than 13 per cent, while Rio has been sold down less than 12 per cent.\nMr O'Connor said Rio looked better for copper and iron ore, while BHP would achieve better than the average market return if oil prices rebounded.\nWith dividend yields for both companies near record highs, Mr O'Connor said this could be a rare occasion where selecting one over the other might not be necessary.\n\"If I was an investor I would happily buy either. They track each other in every metric over time, so you could buy one or the other, or both,\" he said.​", "external_links": [], "published": "2015-08-29T03:00:00.000+03:00", "crawled": "2015-08-30T07:13:23.790+03:00", "highlightTitle": ""}