{"organizations": [], "uuid": "a4937178fb3a567648c8d2449748cf9b5dc88ee9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/strange-ways-money-152007038.html", "country": "GB", "title": "Strange Ways To Make Money", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Strange Ways To Make Money", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T18:20:00.000+03:00", "replies_count": 0, "uuid": "a4937178fb3a567648c8d2449748cf9b5dc88ee9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/strange-ways-money-152007038.html", "ord_in_thread": 0, "title": "Strange Ways To Make Money", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 17:46 BST - UK Markets closed Strange Ways To Make Money By The Motley Fool Germany | Fool.co.uk – 1 hour 26 minutes ago \nHave you ever visited the website Tesla.com? If not, go ahead and do it right now, I'll wait. \nBack? \nIf you expected to see the homepage for the multi-billion dollar electric-car company Tesla , then you were probably surprised, because there's nothing there. \nWell, not quite nothing - there is a message noting that the domain has been \"parked,\" which means that somebody owns the domain and simply isn't using it. \n(If you're curious, Elon Musk's Tesla has its home at TeslaMotors.com) \nWhen I saw that Tesla.com was \"parked\", I was curious enough to do some digging. It turns out that Tesla.com is owned by a San Francisco gent named Stu Grossman, who originally registered the domain in 1992 . \nThere's a long and winding story behind Grossman and Tesla.com that includes a 2005 lawsuit in which a different business named Tesla (a U.S. military contractor called \"Tesla Industries\") tried to pry the domain away from Grossman. In short though, the Tesla.com domain is easily worth millions of dollars - a point that doesn't seem to matter to Grossman or his wife. The website \"Tesla 24/7\" put in a call to the Grossmans and wrote that \"it didn't interest them that the domain is so valuable.\" \nThe Grossmans are very unusual in that respect. \nIn fact, there are a heck of a lot of people out there that spend a lot of time, money, and effort buying and selling domain names, hoping to make a profit. There's a name for this pursuit (\"domaining\") and international conferences where domain buyers, sellers, and service providers to get together. \nNo such thing as a free lunch \nWith the right domain, the payoff can be huge. Consider these domain name sales over the past few years (data according to Business Insider): Medicare.com ($4.8 million, May 2014) IG.com ($4.7 million, September 2013) MI.com ($3.6 million, April 2014) Whisky.com ($3.1 million, March 2014) Sex.xxx ($3 million, June 2014) \nSome folks don't even bother selling their domains, they just \"park\" them and put Google ads on them. That way, the traffic that ends up on that page can lead to advertising revenue. You can imagine how lucrative that could be on a domain like Whiskey.com (though I'd still happily take the $3.1 million). \nSo clearly it's possible to make money with domaining. But like so many other ways to make money, it offers no free lunch. If you want to actually make money domaining, then you have to invest time and effort in finding the right domains, figuring out the \"right\" price to pay for those domains, remarketing them... and then hoping that somebody will come along and be willing to pay you a big premium for that domain. \nBy the time you've gone through all of that, you may wonder whether you're talking about an investment or a second job. \nAnd there are no guarantees that buyers will appear. Here's an excerpt from an article about a domain-name auction on Forbes ( \"After The Gold Rush: Domain Names Have Lost Their Glitter\" ): \nBy the time Ostrofsky's domain, mutualfunds.com, came up for sale precisely midway through the auction, to put it most diplomatically, things weren't going so well. Out of 32 domains offered for sale up to that point, 19 had gone unsold. Mutualfunds.com brought the count to 20. Ostrofsky shook his head as it went by, stood up and put on his coat as if getting ready to leave, then sat back down and stayed to watch 23 more domains go unsold. The investment-oriented domains that found buyers fetched nothing like the money he was hoping for: SellShort.com ($6,000) and ActiveStocks.com ($850). \nInvesting in stocks, of course, takes work as well. There are some investing approaches - like investing in low-cost index funds - that require much less work. But anyone that tries to tell you that you can make big money in stocks without doing any work is only telling you half of the story. \nStock investing offers far, far better opportunities \nThe difference with stock investing though, is that you're buying a piece of an operating business that is making money day after day, year after year, for you and its other shareholders. You have to do some work to find and invest in that company, but after you buy it, it's the company that starts working for you. \nA little over 20 years ago, Stu Grossman bought the domain Tesla.com. At the time, nobody cared because nobody cared much about domain names. As the legal filing for Tesla Industries, Inc. v. Stu Grossman put it, Grossman registered the Tesla domain name \"at a time when the World Wide Web, and websites themselves, did not exist, domain names were primarily used for email, gopher, ftp, telnet, and other services.\" \nIf we stretch the timeline in the other direction, twenty years from now the way we interact with the internet could be dramatically different and multi-million dollar addresses like Tesla.com could be essentially worthless. \nOn the other hand, when we think about the longevity of companies like Daimler , Siemens , and Coca-Cola , we can eagerly look forward to many years, if not decades, of compounding profits working in our favour as investors. \nIn other words, there are a lot of ways out there to make money. But I've seen few that offer the long-term rewards that stock investing does.", "external_links": [], "published": "2015-08-21T18:20:00.000+03:00", "crawled": "2015-08-21T19:46:51.248+03:00", "highlightTitle": ""}