{"organizations": [], "uuid": "f147b784720bc90f34fc9b170a3be7db3920ac03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/european-shares-slip-german-data-163945858.html", "country": "GB", "title": "European shares slip as German data disappoints", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "European shares slip as German data disappoints", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T19:39:00.000+03:00", "replies_count": 0, "uuid": "f147b784720bc90f34fc9b170a3be7db3920ac03"}, "author": "", "url": "https://uk.finance.yahoo.com/news/european-shares-slip-german-data-163945858.html", "ord_in_thread": 0, "title": "European shares slip as German data disappoints", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 7, 2015, 20:58 BST - UK Markets closed European shares slip as German data disappoints Reuters - UK Focus – 3 hours ago \n* German DAX falls as industrial output disappoints \n* U.S. Sept rate hike still seen on cards after jobs data \n* Monte Paschi posts second consecutive quarter of profit \n* Europe bourses in 2015: http://link.reuters.com/pap87v \n* Asset performance in 2015: http://link.reuters.com/gap87v \nBy Sudip Kar-Gupta \nLONDON, Aug 7 (Reuters) - European stocks fell on Friday, weighed down by the German market after an unexpected fall in industrial output there, while jobs data reinforced expectations of a U.S. interest rate rise soon. \nGermany's DAX fell 0.8 percent. The DAX is down about 7 percent from a record high reached in April, although it is up nearly 20 percent from the start of the year. \nThe pan-European FTSEurofirst 300 index and the euro zone's blue-chip Euro STOXX 50 index retreated by 0.9 percent and 0.8 percent respectively. \nGerman industrial output declined and exports fell more than expected, raising questions about the strength of the recovery in Europe's largest economy. \nEuropean shares also remained lower after the U.S. data. \nU.S. employment rose at a solid clip in July and wages rebounded after a surprise stall the month before, opening the door wider to a possible Federal Reserve interest rate hike in September. \n\"Many traders still believe that a rate hike will arrive in September or October,\" said ActivTrades chief market analyst Carlo Alberto de Casa. \nGreek stocks edged back up for the second day after steep losses earlier in the week caused by persistent concerns about Greece's debt problems. \nBelgian postal operator bpost sank 8.8 percent, making it the heaviest faller on the STOXX Europe 600, after its second-quarter earnings missed forecasts and it said it expected its regular mail business to decline more than previously expected. \nFinnish tyre maker Nokian Tyres (Other OTC: NKRKF - news ) also dropped 1.5 percent after a cut to its full-year profit forecast, while a fall in U.S. media stocks also hit their European peers on Friday. \nEarnings season has generally been encouraging, however. Fifty-seven percent of the companies on the STOXX 600 index have beaten or met profit expectations with their results so far, with 66 percent achieving or exceeding revenue estimates. \nBanca Monte dei Paschi (Milan: BMPS.MI - news ) di Siena rose 8.8 percent after it reported a second consecutive quarter of profit, as it continued a recovery after being hit hard by the euro zone debt crisis and a scandal over loss-making derivative trades. \nThe FTSEurofirst is up around 15 percent since the start of 2015, as economic stimulus measures from the European Central Bank (ECB) have propped up the region's stock markets, in spite of the worries over Greece. \nToday's European research round-up (Additional reporting by Alistair Smout; Editing by Alison Williams)", "external_links": [], "published": "2015-08-07T19:39:00.000+03:00", "crawled": "2015-08-07T22:59:49.864+03:00", "highlightTitle": ""}