{"organizations": [], "uuid": "5ab01c980cdaf2acf47b4ba82e64e45e13d82e42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/t/7/e/9/image.related.articleLeadwide.620x349.giqxyf.png/1439272183967.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2550/consumer-discretionary/retailing", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/money/insight/missing-money-could-bulk-up-your-super-20150804-giqxyf.html", "country": "AU", "title": "Long-lost savings can be reclaimed", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Long-lost savings can be reclaimed", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ab01c980cdaf2acf47b4ba82e64e45e13d82e42"}, "author": "", "url": "http://www.smh.com.au/money/insight/missing-money-could-bulk-up-your-super-20150804-giqxyf.html", "ord_in_thread": 0, "title": "Long-lost savings can be reclaimed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lost track of your super, visit the ATO section of the myGov web site and reconnect with it.\nHere's a simple way you may be able to avoid blowing hundreds, even thousands, of dollars on unnecessary superannuation fees.\nTo get more Money more often, why not follow us on Twitter? We’re @FairfaxMoney\nIf you've worked in a few jobs without taking an interest in super, there is a good chance you may have more than one super account, which are gobbling up extra fees.\nAdvertisement Merging these multiple funds into one may well be worthwhile. Sure, it sounds dull. But over the long term it could save you a packet. And thanks to technology, it's getting much easier to do.\nMore than six million Australians – just under half the group of people with super – have more than one super account in their name, the Tax Office says.\nThis is significant because the large number of excess accounts is one reason why the amount we spend on super fees is probably higher than it should be, at about $20 billion a year.\nIt can be easy to accumulate different super accounts when you change jobs because, let's face it, many of us are not really thinking about super at a time like this (if ever).\nWhen you start a job, you'll often be automatically put into a fund picked by the employer unless you nominate some other fund you'd prefer.\nThe problem with this is that many funds levy fees in a way that penalises people with multiple accounts.\nMost funds will charge every account a flat administration fee – which averages at $78 a year, SuperRatings says. If you have three accounts – as one in 10 people do – that means you're paying an extra $150 a year or so in unnecessary fees.\nThat is money that could have been earning returns. Over the years, it adds up to a big number.\nAccording to SuperRatings, if you paid the $78 fee for three accounts over an entire 40 years, it would end up costing you more than $10,000 when you retire.\nAside from being slugged with extra fees, if you don't keep track of your various super accounts you also run the risk of paying higher variable fees, which are levied as a percentage of your super balance.\nThe good news, however, is that digital technology has made it much easier to consolidate several super accounts into one.\nThrough the government website myGov, users can log into the Australian Tax Office section, which then provides a list of all the accounts in your name, and allows you to consolidate accounts.\nThe ATO says some 265,000 super accounts, holding $1.13 billion, were consolidated in the second half of last year.\nIt can also be a way to track down an old account that may have been classified as \"lost\" because the fund had been unable to contact you because of a change in address or name, or because it had become inactive.\nAccording to the ATO, there's some $16 billion in \"lost\" super waiting to be claimed.\nThe taxman suggests that before merging accounts, it is worth considering any life insurance policies that may attached to each product, as these will be cancelled when you close an account.\n@clancyyeates", "external_links": ["http://twitter.com/@FairfaxMoney", "http://twitter.com/@clancyyeates"], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-13T04:39:22.711+03:00", "highlightTitle": ""}