{"organizations": [], "uuid": "5957e01c4c33f992c93e757623dab51917d1d529", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/jn15htsggb_seth_tekper.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/636957/1/govt-target-new-investors-for-5year-bonds.html", "country": "US", "title": "Govt Target New Investors For 5year Bonds", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Govt Target New Investors For 5year Bonds", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T19:44:00.000+03:00", "replies_count": 0, "uuid": "5957e01c4c33f992c93e757623dab51917d1d529"}, "author": "", "url": "http://www.modernghana.com/news/636957/1/govt-target-new-investors-for-5year-bonds.html", "ord_in_thread": 0, "title": "Govt Target New Investors For 5year Bonds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Adnan Adams Mohammed"], "text": "  17 August 2015 17:44 CET Gov’t Target New Investors For 5year Bonds By Adnan Adams Mohammed \nA senior officer of the Finance and Economic Planning Ministry has alluded that, the new five year Government of Ghana bond to be issued in this month is targeting new crop of investors who previously were not targeted. \nHe mentioned that, the system before was not geared to target institutional investors, pension fund managers, insurance companies, unitrusts and mutual funds among others. \nDr. Sam Mensah, Technical Adviser to the ministry related to the Economy Times at the launching of a new approach for the issuance of government’s medium-term debt instruments that, the intention of government issuing the five year domestic bonds is to help draw the medium term local investors into the countries debt management system. \nThe ministry has therefore being interacting extensively with these targeted investors and trying to explain to them government plans and policies on the economic management and interest rate issues. \nFinance and Economic Planning Minister, Seth Terkper noted that as part of government’s renewed debt management strategies to minimise issuance of short-term debt instruments it is planning to issue a 5-year treasury bonds in coming days. \nThe Minister at the launch said the issuance, which is subject to market conditions, will have a total size up to GH¢500 million and will be governed by Ghanaian law and listed on the Ghana Stock Exchange. These bonds will be available for investment through the central bank appointed primary dealers. \nCurrently, short-term debts accounts for about 42 percent of the total domestic debt, a situation, Mr. Terkper said, deviates from government’s objective of developing the domestic market. \n“In our view, the skewed nature of the market has been partially due to the absence of commercially minded book runners or dealers who will engage with the target investors in the marketing of the medium-to long-term instruments. To achieve our objective, we will need to make special efforts to enhance the traditional auction to stimulate investor appetite for medium to long-term instrument,” he explained. \nMr. Terkper in the 2015 Budget statement said government is looking to try a new method that will involve a more direct engagement with segments of the market with an interest in medium to long-term instruments. \nAccording to the Minister, the proposed building approach compared to the auction process, involves more intensive engagement with the likely clientele for the medium to long-term instrument – institutional investors such as pension funds, insurance companies, mutual funds, provident funds and unit trusts. \nAs part of the process for the first issue, the Finance Ministry and the selected Joint Book Runners – Barclays Bank, Stanbic Bank and Strategic African Securities (SAS), organised several non-road show meetings in Accra. \nMr. Terkper dismissed assertions that the new approach will take over from short-term ddebts issuance. The issuance of 91-day, 182-day, among other short-term instruments, he said, will continue through the weekly Bank of Ghana auction. \nHowever, the new approach, if successful, will eventually be used for medium to long-term issues \nThe new approach is part of government key objectives of public debt management to promote the development of an efficient primary and secondary domestic securities market. \nMr. Terkper said the Ministry is aware that a well-developed domestic market is critical to government’s ability to mobilize funds to support infrastructure projects, more especially because of Ghana’s lower middle income status. \n“A well-developed domestic market will ensure financial stability and better integration into the global financial system and will then create a platform for private sector firms to diversify their sources of capital by tapping into the domestic market,” he added.", "external_links": [], "published": "2015-08-17T19:44:00.000+03:00", "crawled": "2015-08-17T20:36:10.017+03:00", "highlightTitle": ""}