{"organizations": [], "uuid": "c6fc395262b05bd893748004c9d88a6dc0a0d024", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/Rajeev-mehrishi-re-t.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/banking-finance/india-plans-to-amend-rbi-act-by-february-to-set-up-monetary-panel-rajiv-mehrishi/128116", "country": "IE", "title": "Govt plans to amend RBI Act by February to set up monetary panel: Rajiv Mehrishi", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Govt plans to amend RBI Act by February to set up monetary panel: Rajiv Mehrishi | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T22:18:00.000+03:00", "replies_count": 0, "uuid": "c6fc395262b05bd893748004c9d88a6dc0a0d024"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/india-plans-to-amend-rbi-act-by-february-to-set-up-monetary-panel-rajiv-mehrishi/128116", "ord_in_thread": 0, "title": "Govt plans to amend RBI Act by February to set up monetary panel: Rajiv Mehrishi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Indian government plans to change the Reserve Bank of India Act before the end of the fiscal year so it can set up a new committee to direct the country’s monetary policy, retiring Finance Secretary Rajiv Mehrishi told Reuters.\nThe committee would be comprised of appointees from the government, the Reserve Bank of India, and independent members appointed by the government, but any changes have to be approved by the parliament, which has blocked other government bills.\n“An attempt will be made to bring in by December. If it cannot be done by December, then of course by February,” Mehrishi said in an interview on Sunday, just before his last day in the job.\nThe central bank and finance ministry have been trying to resolve differences over the panel’s composition – chiefly over the balance of representation between government and RBI appointees.\nThe finance ministry last month signalled a willingness to retreat from a blueprint that would have ensured its effective control over a seven-member committee.\nRBI Governor Raghuram Rajan has said the central bank and government have reached a “broad consensus” on the composition of a rate panel, without disclosing details.\nMehrishi said the composition of the panel would reflect the views of Rajan, the government and lawmakers, but details would be disclosed first to the parliament.\n“His views have been noted and would be taken into account in making any decision. But what the decision is does not depend solely on the RBI governor,” Mehrishi said.\nThe government also plans to set up an independent public debt management agency (PDMA), mainly under New Delhi’s control, in the current fiscal year, which ends next March, he said.\nHe said the finance ministry had agreed in principle with the RBI to allow Indian bonds to be settled through Euroclear, the world’s largest securities settlement system, as part of efforts to boost capital inflows and deepen the bond market.\n“It is a FEMA (Foreign Exchange Management Act) requirement so RBI has to consult the government,” he said. “So we will respond to RBI. I think this week or latest by next week.”\nRBI officials were not immediately available for comment.\nRATES OUT OF SYNCH\nMehrishi said the RBI’s high policy rate – now at 7.25 percent – was out of synch as it was encouraging inflows of volatile “hot” money into Indian markets.\n“We have to find some kind of (middle way) via media where we do not incentivise the parking of hot money in India,” Mehrishi said.\nFinance Minister Arun Jaitley has called for lower rates to boost domestic demand and investments. However, under a historic monetary policy overhall agreed to between the RBI and the government in February, RBI Governor Rajan has a specific mandate to control inflation, meaning price stability takes priority in policy making.\nMehrishi said high interest rates were putting pressure on companies to borrow money abroad and making government borrowing more expensive.\nHowever, he said the central bank was the best judge to decide policy rates which have to be seen from monetary policy perspective as well as liquidity in the market.\n 31, 2015 2:18 pm", "external_links": [], "published": "2015-08-31T22:18:00.000+03:00", "crawled": "2015-08-31T22:13:47.960+03:00", "highlightTitle": ""}