{"organizations": [], "uuid": "895d09a9fdd6217615efb3569690546191fce81b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/3/7/n/z/5/image.related.articleLeadwide.620x349.gj6nsh.png/1440467355584.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4520/information-technology/technology-hardware-and-equipment", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/energy/oil-search-profit-jumps-thanks-to-png-lng-20150824-gj6nsh.html", "country": "AU", "title": "Oil Search profit jumps thanks to PNG LNG", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Oil Search profit jumps thanks to PNG LNG", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "895d09a9fdd6217615efb3569690546191fce81b"}, "author": "Angela Macdonald-Smith", "url": "http://www.smh.com.au/business/energy/oil-search-profit-jumps-thanks-to-png-lng-20150824-gj6nsh.html", "ord_in_thread": 0, "title": "Oil Search profit jumps thanks to PNG LNG", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Peter Botten has cut spending at Oil Search in response to low prices. Photo: Peter Rae\nOil Search has tripled its interim dividend after posting a 49 per cent jump in first-half profit to a record thanks to a full half of production from the Papua New Guinea liquefied natural gas project, which more than offset sharply lower prices.\nNet profit rose to $US227.5 million ($316 million) in the June half, in line with consensus, on sales that surged 69 per cent to $US863.8 million.\nOil Search declared a dividend of US6c per share, up from US2c a year earlier, but the stock still slid as much as 3.3 per cent to $5.62 in early trading as oil prices sank further.\nManaging director Peter Botten said Oil Search was planning for \"an extended period\" with no increase in oil prices, and is targeting operating and capital unit cost reductions of up to 20 per cent from 2016 onwards.\nAdvertisement He said Oil Search is aiming to cut $US2.50-$US3.50 per barrel from the costs of its operated oil and gas production, which was just under $US16 per barrel of oil equivalent in the first half. Cost reductions of between 10-25 per cent are coming through after negotiations with major suppliers, with more to come in the second half.\nThe efficiency measures would make Oil Search a \"much leaner and more efficient organisation,\" Mr Botten said.\nAt the same time, investment is continuing in exploration to provide future growth, he said, pointing to a drilling program over the next 18 months targeting 6 trillion-7 trillion cubic feet of gas resources.\nOil Search is also continuing to work towards expanding LNG capacity in PNG, both through the addition of a third production unit at the ExxonMobil-run PNG LNG venture and through the proposed Papua LNG venture tapping the Elk and Antelope gas fields.\nMr Botten said on a conference call that both projects remain \"very attractive\" even with the uncertainty over any oil price recovery.\nBut Citigroup analyst Dale Koenders said the timing for Oil Search's LNG expansion was \"slipping\", which he said was \"to be expected given current oil prices\".\nMr Koenders said in a note that a final investment decision on Papua LNG appears to be expected now only in 2018, while Oil Search is signalling a go-ahead for a third train at PNG LNG at the end of 2017, later than the mid-2017 timing he had anticipated.\nThe PNG LNG venture performed better than expected in the June half, contributing 10.94 million boe of production, up from 1.87 million boe in the first half of 2014, when the project was only just starting up.\nThat meant Oil Search's LNG and gas revenues surged more than five-fold to $US598.6 million in the half, despite the averaged realised price falling to $US10.19 per million British thermal units, down from $US14.20.\nThe oil price almost halved, to $US56.64 a barrel, driving down revenues from oil and condensate sales by 38 per cent.\nThe increased dividend represented a payout of 40 per cent, in line with the board's policy to distribute between 35 per cent and 50 per cent of core profit.\nOil Search already upgraded its full-year production guidance last month to 27 million-29 million boe, while unit production costs are expected to be $US9-$US11 per barrel, down $US1 from previous guidance. Capital costs this year are put at $US610 million-$US690 million.\nJulian Fowles, executive general manager of the PNG business unit, said on the teleconference that PNG LNG produced above its rated 6.9 million tonnes a year capacity in the first half, at about 7.1 million tonnes a year, and that could lift again this December half.\nHe emphasised that all PNG LNG's customers are taking delivery of their full contract volumes, scotching speculation that Sinopec could be minimising its purchases because of weak demand in China.\nMr Fowles said PNG LNG was also seeing \"extremely strong\" demand for spot LNG cargoes, despite ample supply.", "external_links": [], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-25T05:19:24.053+03:00", "highlightTitle": ""}