{"organizations": [], "uuid": "41b9bb88c06e27b9340808a17ee76ccdf2fa4ce3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iMwDe6royYhI/v2/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-10/won-slide-limits-bank-of-korea-rate-cut-options-on-outflow-risk", "country": "US", "title": "Won Slide Limits Bank of Korea Rate-Cut Options on Outflow Risk", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Won Slide Limits Bank of Korea Rate-Cut Options on Outflow Risk - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T04:49:00.000+03:00", "replies_count": 0, "uuid": "41b9bb88c06e27b9340808a17ee76ccdf2fa4ce3"}, "author": "Moonyoung Tae", "url": "http://www.bloomberg.com/news/articles/2015-08-10/won-slide-limits-bank-of-korea-rate-cut-options-on-outflow-risk", "ord_in_thread": 0, "title": "Won Slide Limits Bank of Korea Rate-Cut Options on Outflow Risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The risk of exacerbating capital outflows and the won’s slide to a three-year low isn’t giving the Bank of Korea much room to maneuver as its seeks to revive growth.\nAll 15 economists surveyed by Bloomberg see the monetary authority keeping its benchmark rate at a record-low 1.5 percent on Thursday, after reductions in March and June. Foreign funds have pulled $2 billion from Korean stocks this quarter, and sold a net $136 million of sovereign bonds last month, the first outflow from the debt market in data going back to 2011.\nAsian policy makers are grappling with slowing growth, pressure for weakening exchange rates and capital outflows, just as the U.S. Federal Reserve prepares to raise interest rates. Emerging-market central banks were among sellers of Korean debt in July as they sought to boost foreign-exchange reserves amid currency weakness, according to a BOK official.\n“The perception among investors that foreign holdings in Korea bonds will be sticky, as central banks account for a large proportion, may no longer be true,” said Seong Kiyong, a fixed-income strategist at Deutsche Bank AG in Hong Kong. “With the market consensus pointing to a weaker won, there doesn’t seem to be a need for additional easing.”\nReserves Drop While a falling currency improves the competitiveness of Korean exporters, the won’s 6.4 percent decline over the last three months is the worst performance in Asia after Malaysia’s ringgit and may be damping the attractiveness of Korean assets. The South Korean currency fell to 1,175.75 a dollar on July 31, the weakest since June 2012.\nForeign-exchange reserves dropped for the first time in six months in July, suggesting the BOK led by Governor Lee Ju Yeol sold dollars to curb the won’s decline.\nThe pace of the currency’s weakening has stoked outflow concern and the current level looks “worrisome,” Oh Suk Tae, a Seoul-based economist at SG Securities Co., a unit of Societe Generale SA, wrote in a July 28 note. He said he expects the BOK to stay on hold through the end of next year.\nFour interest-rate cuts over the past year haven’t been able to revive an economy where exports have fallen every month in 2015 and the deadly Middle East Respiratory Syndrome has damped domestic demand. Gross domestic product increased 2.2 percent in the second quarter from a year earlier, the least since the first three months of 2013.\nHousehold Debt Another rate cut wouldn’t have much impact on growth and could trigger a bubble in the real-estate market, BOK board member Moon Woo Sik said in a July 23 interview.\n“Economic growth has remained sluggish despite multiple rate cuts, which indicates the limited effects the cuts have had,” said Shin Hong Sup, a fixed-income strategist in Seoul at Samsung Securities Co., South Korea’s second-biggest brokerage by market value. “Household debt has soared, pointing to the difficulty of additional monetary easing.”\nHousehold liabilities rose for 16 months through May to a record 537.2 trillion won ($462 billion) before declining by 10.5 trillion won in June, central bank data show. A plan to implement stricter credit standards for mortgages was announced on July 22.\nInflows to South Korean bonds resumed this month, totaling $193 million through Aug. 7. The selloff in July is unlikely to continue, said the BOK official, who asked not to be named as he isn’t authorized to speak publicly. Won sovereign notes rose 1.6 percent in the last three months, the fourth-best performers among eight Asian nations, Bloomberg indexes show.\nLocals Dominate Foreign funds own 6.6 percent of won sovereign debt, according to Financial Supervisory Service figures, and have much less impact on the market than in countries like Indonesia where they hold 39 percent.\nThe capital outflows aren’t likely to affect Thursday’s rate decision, said Yoon Yeo Sam, a fixed-income analyst at Daewoo Securities Co. in Seoul.\n“Governor Lee won’t connect the outflows to his interest-rate policy,” he said, adding that he expected a cut to 1.25 percent in the fourth quarter.\nThe yield on forward contracts for three-month certificates of deposit was 7 basis points less than than that on the actual securities on Monday, falling from 10 basis points on July 24, suggesting expectations for a BOK reduction this week are fading.\nThe central bank is likely to stay on hold for the rest of the year, said Seo Hyang Mi, a fixed-income strategist at HI Investment & Securities Co. in Seoul.\n“The BOK is concerned about potential outflows,” she said. “That makes it difficult to lower rates.”\n\",\"byline\":\"Moonyoung Tae and Jiyeun Lee", "external_links": [], "published": "2015-08-11T04:49:00.000+03:00", "crawled": "2015-08-11T00:28:52.422+03:00", "highlightTitle": ""}