{"organizations": [], "uuid": "74bbbc04d51a3d90196c0817834cc4c0b3cb57b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.investors.com", "main_image": "http://www.investors.com/image/BIZ08-LKQ-ORLY-0803-co.jpg.cms", "site_section": "http://finance.yahoo.com/rss/headline?s=AAP", "section_title": "Yahoo! Finance: AAP News", "url": "http://news.investors.com/073115-764647-oreilly-automotive-lkq-gain-speed-after-solid-earnings.htm?ven=yahoocp&src=aurlled&ven=yahoo", "country": "US", "title": "How Much Can Top Auto Parts Store Profits Accelerate?", "performance_score": 0, "site": "investors.com", "participants_count": 0, "title_full": "How Much Can Top Auto Parts Store Profits Accelerate?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T01:58:00.000+03:00", "replies_count": 0, "uuid": "74bbbc04d51a3d90196c0817834cc4c0b3cb57b7"}, "author": "", "url": "http://news.investors.com/073115-764647-oreilly-automotive-lkq-gain-speed-after-solid-earnings.htm?ven=yahoocp&src=aurlled&ven=yahoo", "ord_in_thread": 0, "title": "How Much Can Top Auto Parts Store Profits Accelerate?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UBS Leads More Banking Stocks To New Highs \nBanking stocks continue to gain upward momentum, and Thursday's action proved no exception. UBS Group (NYSE:UBS) climbed 0.17 to 22.99 in pale volume. On a weekly basis, the stock is poised to make its best close in at least four years. The Swiss bank saw flat revenue in the second quarter at $10.4 ... 07/30/2015 07:00 PM ET Stocks Open Lower, Volume Rises; Skechers, Wynn Resorts Rumble Ahead \nStocks slumped out of the starting gate Thursday, with a weaker-than-expected GDP estimate and earnings news crimping early action. The Nasdaq shed 0.4%. So did the Dow Jones industrial average and the S&P 500. Small caps were under some additional pressure, with the Russell 2000 down 0.6%. ... 07/30/2015 10:38 AM ET \nO'Reilly Automotive (NASDAQ:ORLY) reported better-than-expected earnings growth late Wednesday and raised full-year guidance, sending the auto parts retailer's stock higher in after-hours action. O'Reilly earned $2.32 a share, up 21.5% vs. a year earlier and the 18th straight quarter of ... 07/29/2015 07:18 PM ET O'Reilly Zooms Past Estimates \n4 The auto-parts retailer grew Q2 EPS nearly 20% to $2.29, beating estimates by 3 cents as same-store sales surged 7.2%. O'Reilly Automotive (NASDAQ:ORLY) cited 15% or higher EPS growth 26 quarters in a row. Sales grew 22.4% to $2.26 bil, topping views for $2 bil. Shares rose in extended trading ... 07/29/2015 06:50 PM ET Did O'Reilly Automotive Operate In High Gear In Q2 \nDid O'Reilly Automotive (NASDAQ:ORLY) put the pedal to the metal and accelerate earnings growth in the second quarter? If analysts are right, the specialty retailer of aftermarket auto parts ran into a bit of a speed bump during the quarter, as it faced tough comparisons. O'Reilly has racked up 15 ... 07/27/2015 08:02 AM ET 1% Q2 Profit Growth Is S&P 500's Weakest Since '12 \nJust six companies are keeping second-quarter earnings growth in positive territory for S&P 500 businesses, which may suggest more softness to come. With 72% of S&P 500 companies having reported their performance in the last calendar quarter, earnings have grown a mere 0.9%. Revenue so far ... 07/31/2015 05:47 PM ET Semper Fly: Marines Say Lockheed F-35B Combat Ready \nThe Marine Corps version of Lockheed Martin's (NYSE:LMT) F-35 is now ready for combat, after receiving initial operational capability (IOC) status on Friday. The F-35B is the first version of the overbudget and behind-schedule stealth jet to reach IOC after a five-day operational readiness ... 07/31/2015 05:45 PM ET Beverage Companies Face Watered-Down Industry Trends \nAnyone searching for insight into the state of the nonalcoholic beverage industry should take a gander at last month's earnings from Coca-Cola, the global soft-drink giant that finds itself awash in challenges. On the bright side, Coca-Cola (NYSE:KO) beat consensus earnings and sales estimates when ... 07/31/2015 04:43 PM ET Exxon Profit Drops 51%, Chevron 90% On Low Oil Prices \nExxonMobil (NYSE:XOM) and Chevron (NYSE:CVX) reported mixed second-quarter results Friday as oil prices stayed down nearly 50% from a year ago. Exxon's Q2 earnings fell 51% to $1 per share, less than the $1.11 per share that analysts polled by Thomson Reuters were expecting. Revenue fell 33.6% to ... 07/31/2015 04:26 PM ET Valeant Missed Out On Botox But Hits With Other Buys \nIf not for acquisitions, Valeant Pharmaceuticals (NYSE:VRX) would hardly make it on a map of large and fast-growing drug companies. But not only has it earned a spot on such a map, it is all over the map. It sells everything from cancer and neurology drugs to cold remedies and toenail fungal ... 07/31/2015 04:03 PM ET", "external_links": [], "published": "2015-08-01T01:58:00.000+03:00", "crawled": "2015-08-01T10:54:52.250+03:00", "highlightTitle": ""}