{"organizations": [], "uuid": "5739bc3588e85b7a11cae8741a5e28e85d35c9b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/DTpuynHciA8L_hABJ0DQRg--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/US_AHTTP_AP_FINANCIALTIMES/2dbe2e33f0ec46227e0f6a7067009642_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/honolulu-council-expands-ban-complaints-001704736.html", "country": "GB", "title": "Honolulu council expands ban after complaints about homeless", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Honolulu council expands ban after complaints about homeless", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T04:08:00.000+03:00", "replies_count": 0, "uuid": "5739bc3588e85b7a11cae8741a5e28e85d35c9b7"}, "author": "", "url": "https://uk.finance.yahoo.com/news/honolulu-council-expands-ban-complaints-001704736.html", "ord_in_thread": 0, "title": "Honolulu council expands ban after complaints about homeless", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 6, 2015, 02:35 BST - UK Markets open in 5 hrs 25 mins Honolulu council expands ban after complaints about homeless Honolulu City Council votes to expand sit-lie ban following complaints about homeless people By Cathy Bussewitz, Associated Press | Associated Press – 27 minutes ago View Photo \nFILE - In this April 22, 2015 file photo, photo, Derek Villanueva, who is homeless, sleeps outside a … \nHONOLULU (AP) -- The Honolulu City Council voted to expand a ban on sitting and lying on sidewalks in an ongoing struggle to deal with homelessness that followed complaints from tourists about too many transients living near the beach. \nThe council approved two bills Wednesday extending the ban to pedestrian malls and the banks of city-owned streams, even though some members acknowledged the restrictions are ineffective and just pushing people around. \nHonolulu originally banned sitting and lying down in the hotspot Waikiki under pressure from the tourism industry. At the time, there were plans to create a safe zone for camping in an industrial part of the city, but that plan stalled. \nNow city and state officials are looking for additional sites to provide shelter. In the meantime, business owners and residents in other parts of Honolulu have complained about an influx of homeless people to their districts, leading to more bans. \nThe National Alliance to End Homelessness says Hawaii has the nation's second-highest number of homeless people per capita. The issue gained attention after state Rep. Tom Brower recently was attacked at a homeless encampment that grew to shelter hundreds of people after they were pushed out of neighborhoods like Waikiki. \nCouncilwoman Ann Kobayashi, who supports the bans, said because there was no designated place for displaced homeless people to go after leaving Waikiki, they just moved across the canal into her district. She said the bans aren't solving the problem, but she continues to support them. \n\"People are just moving wherever they can, and it's disrupting neighborhoods and local small businesses,\" Kobayashi said in an interview. \"We have to keep doing it piecemeal, because people kept moving to other areas.\" \nCritics say the bans are criminalizing homelessness and not solving the problem. \n\"We strongly oppose these bills because they are not humane,\" said Karen Ginoza, president of the nonprofit FACE Hawaii. \"We have watched the impact on people, and it has to be stopped, unless there's a place for people to go that is safe.\" \nHonolulu Mayor Kirk Caldwell introduced the first sit-lie bill, which applied to Waikiki, and then supported a later expansion to various business districts across Oahu. But he is unlikely to give the expansion to pedestrian malls his approval because of legal concerns, Caldwell spokesman Jesse Broder Van Dyke said in an email. \nCaldwell vetoed a previous expansion of the sit-lie ban, but the council overrode him. \n\"The mayor would be ill-advised to veto it,\" said Council Chairman Ernie Martin, adding that five members of the council have expressed support for an island-wide ban on sitting and lying on Oahu sidewalks. \nThere are 7,620 homeless people statewide, and half of them are unsheltered. About 4,900 homeless people live on Oahu. \n\"There is shelter space available on any given night for at least individuals,\" Caldwell said Monday. \"For families it is little bit more challenging.\" \nGov. David Ige recently assembled a new team of city, state and federal officials to work on the problem of homelessness, and the group is actively exploring various sites to expand shelter space. \n\"All of us have been working through our budgets to see what resources, what additional resources, we can make available once the leadership team identifies opportunities and projects that have the most promise,\" Ige told reporters Monday. \n___", "external_links": [], "published": "2015-08-06T04:08:00.000+03:00", "crawled": "2015-08-06T04:37:13.377+03:00", "highlightTitle": ""}