{"organizations": [], "uuid": "051e0d01c6eef6d216aac69392a7c9941928cf93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2014/10/20/12899739/live-very-well.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/liveverywell/vision-insurance/prweb12899739.htm", "country": "US", "title": "Live Very Well Launches Individual Vision Insurance Plans", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Live Very Well Launches Individual Vision Insurance Plans", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "051e0d01c6eef6d216aac69392a7c9941928cf93"}, "author": "Courtney Beyer", "url": "http://www.prweb.com/releases/liveverywell/vision-insurance/prweb12899739.htm", "ord_in_thread": 0, "title": "Live Very Well Launches Individual Vision Insurance Plans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Live Very Well is excited to announce the launch of individual vision insurance plans on LiveVeryWell.com. The multi-carrier insurance exchange platform offers individual vision and dental insurance with the unique ability to rate and review products, allowing consumers to compare, Quote: and match plans to meet their needs. Beginning today, Live Very Well will offer a variety of vision plan designs from some of the nation’s most-trusted carriers, including Direct Vision Insurance and Security Life Insurance Company of America. Available in 44 states, these plans cover a variety of budget and benefit needs so consumers can easily find their best fit.\nLive Very Well is an ideal solution for retirees, employers currently not offering employee benefits and independent, contract or part-time employees. With 1.65 million small business employers, over 10 million self-employed individuals and 41.5 million seniors, the demand for simplified vision coverage has never been greater.\n“There is a strong market demand for stand-alone individual vision insurance, and we are proud to respond to that need with the launch of individual vision plans on LiveVeryWell.com,” said Mark Zesbaugh, CEO of Live Very Well. “As the trend to private exchanges continues, Live Very Well is committed to continuously offering consumers a wide range of cost-effective insurance solutions from a variety of respectable carriers.”\nIn addition to the new vision plans, some enhancements have been made to LiveVeryWell.com to include a shopping cart experience, allowing Live Very Well to evolve into an easy-to-use, multi-insurance policy purchasing solution for consumers.\nAbout Live Very Well\nLive Very Well is a private insurance exchange that offers a selection of dental and vision insurance plans from leading insurance companies. With products available for sale in all 50 states, plans are available to Quote: , compare and purchase online. Thanks to the innovative website, online tools, education resources and knowledgeable licensed insurance agents, individuals and families will discover that purchasing insurance can be simple and affordable. LiveVeryWell.com .\nAbout Direct Vision Insurance\nThe Direct Vision Insurance program, currently available in 42 states, is marked by Direct Benefits, Inc., a managing general agency that provides individual benefits via a network of more than 7,000 independent agents, brokers, consultants and general agents. Started in 2001, Direct Benefit’s mission is to provide individuals with quality insurance products by partnering with financially strong insurance carriers to create exclusive niche products like Direct Vision. The Direct Vision Insurance products are underwritten and administered by Security Life Insurance Company of America.\nAbout Security Life Insurance Company of America\nSecurity Life specializes in the ancillary benefits market, providing dental, vision, disability and life insurance products and services to consumers and employer groups. In close relationships with its distribution network of general agencies and strategic partners, Security Life is concentrated in individual insurance and small-to-mid size employer group business. Security Life has products available to market in 50 states (in conjunction with Security Heath Insurance Company of America, New York, Inc.).", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5saXZldmVyeXdlbGwuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5MaXZlVmVyeVdlbGwuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5kaXJlY3R2aXNpb25pbnN1cmFuY2UuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5zZWN1cml0eWxpZmUuY29t"], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-13T08:12:16.221+03:00", "highlightTitle": ""}