{"organizations": ["Regional Integration Uganda"], "uuid": "47d614f4b0b63ea191ac5dc214e64a8a0fbe8c8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508171570.html", "country": "US", "title": "Uganda: Kenya's Selfishness On Sugar Trade Is Not Good for Regional Integration", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Uganda: Kenya's Selfishness On Sugar Trade Is Not Good for Regional Integration", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T14:18:00.000+03:00", "replies_count": 0, "uuid": "47d614f4b0b63ea191ac5dc214e64a8a0fbe8c8f"}, "author": "", "url": "http://allafrica.com/stories/201508171570.html", "ord_in_thread": 0, "title": "Uganda: Kenya's Selfishness On Sugar Trade Is Not Good for Regional Integration", "locations": ["Kenya", "Uganda"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Uganda: Smelling Uganda's Coffee Aroma \nWhen the information reached the Kenyan public, however, opposition political leaders led by Kenya's former Prime Minister Raila Odinga criticised the decision, claiming that allowing Ugandan sugar imports could lead to the collapse of Kenya's own manufacturers of the sweetener. \nPresident Kenyatta has not been cowed though, and asserted late last week that he would rather import sugar from Uganda to foster regional integration than shut down the door on Kenya's neighbour but still import the same commodity directly from overseas. \nThis is not the first time that Kenya has blocked the importation of commodities from Uganda at a time when East African Community (EAC) leaders are working to improve the integration of the five countries in the regional bloc. \nNot so long ago, Kenya had instituted a ban on the importation of day-old chicks and other poultry products from Uganda. That ban lasted more than 10 years before any meaningful attempt was made to resolve it. \nThe irony is that Uganda was until recently the world's leading export destination for goods from Kenya, according to a 2014 analysis by the Kenya National Bureau of Statistics (KNBS). Uganda was only overtaken by Tanzania in 2014, says KNBS, although Kenya still exports goods worth $739.6 million (about 12 per cent of Kenya's exports) to Uganda. \nCurrently, Uganda is dotted with all kinds of businesses from Kenya, including Nakumatt, Tuskys and Uchumi supermarkets, KCB, Equity and Fina banks, and a handful of insurance companies. These, and other Kenyan businesses, are operating in Uganda or selling their goods unhindered, reaping the fruits of regional integration in the process. \nIt is, therefore, very selfish of some sections of the Kenyan society, more so its leadership, to try to shut Ugandan goods out of the Kenyan market when their own goods are enjoying unfettered access to the Ugandan market. \nIf Kenya, as the largest economy in East Africa, really wants the EAC to grow and benefit everyone, then they must be open to allowing their neighbours to also access its market. Kenya can't have its cake and eat it too. Uganda \nBetty Oweka Ojok, a registered midwife, joined St Joseph's Hospital in Kitgum in 2003, the hospital was implementing the … see more » Copyright © 2015 The Observer. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-17T14:18:00.000+03:00", "crawled": "2015-08-17T16:50:57.092+03:00", "highlightTitle": ""}