{"organizations": [], "uuid": "9e623dc3c7fa74e2d4a438bd798a446f8d6b920d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508160147.html", "country": "US", "title": "Zimbabwe: Hotelier African Sun Culls Top Management in Shake-Up", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Hotelier African Sun Culls Top Management in Shake-Up", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T19:36:00.000+03:00", "replies_count": 0, "uuid": "9e623dc3c7fa74e2d4a438bd798a446f8d6b920d"}, "author": "", "url": "http://allafrica.com/stories/201508160147.html", "ord_in_thread": 0, "title": "Zimbabwe: Hotelier African Sun Culls Top Management in Shake-Up", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Mugabe Recalls Parliament Over Job Losses - Report \nMarket sources and documents in the possession of The Source indicate that the hotel group has done away with management positions such as group operations director, supply chain manager, payroll manager, systems support manager, central reservations and revenue manager, marketing manager, internal auditor and senior auditor. \nAfrican Sun's group human resources director, Elijah Nyakurerwa, told staffers on Thursday that all operational oversight functions were now being managed by the group's acting chief executive officer, Edwin Shangwa. \n\"All casino and sales and marketing oversight functions will now reside in the acting group chief executive officer's office until further notice,\" he said. \nIt was not immediately clear if other employees were affected by the restructuring. \nThe listed hospitality group's profit before tax in the half-year to March 31, 2015 fell to $670,000 from $1,77 million the same period last year. \nHowever, the group recorded a 10 percent increase in revenue to $25 million on improved performance of its Ghana Hotel, Amber Accra. \nThe hotel achieved $2,87 million in revenue after it opened its doors late last year. \nAfrican Sun operates hotels in Zimbabwe, Ghana and Nigeria. Zimbabwe \nAN estimated 20 000 workers who were fired after the Supreme Court ruled that employers could terminate contracts on … see more » Copyright © 2015 New Zimbabwe. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-16T19:36:00.000+03:00", "crawled": "2015-08-17T09:07:26.899+03:00", "highlightTitle": ""}