{"organizations": ["Halliburton"], "uuid": "0bb9caa3fbb3e30062684c1adb7c2868bd4da2e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rigzone.com", "main_image": "http://images.rigzone.com/images/rz-facebook.jpg", "site_section": "http://www.rigzone.com/news/rss/rigzone_finance.aspx", "section_title": "Rigzone.com: Finance and Investing News", "url": "http://www.rigzone.com/news/oil_gas/a/140345/Halliburton_Believers_Stand_to_Win_Big_Betting_on_Deal_Real_MA?rss=true", "country": "US", "title": "Halliburton Believers Stand to Win Big Betting on Deal: Real M", "performance_score": 0, "site": "rigzone.com", "participants_count": 0, "title_full": "Halliburton Believers Stand to Win Big Betting on Deal: Real M", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "0bb9caa3fbb3e30062684c1adb7c2868bd4da2e3"}, "author": "", "url": "http://www.rigzone.com/news/oil_gas/a/140345/Halliburton_Believers_Stand_to_Win_Big_Betting_on_Deal_Real_MA?rss=true", "ord_in_thread": 0, "title": "Halliburton Believers Stand to Win Big Betting on Deal: Real M", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet \n(Bloomberg) -- Traders willing to bet the biggest oil- services deal can survive regulatory scrutiny stand to rake in more than $3 billion in profit. \nBaker Hughes Inc. shares closed on Thursday at $53.75. That’s about $8 below Halliburton Co.’s cash-and-stock offer. \nIt’s a pretty wide gap -- about twice as wide as the average spread for proposed and pending North American deals of more than $1 billion. And it’s understandable, because if the deal is blocked, Baker Hughes would have a long way to fall given the rout in oil -- as much as 35 percent, by some counts. But the merger has a good chance of ultimately getting done, even if the companies have to jump through a few hoops to get there, said Keith Moore of FBN Securities. \nWorking in the $30 billion deal’s favor, both Halliburton and Baker Hughes are committed to divest as much as $7.5 billion in assets, and there are a multitude of buyers that will be interested in those high-quality businesses. Bidders may include $16 billion equipment-maker National Oilwell Varco Inc. and $7 billion Weatherford International Plc, along with industrial giants Siemens AG and General Electric Co. \n“You’ve got serious guys who can take one or two of these divisions and make sure they remain competitive,” said Tom Burnett, director of research at New York-based Wall Street Access, which specializes in mergers and event-driven analysis. “We’re cautiously optimistic that the companies will get the regulatory approval.” \nAnd now there’s something else to help their case: Schlumberger Ltd.’s $15 billion purchase of Cameron International Corp., announced on Wednesday. With Schlumberger - - the world’s largest oilfield-services provider -- getting even bigger, Halliburton and Baker Hughes could have a better argument that they need to merge to get stronger, said Jennifer Rie, an analyst at Bloomberg Intelligence. \nThat deal also could provide more incentive for contractors to bid on Halliburton and Baker Hughes assets as they seek to stay competitive, Rie said. \nSchlumberger’s purchase of Cameron shows the need for more complete and lower-cost bundles of energy gear and services as contractors compete for crude producers’ shrinking budgets. \n“Things are not good when you see the leader becoming even further integrated,” said Sachin Shah, a special situations and merger arbitrage strategist at Albert Fried & Co. “That helps Baker Hughes and Halliburton because they’re saying, ‘Look it’s not just us.’ They can’t increase prices even if they wanted to, because look at commodity prices.” \nJustice Department lawyers reviewing the Halliburton and Baker Hughes merger weren’t convinced that the proposed asset sales would be enough to maintain competition in the oilfield- services industry, a person familiar with the matter said in July. Overcoming their objections may just be a matter of packaging businesses differently or selling more of them. \nRegulators will probably want more divestitures, said Moore, an event-driven strategist at FBN. If the demands aren’t too onerous, it’s in Halliburton’s interest to strike a compromise. \nHalliburton shares stand to drop drastically without a deal, and the company won’t have the merger’s cost-cutting opportunities to shield it from the slump in oil prices and shrinking revenue. Plus, there’s that $3.5 billion breakup fee Halliburton would have to pay if it terminates the deal because it fails to gain regulatory approval, and the embarrassment for Halliburton Chief Executive Officer Dave Lesar if it falls apart. \nHalliburton has said it hopes to close the deal by Dec. 1. \n“Halliburton’s way too far into this,” said Kurt Hallead, an analyst at RBC Capital Markets in Austin, Texas. “In their minds, this deal is already done.” \nThere is still a risk that regulators just say no. But the opportunity is attractive for those willing to take the leap. \nTo contact the reporters on this story: Brooke Sutherland in New York at bsutherland7@bloomberg.net; David Wethe in Houston at dwethe@bloomberg.net To contact the editors responsible for this story: Beth Williams at bewilliams@bloomberg.net Elizabeth Wollman. \nCopyright 2015 Bloomberg News. Tweet WHAT DO YOU THINK? Generated by readers, the comments included herein do not reflect the views and opinions of Rigzone. All comments are subject to editorial review. Off-topic, inappropriate or insulting comments will be removed. Your comments have been received and will be posted after being reviewed. If you have any questions, please feel free to contact us. Related Companies", "external_links": [], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-29T19:41:14.414+03:00", "highlightTitle": ""}