{"organizations": [], "uuid": "eefb1e2c7695549f4b0e513de5c09fb3d651b137", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/images/print-edition/20150808_FNP002_0.jpg", "site_section": "http://www.economist.com/rss/finance_and_economics_rss.xml", "section_title": "The Economist: Finance and economics", "url": "http://www.economist.com/news/finance-and-economics/21660564-government-agencys-missed-bond-payment-heralds-messy-bankruptcy-hurricane", "country": "US", "title": "Hurricane warning", "performance_score": 0, "site": "economist.com", "participants_count": 2, "title_full": "Hurricane warning | The Economist", "spam_score": 0.0, "site_type": "news", "published": "2015-08-08T03:00:00.000+03:00", "replies_count": 1, "uuid": "6fc36efd6f3813d4878dd5da83d2e332b4b45a9b"}, "author": "From the print edition", "url": "http://www.economist.com/news/finance-and-economics/21660564-government-agencys-missed-bond-payment-heralds-messy-bankruptcy-hurricane#post-0", "ord_in_thread": 0, "title": "Hurricane warning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rainy days ahead\nIT WAS barely a month ago that Alejandro García Padilla, the governor of Puerto Rico, first asserted that the American territory’s $72-billion public debt was unsustainable. At the time, his warning that the only alternative to a comprehensive restructuring was a “unilateral and unplanned non-payment of obligations” was seen by most as a spur to negotiations with creditors. But on August 3rd Puerto Rico’s Public Finance Corporation (PFC), a government agency, failed to make a $58m payment to bondholders. “We don’t have the money,” explained Víctor Suárez, the governor’s chief of staff.\nThe PFC depends on the island’s legislature to appropriate funds to service its debts. But following a decade of uninterrupted recession, lawmakers were unwilling to extract more revenue from taxpayers. A loss of faith among investors, meanwhile, has left them unable to tap the capital markets. As a result, the PFC only managed to send off $628,000. Moody’s, a rating agency, promptly announced that it considered the bond in default.\nIn this section Back on its feet Advancing, not retreating Hurricane warning Hard LIBOR Plunging like it’s 1998 The dreamboat next door The Tarullo show Rule it out Puerto Rico\nThe PFC’s missed payment is unlikely to set off an immediate cascade of lawsuits or further defaults. Its bonds are technically nothing more than a “moral obligation”, without any legal mechanism to enforce payment. The government insists that the failure to pay should not be considered a default at all, since the bond’s terms only oblige the PFC to pay what the legislature has appropriated.\nJust three days before the PFC stiffed its creditors, the Government Development Bank, another official agency, made a $170m payment on its debts. And if other bits of Puerto Rico’s government default, over $10 billion of its liabilities are backed by municipal-bond insurers, which say they have ample reserves to keep creditors paid on time.\nNonetheless, the PFC’s default accelerates Puerto Rico’s debt crisis. It extinguishes any hope that the island’s creditors might somehow avoid losses. It also ends whatever access to commercial finance the government might still have had.\nProvoking a sense of urgency may well have been Mr García Padilla’s intention. Puerto Rico’s awkward status within the United States leaves it in an unenviable position. Because it is not a state, but rather a self-governing territory, its agencies cannot use the portion of federal bankruptcy law that pertains to the public sector, known as Chapter Nine. This has been used by insolvent governments on the mainland (such as the city of Detroit) to reduce their liabilities. But after the island’s legislature passed its own version of Chapter Nine last year, federal courts struck it down on the ground that only Congress can alter bankruptcy laws. That left the governor with no choice but to beseech Congress to amend the law to allow territories such as Puerto Rico to invoke Chapter Nine, a plea that has so far fallen on deaf ears.\nBy missing a relatively insignificant payment, Puerto Rico has made immediate the previously remote spectre of a chaotic, piecemeal default among its many different agencies and types of bond. That may increase the odds of congressional action, as well as encouraging litigation-shy creditors to negotiate.\nEven if such brinkmanship succeeds, however, the extension of Chapter Nine would not be a cure-all. It would not help with Puerto Rico’s $13 billion of “general obligation” bonds, which are protected by a clause in the island’s constitution that guarantees their holders first claim on all “available revenues”.\nShould Congress fail to act, precious little time remains to work out a contingency plan. Puerto Rico is not even planning to make an initial offer to its creditors until August 31st, and is due to make payments of $1.3 billion (1.5% of the island’s output) in December and January alone. The island’s biggest creditors, fund managers such as Oppenheimer and Franklin Templeton, have shown little willingness to cut a deal. Puerto Rico is prone to hurricanes. The PFC’s default puts a destructive legal and financial storm squarely on the horizon.\n ", "external_links": ["http://cdn.static-economist.com/sites/default/files/imagecache/290-width/images/print-edition/20150808_FNP002_0.jpg"], "published": "2015-08-08T03:00:00.000+03:00", "crawled": "2015-08-07T04:50:37.293+03:00", "highlightTitle": ""}