{"organizations": [], "uuid": "88a569726998168d374527a39f6b23a125c965fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/27/markets-forex-idUSL4N11267720150827", "country": "US", "title": "FOREX-Dollar bulls brightened up after data, risk appetite improves", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "FOREX-Dollar bulls brightened up after data, risk appetite improves | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:29:00.000+03:00", "replies_count": 0, "uuid": "88a569726998168d374527a39f6b23a125c965fb"}, "author": "Ian Chua", "url": "http://www.reuters.com/article/2015/08/27/markets-forex-idUSL4N11267720150827", "ord_in_thread": 0, "title": "FOREX-Dollar bulls brightened up after data, risk appetite improves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY Aug 28 The dollar held at one-week highs against a basket of major currencies early on Friday, having benefited from upbeat U.S. data and as investors continued to cut back on safe-havens such as the yen.\nCommodity currencies including the Australian dollar managed to outperform their U.S. peer after a solid rebound in Chinese equities helped lift risk appetite generally.\nThe dollar index last traded at 95.758, not far from a one-week high of 96.031 set overnight. Since diving to a seven-month trough of 92.621 on Monday, the index has risen more than 3 percent.\nAgainst the yen, the greenback bounced back above 121.00 , pulling well away from Monday's low of 116.15. The euro came close to $1.1200, having been knocked off its lofty perch above $1.1700.\nSterling extended its decline, briefing dipping below $1.5400 for the first time in over a month. It last stood at $1.5412.\nLifting the spirits of dollar bulls, data showed the U.S. economy grew faster than initially thought in the second quarter, an outcome that kept the chance of a U.S. interest rate hike this year on the table.\nAnalysts at Citi said all four components showed positive revisions: consumer spending, business investment, trade and government outlays.\n\"Today's GDP adds to the positive flow of domestically oriented U.S. data the Fed desires to see,\" they wrote in a note to clients.\nExpectations for a September move, however, have dwindled after a few Fed officials sounded a bit more cautious, citing global market turmoil and slower Chinese growth.\nThe market will be keenly waiting for more comments on policy normalisation from Fed officials attending the Aug. 27-29 Jackson Hole Economic Symposium.\nThe lighter market mood overnight uplifted commodity currencies, which have had a torrid time this week as swings in Chinese equities compounded fears of a slowdown in the world's second biggest economy.\nThe Australian dollar attempted to reclaim 72 U.S. cents , continuing to recover from a six-year trough of $0.7044 hit on Monday. It's New Zealand peer was close to 65 U.S. cents, off its six-year low of 60 cents.\nThe recent wild moves in global markets have shaken many investors.\n\"It'll be a while before we know where the permanent scars are, but in the meantime, it's a reminder to markets not to form overly strong views on such things as when the Fed might start lift-off, or where G3 currencies are headed,\" analysts at ANZ said in a report.\nThere is little in the way of market-moving data due in Asia, leaving the focus mainly on Chinese stocks again. (Reporting by Ian Chua; Editing by Eric Meijer)", "external_links": [], "published": "2015-08-28T03:29:00.000+03:00", "crawled": "2015-08-28T02:37:24.010+03:00", "highlightTitle": ""}