{"organizations": [], "uuid": "7103681cfa0b088b50ce841f7b5eb1b2f5562dc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wisebread.com", "main_image": "http://www.wisebread.com/files/fruganomics/blog-images/000045068704.jpg", "site_section": "http://www.wisebread.com/taxonomy/term/6/all/feed", "section_title": "Personal Finance", "url": "http://www.wisebread.com/5-best-credit-cards-for-back-to-school-shopping", "country": "US", "title": "5 Best Credit Cards for Back to School Shopping", "performance_score": 0, "site": "wisebread.com", "participants_count": 1, "title_full": "5 Best Credit Cards for Back to School Shopping", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T01:32:00.000+03:00", "replies_count": 0, "uuid": "7103681cfa0b088b50ce841f7b5eb1b2f5562dc9"}, "author": "Christina Majaski", "url": "http://www.wisebread.com/5-best-credit-cards-for-back-to-school-shopping", "ord_in_thread": 0, "title": "5 Best Credit Cards for Back to School Shopping", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0% Balance Transfer Credit Cards \nWhether you have students entering elementary school or college, it’s likely they have a long list of supplies and materials needed to start the school year out. According to the National Retail Federation, average families with a K-12 student, will spend approximately $630 on back to school shopping . If you have a college student, this number can be in the thousands. \nFrom colored pencils and protractors to electronics and clothing, if you use the right credit cards for your back to school shopping, you’ll come out of it with extra money in your pockets. Here are the 5 best credit cards you should consider using to knock out your back to school shopping lists. Chase Freedom® \nThe Chase Freedom® credit card is often rated among the best rewards cards available because of its quarterly rotating categories which award 5% cash back. The bonus categories for the July-September quarter are gasoline and Kohl’s store purchases, which is not only going to allow you to earn 5% on your student’s clothing, accessories, backpacks, and shoes, but if you have to drive around town searching for exactly three red folders with pockets, you will earn cash back on the gas. \nThe Chase Freedom card is also a great card for back to school shopping because it currently offers a $100 bonus if you spend $500 with the card within the first three months of opening the account. Plus, you receive a 0% introductory APR for 15 months on purchases and balance transfers, giving you a year and a half to pay off all those school supplies before you are charged interest. \nClick here to learn more and apply for the Chase Freedom® card today! Discover it® - New! Double Cash Back your first year \nThe Discover it® card includes rotating quarterly categories similar to the Chase Freedom, but its bonus categories for the July to September are home improvement stores, department stores, and purchases at Amazon.com. You’ll likely make clothing and accessory purchases at department stores and you might need shelving and materials from home improvement stores. However, nearly everything else you need for back to school shopping is likely to be available at Amazon.com, and unlike the other purchases, don’t require you to leave your home. \nFurthermore, although Discover cards do not usually offer particularly valuable sign-up bonuses, they are currently offering a promotion for new cardmembers that doubles all the cash back you earn at the end of your first year. If you spend $1,000 on the three bonus categories, you can earn $50 cash back, which at the end of the year, will become $100 and results in a nice discount on your back to school purchases. \nClick here to learn more and apply for the Discover it® card today! Amazon.com Rewards Visa \nIf you plan on shopping primarily with Amazon.com, you might want to consider the Amazon.com Rewards Visa by Chase. Get 3% back for Amazon.com purchases, 2% on gas stations, restaurants, and drug stores, and 1% cash back on everything else. Amazon.com is known for providing huge sales and discounts for school supplies and other back to school necessities, and if you are a Prime Member , you have the advantage of free two day shipping right to your doorstep. Citi® Double Cash Card \nThere are a variety of things that you need to buy in college, and they won't necessarily fall under a spending category that offers bonus rewards. If you want more flexibility with your rewards, the Citi® Double Cash card may be a good fit. This card allows you to earn 1% cash back twice: once when you make a purchase, and again when you pay for your purchase. That's cash back for every purchase, no matter the category, with no caps or restrictions. This means you'll get cash back for all your back-to-school shopping, and you'll continue to get cash back for all your during-school shopping as long as you use your Double Cash card. \nClick here to learn more and apply for the Citi® Double Cash card today! Target REDCard \nAs one of the most popular shopping destinations for school supplies, The Target Credit Card or REDcard is among the best credit cards for back to school shopping. There is a Target Credit Card and a Target Debit Card, both offering a 5% discount at the checkout on your purchases. This type of rewards program can come in handy because you realize your discount immediately and aren’t required to redeem any points later on. Plus, if you select the debit card, there are no credit checks required and you aren’t incurring any debt because the purchases are deducted from your bank account. \nAs an additional bonus to both REDcards, Target donates 1% of your purchases to whichever elementary school, neighborhood middle school, or other eligible K-12 school that you select. In addition to its various sales and discounts, Target provides free shipping and other opportunities, such as the extra 5% discount on your purchases if you sign up for Pharmacy Rewards. Editorial Note: Any opinions, analyses, reviews or recommendations expressed in this article are those of the author’s alone, and have not been reviewed, approved or otherwise endorsed by any bank, card issuer, airline or hotel chain. Best Credit Cards", "external_links": [], "published": "2015-08-20T01:32:00.000+03:00", "crawled": "2015-08-20T03:41:52.501+03:00", "highlightTitle": ""}