{"organizations": [], "uuid": "7b7a498b88477d1b59c844a04967862f72beedd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nz.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/n4Q._IqLkJgR8cjlBDJaIw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/FIN_ANZ_AAP_ART_FTP_LIVE_1/3000838_20150408001119799634-original_1280x720_original.jpg", "site_section": "https://nz.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Latest business and finance news from New Zealand and the world's key markets - Yahoo New Zealand Finance", "url": "https://nz.finance.yahoo.com/news/tax-dodgers-hide-behind-privacy-041412190.html", "country": "US", "title": "Tax dodgers hide behind privacy laws: ALP", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Tax dodgers hide behind privacy laws: ALP", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T07:14:00.000+03:00", "replies_count": 0, "uuid": "7b7a498b88477d1b59c844a04967862f72beedd8"}, "author": "", "url": "https://nz.finance.yahoo.com/news/tax-dodgers-hide-behind-privacy-041412190.html", "ord_in_thread": 0, "title": "Tax dodgers hide behind privacy laws: ALP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nLabor senator Sam Dastyari says privacy provisions in Australia make it possible for some of the world's biggest companies to avoid paying billions of dollars in tax, and that it's time multinational tax dodgers are named and shamed. \nSenator Dastyari has foreshadowed the release on Monday of a Senate report into corporate tax avoidance by calling for transparency measures to be strengthened after testimony from the likes of Apple and Google earlier this year that reinforced the extent of the problem. \nIn April, the Senate inquiry was told by Apple executives that the tech giant had booked sales in Australia of $6 billion, but had paid just $80 million in tax. \nThe Senate inquiry into tax avoidance is expected to table its first report in the parliament on Monday. \nSpeaking in Sydney on Sunday at The Exodus Foundation - a charity that provides assistance to poor and needy Australians - Senator Dastyari, who chaired the inquiry, said that every dollar evaded \"is a dollar that's not going to a hospital, a school or an institution of welfare that's needed in this country\". \nSenator Dastyari refused to provide the report, but suggested that privacy laws needed to be overhauled. \n\"Right now, the laws as they currently stand, mean that Australia's worst tax offenders are able to hide behind privacy provisions,\" Senator Dastyari said. \n\"It's time we named them, and we shamed them and it's time that we actually gave the Australian public an opportunity to know who these companies are, to know the practices they're engaging in, to not allow them to hide behind what currently exists as privacy provisions.\" \nIt's understood the Senate report will make more than a dozen recommendations, including that the Australian Tax Office be forced to disclose all avoidance settlements above a certain level, and that a name-and-shame register be created. \nSenator Dastyari was unable to say whether any of the measures would result in more tax being collected, but insisted the \"more public disclosure, the more pressure that's brought upon these companies, the better the policy outcome\". \nHe also called on the coalition government to do more to counter corporate tax avoidance. \n\"The government has been great on talk and terrible on action. The rhetoric from the treasurer (Joe Hockey) on this issue has been fantastic to date. His action has been minimal.\" @YahooNZBusiness on Twitter, become a fan on Facebook Tax dodgers hide behind privacy laws: ALP AAP \nLabor senator Sam Dastyari says privacy provisions in Australia make it possible for some of the world's biggest …", "external_links": [], "published": "2015-08-16T07:14:00.000+03:00", "crawled": "2015-08-16T08:14:24.273+03:00", "highlightTitle": ""}