{"organizations": [], "uuid": "e049d564d1b0d5524a58181a65c82a3416bbb6ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20150817&t=2&i=1072529503&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB7G0PR", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/17/us-column-weston-529traps-idUSKCN0QM1I120150817", "country": "US", "title": "Four 529 college savings traps to avoid", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Four 529 college savings traps to avoid | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T18:24:00.000+03:00", "replies_count": 0, "uuid": "e049d564d1b0d5524a58181a65c82a3416bbb6ba"}, "author": "Liz Weston", "url": "http://www.reuters.com/article/2015/08/17/us-column-weston-529traps-idUSKCN0QM1I120150817", "ord_in_thread": 0, "title": "Four 529 college savings traps to avoid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES Putting money into a 529 college savings plan is relatively easy. Getting it out can be tricky.\nThis may come as a surprise to the families who have piled money into accounts, hoping to reap tax and financial aid benefits.\n\"People get tripped up and don't realize it until it's too late,\" said consultant Deborah Fox of Fox College Funding in San Diego.\nAssets in the plans topped $224 billion at the end of 2014, according to research firm Strategic Insight, up from about $13 billion in 2001.\nHere are four traps that can keep you from getting the most out of your account:\nCOMPETING TAX BENEFITS\nMoney in a 529 account grows tax-free if the proceeds are used for qualified educational expenses. But there are complications.\nThe biggest trap may be the rule against double dipping. You cannot use tax-free 529 money to pay for expenses that you use to claim tax credits, including the American Opportunity Credit and the Lifetime Learning Credit. Conversely, you cannot get the tuition and fees deduction on expenses you have paid with tax-free 529 money.\nPeople often do not discover that they have incurred an unnecessary tax bill until they prepare their return, said Joseph Hurley, a certified public accountant and founder of the SavingForCollege site.\nAt that point, if you want the credits, which are typically more valuable than the tax savings from a 529 distribution, then you have to pay taxes (but not penalties) on at least part of the money you withdrew from the plan in the previous tax year.\nGRANDPARENT HELP\nAccounts owned by grandparents are not included in initial financial aid calculations. Sounds like a good thing, right?\nExcept that any withdrawals count heavily against the grandchild in the next year's aid calculations. Distributions from grandparent-owned accounts are considered untaxed income to the student, which means he or she could lose a big chunk of grants or scholarships: up to half the amount distributed.\nBy contrast, accounts owned by parents or students are considered parental assets. That means up to 5.64 percent of the account balance is included in financial aid calculations, but distributions are not.\nA few workarounds exist, such as transferring the account to a parent if the plan allows or waiting to withdraw the money until Jan. 1 of the student's junior year. At that point, any withdrawals will not affect aid eligibility, which is based on the previous year's financial details.\nAnother solution could be gifting any money withdrawn to the parents. The Internal Revenue Service has not specifically blessed the move, Hurley said, but he does not see much risk from it if the account beneficiary incurs sufficient qualified expenses.\nTHE DIVORCE TRAP\nA similar problem awaits divorced parents. Financial aid calculations typically are based on the income and assets of the parent with whom the child lives most of the time.\nNon-custodial parent accounts typically are excluded from the first financial aid calculations, but distributions count as the student's income in later aid determinations.\nA non-custodial parent can try the same workarounds as grandparents but may be leery about handing money to the ex rather than to the student or the school.\nTIMING IS EVERYTHING\nYou only get the tax break on 529 withdrawals if they match the amount of \"qualified education expenses\" in the same year.\nIf you withdraw money in December and pay the tuition bill in January, you may not have enough qualified expenses, and the excess distribution could be taxed and penalized.\nTax-free assistance like scholarships must be deducted from the expenses incurred.\nWhat was paid for also matters. Tuition and books are fine, but computers do not count unless the school requires them.\nOther costs not covered? Transportation and repayment of student loans.\nBottom line: Do not just call the 529 plan and tell them to send money to the school.\n\"It's very important to have a 529 withdrawal plan before you withdraw any money,\" Fox said. \"You need to know all the ins and outs and how they will affect you.\"\n(The author is a Reuters columnist. The opinions expressed are her own.)\n(Editing by Lisa Von Ahn)", "external_links": [], "published": "2015-08-17T18:24:00.000+03:00", "crawled": "2015-08-17T19:55:07.097+03:00", "highlightTitle": ""}