{"organizations": [], "uuid": "e709a8a97c96ad32e5def73b51628a90ee2fbe41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/rent-deal-made-melb-port-093131812.html", "country": "GB", "title": "Rent deal made as Melb port inquiry looms", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Rent deal made as Melb port inquiry looms", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T12:31:00.000+03:00", "replies_count": 0, "uuid": "e709a8a97c96ad32e5def73b51628a90ee2fbe41"}, "author": "", "url": "https://au.finance.yahoo.com/news/rent-deal-made-melb-port-093131812.html", "ord_in_thread": 0, "title": "Rent deal made as Melb port inquiry looms", "locations": ["Melb", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Melb"], "text": "Mon, Aug 3, 2015, 7:45 PM AEST - Australia Markets closed Rent deal made as Melb port inquiry looms AAP – 14 minutes ago Print \nA parliamentary inquiry will assess the $6 billion in potential revenue earned from leasing the Port of Melbourne to a private operator against how the lease will affect Victoria's long-term port needs. \nBut the Victorian government may have cleared a hurdle to privatising the port, with one stevedoring company announcing a deal to avert a potential rent rise of up to 750 per cent at its terminal. \nThe opposition-initiated inquiry will look at the length of the lease, any limitations on a second port and the regulations around turning a public monopoly into a private one. \nTreasurer Tim Pallas has warned against reducing the port's sale price, but Opposition Leader Matthew Guy says Victoria cannot afford to think just in the short term. \n\"This is the state's largest asset,\" Mr Guy told reporters on Monday. \n\"To rush a piece of legislation through the parliament ... is in our view not good policy.\" \nMr Pallas said last week he was happy to participate in a robust parliamentary review process but not if the aim is political point-scoring aimed at devaluing the state's asset base. \nThe inquiry will include three coalition MPs, three Labor MPs, a Green MP and one from the minority parties. \nIt will report back on November 30, in time for the government to meet its sale deadline, the first quarter of 2016. \nPremier Daniel Andrews said the opposition should stick to what it said during the election and support the port's sale. \n\"They should get out of the way, they should simply let us get on creating jobs, saving lives,\" he told reporters on Monday. \nLabor promised to use the money raised to remove 50 railway level crossings from around Melbourne, and has promised to spend $200 million improving regional freight infrastructure. \nThe government's plan calls for the leasing of the port for 50 years, with an option to extend for another 20 years. A second container port would be banned until Melbourne reaches its capacity. \nLogistics businesses have called on the government to provide more protection against excessive rent increases in the sale legislation. \n\"The draft legislation falls short of effective regulation, creating uncertainty and putting at risk future investment and trade volumes through the port,\" Shipping Australia chief executive Rod Nairn said on Monday. \nPrivate stevedore DP World said it has reached an agreement with the Port of Melbourne for a new lease granting it 50-year tenure and agreed rent increases over the next 13 years. \n\"Everyone wins - our customers, service providers and the Victorian freight industry will benefit from long-term lease and price certainty which comes with DP World's commitment to operating in the Port of Melbourne,\" chief executive Paul Scurrah said. @y7finance on Twitter, become a fan on Facebook", "external_links": [], "published": "2015-08-03T12:31:00.000+03:00", "crawled": "2015-08-03T12:46:18.056+03:00", "highlightTitle": ""}