{"organizations": [], "uuid": "e3d7783e0c8a48a9ab064171d161709debdccd6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/hillaryclinton_071415getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/251978-liberal-groups-push-clinton-on-wall-street-golden-parachutes", "country": "US", "title": "Liberal groups push Clinton on Wall Street 'golden parachutes'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Liberal groups push Clinton on Wall Street 'golden parachutes'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T16:36:00.000+03:00", "replies_count": 0, "uuid": "e3d7783e0c8a48a9ab064171d161709debdccd6f"}, "author": "pschroeder@thehill.com (Peter Schroeder)", "url": "http://thehill.com/policy/finance/251978-liberal-groups-push-clinton-on-wall-street-golden-parachutes", "ord_in_thread": 0, "title": "Liberal groups push Clinton on Wall Street 'golden parachutes'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Liberal groups push Clinton on Wall Street 'golden parachutes' By Peter Schroeder - 08/26/15 09:36 AM EDT \nLiberal groups are yet again pushing Hillary Clinton to take a tough stance against Wall Street, this time when it comes to hefty payouts for finance executives turned public servants. \nIn a letter sent to Clinton, who is running for the Democratic presidential nomination, the groups pressed her to oppose “golden parachutes” given to bank executives when they agree to take high-ranking government jobs. Such a payment structure is not uncommon on Wall Street, but critics of the practice say it encourages a “revolving door” in Washington and undue governmental influence by the financial sector. ADVERTISEMENT The groups asked Clinton if she supported the practice, while noting that two of her main primary opponents — Sen. Bernie Sanders (I-Vt.) and former Maryland Gov. Martin O’Malley — have backed barring the practice.\n\"The revolving door between government and Wall Street helps the wealthiest few hijack our democracy for their own gain,” said Murshed Zaheed, deputy political director at Credo Action. “Americans cannot afford to have another administration from either party filled with Wall Street executives with multi-million dollar golden parachutes.” \nOther groups signing on to the letter were Rootstrikers, Democracy for America, MoveOn.org Political Action, Center for Popular Democracy Action, The Other 98%, Friends of the Earth Action and American Family Voices. \nThe letter marks the latest in a series of pushes from the left to encourage Clinton to take a harsher stance on the financial sector. Whlie Sanders and O’Malley have hammered the financial sector as a key part of their campaign message, Clinton has taken a more measured tone. \nGripes about a heavy hand from finance in powerful government positions has become a particularly sore spot on the left of late. Sen. Elizabeth Warren (D-Mass.) helped derail President Obama’s nomination of Antonio Weiss, a top executive at Lazard, for a top Treasury post. Warren argued Lazard’s long history on Wall Street should disqualify him for the position, urging someone else to fill the role without such ties. Weiss eventually took a separate post at the Treasury in an advisory role, where he did not need to be Senate-confirmed. \nThe Clinton campaign did not immediately respond to a request for comment. Tags:", "external_links": [], "published": "2015-08-26T16:36:00.000+03:00", "crawled": "2015-08-27T01:45:40.661+03:00", "highlightTitle": ""}