{"organizations": [], "uuid": "5ac8f087d91cee36cacfae525ee8c8ef2288b1ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/hedging-the-gold-monetisation-scheme/112711", "country": "IE", "title": "Hedging the gold monetisation scheme", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Hedging the gold monetisation scheme | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T08:22:00.000+03:00", "replies_count": 0, "uuid": "5ac8f087d91cee36cacfae525ee8c8ef2288b1ff"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/hedging-the-gold-monetisation-scheme/112711", "ord_in_thread": 0, "title": "Hedging the gold monetisation scheme", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Opinion: Why is the BJP crying foul at the Congress stance on GST Bill? Getting wind energy to work India failing to seize the opportunity The prices of gold, globally, are collapsing, and according to reports from the market, Indian buyers are purchasing large quantities of gold. The prices are at a five-year low, at $1,100 per ounce, and as per experts, close to the marginal cost of producing gold. The fall in price is mainly because of various factors such as strengthening of the dollar and, consequently, the shift of preferences from gold to the dollar, and also lower purchase of gold by China.\nEarlier, in 2013, the government had curtailed imports of gold as the external sector was indicating a weak position on account of rising CAD. The stringent measures yielded results and helped in reducing the CAD, which was down to 1.3% in 2014-15 from 4.8% of GDP in 2012-13. Although numerous ways to control demand for gold in India had been attempted for several years, these did not help in reducing gold imports but rather resulted in thriving black market. However, recent attempts to curtail the demand for gold seem to be showing positive developments.\nThe Union government, in the Budget in February 2015, proposed three schemes to monetise gold stocks within India—Gold Monetisation Scheme (GMS), Sovereign Gold Bond (SGB) and Indian Gold Coin. The Budget speech highlighted that the estimated stocks of gold in India are above 20,000 tonnes, and that India is amongst the largest consumers of gold with annual imports of about 800-1,000 tonnes. In fact, according to some private estimates, gold stocks in India are much larger.\nAccording to the draft GMS, the government intends to mobilise gold from households and institutions in India to boost the gems and jewellery sector, and reduce dependence on gold imports. To be successful in mobilising gold, GMS would require supportive infrastructure, including a widespread network of purity testing centres, and storage and distribution services across India. The banks would need to determine appropriate interest rates, so as to attract gold deposits as well as not to burden their balance sheets.\nThe stated objective of the other scheme, SGB, is to divert demand from physical gold to ‘paper’ gold. According to the draft, only resident Indians could invest in SGBs. These bonds would be issued for a minimum tenure of 5 to 7 years. The issuance of bonds for the first year may not exceed 50 tonnes. Also, maximum bonds of 500 gm per person per year can be bought by any entity. Consequently, in any year, a maximum of one lakh entities can participate in SGBs. Investors would get higher returns on SGBs than on physical gold. This would include the gold price returns, as also the interest. SGB may also bring up a possibility of these bonds replacing the Gold Exchange Traded Funds (GETFs) as the SGBs commit to pay an interest while GETFs deduct expenses from invested funds.\nThrough the above two schemes, the government is primarily making efforts to promote gold recycling and diminish the pressure on imports which eventually impact the CAD. Alongside these schemes providing liquidity would aid in creating employment opportunities. The government could reflect on reducing import duty on gold, in order to control smuggling and increase custom duty collections. The market, in contrast, continues to focus on tax implications of the scheme, especially related to gold monetisation. The government can consider the relaxation of know-your-customer clause if gold below a certain denomination is offered for melting by any customer. Further, the scheme is silent about non-resident Indians.\nOverall, the above schemes being finalised by the government exhibit sincere attempt to monetise gold. However, some analysts have expressed fear that unusual rise in gold prices would increase repayment burden on the government. Given that the government would undertake the risk of gold price movements, it could be taking too much risk by permitting these bonds, some scholars argue. Probably, therefore, the draft scheme of SGB delineates a provision for hedging and restricting annual operations to 50 tonnes of gold. Alternatively, to manage such price risks, the government may consider initiating a ‘Gold Equalisation Fund’ where fall in prices are used to build the fund to meet the pressure when prices rise. Also, it would be imperative to have a continuous supply of such bonds to meet the demand for purchase and selling of such bonds preferably of medium- to long-term maturity above 10 years to match gold price cycles. A perpetual annual scheme can encourage buyers and sellers and that would help mitigate the price risk or gold exposure for the fisc.\nCharan Singh is RBI Chair Professor of Economics and Sharada Shimpi is Research Associate, IIM Bangalore\nFirst Published on August 03, 2015 12:22 am", "external_links": [], "published": "2015-08-03T08:22:00.000+03:00", "crawled": "2015-08-03T08:42:23.636+03:00", "highlightTitle": ""}