{"organizations": [], "uuid": "219515a15635da578019509b2dab83538aed1d32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/news-herald/rss/627", "section_title": "The News Herald    : Personal Finance", "url": "http://business-news.thestreet.com/news-herald/story/add-a-529-plan-to-your-back-to-school-shopping-list/13261640", "country": "US", "title": "Add a 529 Plan to Your Back-to-School Shopping List", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Add a 529 Plan to Your Back-to-School Shopping List", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T15:57:00.000+03:00", "replies_count": 0, "uuid": "219515a15635da578019509b2dab83538aed1d32"}, "author": "", "url": "http://business-news.thestreet.com/news-herald/story/add-a-529-plan-to-your-back-to-school-shopping-list/13261640", "ord_in_thread": 0, "title": "Add a 529 Plan to Your Back-to-School Shopping List", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Notte"], "text": "Add a 529 Plan to Your Back-to-School Shopping List Written by: Jason Notte 08/20/15 - 8:57 AM EDT \nNEW YORK ( MainStreet ) – Back-to-school shopping trips for backpacks, notebooks and other supplies are great and all, but how much shopping are you doing for your child's continuing education? \nBack-to-school season would be an ideal time to start seriously considering an investment in a school-aged child's college education, if most of you had any idea how to do so. According to a survey released earlier this year by financial firm Edward Jones, 83% of Americans say they have no idea how they're going to afford college. That includes 63% of those making $100,000 a year or more. \n\"Demographically, people are living longer and having children later in life, narrowing the time between a child's college bills and his or her parents' retirement age ,” says Steve Seifert, principal at Edward Jones. “This, coupled with the fact that the cost of college is increasing at a much higher rate than inflation, means that many are grappling with how to stay on track to meet savings goals.\" More Headlines Why This Is The Week to Book Fall Travel \nGranted, there are tools that are there explicitly to help people save for college, but about two-thirds of Americans wouldn't recognize them if you held them in front of their faces. The 529 plan has been around since 1996 and has allowed Americans to grow their college savings tax-free and exempt the gains on those savings from taxes once they're withdrawn to pay for college. As we've mentioned before , however, only 34% could correctly identify a 529 plan as a college savings tool from among four potential options, which is somehow down from 37% in Edward Jones's first 529 survey from 2012. \nHowever, respondents with a household income of $100,000 or more were significantly more likely to correctly identify 529 plans (58%), than those with less than $35,000 (only 25%). That includes a group known as “High Net Workers.” On average, they're 41 to 63 years old, they work more than 50 hours a week, they're in households making roughly $374,000 a year and they have $750,000 to $1 million in investable assets. They're also far more likely to be in health care, finance or STEM (science, technology, engineering or math) careers than the rest of the population. \nConsidering 50% of American families haven't put aside any money for college, as Sallie Mae discovered last year, they're an exception to the rule. \n“According to our research, High Net Workers are five times more likely to be invested in a 529 college savings plan, as compared to the average individual,” says Frank Trotter, executive vice president of financial firm EverBank. “Looking at the median net worth one might think that a majority of their current savings might be earmarked for education.” 1", "external_links": [], "published": "2015-08-20T15:57:00.000+03:00", "crawled": "2015-08-20T16:46:09.357+03:00", "highlightTitle": ""}