{"organizations": [], "uuid": "2d02e996a0f783eadb3b5df58a741d4bfd908231", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508010223.html", "country": "US", "title": "Zimbabwe: Court Ruling Leaves Zim Workers in Dire Straits", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Court Ruling Leaves Zim Workers in Dire Straits", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T14:44:00.000+03:00", "replies_count": 0, "uuid": "2d02e996a0f783eadb3b5df58a741d4bfd908231"}, "author": "", "url": "http://allafrica.com/stories/201508010223.html", "ord_in_thread": 0, "title": "Zimbabwe: Court Ruling Leaves Zim Workers in Dire Straits", "locations": ["Kenya", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya: Importers Given a Month to Adopt New Kebs Mark \nAt least 6000 workers had their work terminated following the recent landmark Supreme Court ruling by Justice Godfrey Chidyausiku that stated that companies can end workers' contracts at any time, without availing terminal benefits, by giving them three months' notice. \nMany organisations, who are currently struggling to stay afloat given the ailing economy, took advantage of the ruling to lay off employees. Zimbabwe Independent spoke to one of the casualties Tendai Mudzamiri, former manager with Lobels Bread about her ordeal. Zimbabwe \nHead coach of the South African national under-23 team Owen Da Gama says that the side is ready for Saturday's CAF U23 … see more » Copyright © 2015 Zimbabwe Independent. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-01T14:44:00.000+03:00", "crawled": "2015-08-01T22:53:49.165+03:00", "highlightTitle": ""}