{"organizations": [], "uuid": "f6da0baf859089bd0d67f26dd5a9caacdee4e6ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/p/u/o/f/image.related.afrArticleLead.620x365.gipsnh.png/1438504489515.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/tony-abbott-defiant-as-bronwyn-bishop-quits-20150802-gipsnh", "country": "AU", "title": "Tony Abbott defiant as Bronwyn Bishop quits", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Tony Abbott defiant as Bronwyn Bishop quits | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T16:01:00.000+03:00", "replies_count": 0, "uuid": "f6da0baf859089bd0d67f26dd5a9caacdee4e6ca"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/politics/tony-abbott-defiant-as-bronwyn-bishop-quits-20150802-gipsnh", "ord_in_thread": 0, "title": "Tony Abbott defiant as Bronwyn Bishop quits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Tony Abbott announces the Speaker's departure on Sunday. Louie Douvis by Phillip Coorey Primrose Riordan ﻿ ​Tony Abbott has secured Bronwyn Bishop's resignation as Speaker but has defied public anger over her spendthrift ways by clearing her of any wrongdoing and blaming the parliamentary entitlements system.\nThe Prime Minister accepted Mrs Bishop's resignation and announced a \"root and branch review\" of entitlements in a decision he hoped would end three weeks of chaos for the government and remove a potential catalyst to destabilise his leadership.\n\"This is not about any one particular individual, it's about ensuring the system is fair,\" he said. But his exoneration of Mrs Bishop attracted howls of criticism from the opposition and independents and threatens to keep the issue going.\nLabor leader Bill Shorten, who plans to unveil proposals to enshrine the independence of future Speakers, said Mrs Bishop was now claiming to be a victim of a system of which she was in charge.\nBronwyn Bishop's house in Newport on Sunday. getty fairfax \"She didn't resign because it was the right thing to do, it's just so unrepentant,\" he said.\n\"Mr Abbott has blamed the system, but it was Mrs Bishop's addiction to privilege that was the real culprit.\"\nThere was no immediate indication of who will replace Ms Bishop when Parliament resumes next week. Whoever does will be the nation's fifth Speaker in less than four years. There have only been 29 Speakers since Federation.\nShake-up potential Mr Abbott, who hand-picked Mrs Bishop, will consult his leadership group and the party room but Mrs Bishop's ouster presents an opportunity for the Prime Minister to undertake a broader shake-up of his ranks and try to kickstart his government's moribund poll standings.\nHe could appoint a minister to be Speaker and bring forward what had been a planned reshuffle at the end of this year.\nThe other option is to minimise the disruption and promote either a backbencher or Deputy Speaker Bruce Scott, who has experience, is well-regarded and, if appointed, would be the first National Speaker since Ian Sinclair.\nAfter a day of heated backroom discussions, Mrs Bishop, who always said she had acted within guidelines, tendered her resignation to Governor-General Peter Cosgrove.\n\"I have not taken this decision lightly, however it is because of my love and respect for the institution of the Parliament and the Australian people that I have resigned as Speaker,\" she said.\nShe gave no indication she was about to quit and cause a byelection in her safe NSW seat.\n\"I look forward to continuing to serve the people of Mackellar as their local member,\" she said. Her salary will drop by $146,000 from $341,000 to $195,000.\nMr Abbott's exoneration of Mrs Bishop also raised suspicions that she may have been offered a deal, such as an overseas posting further down the track, should she step aside.\nMr Shorten demanded the Prime Minister declare whether Mrs Bishop had been offered anything.\nIndependent MP Andrew Wilkie, who was to move a no-confidence motion in Mrs Bishop when Parliament resumed next week, also rubbished Mr Abbott clearing Mrs Bishop of any wrongdoing.\n\"The Prime Minister is wrong to suggest that this comes down to the gap between current entitlements and community expectations,\" he said.\n\"The fact is that the current entitlements rules do not allow a member or senator to go somewhere principally for private reasons and then to certify it as an official trip. To do so is fraud.\"\nIndependent Speaker Mrs Bishop's troubles began with the revelation she chartered a helicopter to fly from Melbourne to Geelong last year for a party fundraiser.\nShe repaid the $5227 that it cost but it then emerged she had attended the weddings of at least two colleagues and claimed those as official business.\nAt the weekend, Labor again requested the Australian Federal Police investigate Mrs Bishop's expenses, not the Department of Finance.\nMr Shorten, who demanded unequivocally on Sunday that Ms Bishop go, will now mount a push for a permanent rule change for Speakers to become independent.\nWhile they would still be drawn from the party of government, Labor will press for changes to force the Speaker to not attend party room meetings and be subject to other conditions to try to restore dignity to the office.\nMrs Bishop's successor will be the fifth Speaker since November 2011, with the forced resignation of Harry Jenkins to make way for Peter Slipper.\nAfter Mr Slipper's fall from grace concerning allegations over his use of parliamentary expenses and sexual harassment claims, which were later dismissed, Labor's Anna Burke filled the chair. Ms Bishop took over after the Coalition won the election in September 2013.\nPreviously, Mr Abbott, leader of the house Christopher Pyne and Barnaby Joyce had all staunchly defended Mr Bishop while other minsters and MPs wanted her to go.\nMr Joyce came out in defence of Mrs Bishop's use of expenses on Sunday morning, saying they were not unreasonable and attending fundraisers was an unpleasant but necessary part of politician's jobs in a system driven by donations.\nMr Joyce said Mrs Bishop was compelled to attend many events as she was seen as a crowd-puller and getting chauffeured there was part of doing her job and helped avoid drink-driving.\n\"Bronwyn is a lady, who when things are busy, it's not unreasonable that she will have someone help her drive her to whatever job she's got.\n\"Obviously, if you are at an event, there's alcohol here, you do not want to be getting in a car to go home. That is part of life of a politician,\" he said.", "external_links": [], "published": "2015-08-02T16:01:00.000+03:00", "crawled": "2015-08-02T12:18:33.065+03:00", "highlightTitle": ""}