{"organizations": [], "uuid": "0926ba60f37e59c21d2d2de37c7e29c2b1c73402", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/h/x/l/w/image.related.articleLeadwide.620x349.gj8n8n.png/1440618152249.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/4020/financials/diversified-financials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/small-business/managing/the-venture/why-were-lost-for-words-20150826-gj8n8n.html", "country": "AU", "title": "Why we're lost for words", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Why we're lost for words", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "0926ba60f37e59c21d2d2de37c7e29c2b1c73402"}, "author": "The Venture", "url": "http://www.smh.com.au/small-business/managing/the-venture/why-were-lost-for-words-20150826-gj8n8n.html", "ord_in_thread": 0, "title": "Why we're lost for words", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There are downsides from outsourcing too much communication.\nI received two unusual writing requests this week. The first, constructing a Tinder profile for a lonely finance executive, was politely declined. The second, turning a 50-page academic report into a 700-word column, was accepted.\nOver the years I have been asked by CEOs or managers to ghost-write important emails, speeches or presentations. Some freelancers even 'ghost tweet' for CEOs who pretend they are active on social media and have an opinion.\nSome freelancers 'ghost tweet' for CEOs who pretend they are active on social media and have an opinion.\nChances are that a column you read by a sporting star, politician, CEO or fund manager was ghost written. Sometimes, the author barely knows or cares what goes out under their name.\nWhy have business writing standards declined so far and how did it get to this?\nAdvertisement As more people provide more content than ever, the standard of business writing within companies is hitting new lows. Some executives can barely write a coherent email and others think writing – or communication for that matter – is another task to be outsourced.\nGone are the days when managers thought carefully about correspondence and writing was considered an essential business skill. Who needs to write clearly when so much communication is now in list form, dot points, quick emails, or a smartphone text?\nOr when managers in big companies can quickly outsource writing to an internal communications team or use external freelancers.\nGranted, this trend has been good for freelancers, such as myself. An entire communication industry has grown on the inability or laziness of some business people to write their material. I understand time-poor CEOs using others to ghost-write their communication, but it's gone too far when middle managers are afraid to write a company-wide email without help.\nThere are downsides from outsourcing too much communication. In my experience, managers lose their ability to communicate clearly when others do all their writing. They lose the learning that comes with carefully crafted words. Staff start to see them as puppets who read cue cards.\nWhat's your view?\nHave business writing standards declined and if so why? Have too many managers lost the art of writing? What can be done to improve business writing? Here are six reasons for the decline in business writing standards.\n 1. Universities focus less on writing As a sessional academic, I barely had enough time to mark assignments, let alone correct them for grammar and style. There was no scope to help local or international students improve their writing, and business communication was barely taught in the degree. Thousands of students graduated each year with terrible business communication skills.\n2. Red pen goes missing Like many graduates, I used to dread my manager's red pen when communication was reviewed. He would slaughter poorly written copy with a sea of corrections and suggestions. How many managers these days terrorise graduates over their communication, to help them improve?\n3. Too many reviewers, not enough ownership As a writer, few things are more frustrating than a well-constructed piece of communication being reviewed by a dozen people within a company. Email makes it too easy to get multiple views on communication (from people who don't need to review it). Nobody takes ownership or rejects misguided input on communication that is often subjective.\n4. 'Track changes' is the enemy of good writing I detest Microsoft Word's 'Track Changes' function. Yes, it speeds up the review process in big companies and is vital for documents that need to have changes recorded.\nBut not every piece of communication should be treated like a legal contract. Having multiple people insert multiple changes makes the review process hard to follow and documents quickly lose their rhythm and flow. The author flies the white flag and 'accepts changes' without reviewing or properly incorporating them.\n5. Insourcing company communication It's almost the norm for large companies to hire journalists or freelancers, or even have their own editorial teams. Expanding the firm's communication capacity makes sense, but not if it becomes an easy out for lazy managers to get others to do their work. There's a problem when managers can barely put a sentence together.\n6. The scourge of content marketing Its proponents says content marketing is another form of journalism. It has its place but is really just another form of marketing and best left to the marketers.\nCompanies get seduced by the appeal of content marketing and soon realise that most of their managers only have six columns in them before they run out of ideas, and that content is time consuming and can have a low pay-off relative to effort. Managers who fancy themselves as journalists soon realise content marketing is harder than it seems.\nInevitably, the content marketing is hijacked by the firm's sales requirements and becomes more promotional over time – and even clunkier to read.", "external_links": [], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-27T05:35:37.128+03:00", "highlightTitle": ""}