{"organizations": ["Ocado Group plc", "AO World plc"], "uuid": "e51965209267de032b5de57f798ed33e4f40d889", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-retail/?format=rss", "section_title": "Retail News | Retail Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/asos-plc-ocado-group-plc-145723052.html", "country": "GB", "title": "Are ASOS plc, Ocado Group plc, AO World plc & Boohoo.com plc Overpriced?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Are ASOS plc, Ocado Group plc, AO World plc & Boohoo.com plc Overpriced?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T17:57:00.000+03:00", "replies_count": 0, "uuid": "e51965209267de032b5de57f798ed33e4f40d889"}, "author": "", "url": "https://uk.finance.yahoo.com/news/asos-plc-ocado-group-plc-145723052.html", "ord_in_thread": 0, "title": "Are ASOS plc, Ocado Group plc, AO World plc & Boohoo.com plc Overpriced?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "371.21 +9.31 \nThe shares of many online retailers seem to trade at dizzyingly high multiples on their expected earnings. Whilst growth in the e-commerce market continues at a fast pace, competition online is very intense and margins have been wafer thin. Traditional high street retailers are fighting back, too, by building up their presence online and offering a multi-channel experience. \nA series of disappointing trading updates have hit many online retailing shares recently, as growth in sales fail to meet investors' sky-high expectations. But unless these retailers can show that the pace of sales growth is sustainable and margins will eventually widen, these online retail shares could have further to fall. ASOS \nOnline fashion retailer ASOS (LSE: ASC) has been seeing its revenues grow rapidly over the past few years, but profit margins have moved in the opposite direction. The retailer's strategy of cutting prices and investing in its global distribution capacity has come at the cost of falling profits in the near term. \nThe company did report an improvement that in its gross margins in the four months leading up to 30 June. Retail gross margins widened 280 basis points, as retail sales rose 20%. Although spending per customer rose, the growth in the number of active customers on the prior year slowed to just 11%. \nWith underlying EPS expected to decline by 3% this year, its shares currently trade at a lofty forward P/E of 70.9. Even with optimistic expectations that underlying EPS will bounce back by 25% in 2016, its shares trade at 57.4 times its expected 2016 earnings. But, as ASOS continues to expand internationally, higher stock levels and continued investment needs should keep mean costs will remain higher for longer. Ocado Group \nRecent trading at Ocado Group (LSE: OCDO) has been relatively strong. In stark contrast to the traditional supermarket chains, and despite food deflation, sales grew 15.7% in the 24 weeks leading up to 17 May. But, with margins declining, pre-tax profits actually fell 4.2% to £7.2 million. \nShares in Ocado trade at a whopping 175.5 times its expected 2015 earnings. With earnings growth likely to remain weak in the face of the intense competition in the grocery sector, Ocado's pricey valuation does not seem to be justified. AO World \nAO World (LSE: AO) has steadily grown its market share in the major domestic appliances market in the UK and Germany, but it has yet to deliver any meaningful profits. Since its IPO, its revenue and earnings figures have for the most part fallen short of management's expectations. \nAnalysts expectations have gradually been revised downwards, and it would not be too surprising if a return to profitability could be delayed further. They currently expect AO World to make another underlying loss in 2015/6, before returning to profit in 2016/7. Underlying EPS in 2016/7 is forecasted to be 1.21 pence, which means its shares are trading at 78.6 times its 2016/7 expected earnings. With such demanding valuations, its shares do seem far too expensive. Boohoo.com \nShares in Boohoo. c om (LSE: BOO) are 28% lower over the past year and 43% lower than its 2014 float price of 50 pence. Increased marketing spend before the Christmas period at the online fashion retailer failed to deliver the sales figures that had been expected, and growth had slowed considerably for the second half of the financial year. \nBut, analysts are still confident that Boohoo.com will deliver strong earnings growth in the medium term. They expect underlying EPS will grow 42% to 1.1 pence in 2015/6, which gives its shares a forward P/E of 26.4. For 2016/7, analysts expect underlying EPS will grow another 25% to 1.3 pence, which means shares in the company trade at a 20.7 times its 2016/7 expected earnings. Thus, shares in Boohoo.com seem relatively less expensive than the shares of the other online retailers. \nBetter choices? \nIf you are looking for reliable income-generating opportunities that offer growth potential, too, The Motley Fool has a free special report that's aligned with your investing goals -- \"The Fool's Five Shares To Retire On\" . \nThese five large-cap shares have been selected for their combination of income and growth prospects . They generate stable cash flows from their dominant market positions and broad global exposure . \nGet your copy now ! It's completely free and there's no further obligation . \nJack Tang has no position in any shares mentioned. The Motley Fool UK has recommended Boohoo.com. The Motley Fool UK owns shares of ASOS. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-17T17:57:00.000+03:00", "crawled": "2015-08-17T23:05:09.621+03:00", "highlightTitle": ""}