{"organizations": [], "uuid": "dc7fd9185f0a761cbf6a4e20d9d286fe70ab7cda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/morning-moneybeat-europe-socgen-leads-083200188.html", "country": "GB", "title": "Morning MoneyBeat Europe: SocGen Leads the Gains in Europe", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Morning MoneyBeat Europe: SocGen Leads the Gains in Europe", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T11:32:00.000+03:00", "replies_count": 0, "uuid": "dc7fd9185f0a761cbf6a4e20d9d286fe70ab7cda"}, "author": "", "url": "https://uk.finance.yahoo.com/news/morning-moneybeat-europe-socgen-leads-083200188.html", "ord_in_thread": 0, "title": "Morning MoneyBeat Europe: SocGen Leads the Gains in Europe", "locations": ["Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Please feel free to send this email to friends and colleagues and include this link so they can sign up to receive it for free too http://on.wsj.com/MoneyBeatEuropeSignup \nFollow us on Twitter @WSJMoneyBeat. \nEuropean stocks rose Wednesday, tracking gains in Asia, on the back of some robust data on China’s services sector. \nIn early trade, the Stoxx Europe 600 rose 0.5%, having fallen slightly in the previous session as a result of lackluster corporate earnings. \nIn Asia on Wednesday, Japan’s Nikkei Stock Average rose 0.5% and South Korea’s Kospi gained 0.3%. \nThe closely watched Caixin Services Purchasing Managers’ Index climbed to an 11-month high in July despite a steep selloff in China’s stock market, data showed Wednesday. \nThe services PMI rose to 53.8 for the month, up sharply from 51.8 in June. A reading above 50 indicates expansion from the previous month; below 50, contraction. \nOne of the biggest gainers on the pan-European index was Société Générale SA. Shares in the French bank added nearly 7% shortly after the market opened after the bank reported a 25% rise in second-quarter profit, lifted by the performance of its large equity and derivatives trading business and a debt valuation adjustment. \nRead our full take on the European markets today here. \n-- Josie Cox \nMarket Snapshot: FTSE 100 up 0.34%, CAC 40 up 0.87% and DAX up 0.86%. Nikkei closed Wednesday up 0.5%. Brent crude up 0.84% at $50.41. Gold down 0.53% at $1084.90. EUR/USD at $1.0866. Ten-year Treasury yield higher at 2.24%, Bund yield higher 0.64%, Gilt yield higher 1.95%. \nWhat You May Have Missed on MoneyBeat \nM&A Borrowing Hits a Fresh Record Amid Deal Splurge : Companies are issuing debt at record rates to fund acquisitions in a move at least partly motivated by expectations of a rise in U.S. borrowing costs. Acquisition-related bond issuance has reached $290 billion so far for 2015. That’s up from $106.8 billion this time last year, and the highest amount on record. \nCitadel’s Ken Griffin on His McDonald’s Code Words; ‘It Drives People Nuts’: As he prepares to mark his firm’s 25 anniversary later this year, Citadel’s Ken Griffin sat for several interviews with The Wall Street Journal to discuss his investing style, the markets today and politics. \nU.K. Ropes In RBS Selloff Advisers for £1 Fee: The investment banks managing the sale of the U.K. government’s stake in Royal Bank of Scotland have collected a now-familiar fee of £1 ($1.55) for their work, with one banker joking “I’ve already spent mine.” \nWhy Did These Stocks Buck the Trend When the Athex Fell Sharply? : The Athex opening was always expected to be messy. True to expectations, when it opened on Monday after being suspended for five weeks, it notched up its worst single-day selloff in at least two decades, and fell again Tuesday. But while some stocks plummeted so fast they triggered circuit breakers, with falls of 30%, a handful of stocks were in the green, one equally sharply. \nDealpolitik: Baxalta Well-Armed to Fend Off Shire’s Unsolicited Bid : There is a good reason Baxalta isn’t rushing to embrace the unsolicited $30.6 billion takeover bid from Shire: Baxalta has state-of-the-art takeover protections. \nRising Stocks Aren’t Enough to Keep Some Investors in France : French stocks are soaring, but they’re making gains without the backing of some major institutional investors. The CAC 40 index is up nearly 20% this year to date—more than most other major European markets, while smaller cap indexes are also higher. But some big investors have withdrawn support for French stocks amid concern the French economy continues to struggle. \nEurope’s Car Industry Shifts Earnings Speeds – At A Glance : Europe’s top auto makers have shown contrasting momentum in their second-quarter earnings reports. Operating profit shrank at BMW and Volkswagen, but the manufacturers most dependent on Europe’s recovering mass market, especially Peugeot, turned in a long-awaited improvement. Here’s a look at earnings highlights from the quarter. \nCrédit Agricole’s Elusive Quest for Normality : Will Crédit Agricole ever be just another bank? Investors have their doubts. The French lender’s acknowledgement that a long-awaited simplification of the bank’s complex structure is on hold triggered a 10% slide in the stock price despite nominally robust second-quarter earnings. \nFrom The Wall Street Journal \nBusinesses Worry Over Financial Impact of Calais Migrant Crisis: Exporters and haulers on both sides of the English Channel worry that the Calais crisis is eating into their revenues and are pouring more pressure on the French and U.K. governments to do something to alleviate the situation. \nSociété Générale Boosted by Market Volatility: Société Générale said Wednesday that second-quarter net profit jumped 25%, lifted by the performance of its large equity and derivatives trading business and a debt valuation adjustment. \nLockhart: Fed Is ‘Close’ to Being Ready to Raise Short-Term Rates: Federal Reserve Bank of Atlanta President Dennis Lockhart said the economy is ready for the first increase in short-term interest rates in more than nine years and it would take a significant deterioration in the data to convince him not to move in September. \nHow Jeb Bush Spent His Years on Wall Street: Former governor’s time at Lehman and Barclays sets him apart from other presidential hopefuls. \nU.K. Fraud Office Plans More Libor Charges: British fraud prosecutors, fresh from their conviction of former bank trader Tom Hayes, are planning to bring criminal charges against additional individuals in the coming months. \nOil Companies’ Spending Cuts Unlikely to Be Enough: The world’s biggest oil companies have vowed to bring down the costs of big projects in the face of slumping oil prices, but the unrelenting price weakness—with crude below $50 a barrel—suggests they could have to dig deeper still. More from The Wall Street Journal", "external_links": [], "published": "2015-08-05T11:32:00.000+03:00", "crawled": "2015-08-05T11:56:48.498+03:00", "highlightTitle": ""}