{"organizations": ["SAP", "Google Pixel", "United States Analogix Semiconductor, Inc.", "Inc.", "Microsoft", "Analogix Semiconductor, Inc", "Google", "Video Electronics Standards Association"], "uuid": "61d362c580f70cf680046583082c74e16cdb2ee0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/analogix-grl-expand-slimport-adopters-program-include-usb-type-c/44873", "country": "US", "title": "Analogix and GRL Expand The SlimPort® Adopters Program to Include USB Type-C™", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Analogix and GRL Expand The SlimPort® Adopters Program to Include USB Type-C™", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T08:38:00.000+03:00", "replies_count": 0, "uuid": "61d362c580f70cf680046583082c74e16cdb2ee0"}, "author": "", "url": "http://businesswireindia.com/news/news-details/analogix-grl-expand-slimport-adopters-program-include-usb-type-c/44873", "ord_in_thread": 0, "title": "Analogix and GRL Expand The SlimPort® Adopters Program to Include USB Type-C™", "locations": ["Taiwan", "US", "Beijing", "Santa Clara", "Japan", "India", "Slim Port", "Granite River Labs", "Tweet Calif."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Quintin Anderson", "Analogix", "Andre Bouwer"], "text": "Tuesday, August 18, 2015 11:08AM IST (5:38AM GMT) (BW)(CA-ANALOGIX-SEMI) Analogix and GRL Expand The SlimPort® Adopters Program to Include USB Type-C™ Program Grants Adopters a Means to Certify Performance, Compatibility and Interoperability of Video and Audio Between Devices with USB-C PortsClick to Tweet Calif., Santa Clara, United States Analogix Semiconductor, Inc. and Granite River Labs (GRL) announced the expansion of the Slim Port® Adopters Program (SAP℠) to include the USB Type-C™ connector. Available to any USB Type-C device manufacturer, the program offers SlimPort® certification including signal quality pre-test for DisplayPort, HDMI and VGA, interoperability testing to confirm the maximum display resolution with devices available in the market, and functional testing of power, data, audio and video transfer. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150817005234/en/ SlimPort Adopters Program (SAP) includes signal quality pre-test for DisplayPort, HDMI and VGA, interoperability with devices available in the market, and functional testing of power, data, audio and video transfer. (Photo: Business Wire) The benefit for mobile device manufacturers is to ensure that their devices work with the USB-C accessories available in the market. This includes the first wave of USB-C devices such as Apple USB-C Digital AV Multiport Adapter and the Google USB Type-C to HDMI Adapter. The benefit for accessory makers is to ensure that accessories work with the many video source devices with USB-C connector supporting DisplayPort Alternate Mode already released in the market, as well as the many smartphones, tablets and notebook computers coming soon that will support DisplayPort Alt Mode. Since its adoption by the 12-inch Apple MacBook and the Google Pixel 2 Chromebook, as well as the recommendation from Microsoft in their New Guidelines for USB for Windows 10 , DisplayPort Alternate Mode has become the de facto standard for sending video over the USB Type-C port. “Most leading mobile device manufacturers and accessory makers are aggressively switching to USB-C connectivity and SAP is in place to provide cost efficient solutions for interoperability testing and compliance reporting. This is increasingly important as resolutions increase on mobile devices. With USB-C, DisplayPort supports 4K 60Hz and beyond simultaneously with USB3 data transfer,” said Andre Bouwer, vice president of marketing for Analogix. “The SlimPort® trademark signifies to the end user that the device interoperates with the leading products available in the market, and with other SlimPort devices.” Testing is performed in the Analogix EasyHD Lab in Beijing, which was established in 2006 to address the interoperability issues in HDMI and DisplayPort devices, and at Granite River Labs with testing facilities in the US, Taiwan, Japan and India. GRL is amongst the first test houses able to certify devices with USB Type-C connectors and DisplayPort Alternate Mode support. “In addition to the USB and DisplayPort certifications, we are delighted to expand our offering of test services with the SlimPort Adopters Program. This program includes interoperability and functional tests that go beyond the standard CTS tests helping device makers release their product with greater confidence and faster time to market in the growing USB-C ecosystem,” said Quintin Anderson, Co-Founder and COO for GRL. Once products receive certification, adopters will have access to marketing collaterals and technical support, receive listings on www.slimport.com and the option to use the SlimPort® trademark on their products to highlight the video-out capability. Please contact Analogix if you are interested in joining the SlimPort Adopters Program at support@analogix.com . About Analogix Semiconductor Analogix Semiconductor, Inc. designs and manufactures semiconductors for the digital multimedia market, from portable devices such as smartphones to high-end graphics cards and large, high-definition displays. Analogix is the market leader in providing end-to-end interface connectivity semiconductor solutions for DisplayPort, including the SlimPort family of products, and an industry leader in mobile display controllers, such as low-power, high-speed timing controller solutions. The DisplayPort standard is an innovative, packetized digital interface for high-resolution video and audio that was developed by the Video Electronics Standards Association (VESA). SlimPort branded products are compliant with DisplayPort, Mobility DisplayPort (MyDP), and DisplayPort Alternate Mode over the USB Type-C connector. For more information visit www.analogix.com and www.slimport.com , follow us on Twitter @Analogix and @SlimPortConnect , or connect with us on LinkedIn . About Granite River Labs Granite River Labs (GRL) provides end-to-end Engineering Services and Test Solutions that enable new and emerging technologies, working closely with early adopters, standards committees, and leading test equipment manufacturers to develop test methodologies and provide early test solutions. A trusted partner to some of the largest companies in the world, GRL combines recognized industry experts, high performance test equipment, and automated test solutions. For more information, please visit www.graniteriverlabs.com . Analogix and SlimPort are trademarks or registered trademarks of Analogix Semiconductor, Inc. All other trademarks and trade names are the property of their respective owners. View source version on businesswire.com: http://www.businesswire.com/news/home/20150817005234/en/ MULTIMEDIA AVAILABLE :", "external_links": [], "published": "2015-08-18T08:38:00.000+03:00", "crawled": "2015-08-18T08:50:31.779+03:00", "highlightTitle": ""}