{"organizations": [], "uuid": "d1a46e12c32da2d8f003be814e7081af5eba8769", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/u-k-buyout-firm-doughty-113200500.html", "country": "GB", "title": "U.K. Buyout Firm Doughty Hanson Shuts Raft of European Offices", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "U.K. Buyout Firm Doughty Hanson Shuts Raft of European Offices", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T14:31:00.000+03:00", "replies_count": 0, "uuid": "d1a46e12c32da2d8f003be814e7081af5eba8769"}, "author": "", "url": "https://uk.finance.yahoo.com/news/u-k-buyout-firm-doughty-113200500.html", "ord_in_thread": 0, "title": "U.K. Buyout Firm Doughty Hanson Shuts Raft of European Offices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Aug 10, 2015, 13:08 BST - UK Markets close in 3 hrs 22 mins U.K. Buyout Firm Doughty Hanson Shuts Raft of European Offices The Wall Street Journal – 37 minutes ago Print Private equity firm Doughty Hanson is shutting down much of its European office network, following the decision to abandon fundraising in April and a slew of senior executive departures. \nThe London-based operation is closing its Paris, Frankfurt, Madrid and Stockholm offices, according to a statement from the firm. Doughty Hanson will continue to operate out of London and will also keep small offices in Milan and Luxembourg, where it has a number of fund administration staff. \nA spokesman said: “Following the decision in April this year to cease fundraising for Fund VI, and following a number of successful exits from our overseas investments, the firm decided some time ago to close down its overseas offices, with the exception of the offices in Milan and Luxembourg. It is our intention that any future fund will make investments in the U.K. and core European markets using London-based employees.” \nA further five individuals in the firm’s London and European offices are also leaving the firm, according to the spokesperson. They include: Pascal Keutgens, a senior principal in London who had been at the firm since 2003; Christopher Fielding, a principal in London who joined the firm in 2003; Francisco Churtichaga, who joined the firm in 2006 and was a senior principal in Madrid; David Torralba, who joined the firm in 2007 and was a principal in Madrid; and Karl Eidem, who joined the firm in 2011 and was a principal in Stockholm. \nDoughty Hanson announced in April that it would abandon efforts to raise a new fund. The firm said at the time it would focus on maximizing the value of its remaining portfolio in its fourth and fifth funds. \nDoughty Hanson was founded in London by British bankers Nigel Doughty and Richard Hanson. They raised a £167 million ($257.2 million) fund in 1990. Their last fund of €3 billion was raised in 2007. \nThe firm struggled with some investments in the wake of the financial crisis and grappled with establishing a clear succession plan after Mr. Doughty died in 2012 at the age of 54. More from The Wall Street Journal", "external_links": [], "published": "2015-08-10T14:31:00.000+03:00", "crawled": "2015-08-10T15:08:32.355+03:00", "highlightTitle": ""}