{"organizations": [], "uuid": "220d8b8215a4ead3d874deee9b9a1357d5498f91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=SQNM", "section_title": "Yahoo! Finance: SQNM News", "url": "http://finance.yahoo.com/news/edited-transcript-sqnm-earnings-conference-035806641.html", "country": "US", "title": "Edited Transcript of SQNM earnings conference call or presentation 5-Aug-15 9:00pm GMT", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Edited Transcript of SQNM earnings conference call or presentation 5-Aug-15 9:00pm GMT", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T06:58:00.000+03:00", "replies_count": 0, "uuid": "220d8b8215a4ead3d874deee9b9a1357d5498f91"}, "author": "", "url": "http://finance.yahoo.com/news/edited-transcript-sqnm-earnings-conference-035806641.html", "ord_in_thread": 0, "title": "Edited Transcript of SQNM earnings conference call or presentation 5-Aug-15 9:00pm GMT", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Welcome to the Sequenom second quarter 2015 earnings conference call. \n(Operator Instructions) \nPlease note this event is being recorded. \nI would now like to turn the conference over to Carolyn Beaver, Senior Vice President and Chief Financial Officer. Please go ahead, ma'am. \n\nCarolyn Beaver, Sequenom, Inc. - SVP & CFO [2] \n\nThank you, Denise. Welcome to the Sequenom conference call to discuss operating results for the second quarter of 2015. Joining me today are Bill Welch, President and CEO; Dr. Dirk van den Boom, Executive Vice President and Chief Scientific & Strategy Officer; and Dr. Daniel Grosu, Senior Vice President and Chief Medical Officer. \nThis call is also being broadcast live over the web and will be available for replay through Friday, September 4, 2015, on the Invest section of our website at www.sequenom.com. \nDuring this call we will include a discussion of our current plans and make forward-looking statements and also discuss non-GAAP measures. Forward-looking statements are not guarantees of performance. Actual results may differ materially from our expectations. Risks and uncertainties that may cause actual results to differ materially from those expressed or implied by any forward-looking statement include, but are not limited to, those described in Sequenom's most recent filings with the Securities and Exchange Commission. \nBefore Bill begins, I would like to let you know that we will be participating in the annual Morgan Stanley Healthcare Conference in New York the week of September 14 and that we plan to host an Investor and Analyst Day in New York City on September 28. \nWith that, I will now turn the call over to Bill Welch. Bill, go ahead. \n\nBill Welch, Sequenom, Inc. - President & CEO [3] \n\nThank you, Carolyn. Good afternoon, everyone, and welcome to today's call. \nThis is the first quarter where we are beginning to see measurable benefits from the pooled patent agreement with Illumina, as our revenues transitioned to include test fee revenues from licensees. I will talk more about the rationale and future business implications of the pooled patents agreement shortly, but I first want to highlight some of the key quarterly financial data. \nTotal revenues for the second quarter of 2015 were $32.8 million, a sequential decrease compared to $37.8 million for the first quarter of 2015. Revenues for the first half of 2015 were $70.6 million, compared to $76.8 million for the first half of 2014. \nLicense revenues were $1.9 million for the second quarter of 2015, compared to $0.4 million for the prior-year period. License revenues were $4 million for the first half of the year, a significant improvement over the license revenue of $0.7 million for the first half of 2014. \nGross margin for the second quarter was 49%, compared to gross margins of 44% for the second quarter of 2014. \nCash burn improved to $2.9 million, compared to $4.1 million cash burn from continuing operations in the second quarter of 2014. Cash burn for the first half of 2015 was $12.3 million, compared to $22.6 million in the first half of 2014. \nWe communicated at the end of the first quarter this year that we anticipated the transition of Quest to the patent pool in the second quarter could reduce our total revenues in the second quarter by $3 million, compared to our first quarter revenues. With this overview, I would like to review the patent pool rationale and discussion -- discuss our business moving forward. \nOur settlement with Illumina and the creation of the NIPT patent pool agreement at the end of 2014 eliminated certain costly and ongoing litigation expenses, provided for future reductions to our cost of goods sold, allowed for improvement to our supply agreement for Illumina equipment and services, provided access to test fees and royalties from third-party participants that joined the patent pool, and placed the responsibility of global enforcement, protection of patents in the patent pool on Illumina, with selective support by Sequenom. In addition, Sequenom received $50 million cash settlement from Illumina while providing Illumina access to our clinical samples collected, honoring FDA agreed-upon protocol. \nAs an outcome of this settlement and as a result of Sequenom's prior NIPT license agreement, is a transition to measurable licensing revenues in addition to our diagnostic service revenues for tests performed by our laboratory. This transition affected our second quarter 2015 results, where we observed a reduction in our diagnostic service revenue and NIPT test volumes, as two referring laboratories converted to licensing agreements. Quest Diagnostics launched its own NIPT laboratory-developed test in the second quarter of 2015, and GeneTech launched its NIPT test in the first quarter of 2015. Both companies now pay patent pool test fees. \nSequenom Laboratories accessioned over 44,000 tests in the second quarter of 2015. We accessioned over 36,000 MaterniT21 PLUS tests, nearly all of which were for high-risk patients, down, as expected, from the over 44,000 MaterniT21 tests in the first quarter of 2015 due to a strategic shift of Quest Diagnostics to an NIPT licensee. Carolyn will discuss our financials later in the call, but the second quarter of 2015, excluding the strategic shift of samples by Quest, our NIPT test volume was similar to our first quarter 2015. \nWe launched our VisibiliT test in the US in the first quarter to address the average risk market demand by our customers. While still early in the launch we see steady monthly increases in our global VisibiliT samples, and so far VisibiliT is tracking to our internal goals of over 8,000 tests for 2015. \nWe also launched HerediT UNIVERSAL, a universal carrier screening test, late in the first quarter. The HerediT UNIVERSAL panel includes over 250 genetic disorders, and the medical education and sale cycle may be longer than our other tests. Our HerediT UNIVERSAL sample volume in the second quarter was not material to our quarterly financial results. \nLicense revenue from the patent pool increased to $1.9 million for the second quarter, compared to $1.3 million for the first quarter of 2015, reflecting the increase in test fees under the patent pool agreement. There are now 32 global licensees to the patent pool, the majority of which are outside the United States. Of the 32 licensees, 10 are active, including Sequenom Laboratories and Illumina. We expect increased test volumes from the current licensees this year, and we anticipate the number of active licensees to grow this year and beyond. \nThe patent pool allows us additional access to the broader US average-risk population as well as the expanding and relatively untapped international market that otherwise would not have been easily accessible by Sequenom. Overall, we strongly believe in the long-term value of the license test fee revenues and royalties from the patent pool. \nWe communicated earlier in the year that we expect to receive up to $80 million in cumulative minimum test fee revenues and royalties from the patent pool between 2015 and 2020, subject to certain potential agreed-to adjustments. The actual test fee revenues and royalties could be much greater. \nRecently we amended an exhibit to our filed 10-K to provide additional details to the annual minimum test fees and royalties through 2020. There are over 425 globally filed patents and patent applications for NIPT in the patent pool, and Sequenom believes the robustness and the value of the patent pool will expand, or extend through the life of the patents, well beyond 2030. \nSequenom is the market leader and innovator of NIPT. We were the first to clinically validate and launch a noninvasive prenatal test nearly four years ago. Our distinguishing advantages to physicians and patients include our test accuracy, fast turnaround time and industry-leading low no-call rate. We consistently publish our methods and our clinical laboratory validation data. We are the only provider who offers distinct tests for the average and high-risk NIPT markets, which provides more options for our customers and their patients. \nI'm very excited about our upcoming launch of MaterniT GENOME test this quarter. We presented performance data at the recent 19th International Conference on Prenatal Diagnosis and Therapy in Washington, DC. Our data demonstrate that we can detect copy number events 7 megabases and greater in size with a sensitivity higher than 90% while maintaining very high specificity, at greater than 99.9%. We are completing a clinical evaluation study this quarter which we plan to submit for peer-reviewed publication. \nThe MaterniT GENOME test provides information about gains or losses of chromosome material across the genome that previously could only be obtained after performing a karyotype analysis following an invasive procedure such as amniocentesis. This test also analyzes seven clinically significant microdeletions that are currently offered in our MaterniT21 PLUS test. \nMaterniT GENOME offers a breadth of coverage unlike any other noninvasive prenatal test available to date and fulfills our goal of delivering the most relevant fetal genomic information noninvasively. We think MaterniT GENOME should be considered as an option for physicians and their patients who seek karyotype-level information prior to obtaining an invasive procedure. \nIn a recent publication, Clinical Outcome of Subchromosomal Events Detected by Whole Genome Noninvasive Prenatal Testing, we demonstrated our clinical experience on 175,000 samples. In this paper our positive predictive value, or PPV, with 22q11 deletion syndrome, also known as DiGeorge syndrome, was over 95%. The positive predictive values for our microdeletions are far superior to that of competitive NIPT tests, which average from 5% to 31%, according to information available in the public domain. \nOur development strategy to date has emphasized specificity to focus on minimizing false positives for the benefit of patients and to minimize unnecessary procedures. While no test is perfect, we believe MaterniT21 PLUS and MaterniT GENOME tests are well positioned, with a recent ACOG committee opinion to minimize false positive findings. \nOur strategy since launch has been to partner with payers as an in-network provider in order to provide the best service and care for their patients. We signed agreements for an additional 10 million commercial lives in the second quarter and now have coverage in place for over 172 million commercial lives in the US. We have agreements with three national payers, including Aetna, CIGNA, and a master business agreement with Blue Cross Blue Shield Association. We have an additional 40 million lives now covered by Medicaid programs across 19 states which are reimbursing for our tests. \nOver the past year we have been notified by patients, providers and payers of questionable billing practices by some competitors. Certain national payers have asked us to coordinate educational programs to their contracted physicians regarding the benefits of in-network laboratories. These payers are concerned that certain laboratories try to convince doctors and patients that NIPT services cost little to the patients in order to gain test volume. We will continue to work well with all insurance companies. \nRecently we have been informed that a few NIPT competitors are also billing for high- and average-risk patients using molecular cytogenetic codes such as FISH for NIPT, including microdeletions, for a total of $8,000, or nearly three times our list price. We have consulted with legal and industry coding experts and have been advised that it is not appropriate to bill using a cytogenetic code for cell-free DNA fetal chromosomal analysis. We will continue to monitor the reimbursement and coding landscape and can adjust our policies as appropriate. \nFrom an operational perspective, we exited our Grand Rapids laboratory site to improve efficiencies and lower operational costs. We are now performing cystic fibrosis and RHD tests at our North Carolina location. We are hopeful based on discussions with key opinion leaders that RHD testing may be adopted in clinical guidelines as early as next year. \nFinally, I would like to provide a brief update on our oncology program. During the second quarter we continued to make excellent progress, and we remain on track to release a research use only liquid biopsy test in the second half of 2015. This test will be useful for research in academic institutions to profile circulating tumor DNA. We initially focused on molecular profiling in late-stage, non-hematologic malignancies where tissue biopsy of a patient is not available or is too risky to obtain. \nThe test will cover a breadth of cancer types, with over 100 actionable genes that are associated with an FDA-approved drug treatment, are included in professional society guidelines or are linked to targeted therapies currently in clinical trials. We are working with multiple leaders -- leading cancer centers that we expect will utilize the test as part of their clinical research programs. \nWe intend to bring all or part of the genetic markers contained within our research use only test through CLIA validation in 2016 for use in patient care. We will provide more details to our oncology program in the upcoming Investor and Analyst Day, which Carolyn mentioned will take place on September 28. \nNow I'm going to turn it over to Carolyn for a more detailed financial overview. Carolyn? \n\nCarolyn Beaver, Sequenom, Inc. - SVP & CFO [4] \n\nThanks, Bill. \nTotal revenues for the second quarter of 2015 were $32.8 million, a decrease compared to $39.8 million reported for the second quarter of 2014 and $37.8 million for the first quarter of 2015. As Bill mentioned, in our first quarter earnings call we communicated an expected $3 million decrease in our second quarter total revenues compared to the first quarter, primarily due to the Quest transition. \nWe ended the second quarter with a $5 million decrease, primarily due to the Quest transition as well as lower than expected collections from certain payers. We appreciate that diagnostic services revenue at times is difficult to model because of timing of collections from payers and the transition of certain licensees to the patent pool. \nRevenues from the Sequenom Laboratories business continue to be recorded primarily on a cash basis, with accrual accounting used for client bill arrangements and certain third-party payers. In total, over 36% of our diagnostic services revenues in the second quarter were reported on the accrual basis of accounting. \nThe second quarter of 2014 included approximately $6.1 million of incremental catch-up payments from payers for services performed in prior periods and the incremental change for the conversion from cash to accrual accounting for certain payers. In addition, the prior-year quarter included diagnostic services revenues of approximately $3 million from an international partner which converted to a licensee in 2015. \nLicense revenues were $1.9 million for the second quarter of 2015, compared to $0.4 million for the prior-year period. The increase in license fee revenue is a result of the increase in tests performed by licensees of the patent pool. The second quarter represents the first full quarter of revenue reported under the pooled patents agreement, since certain licensees are reported on a one-quarter lag basis. \nTotal cost of revenues decreased to $16.6 million for the second quarter of 2015, compared to $22.4 million for the prior-year period. Cost of revenues decreased, primarily due to the lower Sequenom Laboratories test volumes because of the planned shift of certain business to the patent pool and cost efficiencies gained over the past year. \nGross margin for the second quarter was 49%, as compared to gross margin of 44% for the second quarter last year and 49% for the first quarter of 2015. The improvement from the prior year is attributable mostly to improved efficiencies in processing patient samples. \nTotal operating expenses for the quarter were $23.2 million, as compared to total operating expenses of $30.6 million for the second quarter of 2014, reflecting disciplined expense management and the benefit of the settlement with Illumina, resulting in lower legal expenses. Total operating expenses include $1.6 million of expenses related to the costs for the exchange of convertible notes, which I will discuss later. \nResearch and development expenses of $5.7 million for the second quarter of 2015 were down from $7.1 million in the second quarter of 2014, primarily due to timing of expenditures for operating supplies and clinical samples. \nGeneral and administrative expenses for the second quarter of 2015 decreased by $6.1 million compared to the prior-year period. The decrease is due primarily to lower legal expenses associated with patent litigation, which was an expected benefit of the pooled patent agreement. \nIn June we completed the exchange of $85 million of our 5% convertible notes for notes due January 1, 2018. The conversion price of the 2018 notes is 115% of the stock price at the date of the original notes, or $5.32 per share, instead of 140%, as required in the existing notes. We believe that this transaction improves the likelihood of conversion. \nThe convertible note exchange transaction resulted in $1.6 million in costs, which were included in general and administrative expense. Without that cost the improvement in G&A expenses would have been $7.7 million. \nDuring the second quarter we recorded a restructuring charge of $0.7 million in connection with the planned exit of the Grand Rapids operations and the impairment of certain assets. The consolidation of our laboratory location enables us to better utilize our laboratory resources and improve cost efficiency. In August we sold certain assets and assigned certain agreements related to our Grand Rapids laboratory location for $750,000, which will be reflected in our third quarter results. \nNet loss for the second quarter of 2015 was $9 million, or $0.08 per share, compared to net earnings of $4.5 million, or $0.04 per share, as a result of the sale of the bioscience business in the second quarter of 2014. \nCash burn for the second quarter of 2015 was $2.9 million, an improvement from $4.1 million cash burn from continuing operations in the same period of 2014 and $9.4 million cash burn in the first quarter of 2015. Included in cash burn for the second quarter of 2015 are capital investments of $1.3 million and debt repayment of $2 million. We have now fully repaid our bank term loan. \nAs of June 30, 2015, total cash, cash equivalents and marketable securities were $87 million. Debt service and certain royalty payments occur in the first and third quarters of each year, which affect cash flow in those quarters. These payments will continue to cause variability in our cash flows between the quarters. \nFor the first half of 2015 the Company reported revenues of $70.6 million, a decrease of 8% from revenues of $76.8 million for the first half of 2014. Revenue in the first half of 2014 included catch-up payments from various payers and the conversion to accrual accounting for certain payers, as I mentioned. License fee revenues increased to $4 million, compared to $0.7 million in the prior-year first half as a result of the transition of certain customers to the patent pool. \nGross margin for the first half of 2015 improved to 49%, as compared to gross margin of 41% for the first half of 2014, due to the improvements in laboratory processes which have been implemented over the past year. \nIncome from continuing operations before income taxes for the first half of 2015 was $5.4 million, as compared to a loss from continuing operations before taxes of $31.8 million for the same period in 2014. The first half of 2015 includes the gain of $21 million on the pooled patents agreement which was recognized in the first quarter. \nNet earnings for the first half of 2015 were $5.3 million, or $0.04 per share, as compared to a net loss of $11.2 million, or $0.10 per share, for the same period in 2014, reflecting the gain on the pooled patents agreement in 2015 and the sale of the bioscience business segment in 2014. \nI'll now turn the call back over to Bill for his closing remarks. \n\nBill Welch, Sequenom, Inc. - President & CEO [5] \n\nThanks, Carolyn. \nThe following is a summary of our current status of our patent litigation. In June the US Court of Appeals for the Federal Circuit upheld the ruling of the United States District Court for the Northern District of California that the claims of the Company's '540 patent are not patent eligible under the patent eligibility criteria established by the Supreme Court's Mayo Collaborative Services v. Prometheus Laboratories decision. \nAs a practical matter, the Company believes that the ruling has little business impact, as it's been operating under the District Court's invalidity ruling since October 2013 and due to the pooling arrangement of NIPT intellectual property entered into with Illumina in December 2014. In addition, valid and enforceable patents with claims equivalent to those of the '540 patents are issued in Europe, Japan, Hong Kong, Canada and Australia. \nThe Company understands that patent eligibility under the 35 USC Section 101 is an emerging and complex set of issues. We will ask the Federal Circuit to rehear the case in front of all active judges of the court. We remain optimistic that the inventive nature of the '540 patent will prevail, and we will provide updates as they develop. \nWith that summary of our business and financial update, we would now like to open the call up to questions. Operator, please open the line.", "external_links": [], "published": "2015-08-06T06:58:00.000+03:00", "crawled": "2015-08-06T12:29:32.512+03:00", "highlightTitle": ""}