{"organizations": [], "uuid": "8901e19f46834c75094b4d66adb8913dbbb19467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/t/n/t/0/image.related.afrArticleLead.620x365.giqfgd.png/1438921202388.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/real-estate/goldman-sachs-says-housing-is-36-per-cent-overvalued-in-lowergrowth-economy-20150803-giqfgd", "country": "AU", "title": "Goldman Sachs says housing is 36 per cent overvalued in lower-growth economy", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Goldman Sachs says housing is 36 per cent overvalued in lower-growth economy | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T08:50:00.000+03:00", "replies_count": 0, "uuid": "8901e19f46834c75094b4d66adb8913dbbb19467"}, "author": "Christopher Joye", "url": "http://www.afr.com/real-estate/goldman-sachs-says-housing-is-36-per-cent-overvalued-in-lowergrowth-economy-20150803-giqfgd", "ord_in_thread": 0, "title": "Goldman Sachs says housing is 36 per cent overvalued in lower-growth economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Goldman argues that our bricks and mortar is still cheap for international buyers. Questioning the trend growth rate has become fashionable since Australia's monetary policy mandarin Glenn Stevens flagged that there may be reasons to believe it could be lower in the future. If this proves correct, it has serious ramifications for all investors. Beyond the impact on house prices, Goldman says that if the Reserve Bank of Australia were to lower its \"potential economic growth assumption [from 3.25 per cent to 2.5 per cent] ... Australian equities [values] would [theoretically] decline by 11.5 per cent\".\nInterestingly, Goldman argues that its housing valuation findings only apply to domestic buyers. For foreign purchasers that \"are not dependent on the cost of finance from the Australian banking system\", our bricks and mortar are actually \"cheap in Australian dollar terms, and even cheaper in US dollar terms post the [exchange rate's recent] decline\". Compared to three-bedroom apartments in Sydney's CBD on a price per square metre basis, real estate is much more expensive in Hong Kong (256 per cent dearer), London (120 per cent), New York (111 per cent), Singapore (77 per cent), and Paris (29 per cent) in Aussie dollar terms.\nNo wonder Chinese-Australian billionaire Chau Chak Wing was willing to shell out $70 million for James Packer's 3,300 square metre pad a week ago . (Packer paid $30 million for his land and reportedly spent $30 million building the palace, so he's probably only square after stamp duty and agents' fees.)\nIf much of the marginal demand for our homes increasingly derives from overseas buyers, Goldman contends that \"attempts by regulators to tighten the availability and the price of credit for domestic residential investors may prove relatively futile\". \"Indeed, viewed via this valuation framework, the regulatory response looks somewhat misguided.\"\n And if Australia's \"new-normal\" trend economic growth rate is weaker than the 3-3.25 per cent, Goldman believes its \"estimated 20 per cent overvaluation for Australian housing rises to a 36 per cent overvaluation\". The considerable embedded downside across the $5.5 trillion of Aussie housing is another reason why the major banks should be applauded for significantly boosting their equity capital during the good times when dumb money is cheap (CBA's trading at almost three times its book value).\nOf course, they have not done so voluntarily: we've had to bash them relentlessly in these pages for years for using far too much leverage and holding only around 4 per cent of real equity to protect more than $1.5 trillion in depositors' money from declining asset prices. Naturally the banks and vested interests said we were wrong, but with the Financial System Inquiry, and latterly the Australian Prudential Regulation Authority, buying into this view, logic has finally prevailed.\nAfter NAB's \"shock\" $5.5 billion equity raise, some analysts and commentators claimed there would be no more surprise rights issues. Yet as we forecast (alongside those \"lemmings\" Mike Smith excoriated, UBS and Morgan Stanley), ANZ obliged this week with a $3 billion placement that immediately slugged CBA and Westpac shareholders with 3 per cent to 4 per cent losses. CBA is now rumoured to be contemplating a mega $5 billion to $10 billion equity issue, which would be super-smart.\nMake no mistake, this is a race to a common equity tier one (CET1) capital ratio of a minimum of 10 per cent and our two biggest banks are behind the curve. Indeed, APRA has said they are short \"at least\" 200 basis points of capital, and it was referring to CET1, not hybrids or subordinated bonds. The upside for shareholders is that the banks have demonstrated they are having no difficulty flexing their awesome market power to pre-emptively reprice loans and deposits, which will mitigate the return on equity dilution wrought by lower leverage.\nThe next Australian recession This brings me to the next Australian recession. While nobody knows when it might arrive, it will happen eventually. And now is the time to think about triggers and business models that might thrive in an adverse climate.\nOne proposed to me by the 12 analysts at the $10 billion equities shop, JCP, is a negative change in credit outstanding. Since 1976 the only occasion that growth in total private sector credit outstanding has gone negative for more than two quarters (rolling monthly) was 1991, which unsurprisingly coincided with our last recession. JCP projects that while the RBA will cut the cash rate once more to 1.75 per cent, it will begin a slow normalisation process in 2017 with the cash rate peaking at a modest 3.75 per cent in 2022. This will precipitate overdue and sustained household deleveraging that will force a protracted contraction in credit outstanding for a five-year period.\nHalf a decade of negative credit growth coinciding with declining house prices and rising arrears (JCP concurs with Goldmans) would be bad news for the big banks, which could report their first losses since 1991. This is precisely why they should be building capital buffers today while naive equity investors presume a recessionary credit crunch will never materialise.\nOne business that might profit from this environment is the distressed debt investor Pioneer Credit (ASX: PNC). Pioneer buys bad loans off three of the four major banks for 20¢ in the dollar and works constructively with borrowers to help them repay these debts or reach a final settlement. Historically it has realised customer repayments that represent three times its initial investment.\nYet Pioneer has two challenges: first, properly scaling its business given the relatively small size of the personal loan market it is focused on; and, secondly, getting access to longer-term funding facilities that cannot be suddenly pulled when the next recession lands. If Pioneer can apply its core distressed debt competencies to other larger sectors (eg, home loans) and secure committed financing, it could be the perfect business to profit from any downturn.\nThe author is a director and shareholder in Smarter Money Investments, which manages fixed-income investment portfolios.", "external_links": [], "published": "2015-08-07T08:50:00.000+03:00", "crawled": "2015-08-07T10:07:19.666+03:00", "highlightTitle": ""}