{"organizations": [], "uuid": "c2d3d68b281a88cfa61c854aee7b64769ae85fed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/03/12884745/Co-op Cartoon_A02DO_small.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12884745.htm", "country": "US", "title": "Credit Unions: a Beacon of Hope for California's First-time Home Buyers", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Credit Unions: a Beacon of Hope for California's First-time Home Buyers", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "c2d3d68b281a88cfa61c854aee7b64769ae85fed"}, "author": "Cullen Bushnell", "url": "http://www.prweb.com/releases/2015/08/prweb12884745.htm", "ord_in_thread": 0, "title": "Credit Unions: a Beacon of Hope for California's First-time Home Buyers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Housing in California is more expensive than just about anywhere else in the country. Today, an average California home costs $440,000, nearly two-and-a-half times more than the national average, and rent is 50 percent higher in the Golden State than the rest of the country. “As housing prices rise, many next-generation home buyers think they have no viable options, so they fall into the trap of believing they will be renters forever,” says Samantha Paxson, Chief Marketing Officer, CO-OP Financial Services, a Southern California-based financial technology provider to credit unions. “This is where our 3,500 client credit unions across the country come into play. Credit unions take a personalized approach to home lending by understanding the needs of each member, then tailoring products and programs to meet those essentials in ways that banks and mortgage brokers do not.”\nTrulia’s study , released July 8th, 2015, calculated it would take a Millennial (aged 18-35) with a college degree nearly 30 years to save for a 20 percent down payment in San Francisco on a median-priced home. California metros accounted for seven of the top 10 most expensive U.S. cities to purchase a home. The number of years Millennials’ are estimated to save for a down payment is 18.8 years in Los Angeles, 18.5 years in Orange County, 17.7 years in San Diego, 17.7 years in San Jose, 15.6 years in Oakland and 15.5 years in Ventura County.\n“The number one problem for first-time home buyers, particularly Millennials, is that they simply don’t have the cash,” says Rebecca Reynolds Lytle, Senior Vice President & Chief Lending Officer at San Francisco Federal Credit Union, which provides online mortgage calculators, free pre-approvals and live mortgage rate information 24 hours a day on their mobile site. “Not only will these potential home buyers have gray hair by the time they’re able to afford a home, the prices will have escalated far beyond where they are today. Credit unions are setting themselves apart from banks by creating lending services specifically to address changing and often unmet needs of members. I like to think of these unique programs we develop as ‘disruptive’ lending.”\nMeriwest Credit Union of San Jose, Calif., is another institution that has developed a different roadmap for lending by partnering with Housing Endowment and Regional Trust (HEART), a nonprofit that helps moderate-income families buy their first home in the challenging San Mateo County housing sector.\nThe credit union’s “Opening Doors” home buyer loan program combines a first mortgage up to 80 percent loan-to-value, with a second market rate loan, to facilitate a home purchase with a minimum 5 percent down payment. The program reduces homeowners’ monthly payments and does not require them to buy private mortgage insurance for the loan, which saves thousands of dollars in annual mortgage insurance premiums.\n“Our lending program with HEART allows first-time home buyers to put 150 percent of their median income towards a monthly payment, says Daniel Hapner, Director of Mortgage Sales at Meriwest Credit Union. “First-time home buyers need programs like this that allow them make a greater down payment on a house because oftentimes, 20 percent isn’t enough to constitute a strong buyer in this competitive environment. If you want to be a strong buyer in this county, you’re looking at a 30 to 50 percent down payment because the available real estate is so scarce.”\nAccording to Reynolds Lytle, “It’s not our mission to say no; it’s our mission to help educate our members on how to build personal finances to make them an attractive borrower. We take the time to get to know them, hear their story and find ways to provide the financial flexibility needed to purchase a home. In turn, when a member can convert rent into a home purchase payment this actually helps them stabilize housing costs and build wealth.”\nTips first-time home buyers should know:\n1. Get Pre-Approved and Do Your Research\n“An informed buyer is an empowered buyer. Being pre-approved will save you a lot of time and minimize the chances of being misled into buying a house you can’t afford. You can get pre-approved online for free in under 20 minutes,” says Reynolds Lytle.\n2. Buy The House\n“Don’t get scared off from purchasing a home or tricked into the ‘forever a renter’ mentality. Buying a house is a solid investment in your future and may be the best investment you make in your entire financial portfolio. It can even make you money in the long run,” says Hapner.\n“Credit unions are a game-changer in the home lending market, not only for first-time home buyers, but all members,” says Paxson. “They are not-for-profit institutions that exist to help put their members on a lifetime path to achieving their financial goals.”\nAbout CO-OP Financial Services\nBased in Rancho Cucamonga, Calif., and founded in 1981, CO-OP Financial Services is the nation’s largest credit union service organization in terms of number of credit unions, assets and members. The company helps credit unions thrive by providing products and services that make it more convenient for members to do business with them. With a motto of “Be There. Be More,” CO-OP’s products fall into three business lines, including “Locations,” (ATM, shared branching and call center services); “Card Payments” (debit and credit processing) and “Mobile/Virtual” (mobile, online, check imaging, bill pay services). To learn more visit http://www.co-opfs.org .\n-####-", "external_links": ["http://t2440846.omkt.co/track.aspx?id=402|253E8E|DD07|0|1E|0|2A|1|38E7D3EF&destination=http%3a%2f%2fwww.trulia.com%2ftrends%2f2015%2f07%2fmillennial-down-payment%2f&dchk=8F143F9", "http://t2440846.omkt.co/track.aspx?id=402|253E8E|DD07|0|1E|0|2B|1|38E7D3EF&destination=http%3a%2f%2fwww.co-opfs.org&dchk=13F961CF", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5jby1vcGZzLm9yZw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50cnVsaWEuY29tL3RyZW5kcy8yMDE1LzA3L21pbGxlbm5pYWwtZG93bi1wYXltZW50Lw=="], "published": "2015-08-04T03:00:00.000+03:00", "crawled": "2015-08-04T16:09:21.612+03:00", "highlightTitle": ""}