{"organizations": [], "uuid": "3fb56fd7566ffa60dd198599ff990015cb4ba216", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/column-making-tax-compliance-less-taxing/114436", "country": "IE", "title": "Column: Making tax compliance less taxing", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Column: Making tax compliance less taxing | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T08:29:00.000+03:00", "replies_count": 0, "uuid": "3fb56fd7566ffa60dd198599ff990015cb4ba216"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/column-making-tax-compliance-less-taxing/114436", "ord_in_thread": 0, "title": "Column: Making tax compliance less taxing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A bumblebee sucks nectar from a flower but leaves it unharmed. Evaporation takes place all the time but we are unaware of it. Taxation, says the Mahabharata, should be as unobtrusive as that.\nIn stark contrast, the current government has tried to tackle the problem of tax evasion with a sledgehammer that creates a sense of deja vu. The recently enacted Undisclosed Foreign Income and Assets (Imposition of Tax) Act—UFIA—lays down that undisclosed foreign incomes and assets of Indian residents will be taxed at a flat rate of 30% without any exemptions, deductions or setting off of losses of earlier years. The penalty for failure to disclose such income or assets would be up to three times the market value of the undisclosed assets; and both the tax and penalty will be calculated on not only on the realised but also the unrealised profit from the foreign asset. Evasion of tax, penalty and interest under UFIA will attract a punishment of up to 10 years of rigorous imprisonment.\nTaking into consideration current administrative capabilities, how effective are these draconian measures likely to be? Basically, all these measures reflect the highly adversarial approach of our tax administration, based upon mistrust of the taxpayer that we have been seeing for decades. Tax laws in India on paper are already pretty stiff. Tax evasion in excess of R25 lakh already attracts rigorous imprisonment of up to seven years. Increasing the maximum sentence to 10 years would hardly add to the deterrence.\nCurrently, revenue leakages are sought to be plugged through an intricate web of monetary penalties, prosecutions, searches and surveys at the premises of suspected evaders, harassing tax scrutinies and a host of other coercive measures. Experience the world over, however, appears to suggest that such policies yield only limited success—as much perhaps as trains running on time during the Emergency! Within the framework of this coercive model, the probability of detection and certainty of punishment do create some deterrence. Stringent punishments on paper, on the other hand, by themselves hardly affect hardcore evaders, especially if they feel that they can get away with the help of clever lawyers and experts who know how to play the system. In India, the results of this current approach are apparent: some estimates indicate that more than half of our GDP consists of unaccounted incomes.\nTime has therefore come to try alternative approaches—it is physically impossible for a tax department to police each and every return. This is not to suggest that the existing coercive policies should be given up altogether, but their weight in the mix of policies that the tax department administers should perhaps be reduced, except in the case of a few recalcitrant taxpayers.\nWe instead need to find out what drives non-compliance? The causes for evasion are innumerable. Sometimes people do not pay tax because they cannot make the fiscal connection between what they pay and the benefits they get from the state in return. Voluntary compliance improves dramatically when taxpayers can see what the state does for them when they grow old or are unemployed; or when they see the state constructing good roads, hospitals and schools. Similarly, many high income taxpayers might feel much happier paying taxes if their contribution to development could be recognised—perhaps by granting them speedier clearances at airports, etc.\nPeople do not like to pay taxes when they have negative feelings towards the government, the bureaucracy or the tax administration. These may very well be the result of an earlier experience of harassment, or of having been treated in a high-handed or unfair manner. Such feelings of inequity also arise when a person is called upon to pay a certain amount of tax, when others equally placed are paying less or not doing so at all. The affected person then asks as why she is being singled out and being penalised.\nFinally, many people feel it is better to remain outside the system because tax laws are far too complicated for them to understand. They find that becoming a taxpayer involves not only paying tax but also penalties, interest and, at times, unaffordable professional fees. Also, the department is very prompt in collecting demands but extremely slow in giving effect to appellate orders, issuing refunds or carrying out rectifications. This again leads to complaints of unfairness and drives people away from voluntary compliance. Similar, too, is the case when laws are hastily introduced without considering the increase in the compliance cost of taxpayers.\nDrivers of non-compliance can thus be many—different taxpayers may have vastly different reasons for failing to comply with the law. But it is always important for a tax administration to know why people pay taxes and why they do not. When confronted with the problem of non-compliance, it is important to work with the people and find out why they feel aggrieved. In India, this should not be difficult to accomplish because we already have about 4,000 assessing officers with well-defined jurisdictions. Rather than focusing exclusively on desk scrutinies, they and their inspectors should be encouraged to learn more about the behaviour of taxpayers in their areas, the problems they experience in meeting the requirements of the department, and the difficulties they experience in dealing with it.\nThis approach has yielded excellent results in a number of OECD countries—tax collections in the US from daycare providers improved when the IRS simplified forms and devised less burdensome procedures for them. They now use standardised rates for calculating deductions due to them for providing meals to the children they look after.\nIn the UK, the tax administration made concrete efforts to reach out to very small businesses who could not afford representation. They sent them letters, along with brochures, indicating answers to frequently asked questions and the persons they could contact to get their difficulties removed. The administrators then compared the results of this initiative to a control group who were not addressed at all. On the whole, the traders who received communications offered 600 pound sterling higher income per taxpayer than the members of the control group. Sometimes a significant small step yields rich dividends—for example, when a letter from the tax office informed people that a large number of people in their neighbourhood were paying income tax. The appeal was for them to find security in numbers. Since seeking security in groups is intrinsic to human nature, not surprisingly the appeal worked well.\nA lot of effort is needed to work with communities and convince taxpayers that it is always in their best interest to pay taxes honestly. They get, for example, easier access to the country’s financial system and loans from banks. Results from such campaigns emerge slowly but are much more enduring than coercive methods, for paying tax is a matter of habit, and good habits once formed tend to persist.\nCynical tax administrators who seem to think that nothing other than wielding the big stick works in this country need to look at the behaviour of the Indian diaspora settled in the West. In their new adopted homelands, the same people, who are considered to be incorrigible in India, are widely admired for being law-abiding, honest and hard-working. People do respond to incentives and disincentives; when these change, so does behaviour. Often, half the battle is won when a tax officer is fair and reasonable.\nPadmini Khare Kaicker is managing partner of BK Khare and Co. Hardayal Singh was formerly chief commissioner of income tax and ombudsman to the Income Tax Department, Mumbai\n 06, 2015 12:29 am", "external_links": [], "published": "2015-08-06T08:29:00.000+03:00", "crawled": "2015-08-06T05:05:34.561+03:00", "highlightTitle": ""}