{"organizations": [], "uuid": "32e6fd1fdead299328348547608b409140e8ede6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/porn-banned-reuters-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/tech/porn-ban-in-india-sparks-censorship-debate/113070", "country": "IE", "title": "Government orders clampdown on Internet porn, sparks censorship debate", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Government orders clampdown on Internet porn, sparks censorship debate | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T00:29:00.000+03:00", "replies_count": 0, "uuid": "32e6fd1fdead299328348547608b409140e8ede6"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/tech/porn-ban-in-india-sparks-censorship-debate/113070", "ord_in_thread": 0, "title": "Government orders clampdown on Internet porn, sparks censorship debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Amazon allows developer to use Alexa in devices Soppy Facebook couples more likely to stay together Hitchhiking Robot: Vandals trash hitchBOT, bring cross-country trip in US to end India has blocked hundreds of adult websites to prevent pornography becoming a social nuisance, a government official said on Monday, sparking a debate about censorship and freedom in the world’s largest democracy.\nIn India’s first big crackdown on Internet porn, service providers have been directed to block 857 websites, N.N. Kaul, a spokesman at the department of telecommunications, told Reuters.\n“Free and open access to porn websites has been brought under check,” Kaul said.\n“We don’t want them to become a social nuisance.”\nThe government, in a 17-page order issued on July 31 and leaked to freedom of speech activists on Monday, listed offending sites and directed service providers to block access on the grounds of morality and decency.\nGovernment asks ISPs to block 857 porn websites, but will it work? ( Watch video )\nLast month, the Supreme Court refused to impose an outright ban after hearing a petition that said Internet porn fuelled sex crime. The court said individuals should be free to access such websites in private.\nBut the court asked the home ministry to submit its views and the government acted after the ministry sent a letter to the telecom secretary, Kaul said.\nOver the weekend, several sites became inaccessible and displayed messages that they were blocked on instructions of the competent authority. The hash tag #Pornban became a trend on Twitter.\n“Porn ban is anti-freedom, impractical, not enforceable. Politically not very smart too. Avoidable. Let’s not manage people’s private lives” best-selling novelist Chetan Bhagat posted on Twitter.\nIndia has the second largest number of internet users after China. Social media and smartphone use is growing rapidly.\nIn 2011, India urged social network companies to screen content and remove offensive material. A year later, the government faced criticism for ordering dozens of Twitter accounts to be blocked for spreading rumours.\nCensorship extends to Bollywood and Hollywood movies, with regulators often forcing producers to edit dialogues and scenes to suit audiences in the generally conservative country.\nDemand for porn, however, seems strong. Pornhub, an adult entertainment website included in the ban, last year said India ranked fifth for daily visitors.\nKaul said the government was working on a long-term solution and suggested the ban would not remain indefinitely.\nList of porn websites banned in India\nFirst Published on August 03, 2015 4:29 pm", "external_links": ["http://www.scribd.com/doc/273372869/List-of-porn-websites-banned-in-India", "http://www.youtube.com/embed/8PBw8bXV_kY", "http://www.scribd.com/embeds/273372869/content?start_page=1&view_mode=scroll&access_key=key-DxSTaHEWrpykwENhPSwn&show_recommendations=true", "http://www.youtube.com/watch?v=8PBw8bXV_kY"], "published": "2015-08-04T00:29:00.000+03:00", "crawled": "2015-08-03T18:32:03.217+03:00", "highlightTitle": ""}