{"organizations": [], "uuid": "b9caf70a9b808857cf6928a76c0326feae1c6cde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-utilities/?format=rss", "section_title": "Utilities News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/asian-shares-steady-now-mixed-010520059.html", "country": "GB", "title": "Wall Street stocks dip after Chinese market tumbles", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Wall Street stocks dip after Chinese market tumbles", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T00:38:00.000+03:00", "replies_count": 0, "uuid": "b9caf70a9b808857cf6928a76c0326feae1c6cde"}, "author": "", "url": "https://uk.finance.yahoo.com/news/asian-shares-steady-now-mixed-010520059.html", "ord_in_thread": 0, "title": "Wall Street stocks dip after Chinese market tumbles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 19, 2015, 02:46 BST - UK Markets open in 5 hrs 14 mins Wall Street stocks dip after Chinese market tumbles Reuters – 4 hours ago \nA man walks past a display showing stock prices in Tokyo August 12, 2015. REUTERS/Thomas Peter \nBy Chuck Mikolajczak \nNEW YORK (Reuters) - A 6.0 percent tumble in Chinese shares on Tuesday, and weak earnings from Wal-Mart pressured U.S. stocks and copper prices saw six year lows. \nChinese stocks earlier plunged on concerns that companies may pull more money out of China as economic growth slows, lowering earnings for U.S. and European companies dependent on revenue from China. \nThe Shanghai Composite Index .SSEC closed down 6.1 percent at 3,749.12 points in its biggest daily decline since July 27, after recovering for three days. The CSI300 index .CSI300 of the largest listed companies in Shanghai and Shenzhen fell 6.2 percent at 3,825.41. \nWal-Mart Stores Inc, the world's largest retailer by revenue, saw its stock fall 3.4 percent to $69.48, and was the biggest drag on both the Dow Jones Industrial Average and S&P 500 stock index, after reporting weaker-than-expected quarterly earnings and lowering its full-year forecast. \n\"You would think that a 6.0 percent China move amid the recent currency adjustments would have netted a more negative result,\" said Andre Bakhos, managing director at Janlyn Capital LLC in Bernardsville, New Jersey. \nThe Dow Jones industrial average fell 33.84 points, or 0.19 percent, to 17,511.34, the S&P 500 dropped 5.52 points, or 0.26 percent, to 2,096.92 and the Nasdaq Composite declined 32.35 points, or 0.64 percent, to 5,059.35. \nMSCI's broadest index of Asia-Pacific shares outside Japan was down 1.2 percent after hitting its lowest since July 2013. Japan's Nikkei dipped 0.3 percent. \nMSCI's all-country world stock index eased 0.31 percent. \nBritain's FTSE 100 closed down 0.4 percent. The pan-European FTSEurofirst index of 300 leading shares managed a gain of 0.2 percent, after earlier declines. Germany's DAX dropped 0.2 percent and France's CAC 40 fell 0.3 percent. \nThe worries about China came on a day when trade in the yuan was relatively calm after Beijing fixed the currency's exchange rate marginally higher for the third successive session. \nChina's central bank on Tuesday set the yuan's midpoint near Monday's closing price at 6.3966 per U.S. dollar. In the spot market, the yuan closed flat at 6.3938. \nConcerns about slowing demand for commodities from China also hit copper prices, which slid to a six-year low of $4,983 a tonne, breaking the psychological $5,000 level, and were last down 1.8 percent at $5,022 a tonne. \nCrude oil prices recovered though from initial declines after bullish U.S. housing data and on bets on an inventory decline. \nBrent oil futures settled up 7 cents at $48.81 per barrel to steady after a three-day fall while U.S. crude rebounded from nearly a 6-1/2-year low to settle up 1.8 percent at $42.62. \nU.S. housing starts rose to a near eight-year high in July as builders ramped up construction of single-family homes, suggesting that the economy was firing on almost all cylinders. \nThe U.S. housing data on Tuesday added to good employment, retail sales, and industrial output data recently in suggesting the economy got off to a strong start in the third quarter. The steady flow of upbeat economic reports has bolstered views that the Federal Reserve will raise interest rates in September. \n\"The Fed is likely to take further reassurance that housing is on an improving trend and this should add to the view that the economy is in more normal territory,\" said John Ryding, an economist at RDQ Economics in New York. \nInvestors will look to U.S. inflation data and minutes of last month's Federal Reserve monetary policy meeting on Wednesday, as they seek for further clues as to when the Fed will begin raising interest rates. \nBenchmark 10-year Treasury notes were down 13/32 in price to yield 2.1961 percent. \n(Reporting by Chuck Mikolajczak; Editing by Steve Orlofsky and Clive McKeef)", "external_links": [], "published": "2015-08-19T00:38:00.000+03:00", "crawled": "2015-08-19T04:47:39.864+03:00", "highlightTitle": ""}