{"organizations": [], "uuid": "92cfb5267ca336d334dee4883e059bea795a49eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/QBxw6XoJVXCpj3N.THrmug--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/gravity-jpg-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-skynews/?format=rss", "section_title": "Finance News | Sky News - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/tax-breaks-set-stage-more-065426817.html", "country": "GB", "title": "Tax Breaks Set Stage For More UK Blockbusters", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Tax Breaks Set Stage For More UK Blockbusters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T09:54:00.000+03:00", "replies_count": 0, "uuid": "92cfb5267ca336d334dee4883e059bea795a49eb"}, "author": "", "url": "https://uk.finance.yahoo.com/news/tax-breaks-set-stage-more-065426817.html", "ord_in_thread": 0, "title": "Tax Breaks Set Stage For More UK Blockbusters", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 08:51 BST - UK Markets close in 7 hrs 39 mins Tax Breaks Set Stage For More UK Blockbusters By (c) Sky News 2015 | Sky News – 57 minutes ago View Photo \n\nMore blockbusters could be made in the UK after plans to increase tax breaks for film-makers were approved by the European Union. \nThe measure, first announced in Chancellor George Osborne's 2015 Spring Budget, gives film and TV productions 25% off their tax costs if they then invest the funds back into their projects. \nAlthough tax breaks for British productions were first introduced several years ago, the new policy will raise the percentage films can claim back under tax relief. \nWhereas previously the 25% rate only applied to the first £20m of a production's budget, it has now been extended to cover all tax paid on a project regardless of budget and size. \nThis is expected to be of particular benefit to large film productions similar to 2013's hit Gravity, whose budgets can run into the tens of millions. \nBut the new measures needed to be approved by the EU under rules about how governments can support companies. \nTo qualify for the tax breaks a film must be considered a British production or co-production, which means it has to pass a cultural test run by the Department for Culture, Media and Sport (DCMS) and spend a minimum of 10% of its budget in the UK. \nClaims for the tax relief will now be backdated to April 2015. \nAnnouncing the measure on the set of Sky (LSE: BSY.L - news ) 1 detective series Agatha Raisin, Mr Osborne said the move would give a boost to an industry that already brought billions of pounds of investment and hundreds of jobs to Britain. \n\"British-made films are watched and celebrated all over the world - last year alone we saw eight British-made films nominated for an Oscar,\" he said. \n\"A key part of our long-term economic plan is supporting our creative industries that contribute billions to the economy and provide millions of jobs. \n\"We want to see more films, like Gravity and Avengers: Age of Ultron, made in Britain and that's why we've made our film tax relief even more generous.\" \nThe chief executive of the British Film Institute (BFI), Amanda Nevill, said: \"The film tax relief is a key ingredient in the UK's winning combination of outstanding film-making talent and crews, world-leading studios and facilities, and iconic locations. \n\"It (Other OTC: ITGL - news ) keeps us competitive on the world stage, and helps grow our economy and create jobs at home.\"", "external_links": [], "published": "2015-08-21T09:54:00.000+03:00", "crawled": "2015-08-21T10:53:13.786+03:00", "highlightTitle": ""}