{"organizations": [], "uuid": "8fb6f7fb37b06d9edbdb10d0e50a04c499a3d162", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/77K0S_vB_IksyMgzDqZbPQ--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/34bc874028bb342da29c193a8cdab1b5d825e36d_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/thai-economic-growth-slows-outlook-070513923.html", "country": "GB", "title": "Thai economic growth slows, outlook dims on yuan fall", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Thai economic growth slows, outlook dims on yuan fall", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T10:05:00.000+03:00", "replies_count": 0, "uuid": "8fb6f7fb37b06d9edbdb10d0e50a04c499a3d162"}, "author": "", "url": "https://uk.finance.yahoo.com/news/thai-economic-growth-slows-outlook-070513923.html", "ord_in_thread": 0, "title": "Thai economic growth slows, outlook dims on yuan fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Aug 17, 2015, 09:52 BST - UK Markets close in 6 hrs 38 mins Thai economic growth slows, outlook dims on yuan fall AFP – 1 hour 47 minutes ago View Photo \n\nThailand's economy slowed in the second quarter hit by weak domestic demand and exports, official data showed Monday, with growth expected to be hampered by China's devaluation of the yuan. \nGross domestic product grew 2.8 percent compared to a year earlier between April and June, in-line with a forecast from analysts polled by Bloomberg News but down from three percent in the previous quarter. \nGrowth also faces \"major constraints\" for the rest of 2015 after China's devaluation of its currency will likely increase competition for Thai exports, the National Economic and Social Development Board said. \nChina's central bank shocked world financial markets last week when it devalued the yuan, sparking fears of a currency war in Asia in which countries vie to keep their exports competitive. \nIn response, Thailand's planning agency trimmed its growth forecast to 2.7-3.2 percent for the year, down from 3.0-4.0 percent. \nPrime Minister Prayut Chan-O-Cha, the former army chief who led last year's coup, has staked the junta's legitimacy on pepping up Thailand's once dynamic economy. \nBut 15 months after his power grab there have been few signs of economic revival, despite a pledge to increase government spending and push through much-needed infrastructure projects. \nQuarter-on-quarter growth remained sluggish between April and June at 0.4 percent, marginally up from 0.3 percent in the first three months of the year, the NESB said. \n\"Looking ahead, we expect growth to remain lacklustre... the main support for growth will likely come from government spending and the tourism sector,\" Capital Economics said in a note. \nHigh household debt and a recent drought are likely to further dent consumption in a nation where 30-40 percent of the population is employed in agriculture, the research house added. \nWeak growth has dogged the Thai junta's narrative that its takeover was a necessary evil to keep the peace and bolster the economy in the face of prolonged political turmoil. \nThe kingdom grew at 0.7 percent in 2014, the slowest pace for three years, amid mass street protests against the former civilian government. \nThe junta says it will hand back power to a civilian government after a new constitution aimed at healing Thailand's bitter divides and expunging corruption is enacted. \nCritics accuse the junta of holding onto power and seeking to create a tightly-controlled political system that serves the interests of its royalist supporters rather than the popular will.", "external_links": [], "published": "2015-08-17T10:05:00.000+03:00", "crawled": "2015-08-17T11:54:00.464+03:00", "highlightTitle": ""}