{"organizations": [], "uuid": "61598e559cd892d63c43b5ca78cc03a8f8f7442d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/04/rbi-pti-T1.jpg", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/rbi-set-to-maintain-dovish-policy-stance-anindya-banerjee/116689", "country": "IE", "title": "RBI set to maintain dovish policy stance: Anindya Banerjee", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "RBI set to maintain dovish policy stance: Anindya Banerjee | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T21:32:00.000+03:00", "replies_count": 0, "uuid": "61598e559cd892d63c43b5ca78cc03a8f8f7442d"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/rbi-set-to-maintain-dovish-policy-stance-anindya-banerjee/116689", "ord_in_thread": 0, "title": "RBI set to maintain dovish policy stance: Anindya Banerjee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Over the past week, there was quite a bit of volatility seen in the rupee pairs as well in the long term bonds from the sovereign. The most keenly watched event for domestic traders was the RBI monetary policy. RBI maintained a relatively balanced view in its monetary policy outlook, while deciding to keep rates unchanged. It indicated that there is room for further moderation if disinflationary pressures increase. However, RBI also cautioned against rising trend in core inflation. Uncertainty surrounding monsoon and global financial market turmoil can have a positive effect on inflation. RBI emphasised on the benefits of easy of liquidity that is persisting in the Indian economy. In an environment of easy liquidity transmission of lower rates improve. However, RBI also indicated that it would look to keep the short term money market rates around the repo of 7.25%. Seasonality can lead to consumer inflation falling to below 5% over the next couple of months but by Jan-March of 2016 it expects CPI to rise to 5.8%, 0.2% less than what it had forecasted in the June policy. Overall, we expect, RBI to maintain a dovish policy stance through guidance and liquidity flow. Further reduction of rates can occur if growth fails to pick-up by end of the calendar year. Indian economic growth has weakened significantly over the past 9-12 months. At the same time, supply side push from government should provide further impetus to disinflationary trend. Therefore, for RBI to move on rates, we believe, it needs to see further evidence that growth is failing to rebound. A global economic shock can also prompt a more dovish stance from RBI.\nTurning our attention away from RBI, towards the global markets, we saw a major development in the SDR issue in China. The International Monetary Fund should put off any move to add the Yuan to its Special Drawing Rights currency basket until September 2016, an IMF staff report said, a move that would effectively end the Chinese currency’s chances of an early inclusion. China has been caught hard choices, should it weaken Yuan and face the unintended consequences or not do that and see the economy grind lower even more. Over the past five quarters, and could be very much sixth once the third quarter data comes out, Chinese economy has been witnessing a nearly record pace of capital outflows. It is estimated around $800 billion of outflows occurred. Over that period how much has Chinese yuan weakened against the US dollar? Barely 2%. How much did the global currencies depreciation against the US dollar? Between 10-40%. Therefore, it was the Chinese central bank that has been selling down its FX reserves to prevent a sharp slide in its currency. The Chinese FX reserves are down more than $300 billion from its peak a year ago. However, by selling yuan its finding itself in worse-off zone. Every dollar it sells, it needs to buy over 6 units of yuan. Hence, leads to contraction of money supply. With economy decelerating sharply and deflation mounting in an over-leveraged economy, the cocktail appears dangerous. A weaker yuan can help import some inflation and also help its export sector. Without any supporting crutches, Chinese exporters are becoming losers in the game of global currency war. Therefore, we expect Chinese central bank to throw monetary firepower like slashing reserve ratios and even lowering interest rates and possibly a QE later down the road. All these things can finally break the floor underneath and trigger a sizable devaluation in the currency. A sharply weaker yuan, can only trigger further capital outflows from the hot money segment but also cause geo-political blowbacks across Asia, Europe and Americas.\nIn other events over the past week, US employment report showed that the US economy added around 203K jobs over the month of July. Trend of US NFP’s monthly run rate is southward. From a level of 250k few months back to now near 200k. Reasons are not difficult to fathom. Massive squeeze in the hard asset dependent part of the economy and a global slowdown is taking a toll on the job creation. The headline NFP data undergoes significant statistical adjustments, which some have even called as a “torture”. Hence, the data has to be seen in conjunction with similar types of economic data from US, like PMIs, Challenger surveys, ADP etc. All of them are pointing towards a slowing rate of job growth.\nWe would not be surprised if August NFP comes weaker, something less than 180k. However, we still expect US Fed to remain committed to a rate hike by end of this year, for reason which we outlined in our previous mailers on Fed. For Fed to back-off, it would require a substantial escalation in global financial market turmoil, possibly from China. Apart from a hike an equally important trend will be US Fed’s re-investment plan of its balance sheet. Around 400-500 billion USD of MBS and TSY are maturing in 2016. If US Fed allows them to roll-off normally, then it will cause a near 2% drop in US money supply. It will be enough to offset near 70/80% of annual QE from BOJ or ECB. Additionally, coupled with rising rates, it will make monetary policy quite tight and in turn can trigger an even sharper rally in US Dollar, putting an added stranglehold on the global economy. So watch this space.\nOver the rest of the month of August I do not expect much of volatility. August tends to be a month of low volatility as European traders go on vacation. With September monetary policy expected to start of a fireworks season, it all more likely that we will see calmer trading conditions this month. As far as bond goes, we expect a range of 7.75-7.90% on the new 10 year and on USD/INR a range of 63.30/50 and 64.30/50 remains a favoured territory. Importers and exporters can keep their hedges restricted to 2-3 months and preferring extreme of the ranges to initiate them. Euro is expected to remain in a range of 68.50/69.00 and 72.00/72.50 over the near term. GBP is also expected to traverse within a range of 95.50/96.00 and 100.00 on spot and YEN/INR could remain between 50.00/50.50 and 52.50/53.00 on spot.\nBy Anindya Banerjee, analyst, Kotak Securities\n 10, 2015 1:32 pm", "external_links": [], "published": "2015-08-10T21:32:00.000+03:00", "crawled": "2015-08-12T04:23:11.558+03:00", "highlightTitle": ""}