{"organizations": [], "uuid": "a6af731475997d0c4802ffc39c783d9f8a8b39ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/02441/hounslow_2441104k.jpg", "site_section": "http://www.telegraph.co.uk/finance/personalfinance/", "section_title": "Personal finance - How to grow your wealth and spend less money - Telegraph - Telegraph", "url": "http://www.telegraph.co.uk/finance/property/house-prices/11764794/Commuter-towns-that-shave-450000-off-London-prices.html", "country": "GB", "title": "London workers £300,000 better off living an hour outside capital", "performance_score": 2, "site": "telegraph.co.uk", "participants_count": 13, "title_full": "London workers £300,000 better off living an hour outside capital - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T15:59:00.000+03:00", "replies_count": 12, "uuid": "9456ed6f043ff5cd70fc9f1765efa045249eea24"}, "author": "Dan Hyde , and Kate Palmer", "url": "http://www.telegraph.co.uk/finance/property/house-prices/11764794/Commuter-towns-that-shave-450000-off-London-prices.html#post-0", "ord_in_thread": 0, "title": "London workers £300,000 better off living an hour outside capital", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House prices in London are so inflated that living just an hour outside the capital can save city workers £300,000 – even after the cost of train travel. Research into housing and travel costs paid by commuters found price rises in the capital have made living close to work a poor decision, financially speaking. The opposite is true in Birmingham and Manchester, where out-of-town residences are more highly sought-after and more expensive than city centres, the data showed. Andrew Mason, mortgages director for Lloyds Bank, which conducted the research, acknowledged that the decision to commute was \"not simply a trade-off between financial costs and journey times\" and people would take into account \"quality of life\". >> In pictures: Ten cheapest towns within an hour of London Yet he said those who commuted tended to have more money to spend when they returned home, thanks to the higher wages available from city jobs the lower cost of mortgages. Tessa Jowell, the Labour Party mayoral candidate, said she wanted to address the \"housing crisis\" in the capital after her own research showed it would be £403 a month cheaper to rent and commute to work from Madrid than from a flat in north London. • \"With £250,000, how can I help my two children buy property?\" • Buy-to-let: hotspots for 2015 revealed Those escaping the rental market are finding almost impossible to buy near the office. Lloyds said the average price of a property close to London's central working areas – zones 1 and 2 – is now £722,000. The research comes as house prices in England and Wales reach record highs , according to Government data published this week. Annual house price growth is now 5.4pc, but London had the most significant movement, at 9.2pc yearly growth, house prices indices from the Land Registry show. As soon as buyers head away from the metropolis, prices become much more affordable. Homes in towns an hour's commute away, which include Crawley, Newbury, Colchester and Chatham, cost £272,000 on average – a £450,000 difference. Workers who took an hour's train journey to the office every day would pay £4,944 a year on average, the research showed. At today's prices, 30 years of commuting would cost £150,000. So even after travel costs are included in the calculations, commuters would be £300,000 better off after a 30-year career. Even expensive areas like Wimbledon fail to keep pace with inflated London property prices They would need to travel for 91 years for the total rail costs to \"wipe out the difference in average house prices,\" Lloyds said. Taking out a large mortgage to afford a London home helps little, either. The cost of borrowing an extra £450,000 at just 2 per cent interest rates – which is low even by today's standards – is £9,000 a year, calculations showed. House buyers who would rather avoid a 10 hours of commuting a week could consider nearby Reading, Stevenage or Billericay for a 40-minute journey. Houses cost £349,000 on average and train fares are £3,499 a year. Closer to London, houses in Wimbledon, East Croydon or St. Albans cost £401,083 on average, and are around 20 minutes from central London. Annual travel costs £2,000. It's cheaper to live in Birmingham and walk to work than to live on its commuter belt In Britain's second and third-largest cities, Birmingham and Manchester, houses on the commuter belt tended to be costlier. Birmingham homes typically cost £162,000, but towns 40 minutes away by train, including Walsall, Wolverhampton, Coventry and Leamington Spa, cost £175,000 on average. Commuters from these towns pay around £1,900 for a season ticket. Homes in Manchester are also cheaper, at £151,330 on average. But those travelling from Warrington, Chorley, Huddersfield or Macclesfield will pay £168,00 for the typical home and almost £2,000 in rail fares. Commuter town prices and travel costs Towns Journey from London Average house price Season ticket costs New Cross, Wimbledon, Ilford, Alexandra Palace, Hanwell, Tottenham, St. Albans and East Croydon 14-20 minutes £401,083 (44pc cheaper) £2,017 Beaconsfield, Gerrards Cross, Hatfield, Guildford, Sidcup, Woking, Chelmsford, Harlow, Hemel Hempstead, Hounslow, Rickmansworth, Reading, Hitchin, Stevenage, Billericay, Luton, Sevenoaks 21-40 minutes £348,724 (52pc cheaper) £3,499 Basingstoke, Crawley, Milton Keynes, Hounslow, Gravesend, Windsor, Northampton, Wellingborough, Rugby, Winchester, Colchester, Peterborough, Swindon, Oxford, Newbury, Kettering, Chatham, Sittingbourne, Tonbridge, Wokingham 41-60 minutes £272, 068 (62pc cheaper) £4,944 Lloyds Bank analysis of Land Registry, ATOC and National Rail data >> One minute mortgage check: How much could you save? – kate.palmer@telegraph.co.uk Telegraph Mortgage Comparison» Telegraph Mortgages Fee-free, expert advice on the right mortgage for you. 1,000's of deals compared Compare", "external_links": [], "published": "2015-07-29T15:59:00.000+03:00", "crawled": "2015-08-08T04:03:51.000+03:00", "highlightTitle": ""}