{"organizations": [], "uuid": "fa4c2348f035b19fe2dd745756e6d69f919bf796", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/RBI04815.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/government-does-not-intend-curbing-rbi-powers-official/43004.html", "country": "IN", "title": "Government does not intend curbing RBI powers: Official", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Government does not intend curbing RBI powers: Official", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T07:51:00.000+03:00", "replies_count": 0, "uuid": "fa4c2348f035b19fe2dd745756e6d69f919bf796"}, "author": "IANS", "url": "http://www.moneylife.in/article/government-does-not-intend-curbing-rbi-powers-official/43004.html", "ord_in_thread": 0, "title": "Government does not intend curbing RBI powers: Official", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Government does not intend curbing RBI powers: Official 43004 Government does not intend curbing RBI powers: Official 0 Comments, Be the first to comment + COMMENT IANS | 04/08/2015 10:21 AM | A day before the Reserve Bank of India's scheduled monetary policy review, the government on Monday clarified it was not trying to curtail the central bank's powers on this issue. \"We are in discussion with RBI Governor Raghuram Rajan on the form and manner of the monetary policy committee,\" Finance Secretary Rajiv Mehrishi told reporters here. Noting out that the draft Indian Financial Code (IFC) is still under the government's consideration, he said it was incorrect to conclude on the basis of the draft bill that the government was trying to curtail the RBI's autonomy. \"The government's views will be revealed at the time of presentation of the draft Indian Financial Code Bill,\" he said. The draft IFC, circulated last month as a discussion paper, proposes to remove the RBI governor's veto right in the monetary policy committee. Besides taking away the RBI governor's authority to veto interest rate decisions, the draft also proposed that the monetary policy committee would have four representatives of the government and only three from the central bank, including the RBI \"chairperson\". American research firm Moody's Analytics, in a report on Thursday, warned against the NDA government's moves to tamper with the autonomy of the Reserve Bank of India in deciding on interest rates, as being potentially damaging for the economy. In the original draft, the RBI \"chairperson\" had power to \"supersede the decision\" of the committee in \"exceptional and unusual circumstances\". Finance Minister Arun Jaitley last week said the government will decide on the draft IFC only after comments from stakeholders. \"Financial Sector Legislative Reforms Commission has made its recommendations, which have been made public for comments. Only after the comments are received that the government will take a view,\" he said. Minister of State for Finance Jayant Sinha also told reporters here on last week that the government will consult the RBI before taking a decision on the formation of the monetary policy committee. Jaitley, in his February budget, had announced a monetary policy committee pact earlier with the RBI that will reduce the governor's power to act alone. However in May, Jaitley backtracked, withdrawing from the Finance Bill the clauses pertaining to setting up of a public debt management agency (PDMA) and the amendments to the RBI Act that would have taken away its powers to regulate government securities. The United Forum of Reserve Bank Officers Employees had earlier written to MPs and various chief ministers that the changes, if implemented, would cripple the functions of the central bank. It said the proposed changes would curtail the authority of the RBI and render it totally ineffective in discharging its responsibilities on monetary policy, financial stability and targeting inflation. More in Moneylife", "external_links": [], "published": "2015-08-04T07:51:00.000+03:00", "crawled": "2015-08-04T09:34:31.585+03:00", "highlightTitle": ""}