{"organizations": [], "uuid": "421ed89704cd0edc989d139fbb864e694921db5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/05/iran-nuclear-italy-idUSL5N10G17W20150805", "country": "US", "title": "UPDATE 1-Iran's President Rouhani to visit Rome -Italian ministry", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Iran's President Rouhani to visit Rome -Italian ministry | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T13:39:00.000+03:00", "replies_count": 0, "uuid": "421ed89704cd0edc989d139fbb864e694921db5b"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/05/iran-nuclear-italy-idUSL5N10G17W20150805", "ord_in_thread": 0, "title": "UPDATE 1-Iran's President Rouhani to visit Rome -Italian ministry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds detail)\nDUBAI Aug 5 (Reuters) - Iranian President Hassan Rouhani has accepted an invitation to visit Rome, Italy's foreign ministry said on Wednesday, in what would be his first trip to an EU capital as he tries to mend diplomatic and economic ties with the West.\nPrime Minister Matteo Renzi invited Rouhani to make the trip \"in the coming weeks\", according to a spokesman for Foreign Minister Paolo Gentiloni, who was in Tehran on Wednesday, the latest high-level European official to visit the major oil producer which is about to exit a tough EU sanctions regime.\n\"Rouhani accepted the invitation and will let us know when,\" Gentiloni told reporters in Tehran, the spokesman said.\n\"In addition to political co-operation, our two countries can work together in the fields of trade, commerce and economy,\" Iranian state news agency IRNA reported Gentiloni saying. His spokesman confirmed the comment.\nSeveral European ministers have visited Tehran since a nuclear deal was struck last month, hoping to benefit from the opening of a major economy with a young, well-educated population of just under 80 million and some of the world's largest energy reserves.\nThe nuclear deal will lead to international sanctions, which had frozen much European business investment in Iran, being lifted in the coming months.\nItaly, which was not directly part of the nuclear talks, began pushing for better relations with Iran even before the deal was struck, and Gentiloni last visited Tehran in March.\nItalian oil and gas group Eni, which had a major presence until 2001, has said it will consider investing in Iran again if sanctions are lifted and it receives favourable contract terms.\nInvestment bank Mediobanca on Tuesday said that it, along with Italy's development ministry and export credit agency SACE, had signed a memorandum of understanding with Iran's economy ministry and its central bank.\nLast week, France's foreign minister, who had pursued a hard line during the nuclear talks, invited Rouhani to visit Paris in November, for what would be the first Iranian state visit to France since 1999. (Reporting by Sam Wilkin and by Steve Scherer in Rome; Editing by Robin Pomeroy)", "external_links": [], "published": "2015-08-05T13:39:00.000+03:00", "crawled": "2015-08-05T12:53:47.868+03:00", "highlightTitle": ""}