{"organizations": [], "uuid": "4b958820346f33d60a3fa578cdbdecbbccb0a2a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/europe-open-shares-led-lower-092300452.html", "country": "GB", "title": "Europe open: Shares led lower by oil and gas as investors sift through results", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Europe open: Shares led lower by oil and gas as investors sift through results", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T12:28:00.000+03:00", "replies_count": 0, "uuid": "4b958820346f33d60a3fa578cdbdecbbccb0a2a4"}, "author": "", "url": "https://uk.finance.yahoo.com/news/europe-open-shares-led-lower-092300452.html", "ord_in_thread": 0, "title": "Europe open: Shares led lower by oil and gas as investors sift through results", "locations": ["Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "339.30 +1.7000 \nLONDON (ShareCast) - (ShareCast News) - European equities were lower in early trade, with oil and gas stocks leading the decline as investors sifted through a raft of earnings reports. At 0910 BST, the benchmark Stoxx Europe 600 index was down 0.6%, France's CAC 40 was 0.8% weaker and Germany's DAX was 0.4% lower. \nOn the second day of trading since the closure of the stock market five weeks ago, Greece's Athens Composite was 3.9% lower. \n\"Yesterday we had one of the most fragile day in Athens when it's stock market opened. Investors used this opportunity to punish the market with a maximum sentence as the Greek banks closed towards their daily maximum limit level of 30%,\" said Naeem Aslam, chief market analyst at Ava Trade . \nOverall, the Stoxx 600 oil and gas index was the worst performer, down 1.2%. Oil prices were covering from recent lows but Brent crude was still below $50 a barrel while WTI was hovering around $45. \nOn the corporate front, Royal Bank of Scotland (LSE: RBS.L - news ) fell into the red on news that the UK government has sold 630m shares in the bank for £2.08bn, which equates to a stake of 5.2%. \nGerman car maker BMW (Swiss: BMW.SW - news ) dropped after reporting a decline in second-quarter profits on the back of higher costs. The company also cautioned that the landscape in China was increasingly competitive. \nCredit Agricole (Swiss: ACA.SW - news ) tumbled after revealing that it was under investigation by US authorities over potential sanctions breaches, while French insurer AXA (Paris: FR0000120628 - news ) nudged higher after posting a 2% rise in first-half net income. \nBritish insurer Standard Life (LSE: SL.L - news ) lost ground as it posted a drop in first-half UK operating profit to £141m from £165m in the same period last year, on the back of lower annuity sales following the pension reforms. \nIt wasn't all bad, however. \nEngineering company Smiths Group (Other OTC: SMGKF - news ) was the standout gainer on London's FTSE 100 index as it emerged that US activist hedge fund ValueAct is a shareholder. According to the Financial Times , ValueAct's stake in Smiths is below the 5% required for disclosure to the London Stock Exchange (Other OTC: LDNXF - news ) . \nShares (Berlin: DI6.BE - news ) in London-listed insurer Direct Line (Other OTC: DIISY - news ) rose after it reported a rise in pre-tax profit for the first half and a largely unchanged gross written premium, as it said underlying trends remain broadly in line with prior expectations. \nCar (HKSE: 0699-OL.HK - news ) parts maker Continental (Swiss: CONT.SW - news ) rallied after raising its full-year profit outlook thanks to an improved European car market. \nOn the data front, Eurozone PPI is at 1000 BST, while US industrial new orders are at 1500 BST.", "external_links": [], "published": "2015-08-04T12:28:00.000+03:00", "crawled": "2015-08-04T12:44:13.356+03:00", "highlightTitle": ""}