{"organizations": [], "uuid": "50ffb8254f2ec49b315bcdb99a19e663eeb68db0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/9/m/l/6/image.related.articleLeadwide.620x349.gj9mav.png/1440716309051.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2550/consumer-discretionary/retailing", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/retail/seafolly-cuts-ties-with-megan-gales-isola-swimwear-label-20150827-gj9mav.html", "country": "AU", "title": "Seafolly cuts ties with Megan Gale's Isola swimwear label", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Seafolly cuts ties with Megan Gale's Isola swimwear label", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "50ffb8254f2ec49b315bcdb99a19e663eeb68db0"}, "author": "", "url": "http://www.smh.com.au/business/retail/seafolly-cuts-ties-with-megan-gales-isola-swimwear-label-20150827-gj9mav.html", "ord_in_thread": 0, "title": "Seafolly cuts ties with Megan Gale's Isola swimwear label", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Megan Gale is still undecided about the future of her swimwear brand: \"It's a shame to lose momentum,\" she says. Photo: Jason South JPS\nModel and actress Megan Gale has a new investing challenge on her hands: whether to continue with her successful swimwear brand, Isola by Megan Gale, which has been ditched by the private equity arm of global luxury giant LVMH.\nIsola – pitched at women in their 30s and 40s – was established five years ago as a partnership between Gale and Seafolly, a family-owned business built over the past four decades by Sydney's Halas family. Last December, the family sold a 70 per cent stake in Seafolly to the LVMH-backed L Capital Asia for $70 million.\nNow, Seafolly's new owner is shaking things up in its first major change at the Australian swimwear company, severing its relationship with the brand and Gale. L Capital Asia believes the brand will not work globally and has handed control to Gale, who is still undecided about its future.\n\"It is unusual for there to be such a big change within a brand when it is having great success season on season,\" Gale tells Fairfax Media.\nAdvertisement \"Normally the case is the product is not selling, or stockists don't want it any more. It's very rare for it to be flourishing yet still be wound down … It's a shame to lose momentum, but the smart thing to do is rest the brand for at least a season to think about the best direction.\"\nGale, who is Isola's creative director, will take full control in January. The label is sold in 100 stores nationally and had sales of $4 million in fiscal 2015. Its 2015/2016 summer range will be launched in November – the last collection until its future is decided.\nTrademark hurdles L Capital Asia wants to turn Seafolly from an Australian swimwear brand into a global beach lifestyle label. It decided to discontinue its relationship with Gale and Isola not because the label is doing badly, but because global trademark problems would hamper any attempt to launch it on the international stage.\nIt has had trouble registering the name in the United States, one of its prime targets for expansion.\n\"Under our new partnership [with L Capital], we need brands with a global reach,\" said Seafolly chief executive Anthony Halas​.\n\"We had issues with the trademarking of the Isola brand internationally, so sadly we have made the decision to discontinue that relationship.\"\nHalas says the group is considering buying or starting a new brand to fill the sales gap left by Isola.\nPerth-born Gale made her name modelling in Italy before returning home to Australia, where she was the face of David Jones and later became its brand ambassador until 2011.\nShe remains one of the faces of L'Oreal Paris and has branched out into acting, starring this year in George Miller's Mad Max: Fury Road .\nModel example Isola was Gale's first big business venture and she is keen to follow in the footsteps of models like Elle Macpherson, who has turned her success in front of the camera into a business empire.\nGale, 40, will launch a new homewares range for Target in September and says plans for a second collection are already under way. She has aspirations to expand into areas \"like sleepwear, lingerie, children's wear, baby nursery linen, candles and home fragrances\".\nGale and her partner, Richmond AFL player Shaun Hampson, are keenly aware of the short shelf life of their respective careers and regularly talk about what they might do when their performing days are over. Ideas include investing in property and opening a café in Melbourne, where they live with their young son, River.\n\"Jobs like football and modelling don't last forever,\" Gale says.\n\"The smart thing to do is think about what interests you, what drives you and what your passions are and figure out ways you can expand and create businesses and generate an income while doing something you love.\"\nDoing more with Isola could be part of this mix. \"I do like the idea of creating my own business and team and running it myself. There is something very appealing in that challenge. However, I have to consider all the other aspects of my life and projects I have, with the number one priority being a devoted mum.\"\nGale has also been investing in property for the past 17 years, but is conservative when it comes to the sharemarket.\n\"I feel more secure with property as a main investment strategy,\" she says. \"With stocks and shares, I'm more wary about it after the GFC.\"\nRead about LVHM's plans for Seafolly in \" A Place in the Sun \", AFR Magazine , out today.", "external_links": ["http://www.afr.com/brand/afr-magazine/seafollys-expansion-plans-with-lvmh-could-earn-it-a-place-in-the-sun-20150721-gih4ae"], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-28T04:45:41.413+03:00", "highlightTitle": ""}