{"organizations": [], "uuid": "c48e0036eb63cdf40f7185bf0dd6d97a09556d4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150807024442-investors-fleeing-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_pf.rss", "section_title": "Personal finance news - CNNMoney.com", "url": "http://money.cnn.com/2015/08/28/investing/stocks-markets-exit/index.html?section=money_pf", "country": "US", "title": "Investors dump stocks at record pace", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Investors dump stocks at record pace", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T19:27:00.000+03:00", "replies_count": 0, "uuid": "c48e0036eb63cdf40f7185bf0dd6d97a09556d4b"}, "author": "", "url": "http://money.cnn.com/2015/08/28/investing/stocks-markets-exit/index.html?section=money_pf", "ord_in_thread": 0, "title": "Investors dump stocks at record pace", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What the heck is going on with stocks? The word of the week for investors was \"sell.\" \nMom and pop investors are dumping their investments and moving to cash at levels not seen since the financial crisis of 2008. \nIt's an \"investor revolt,\" is how Credit Suisse characterized it. \nNormally when investors panic about stocks falling, they sell stocks and buy bonds, which are viewed as safer. But that's not happening now. \nInvestors aren't just fleeing stocks, they're exiting bonds, commodities and international funds too. July and August will be the first two-month stretch that retail investors have pulled money from BOTH stock and bond funds since the end of 2008, according to Credit Suisse. \nThe wild swings in stocks in the past week have only exacerbated the selling. \nThis week alone, investors have pulled nearly $30 billion from stock funds. That's the largest weekly outflow since Bank of America Merrill Lynch began tracking the data in 2002. \nRelated: $2.1 trillion erased from U.S. stocks in 6 days \nCNNMoney's Fear & Greed Index is showing an \"extreme fear\" level in the market. \nThe selling was particularly strong on Tuesday -- the day after the Dow's dramatic 1,000 points fall, it's largest point drop ever. \nWhile the overall trend among retail investors is to exit, there are some who defy fear and prowl for bargains . \nThe Dow made its historic drop Monday right after 9:30 am. By 9:45 am, Ryan Cutter was logged into his Charles Schwab ( SCHW ) account buying stocks. \n\"I got lucky because I bought at one of the lowest points,\" says Cutter, who is 24 and in his first year at Indiana University's Kelley School of Business. He actually made money this week. \nRelated: How I made money when the Dow lost 1,000 points \nCNNMoney spoke with several Millennial investors like Cutter who are looking for the opportunity buy some cheap stocks. Buying when they are still in their 20s and holding onto them for several years -- or even decades -- they believe will bring them high dividends later on. \n\"I've been kind of holding cash for awhile now in anticipation of this,\" Jeffrey Chartier, 27, told CNNMoney. He bought Netflix ( NFLX , Tech30 ) , Disney ( DIS ) and GE ( GE ) this week. \nRobinhood , an app that allows investors to make trades for free, is popular with Millennials. It saw a 100% increase in new accounts on Monday. On Tuesday, 80% of its customers were buying new stocks or adding more money to their current holdings. Popular purchases included Ford ( F ) , Netflix ( NFLX , Tech30 ) and Bank of America ( BAC ) .", "external_links": [], "published": "2015-08-28T19:27:00.000+03:00", "crawled": "2015-08-28T20:09:14.788+03:00", "highlightTitle": ""}