{"organizations": ["New York Times Millard Patton", "Bimac Corporation", "Baby Boomers Ready"], "uuid": "696533567492bf043ad8e8f35b07d379f4eb5996", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/08/20/102935306-SMALL_BIZ_EXITS_3r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/21324894/device/rss/rss.xml", "section_title": "Personal Finance", "url": "http://www.cnbc.com/2015/08/20/baby-boomers-ready-to-sell-businesses-to-the-next-generation.html", "country": "US", "title": "Baby Boomers ready to sell biz to next generation", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "Baby Boomers ready to sell biz to next generation", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T18:47:00.000+03:00", "replies_count": 0, "uuid": "696533567492bf043ad8e8f35b07d379f4eb5996"}, "author": "", "url": "http://www.cnbc.com/2015/08/20/baby-boomers-ready-to-sell-businesses-to-the-next-generation.html", "ord_in_thread": 0, "title": "Baby Boomers ready to sell biz to next generation", "locations": ["Moraine", "Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Maddie McGarvey"], "text": "Baby Boomers Ready to Sell Businesses to the Next Generation Stacy Cowley SHARES Maddie McGarvey | The New York Times Millard Patton works at Bimac Corporation, a precision casting company whose owners are seeking to retire after three decades, in Moraine, Ohio, Aug. 18, 2015. \nDan Bizzarro and Bill Jordan were still in college when they went to work at the Bimac Corporation, a castings manufacturer in Dayton, Ohio. After graduation, they joined full time as manufacturing and engineering executives. And eventually they teamed with a third employee to buy the business. ( Tweet This ) \nThey had a good ride. The company, with 40 employees, has annual sales of about $5.5 million. But as the two men entered their 60s, after nearly three decades as owners, they began to wonder how long the arrangement could endure. \nTheir partner, Roger Reedy, had been talking for several years about retiring and moving to Florida. After considering various options, including buying Mr. Reedy out, Mr. Bizzarro and Mr. Jordan decided their best choice would be to join with him in finding a new owner. \nRead more from the New York Times: Dueling town hall meetings add distance to Bush-Trump gulf \n\"The three of us aren't that far apart in age,\" Mr. Jordan said. \"At some point in time, Dan and I will be looking at slowing down ourselves.\" <p>How to build a better retirement income strategy</p> <p>This strategy can give you a consistent stream of income in retirement while protecting you against rising interest rates. Find out how.</p> \nIt is a realization that many business owners their age are coming to. As the sting of the recession fades and the economy grows healthier, entrepreneurial baby boomers who spent the last few decades building businesses are starting to move on to the next phase of their careers: cashing out. \nAnd as the generational torch is passed, the profile of small businesses is changing, too, with a markedly higher share of minority groups and women among younger business owners — a trend that could shift patterns of wealth and economic prospects. \nThe number of small businesses listed for sale nationwide is at a six-year high, according to data compiled by BizBuySell.com, an online marketplace. The tally of completed transactions is also rising, and the median sale price is up 12 percent compared with prices a year ago. \nBusinesses are sold for a wide variety of reasons, and America's improving economy is the largest factor in the recent rise, according to those in the industry. But bankers and brokers say there is a significant increase in sales from business owners in their 60s and 70s who are ready to turn their creations over to a new generation of owners. \nRead More Wealthier baby boomers shun homeownership \n\"We're seeing the most sales activity we have in decades, and a high percentage are baby boomers,\" said Ken Connell, the business banking sales director at Huntington Bank in Columbus, Ohio. \"For many small-business owners, that's their retirement. All of their wealth is in the business.\" \nLynn G. Ozer, the president of government-guaranteed lending at Susquehanna Bank in Lititz, Pa., said pent-up demand was contributing to this year's surge. \n\"Baby boomers who were going to sell got stopped in their tracks in 2008, 2009 and 2010,\" she said. \"Things froze for a few years, then got better. In 2012, 2013 and 2014, they put together great years. Now, their books look good and they're ready.\" \nChronology and demographics are also a factor. \"The '90s were a very good decade, so a lot of businesses got launched,\" Mr. Connell said. \"A lot of business owners were in their 40s. Now, it's 20 years later and they're at retirement age. A lot of this is just timing.\" \nIn the case of the Bimac owners, the decision to give up a business intersected with the ambitions of someone eager to take one on. \nWorking with a broker, they placed an online listing that drew the attention of Roberto Santos, 46, a mechanical engineer from Ecuador. \nMr. Santos spent most of his career in Latin America, working for a family business that was acquired four years ago by a Korean company. He transferred to the company's office in Houston, but he grew concerned about his career prospects. \nRead More Food brands that may fade with baby boomers \n\"The industry was taking a hit,\" he said. \"I decided it was a good time to look for something of my own.\" \nDuring his seven-month hunt, Mr. Santos gathered information on 10 potential acquisitions and visited two of the companies before finding Bimac. Four months ago, he bought the business and its assets, including its real estate, for $2.5 million. \nMr. Santos is emblematic of the next generation of small-business owners, which is noticeably more varied in gender and ethnicity than the previous one. \n\"The sellers tend to be Caucasian males,\" said Bob House, the general manager of BizBuySell.com. \"The buyers are younger and increasingly diverse.\" \nA study on buyers that BizBuySell.com commissioned last year found some sharp demographic differences. More than 30 percent of those from age 30 to 49 describe themselves as black, Asian or Hispanic, compared with just 8 percent of those over 65. <p>How and when to claim Social Security</p> <p>Tim Maurer, director of personal finance at Buckingham and The BAM Alliance, explains how and when to claim Social Security for maximum benefit.</p> \nWomen are also more heavily represented in the younger generation. Nine percent of the buyers over 65 in the study were women, compared with more than 20 percent of those under 49. \nThat could bode well for wealth creation among groups that have traditionally lagged. Economic research has found that across demographic groups, entrepreneurship is associated with greater wealth and upward mobility. \nMr. Santos's financing for the deal is typical of how small-business sales often work. He put down 13 percent in cash, and Bimac's previous owners financed another 12 percent through a seller's note. \nThe balance of the sale price came from a bank loan guaranteed by the Small Business Administration. Demand for S.B.A. loans is at a high, an increase that bankers say is @partly attributable to the increase in business sales. \nRead More Gen X, Baby Boomers see credit cards as a lifeline \nMr. Bizzarro and Mr. Jordan, both 64, are still working for Bimac; Mr. Bizzarro is the vice president of manufacturing and Mr. Jordan is the vice president of engineering. They do not feel ready to leave their careers behind yet. \n\"If we retired, I think both of us would just go out and find another job,\" Mr. Bizzarro said. \nMr. Santos says he is happy to have the previous owners stick around. He is planning to make some changes at Bimac — he would like to invest more in automation and expand the company's export business — but he likes having their institutional knowledge to draw on. \n\"I'm going to keep them as long as I can,\" he said. \"They are teaching me a lot of things about the business.\" \nBusiness owners looking to sell should start making plans at least a year or two in advance, suggests Jeffrey E. Merry, the founder of the Business House, a business brokerage firm in Gainesville, Ga. \nRead More Social Security's next 80 years \n\"When you go to sell your house, the best thing you can do is paint it,\" he said. \"It's kind of like that with a business.\" Accounting records need to be clear and current, and the company's day-to-day operations should run smoothly. Owners who are crucial to their business need to make plans for their replacement, which may involve additional hiring. \n\"It costs money to do some of these things,\" Mr. Merry said. \"I warn owners, 'Your personal income may suffer.'\" \nBrokers say they expect the wave of baby boomer sales to crest over the next few years. Steven D. Zimmerman, the owner of Restaurant Realty in San Rafael, Calif., said that even those who were reluctant to sell were keeping an eye on the economic trends — and on their own physical limits. \n\"Some of the baby boomers we deal with have no choice,\" he said. \"The business is just so demanding that they can't do it anymore.\" \nFor those who decide to put their business on the market, the pool of potential buyers is the largest it has been in years, brokers say. Mr. Merry said the shoppers he works with tend to fall into two categories: companies making strategic acquisitions to fill out their business portfolios and individual buyers leaving corporate careers. \n\"I have a lot of guys who are 40 to 50 years old and need to buy a job,\" he said. \"They've been downsized, or transferred out of the area, and they decide to be their own boss.\" \nIt is a choice that Mr. Santos, whose wife and three children left Houston this month to join him in Dayton, is enthusiastically enjoying. \n\"Houston is having a hard time with the oil industry,\" he said. \"A lot of my friends back there are looking around and asking me, 'How did you do this?'\" SHOW COMMENTS", "external_links": [], "published": "2015-08-20T18:47:00.000+03:00", "crawled": "2015-08-20T22:09:12.232+03:00", "highlightTitle": ""}