{"organizations": [], "uuid": "fefc66881711839068637fec2a2bde1cad84580e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-CW943_moneyo_MG_20141020145617.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/what-to-do-when-the-manicurist-leaves-you-bleeding-2015-07-31", "country": "US", "title": "What to do when the manicurist leaves you bleeding? - MarketWatch", "performance_score": 0, "site": "marketwatch.com", "participants_count": 4, "title_full": "What to do when the manicurist leaves you bleeding? - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T03:00:00.000+03:00", "replies_count": 3, "uuid": "736a4940888918f1d298c1cd4a1063ee7a342bef"}, "author": "By     Quentin Fottrell", "url": "http://www.marketwatch.com/story/what-to-do-when-the-manicurist-leaves-you-bleeding-2015-07-31#post-0", "ord_in_thread": 0, "title": "What to do when the manicurist leaves you bleeding? - MarketWatch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dear Moneyologist,\nI was getting my nails manicured at my local salon last weekend and the manicurist cut my finger. It was not a big cut, but it was more than a scratch as it took 10 minutes or so for the bleeding to stop. My manicurist was very apologetic and the owner came out to see what was happening, and it all caused a bit of a commotion. The owner did not seem happy with the manicurist. I felt terrible and I told the manicurist not to worry about it and tried to be nice, as she appeared to be very upset about it. I’m not one to make a fuss, and I don’t want to be one of those New York women who overreact and take it out on the staff. However, when I went to pay my bill the salon still charged me full price. I was not happy with this, so I didn’t leave a tip. Did I do the right thing?\nOlivia in Manhattan\nWhat to do when the manicurist makes you bleed? (4:30) When a trip to a manicurist leaves a customer with a bloody finger, should the tip be left off? Moneyologist Quentin Fottrell discusses.\nDear Olivia,\nI can’t tell you the number of times I’ve been to the barber and the man in the mirror — the barber — nicked my neck with his razor. And that doesn’t include the number of times I went for a cut-throat shave and walked out with so many pieces of tissue stuck to my bloodied face that I looked like Freddie Kruger. Still, I trust that the barber has sterilized his implements and feel glad that I have survived another day in New York without succumbing to some kind of freak accident – a rogue blade or even a flying piece of debris from a nearby construction yard. When you go to a salon, you shouldn’t necessarily expect to be cut, and those that do likely make up a very small fraction of all customers. It makes you part of the 1%, and not in a good way. I appreciate you don’t want to be “that” customer who goes on a tirade and I’m glad you didn’t.\nYour manicurist may work long hours for little pay. Manicurists and pedicurists are routinely underpaid and even exploited, according to a recent and highly publicized New York Times investigation . The median annual pay for a manicurist in the U.S. ranges from $17,987 to $45,210 a year, depending on the salon and where it’s located, according to PayScale.com, a company that collects data on salaries. The median annual pay is $12.30 an hour, but it can go as low as $8 an hour and as high as $23.50 in some salons. Some of the people profiled in the Times story weren’t paid an hourly wage at all and only received tips. More experience does not necessarily mean bigger paychecks. Those with less than five years of experience take home a median salary of $26,000 a year, and those who have worked for five to 10 years earn just $29,000.\nRead: How much to tip everyone\nOf course, everyone deserves good service, and it’s important to be careful when dealing with sharp implements. Ask your local salon to show you its state cosmetology board license and, if you are in need of a wax, make sure that gloves are being worn by staff first; keep a close eye to see if equipment is being sterilized after use. “All implements that may abrade or clip superficial skin should be immersed in an Environmental Protection Agency-approved disinfectant for at least 10 minutes and disinfected after each use,” according to the Division of Licensing Services at the New York Department of State. These tools include, but are not limited to, scissors, razors, clippers, combs, brushes and bowls. The Centers for Disease Control and Prevention also cautions consumers to choose clean and licensed salons to avoid fungal infections.\nAlso see: 10 things your salon won’t tell you\nAs for your own dilemma, you did the best you could under the circumstances. I understand you were upset that the salon charged you full price, given that the manicurist cut your finger and the owner was made aware of the situation. But — despite your best intentions — you did take it out on the manicurist by not tipping her, and most do rely on tips to earn a living. The manicurist made a mistake and was profusely apologetic. It’s not like this shocking case where a waiter in a restaurant deliberately tried to trick customers out of $50 . So what could you have done instead? Hold up your bandaged finger to the cashier and say, “I think it would be nice to offer me a discount or some kind of goodwill gesture.” And, if they declined, still tip the manicurist, but don’t go back.\nIt’s better to be a loud New Yorker by speaking up and tipping the manicurist, rather than not speaking up and silently punishing her.\nDo you have questions about inheritance, tipping, weddings, regifting, or any tricky money issues relating to family and friends? Send them to MarketWatch’s Moneyologist .\nMore from Moneyologist: When too much car-sharing can kill you Do I need to bring a gift to an adult’s birthday party? Should I chase a friend down for an unpaid tip?", "external_links": ["http://www.cdc.gov/fungal/nail-infections.html", "http://www.nytimes.com/2015/05/10/nyregion/at-nail-salons-in-nyc-manicurists-are-underpaid-and-unprotected.html?_r=0"], "published": "2015-08-01T03:00:00.000+03:00", "crawled": "2015-08-03T06:34:16.700+03:00", "highlightTitle": ""}