{"organizations": [], "uuid": "0163c4586ceabc1a19873df75046aaf6a2b1ab82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Modi_bihar018815.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/modi-announces-rs125-lakh-crore-bihar-package/43131.html", "country": "IN", "title": "Modi announces Rs.1.25 lakh crore Bihar package", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Modi announces Rs.1.25 lakh crore Bihar package", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T12:28:00.000+03:00", "replies_count": 0, "uuid": "0163c4586ceabc1a19873df75046aaf6a2b1ab82"}, "author": "IANS", "url": "http://www.moneylife.in/article/modi-announces-rs125-lakh-crore-bihar-package/43131.html", "ord_in_thread": 0, "title": "Modi announces Rs.1.25 lakh crore Bihar package", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Life » Public Interest » Modi announces Rs.1.25 lakh crore Bihar package 43131 Modi announces Rs.1.25 lakh crore Bihar package 0 Comments, Be the first to comment + COMMENT IANS | 18/08/2015 02:58 PM | Prime Minister Narendra Modi on Tuesday announced a Rs.1.25 lakh crore Bihar package to \"change the face of Bihar\". Modi inaugurated a national highway project in Ara town of Bhojpur district and said: \"I am announcing a package of Rs.1.25 lakh crore. This package will change the face of Bihar.\" He said Rs.40,000 crore left from an earlier aid to the state will also be given, taking the total amount of central assistance to Rs.1.65 lakh crore. He promised to \"implement the package fully\". \"If we want to solve people's problems then the only way ahead is development,\" Modi said. He questioned Bihar Chief Minister Nitish Kumar's anger when he had called Bihar \"bimaru\" (sick). \"They say Bihar is not 'bimaru', and then they make demands...,\" Modi said. Modi also said: \"I will change the destiny of the country.\" He said the central government was formulating special schemes to empower women and OBCs in the state of Bihar. He spoke a few lines in Bhojpuri language and greeted the people. Modi was earlier received at the Patna airport by Governor Ram Nath Kovind and Chief Minister Nitish Kumar. Modi laid the foundation stone of a four-lane road connecting Patna and Buxar in Ara, the district headquarters of Bhojpur, about 60 km from Patna. All private schools in Ara were closed on Monday and Tuesday due to restrictions on plying of school buses on several route through the town and for security reasons. The four-lane highway and other projects were approved by the previous Congress led UPA government. Modi will later in the day address the Bharatiya Janata Party third parivartan rally in Saharsa district in flood-prone Kosi region. He has already addressed two election rallies in Muzaffarpur and Gaya ahead of the forthcoming assembly polls.", "external_links": [], "published": "2015-08-18T12:28:00.000+03:00", "crawled": "2015-08-18T14:31:53.218+03:00", "highlightTitle": ""}