{"organizations": [], "uuid": "d0fbb539fd878fe7f2fdc0a75f3c1725751d5473", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/litchfield-county-times/rss/627", "section_title": "Litchfield County Times : Personal Finance", "url": "http://business-news.thestreet.com/litchfield-county-times/story/10-places-where-renting-a-home-beats-buying/13268658", "country": "US", "title": "10 Places Where Renting A Home Beats Buying", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "10 Places Where Renting A Home Beats Buying", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T16:14:00.000+03:00", "replies_count": 0, "uuid": "d0fbb539fd878fe7f2fdc0a75f3c1725751d5473"}, "author": "", "url": "http://business-news.thestreet.com/litchfield-county-times/story/10-places-where-renting-a-home-beats-buying/13268658", "ord_in_thread": 0, "title": "10 Places Where Renting A Home Beats Buying", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Notte"], "text": "10 Places Where Renting A Home Beats Buying Written by: Jason Notte 08/27/15 - 9:14 AM EDT \nNEW YORK ( MainStreet ) – The housing crisis and ensuing recession are long over, but that doesn't mean it makes more sense to buy a home than it does to rent one. \nExisting home sales increased between June and July, with July sales 10.3% higher than they were just a year earlier, according to the National Association of Realtors. However, the $234,000 average price of those houses is starting is starting to price out some first-time buyers. Interest rates on a 30-year fixed-rate mortgage that have held around 4% haven't helped, nor has a supply of houses that has decreased nearly 5% from a year ago. \n\"Despite the strong growth in sales since this spring, declining affordability could begin to slowly dampen demand,\" says Lawrence Yun. \"Realtors in some markets reported slower foot traffic in July in part because of low inventory and concerns about the continued rise in home prices without commensurate income gains.\" More Headlines Why Millennials and Boomers Are Adrift In the Same Debt-Filled Boat \nAs real estate data site RealtyTrac notes, those home prices are making it increasingly easier to rent property than to own it. In 2012, 65% of the population lived in counties where it was more affordable to buy or rent. That shrunk to 58% in favor of buying in 2013, 56% last year and just 54% as of July. The National Association of Realtors is well aware of this, as the percentage of first-time buyers declined in July for the second consecutive month, falling from 30% in June to 28%. A year ago, first-time buyers represented 29% of all buyers. \n\"The fact that first-time buyers represented a lower share of the market compared to a year ago even though sales are considerably higher is indicative of the challenges many young adults continue to face,\" Yun says. \"Rising rents and flat wage growth make it difficult for many to save for a downpayment, and the dearth of supply in affordable price ranges is limiting their options.\" \nKeep in mind that existing home sales make up roughly 90% of the market, so event when the Department of Housing and Urban Development (HUD) notes that the sale of newly built homes rose 25.8% in July from the same point in 2014, that's still little more than 500,000 homes -- at a more costly average sale price of $361,000. Not only is that a speck on the overall housing map, but it's actually driving up sale prices. \nIn the 285 U.S. counties RealtyTrac and HUD analyzed, 97 (34%) are more affordable for renters seeking a three-bedroom home than they are for homebuyers seeking the same. That's still the minority, but that's up from 80 rent-friendly counties just three years ago. That also includes counties where, just a year ago, it was cheaper to buy than it was to rent. If you're in Sacramento County, Calif.; San Joaquin County, Calif. in the Stockton metro area; Lancaster County, Pa.; Spokane County, Wash.; Polk County, Iowa in the Des Moines metro area; Reno, Nev.; Sarasota, Fla.;Jacksonville, Fla. or St. Louis, you likely shouldn't have waited a year to buy a home. \nWith some help from RealtyTrac and HUD, we came up with just ten examples of cities where you'll be spending more of your income financing a home than you ever would renting it. If you're in it for the long haul, that's likely not of great concern, but if you're tight on cash now and aren't sure if you should lay down roots, consider renewing your lease in these towns: 1", "external_links": [], "published": "2015-08-27T16:14:00.000+03:00", "crawled": "2015-08-27T16:57:48.885+03:00", "highlightTitle": ""}