{"organizations": [], "uuid": "369bfe2cd9bd63d79c8855353f9431418bceed62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/04/Investment-re-s.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/banking-finance/bad-debts-cloud-outlook-for-india-private-sector-banks-icici-axis-bank/121363", "country": "IE", "title": "Why bad loans are growing at a faster pace at India’s private banks", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Why bad loans are growing at a faster pace at India’s private banks | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T00:44:00.000+03:00", "replies_count": 0, "uuid": "369bfe2cd9bd63d79c8855353f9431418bceed62"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/bad-debts-cloud-outlook-for-india-private-sector-banks-icici-axis-bank/121363", "ord_in_thread": 0, "title": "Why bad loans are growing at a faster pace at India’s private banks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Corporation Bank cuts base rate by 0.10 per cent Deutsche Bank mulls selling India retail operations: Report Reliance Industries, Bharti Airtel, 9 others get RBI nod for payments banks India’s private sector banks have seen their loan books deteriorate at a faster pace than state-owned peers over the past three quarters, raising concerns that a slower economic recovery could mean writedowns estimated at around $1.5 billion.\nThe spike at private sector lenders like ICICI Bank and Axis Bank follows a push to grab market share from India’s dominant state banks. They account for some 70 per cent of all outstanding loans but have pulled back on new credit for much of the past year, to keep a lid on bad debt.\nInvestors, who have long favoured private banks for their comparative nimbleness and cleaner balance sheets, say the higher exposure to heavily indebted companies is becoming a cause for concern in an economy that has been slow to take off.\n“What has happened is that there are a few large accounts in the infrastructure and metals space that have stressed balance sheets in the private banks,” said Mahesh Patil, co-chief investment officer at fund managers Birla Sun Life Asset Management, which holds shares in Indian banks.\n“That is something we are concerned about and we are watching the sector very carefully.”\nAccording to numbers reported by the banks, state banks hold $44 billion of nearly $50 billion gross loans classified as bad. But Reuters calculations based on publicly available data show the problem is growing at a faster pace at private banks.\nCombined gross bad loans at 15 publicly traded private sector lenders, excluding restructured loans, grew quarter-on-quarter at 7.5 per cent, 6.9 per cent and 10.4 per cent over the past three quarters to the end of June, the calcuations show.\nThat compares to state banks, where sour debt grew at 6.2 percent, 3.2 percent and 8.8 percent, respectively.\nThe Indian arm of ratings agency Fitch estimates private sector banks – or those with a heavy corporate exposure – could be forced to take a hit of around Rs 100 billion rupees ($1.5 billion).\nOCEAN OF DEBT\nIndia’s corporate sector has one of the highest debt levels among emerging markets and one of the lowest interest coverage ratios, a measure of the ability to repay – a problem given a substantial economic recovery could come only in 2016-17.\nAgainst this background, analysts have raised concerns over the growing exposure of private sector banks to sectors including steel, infrastructure and power, questioning loans provided or refinanced even after these sectors started to show signs of strain.\nA financial stability report published by the central bank in June said that under its worst case scenario, private sector banks’ gross bad loan ratio could almost double.\nIn a note based on public records but disputed by several of the banks Quote: d, investment bank UBS wrote last month that loan approvals to stressed companies by banks it covers rose 85 percent in the past three years.\nAxis Bank, for example, has lent to some of the most troubled Indian infrastructure and steel heavyweights, including Jaiprakash Associates and Essar Steel. It said in July that Jaiprakash was meeting its obligations with “some delay”.\n“We are very conscious of the state of these groups and continue to monitor these exposures,” Axis Bank Executive Director V. Srinivasan said.\n“If we take any additional exposure it is against very high quality collateral and cashflows.”\nOther banks such as ICICI, which saw bad loans in the quarter to June rise 40 percent year-on-year, are rapidly expanding into retail banking to vary their loan book.\n“Finally all banks are in the same ocean of water,” said Uday Kotak, managing director at Kotak Mahindra Bank . India’s fourth-largest private sector lender, it saw bad loans surge after the $2.4 billion acquisition of ING Vysya Bank.\n 18, 2015 4:44 pm", "external_links": [], "published": "2015-08-19T00:44:00.000+03:00", "crawled": "2015-08-19T19:38:47.279+03:00", "highlightTitle": ""}