{"organizations": [], "uuid": "495d5e234b92ce9aaa4cbc94efedb91668ae9579", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508310598.html", "country": "US", "title": "Uganda: Does Uganda Have a Sugar Surplus? What the Numbers Show", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Uganda: Does Uganda Have a Sugar Surplus? What the Numbers Show", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T11:44:00.000+03:00", "replies_count": 0, "uuid": "495d5e234b92ce9aaa4cbc94efedb91668ae9579"}, "author": "", "url": "http://allafrica.com/stories/201508310598.html", "ord_in_thread": 0, "title": "Uganda: Does Uganda Have a Sugar Surplus? What the Numbers Show", "locations": ["Kenya", "Uganda"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya: Juniors Outwit Plucky Uganda \nDATA: Sugar Production, Yields, Imports and Exports \nFrom January to July this year Kenya imported 20,969 tonnes from Uganda. If the imports continue at this rate for the rest of the year the country will again export to Kenya double its surplus. \nKenya also needs to lower its cost of producing sugar by almost 40 per cent if it is to be competitive with other Comesa countries. Kenya produces sugar at Sh45,750 per tonne on average, making its sugar more expensive than sugar from Sudan, Egypt, Swaziland, Zambia, Malawi, Tanzania and Uganda, according to the Kenya Sugar Board (now Sugar Directorate). \nIn contrast, Kenya produces about 600,000 tonnes of sugar annually against a requirement of 800,000 tonnes. Last year the country produced 165,000 more tonnes of sugar than Uganda. The country produced 591,658 tonnes of sugar, which represented a 1.4 per cent decline from the record harvest of 600,179 tonnes in 2013. \nPOOREST YIELDS AT MUMIAS \nIf the existing sugar factories were run more efficiently, they could produce 883,691 tonnes of sugar a year, making Kenya into a surplus producing country. Currently, statistics from the Kenya Sugar Board (KSB) show, the average factory capacity utilisation is 56.3 per cent. The three factories using the most capacity in Kenya, namely Butali, Kibos and West Kenya, are privately owned. But their share of the sugar market is small. \nYields are also dropping. Figures from the Cane Census carried out by the KSB show that average industry yields dropped from 65.5 tonnes cane per hectare (TCH) in 2012 to 60.54 TCH in 2014, a 7.6 per cent drop over the two years. \nTrans Mara had the best yields at around 71 tonnes cane per hectare (TCH), followed by Sony Sugar with 66TCH and Sukari with 63TCH. The poorest industry yields were to be found in Mumias, which reported 57 TCH. The census attributed the decrease to the area under cane to farmers' disillusionment and a decision by farmers to grow other crops, especially in the Mumias zone \nIn the first five months of 2015, the country imported 120,752 metric tonnes of sugar. If sugar were imported into Kenya for the rest of the year at a similar rate, about 290,000 metric tonnes of sugar would be imported. \nIn the first five months of 2015, the country imported 120,752 metric tonnes of sugar. If sugar were imported into Kenya for the rest of the year at a similar rate, about 290,000 metric tonnes of sugar would be imported. From 2013 to 2014, the amount of sugar imported into Kenya declined from 238,000 tonnes to 192,000 tonnes respectively, partly due to the extension of special safeguards on the importation of duty-free sugar from the Common Market for Eastern and Southern Africa (Comesa). \nTHREE MILLS OUT OF EIGHT \nIn 2014, Kenya's sugar imports were about one-third of production, a drop from 2013, when imports were 40 per cent of production. The year was also a drop from 2010 and 2012, when sugar imports were almost half of annual production. Some of the sugar imported was of special quality, specifically meant for manufacturing purposes. \nThe Newsplex investigation also reveals that the cost of producing sugar in Kenya is more than 60 per cent higher than it is in Uganda and Tanzania, and 50 per cent higher than it is in Zambia. While producing one tonne of sugarcane in Kenya costs between Sh41,500 and Sh50,000, the same quantity of sugarcane can be produced in Uganda for between Sh14,000 and Sh18,000. \nWhereas the norm around the world is for 70 per cent of sugar produced to be consumed within the producing country. Zambia produces more than double what it consumes. \nAccording to the Kenya Sugar Board the cost of production in Kenya needs to drop by at least 39 per cent to be in line with COMESA levels. However, the Kenya Sugar Industry Strategic Plan (2010-2014) argues that such a drop in less than three years is drastic and requires major cost reduction strategies for the industry. \nThe report indicates that of the eight sugar mills in production, only three, namely West Kenya, Mumias and Kibos and Allied Industries, which are equipped with modern facilities that can process sugarcane more efficiently, would survive if the Comesa safeguards were to be lifted. \nSugar millers in Kenya also have to contend with decreasing land being used to sugarcane and poor cane yields. Provisional 2014 data from the Economic Survey shows that the land area of cane harvested last year, excluding land from non-contracted farmers, was about 34 per cent of the total amount of land under sugar cane. \nSTATE-OWNED MILLERS \nThis represented a drop of six percentage points from 2013, when the proportion was 40 per cent, and a drop of 16 percentage points from 2010, when the proportion was 50 per cent. \nDuring the same five-year period, from 2010 to 2014, sugar production decreased by three per cent while the area harvested reduced by more than 15 per cent. Average yield increased 14 per cent. \nStatistics from the United Nations Food and Agricultural Organization (FAO) reveal that Kenya's sugarcane yield (hectogram per hectare) is lower than Uganda's and other Comesa countries like Zambia and Malawi. \nIndustry players attribute the poor yields to inadequate and untimely application of fertilisers, harvesting of young, premature cane, and low cane management standards. \nKenya has sought protective measures for its sugar industry in the past, arguing that the country needed time to restructure the industry and become global competitive. \nThe safeguards were first granted for a year in 2002 and then extended for another year. When the deal lapsed, Kenya successfully negotiated another four-year extension, which upon expiry in 2008 was extended several times. In March this year, a one year extension of the sugar safeguards was again granted to Kenya. \nPart of the restructuring process involved passing a Privatisation Act and setting up a Privatisation Commission, which has approved the sale of five state-owned millers. \nA combined 34 per cent of market share in Kenya is held by Nzoia, Sony, Chemelil and Muhoroni, which are state owned. The government of Kenya also owns, a minority share (20 per cent) of Mumias, which is the industry leader with a market share of 20 per cent. \nOn the other hand, West Kenya, Butali, Kibos and Allied Works, Sukari and Soin are private companies who combined have a market share of 46 per cent. \nIn Uganda, the government owns a minority share (30 per cent) in only one factory, Kinyara Sugar Works Limited. The remaining five large factories and seven small ones are privately owned. \nSugar import statistics from the Kenya Sugar Directorate from 2006 to 2015 shows that Uganda did not feature in the top ten list of countries which export sugar to Kenya until two years ago, when it made an appearance at position seven for exporting 9,998 tonnes of sugar to Kenya, which was equivalent to 25 per cent of what it exported last year. Uganda \nThe Kenya Under 19s rugby team beat Uganda 21-5 to finish third at the Rugby Afrique championship in Harare, Zimbabwe on … see more » Copyright © 2015 The Nation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-31T11:44:00.000+03:00", "crawled": "2015-08-31T12:36:04.173+03:00", "highlightTitle": ""}