{"organizations": [], "uuid": "c6f9bcaea2dbcd1168d423ab1958f97c4e4407c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/m/g/8/y/image.related.afrArticleLead.620x365.gioh9c.png/1438127680557.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/national/the-fall-of-two-upper-house-victorian-mps-because-of-the-unions-20150731-gioh9c", "country": "AU", "title": "The fall of two upper house Victorian MPs because of the unions", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The fall of two upper house Victorian MPs because of the unions | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T15:23:00.000+03:00", "replies_count": 0, "uuid": "c6f9bcaea2dbcd1168d423ab1958f97c4e4407c1"}, "author": "Lucille Keen", "url": "http://www.afr.com/news/politics/national/the-fall-of-two-upper-house-victorian-mps-because-of-the-unions-20150731-gioh9c", "ord_in_thread": 0, "title": "The fall of two upper house Victorian MPs because of the unions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Adem Somyurek now joins another factional victim, former whip Cesar Melhem, adding to the uncertainties of the Andrews government. Jason South by Lucille Keen The Andrews Labor government in Victoria is teetering towards a day of reckoning with the unions.\nThe ever-growing influence of unions on the Victorian Labor Party has plagued the government's first six months and premier Daniel Andrews' attention has constantly been distracted by the need to hose down bitter factional brawls.\nOn Friday the party unanimously voted for Philip Dalidakis, a first term MP, member of the Right faction and former deputy chief of staff to federal senator Stephen Conroy, to replace Adem Somyurek as Minister for Small Business, Innovation and Trade.\nMr Somyurek was forced to resign from cabinet on Tuesday after a damning report confirmed he had bullied his chief of staff Dimity Paul.\nAs he quit Mr Somyurek claimed the allegations made against him were factional payback by the powerful right-wing Shop, Distributive and Allied Employees Association, given he had left the union in April to join federal Labor leader Bill Shorten's new Right faction Centre Unity.\nHe claimed the SDA, to which Ms Paul is aligned and where her husband works as a senior official, had undue influence over the Andrews government. He simultaneously called Deputy Premier James Merlino and the Premier's chief of staff John McLindon to resign, saying they were too closely aligned with the SDA.\nIt was the SDA that pushed the government to create two additional public holidays in Victoria – just months after the Labor government came to power, a decision which stunned the business sector.\nCorporate leaders slammed the government saying the extra days' holiday – at Easter and a grand final eve – will cost the state at least a billion dollars in wages costs and lost earnings.\n The selection of Mr Dalidakis as a replacement for Mr Somyurek had been tipped by sources in the party as it followed the pattern of Labor's factional system.\nOn Friday as Mr Dalidakis entered the party room for the vote he was flanked by ousted former whip Cesar Melhem – who knows only too well what it is like to be in the spotlight over union woes.\nJust weeks ago Mr Melhem was forced to resign as Upper House Party whip following conflicting evidence before the Royal Commission into the Trade Union Governance and Corruption, which looked at allegations the MP, when he was head of the Australian Workers Union, traded $2 million of workers' penalty rates for payments to the union.\nMr Andrews' key adviser John-Paul Blandthorn, who previously worked underneath Mr Melhem at the AWU, told the commission the MP was aware of the deal and was part of the negotiations.\nNone of this reflects well on Mr Andrews, who during last year's state election repeatedly asserted the mantra his government \"would not waste one day\" if elected.\nSources within the party agreed with Mr Somyurek's claims about the influence of the SDA within the government.\nMr Somyurek was forced to stand aside after an investigation into his behaviour towards his chief of staff by former judge Michael Strong.\nMr Strong said Ms Paul's evidence was \"more reliable\" than the minister's and the report detailed an incident in which Mr Somyurek took Ms Paul by the arm to prevent her from leaving his office.\nHe \"took her chin in his hand and shook it gently from side to side as a form of admonition whilst telling Ms Paul [to] 'calm down and put a filter on it',\" the report said.\nMs Paul broke down in tears as she addressed the media after the release of the report and said claims her complaints were politically motived was \"untrue\".\nThe upshot of this latest ugly week of factional politics in Victoria means Mr Andrews now has two potentially rogue MPs sitting in the Upper House, where it is in a minority and relies on the Greens and two independent MPs to pass legislation.\nMr Somyurek, when asked on Friday if would remain loyal to the party and his leader, replied \"absolutely\".\nMonash University senior political lecturer Nick Economou said the noise about the Labor Party and the unions was a \"storm in a teacup\".", "external_links": [], "published": "2015-07-31T15:23:00.000+03:00", "crawled": "2015-08-01T06:58:50.387+03:00", "highlightTitle": ""}