{"organizations": ["OTC Clearing Service HSBC France", "OTC Clearing Service HSBC France Integrates Eurex", "Eurex", "HSBC France Integrates Eurex"], "uuid": "ac197e78ce347586bb46bce78c9284099b140e65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/institutional-forex/wp-content/uploads/sites/9/2015/05/EUREX_Cutout-Logo-Mock-Up_full.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/institutional-forex/exchanges/hsbc-france-integrates-eurexs-otc-clearing-service/", "country": "US", "title": "HSBC France Integrates Eurex’s OTC Clearing Service", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "HSBC France Integrates Eurex’s OTC Clearing Service", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T16:03:00.000+03:00", "replies_count": 0, "uuid": "ac197e78ce347586bb46bce78c9284099b140e65"}, "author": "", "url": "http://www.financemagnates.com/institutional-forex/exchanges/hsbc-france-integrates-eurexs-otc-clearing-service/", "ord_in_thread": 0, "title": "HSBC France Integrates Eurex’s OTC Clearing Service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HSBC France Integrates Eurex’s OTC Clearing Service HSBC France Integrates Eurex’s OTC Clearing Service HSBC France has been connected as a direct clearing member at Eurex, having already cleared its inaugural transactions via EurexOTC Clear. Advertising Print This Post \nEurex Clearing, Europe’s paramount clearinghouse and integral component of Deutsche Börse Group, has added HSBC France as its newest user of EurexOTC Clear for its Interest Rate Swaps (IRS), according to a Eurex statement. \nHSBC’s French subsidiary has been connected as a direct clearing member at Eurex, having already cleared its inaugural transactions via EurexOTC Clear. Paris-based HSBC France has seen robust demand across several over-the-counter (OTC) trading instruments, having been founded in 2005. \nAt the present, Eurex Clearing OTC service boasts fifty clearing members and more than eighty buy-side firms connected to its EurexOTC service. Furthermore, the transaction volume and open interest continue have shown a penchant for growth, despite the lags in clearing obligations in Europe. EurexOTC Clear is a structured service for clients that aim to maximize their OTC derivatives exposure. \nAccording to Matthias Graulich, Chief Client Officer, Eurex Clearing in a recent statement on the addition, “We are delighted that HSBC France has decided to also use our OTC clearing service for its interest rate swaps business. Our offering helps to ease the rising costs of regulation by benefitting from margin, capital and collateral efficiency.” \nEurex Group recently reported its volumes for the month ending July 2015 , which incurred a sizable decline MoM from the exchange’s figures this past June. Eurex’s average daily volume (ADV) during July 2015 came in at just 8.5 million contracts, which corresponded to a decline of -22.7% MoM from 11.0 million contracts in June 2015. Across a year timeframe however, Eurex’s July 2015 ADV surged higher by 34.9% YoY from just 6.3 million contracts in July 2014. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-08-27T16:03:00.000+03:00", "crawled": "2015-08-27T13:17:47.765+03:00", "highlightTitle": ""}