{"organizations": [], "uuid": "cc95711db9236b07e689e1ce51c705b4b9ddca69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-06/the-bull-case-on-273-billion-of-japanese-corporate-stock-sales", "country": "US", "title": "The Bull Case on $273 Billion of Japan Corporate Stock Sales", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "The Bull Case on $273 Billion of Japan Corporate Stock Sales - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T23:00:00.000+03:00", "replies_count": 0, "uuid": "cc95711db9236b07e689e1ce51c705b4b9ddca69"}, "author": "Yuko Takeo", "url": "http://www.bloomberg.com/news/articles/2015-08-06/the-bull-case-on-273-billion-of-japanese-corporate-stock-sales", "ord_in_thread": 0, "title": "The Bull Case on $273 Billion of Japan Corporate Stock Sales", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Japan’s prime minister has engineered a way the nation’s companies can dump $273 billion of stock, and share prices will keep rising.\nThat’s the view of Credit Suisse Group AG’s Basil Dan, who says Shinzo Abe’s plans to make companies sell stock held in business partners will spur a spate of buybacks. Firms will repurchase their own shares rather than let them fall into hostile hands, says Dan, who’s traded Japanese equities for more than 15 years.\n“Japanese management is very concerned about where that stock is going,” Dan, head of equity sales at the brokerage in Tokyo, said in a July 22 interview. “They’ll buy back the stock rather than have friendly companies sell into the market” where shares might be snapped up by activist investors .\nA code for companies introduced under Abe puts pressure on firms to reduce so-called cross-shareholdings, seeking to eliminate friendly stock owners who tend to support management regardless of its performance. Complementary rules for investors urge them to demand higher returns. While Naito Securities Co. projects a short-term drop in share prices when these holdings are sold, Dan says the declines would be reversed if companies bought the equity themselves.\nSMBC Nikko Securities Inc. estimates companies might sell as much as 34.1 trillion yen ($273 billion) in cross-holdings. Such stakes already fell marginally in the year ended March, according to Nomura Holdings Inc. Banks and insurers have been leading the selloff , and Japan’s largest brokerage expects other industries to follow.\nBoth the Topix and the Nikkei 225 Stock Average climbed 0.3 percent in Tokyo on Friday.\n‘Limiting Buybacks’ Kenji Abe, an equity strategist at Bank of America Corp.’s Merrill Lynch unit in Tokyo, agrees with Dan’s thesis.\n“Some companies say they’re limiting share buybacks now in case their banks get in touch to discuss selling their cross-holdings,” Abe said.\nFirms in the past avoided selling even unwanted shares in business partners for fear of disrupting ties, Dan said, calling the codes the “first proper steps toward a normalized market environment” in 15 years.\n“With the new regulations, they have a very good excuse,” said the 43-year-old native of Germany.\nShare buybacks announced in the quarter ended June totaled 2.1 trillion yen, up 41 percent from a year earlier, according to Nomura. Mitsubishi UFJ Financial Group Inc. purchased 100 billion yen of its own shares in the period, while GungHo Online Entertainment Inc. bought back 80 billion yen of its stock. Terumo plans to buy back 11 billion yen of shares this month.\n‘Against Principles’ Ayako Sera, a Tokyo-based strategist at Sumitomo Mitsui Trust Holdings Inc., is skeptical that such unwinding will have positive effects, and is critical of the concept of increasing return on equity by buying shares abandoned by friendly holders. Stock repurchases increase ROE because there is less outstanding equity.\n“It goes against market principles,” Sera said. “It has little to do with companies’ actual earnings performance.”\nJapan’s three largest banks -- Mitsubishi UFJ, Sumitomo Mitsui Financial Group Inc. and Mizuho Financial Group Inc. -- have pledged to sell holdings they can’t justify on strategic or financial grounds. The nation’s regulator last month urged the three to strengthen their capital bases, including reducing risks from cross-holdings that leave them vulnerable to stock-market slumps.\nEconomic Rationale While SMBC Nikko Securities is projecting a large selloff in cross-held shares, Nomura sees a smaller reduction. Nomura projects the broadly defined cross-shareholding ratio will decline one percentage point to 15.2 percent over the next three years. The measure has been falling from a peak of about 50 percent in 1991, with most of the unwinding coming in the latter half of the 1990s.\nThe corporate-governance code Japan started in June requires companies to eliminate cross-shareholdings or explain the economic rationale for keeping them.\n“A lot of companies will try to explain” in the first year of the new rules, Dan said. “But they won’t be able to do that again the next year. So that will accelerate, and a lot of overseas investors are taking note.”\nDumping unproductive stock holdings will be a boon to Japanese corporations, Dan said.\nRaising returns to investors “can only be a good thing,” he said.", "external_links": [], "published": "2015-08-06T23:00:00.000+03:00", "crawled": "2015-08-07T18:10:50.100+03:00", "highlightTitle": ""}