{"organizations": [], "uuid": "44b0f2f911b6b01d35f581e1c810507d63715d3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508041513.html", "country": "US", "title": "Uganda: Public Universities Support Staff Strike", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Uganda: Public Universities Support Staff Strike", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T17:11:00.000+03:00", "replies_count": 0, "uuid": "44b0f2f911b6b01d35f581e1c810507d63715d3c"}, "author": "", "url": "http://allafrica.com/stories/201508041513.html", "ord_in_thread": 0, "title": "Uganda: Public Universities Support Staff Strike", "locations": ["Uganda"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Uganda: Uhuru to Address Uganda Parliament During Three-Day State Visit \nProf John Ssentamu-Ddumba, Makerere University vice chancellor, said the strike had affected their operations and appealed to government to heed their staff's call. \n\"Government's position is that there is no money and that their request will be considered in the 2016/2017 budget. The association of non-teaching staff has said no to the position and their strike has affected us. The system is down as offices are locked,\" Prof Ddumba said, adding: \"My appeal to government is to assist the staff and listen to their concerns and the staff should come back and work as government finds a solution.\" \nHowever, the more than 4,000 staff have stuck to their guns insisting government has discriminated against them. Mr Jackson Betihamah, the chairperson of the Public University non-teaching staff executive committee, said all its members have participated and that unless government shares the national cake equally, they will not report to work. The new academic semester begins this month for all public universities. \n\"We have registered countrywide success since no non-teaching staff has operated,\" Mr Betihamah said, adding: \"We have also been contacted that Gen Kale Kayihura wants to have a dialogue so we are yet to set a day for the meeting.\" \nAt Makerere, Ms Euzobia Mugisha Baine, Makerere University directorate of quality assurance (manager academic affairs), said they have been compelled to strike because government could not offer them a solution last week. \nThere are about 4,000 support and administrative staff at Mbarara, Kyambogo, Busitema, Gulu, Muni and Makerere universities. \nMs Polly Namaye, the police deputy spokesperson said: \"It's our mandate to secure people and property. Since universities belong to Ugandans, then we are right to take action. Students are not able to access what they are paying for. This may drive them to also take measures which as police, we are preventing by being a vessel that creates a peaceful environment through neutrality.\" Uganda \nThe commission of inquiry into the alleged mismanagement of the affairs of the Uganda National Roads Authority … see more » Copyright © 2015 The Monitor. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-04T17:11:00.000+03:00", "crawled": "2015-08-04T18:55:47.003+03:00", "highlightTitle": ""}