{"organizations": [], "uuid": "35828bc52d0b690cd18ca48adbe24b6048bfda5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/0/s/9/a/image.related.afrArticleLead.620x365.gj4mdd.png/1440145045152.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/policy/the-national-disability-scheme-waiting-on-an-ironclad-commitment-20150821-gj4mdd", "country": "AU", "title": "The national disability scheme: waiting on an ironclad commitment", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The national disability scheme: waiting on an ironclad commitment | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T22:15:00.000+03:00", "replies_count": 0, "uuid": "35828bc52d0b690cd18ca48adbe24b6048bfda5d"}, "author": "Laura Tingle", "url": "http://www.afr.com/news/policy/the-national-disability-scheme-waiting-on-an-ironclad-commitment-20150821-gj4mdd", "ord_in_thread": 0, "title": "The national disability scheme: waiting on an ironclad commitment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The scheme has utterly transformed the lives of disabled people. Glenn Hunt Share on twitter Share on Google Plus by Laura Tingle Even as the Abbott government has appeared to rock from political crisis to flag waving national security events, there has been a successful but quiet revolution under way in the role of government that has gone largely unnoticed by most of the community.\nSince July 2013 – in the dying days of the Gillard government – the national disability insurance scheme has been gradually rolled out across the country, utterly transforming not just the lives of disabled people but also the massive care industry that delivers services to them.\nThe idea of the National Disability Insurance Scheme is both simple and revolutionary in an Australian context: instead of disabled people having to scrabble for a share of a fixed pie of often inflexible funding, their needs are determined on the basis of individual need, and care \"packages\" are developed to suit their needs (which often change over time).\nOn first blush, it appears an idea that can only generate a black-hole price tag and for that reason there remains an exceptionally uneasy suspicion of the scheme in many parts of the bureaucracy and politics.\nIt is still often derided in some quarters as a \"typical\" blue sky funding scheme from the Labor years. And it is hard to escape the sense that its genesis as a Labor idea keeps it a slightly embarrassing political orphan under the current regime\nThe Coalition, in opposition, was rather dragged kicking and screaming to support it, though in government it insists it is fully committed to it.\nBut there is nonetheless considerable suspicion that at least some members of the Abbott Cabinet would dearly love it if the rollout of the full scheme did not proceed quite as fast as it might, particularly after it emerged there was a fractious discussion of the issue at an expenditure review committee earlier this month.\nThe basics of the scheme that is now operating is one that was developed by that bastion of economic responsibility and respectability the Productivity Commission.\n The Commission's 2011 report endorsed the arguments that had been put forward by the advocates of the NDIS which included that the existing disability support system (largely run by the states) was \"underfunded, unfair, fragmented, and inefficient\".\n\"The stresses on the system are growing, with rising costs for all governments\", it found.\nIn essence, the argument was that governments collectively couldn't afford not to move to a new national model.\n\"Funding of the scheme should be a core function of government (just like Medicare)\", it said.\nThe potential benefits were also argued to be economy wide.\nProper care would help free up hundreds of thousands of family member carers to join the paid workforce. It would also inject contestability into service provision which would transform a delivery sector comprised of sometimes unwieldy combinations of government, not-for-profit and private sector providers.\nThe original estimates were that about 410,000 people would receive support. Some of these would involve very (expensive) high levels of support but the numerical majority would require lower levels of support.\nThe revolutionary nature of the NDIS means it has been \"rolled out\" through a series of \"pilot\" schemes in different states and regions to test how it works in different communities and systems. The most ambitious pilot is in the ACT – a \"whole system\" trial.\nIt is all incredibly, nightmarishly complicated in implementation, particularly from a standing start and partly because Labor (in a push to make sure the scheme was locked in ahead of a likely change of government) brought forward the suggested time frame for the rollout.\nA review of the scheme last year noted it was like an aeroplane that had taken off while still under construction.\nThe scheme has upended the world of service providers. One simple practical example: a not-for-profit organisation that provides transport for the disabled which was previously bulk booked suddenly faced the prospect of instead having to put in place systems to handle relationships with individual clients\nYet despite these problems, the NDIS has been quietly building momentum in the past two years.\nA quarterly report released this week by Disabilities minister Mitch Fifield noted there are now just under 20,000 participants in the scheme, the great bulk of whom have now got approved care \"plans\". Just under $1 billion has been committed over the three years from 2013-14 in a scheme which is eventually foreshadowed to spend $22 billion.\nWhile there are constant warnings that the cost of the scheme will erupt and become completely unmanageable, the average cost of packages is around $38,423, which is in line with the forecast cost, considering that many of the early participants in the scheme have been deliberately pulled from the highest cost group.\nBut there remains considerable nervousness within the disability community that the nascent scheme is vulnerable.\nDespite Fifield's senior minister, Social Services minister Scott Morrison, once describing the NDIS as a \"jewel\" in the government's crown, there is a sense that no one is championing the scheme at the higher echelons of the government.\nIt also perceived as something of an orphan within the bureaucracy. It was, after all, an idea that came from outside, and three of the most powerful bureaucrats in the country – the secretaries of Prime Minister and Cabinet, Treasury and Finance – were not in their current jobs when the debate about the NDIS was under way. In fact, both the head of PM&C, Michael Thawley​, and Treasury secretary John Fraser weren't even in the country.\nWhile there is progress on the NDIS trials, the federal and state governments have yet to formally sign agreements to move to a full rollout of the scheme by 2019.\nFifield is in the process of negotiating those agreements. In fact, they are supposed to be signed off by the end of this month, starting with NSW, the first state to jump on board during the Labor years, undermining the then federal Coalition's hostility to it.\nThe formal agreement with NSW is ready to go. The fact it hasn't been signed off has led to considerable suspicion about the Abbott government's intent.\nSources say that by the end of this week, the two governments were in negotiation over a date when Tony Abbott and NSW Premier Mike Baird could formally sign the deal.\nBut there continue to be signals out of the government that concerns remain about its cost and that there is a reluctance to lock into it if it can possibly be avoided.\nWhile the advanced state of negotiations with NSW has ensured that particular bilateral agreement is not in danger, there is still uncertainty about other agreements.\nThis isn't entirely the federal government's fault. The different histories, arrangements and levels of financial support across the country in the disability sector means different states are approaching the NDIS in very different levels of preparedness.\nApart from anything else, the government is frantically trying to manage a car crash of expenditure around 2018 and 2019 which threatens its forecasts of a return to budget balance. (There is a considerable reshuffling of defence spends, for example, to ensure that spending doesn't stop the government meeting its forecasts).\nFor his part, Mitch Fifield keeps insisting that \"this government has an absolute ironclad commitment to the NDIS\" and \"an absolute ironclad guarantee to deliver the NDIS in full\".\nBut asked repeatedly this week both in the Senate and in the media over the issue, Fifield has been more careful about what he has said about the timing of the delivery.\nAsked on Sky whether there is \"commitment still to deliver it on the time frame that has been laid out\", Fifield replied that \"well, the time frame is to have the full scheme delivered by 2019\".\n\"As I say, and this isn't being tricky, or playing with words, or anything of that nature, we have to land a series of bilateral agreements with each jurisdiction. Each bilateral negotiation will follow its own path.\"\nHe later told the Senate that \"I think we have to be clear about what is happening here, and that is that the ALP is suggesting that this government is looking for ways to either slow down negotiations or slow down the rollout of the NDIS. The government is not looking for ways to slow down either.\"\n\"Colleagues need look no further than the budget papers to see that the funding profile to deliver the NDIS is laid out over the forward estimates.\"\nGreens senator Rachel Siewert – who asked Fifield a series of questions about his plans – said it was now \"up to us all to stay vigilant and ensure the government keeps to its word and does not seek to slow down or change the nature of the NDIS later down the track\".\nLabor's Jenny Macklin, who oversaw the establishment of the NDIS in government, is more suspicious, accusing Fifield of using \"weasel words\".\n\"People with disability are not interested in weasel words,\" she said. \"They want a firm guarantee that there will be no cut and no delay.\"\nTwo things that seem certain is that it is unlikely the government will meet the target of signing agreements with all the states by the end of this month, and the disabilities community will be keeping the pressure on the government to deliver on the scheme.", "external_links": ["https://plus.google.com/108650647776677996559", "https://twitter.com/latingle"], "published": "2015-08-21T22:15:00.000+03:00", "crawled": "2015-08-22T08:48:41.352+03:00", "highlightTitle": ""}