{"organizations": [], "uuid": "53e6a4a8e52c2746e18f0c5342b6e30897f599cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/05/12890386/Earning Release Financial Tables 06.30.2015-page-001.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12890386.htm", "country": "US", "title": "Hamilton Bancorp, Inc. Reports Profit for the First Fiscal Quarter Ended June 30, 2015", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Hamilton Bancorp, Inc. Reports Profit for the First Fiscal Quarter Ended June 30, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "53e6a4a8e52c2746e18f0c5342b6e30897f599cb"}, "author": "Josie Hankey", "url": "http://www.prweb.com/releases/2015/08/prweb12890386.htm", "ord_in_thread": 0, "title": "Hamilton Bancorp, Inc. Reports Profit for the First Fiscal Quarter Ended June 30, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hamilton Bancorp, Inc. (the “Company”) (NASDAQ: HBK), the parent company of Hamilton Bank (the “Bank”), today announced positive income and a $0.10 improvement in earnings per share for the first quarter of fiscal 2016 compared to the same period one year ago. The Company recorded a net income of $118,000 or $0.04 per share for the quarter ended June 30, 2015, compared to a net loss of $192,000 or $0.06 per share for the same quarter one year ago. The results for the first quarter of fiscal 2016 include a $407,000 gain on the sale of the Bank’s Towson branch location, partially offset by expenses of $216,000 associated with the Fairmount Bancorp, Inc. (“Fairmount”) merger. “Our first quarter profit displays the determination of the Hamilton Bank management team to move our business metrics in the right direction,” said President and CEO Bob DeAlmeida. “The senior team has worked diligently to drive in lending, shrink problem loans, and reduce non-interest expenses. We continue to see strong growth in lending and are working hard to close the merger with Fairmount Bank.”\nAdditional company highlights for the three-month period ended June 30, 2015 include:\n The signing of a definitive agreement to merge with Fairmount. During the quarter, our team completed and submitted its regulatory application and is still awaiting regulatory approval for the transaction. The cost incurred for the quarter to complete the application and perform other necessary tasks associated with the deal was $216,000. Additional costs are still anticipated to complete the transaction. At the end of June 2015, the Company sold the recently closed Towson branch property for $500,000. The transaction resulted in a gain on sale of $407,000 after applicable expenses.\n Total gross loans, including loans held for sale, increased $8.9 million, or 5.5 percent, during the first quarter of fiscal 2016, from $161.0 million at March 31, 2015 to $169.9 million at June 30, 2015. Growth was attributed to management’s focus on growing commercial real estate and the purchase of a $3.0 million auto loan portfolio.\n Nonperforming loans to total loans decreased more than 50 percent compared to a year ago, from 3.46 percent on June 30, 2014 to 1.59 percent at June 30, 2015.\n Net charge-offs for the quarter ended June 30, 2015 were $17,000, or 0.04 percent of average loans compared to $39,000 in net charge-offs, or 0.11 percent of average loans for the same quarter a year ago. The improved credit quality over the past year resulted in no provision for loan losses in the first quarter of fiscal 2016 compared to $300,000 for the first quarter of fiscal 2015.\n Net interest margin for the first quarter of fiscal 2016 increased 12 basis points to 2.94 percent compared to 2.82 percent for the same period last year due to an increase in the average balance of higher interest-earning assets, primarily commercial loans.\n“As we continue to celebrate our 100-year anniversary, we are pleased to see the positive results with the growth in loans and core deposits,” said Executive Vice President—Chief Lending Officer Ellen Fish. “Customers continue to see value in banking with Hamilton and we will continue to focus on growing the Bank while ensuring the merger with Fairmount is seamless for both our existing and new customers.”\nDuring the first quarter ending June 30, 2015, commercial real estate loans grew $6.9 million, or 11.6 percent, to $66.1 million, while consumer loans also grew by $2.7 million, or 232.1 percent, to $3.9 million in the same quarter as a result of the purchase of an auto loan portfolio. This purchase is part of the Bank’s strategy to diversify its loan portfolio.\nThe Bank’s asset quality measures continue to improve. Nonperforming loans decreased $2.4 million, or 47.1 percent, to $2.7 million at June 30, 2015 from $5.1 million a year ago. Nonperforming loans as a percentage of gross loans decreased from 3.46 percent at June 30, 2014 to 1.59 percent at June 30, 2015.\nDuring the first quarter of fiscal 2016, the Bank focused both on generating lower cost core deposits, which are considered to be all deposits except certificates of deposit, and increasing and maintaining its maturing certificates of deposits to generate funds to support loan growth. Total deposits were $223.1 million at June 30, 2015, compared to $222.3 million at March 31, 2015, an increase of $731,000 over the quarter. Core deposits increased by $2.2 million, or 3.1 percent, to $74.9 million over the first three months of fiscal 2016 compared to $72.6 million at March 31, 2015. Despite the Bank’s efforts to increase and maintain certificates of deposit, these deposits decreased $1.5 million over the first quarter from $149.7 million at March 31, 2015 to $148.2 million at June 30, 2015. Core deposits comprised 33.6 percent of total deposits at June 30, 2015 compared to 32.7 percent at March 31, 2015.\nFor the first quarter of fiscal 2016, the Company reported net interest income of $2.0 million compared to the same amount for the first quarter of fiscal 2015. Interest revenue for the two periods was the same at $2.4 million despite a decrease in the average balance of interest-earning assets of $5.5 million, which was offset by a six basis point increase in loan yield. Likewise, interest expense for the three months ending June 30, 2015 of $377,000 was comparable to the $431,000 in interest expense recorded for the same period a year ago. The change in interest expense between the two periods is due to a $10.9 million decrease in interest-bearing liabilities, primarily associated with a decrease in certificates of deposit. The Company’s net interest margin for the first quarter of fiscal 2016 increased to 2.94 percent compared to 2.82 percent for the first quarter of fiscal 2015.\nNoninterest revenue for the first quarter of fiscal 2016 increased by $398,000 to $630,000 compared to the same quarter last year. The increase is due to a $407,000 gain realized on the sale of the Towson branch property, which closed in early May. At the same time, the Bank converted the limited-service branch at its administrative office, also located in Towson, to a full-service branch in order to continue to service those customers in the area.\nNoninterest expense increased by $68,000 to $2.3 million for the three months ended June 30, 2015 compared to the same period a year ago. A majority of the increase is due to $216,000 in merger-related expenses associated with the merger agreement between Hamilton Bancorp and Fairmount. This expense includes fees paid to attorneys, investment bankers and accountants, as well as other miscellaneous items needed to assist with the progression of the transaction. Management focused on reducing costs, which resulted in decreases in salaries and benefits, legal, occupancy, and advertising expenses in the first quarter of fiscal 2016 compared to the first quarter of fiscal 2015.\nAverage equity to average assets remains strong at 20.8 percent for the first quarter ended June 30, 2015, up slightly from 20 percent a year ago due to a decrease in the average asset base. All of the Bank’s regulatory capital ratios continue to exceed those levels required for the Bank to be categorized as well capitalized. The Company’s shares outstanding increased from 3,415,345 at June 30, 2014 to 3,417,713 shares at June 30, 2015. This slight increase is due to activity associated with equity awards over that 12-month period.\nPlease direct all media inquiries to Josie Hankey at 410-420-2001 or by email at josie.hankey(at)fallstongroup(dot)com. Please direct investor inquiries for Hamilton Bank to Robert DeAlmeida at 410-823-4510.\n###\nAbout Hamilton Bank\nFounded in 1915, Hamilton Bank is a community bank with $291.4 million in assets and $60.3 million in regulatory capital. The bank employs more than 53 people and operates four branch locations across Greater Baltimore, serving the communities of Cockeysville, Pasadena, Towson and Baltimore in Maryland. Whether online or on the corner, Hamilton Bank is a community bank that cares about its customers. http://www.Hamilton-Bank.com .\nMember FDIC and Equal Housing Lender\nThis press release may contain statements relating to the future results of the Company (including certain projections and business trends) that are considered \"forward-looking statements\" as defined in the Private Securities Litigation Reform Act of 1995). Forward-looking statements include statements regarding anticipated future events and can be identified by the fact that they do not relate strictly to historical or current facts. They often include words such as “believe,” “expect,” “anticipate,” “estimate,” and “intend” or future or conditional verbs such as “will,” “would,” “should,” “could,” or “may.” Forward-looking statements, by their nature, are subject to risks and uncertainties. Certain factors that could cause actual results to differ materially from expected results include increased competitive pressures, changes in the interest rate environment, general economic conditions or conditions within the securities markets, legislative and regulatory changes that could adversely affect the business in which Hamilton Bancorp, Inc. and Hamilton Bank are engaged, and other factors that may be described in the Company’s annual report on Form 10-K and quarterly reports on Form 10-Q as filed with the Securities and Exchange Commission. The forward-looking statements are made as of the date of this release, and, except as may be required by applicable law or regulation, the Company assumes no obligation to update the forward-looking statements or to update the reasons why actual results could differ from those projected in the forward-looking statements.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5IYW1pbHRvbi1CYW5rLmNvbQ=="], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-06T02:05:36.323+03:00", "highlightTitle": ""}