{"organizations": ["RBC Official", "Micro-Hydro Power Plants"], "uuid": "c403942d68f3a63be7957109f30d6e1a0a8be7e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508310389.html", "country": "US", "title": "Rwanda: Govt Leases 22 Micro-Hydro Power Plants to Private Developers", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Rwanda: Govt Leases 22 Micro-Hydro Power Plants to Private Developers", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T10:41:00.000+03:00", "replies_count": 0, "uuid": "c403942d68f3a63be7957109f30d6e1a0a8be7e9"}, "author": "", "url": "http://allafrica.com/stories/201508310389.html", "ord_in_thread": 0, "title": "Rwanda: Govt Leases 22 Micro-Hydro Power Plants to Private Developers", "locations": ["Rwanda"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rwanda: Early HIV Treatment Will Save More Lives, Says RBC Official \nThe plants, located in Northern and Western provinces, include Agatobwe, Nyamyotsi I and II, Kimbili Rukarara V, Rugezi, Mutobo, Base I and II, and Ngororero. \nThe power developers include a consortium of Karera and Tiger Huert Heindi Energicotel Ltd and Adre Hydropower, Prime Energy and Kochendorefer and FEE, Rwanda energy UK Ltd and Africa Energy Services, Rwanda Mountain Tea, Rural Energy Promotion Ltd, as well as Ngali Energy, and the Led Energy Solutions and Green Energy joint venture. \nMusoni said after the micro-power plants will be developed or upgraded and managed by private investors over the period, and then revert to government after the expiry of 25-year concessions. \n\"We believe that with private sector involvement, these power plants will be upgraded to produce more power than they are generating today. This will increase efficiency, leading to clear management of national energy resources in the country,\" Musoni told The New Times. He added that the ministry was committed toward harnessing the country's hydro-electricity resources in a sustainable manner. \nMusoni said the takeover of the power plants by the private sector is in line with Rwanda's development agenda, where energy production is given priority. \nHe added that the move promotes private-public partnerships in the sector, which could help attract more investors into the energy industry. \nWhat the deal means for the country \nAccording to energy experts at the ministry, the 22 micro-hydro power plants will add about 24.6MW to the national grid. \nRwanda's current installed power generation capacity is 161.2MW, with another 70MW expected to be connected onto the grid by end of the year. The government targets to generate 563MW by 2017. \nOdette Mbabazi, the managing director, Energy Utility Development Corporation Limited, recently told this publication that the additional power (70MW) will help reduce load shedding, especially during dry spells of the year. \nToday, hydro electricity generation capacity accounts for 97.37MW, thermal power is 51.7MW, methane 3.6MW, while solar energy is at 8.75MW. \nProjects like Kivuwatt (25MW) Gishoma Peat Plant (15MW) and Giggawatt solar power plant (8.5MW) are expected to be connected on to the national grid this year, according to ministry officials. \nOther efforts to increase power supply include importing 30MW from Kenya (this year) and another 400MW from Ethiopia by 2018. Rwanda \nA week ago, I got a chance to go over two reports on protection of children against online harmful content: one was … see more » Copyright © 2015 The New Times. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-31T10:41:00.000+03:00", "crawled": "2015-08-31T11:31:03.127+03:00", "highlightTitle": ""}