{"organizations": [], "uuid": "87f9748b19a80a52515469d02584643b2a62b0c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/48435314.cms", "site_section": "http://timesofindia.indiatimes.com/news/economy/finance/articlelist/1286551815.cms", "section_title": "News on Government Finance, Public Financing, Indian Finance | Economy News - Economic Times", "url": "http://timesofindia.indiatimes.com/life-style/books/Book-Review-Manchurian-Sojourn/articleshow/48435163.cms", "country": "IL", "title": "Book Review: Manchurian Sojourn", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Book Review: Manchurian Sojourn - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T21:16:00.000+03:00", "replies_count": 0, "uuid": "87f9748b19a80a52515469d02584643b2a62b0c6"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/life-style/books/Book-Review-Manchurian-Sojourn/articleshow/48435163.cms", "ord_in_thread": 0, "title": "Book Review: Manchurian Sojourn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Industry and technology are pitched as the only way forward for sprawling countries - especially where much of the huge population is yet to emerge from poverty's vicious embrace.\nTitle: In Manchuria: A Village Called Wasteland and The Transformation of Rural China\nAuthor: Michael Meyer\nPublisher : Bloomsbury Press\nPages: 366;\nPrice :Rs.499\nWith rampant urbanisation that is a natural corollary (eg. China and India), the more expansive rural part earns much less attention or focus - despite having quite a story to tell.\nIts superlative economic development leads to mental images of China mainly comprising skyscrapers, congested, gridlocked streets, technological sweatshops where the devices that seem to have become essential for today's young are assembled, smog-filled skies and other appurtenances of a modern technological state. But it is also the world's fourth-largest country and there is much to it beyond its teeming cities and industries.\nSome intrepid travellers have gamely ventured out of the urban zone to chart the country's remarkable diversity - of vistas and peoples. In \"The Emperor Far Away: Travels at the Edge of China\", David Eimer goes around the borderlands (Xinjiang abutting Central Asia, the steamy Yunnan bordering Southeast Asia, the frosty Amur Valley neighbouring Russia's Siberia), Peter Hessler chronicles his stint in a town amid the terraced hills in Yangtze Valley in heart of Sichuan province in \"River Town: Two Years on the Yangtze\" and Meyer focusses on the vast Manchuria, or Dongbei (Northeast) as it is now known - wedged between Mongolia, Siberia and North Korea.\nLike Hessler, Meyer's acquaintance with China was initially as a Peace Corps Volunteer in 1995. He too served in Sichuan - and eventually picked a reason for a life-long association with the country - a Chinese wife.\nHis first book was about Beijing - but from an unusual angle: Life in the 'hutongs' - a maze-like arrangement of lanes and courtyards bordered by single-story houses, which engendered a community and solidarity, but is now under threat from soulless high-rises.\nNow married 13 years and with his wife Frances taking up a job in Hong Kong, Meyer thought it would be a great time to live and teach in her hometown - a place called 'Wasteland' (only thing known about its history is that it was declared a village in 1956) near Jilin city in Heilongjiang Province (Manchuria) - and explore the area .\n\"Eastern Heroic Plumblossom\" (his local name) ended up living there three years and eventually provided a colorful account of a key part of China - home of the Jurchen, or the Manchus, who swept past from their pastures north of the Great Wall in mid-17th century to seize Beijing and power. The Qing dynasty (1644-1912) doubled China's area (Xinjiang, Tibet, etc) but also presided over its decline - their own homeland going under Russian influence, later coming under Japanese occupation (and a base for further attacks on China) and after the Second World War, a theatre in the Civil War.\nA seemingly boundless expanse (which is difficult to think a part of the world's most-populous nation) and where a clear, blue sky is visible, Manchuria is an inalienable part of China but old foreign influence still lingers - especially Russian Orthodox cathedrals (maintained as backdrops for photos of newly-weds!) and a grotto with figures of Mother Mary!.\nBut Dongbei has not been left on the periphery of China's economic rise - even Wasteland is under siege by forces of development , or in this case, Eastern Fortune Rice, a privately-held, local company that introduced organic farming (its famous 'Big Wasteland Sticky Rice' is used in all top state banquets), built new roads and constructed high-rise apartments into which farmers can move in exchange for their land rights as the commune of Wasteland slowly transforms into a company town. But some families (including an uncle of Meyer's wife) still hold out.\nIt is this area Meyer brings to life in his book which is not only a travelogue but also a history - with figures such as Pu Yi, the last Emperor of China, Francis Younghusband, the British invader of Tibet, an American sergeant who parachuted in to rescue the survivors of the Bataan Death March - an inter-cultural love story and a memoir, both personal and of the old rhythms of life in the country.\nCompared to Pearl Buck, Meyer's work is an equally engrossing picture of China, a new China but with some unchanging traditions!\nby Vikas Datta\nhttp://timesofindia.indiatimes.com/followceleb.cms?alias=Urbanisation,Review,Poverty,industry,book ", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-08-11T21:16:00.000+03:00", "crawled": "2015-08-12T00:35:06.587+03:00", "highlightTitle": ""}