{"organizations": ["Fed"], "uuid": "30832de3280538e3f91d2361b84fb322fc6435c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/gold-coasts-along-stocks-perk-043102223.html", "country": "US", "title": "Gold arrests 3-day slide as talk of imminent Fed hike fades", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Gold arrests 3-day slide as talk of imminent Fed hike fades", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T12:52:00.000+03:00", "replies_count": 0, "uuid": "30832de3280538e3f91d2361b84fb322fc6435c9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/gold-coasts-along-stocks-perk-043102223.html", "ord_in_thread": 0, "title": "Gold arrests 3-day slide as talk of imminent Fed hike fades", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 27, 2015, 09:50 BST - UK Markets close in 6 hrs 40 mins Gold coasts along as stocks perk up, possible Fed hike delay supports Reuters – 2 hours 29 minutes ago \nAn employee poses for photographs with gold bars at the Korea Gold Exchange in Seoul, South Korea, July … \nBy Manolo Serapio Jr \nMANILA (Reuters) - Gold steadied on Thursday after suffering its biggest fall in five weeks in the prior session as stock markets recovered, but indications that a U.S. rate hike might happen later than expected kept a floor under prices. \nCheered by Wall Street's rebound, Asian stocks rose led by Chinese markets whose deep tumble this week fed a global rout. \n\"Gold has been correlated a lot with stock markets in the past couple of days due to the fear globally,\" said Howie Lee, an analyst at Phillip Futures in Singapore. \"It's not surprising to see gold come back off as stocks stabilise.\" \nSpot gold was up 0.1 percent at $1,126.65 an ounce by 0602 GMT, after dropping 1.3 percent on Wednesday, its steepest decline since July 20. \nBullion fell to a one-week low of $1,117.35 overnight, taking its losses this week to nearly 3 percent. \nU.S. gold for December delivery edged up 0.2 percent to $1,126.40 an ounce. \nProviding some support to gold were comments by New York Fed President William Dudley on Thursday that the prospect of a September rate increase looks \"less compelling\" given the threat posed to the U.S. economy by recent market turmoil. \n\"The world is in no state to endure a rate hike from the U.S. at this point. It will just cause further collapse in the stock markets,\" said Lee at Phillip Futures. \nGold is holding above $1,100 support as U.S. rate hike expectations this year slowly shift to December from next month, said Lee. When those expectations were tilted towards September, bullion was closer to $1,000, he said. \nThe precious metal is still up nearly 5 percent from a 5-1/2-year low of $1,077 reached in July, but has given up more than 3 percent since touching a seven-week top of $1,168.40 last week. \n\"Turmoil across global markets did little to bring people back to gold as investors ignored the metal's haven appeal and focused on the prospect of higher U.S. interest rates,\" ANZ Bank said in a note. \nInvestors will be eyeing key U.S. data tonight for more clues on the rate hike timing, including a second estimate for second-quarter gross domestic product and weekly jobless claims. \nA Reuters poll showed that U.S. second-quarter GDP growth would be revised up to 3.2 percent from the 2.3 percent advance estimate last month. \nOther precious metals rebounded from this week's slide. \nSpot platinum climbed 1 percent to $986.50 and silver gained 0.6 percent to $14.20. Palladium gained 0.4 percent to $534.50 an ounce after falling to a near five-year low of $518 on Wednesday. \n(Reporting by Manolo Serapio Jr.; Editing by Joseph Radford and Biju Dwarakanath)", "external_links": [], "published": "2015-08-27T12:52:00.000+03:00", "crawled": "2015-08-27T13:07:26.984+03:00", "highlightTitle": ""}