{"organizations": [], "uuid": "f53bb2cfebf4e282088a297a6966b02627cb7d44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15401_2627.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/sec-fines-adviser-20-million-based-on-24505/", "country": "US", "title": "SEC Fines Adviser $20 Million Based on Conflicts", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "SEC Fines Adviser $20 Million Based on Conflicts", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T22:08:00.000+03:00", "replies_count": 0, "uuid": "f53bb2cfebf4e282088a297a6966b02627cb7d44"}, "author": "Dorsey &amp; Whitney LLP", "url": "http://www.jdsupra.com/legalnews/sec-fines-adviser-20-million-based-on-24505/", "ord_in_thread": 0, "title": "SEC Fines Adviser $20 Million Based on Conflicts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SEC Fines Adviser $20 Million Based on Conflicts more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=a2f2553a-9cb7-4410-9723-a43b68269ebd\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nFailure to disclose conflicts of interest and/or to comply with firm procedures are the predicates for a series of SEC enforcement actions involving regulated entities. The most recent example of these trends is an action involving an investment advisory subsidiary of a large financial services firm which was fined $20 million in an administrative proceeding. In the Matter of Guggenheim Partners Investment Management, LLC, Adm. Proc. File No. 3-16735 (August 10, 2015). \nGPI is a registered investment adviser which provides services to institutional clients, high net worth individuals and private funds. It is a wholly owned, indirect subsidiary of Guggenheim Partners, LLC, a private financial services firm based in Chicago and New York. The Order alleges a series of violations: \nConflict: July 29, 2010 a GPI Client extended a $50 million loan to a Senior Executive of the advisor. Client had accounts managed by the advisor as well as other accounts. The loan was evidenced by a promissory note and secured by certain assets of Senior Executive, including his residence and personal guarantee. Although Client could demand payment at any time after August 30, 2010, the note had a two year term. Subsequently, on October 3, 2011 Senior Executive refinanced the obligation. During its term the obligation was current. \nThe purpose of the loan was to permit Senior Executive to invest in two transactions. In August 2010 GPI put certain advisory clients into the transactions. Client invested in the two transactions as did Senior Executive who participated in structuring them. The terms of Senior Executive’s investments differed from those of Client. \nAt the time of the loan the firm’s Code of Ethics and Insider Trading Policy specified that the firm and its employees owe a fiduciary duty to clients. It directed that employees were to avoid any actual or potential conflicts of interest. The Code also specified that full disclosure of conflicts be made to clients. While a number of firm executives knew of the loan, nobody informed the compliance staff. No disclosure was made. \nFees: Beginning in 2009 GPI inadvertently charged an institutional client $6.5 million in asset management fees for investments it did not manage. The firm provided non-advisory services for the client such as back office processing and trade reconciliation. Nevertheless, GPI charged the client an operational service fee that was lower than the asset management fee it charged for discretionary investments. Although the error was discovered in January 2013 the client was not notified for a year and the correction was not made for several more months. \nGifts: The GPI Code also specified that supervised persons could only accept gifts of de minimis value and that exceptions had to be approved by the chief of compliance on a case by case basis. Between 2009 and 2012 at least seven firm employees took 44 unreported flights on private client planes. Yet the compliance logs only recorded one flight. The firm thus failed to enforce its Code with respect to gifts, according to the Order. \nErrors: In 2010 the firm failed to follow its policies and procedures regarding errors. That policy required that an appropriate investigation be undertaken and the matter documented. In September the firm entered an order for $80 million of bonds and then allocated them in a manner that conflicted with the underwriter’s rules. When the underwriter refused a request for an exception, the firm reallocated the purchase and labeled it a “trade fail” and a “trade revision” rather than following its procedures. \nBooks: The Order alleges that the firm failed to properly maintain its books and records. Certain assets not managed by GPI appear on its books and records. The firm’s order memoranda, however, designated the trades as having been entered pursuant to its discretionary authority when they were not. This resulted in inaccurate information being produced to the staff in response to a request. \nThe Order alleges violations of Advisers Act Sections 204, 204A, 206(2) and 206(4). \nTo resolve the proceeding the firm will implement certain undertakings, including the retention of a consultant and, generally, the implementation of the recommendations made by that person. The firm also consented to the entry of a cease and desist order based on the Sections cited in the Order, a censure and to pay a penalty of $20 million.", "external_links": [], "published": "2015-08-11T22:08:00.000+03:00", "crawled": "2015-08-11T22:14:06.909+03:00", "highlightTitle": ""}