{"organizations": ["EEO"], "uuid": "5b4c54076fd64abe6876dee183728ce4001dfa95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.simplyhired.com", "main_image": "", "site_section": "http://www.simplyhired.com/a/job-feed/rss/o-13205", "section_title": "Finance jobs | Simply Hired", "url": "http://www.simplyhired.com/job/7au4shwjaa", "country": "US", "title": "Corporate Finance - Client Financial Management Analyst at Accenture (Florham Park, NJ)", "performance_score": 0, "site": "simplyhired.com", "participants_count": 0, "title_full": "Corporate Finance - Client Financial Management Analyst at Accenture (Florham Park, NJ)", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T18:50:00.000+03:00", "replies_count": 0, "uuid": "5b4c54076fd64abe6876dee183728ce4001dfa95"}, "author": "", "url": "http://www.simplyhired.com/job/7au4shwjaa", "ord_in_thread": 0, "title": "Corporate Finance - Client Financial Management Analyst at Accenture (Florham Park, NJ)", "locations": ["United States", "US", "Florham Park"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Source: PharmaDiversityJobBoard.com Join Accenture and help transform leading organizations and communities around the world. The sheer scale of our capabilities and client engagements and the way we collaborate, operate and deliver value provides an unparalleled opportunity to grow and advance. Choose Accenture, and make delivering innovative work part of your extraordinary career. Professional Skills Requirements: * Proven ability to work independently and as a team member * Ability to be flexible and work creatively and analytically in a problem-solving environment * Good communication (written and oral) and interpersonal skills * Excellent customer service skills * Strong organizational and analytical skills * Demonstrated leadership in professional setting; either military or civilian * Demonstrated teamwork and collaboration in a professional setting; either military or civilian Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status). Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration. Accenture is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities. Equal Employment Opportunity All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state or local law. Accenture is committed to providing veteran employment opportunities to our service men and women Job: Finance Organization: Corporate Function Job Level: Non-supervisory", "external_links": [], "published": "2015-08-25T18:50:00.000+03:00", "crawled": "2015-08-25T19:36:07.645+03:00", "highlightTitle": ""}