{"organizations": ["World Bank", "CET World Bank"], "uuid": "d4685173fc321953fbc9ea500ef8223535092a44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/mq26kwvjje_4319557107777_295160124130.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/634034/1/world-bank-confident-credit-guarantees-to-ghana-wi.html", "country": "US", "title": "World Bank confident credit guarantees to Ghana will stabilize economy", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "World Bank confident credit guarantees to Ghana will stabilize economy", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T13:06:00.000+03:00", "replies_count": 0, "uuid": "d4685173fc321953fbc9ea500ef8223535092a44"}, "author": "", "url": "http://www.modernghana.com/news/634034/1/world-bank-confident-credit-guarantees-to-ghana-wi.html", "ord_in_thread": 0, "title": "World Bank confident credit guarantees to Ghana will stabilize economy", "locations": ["Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  4 August 2015 11:06 CET World Bank confident credit guarantees to Ghana will stabilize economy By Myjoyonline.com \nThe World Bank is confident the recent credit guarantee and loans extended to Ghana will help stabilize the troubled economy. \nThe bank recently extended a 700 million dollar guarantee for the completion of the country‘s biggest gas field, the Sankofa Project. \nThe project is seen as a transformational one that will help address the country’s serious energy shortages by developing new sources of clean and affordable natural gas for domestic power generation. \nThe World Bank also approved a unique combination of two guarantees for the Project – an IDA Payment guarantee of 500 million dollars that supports timely payments for gas purchases by Ghana National Petroleum Corporation and an IBRD Enclave Loan guarantee of $200 million dollars that enables the project to secure financing from its private sponsors. \nTogether the guarantees are expected to mobilize $7.9 billion in new private investment into offshore natural gas projects, representing the biggest foreign direct investment in Ghana’s history. \nSpeaking from Washington DC, World Bank Vice President Makhtah Diop, said he expects the facility to help transform the energy sector and the economy. \nThe exploration and commercialization of the gas will be carried out by two private investors, Eni of Italy and Vitol Group of the Netherlands, in close partnership with Ghana’s National Petroleum Corporation, (GNPC). \nThe Sankofa project is part of a much broader programme of support by the World Bank Group for Ghana’s energy sector transformation. \nThis has included technical assistance for energy sector reforms and the drafting of a new renewable energy law, provision of off-grid energy services for remote communities, and support to the distribution utility to improve its operations.", "external_links": [], "published": "2015-08-04T13:06:00.000+03:00", "crawled": "2015-08-04T12:11:10.766+03:00", "highlightTitle": ""}