{"organizations": [], "uuid": "c7265f2e55b8089623fcd47e368c96f8ddf3f755", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn3.scmp.com/sites/default/files/styles/620x356/public/2015/08/28/3f8203ee625f16cfa221b1fd83982ba8.jpg?itok=Ar5VuwmI", "site_section": "http://www.scmp.com/rss/11/feed", "section_title": "South China Morning Post - Banking & Finance feed", "url": "http://www.scmp.com/business/banking-finance/article/1853588/yuan-volatility-plays-out-bank-china-and-bank-china-hong", "country": "HK", "title": "Yuan volatility plays out in Bank of China and Bank of China (Hong Kong) results", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "Yuan volatility plays out in Bank of China and Bank of China (Hong Kong) results", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T19:43:00.000+03:00", "replies_count": 0, "uuid": "c7265f2e55b8089623fcd47e368c96f8ddf3f755"}, "author": "steve_liu", "url": "http://www.scmp.com/business/banking-finance/article/1853588/yuan-volatility-plays-out-bank-china-and-bank-china-hong", "ord_in_thread": 0, "title": "Yuan volatility plays out in Bank of China and Bank of China (Hong Kong) results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order your FREE copy of AT YOUR SERVICE 2015 Deputy chief executive Lin Jingzhen, vice chairman and chief executive Yue Yi and chief risk officer Li Jiuzhong. Photo: K. Y. Cheng \nBank of China and its Hong Kong arm saw mixed blessings from yuan volatility in the first half as the gap in profitability widened between the two lenders. \nBOC's profit hit 90.7 billion yuan, up just 1.14 per cent compared to the same time last year. Meanwhile, Bank of China (Hong Kong) said its profit climbed by 10.8 per cent in its latest set of interim results. \nLike its peers after successive rate cuts, net interest margin was down at BOC by 9 basis points to 2.18 per cent compared to a year ago. At the same time, the bank notched a 23 basis-point increase in its non-performing loan ratio, still below the industry average of 1.5 per cent. \nBOC is one of the Chinese banks with the highest exposure to overseas assets, which has buoyed returns during this year's slowdown. Some 27 per cent of the bank's 16 trillion yuan total assets are outside the mainland. As the Chinese economy cools and the nation's companies and investors look to diversify overseas, BOC has been able to capture both overseas deposit and loan demand. \nThese have been growing at clips of 8.2 and 5.8 per cent at the bank, pushing profits derived from its overseas strategy to 4.65 per cent, which has a sizeable 22.91 per cent weight in the group's overall profit. \nRelative to its peers, balance-sheet expansion at the bank has also been moderate. Total assets are only up 6.87 per cent from the end of 2014. \nAcross the border, as a Hong Kong bank with a high level of yuan exposure, the volatility seen in the dollar-yuan exchange rates over the first half has made its impact felt on BOCHK. \nThe bank said it has been affected as the average interest spread of renminbi assets has dropped. It has been sandwiched by a drop in yuan market interest rates and increase in deposit costs. Net interest margin is at 1.59 per cent, a 15 basis points drop compared to the first half of last year. \nHowever, what the bank lost in spreads it made up by a good season capturing China's outbound flow. The boon in market turnover buoyed its first-half China-themed investment-related earnings. Net fee and commission income has now reached HK$6.3 billion, up 19.2 per cent from the end of last year, driven by a 56 per cent jump in its brokerage business and the continued strong performance in funds distribution, which is up 29.5 per cent. \nThat said, at the Hong Kong arm's treasury, net trading gain has been making a hole. It has come down by 54.3 per cent over the first half. Despite helping fee income and wealth management growth, yuan volatility has been felt both on its foreign exchange-related exposure and mark-to-market losses for rate-sensitive assets on the bank's books. \nTrading gain from foreign exchange and foreign exchange products dropped by HK$612 million, because of higher net loss on swap contracts. \nNet trading gain from interest rate instruments and items under fair value hedge dropped by HK$285 million because mark-to-market losses from the bank's debt holdings. The bank's impairment loan has gone up by 23.2 per cent since the end of last year. \nTogether, BOC and BOCHK have now cut themselves a quasi-monopoly over the yuan internationalisation strategy. The two banks now control some 2.6 trillion of yuan settlement flows. Clearing volume is up by 31.6 per cent reaching 148.1 billion as of the end of June. This article appeared in the South China Morning Post print edition as Yuan volatility seen in BOC, BOCHK results Share", "external_links": [], "published": "2015-08-28T19:43:00.000+03:00", "crawled": "2015-08-28T20:41:42.224+03:00", "highlightTitle": ""}