{"organizations": [], "uuid": "1bfb527d801fda96af2b816b26e2adb85ed4a36c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/.SNjn4GS1EzPo.mZKZ4esw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/2676892a9477ccb1a34e54c629c2314909e1274b_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/dr-dre-read-final-album-153601379.html", "country": "GB", "title": "Dr. Dre read with 'final' album after 16 years", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Dr. Dre read with 'final' album after 16 years", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T18:36:00.000+03:00", "replies_count": 0, "uuid": "1bfb527d801fda96af2b816b26e2adb85ed4a36c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/dr-dre-read-final-album-153601379.html", "ord_in_thread": 0, "title": "Dr. Dre read with 'final' album after 16 years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dre"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Aug 2, 2015, 17:21 BST - UK Markets closed Dr. Dre read with 'final' album after 16 years AFP – 45 minutes ago View Photo \n\nRap mogul Dr. Dre will release his first album in nearly 16 years to accompany a film on his former band N.W.A. and hinted the record would be his last. \nDr. Dre -- who has become one of music's richest businesspeople and works with Apple (Swiss: AAPL.SW - news ) -- said the album would come out on August 7, a week before the biopic \"Straight Outta Compton\" opens in US cinemas. \nThe album will feature collaborations with his protege Eminem, former N.W.A. bandmate Ice Cube and fellow Los Angeles-area rap giants Kendrick Lamar and Snoop Dogg, according to the pre-order information on Apple (NasdaqGS: AAPL - news ) 's iTunes. \nThe rapper, whose birth name is Andre Romelle Young, said he decided to record the album -- entitled \"Compton: A Soundtrack by Dr. Dre\" -- during the filming of \"Straight Outta Compton.\" \n\"I felt myself just so inspired by the movie that I started recording an album,\" Dr. Dre said late Saturday on his show on Apple Music, the tech giant's new streaming and radio service where he has played a prominent role. \n\"I started recording a soundtrack. I kept it under wraps, and now the album is finished,\" he said. \nN.W.A -- which stands for Niggaz Wit Attitude -- shocked much of white America in the late 1980s with its unapologetic takes on street life through songs such as \"Fuck Tha Police.\" \nFrom his humble upbringing, Dr. Dre went on to develop headphones and other audio products under the name Beats Electronics, which Apple bought last year for $3.2 billion. \nForbes this year estimated his net worth at $700 million. \nWhile focusing on the music business, Dr. Dre has not released a solo studio album since \"2001,\" which despite its name was released in late 1999. \nFor years he has been reported to be working on an album called \"Detox,\" but he said on his radio show that he had abandoned it. \n\"This is something you're not going to hear many artists say. The reason 'Detox' didn't come out was because I didn't like it. It wasn't good,\" he said.", "external_links": [], "published": "2015-08-02T18:36:00.000+03:00", "crawled": "2015-08-02T19:22:46.788+03:00", "highlightTitle": ""}