{"organizations": [], "uuid": "5860abd2a0fc39e5b2025da05ec951e5720a7563", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.environmental-finance.com", "main_image": "", "site_section": "http://www.environmental-finance.com/content/environmental-finance-rss-feed.xml", "section_title": "Environmental Finance RSS feed", "url": "https://www.environmental-finance.com/content/analysis/investing-in-a-sustainable-world.html", "country": "", "title": "Investing in a sustainable world", "performance_score": 0, "site": "environmental-finance.com", "participants_count": 0, "title_full": "Investing in a sustainable world", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T15:33:00.000+03:00", "replies_count": 0, "uuid": "5860abd2a0fc39e5b2025da05ec951e5720a7563"}, "author": "", "url": "https://www.environmental-finance.com/content/analysis/investing-in-a-sustainable-world.html", "ord_in_thread": 0, "title": "Investing in a sustainable world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matthew Kiernan"], "text": "People: Matthew Kiernan 11 August 2015 Matthew Kiernan* argues that investors need to adopt a radical new approach in the face of global megatrends. \nWe are now well into the 21st century and the world is demonstrably quite different from what it was just 20 years ago. Yet the vast majority of asset owners and asset managers are still using the same investment beliefs, assumptions, analytical models, information sources, and research tools as they were 20 years ago. \nMy colleagues and I at Inflection Point Capital believe that, to manage money in the 21st century, we need a whole new bag of tricks. Underpinning this belief is the realisation that major global companies are being buffeted by numerous global 'megatrends'. \nFor example: the shift in the world's centre of economic gravity towards emerging markets; the dramatically increased demand for energy, water and other critical natural resources; and the significant changes in the earth's climate triggered by emissions of greenhouse gases. \nThese 'hard' megatrends are, in principle, familiar to all of us but most investors and asset owners are unaware that their impact can vary considerably on companies within the same industry sector. \nFor example, among the 26 US companies in Standard & Poor's electric utility sector, net exposure to climate change varies by a factor of 30. That's important and we believe it is incumbent on us to find out which are most and least affected. \nIn addition, to these 'hard' megatrends, companies also face several 'soft' megatrends, including: a dramatic growth in stakeholder power and expectations; much greater information transparency; more effective tools for disseminating criticism widely and cheaply; and the reinvention of the notion of fiduciary responsibility. \nI've heard hundreds of chief investment officers explain why they can't address environmental or social issues in their investment strategies. It generally comes down to: \"Since we know they would hurt our returns, [although they never explain how they know that] as a God-fearing fiduciary, I can't possibly do this.\" \nThat quite retrograde notion of a fiduciary is being turned on its head and put back to where I think it ought to be, which is – you are arguably derelict in your duty if you don't address these issues. \nSo, this all adds up to a brand new, qualitatively different, competitive environment for a global company and, therefore, \"old corporate dogs need to learn new tricks\". \nWhat are these new tricks? \nOur basic thesis is that if you examine the true risk profile and value creation potential of a major company, it's like an iceberg -- only 20-25% can be captured using traditional financial statements. \nWhat's below the surface and not visible in the financial statements are the following factors: Innovation capacity;", "external_links": [], "published": "2015-08-11T15:33:00.000+03:00", "crawled": "2015-08-11T21:50:59.721+03:00", "highlightTitle": ""}