{"organizations": [], "uuid": "14c4f16ebec051d289604950d3ad6915d033601c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/4xW4vvK5YaEZ6sGo7FhGTw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/screens-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/category-europe/?format=rss", "section_title": "European Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/european-markets-set-worst-week-094502501.html", "country": "GB", "title": "European Markets Set For Worst Week Of 2015", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "European Markets Set For Worst Week Of 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T12:45:00.000+03:00", "replies_count": 0, "uuid": "14c4f16ebec051d289604950d3ad6915d033601c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/european-markets-set-worst-week-094502501.html", "ord_in_thread": 0, "title": "European Markets Set For Worst Week Of 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 11:31 BST - UK Markets close in 4 hrs 59 mins European Markets Set For Worst Week Of 2015 By (c) Sky News 2015 | Sky News – 46 minutes ago View Photo \n\nEurope's stock markets are on track for their worst weekly drop of the year, analysts have warned, following further crisis in China and a difficult day's trading in the US on Thursday. \nMarkets across the world are feeling the impact of a failing Chinese financial market, which has seen its value drop by up to 30% since June. \nThe situation has been further depressed by survey results released on Friday which show that manufacturing in China has fallen by an unexpectedly large amount this month, dropping to its lowest rate in over six years. \nIt (Other OTC: ITGL - news ) suggests that the Chinese manufacturing industry is now in contraction. \nChina's main index in Shanghai was 4.2% down on Friday, falling below the 200-day moving average for the first time since July 2014, and markets linked to the mainland also suffered with Hong Kong's Hang Seng dropping 1.9%. \nJapan's Nikkei was also down with a loss of 3%. \nIn the US, stock markets saw their weakest performance in 18 months on Thursday as worries over the Chinese slump continue to drive values lower. \nThe Dow Jones industrial average fell by 358.04 points, a 2.1% decline, while the S&P 500 lost 43.88 points - a 2.1% drop. \nIt was the biggest percentage decline for the two indexes since February 2014, resulting in the S&P 500 following Shanghai’s lead in falling below its 200-day moving average, one of the closely watched economic indicators. \nThe FTSE is also feeling a knock-on effect, with its pan-European FTSEurofirst 300 opening 1.6% lower after the index suffered a 2% drop on Thursday which pushed it into official correction territory. \n\"Global markets are in panic mode as the full scale of China's slowdown becomes clearer,\" Angus Nicholson, market analyst at IG (LSE: IGG.L - news ) , said. \n\"The word on everyone's lips is deflation - poison for equity markets. \n\"The phenomenal six-year bull market may finally meet its match in China-induced global deflation.\"", "external_links": [], "published": "2015-08-21T12:45:00.000+03:00", "crawled": "2015-08-21T13:32:31.255+03:00", "highlightTitle": ""}