{"organizations": [], "uuid": "b65fac55fd40474d092df1b5e447b9fe0fa0c818", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/6/t/w/x/image.related.articleLeadwide.620x349.giqlax.png/1438596255814.jpg", "site_section": "http://www.smh.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.smh.com.au/business/banking-and-finance/ioof-executives-final-warning-went-stale-company-says-20150803-giqlax.html", "country": "AU", "title": "IOOF executive's final warning 'went stale', company says", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "IOOF executive's final warning 'went stale', company says", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "b65fac55fd40474d092df1b5e447b9fe0fa0c818"}, "author": "Adele Ferguson and Sarah Danckert", "url": "http://www.smh.com.au/business/banking-and-finance/ioof-executives-final-warning-went-stale-company-says-20150803-giqlax.html", "ord_in_thread": 0, "title": "IOOF executive's final warning 'went stale', company says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IOOF chief executive Chris Kelaher at the inquiry.\nAn IOOF senior executive received two final warnings for misconduct rather than being dismissed because the first warning had \"gone stale\".\nIOOF company secretary, head of human resources and whistleblower officer Danielle Corcoran told a Senate hearing into misconduct that it was possible to receive more than one final warning at the financial services house.\n\"It does look unusual to have two final warnings. I think certain factors have to be taken into consideration,\" Ms Corcoran said.\n\"Management can disregard a prior warning if a significant period of time had elapsed so it becomes stale.\"\nAdvertisement Ms Corcoran was referring specifically to IOOF head of advice research Peter Hilton, who has been accused by company whistleblowers of front running, misrepresentation of performance figures and had asked junior staff to complete training and compliance exams on his behalf.\nJoining Ms Corcoran was IOOF chairman Roger Sexton and IOOF head of investigations Rob Urwin. The testimony of the IOOF representatives were bookended by an appearance by the head of compliance at ASX Kevin Lewis and concluded with an appearance from PricewaterhouseCoopers (PwC) partner Malcolm Shackell.\nAn independent expert's report by PwC into allegations of misconduct at IOOF was released to the Senate, giving a rare insight into the terms of reference of independent reports. Mr Shackell defended his decision to conduct a review that had such a narrow focus, saying PwC had acknowledged the limited scope of the review in its report and had asked to conduct further investigations.\nConfusion There was also confusion over Mr Shackell's evidence, with him telling the Senate the auditing house had not officially started its review on IOOF to address further allegations against the executive, despite the company saying on June 24 the company would start a review \"immediately\".\nPwC later confirmed that it was conducting two separate reviews into IOOF, one that was started in June and announced to the ASX and a second that was decided in the week ending July 31.\nMr Urwin told the Senate an investigation he conducted found IOOF misrepresented the performance of a model share portfolio heavily promoted by the company in documents to clients and at presentations.\nDr Sexton told the Senate that while IOOF's model share portfolio performance figures included errors the figures were a legacy issue for the company.\nDr Sexton said IOOF had inherited Mr Hilton through the merger with Australian Wealth Management, where Ms Corcoran and IOOF chief executive Chris Kelaher both worked in senior positions.\nHe declined to answer publicly whether Ms Corcoran or Mr Kelaher were ever told Mr Hilton had been investigated during 2009 when nearly identical allegations were made in December 2014.\nHe said that at least two former staff who had made complaints about the executive were not whistleblowers but rather employees who had complained about the executive.\nChanged policy Despite this, he said IOOF had recently changed its whistleblower policy.\n\"In August last year we upgraded our whistleblower policy. And we've also just changed it at our last board meeting, so a whistleblower can direct to the chairman. Obviously we're learning from each experience and we've made changes,\" he said.\nEarlier in the Senate hearing the head of compliance at ASX Kevin Lewis threw doubt on a report IOOF said had been prepared for the company by King & Wood Mallesons that found no instance of front running had taken place at the financial services giant.\nMr Lewis told the hearing it was possible to front run by \"ramping research\" by giving forewarning of a research report recommendation to members of the market before it was released.", "external_links": [], "published": "2015-08-03T03:00:00.000+03:00", "crawled": "2015-08-04T12:30:28.730+03:00", "highlightTitle": ""}