{"organizations": [], "uuid": "ad8eb08ced32403701fc8998a8e0538d2b4753a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/hyMn_auwDX1eRDlj95nyow--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_SILICONALLEY_H_LIVE/Whats_happening_in_the_oil-2c07af3945bf7e299dc701eff20fb35e.cf.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/whats-happening-oil-market-now-100400920.html", "country": "GB", "title": "What's happening in the oil market right now is 'unprecedented'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "What's happening in the oil market right now is 'unprecedented'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T13:04:00.000+03:00", "replies_count": 0, "uuid": "ad8eb08ced32403701fc8998a8e0538d2b4753a3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/whats-happening-oil-market-now-100400920.html", "ord_in_thread": 0, "title": "What's happening in the oil market right now is 'unprecedented'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Aug 9, 2015, 11:32 BST - UK Markets closed What's happening in the oil market right now is 'unprecedented' By Myles Udland | Business Insider – 28 minutes ago \nThe price of oil has collapsed again. \nAnd now the oil market is looking at a future that is \"unprecedented.\" \nIn a note to clients this week, analysts at Goldman Sachs took a look at the market and the supply glut that has been blamed for the collapse in oil prices over the last year. \nAnd as Goldman sees it, quite simply, the rules of the market have changed. \"The market structure of the New Oil Order is unprecedented,\" the firm writes, adding that the balance of power between the market's largest and smallest companies has changed. \nIn the past, large integrated oil companies — like BP and Exxon Mobil — and state-owned oil companies have owned the more efficient, low-cost production while smaller oil companies faced higher barriers to entry. In the past, drilling oil necessarily required huge investments in platforms and equipment, massive balance sheets or state backing were virtually required to get into the market. \nBut with lower-cost fracking technology, this has changed. \n(Spencer Platt/Getty Images) A truck used to carry sand for fracking is washed in a truck stop on February 4, 2015 in Odessa, Texas. And as a result, oil supply continues to run into the market as fracking companies are able to produce oil cheaply and shut down wells quickly when they become unusable or unprofitable. \nAnd oil majors have noticed. \nIn a note to clients this week, analysts at Credit Suisse noted that ConocoPhillips and Total have both said the cost of production for US shale will fall 30% and that 80% of shale oil produced will make financial sense to produce with prices below $60 a barrel at the end of this year. \nThe oil futures market projects oil prices will bounce back to near $70 a barrel. The price of West Texas Intermediate crude oil finished the week below $44 a barrel. \nCredit Suisse also notes that despite the massive drop in the US oil rig count , production has remained steady. \n(Credit Suisse) Meanwhile, large oil companies or countries that depend on oil revenue to meet spending commitments have continued pumping oil because they still need to bring in that revenue, almost regardless of price. \nThis is part of why we've seen OPEC, the 12-member oil cartel led by Saudi Arabia, maintain its daily production target twice during the sharp downturn. \nIn its note, Credit Suisse argued that Saudi Arabia, seen as the de facto leader of OPEC, is working to get oil prices low enough such that further US shale investment is halted. \n\"It is, of course, very hard to know what price Saudi Arabia is targeting, but its behaviour is suggesting to us that this point has not yet been reached,\" the firm wrote. Credit Suisse added that while Saudi Arabia is expected to be running a 20% deficit in 2015, the kingdom is likely to be able to afford a \"price war\" for the foreseeable future. \nWriting for The Telegraph earlier this week , Ambrose Evans-Pritchard cited analysts at Bank of America that said OPEC is \"effectively dissolved.\" \nAnd so on top of what seems like what's been a to-date ineffective policy from OPEC to oversupply the oil market and push out more marginal producers, oil traders are still betting that the price of oil will rise. \n(Credit Suisse) Credit Suisse also notes that bear markets in oil prices last between 11 and 28 years while bull markets typically last less than 10. \nTaking the long view, then, on the price of oil doesn't paint a rosy picture for the commodity. \nAnd amid a broad rout across the commodity complex, the structure of the oil market has changed and almost everything seems to be working against it. \n(Credit Suisse)", "external_links": [], "published": "2015-08-09T13:04:00.000+03:00", "crawled": "2015-08-09T13:37:55.898+03:00", "highlightTitle": ""}