{"organizations": [], "uuid": "2e21603e0165e6c52bcc9e58ec75f23da218c201", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-businesswire/?format=rss", "section_title": "Finance News | Business Wire - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/steve-aoki-headlines-netease-concert-190400737.html", "country": "GB", "title": "Steve Aoki Headlines NetEase Concert to Celebrate Launch of Speedy Ninja", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Steve Aoki Headlines NetEase Concert to Celebrate Launch of Speedy Ninja", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T22:04:00.000+03:00", "replies_count": 0, "uuid": "2e21603e0165e6c52bcc9e58ec75f23da218c201"}, "author": "", "url": "https://uk.finance.yahoo.com/news/steve-aoki-headlines-netease-concert-190400737.html", "ord_in_thread": 0, "title": "Steve Aoki Headlines NetEase Concert to Celebrate Launch of Speedy Ninja", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steve Aoki"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 19, 2015, 00:05 BST - UK Markets open in 7 hrs 55 mins Steve Aoki Headlines NetEase Concert to Celebrate Launch of Speedy Ninja Press Release : NetEase, Inc. – 4 hours ago \nBRISBANE, Calif.--(BUSINESSWIRE)-- Globally Recognized EDM Phenomenon to Perform for PAX Attendees at EMP in Seattle \nNetEase, Inc. (NTES) today announced a free concert during PAX Prime 2015 to celebrate the launch of its first mobile game in the West, Speedy Ninja . The concert is headlined by world-renowned EDM DJ Steve Aoki and is only open to attendees with a valid PAX pass. The concert takes place on Friday, August 28 at the EMP Museum in Seattle. Doors open at 8 PM PDT. \n“Anybody who knows me understands I’m passionate about dance music, so I was stoked when NetEase offered me the opportunity to perform a free concert for my fans,” said Steve Aoki. “I’m a huge gamer myself and was immediately pulled in by Speedy Ninja’s art style and fast-paced gameplay. It’s cool to help this company celebrate the launch of their first game.” \nSpeedy Ninja launches globally on August 27, 2015, for iPad, iPhone, iPod Touch and Android devices, and is currently available in Canada, Australia, and New Zealand. Speedy Ninja puts a unique spin on the endless runner genre with a stunning Asian calligraphy art style combined with online competitive mechanics. The fast, acrobatic adventure through bamboo forests and the high skies run by dragons features a robust leaderboard players can climb by completing daily missions. The colorful cast of characters, customizable battle gear, and mythical monsters transcend the reflex-testing game into a deeper, strategic challenge. Speedy Ninja will be available as a free download with optional in-app purchases. \nSee Speedy Ninja in action in the preview trailer: https://www.youtube.com/watch?v=2-Ui6VIp3y4 \n“We look forward to launching our first game in the West as we continue our globalization effort,” states David Ting, General Manager of NetEase North America. “PAX Prime has grown to become a must-attend event for gamers, making it the ideal place for us to make a big splash with our first game. Aoki’s performance will hopefully mark the beginning of a fun-filled relationship between NetEase and gamers throughout the West.” \nTo further celebrate the launch of Speedy Ninja , NetEase will be giving away (2) four-day passes to PAX Prime and (2) VIP passes for guaranteed entry to the Steve Aoki concert. To learn more about the sweepstakes, consumers can visit https://www.facebook.com/NetEaseOfficial/app_211922635540356 *. PAX Prime attendees can learn more about Steve Aoki’s concert presented by NetEase at http://speedyninja.netease-na.com/#!/news/steve-aoki . \nNetEase will be showing off Speedy Ninja and other yet-to-be-released games during the show at the exhibit hall North Lobby and the Sheraton Seattle Hotel Willow A Lounge. Members of the press who would like to schedule a demo may submit their request by e-mailing netease@triplepointpr.com . \nFor more information about NetEase North American division, please visit www.netease-na.com , join us on Facebook: www.facebook.com/NetEaseOfficial , or follow us on Twitter: www.twitter.com/NetEaseOfficial . \n* No purchase necessary; Open only to U.S. Residents who are over 18 as of the date of entry. Residents of Rhode Island, New York, Maine, and Florida are not eligible to enter. Other Restriction Apply. The Sweepstakes is closed at 11:59 PM PDT on Sunday, August 16, 2015. You can obtain a download-able and printable copy of the Official Rules at http://speedyninja.netease-na.com/PAX-rules.txt . Void where prohibited. \nAbout NetEase: \nNetEase, Inc. (NASDAQ: NTES) is a leading Internet technology and video game company headquartered in China. With a breadth of experience in content creation and sharing, NetEase develops and operates some of China's most popular online games (including World of Warcraft ® , Hearthstone ® : Heroes of Warcraft™ , StarCraft ® II, Heroes of the Storm™ and Diablo ® III ), e-mail services, advertising services, mobile applications and games, and web portals. The company has recently established a US office, with plans to expand their offerings by releasing mobile games for Western audiences. For more information, please visit: http://ir.netease.com/ . \nAbout STEVE AOKI: \nSTEVE AOKI is a Grammy-nominated international producer/DJ, electronic dance music entrepreneur, and founder of the trendsetting record label, events/lifestyle company, and apparel line Dim Mak . Since launching in 1996, Dim Mak has broken bands such as Bloc Party , The Bloody Beetroots , Klaxons , and The Gossip through deftly marketed single and full-length releases and now has nearly 500 releases to date. As a solo artist, AOKI has become a force of nature averaging over 250 tour dates per year. Like AOKI ’s 2012 Grammy-nominated debut Wonderland and Neon Future I (which included his gold single and Top 40 radio hit “Delirious [Boneless]” ), his latest album Neon Future II is an all-star extravaganza from one of dance music’s most heralded entertainers. The full track listing includes Linkin Park, Snoop Lion, Rivers Cuomo, NERVO, Matthew Koma and Moxie , with spoken word contributions from Interstellar executive producer & MIT professor Kip Thorne as well as director/producer/creator J.J. Abrams and bringing a different twist to the fold are YouTube sensation/folk rock band Walk Off The Earth . View source version on businesswire.com: http://www.businesswire.com/news/home/20150818006439/en/ Contact", "external_links": [], "published": "2015-08-18T22:04:00.000+03:00", "crawled": "2015-08-19T02:14:18.406+03:00", "highlightTitle": ""}