{"organizations": ["TriVascular Technologies, Inc", "TriVascular Technologies, Inc.", "CRG Modify Term Loan Agreement", "CRG Modify Term Loan Agreement TriVascular Technologies, Inc."], "uuid": "6fe7aca1c5ae131f6d273359611ca1b78ea1b3bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/352026?filename=352026.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/17/Financing%20Agreements", "section_title": "GlobeNewswire: Financing Agreements", "url": "http://globenewswire.com/news-release/2015/08/04/757709/10144567/en/TriVascular-Technologies-Inc-and-CRG-Modify-Term-Loan-Agreement.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "country": "US", "title": "TriVascular Technologies, Inc. and CRG Modify Term Loan Agreement", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "TriVascular Technologies, Inc. and CRG Modify Term Loan Agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T23:01:00.000+03:00", "replies_count": 0, "uuid": "6fe7aca1c5ae131f6d273359611ca1b78ea1b3bd"}, "author": "", "url": "http://globenewswire.com/news-release/2015/08/04/757709/10144567/en/TriVascular-Technologies-Inc-and-CRG-Modify-Term-Loan-Agreement.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "ord_in_thread": 0, "title": "TriVascular Technologies, Inc. and CRG Modify Term Loan Agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TriVascular Technologies, Inc. and CRG Modify Term Loan Agreement Provides up to $30 Million in Additional Borrowing Capacity August 04, 2015 16:01 ET | Source: TriVascular Technologies, Inc. \nSANTA ROSA, Calif., Aug. 4, 2015 (GLOBE NEWSWIRE) -- TriVascular Technologies, Inc. (NASDAQ: TRIV ), manufacturer of the Ovation Prime® Abdominal Stent Graft System, and Capital Royalty Partners II L.P. and its affiliate funds (CRG) announced that they have amended the existing term loan agreement under which TriVascular previously borrowed $50 million. \nThe transaction primarily amends the terms of the existing term loan agreement with CRG to increase the borrowing amount up to $95.0 million, net of financing fees. The Company continues to have the option to access up to $15.0 million on or before December 31, 2015, subject to achievement of certain revenue milestones. The newly available borrowings of $30.0 million are divided amongst two tranches. The first new tranche, consisting of $10.0 million in convertible notes with an interest rate of 8% and convertible into the Company's common stock at a price of $8.00 per share, is scheduled to be funded at the closing on August 18, 2015, subject to customary closing conditions. The second new tranche consists of $20.0 million of borrowings that may be available to draw, upon achievement of certain revenue milestones, with the same interest, payment and other material terms as the existing borrowings under the loan. In connection with the transaction, the Company plans to seek an amendment of its loan agreement with Century Medical, Inc. primarily to obtain consent to subordination of the additional borrowings. \n\"We are pleased to extend our strategic partnership with CRG,\" said President and Chief Executive Officer, Chris Chavez. \"We appreciate their support in pursuit of our mission to improve and expand EVAR safely and less invasively to treat more patients with abdominal aortic aneurysms. The Ovation® platform addresses large, compelling unmet clinical needs with the broadest FDA-approved IFU, an ultra-low profile delivery catheter and proprietary O-ring seal to preserve and protect the aortic neck,\" said Chavez. \nAbout TriVascular Technologies, Inc. - TriVascular is a medical device company developing and commercializing innovative technologies to significantly advance minimally invasive treatment of abdominal aortic aneurysms. The company manufactures the Ovation Prime Abdominal Stent Graft System, the lowest profile FDA-approved endovascular aortic repair system, which utilizes a novel, polymer-based sealing mechanism. TriVascular is based in Santa Rosa, California. \nAbout CRG - Founded in 2003, CRG (previously known as Capital Royalty L.P.) is a healthcare-focused investment firm with over $2 billion of assets under management that provides capital to healthcare companies primarily through structured debt and senior secured loans. CRG works across the spectrum of life science products and technologies and targets investment sizes ranging between $20 million and $200 million. The firm partners with commercial-stage healthcare companies to provide flexible financing solutions so they can achieve their growth objectives. CRG is headquartered in Houston, Texas with offices in Boulder, Colorado and New York City. For additional information, please visit www.crglp.com . \nForward-Looking Statements \nIn addition to the historical information, this press release contains forward-looking statements with respect to our business, capital resources, future financing needs, including with respect to the closing of the additional funding and the availability of the drawdown of some or all of the additional $30 million under the amended loan agreement with CRG and the use of any such additional funds, our strategic initiatives and growth.. These forward-looking statements are based upon information that is currently available to us or our current expectations, speak only as of the date hereof, and are subject to numerous risks and uncertainties, including our ability to successfully commercialize our products; continued market acceptance of our endovascular aortic repair systems; our ability to manufacture our products to meet demand; the level and availability of third party payor reimbursement for our products; our ability to effectively manage our anticipated growth; our ability to protect our intellectual property rights and proprietary technologies; our ability to operate our business without infringing the intellectual property rights and proprietary technology of third parties; our ability to develop new or complementary technologies; the regulatory requirements applicable to us and our competitors; competition in our industry; additional capital and credit availability; our ability to attract and retain qualified personnel; product liability claims; and general economic and worldwide business conditions. These factors, together with those that are described in greater detail in our Annual Report on Form 10-K filed with the SEC on March 9, 2015 and our other filings with the SEC, may cause our actual results, performance or achievements to differ materially and adversely from those anticipated or implied by our forward-looking statements. We expressly disclaim any obligation, except as required by law, or undertaking to update or revise any such forward-looking statements. Company Contact: Michael R. Kramer Chief Financial Officer (707) 543-8709 Media Contact: Vivek K. Jayaraman VP, Global Sales & Marketing (707) 543-8804 Investor Relations Contact: Westwicke Partners Jamar Ismail (415) 513-1282 Related Articles", "external_links": [], "published": "2015-08-04T23:01:00.000+03:00", "crawled": "2015-08-05T01:27:44.839+03:00", "highlightTitle": ""}