{"organizations": ["Equity Research Team", "Equity Research Team Grows Cantor Fitzgerald Hiring Spree Continues"], "uuid": "458eb7a53680983a9d42926ee33aa8ef099189de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/executives/wp-content/uploads/sites/11/2015/05/Cantor.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/executives/move/cantor-fitzgerald-hiring-spree-continues-equity-research-team-grows/", "country": "US", "title": "Cantor Fitzgerald Hiring Spree Continues, Equity Research Team Grows", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Cantor Fitzgerald Hiring Spree Continues, Equity Research Team Grows", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T20:21:00.000+03:00", "replies_count": 0, "uuid": "458eb7a53680983a9d42926ee33aa8ef099189de"}, "author": "", "url": "http://www.financemagnates.com/executives/move/cantor-fitzgerald-hiring-spree-continues-equity-research-team-grows/", "ord_in_thread": 0, "title": "Cantor Fitzgerald Hiring Spree Continues, Equity Research Team Grows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bryan Brokmeier", "David Chiaverini", "Cantor Fitzgerald"], "text": "Cantor Fitzgerald Hiring Spree Continues, Equity Research Team Grows Cantor Fitzgerald Hiring Spree Continues, Equity Research Team Grows David Chiaverini, and Bryan Brokmeier join Cantor Fitzgerald's Equity Research Team, focusing on a diverse range of sectors and business. Advertising Print This Post \nOne week after fortifying its portfolio solutions team, Cantor Fitzgerald has made a series of hires to its Equity Research team, culminating in the appointment of David Chiaverini, and Bryan Brokmeier, according to a Cantor Fitzgerald statement. \nIn his new role, Mr. Chiaverini will serve Cantor Fitzgerald’s Senior Equity Research Analyst, focusing on financial and business development companies (BDCs). Alternatively, Mr. Brokmeier joins the group as its Senior Equity Research Analyst, however his area of work will be relegated to the Life Science Tools and Diagnostics sector. \nMr. Chiaverini joins Cantor Fitzgerald after working as a Senior Analyst at BMO Capital Markets. He also has manned several similar positions at Advest, CIBC World Markets, and Piper Jaffray. \nPrior to joining Cantor, Fitzgerald, Mr. Brokmeier served as a Senior Healthcare Analyst at Maxim Group, LLC, having concentrated his efforts on the Life Science Tools and Diagnostics sector. Additionally, Mr. Brokmeier has also held a series of senior research associate positions within Maxim and Credit Suisse. \nAccording to Shawn P. Matthews, Chief Executive Officer (CEO) of Cantor Fitzgerald & Co. in a recent statement on the appointments, “The extension of our Healthcare and Financials research teams, and expansion into Energy by adding such well-regarded and high talented analysts, further highlights our deep commitment to building a premier equity research franchise.” \n“Their appointments underscore our ability to attract remarkable talent, and unwavering focus on providing clients with high quality, differentiated research and insight. I expect these highly experienced and seasoned analysts will be invaluable assets to the firm, and to continue to build our research platform across sectors and geographies,” he added. \nEarlier this month, Cantor Fitzgerald expanded its Portfolio Solutions team , adding Filip Skala as its Head of US Portfolio solutions. Alternatively, Kenneth Wong will also be joining Cantor Fitzgerald’s New York office – he will serve as its newest Senior Vice President (SVP) and Portfolio Manager. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-08-20T20:21:00.000+03:00", "crawled": "2015-08-20T17:32:04.765+03:00", "highlightTitle": ""}