{"organizations": [], "uuid": "efedb4fa34071faf49e306d15ba455adb22e1833", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/c2/4e/c24ea571af55a4a56fe2a26f0478799f.png?itok=L-YY3PNV", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/how-energy-storage-can-change-everything?cid=rss", "country": "US", "title": "How Energy Storage Can Change Everything", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "How Energy Storage Can Change Everything", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T19:23:00.000+03:00", "replies_count": 0, "uuid": "efedb4fa34071faf49e306d15ba455adb22e1833"}, "author": "Daniel Burrus, Milwaukee Business Strategies Examiner", "url": "http://www.examiner.com/article/how-energy-storage-can-change-everything?cid=rss", "ord_in_thread": 0, "title": "How Energy Storage Can Change Everything", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How Energy Storage Can Change Everything Use your key for the next article Daniel Burrus Daniel Burrus \nA number of years ago, as part of an international project, I made a short list of the biggest problems the world would face over the next fifty years which included shortages of food and drinking water to name a few. Then I researched what would be needed to solve all of these problems, and I came to an interesting conclusion. The one common thread that connected all of the solutions was energy . \nAs hugely populous countries like China and India continue their evolution as economic powerhouses, the rural poor all over the world will increasingly move to urbanized environments seeking a better way of life. They will be in search of ways to climb the economic ladder, and as a result, added pressure will be put on our global resources. \nIt’s estimated that nearly one billion people will make the transition from poverty to the lower-middle class within the next five to eight years. Even though I would classify this as a Soft Trend, something that might happen - not a future fact - it is very likely to happen because the underlying assumptions of this Soft Trend are well researched. \nLike all trends, there are both problems and opportunities and it is important to see and plan for both in order to shape a positive future. One of the key strategies to actively shape a positive future I shared in my New York Times bestseller, Flash Foresight: How To See The Invisible and Do The Impossible, – Solve Tomorrow’s Predictable Problems Today. \nWith that said, let’s go back to my research showing that energy is a key to pre-solving our biggest future problems. When we focus on how both traditional energy and new renewable energy sources can be harnessed in new ways, we can help eliminate the resource issues affecting much of the world, both today and in the future. Whether you’re making brackish water drinkable or sowing your fields using traditional or advanced farming techniques, you need energy to do it. Of course, we’ve been an energy-dependent society since the Industrial Revolution — but today, that notion rings truer as our global numbers continue to boom. Our only choice if we’re going to sustain the way we live is to improve the way we deal with energy. \nOne of the biggest problems with producing electrical power is that we essentially have to use it or lose it. The new renewable technology we’re counting on to help reduce our global carbon footprint—including all of those solar- and wind-harnessing companies—all depend on the environment itself to generate energy. When the wind dies down or there’s heavy cloud coverage, less power can be generated, and when conditions are perfect, we often generate more than we can use. The same problem applies, to more traditional forms of energy, whether it’s nuclear power, hydroelectricity, or fossil fuels. \nRight now, most energy-management technology is equipped to basically balance the load we exert on our resources — referring to, for example, when we go to work in the morning, energy usage in residential areas drops en masse, while usage of energy in industrialized areas skyrockets until 5 or 6 pm, when we return home. \nA key to solving this problem is both large and small-scale energy storage . I wrote about this a few years ago, back when Elon Musk first announced plans to build a billion dollar battery manufacturing plant in the US. At the time, the Wall Street Journal published a harshly critical analysis of Musk’s decision saying that he could not possibly sell enough Tesla’s, to make this size of investment pay off. I took note of this piece and wrote a blog in Musk’s defense: saying that the Journal was being shortsighted; they failed to understand what Musk was doing and thought this plant would serve Tesla, he was doing something far bigger, creating a way to store energy and in the process, digitally disrupt the energy industry. \nAbout ten years ago, I was speaking to an audience of representatives from utility companies all around the world (a crowd of maybe 10,000 or so) and I put the matter of energy storage to them. I asked, “What would happen if we started using electric cars themselves as an energy storage solution?” There were hybrid cars back then, though fewer than there are now, and electric cars were just starting. I said, “At some point in the future, if we have enough people driving electric cars, the energy could flow in both directions and the cars could be used for energy storage; they could be used to help power a home, or eventually as the grid that keeps cities and entire countries alight with energy.” \nThis concept is no longer as futuristic as it seemed ten years ago. In fact, the technology is now at our disposal to turn our electric cars into part of our nations’ power grids. Imagine smart technology — a combination of software and modern hardware — that can establish an intelligent, two-way flow between a car and the power grid to which it connects in order to charge. This tech would dictate your car’s charging mechanism and efficiently distribute energy either when it’s fully charged or when it doesn’t necessarily need to charge. For example, say you know you’re going to leave work at 5, having been at the office all day. If charging your car takes less time than you spend in the office, the charging process isn’t entirely efficient. What if you could program your car to first charge itself and then distribute it’s power to the grid until it’s close to the time you get out of work when it would then top itself off again before you head home? \nElon Musk is indeed an innovative disruptor. A few years ago, when competing auto manufacturers said that it would be impossible to charge a Tesla as fast as filling the tank of a gas powered vehicle, Musk proved them wrong by modifying the design of his battery so a Tesla could have it’s battery changed just as fast as filling a gasoline powered car. \nBeyond using purely electric cars as batteries, why can’t we utilize hybrid cars? There are hundreds of thousands more hybrid cars on the road than electric cars. Could we utilize the large Hybrid car batteries in the same way? \nAnother facet of the hybrid car we haven’t considered is how we use their batteries when they are no longer powerful enough for a car. Cars don’t last forever, of course, but hybrid batteries have far longer shelf lives than the vessels carrying them. These batteries typically need somewhere around 80% capacity to function properly; when they drop below that, they’re unusable in hybrids — but they can be recycled and used to power other things such as homes, and industrial facilities. Just recently, General Motors began using five sets of batteries from aging Chevy Volts to power a newly built data center in Milford, CT proving ground. \nWhat if a company like Toyota or Ford started their own experiments, too? What if all hybrid and electric carmakers started thinking differently, using their old batteries to add storage to our national power grids? What if all these electric and hybrid car makers got together to create industry-standard smart technology that would facilitate a two-way flow of energy from their cars to the grids that power cities around the world, and to develop best practices for recycling and utilizing old hybrid and electric car batteries? \nDigital disruption is happening all around us. One of the principles I like to share in my presentations is: If it can be done, it will be — and if you don’t do it, someone else will. You will be disrupted, no matter how much your company is worth, no matter how old it is, no matter how ingrained in your industry you are. Better to jump on board, to disrupt yourself and your industry, to become the disrupter. Today’s energy titans have the potential to keep their competitive edge and at the same time improve our species’ sustainability while doing it. And if they don’t, newer, more efficient organizations will emerge to take their place. \n©2015 Burrus Research, Inc. All Rights Reserved.", "external_links": [], "published": "2015-08-19T19:23:00.000+03:00", "crawled": "2015-08-19T20:20:38.897+03:00", "highlightTitle": ""}