{"organizations": [], "uuid": "3abb96149061a25a7fdf8609c19fdfa49515aa70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-05/11/full/1431355005-4094.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss#", "section_title": "Finance", "url": "http://www.business-standard.com/article/pti-stories/rupee-continues-to-sink-falls-29-paise-at-65-83-against-usd-115082101007_1.html", "country": "IN", "title": "Rupee continues to sink; falls 29 paise at 65.83 News", "performance_score": 0, "site": "business-standard.com", "participants_count": 1, "title_full": "Rupee continues to sink; falls 29 paise at 65.83 | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "3abb96149061a25a7fdf8609c19fdfa49515aa70"}, "author": "Press Trust of India", "url": "http://www.business-standard.com/article/pti-stories/rupee-continues-to-sink-falls-29-paise-at-65-83-against-usd-115082101007_1.html", "ord_in_thread": 0, "title": "Rupee continues to sink; falls 29 paise at 65.83 News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Riding on global currency volatility wave, the rupee today plummeted sharply by 29 paise to close at a fresh two-year low of 65.83 against the US dollar on high demand for greenback from banks and importers.\n\nHeightened fears of a China-driven global economic crisis as well as worries of imminent Fed rate hike predominantly kept intense pressure on the domestic currency.\n\nBesides, escalating tensions between South Korea and North Korea and weakness in emerging market currencies weighed on sentiments.\n\nA combination of domestic factors like growth constraints in the midst of lack of revival in investment climate as well as weak earnings made a strong case for erosion in the rupee value, forex dealers said.\n\nHeavy offloading in portfolios by foreign investors and global traders also led to the sudden rupee weakness, they added.\n\nWhile, dollar continued to trade weak against a basket of other major currencies and slipped to a fresh six-week low, following emergence of confusing signals from the US Federal Reserve meet.\n\nAt the Interbank Foreign Exchange (Forex) market, the domestic unit commenced sharply lower at 65.73 as against Thursday's closing level of 65.54 at the Interbank Foreign Exchange (Forex) market on strong demand for the American unit as well as tracking early sell-off in local stocks.\n\nIt kept on descending as trading progressed to hit fresh two-year low of 65.91 in mid-afternoon trade before concluding at 65.83, revealing a sharp loss of 29 paise or 0.44 per cent.\n\nThe rupee had touched a high of 65.69 during the session.\n\nThe US dollar index, which tracks the greenback against a basket of six major currencies, was 0.38 per cent lower at 95.41.\n\nMeanwhile, the benchmark BSE Sensex ended sharply lower by 241.75 points, or 0.88 per cent, to settle at 27,366.07.", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T17:53:26.117+03:00", "highlightTitle": ""}