{"organizations": [], "uuid": "6525449b194613c5ba01468cc6cc5bd0930d401c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/07/save_money_labor_day.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/10-ways-save-money-before-labor-day/", "country": "US", "title": "10 Ways to Save Money Before Labor Day", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "10 Ways to Save Money Before Labor Day", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T12:00:00.000+03:00", "replies_count": 0, "uuid": "6525449b194613c5ba01468cc6cc5bd0930d401c"}, "author": "Cameron Huddleston", "url": "http://www.gobankingrates.com/personal-finance/10-ways-save-money-before-labor-day/", "ord_in_thread": 0, "title": "10 Ways to Save Money Before Labor Day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Cameron Huddleston August 1, 2015 \nLabor Day is only about a month away, which means summer is coming to an end. It also means your bank account might be bracing for a hit as you squeeze in a trip, start stocking up on back-to-school items for your children or send your kid off to college . \nTo prepare for these and other costs, you can take several steps to lower your expenses and save money on things you need to buy this month. Here are 10 ways you can save money before Labor Day. \nRelated: 101 Ways to Save Money This Summer 1. Lower Your Cooling Costs \nIf you’re cranking up your air conditioner to combat a heat wave, be prepared for a hefty electric bill. To keep costs low and stay cool, try the following tips: Fans cost less to operate than air conditioners. You can raise your thermostat by four degrees and feel no reduction in comfort if you turn on the ceiling fan in the room you’re in, according to the U.S. Department of Energy . You can lower your air conditioner’s energy consumption by 5 percent to 15 percent by replacing or cleaning dirty filters. Cook outside using a grill to avoid heating your home with your oven . 2. Freeze Your Gym Membership \nIf you’re not using your gym membership because you’re exercising outdoors or taking a summer trip, then freeze your membership, consumer savings expert Andrea Woroch said. Putting your membership on hold can allow you to avoid any early termination fees if you have a yearlong contract and save money on your membership fee during months when you’re not using the gym. 3. Save on School and Office Supplies \nFamilies are expected to spend an average of $97.94 on supplies such as notebooks, pencils and backpacks for school-age children this year, according to the National Retail Federation . You can keep the cost of school supplies under control by shopping back-to-school sales at big-box retailers such as Target and Walmart and office supply stores such as Staples. \nEven if you don’t have kids, you can benefit from these sales. Frugal expert Sami Cone said this is a great time of year to stock up on office supplies because some items are marked down to a penny. Plus, you’ll find great deals on laptop computers in August as part of back-to-school sales, according to DealNews.com . 4. Take Advantage of Sales-Tax Holidays \nSeventeen states have back-to-school sales-tax holidays in August, according to the Federation of Tax Administrators. These holidays offer consumers an opportunity to avoid sales tax on clothing, footwear and school supplies. Some states even waive the sales tax on computers, which can amount to big savings, Cone said. 5. Start Price-Shopping for Holiday Travel \nThe winter holidays are months away but now is the time to start comparing airfares “so you can lock in a good price when you find one,” said Holly Johnson, a frugal travel expert who blogs at ClubThrifty.com . To get the best price on airline tickets, you need to book flights at least 27 to 114 days in advance, according to a study by CheapAir.com . Flights for holiday travel fill up quickly, so you’re better off booking sooner rather than later. 6. Sign Up for a Rewards Credit Card \nIf you are going to do some back-to-school shopping, book holiday travel or take a trip before Labor Day, take some of the sting out of that extra spending by using a credit card with cash rewards. Cash back cards let you earn back a percentage — typically 1 percent to 2 percent but some cards offer up to 5 percent — of certain purchases. \n“Even if your spending is only moderate, earning 1 percent to 2 percent on your grocery, gas and bills can add up in a hurry,” Johnson said. Compare cash back cards to find a great rate to go with the perks. 7. Get Freebies From the Library \nIf you have kids, you’re likely hearing them complain by now that they have nothing to do. To fend off boredom, take them to the local library to pick out books and DVDs for free. While you probably won’t find many new releases in the DVD section, you can check out all those classics you’ve been meaning to watch. Whether or not you have children, you also can take advantage of free programs at your library, such as writing workshops or lecture series, in an air-conditioned environment. 8. Watch Cheap or Free Flicks \nAnother way to keep the kids entertained in the weeks before school starts — without spending a lot of money — is to take advantage of discounted family movies at theaters. For example, Regal Entertainment Group , which operates 569 theaters in 42 states , charges just $1 for tickets for family movies at 10 a.m. on Tuesdays and Wednesdays. \nAdditionally, plenty of communities offer free movies in parks, Woroch said. Check for listings on community calendar, parks and recreation department, or local government websites. \nRead: 31 Fun, Free Things to Do This Summer 9. Cut Food Costs With Seasonal Produce \nA great way to lower your grocery bill is to buy produce that is in season where you live because the prices will be lower on those fruits and vegetables than ones shipped in from other areas of the country or other parts of the world. You should be able to take advantage of late summer fruit and vegetable harvests to save money this month, Johnson said. 10. Snag Summer Clothing on Clearance \n“Retailers are making way for fall clothing in preparation for back-to-school shopping crowds, which means you can score serious savings on summer apparel,” Woroch said. Expect discounts of 60 percent or more on summer staples, which you’ll still be able to wear for a few months and into colder months by layering, she said. If you shop before Labor Day, you’ll have a better and bigger selection.", "external_links": [], "published": "2015-08-01T12:00:00.000+03:00", "crawled": "2015-08-01T17:46:30.621+03:00", "highlightTitle": ""}