{"organizations": [], "uuid": "c4db40bf0cfa886fdb9350e4be44d6802741fe69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/sandersbernie08112015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/business-a-lobbying/250862-cbo-full-sequestration-relief-could-add-as-many-as-14m-jobs", "country": "US", "title": "CBO: Full sequester relief could add as many as 1.4M jobs", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "CBO: Full sequester relief could add as many as 1.4M jobs", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T23:09:00.000+03:00", "replies_count": 0, "uuid": "c4db40bf0cfa886fdb9350e4be44d6802741fe69"}, "author": "rshabad@thehill.com (Rebecca Shabad)", "url": "http://thehill.com/business-a-lobbying/250862-cbo-full-sequestration-relief-could-add-as-many-as-14m-jobs", "ord_in_thread": 0, "title": "CBO: Full sequester relief could add as many as 1.4M jobs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CBO: Full sequester relief could add as many as 1.4M jobs Getty Images By Rebecca Shabad - 08/11/15 04:09 PM EDT Reversing sequestration spending caps could create as many as 1.4 million jobs over the next two years, the nonpartisan Congressional Budget Office (CBO) said Tuesday. At the request of Sen. Bernie Sanders (I-Vt.), the ranking member on the Senate Budget Committee, the CBO analyzed the macroeconomic effects of completely eliminating the budget cuts, which are set to return in full force in October. Easing those ceilings would lead to increased government spending, which in turn would lead to an increase in economic output and higher employment, the CBO said. ADVERTISEMENT “Fully eliminating the reductions would allow for an increase in appropriations of $90 billion in 2016 and $91 billion in 2017,” CBO Director Keith Hall wrote in a letter to Sanders. If Congress reverses the limits in fiscal 2016, for example, the CBO said it could result in the full-time employment of as few as 200,000 more people or as many as 800,000 more people. If the same were done for fiscal 2017, the CBO said it could similarly add as few as 100,000 jobs or as many as 600,000 jobs. ADVERTISEMENT The CBO said sequestration relief would also cause the gross domestic product to grow by as much as 0.6 percent in 2016 and as much as 0.4 percent in 2017. Hall explained that the increase in economic output and employment resulted from offsetting forces. They include increased aggregate demand but a tightening monetary policy to reflect a strengthening economy, which would dampen some of the growth. In the long-term, however, Hall warned that increased spending would lead to increases in federal deficits and lower output and income. In a statement, Sanders said the CBO’s analysis proves the “arbitrary sequestration caps have never made any sense.” \nThe Vermont independent, who’s running for the Democratic presidential nomination, characterized the CBO’s findings as job losses in the next two years if sequestration caps are maintained. “If Congress does not act to end sequestration, we’re looking at the loss of as many as 1.4 million jobs over the next two years,” he said. That’s not exactly how the CBO framed it. Hall said that sequestration relief could add as many as 1.4 million jobs, or as few as 300,000. Still, Sanders called for an end to sequestration before the cuts take effect again on Oct. 1. “We must end sequestration now ahead of the end of the fiscal year and prevent a budget showdown that will help nobody,\" he said. \"It makes no sense to head towards a crisis when we have a clear path towards a better solution.” Lawmakers on both sides of the aisle have expressed support for relieving sequestration again, which Congress had approved in a 2013 budget deal that applied to 2014 and 2015. Reversing sequestration entirely is unlikely, and President Obama has asked Congress to increase spending next year for the Pentagon by $38 billion and spending for domestic programs by $37 billion. Before leaving for August recess last week, Senate Majority Leader Mitch McConnell (R-Ky.) told reporters that Republicans would hold budget talks with Democrats at some point in the fall. Democrats have been demanding that GOP leaders hold a \"budget summit\" for months. Senate Minority Leader Harry Reid (D-Nev.) warned in a New York Times op-ed on Tuesday that GOP leaders must come to the negotiating table to avoid “the next budget crisis.”", "external_links": [], "published": "2015-08-11T23:09:00.000+03:00", "crawled": "2015-08-12T05:24:47.799+03:00", "highlightTitle": ""}