{"organizations": ["Embraer", "Oracle Corporation", "SAP AG", "Rimini Street Increases Investment", "Inc", "Inc.", "Progress Software", "PeopleSoft", "Positivo Informática", "Southern Latin America at Software AG", "SAP", "Rimini Street", "ERP", "Strong Market Demand Rimini Street, Inc."], "uuid": "66e23ad6766fae21f48f956dc1608856b7636fac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/rimini-street-increases-investment-latin-america-appoints-industry-vet/44912", "country": "US", "title": "Rimini Street Increases Investment in Latin America, Appoints Industry Veteran to Lead Market Expansion", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Rimini Street Increases Investment in Latin America, Appoints Industry Veteran to Lead Market Expansion", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T09:06:00.000+03:00", "replies_count": 0, "uuid": "66e23ad6766fae21f48f956dc1608856b7636fac"}, "author": "", "url": "http://businesswireindia.com/news/news-details/rimini-street-increases-investment-latin-america-appoints-industry-vet/44912", "ord_in_thread": 0, "title": "Rimini Street Increases Investment in Latin America, Appoints Industry Veteran to Lead Market Expansion", "locations": ["Rimini", "Portugal", "Las Vegas", "Sao Paulo", "South America", "Brazil", "Latin America", "Rimini Street", "United States Rimini Street"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Seth Ravin", "JD Edwards", "Maron", "Michelle McGlocklin", "Edenize Maron"], "text": "Thursday, August 20, 2015 11:36AM IST (6:06AM GMT) (BW)(NV-RIMINI-STREET) Rimini Street Increases Investment in Latin America, Appoints Industry Veteran to Lead Market Expansion New leadership and investment strengthens capabilities to meet the growing demand for SAP and Oracle independent maintenance across the region Sao Paulo, Brazil and Las Vegas, United States Rimini Street, Inc., the leading independent provider of enterprise software support for SAP AG’s (NYSE:SAP) Business Suite and BusinessObjects software and Oracle Corporation’s (NYSE:ORCL) Siebel , PeopleSoft , JD Edwards , E-Business Suite , Oracle Database , Hyperion and Oracle Retail software, announced that Edenize Maron has been appointed general manager, Latin America. In this newly created role, Maron will lead the continued growth and development of this fast-growing region, and will oversee all sales and delivery of Rimini Street support services in Latin America. With over 19 years in the IT industry, Maron has proven experience in leading enterprise software sales, service and development operations. She has held senior leadership positions at SAP, where she served in several executive roles, including sales director, CRM products, Latin America, and most recently as country manager, Portugal. Maron also held a senior leadership position with Progress Software, where she served as country manager, Brazil & South America. Immediately prior to joining Rimini Street, Maron served as the vice president for Southern Latin America at Software AG. “The Latin America market is increasingly discontent with the current ERP business model presented by enterprise software vendors – namely the high cost of annual maintenance, the high cost to upgrade and being forced to upgrade their stable systems – and is looking for ways to invest in innovative technologies that will help grow their business versus continuing to over-spend on vendor maintenance for the core transaction systems,” said Maron. “With Rimini Street, clients can save up to 90 percent on their total maintenance costs, take back control of their ERP systems, choose if and when to invest in an upgrade, and choose where they will invest the savings from a switch to Rimini Street support.” Rimini Street Investment Fueled by Strong Market Demand Rimini Street, Inc. opened its Latin American headquarters in Sao Paulo, Brazil in 2012. Today, Rimini Street provides support to more than 60 clients operating in the region, including well-known Brazilian companies such as Embraer, Positivo Informática and Gol Linhas Aéreas, and multi-national organizations with operations across Latin America, such as Future Electronics. Rimini Street leads the Latin American market in delivering a premium support service offering and proven client value to SAP and Oracle licensees, enabling clients to run their current software releases without any required upgrades for at least 15 years. Clients also benefit from a 24x7x365 service model with an assigned Primary Support Engineer (PSE), ultra-responsive service with average urgent case response times of less than five minutes, tax, legal and regulatory updates (including Brazil Nota Fiscal) and support for application customizations (ad ons). “We are pleased to welcome Ms. Maron to Rimini Street. Her background and proven experience are indicative of the caliber of talent we are adding to our global executive team that is selling and delivering Rimini Street’s best in class enterprise support to clients around the world,” said Seth Ravin , Rimini Street CEO. “Our success has always been defined by our clients’ success, and by providing our clients with the best service and support experience available in the industry. Ms. Maron will lead our Latin American market expansion, bringing Rimini Street’s premium, proven support solution to Oracle and SAP licensees across the Latin American region.” About Rimini Street, Inc. Rimini Street is the global leader in providing independent enterprise software support services. The company has redefined enterprise support services since 2005 with an innovative, award-winning program that enables Oracle and SAP licensees to save up to 90 percent on total support costs. Clients can remain on their current software release without any required upgrades for at least 15 years. Nearly 1,100 global, Fortune 500, midmarket, and public sector organizations from a broad range of industries have selected Rimini Street as their trusted, independent support provider. To learn more, please visit www.riministreet.com . Forward-Looking Statements This press release may contain forward-looking statements. The words “believe,”“may,”“will,”“estimate,”“continue,”“anticipate,”“intend,”“plan,”“expect,” and similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to risks and uncertainties, and are based on various assumptions. If the risks materialize or our assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Rimini Street assumes no obligation to update any forward-looking statements or information, which speak only as of the date of this press release. Rimini Street and the Rimini Street logo are trademarks of Rimini Street, Inc. All other company and product names may be trademarks of their respective owners. Copyright © 2015. All rights reserved. View source version on businesswire.com: http://www.businesswire.com/news/home/20150819005116/en/ For News Release background on Rimini Street, Inc. click here CONTACTS : Rimini Street, Inc. Michelle McGlocklin, +1 925-523-8414 mmcglocklin@riministreet.com", "external_links": [], "published": "2015-08-20T09:06:00.000+03:00", "crawled": "2015-08-20T09:21:41.524+03:00", "highlightTitle": ""}