{"organizations": [], "uuid": "7be2c656e469b8f34bc2f16b01629194dcfb4b75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/aa877dc6-fe26-42ab-8463-32975cc14b74.img", "site_section": "http://finance.yahoo.com/rss/headline?s=FOXA", "section_title": "Yahoo! Finance: FOXA News", "url": "http://www.ft.com/cms/s/0/801e0f98-41cd-11e5-b98b-87c7270955cf.html?ftcamp=traffic/partner/feed_headline/us_yahoo/auddev,traffic/partner/feed_headline/us_yahoo/auddev", "country": "US", "title": "A tricky balancing act in the Ailes-Trump circus", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "A tricky balancing act in the Ailes-Trump circus", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T14:20:00.000+03:00", "replies_count": 0, "uuid": "7be2c656e469b8f34bc2f16b01629194dcfb4b75"}, "author": "", "url": "http://www.ft.com/cms/s/0/801e0f98-41cd-11e5-b98b-87c7270955cf.html?ftcamp=traffic/partner/feed_headline/us_yahoo/auddev,traffic/partner/feed_headline/us_yahoo/auddev", "ord_in_thread": 0, "title": "A tricky balancing act in the Ailes-Trump circus", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lee"], "text": "Lee’s marketing \nAfter watching Democrat Barack Obama sweep to victory in the most recent two national elections, the 75-year-old Mr Ailes is itching to see a more conservative face in the White House. \nThe difficulties of this arrangement are now growing evident because of Donald Trump’s surge to the top of the public opinion polls in the overcrowded Republican presidential field. A well-run circus can always use another good clown — and Mr Trump is clearly one of the best. But what’s good for the ratings of Fox News may be bad for the Republican brand — and that means Mr Ailes has to balance his affection for the Trump character with the inevitable concerns about the Trump candidate. \nThe resulting drama is particularly intriguing because Mr Ailes and Mr Trump are so obviously meant for each other — showmen in arms, if you will. Even before there was a Fox News — it was launched in 1996 — Mr Trump knew what would make it tick. “One thing I’ve learned about the press is that they’re always hungry for a good story, and the more sensational the better,” Mr Trump wrote in his 1987 book The Art of the Deal . “I play to people’s fantasies.” \nFox News played along with Mr Trump this year as he fired up the conservative faithful with his descriptions of illegal immigrants from Mexico as rapists, and his vow to make Mexico pay for a wall along its border with the US to stem the tide. From May 1 to July 31, Mr Trump made more appearances and was given more time on Fox News than any other Republican presidential candidate, according to Media Matters For America, a liberal monitoring group. \nThe pay-off for Mr Ailes came when the first Republican presidential debate of the season was aired on Fox News on August 6. With Mr Trump on stage, Fox News was able to present what was arguably the greatest show on earth. Nearly 24m tuned in to find out what kind of voodoo The Donald would do when the cameras went on — the biggest audience for a non-sports programme in US cable television history. \nBut the contradictions in the Ailes-Trump relationship were growing evident even before the big event. No less of an authority than Mr Murdoch began to suggest Mr Trump was getting out of hand. Taking to Twitter, a media property he does not own, Mr Murdoch said Mr Trump was “wrong” about the criminality of immigrants crossing the Mexican border. In another tweet, he asked: “When is Donald Trump going to stop embarrassing his friends, let alone the whole country?” Ailes has to balance his affection for the Trump character with the inevitable concerns about the Trump candidate \nAs soon as the debate began, it became hard to avoid the thought that Mr Ailes had put on his old Republican party hat for the contest. The event was more of a rambling talk show than a properly structured exchange — Robert’s Rules of Order was never invoked — and the three Fox hosts did a splendid job of smacking around Mr Trump. \nFox’s Megyn Kelly delivered one of the more effective jabs of the night when she asked the candidate to discuss his characterisations of women as “fat pigs, dogs, slobs and disgusting animals”. \nStung, Mr Trump subsequently said of Ms Kelly: “You could see there was blood coming out of her eyes, blood coming out of her wherever.” \nFox-Trump tensions rose as Ms Kelly’s bodily fluids took the political centre stage . The RedState blog withdrew a speaking invitation for Mr Trump on the grounds that his blood comment referred to menstruation. Mr Trump said “only a degenerate” would think that. Ms Kelly stood her ground, saying: “Mr Trump has decided to not apologise and I certainly won’t apologise for doing good journalism.” Ms Kelly’s network, however, was soon taking a more accommodating stance. Mr Ailes called Mr Trump on Monday and, before you knew it, The Donald was back in the Fox News fold. “We are friends,” Mr Trump told one network host on Tuesday morning. “We’ve always been friends.” \nThe Ailes-Trump rapprochement sent the chattering classes into overdrive. Inquiring minds wanted to know who blinked first and whether Mr Ailes and Mr Murdoch agreed on Mr Trump — or, for that matter, on the Murdoch sons, James and Lachlan, both recently elevated in the Fox corporate hierarchy. \nBut it seems to me that the implications for the viewers at home are fairly clear. For the time being at least, carnival people are calling the shots in the Grand Old Party — and that means the Republican freak show must go on.", "external_links": [], "published": "2015-08-14T14:20:00.000+03:00", "crawled": "2015-08-14T16:20:20.225+03:00", "highlightTitle": ""}