{"organizations": [], "uuid": "493877240f3e19987dae196ed1410988f13e17e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/z/d/i/9/image.related.afrArticleLead.620x365.gize8a.png/1439722804953.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/real-estate/lorenz-grollo-transforms-family-business-with-500m-hotel-deal-20150814-gize8a", "country": "AU", "title": "Lorenz Grollo transforms family business with $500m hotel deal", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Lorenz Grollo transforms family business with $500m hotel deal | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T22:15:00.000+03:00", "replies_count": 0, "uuid": "493877240f3e19987dae196ed1410988f13e17e2"}, "author": "Post to Linkedin", "url": "http://www.afr.com/real-estate/lorenz-grollo-transforms-family-business-with-500m-hotel-deal-20150814-gize8a", "ord_in_thread": 0, "title": "Lorenz Grollo transforms family business with $500m hotel deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Eureka-managed Intercontinental Hotel in Melbourne over which Lorenz Grollo is in due diligence to buy. Mark Chew Share on twitter Share on Google Plus by Nick Lenaghan ﻿\nEquiset Grollo Group, led by Melbourne property scion Lorenz Grollo, is undertaking exclusive due diligence on a $500 million portfolio of hotels, which is controlled by Eureka Funds Management and includes the Intercontinental Hotel in Melbourne.\nMr Grollo has the won the backing of a capital partner, yet to be identified, to take over a five-asset portfolio comprising hotel properties in Melbourne, Sydney and Canberra.\nThe transaction, if completed as expected, is the most ambitious move yet by 41-year-old as he oversees a generational transformation of the family-owned Grollo Group away from construction to focus on development and investment.\nLorenz Grollo is doing due diligence on a $500 million portfolio of hotels for his family business. Angela Wylie It is believed the portfolio deal was sparked by Mr Grollo's initial interest in getting control over the Intercontinental property, which stands next to the Rialto Towers on Collins Street, where Mr Grollo is pursuing a $100 million redevelopment.\nThe Rialto, one of Melbourne's best-known buildings, was built and developed by Mr Grollo's father Rino and uncle Bruno. Mr Grollo's immediate family still owns half the Rialto, in a joint venture with the London-based, Kuwaiti-owned, St Martins Property Group.\nSecuring the Intercontinental was a logical move for Mr Grollo in order to facilitate a substantial mixed-use redevelopment across the Rialto forecourt.\nFamily history \"The hotel was originally developed by my family and we completed the $45 million Intercontinental refurbishment for the current owner in 2008,\" Mr Grollo said in a statement to The Australian Financial Review .\nNegotiations over the Intercontinental, which incorporates the historic Winfield and Rialto buildings on Collins Street, appear to have opened the door for a larger deal on the entire portfolio, which Eureka has managed for a domestic super fund investor.\nEureka was not available for comment and Mr Grollo also declined to shed light on the larger deal now in play.\nEureka has been running a sales process to find a buyer for the hotel portfolio. Along with the 255-room Intercontinental, the portfolio includes the 385-room Crowne Plaza hotel nearby on Spencer Street, standing on the banks of the Yarra River overlooking Crown Casino.\nThe other properties are the 210-room Crowne Plaza at Coogee Beach in Sydney, 288-room Holiday Inn in Potts Point and the 300-room Crowne Plaza in Canberra.\nEureka has carved out a sixth asset from the original portfolio to sell separately, the $70 million-plus beachfront Crowne Plaza hotel at Terrigal on NSW's central coast\n10-year agreements The Eureka portfolio is under the management of global hospitality group IHG Management, which has agreements in place of 10 years or more.\nTogether, the five properties in the portfolio hold considerable redevelopment potential over the medium term.\nIt is that upside which has attracted Mr Grollo as he redirects his family interests away from construction into development projects and real estate investment.\nThe shift has been gathering steam over the past year, as Mr Grollo in quick succession, sold a $100 million residential project in North Melbourne and the Goods Shed North redevelopment he had undertaken in Docklands.\nThen, after gaining approval for a super-skinny tower opposite the Rialto, Mr Grollo flipped the project to private developer Jeff Xu, to concentrate on the revitalisation of Rialto and launch the next chapter of the family business which will now include a $500 million hotel portfolio.", "external_links": ["https://plus.google.com/https://plus.google.com/u/0/115129227206723134737/posts", "https://twitter.com/https://twitter.com/NickLenaghan"], "published": "2015-08-16T22:15:00.000+03:00", "crawled": "2015-08-17T00:12:46.888+03:00", "highlightTitle": ""}