{"organizations": [], "uuid": "839b4be3c37e2061e3e6989869b5dab72515f19f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/x/g/u/a/image.related.afrArticleLead.620x365.gj0pet.png/1439792205509.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/tony-abbotts-big-test-in-the-canning-byelection-set-for-september-19-20150817-gj0pet", "country": "AU", "title": "Tony Abbott's big test in the Canning by-election set for September 19", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Tony Abbott's big test in the Canning by-election set for September 19 | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T11:28:00.000+03:00", "replies_count": 0, "uuid": "839b4be3c37e2061e3e6989869b5dab72515f19f"}, "author": "Share via Email", "url": "http://www.afr.com/news/tony-abbotts-big-test-in-the-canning-byelection-set-for-september-19-20150817-gj0pet", "ord_in_thread": 0, "title": "Tony Abbott's big test in the Canning by-election set for September 19", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Tony Abbott during question time. Alex Ellinghausen Share on twitter Share on Google Plus by Primrose Riordan The Canning by-election, seen as critical to the future of Tony Abbott's leadership, has been set for September 19, after the new Speaker issued the writ on Monday.\nThe election was prompted by the sudden death of Western Australian Liberal Don Randall, 62, from a suspected heart attack in July.\nMr Abbott is under increasing pressure after a drawn out expenses scandal starring former Speaker Bronwyn Bishop , more bad polls and open disagreement within his frontbench over same sex marriage .\nThe revelation that trade union royal commissioner Dyson Heydon was booked to speak at a Liberal Party fundraiser , has also somewhat blunted its impact on Labor.\nIt had been possible the election would be held in October in line with council elections due in the same month, but now it will be held at the end of two sitting weeks in September.\nThe Liberal Party's selection committee on Saturday night recommended army officer Captain Andrew Hastie to be the party's candidate, which will now need to be signed off by the state council.\nMr Randall was seen as building Canning from a marginal into a safe seat after winning it in 2001 .\n\"What needs to be recognised is his seat of Canning was a true marginal swinging seat and Don, through very hard work in his electorate and very strong support by the people of Canning, has made it his seat for the last 15 years,\" WA Premier Colin Barnett said in July.\n The Liberal Party has also been under pressure in Western Australia as the mining boom's riches fade.\nLabor is set to decide their candidate at a meeting of their state executive on Sunday, while Clive Palmer has said his party will contest the Canning by-election and will announce its candidate on Friday.\nWith the by-election creeping up, Mr Abbott attempted to refocus public attention away from the explosive topic of same sex marriage on Monday , holding a press conference on the fight against the drug 'ice' at the same time backbencher Warren Entsch tabled his cross party bill.", "external_links": ["http://www.canning.wa.gov.au/", "https://twitter.com/primroseriordan", "https://plus.google.com/117519411493153561016"], "published": "2015-08-17T11:28:00.000+03:00", "crawled": "2015-08-17T10:53:08.219+03:00", "highlightTitle": ""}