{"organizations": [], "uuid": "8423653032fc8a8b10c46c5acbf76542a02a01e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/ikZvXWZI0Tz0/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-07/look-how-much-your-peers-are-saving-for-retirement-you-loser-", "country": "US", "title": "Look How Much Your Peers Are Saving for Retirement (You Loser)", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "Look How Much Your Peers Are Saving for Retirement (You Loser) - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T19:17:00.000+03:00", "replies_count": 0, "uuid": "8423653032fc8a8b10c46c5acbf76542a02a01e2"}, "author": "Suzanne Woolley", "url": "http://www.bloomberg.com/news/articles/2015-08-07/look-how-much-your-peers-are-saving-for-retirement-you-loser-", "ord_in_thread": 0, "title": "Look How Much Your Peers Are Saving for Retirement (You Loser)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What if people in your age and income brackets put an average of 8 percent of their salaries into their 401(k) plans, and the top 10 percent squirreled away 15 percent — and you could see it all on your plan&apos;s website?\nAnd what if you put only 6 percent of your salary away — and, with a click or two, you could boost your contribution?\nWould you:\nA. Wonder how much those 15 percenters are making B. Work on your pitch for a raise C. Say \"Hurray for them\" and keep saving 6 percent D. Bump up your savings rate Many employees choose D, as peer comparisons push under-savers to pick up the pace, some large 401(k) plan administrators say.\nOne big proponent of the approach is Empower Retirement , which administers plans covering 7.5 million employees. (Empower combined the 401(k) businesses of Putnam Investments, Great-West Financial, and J.P. Morgan Retirement Plan Services, and administers Bloomberg LP&apos;s own plan.) The tool it uses, How Do I Compare?, launched last year at Putnam— about 350,000 people have access to it today—and Empower is rolling out an enhanced version for all its participants.\nWith Empower&apos;s tool, retirement savers can compare their contribution rate and balance to the average for people of their gender and their age and income ranges. They can also see how they stack up against the top 10 percent of their peers, which Empower says is the real point of the exercise.\nIn a sample of 30,000 savers Empower tracked, 5,000 changed their savings rate while using the tool, on average bumping up their contribution from a starting point of 7.3 percent of salary to match the top savers&apos; average rate of 9.1 percent, for a 25 percent increase.\nOne thing&apos;s for sure: Americans don&apos;t save enough for retirement, and saving more can make a big difference to your retirement fund. Look at this scenario, which uses numbers from Vanguard to show the impact of increasing 401(k) contributions by 1 percentage point annually over 30 years. It&apos;s based on deferring 3 percent of a $100,000 salary :\nAnd what&apos;s good for the goose is good for everybody. The employee saves more for retirement. The employer does right by its workers. The plan provider serves its client well—and gains financially on any added savings the employee invests in its own products.\nThere&apos;s a danger to inviting such comparisons, said Rob Austin, director of retirement research at Aon Hewitt, which doesn’t use a peer comparison tool. “If you&apos;re in the upper half of the peer comparison, you may say, ‘Hey, I’m doing better than most,&apos; and be a little more lax,\" he said, though you still may not be near an optimal savings level.\nVanguard doesn&apos;t have such a tool, either, though it may create one, said spokeswoman Emily White. You need to be very careful with peer messaging, said Rebecca Katz , Vanguard&apos;s head of participant strategy and development. One of her researchers knows of a plan in which the average savings rate was 6 percent; after a message went out noting that average, some higher savers cut their rate, she said. Empower said it hasn’t seen signs of this.\nParticipants in 401(k) plans managed by Fidelity can compare themselves to typical Fidelity account holders by age, Zip code, state, or region, and with other age groups. A study Fidelity did of people who used the tool&apos;s app on their mobile device showed they were 17 percent likelier to raise their contribution than those who didn&apos;t use the tool. Here&apos;s what Fidelity&apos;s NetBenefits tool looks like on a desktop (its plan participants can also use the NetBenefits app, and Empower has an app as well):\nOn a slow summer Friday, it can also be entertaining. Look here! People between 40 and 49 who live in 90210 typically have a savings rate of 11 percent and an average balance of $111,700. In the White House&apos;s Zip, it&apos;s 9 percent and $112,000. Out in Palo Alto, it&apos;s 15 percent and $156,700. Good fun.\nFor a broader picture, this Bloomberg Business interactive graphic, which lets you compare your 401(k) with top-ranked plans, is pretty entertaining (and very illuminating), too:\nPeer-themed e-mails that Vanguard sent in tests done in 2013 and 2014 spurred some savers between ages 30 and 50 who put less than 8 percent of their salary in a 401(k) to increase savings. Some 5.4 percent of those getting the message raised their savings rate, compared with a control group&apos;s 4.7 percent. Response from people under 30 was smaller; the 50-plus crowd didn&apos;t respond.\nPeer comparisons are one of many ways plans try to spark saving. Others include e-mail nudges, like this message in emojis that Vanguard sent to younger workers, and online calculators showing what your current savings could produce in retirement income.\n\"Some people wouldn&apos;t be motivated by social comparison, and for others it drives everything they do,\" said Edmund Murphy, Empower&apos;s president. \"The ultimate goal is to get people to the point where, in retirement, they can replace the income they made while working.\"", "external_links": ["http://assets.bwbx.io/images/i85tNpxhs8H8/v1/460x260.png\\", "http://media.gotraffic.net/images/il_aTxQHko8A/v1/460x260.jpg\\", "http://www.wsj.com/articles/will-you-be-able-to-retire-1400880527\\", "http://assets.bwbx.io/images/ioH5f35e5_DA/v1/460x260.png\\", "http://aon.mediaroom.com/2015-01-14-Aon-Hewitt-Survey-Shows-Employers-are-Offering-More-Tools-and-Resources-to-Improve-Financial-Outcomes-for-Workers\\", "http://assets.bwbx.io/images/iM9mFQ3sfVDk/v1/460x260.png\\", "https://communications.fidelity.com/wi/2012/howdoicompare/\\", "http://www.investmentnews.com/article/20150105/FREE/150109978/retirement-readiness-15-salary-deferrals-are-the-new-10-for-401-k-s\\", "http://www.biography.com/news/beverly-hills-90210-cast-where-are-they-now\\", "http://assets.bwbx.io/images/izkNbq6_u5zM/v1/460x260.png\\", "http://www.riabiz.com/a/5045209599574016/the-second-largest-401k-provider-drops-great-west-for-empower\\", "http://www.aon.com/attachments/human-capital-consulting/2014_Hot-Topics-Retirement_Highlights_vFinal.pdf\\"], "published": "2015-08-07T19:17:00.000+03:00", "crawled": "2015-08-07T14:22:25.343+03:00", "highlightTitle": ""}