{"organizations": [], "uuid": "7d3d9eae2ffcc263d453308c8a2efcbdab677fa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/home-bias-investment-could-damaging-211350661.html", "country": "US", "title": "Home bias on investment could be damaging your pension prospects", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Home bias on investment could be damaging your pension prospects", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T00:13:00.000+03:00", "replies_count": 0, "uuid": "7d3d9eae2ffcc263d453308c8a2efcbdab677fa3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/home-bias-investment-could-damaging-211350661.html", "ord_in_thread": 0, "title": "Home bias on investment could be damaging your pension prospects", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Aug 30, 2015, 22:39 BST - UK Markets closed Home bias on investment could be damaging your pension prospects By Suneil Mahindru | Telegraph – 26 minutes ago +0.30 \nFor any of the top UK companies, their peer group is global, not local \nFrom the vantage point of London, the UK might easily have felt like an investment safe haven in recent months. One step removed from the eurozone and the continuing drama in Greece, with strong domestic growth to look back on and a newly stable political settlement, UK investors’ biggest headline challenge is how to position for a medium-term rise in interest rates. More recently, while the FTSE was devastated thanks to the Chinese slowdown, as was the Dow in what quickly became a global event. \nWith this in mind, focusing investment on UK stocks might seem like a sensible policy. Indeed, many British pension schemes do just that: last year, we found the 226 final-salary schemes still run by FTSE 350 companies invested 29pc of their assets in UK equities vastly overweight relative to the global market, to which the UK contributes just 7pc of total capitalisation. \nAs with any market position, if returns justified the bias this would not present a problem. But UK stocks, despite the stability of the economy, have underperformed the wider market: they returned 0.7pc in 2014, dramatically less than the yields enjoyed by investors benchmarked against the MSCI World Index, which returned more than 10pc over the year. \nThat home bias might be in long-term decline as schemes diversify allocations in 2008, UK stocks accounted for 48pc of scheme assets but UK schemes are missing out on billions of pounds of potential returns. In the FTSE 350 alone, last year the overweight position relative to the global market cost schemes £7.2bn. \nA domestic bias does not even necessarily offer a hedge against uncertainty elsewhere: around 50pc of UK company revenues are booked offshore and confidence, or the lack of it, in key international markets can have a striking effect on returns in UK investments. The FTSE hit its lowest point for seven months on Thursday following its worst losing run since 2011 amid concerns about global growth, themselves sparked by China’s cooling economy. \nFavouring one domestic market also carries the risk of an unintentional concentration on certain sectors: one stock exchange is only as diverse as the aggregation of companies that have listed on it. \nIn the UK, for example, the FTSE is heavily biased towards commodities-related companies, which account for 20pc of the index compared with 10pc for the S&P 500 and just over 11pc for the MSCI ACWI, which tracks a basket of developed and emerging companies. Buying the commodity-weighted benchmark can work for or against you, but it is important to recognise that the structural bias exists. \nOf more concern, perhaps, is what the UK benchmark doesn’t offer: the FTSE’s weighting to information technology is less than 2pc, while the US equivalent, the S&P 500, has a weighting of just under 20pc. Any investor seeking meaningful exposure to new technologies, for example, would therefore be well advised to consider the US benchmark, not because of any bias to the US economy but just to make sure they get the industry exposure they want. \nRegional diversification in its own right is, of course, important to good portfolio selection. A strong economy does not always indicate the likelihood of strong performance in the local stock market and the diverse range of circumstances governing different markets globally offer different opportunities in each. \nWhile we believe the US economy is strong, for example, we feel other markets such as Europe offer more upside. While Greece remains a pressing issue in Europe, quantitative easing itself an extraordinary measure is having a positive effect on stocks, given the export boost from the weaker euro, and we are optimistic about European firms’ performance. \nLooking further afield, a domestic bias prevents investors from taking advantage of developments in markets not immediately on the doorstep. Japan, for example, has almost been a forgotten market over the past 20 years but the combination of “Abenomics”, export-boosting monetary easing and corporate governance reform is yielding very encouraging growth opportunities in some stocks as corporate profitability and earnings growth improve. \nThe problem for London-based managers is that their access to companies in foreign markets is typically limited to the annual investor report. Not every scheme can keep abreast of developments in global markets, which is why selecting a manager with good local knowledge is critical. Having constant, on-the-ground access to companies through a manager speaking the local language and analysing what companies are doing is very important. \nEspecially in emerging markets, an informed manager can make decisions with more confidence, from favouring privately-owned as opposed to government-controlled companies, through to selecting stocks of companies that have demonstrated good long-term capital allocation and positive prospects for growth. \nA well-connected manager with a presence in the local market can confidently assert, for example, that Japanese companies have successfully rebuilt their balance sheets, with many now having comfortable cash reserves which allow them to invest. Combined with a knowledge of the economic situation, this allows a manager to recommend Japan as an attractive prospect for equities. \nBut taking an informed, outward-looking approach to investing is about more than simple diversification or informed stock selection. A global perspective gives valuable insight into every component in a portfolio and how international events are likely to affect them. The FTSE’s recent performance is an obvious example: it was not prompted by events here in the UK, but by the knock-on effects of the slowdown in China. \nEven (Taiwan OTC: 6436.TWO - news ) stock-by-stock, investors need to look beyond the home market. For any of the top UK companies, their peer group is global, not local. \nBeing in a thriving investment environment such as the UK can sometimes encourage insularity, but with the right support, the global marketplace can be a much more compelling and illuminating prospect. \nSuneil Mahindru is CIO of international equity at Goldman Sachs Asset Management", "external_links": [], "published": "2015-08-31T00:13:00.000+03:00", "crawled": "2015-08-31T00:39:54.451+03:00", "highlightTitle": ""}