{"organizations": [], "uuid": "63ce7a494b22657994652bb9b9250e6592974896", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/x/j/0/w/image.related.thumbnail.320x214.gix6i9.png/1439379111065.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2550/consumer-discretionary/retailing", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/comment-and-analysis/fraser-trousers-tidy-farewell-from-his-old-workshop-at-agl-20150812-gix6i9.html", "country": "AU", "title": "AGL's Michael Fraser trousers tidy farewell from his old workshop at AGL", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "AGL's Michael Fraser trousers tidy farewell from his old workshop at AGL", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "63ce7a494b22657994652bb9b9250e6592974896"}, "author": "", "url": "http://www.smh.com.au/business/comment-and-analysis/fraser-trousers-tidy-farewell-from-his-old-workshop-at-agl-20150812-gix6i9.html", "ord_in_thread": 0, "title": "AGL's Michael Fraser trousers tidy farewell from his old workshop at AGL", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Illustration: John Shakespeare\nWell, former AGL boss Michael Fraser certainly went out on a high – pocketing $7.7 million on his way out the door earlier this year – and a handy pay rise from the $5.3 million he took home the year earlier.\nThen there were another 218,221 shares received under performance rights worth around $3.7 million just to ease him on his way. Part of the payout was a $800,000 \"termination benefit\" reflecting the unworked portion of his notice period.\n\"In light of Mr Fraser's strong leadership and performance\" while running the show, he was viewed as a \"good leaver\" under the short-term and long-term bonus plans, AGL noted in its executive pay card, meaning he received his short-term payment in full at $2.2 million.\nHe is subject to a six-month ban on working in the same field, so it shouldn't take too long before he pops up again.\nAlso gone in his wake were the former head of upstream operations, Michael Moraza​ , who received $1.5 million, and the former head of merchant energy Anthony Fowler ($1.8 million) as the new boss, US-import Andy Vesey​ took control.\nEven though he's only been there a matter of months, Vesey still took home $4.3 million, with his pay skewed more in favour of short- and long-term incentives than was the case when Fraser was running the show.\nMeanwhile, at property group DEXUS, the board took notice of the grumblings about last year's executive pay from proxy advisers and have simplified the long-term bonus plan for chief builder Darren Steinberg and numbers man Craig Mitchell, giving them each only a modest bonus for this year.\n﻿ Sweating it out A heat wave in Texas is not the only thing that has the Aussie recruits sweating at the Austin HQ of global pawn broker EZCorp.\nLast month, former Bank of Queensland boss Stuart Grimshaw and former Myer CFO Mark Ashby were treated to the news that its Aussie arm, Cash Converters, got lumbered with another class action seeking damages of up to $30 million on behalf of Queensland customers.\nIt sounds like the customers were a bit snippy about being charged brokerage fees that lifted their effective interest rates to as high as 160 per cent.\nMaybe Grimshaw should revamp its image with a reworking of BoQ's tag line \"it's possible to love a pawnbroker\".\nIt has barely been a month since the company settled similar claims with a $23 million payment.\nOn the other side of the globe, EZCorp's UK pawn shop, Cash Genie, was ordered to hand back around £10 million to 92,000 customers who were pressured with automatic rollover loans, unfair fees and a sister debt collection firm that piled more charges onto the debts.\nThis includes charging customers £50 to transfer them to Cash Genie's in-house debt collection firm, even though this cost the company nothing.\nCash Genie will write off another £10 million worth of fees and interest after spending more than a year in talks with the British financial regulator.\nMeanwhile, Ashby is no doubt focused on problems in Mexico which have delayed the release of EZCorp's results for the quarter ending March 31 this year. It also means EZCorp will not be in a position to file its full year results this month.\nThe company has reported that it will have to restate its financial accounts for the 2014 financial year and the first quarter of 2015.\n\"We are continuing our quantification and evaluation of other accounting errors in our Grupo Finmart​ loan portfolio, and have not yet determined whether additional reporting periods have been affected.\"\nThe dodgy accounts started coming to light around the same time that poor Ashby would have shown up at its Austin Texas headquarters for his first day at work.\nPity his bonus is hitched to the share price rather than fixing up the mess he has inherited.\nNarev's​ chuckles By raising $5 billion from shareholders, CBA is likely to see its return on equity fall, which could ultimately hit the bonuses of senior executives including chief teller Ian Narev .\nHowever, at least there is some upside for Narev​ – fewer questions about capital from those pesky market analysts.\n\"Well one positive we'd hope for is we stop any questions about capital,\" Narev​ told analysts, getting a few chuckles along the way.\nThe Kiwi expat might face a few tougher questions if the All Blacks fall to the Wallabies in Auckland this weekend.", "external_links": [], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-13T04:34:44.336+03:00", "highlightTitle": ""}