{"organizations": ["Daily Guide"], "uuid": "f3bb771a6f30d70d00e3274e7e4f804cd11b04cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/helgaj.m.boadi620x400.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/635678/1/yes-supports-107-young-entrepreneurs.html", "country": "US", "title": "YES Supports 107 Young Entrepreneurs", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "YES Supports 107 Young Entrepreneurs", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T19:28:00.000+03:00", "replies_count": 0, "uuid": "f3bb771a6f30d70d00e3274e7e4f804cd11b04cc"}, "author": "", "url": "http://www.modernghana.com/news/635678/1/yes-supports-107-young-entrepreneurs.html", "ord_in_thread": 0, "title": "YES Supports 107 Young Entrepreneurs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  11 August 2015 17:28 CET YES Supports 107 Young Entrepreneurs By Daily Guide \nHelga J.M. Boadi addressing the press The Government of Ghana has announced plans to offer financial and technical support to about 107 young entrepreneurs from across the country through the Youth Enterprise Support (YES) initiative. \nThe beneficiaries are to receive a GH¢2.5 million loan from President John Mahama at the Flagstaff House on Wednesday to start their businesses. \nChief Executive Officer (CEO) of the Youth Enterprise Support, Helga J.M. Boadi, who made this known at a press briefing in Accra yesterday, said the beneficiaries would operate in three sectors of the country's economy. \nShe said about 68 beneficiaries, representing 63.55 percent, are to engage in agribusiness, 36 representing 33.64 percent in services sector and three, representing 2.80 percent, would operate in the cottage industry. \nThe first batch of beneficiaries, she indicated, would be strictly monitored by the YES Secretariat and its partner agencies. \nYES was launched in August 2014 with a seed fund of GH¢10 million as a special youth initiative under the Office of the President. \nIt aims at stimulating Ghana's economic growth by harnessing the skills of young entrepreneurs through strategic provision of financial and expert business advisory support. \nCommenting on the selection process, she indicated that Ghanaians aged between 18 and 35 years with minimum of JHS qualification and viable business proposals were encouraged to apply to YES for support. \nA cross-section of the press She disclosed that 'we opened our first call for submission of business plans and proposals on 1 st September, 2014 with an initial deadline of 10 th October, 2014.' \nShe further noted that 'we received an overwhelming response from the youth of Ghana. A total of 2,048 applications were received by the deadline.' \nShe said 'applications were received from all 10 regions of Ghana, (922) 42% – agriculture, (635) 31% – Services and (491) 24% – Cottage Industry. \nScreening of applications yielded 1,681 valid applications.' \nShe added that 'following the screening of applications, regional business clinics were held for applicants from October 2014 to March 2015. Applicants were encouraged to make changes and resubmit where applicable.' \n'A total of 365 applicants successfully resubmitted their proposals and duly qualified for the final stage.' \nEach applicant was required to present and defend his or her business proposal before an expert panel drawn from relevant professional bodies and business sectors. \nAccording to her, '107 applicants were adjudged by the expert panel to have met the criteria for YES support.' \n'The second batch of 350 applicants will present and defend their proposals before the expert panel for selection shortly.' \nMs. Boadi indicated that each beneficiary shall be made to provide two guarantors who shall be responsible for the repayment in the event any beneficiary fails to repay the YES loan. \nBY Melvin Tarlue", "external_links": [], "published": "2015-08-11T19:28:00.000+03:00", "crawled": "2015-08-11T18:53:03.065+03:00", "highlightTitle": ""}