{"organizations": [], "uuid": "6d54d326c1d244daefbbca62e408d7640981bc7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.girlsjustwannahavefunds.com", "main_image": "", "site_section": "http://www.girlsjustwannahavefunds.com/feed/rss/", "section_title": "Women's Personal Finance Girls Just Wanna Have Funds", "url": "http://www.girlsjustwannahavefunds.com/7-money-blocks-between-you-and-more-moolah/", "country": "US", "title": "7 Money Blocks Between You And More Moolah", "performance_score": 0, "site": "girlsjustwannahavefunds.com", "participants_count": 1, "title_full": "7 Money Blocks Between You And More Moolah", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T14:00:00.000+03:00", "replies_count": 0, "uuid": "6d54d326c1d244daefbbca62e408d7640981bc7e"}, "author": "Ginger", "url": "http://www.girlsjustwannahavefunds.com/7-money-blocks-between-you-and-more-moolah/", "ord_in_thread": 0, "title": "7 Money Blocks Between You And More Moolah", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "7 Money Blocks Between You And More Moolah August 19, 2015 Google+ 0 \nDo you feel like attracting more money into your life is an ongoing struggle? Sometimes, you’re on a roll—winning, and then little bumps along the road happen. You forget your keys, the screen of your iPhone cracks, or you’re going to be late paying the bills again this month. \nDeep down you may be harboring “ money blocks”. \nThere are ways you can open up your channels and invite cash to flow in more naturally and freely. But first, you have to overcome those limiting beliefs and ideas you’ve always harbored about money. \nLearn which of the 7 money blocks below are keeping you from manifesting your goals. \nLack of Clarity \nWhat do you really want? You may already have an idea of what tops your wish list, but if you think that item or experience is beyond your reach then this is a money block for you. Get to the core of your wavering desires to eliminate any confusion or uncertainty. Keep a clear goal in mind, write it down and be specific to help figure out the steps you need to take in reaching your goal. \nDe-clutter! \nAre there piles of receipts in your wallet? Are bills stacking up in a corner somewhere? Clutter takes up space for the things you love or want, like extra money! Keep an organized financial life through de-cluttering. Let go of old receipts and bills, schedule your bill payments, pick up stray coins, and work on getting out of debt. \nUncomfortable Receiving \nWhen someone offers to pay the dinner bill, do you feel a slight discomfort? This type of resistance blocks the experience of abundance from entering your life. Practice accepting money when given in its various forms, help when offered, and other blessings that are meant for you. Say thank you, and be grateful. \nOld Emotional Stuff \nEmotional issues keep you from moving towards financial success. Cultivate a positive outlook to your financial affairs. If emotional stuff is getting you down, just find a different way to approach your balance sheet. Look towards the sun, and all shadows fall behind. You’ve got this! \nPoverty Mindset \nFeeling deprived with a poverty mindset often leads to a self-fulfilling prophecy. When you continue to feel dejected and fixate on what’s lacking, you won’t feel motivated to go for what you want (and deserve) because you believe that you can’t afford it. Shift your mindset to shift your feelings and be motivated to take action instead. Instead of saying “I can’t afford it, ask yourself this: “ How can I afford it?”. \nMartyr Tendencies \nMany of us feel that we have to offer some sort of sacrifice to deserve what we want. The universe is unlimited and has no interest in negotiating terms with you. You don’t have to settle for less or be a martyr to manifest your goals. Find solace in the fact that it’s okay to want that think you’ve always wanted, and no one is judging you for it. \nI Have To “Earn It” \nMoney can come from gifts or talents you enjoy using to naturally enhance someone else’s life. You don’t have to work to the point of exhaustion in an office cubicle to feel like earning money is acceptable. It’s funny that we sometimes feel wrong receiving money for an activity we find easy or take pleasure in. Know there are more ways than the usual 9-5 to discover extra cash. \nMoney blocks can sometimes make you feel like a baby stumbling to get on her own little two legs. Don’t worry, though. We all have ‘em! As long as you recognize, continuously clarify your energy of any money blocks, and work on it consistently, you’ll see your money woes improve in no time.", "external_links": [], "published": "2015-08-19T14:00:00.000+03:00", "crawled": "2015-08-19T21:54:18.500+03:00", "highlightTitle": ""}