{"organizations": ["DCA", "ICANN Board"], "uuid": "f508b387f2e4e1f574d9b38ec8402bc3d8a8cb1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508060534.html", "country": "US", "title": "Africa: Pierre Dandjinou - ICANN Board's Decision On DCA's .africa Submission Has No Bearing On Zacr's Application", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Pierre Dandjinou - ICANN Board's Decision On DCA's .africa Submission Has No Bearing On Zacr's Application", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T11:25:00.000+03:00", "replies_count": 0, "uuid": "f508b387f2e4e1f574d9b38ec8402bc3d8a8cb1d"}, "author": "", "url": "http://allafrica.com/stories/201508060534.html", "ord_in_thread": 0, "title": "Africa: Pierre Dandjinou - ICANN Board's Decision On DCA's .africa Submission Has No Bearing On Zacr's Application", "locations": ["Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pierre Dandjinou"], "text": "Rwanda: ICT Innovation Seeks to Enhance Safety of Taxi-Moto Clients \n1. Now that the ICANN Board has resolved to refrain from delegating the .africa gTLD, what does this portend for ZA Central Registry's application? \nZA Central Registry's application for .AFRICA passed initial evaluation, the registry has completed the contracting process, and now has a signed registry agreement with ICANN for .AFRICA. The recent board decision regarding DotConnectAfrica Trust's application for the same string has no bearing on the application processes that ZA Central Registry has already completed. However, as the board resolved, the .AFRICA string will remain on hold for the time being. DotConnectAfrica Trust's application is currently in initial evaluation, a phase of the New gTLD Program in which multiple independent panels, including a panel dedicated to geographic names, review an application to ensure it meets the requirements in the Applicant Guidebook. It is too early to predict what will happen next, as there are many factors involved. \n2. Should the two applications - DCA's and ZA Central Registry's - proceed to the final stage of the process, is there possibility of auctioning the domain? \nZA Central Registry's application has already completed the evaluation and contracting phases of the New gTLD Program. ICANN has just resumed the initial evaluation phase for DotConnectAfrica(DCA) Trust's application and it is too early to predict what will happen next, as there are many factors involved. \n3. How much - in US $ - is ICANN going to reimburse DCA as costs related to the IRP? \nThe board resolved that ICANN will reimburse DotConnectAfrica Trust a sum of US$198,046.04, the amount that the independent review panel suggested. More information on this here. \n4. How does the IRP ruling impact the public's perspective about the impartiality of ICANN's GAC? \nIt's not ICANN's place to conjecture on public perception. With respect to the GAC's consensus advice in the Beijing Communiqué that DotConnectAfrica Trust's application for .AFRICA should not proceed, ICANN's board will ask the GAC if it wishes to refine that advice and/or provide the board with further information regarding that advice and/or otherwise address the concerns raised in the declaration issued by the independent review panel. \n5. Had DCA's application not gone through the initial evaluation process before it could proceed to the next stage due to the GAC advice? Please clarify. \nDotConnectAfrica Trust's application for .AFRICA had begun, but not completed initial evaluation when the ICANN board resolved to accept the GAC consensus advice that this application should not proceed in the New gTLD Program. \n6. Considering the current developments, when is the earliest possible date that the .africa gTLD can be delegated? \nICANN understands that the delay in delegating .AFRICA is not optimal for those eager to see this important top-level domain introduced into the Internet. We have already resumed the initial evaluation phase for DotConnectAfrica Trust's application for .AFRICA. Given that not all of the remaining steps in New gTLD Program processes are fully in ICANN's control, we cannot predict with certainty when .AFRICA might be delegated. However, ICANN's Board Chairman Steven Crocker has pledged that \"Our commitment to ICANN's African stakeholders remains strong. As this advances to final resolution, we will assist in moving this process forward as rapidly as possible and provide all parties with the certainties they are looking for and deserve.\" Africa \nThis is the week when, probably, \"Obamania\" will wear off and we go back fully to our old lives. see more » Copyright © 2015 CIO East Africa. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-06T11:25:00.000+03:00", "crawled": "2015-08-06T13:30:00.526+03:00", "highlightTitle": ""}