{"organizations": [], "uuid": "c6039c2ab1dd88c601b16a4a1d6071dd6cc16652", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/wOHnURSbwgrOe6giHpJ13A--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/trek-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-skynews/?format=rss", "section_title": "Finance News | Sky News - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/lotus-takes-biscuit-60m-swoop-104212678.html", "country": "GB", "title": "Lotus Takes Biscuit With £60m Swoop On Nakd", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Lotus Takes Biscuit With £60m Swoop On Nakd", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T14:11:00.000+03:00", "replies_count": 0, "uuid": "c6039c2ab1dd88c601b16a4a1d6071dd6cc16652"}, "author": "", "url": "https://uk.finance.yahoo.com/news/lotus-takes-biscuit-60m-swoop-104212678.html", "ord_in_thread": 0, "title": "Lotus Takes Biscuit With £60m Swoop On Nakd", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 14, 2015, 13:06 BST - UK Markets close in 3 hrs 24 mins Lotus Takes Biscuit With £60m Swoop On Nakd By (c) Sky News 2015 | Sky News – 55 minutes ago View Photo \n\nAnother slice of Britain's food industry is to fall into foreign hands when Belgium's Lotus Bakeries (Brussels: LOTB.BR - news ) swoops to buy the fast-growing owner of Nakd and Trek bars. \nSky News understands that Lotus, which is listed on the Euronext (Lisbon: ENX.LS - news ) stock exchange in Brussels, is in advanced talks to acquire Natural Balance Foods for more than £60m. \nLotus, which is best-known in the UK for its caramelised biscuits, could announce the deal within days, according to a rival bidder. \nThe Belgian company saw off competition at an earlier stage of the process from bidders including Burton's Biscuits, the maker of Jammie Dodgers and Wagon Wheels. \nThe takeover of Natural Balance, which emphasises the nutritional content of its products, will hand a substantial payday to the company's founders, who launched the company just a decade ago. \nNatural Balance was set up in Oxfordshire by two Californian-born brothers, Jamie and Greg Combs, and its gluten-free Nakd bars have soared in popularity amid rising demand for healthy snacking products. \nThe adoption by high-profile athletes such as Novak Djokovic of a gluten-free diet has helped to cement the growth of compliant products. \nIn the year to March, Natural Balance registered an operating profit of more than £2m on sales of around £20m. \nThe UK gluten-free food market is worth £238m a year and grew by more than 15% in 2013, according to the Food Standards Agency. \nLotus is among a large number of overseas food groups to be attracted to homegrown British brands with potential for international growth. \nLast year, United Biscuits, the maker of Jaffa Cakes and Penguin bars, was sold to Turkey's Ulker; Weetabix, the breakfast cereal brand, is now owned by China's Bright Foods; and Quorn, the meat substitute range, is likely to attract interest from the US and ‎elsewhere when an auction gets under way this year. \nNatural Balance's sale has been overseen by Stamford Partners, an advisory firm, which could not be reached for comment.", "external_links": [], "published": "2015-08-14T14:11:00.000+03:00", "crawled": "2015-08-14T15:08:58.444+03:00", "highlightTitle": ""}