{"organizations": [], "uuid": "1f31cf3751366b63badd1e0e23a4f67213aa6337", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/n7YXXbL1scCszm4LAiep6g--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/10332959-1-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/hsbc-glitch-delayed-payments-now-114401412.html", "country": "GB", "title": "HSBC Glitch: Delayed Payments Now Processed", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "HSBC Glitch: Delayed Payments Now Processed", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T14:44:00.000+03:00", "replies_count": 0, "uuid": "1f31cf3751366b63badd1e0e23a4f67213aa6337"}, "author": "", "url": "https://uk.finance.yahoo.com/news/hsbc-glitch-delayed-payments-now-114401412.html", "ord_in_thread": 0, "title": "HSBC Glitch: Delayed Payments Now Processed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nHSBC has said all the payments that were held up by a computer glitch have now been processed. \nAround 275,000 bank payments had been held up by the glitch, with many people reporting they had not received their monthly salaries. \nSome - including customers of other banks - said they had to cancel holidays and weekend getaways ahead of the bank holiday. \nSalaries that should have arrived in personal accounts overnight into Friday instead got caught up in the national Bacs payment system. \nHSBC has apologised for the delays and said all of the payments held up by the glitch would be processed by Saturday morning. \nThe bank said in a statement: \"We are committed to ensuring that no one loses out as a result of today's unacceptable problems. \n\"We will work with our customers and the other banks including providing compensation where appropriate. \n\"Customers who do not receive the delayed payment by Saturday morning should speak with their bank in the first instance. \n\"They should also contact their bank if they have suffered any costs as a result of today's problems.\" \nMatthew Robinson is co-founder of Hove-based translating service UK Techtrans, where the problem left his eight employees and 100 suppliers unpaid. \nMany had to cancel holidays this weekend, he said. \nMr Robinson told Sky News earlier: \"Today has been an absolute calamity. \n\"It (Other OTC: ITGL - news ) affects our business in a bad way and I cannot get through to (HSBC) on their phones.\" \nNigel Moore, a sales representative in Exeter who has also had to cancel plans for a long weekend getaway, realised something was wrong when he checked his bank balance at around 5am. \nHe added that there was no communication from HSBC telling him what had happened or what he could do. \nMr Moore told Sky News: \"I've got direct debits which are set to go on Tuesday and if I don't get paid I will incur bank charges as I will significantly be over my overdraft. \n\"This includes my child support payments to my ex-wife and I have not been informed as to whether I will be still liable for that. \n\"So not only will I have to sort out bills but have awkward conversations with the CSA (Child Support Agency).\" \nHSBC, which has 48 million customers in 72 countries, including 16.1 million in the UK, said the fault was in information used to process some payments from HSBC business customers, including payments to customers of other banks. \nThe Financial Conduct Authority said it would ensure HSBC did not leave people out of pocket. \nThe Bacs system deals with transactions worth around £50bn every day. \nHSBC customers were advised to call 03457 404 404 for further information. \nIn June 600,000 payments failed to reach the accounts of RBS (LSE: RBS.L - news ) customers. \nAndrew Tyrie MP, chairman of the Treasury Select Committee, said: \"This appears to be yet another serious IT failure by one of the major clearing banks. \n\"It is increasingly clear that most, if not all, of these banks' IT payments systems need a good deal of investment, and there is a lot to put right.\"", "external_links": [], "published": "2015-08-29T14:44:00.000+03:00", "crawled": "2015-08-29T15:33:37.298+03:00", "highlightTitle": ""}