{"organizations": [], "uuid": "b96df937ea034c8d49f5ada75c60da2ae2a0b3ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/04/spicejet-Re-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/companies/spicejet-in-talks-with-aircraft-makers-to-purchase-planes/126529", "country": "IE", "title": "SpiceJet in talks with aircraft makers to purchase planes", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "SpiceJet in talks with aircraft makers to purchase planes | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:09:00.000+03:00", "replies_count": 0, "uuid": "b96df937ea034c8d49f5ada75c60da2ae2a0b3ab"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/companies/spicejet-in-talks-with-aircraft-makers-to-purchase-planes/126529", "ord_in_thread": 0, "title": "SpiceJet in talks with aircraft makers to purchase planes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gurgaon-based no-frills airline SpiceJet is in discussions with global aircraft makers to acquire more planes for its fleet following the turnaround of the carrier, which was almost out of the business last year.\nThe selection of firms and the number of aircraft that the airline would go for will be decided during the course of the negotiations, SpiceJet Chairman Ajay Singh said today.\nThe airline currently has a total of 36 aircraft in its fleet comprising Boeing, Airbus and Bombardier planes.\n“We have not discussed any specific numbers but we expect the aircraft order will be a sizeable one,” Singh said on the sidelines of an industry event here.\nHe said that the negotiations with the aircraft makers are going on for quite some time, adding, “We expect to complete the negotiations and place the order this financial year.”\nTo a question on the number of aircraft that SpiceJet was looking at to acquire, Singh said as of now there was no discussion on the specific numbers.\n“But we expect the aircraft order will be a sizeable one. The issue of how many firm and how many options the orders will be for will be decided during the course of the negotiations, he added.\nSingh also said a decision on the 55 Boeing MAX aircraft which were ordered during the erstwhile ownership of Maran’s family would also be taken during the on-going negotiations.\nIn July this year, Singh had said that SpiceJet needs some long-term aircraft order so that it can put a business plan around it.\nSpiceJet would induct five more Boeing 737s besides adding 40 new flights in its existing network including the international routes during the forth coming winter schedule, Singh said.\nWhen asked how he plans to fund the new aircraft order, he said there is no shortage of capital available to SpiceJet.\n“We have many offers of capital and depending on how much capital is required to fund the purchase,” he said adding there were also offers of strategic investment by funds and airlines but did not divulge more details.\n 27, 2015 7:09 pm", "external_links": [], "published": "2015-08-28T03:09:00.000+03:00", "crawled": "2015-08-27T18:37:44.279+03:00", "highlightTitle": ""}