{"organizations": [], "uuid": "3bc736984ab6940a7f02379b83880e44790004d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static1.businessinsider.com/image/55c995555afbd319138b4567/automakers-feel-china-heat-as-buyers-burnt-by-stocks-rout-desert-showrooms.jpg", "site_section": "http://feeds.feedburner.com/TheMoneyGame", "section_title": "Finance", "url": "http://www.businessinsider.com/r-automakers-feel-china-heat-as-buyers-burnt-by-stocks-rout-desert-showrooms-2015-8", "country": "US", "title": "Automakers feel China heat as buyers burnt by stocks rout desert showrooms", "performance_score": 0, "site": "businessinsider.com", "participants_count": 0, "title_full": "Automakers feel China heat as buyers burnt by stocks rout desert showrooms", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T09:15:00.000+03:00", "replies_count": 0, "uuid": "3bc736984ab6940a7f02379b83880e44790004d2"}, "author": "", "url": "http://www.businessinsider.com/r-automakers-feel-china-heat-as-buyers-burnt-by-stocks-rout-desert-showrooms-2015-8", "ord_in_thread": 0, "title": "Automakers feel China heat as buyers burnt by stocks rout desert showrooms", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You have successfully emailed the post. Automakers feel China heat as buyers burnt by stocks rout desert showrooms Aug. 11, 2015, 2:15 AM 0 \nThomson Reuters A woman walks past Mercedes Benz cars displayed for sale outside a store in Beijing, China \nBy Jake Spring \nBEIJING (Reuters) - The great Chinese stock slump that first whacked luxury car sales is spreading to mass-market brands as wannabe customers like Zhang Jiabin count the cost of soured investments. \nThe 37-year-old food company executive lost nearly $6,500 when shares tumbled in June and July, and can't now afford the new Volkswagen Tiguan sport-utility vehicle he had his eye on. \"I can't draw money,\" Zhang said, \"I'll wait until (the market) goes up.\" \nAuto analysts and officials worry that July data released later on Tuesday will show a bigger slide than June's 2.3 percent drop in the world's biggest car market. As many more who lost out in a trillion-dollar share slump join Zhang in delaying purchases, a fourth successive month of decline would be China's weakest sales streak since the 2008 global financial crisis. \nWith brands from Ford Motor Co and Nissan Motor Co already having reported weak sales, global automakers now fear a sustained period of dwindling demand and depressed prices. That will squeeze profit, create an inventory burden for dealers and ramp up already-fierce competition. \nChina-based managers and executives at major global automakers say that leaves companies now pushing staff hard to meet targets despite the bleak outlook. Gloom over China's economy was highlighted on Tuesday when it devalued the yuan after a run of poor economic data. \nAt Volkswagen AG , China's best-selling car brand, a regional manager at a sales subsidiary said the automaker is pressing for staff to continue to meet targeted sales numbers to protect its market share, forcing inventory on dealers that will bite into their profit. \n\"The dealers are the first to cry,\" the manager said, referring to tensions with the automaker. \nA Volkswagen spokeswoman said financially healthy dealers are part of the company's strategy as \"only satisfied dealers guarantee satisfied customers.\" \nLIMITED OPTIMISM \nAt Ford, sixth-largest by sales in China, officials are working to find ways to match uncertainty over the future of sales trends with the necessity to plan production. Last Friday the automaker said it sold 6 percent fewer cars in July than in the same month last year, doubling the year-on-year decline from June. \n\"The next two to four months will be the most important and also the most difficult,\" said one person close to Ford with knowledge of production plans. Short-term production adjustments are growing more frequent, he said, leading suppliers to incur greater costs. \n\"Any changes to the manufacturing plan of finished cars will effect thousands of parts, thereby influencing hundreds of suppliers,\" he said. \nA Ford spokeswoman said production adjustments are normal even with only a few days and weeks of lead time. Any adjustments are in accordance with supplier contracts, she said. \nWhile optimism is in short supply, Honda Motor Co and Toyota Motor Corp have shown one way forward, hoisting sales thanks to recent launches of new, ever-popular SUVs. \nSome analysts even predict a return to sales growth later this year as the stock market stabilizes. They see expansion in high-single digit percentages next year, the strongest sales since 2013, bearing in mind that China still has low levels of car ownership compared with mature markets in the United States and Europe. \n(Additional reporting by Beijing newsroom and Norihiko Shirouzu; Editing by Kenneth Maxwell) Read the original article on Reuters . Copyright 2015. Follow Reuters on Twitter . More from Reuters:", "external_links": [], "published": "2015-08-11T09:15:00.000+03:00", "crawled": "2015-08-11T09:52:24.396+03:00", "highlightTitle": ""}