{"organizations": ["Burberry Group plc", "Unilever plc", "Standard Chartered PLC"], "uuid": "f518ff6a4e1da0fa539b5ad1d6ef1d0b2fd21f27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-banks/?format=rss", "section_title": "Banking News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/now-perfect-time-buy-unilever-111521153.html", "country": "US", "title": "Is Now The Perfect Time To Buy Unilever plc, Standard Chartered PLC And Burberry Group plc?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is Now The Perfect Time To Buy Unilever plc, Standard Chartered PLC And Burberry Group plc?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T14:15:00.000+03:00", "replies_count": 0, "uuid": "f518ff6a4e1da0fa539b5ad1d6ef1d0b2fd21f27"}, "author": "", "url": "https://uk.finance.yahoo.com/news/now-perfect-time-buy-unilever-111521153.html", "ord_in_thread": 0, "title": "Is Now The Perfect Time To Buy Unilever plc, Standard Chartered PLC And Burberry Group plc?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 26, 2015, 12:41 BST - UK Markets close in 3 hrs 49 mins Is Now The Perfect Time To Buy Unilever plc, Standard Chartered PLC And Burberry Group plc? By G A Chester | Fool.co.uk – 25 minutes ago 2,564.00 -21.000 \nThe FTSE 100 is at around 6,000, as I write -- down 15% from its April high of 7,104. An end-of-summer sale is on, and I'm looking for blue-chip bargains. \nCould now be the perfect time to snap up Unilever (LSE: ULVR), Standard Chartered (LSE: STAN) and Burberry (LSE: BRBY)? \nUnilever \nOrdinarily, we would expect a \"defensive\" stock, such as consumer goods giant Unilever, to outperform in a falling market. For example, during the great bear market of 2007-2009, while the FTSE 100 plunged 48%, Unilever's shares declined a far more modest 21%. \nHowever, during the current market correction, Unilever at 2,540p is down 16% from its 52-week high, which was made towards the end of April -- so, a drop of pretty much the same order, and over the same period as the Footsie. It looks promising for investors that defensive Unilever has been dragged down this far in the market sell-off. \nUnilever reported an increase in core earnings per share (EPS) of 8% in its half-year results last month, and City analysts expect the company to continue knocking out this kind of high-single-digit EPS growth in future. Unilever's forecast price-to-earnings (P/E) ratio for the current year has now fallen comfortably below 20 -- and comes down to nearer 18 if we look ahead to next year. The stock of this reliable business appears very buyable to me on this rating. \nStandard Chartered \nAsia-focused bank Standard Chartered has seen its shares fall a whopping 42% from their 52-week high. However, that high was made about a year ago, and half of the fall came before the recent market correction. As that suggests, StanChart -- in contrast to Unilever -- was a company already under the cosh. \nIt had become increasingly apparent that all was not rosy at this one-time growth darling of the banking sector. It seems that quantity over quality had been behind past growth, and rising bad debts have painfully exposed weaknesses in the company's business model and strategy. However, a new management team is confident the bank's problems are fixable and that \"there is a strong business at the heart of the Group\" . \nCity analysts appear to share the view that StanChart can get back on track. Earnings forecasts for next year put the company on a bargain-basement P/E of 8.9 at a share price of 725p. This has to be a call on management delivering the turnaround, but, with such a low P/E offering a wide margin of safety, I rate StanChart as a buy for braver investors looking for a recovery stock with big upside potential over the longer term. \nBurberry \nAt 1,350p, Burberry's shares are down 30% from their 52-week high made in February. Like StanChart, Burberry had suffered from negative investor sentiment ahead of the recent market sell-off. While the iconic British fashion house hasn't seen the earnings falls the bank has suffered, weakness in Asia has led investors to question the high earnings rating Burberry was previously afforded. \nCity analysts expect only minimal earnings growth for the current year, but are optimistic Burberry will kick on again next year, with the consensus being for a 10% rise in EPS. The hefty decline in the shares has seen the current-year forecast P/E come down to 17, falling to 15.5 next year. For a company with such strong brands, I would say the stock is in buy territory on these ratings. \nHowever, only one of the companies I've discussed in this article has made it into an elite group of five stocks identified by our analysts as the Footsie's top businesses with superior long-term prospects in this FREE Motley Fool report . \nOur analysts are confident these five firms have what it takes to deliver outstanding performance for investors through thick and thin. In fact, such is their conviction about the quality of these businesses that they've called the report \" 5 Shares To Retire On \". \nYou can download this free no-obligation report right now -- simply click here . \nG A Chester has no position in any shares mentioned. The Motley Fool UK owns and has recommended Unilever. The Motley Fool UK has recommended Burberry. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-26T14:15:00.000+03:00", "crawled": "2015-08-26T14:43:05.235+03:00", "highlightTitle": ""}