{"organizations": [], "uuid": "e990aea6b37cbb25680d5ca45b119d7fc3e1effb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/AHvHBywWNSho3aNkYrvkOg--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/10a0c5057396cdb9b7563cf91187250d895535d6_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/malaysias-sime-darby-q4-profit-094825714.html", "country": "GB", "title": "Malaysia's Sime Darby Q4 profit sinks 17 percent", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Malaysia's Sime Darby Q4 profit sinks 17 percent", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T12:48:00.000+03:00", "replies_count": 0, "uuid": "e990aea6b37cbb25680d5ca45b119d7fc3e1effb"}, "author": "", "url": "https://uk.finance.yahoo.com/news/malaysias-sime-darby-q4-profit-094825714.html", "ord_in_thread": 0, "title": "Malaysia's Sime Darby Q4 profit sinks 17 percent", "locations": ["Malaysia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sime Darby"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 26, 2015, 10:55 BST - UK Markets close in 5 hrs 35 mins Malaysia's Sime Darby Q4 profit sinks 17 percent AFP – 7 minutes ago View Photo \n\nMalaysian conglomerate Sime Darby Wednesday reported a 17 percent year-on-year fall in net profit in the fourth quarter due to a plunge in commodity prices and poor sales of vehicles and industrial equipment in key markets like China. \nThe world's largest listed palm oil producer by acreage said net profit for April-June was 988.7 million ringgit ($233.30 million), compared with 1.2 billion ringgit in the same quarter last year. \nSime Darby, which is also involved in property and the industrial and hospital sectors, said quarterly revenue rose 2.80 percent year-on-year to 12.86 billion ringgit. \n\"The Group continued to be adversely impacted by bearish commodity prices and volatile market conditions in the period under review,\" its chief executive Bakke Salleh said in a statement. \n\"Crude palm oil and coal prices have been on a downward trend and the challenging business environment has resulted in subdued demand in most of our business activities, thus culminating in a weaker set of earnings.\" \nThe price of crude palm oil, which has fallen by about 16 percent year-to-date, is currently below 2,000 ringgit per tonne. \nPlummeting oil and other commodity prices have had a serious impact on Malaysia's growth prospects and government revenues. \nThe economy grew at its slowest pace in nearly two years in April-June at 4.9 percent, down from 6.5 percent in the same period last year, as both exports and private consumption weakened. \nFor the full financial year Sime Darby recorded a 2.3 billion ringgit net profit, down 31 percent from the previous financial year. \nThe multinational conglomerate said it expects to face major headwinds on the back of an economic slowdown, particularly in China where it operates. \n\"The challenging business climate is expected to continue amid an environment of economic stagnation... the weak outlook for commodity prices coupled with cautious consumer spending and stricter monetary policies will be some of the major headwinds that the group is expected to face,\" Sime Darby said. \nMalaysia and Indonesia together account for 85 percent of global palm oil production.", "external_links": [], "published": "2015-08-26T12:48:00.000+03:00", "crawled": "2015-08-26T12:56:21.397+03:00", "highlightTitle": ""}