{"organizations": [], "uuid": "f932242950126284d8ad27676e1b98fa81c8f700", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508280292.html", "country": "US", "title": "Zimbabwe: President Signs Labour Act", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: President Signs Labour Act", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T11:06:00.000+03:00", "replies_count": 0, "uuid": "f932242950126284d8ad27676e1b98fa81c8f700"}, "author": "", "url": "http://allafrica.com/stories/201508280292.html", "ord_in_thread": 0, "title": "Zimbabwe: President Signs Labour Act", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Rare Anteater Dies of Burn Wounds \nThe Supreme Court ruling resulted in over 25 000 employees losing their jobs. The Act under Transitional provision in Section 18 provides for compensation for workers whose contracts of employment were terminated on or before July 17. Section (4a) of the new law prohibits employers from terminating a contract of employment on notice unless termination is in terms of an employment code or model code, or the employer and employee agree in writing to the termination of the contract. \nSection 12C also states that employers who wish to terminate a contract of employment of any employee or employees must give written notice of their intention to a works council or in its absence an employment council for the industry and in its absence to the Retrenchment Board. The employer will also be required to provide the works council, employment council or the Retrenchment Board as the case may be with details of every employee whom the employer wishes to retrench and of the reasons for the proposed retrenchment. \nSection 12c (2) then states that; \"Unless better terms are agreed between the employer and employees concerned or their representatives, a package (hereinafter called the minimum retrenchment package) of not less than one month's salary for every two years of service as an employee (or the equivalent lesser proportion of one month's salary or wages for a lesser period of service) shall be paid by the employer as compensation for the loss of employment no later than date when the notice of termination of employment takes effect.\" \nIf any employer alleges incapacity to pay the minimum retrenchment package timeously or at all, they may write seeking exemption from the employment council or the Retrenchment Board. Zimbabwe \nZimbabwe Coaches Union president Moses Chunga believes his former Warriors teammate and Highlanders great Willard … see more » Copyright © 2015 The Herald. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-28T11:06:00.000+03:00", "crawled": "2015-08-28T11:31:10.695+03:00", "highlightTitle": ""}