{"organizations": [], "uuid": "6a66ff39fcc378d2920183484300ffba813db412", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/31/bankofamerica-moynihan-idUSL1N10B2QP20150731", "country": "US", "title": "BofA likely to hold vote this year on Moynihan chairmanship- source", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "BofA likely to hold vote this year on Moynihan chairmanship- source | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T01:17:00.000+03:00", "replies_count": 0, "uuid": "6a66ff39fcc378d2920183484300ffba813db412"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/31/bankofamerica-moynihan-idUSL1N10B2QP20150731", "ord_in_thread": 0, "title": "BofA likely to hold vote this year on Moynihan chairmanship- source", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, July 31 Bank of America is likely to hold a shareholder vote this year to determine whether Chief Executive Brian Moynihan should be allowed to retain his title of chairman of the bank's board, a person familiar with the matter said on Friday.\nIn October, Moynihan was named chairman in addition to CEO, a move that angered some investors. Many corporate governance advocates argue that CEOs should not head their boards, to ensure that directors offer sufficiently independent oversight.\nBank of America announced just before its annual meeting in May that it would allow shareholders to hold a vote on whether Moynihan should retain the chairmanship.\nThe bank at the time said the vote would take place no later than its 2016 annual meeting. In a proxy filing on Friday, Bank of America disclosed that shareholders of record on Aug. 10 would be able to vote on the matter in a special meeting, but did not give a specific date.\nThe bank did not give a specific date because the Securities and Exchange Commission must first review the proxy, the person familiar with the matter said. An SEC spokeswoman had no immediate response.\nIf shareholders vote not to allow Moynihan to keep both titles, the board will \"promptly implement a plan to transition from the current board leadership structure to an independent chairman structure,\" the proxy said on Friday. (Reporting by Dan Freed; Editing by Dan Wilchins and Jonathan Oatis)", "external_links": [], "published": "2015-08-01T01:17:00.000+03:00", "crawled": "2015-08-01T00:46:14.627+03:00", "highlightTitle": ""}