{"organizations": [], "uuid": "8ed7757d900fd95fd0426506775533548e6452eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-targetukfocus/?format=rss", "section_title": "Finance News | Reuters - UK Focus - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/promontory-pay-15-mln-n-191418868.html", "country": "US", "title": "Promontory to pay $15 mln to N.Y. over work for Standard Chartered", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Promontory to pay $15 mln to N.Y. over work for Standard Chartered", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T00:06:00.000+03:00", "replies_count": 0, "uuid": "8ed7757d900fd95fd0426506775533548e6452eb"}, "author": "", "url": "https://uk.finance.yahoo.com/news/promontory-pay-15-mln-n-191418868.html", "ord_in_thread": 0, "title": "Promontory to pay $15 mln to N.Y. over work for Standard Chartered", "locations": ["N.Y."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Aug 18, 2015, 22:14 BST - UK Markets closed Promontory to pay $15 mln to N.Y. over work for Standard Chartered Reuters - UK Focus – 8 minutes ago \n(Adds other firm settlements, legal hook.) \nBy Karen Freifeld \nNEW YORK, Aug 18 (Reuters) - Consulting firm Promontory Financial Group LLC has agreed to pay $15 million to New York's banking regulator and refrain from certain new business with state-regulated banks for six months after being accused of whitewashing a report about sanctions compliance at Standard Chartered Bank. \nThe Washington, D.C.-based firm, a prominent advisor to financial firms, also agreed to take action to combat conflicts of interest among \"shadow regulators,\" consultants government agencies rely on to investigate misconduct although they are paid by targeted institutions. \nPromontory is the third consulting firm to settle with the New York Department of Financial Services over an alleged lack of independence in reports on bank transactions subject to U.S (Other OTC: UBGXF - news ) . sanctions against Iran and other countries. \nDeloitte LLP and PricewaterhouseCoopers signed agreements in 2013 and 2014, respectively. \nPromontory is headed by Eugene Ludwig, a former comptroller of the currency, and its board includes former chairs of the U.S. Securities and Exchange Commission. \n\"We are glad to have resolved this matter,\" Ludwig said in a statement on Tuesday. \"We remain committed to quality and integrity in carrying out our work.\" \nThe New York regulator said on Aug. 3 that Promontory \"made changes to 'soften' and 'tone down' the language used\" in its 2010-11 reports on Standard Chartered (HKSE: 2888.HK - news ) . It (Other OTC: ITGL - news ) also said Promontory executives lacked credibility in depositions. \nAs a result, the regulator said, it would not allow Promontory access to the confidential bank information needed to perform most work for New York-regulated banks. \nAt the time, Promontory said the agency \"willfully misconstrued\" its work based on \"a handful of emails taken out of context.\" The firm vowed to go to court to challenge the agency's decision. \nThe settlement was reached before any action was filed. \nAs part of the deal, Promontory agreed that its actions with Standard Chartered did not meet the department's current requirements for consultants. \nThe firm also agreed to document in future reports to the regulator any changes that were made at the suggestion of a client or client's counsel. \nUnlike Deloitte and PwC's settlements, however, the Promontory agreement does not say the firm failed to demonstrate the necessary objectivity and autonomy the department now requires. \nAnthony Albanese, acting superintendent of the state Department of Financial Services, said in a statement Tuesday that the agency would continue to \"address conflicts of interest at consulting firms.\" \nWATERED-DOWN REPORT \nIn June 2013, Deloitte LLP agreed to pay New York $10 million and refrain from certain business for a year over a \"watered-down\" report it provided on transactions at Standard Chartered. \nLast summer, PwC agreed to a $25-million penalty and two-year suspension from certain business amid allegations of improper influence in its work for Bank of Tokyo-Mitsubishi UFJ. \nNew York's power in the matter stems from a state banking law that gives the department superintendent sole discretion and authority to allow banks to share confidential information with third parties such as consultants, according to Daniel Alter, former general counsel at the agency. \nThe superintendent must decide whether it is in the public interest and the interest of justice to do so, Alter said in an interview. \nAlter has been credited with coming up with the legal hook to crack down on the consulting industry. He left the agency earlier this year. \nStandard Chartered has paid nearly $1 billion in recent years to settle with state and federal regulators over its handling of U.S. sanctions against Iran and other countries, and it is still under scrutiny. Promontory also did work for the bank as part of that ongoing probe, a source told Reuters earlier this month. (Reporting By Karen Freifeld; Editing by Bernard Orr and Frances Kerry)", "external_links": [], "published": "2015-08-19T00:06:00.000+03:00", "crawled": "2015-08-19T00:16:52.068+03:00", "highlightTitle": ""}