{"organizations": [], "uuid": "283a469c595a23196177fc1da9de46ef44dbff2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=13676_2253.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/finally-a-sol-decision-focused-on-98045/", "country": "US", "title": "Finally, a SOL Decision Focused On Unjust Enrichment and Inequitable Results", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Finally, a SOL Decision Focused On Unjust Enrichment and Inequitable Results", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T20:43:00.000+03:00", "replies_count": 0, "uuid": "283a469c595a23196177fc1da9de46ef44dbff2e"}, "author": "Bradley Arant Boult Cummings LLP", "url": "http://www.jdsupra.com/legalnews/finally-a-sol-decision-focused-on-98045/", "ord_in_thread": 0, "title": "Finally, a SOL Decision Focused On Unjust Enrichment and Inequitable Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This week, the First District Court of Appeals joined the Fourth District Court of Appeals in holding that Florida’s five-year statute of limitation (SOL), under Fla. Stat. § 95.11(2)(c), did not bar the lender’s second foreclosure action. In Nationstar Mortgage, LLC v. Brown , decided on August 24, 2015, the First District Court held that the lender’s second foreclosure action, filed in 2012, was not barred by the 5-year SOL even though the lender had accelerated the debt in 2007. In the Court’s opinion, the Court relies heavily on Singleton v. Greymar Assoc. , specifically noting the concern addressed by Singleton , of avoiding unjust enrichment to the borrowers and infringing upon the lenders’ remedies. In fact, the Court notes the lower court’s judgment results in the borrowers being released from their entire indebtedness, even though the sum of the installment payments not made during the limitations period represents only a fraction of the total debt.” \nFurther, the Court finds support for its decision in the terms of the note and mortgage, which contained provisions “reflecting the parties’ agreement that the mortgagee’s forbearance or inaction do not constitute waivers or release appellees from their obligation to pay the note in full.”’ arguments that the lenders should be barred from bringing a new foreclosure action. \nThe Court also addresses the “with prejudice” and “without prejudice distinction that was at the crux of the Deutsche Bank Trust Co. v. Beauvais decision, by finding no distinction at all. Rather, the Court states that a dismissal without prejudice, which was the case before it, only heightened the need to preserve the lender’s right to file a new foreclosure action. Accordingly, the Court held that after the dismissal, “the parties returned to the status quo that existed prior to the filing of the dismissed complaint.” Finally, the Court takes Beauvais to task by recognizing that its decision is contrary to the overwhelming weight of authority.”", "external_links": [], "published": "2015-08-27T20:43:00.000+03:00", "crawled": "2015-08-27T20:54:03.916+03:00", "highlightTitle": ""}