{"organizations": [], "uuid": "1f4598812fa72b46639b28be64a2d4b94ad68d12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.examiner.com", "main_image": "http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/49/fa/49fa3601b8de85c62bb7f87df5e96afe.jpg?itok=YNSJA-CM", "site_section": "http://rss.examiner.com/rss/Business_and_Finance-Channel.rss", "section_title": "Examiner Business & Finance Channel Articles", "url": "http://www.examiner.com/article/volkswagen-has-had-a-massive-recall-due-to-potentially-faulty-airbags?cid=rss", "country": "US", "title": "Volkswagen has had a massive recall due to potentially faulty airbags", "performance_score": 0, "site": "examiner.com", "participants_count": 1, "title_full": "Volkswagen has had a massive recall due to potentially faulty airbags", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T06:25:00.000+03:00", "replies_count": 0, "uuid": "1f4598812fa72b46639b28be64a2d4b94ad68d12"}, "author": "Harold Mandel, Syracuse Business News Examiner", "url": "http://www.examiner.com/article/volkswagen-has-had-a-massive-recall-due-to-potentially-faulty-airbags?cid=rss", "ord_in_thread": 0, "title": "Volkswagen has had a massive recall due to potentially faulty airbags", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Volkswagen has had a massive recall due to potentially faulty airbags Use your key for the next article Volkswagen Pixabay/Free photo \nVolkswagen owners have not been very happy to hear of a large recall. Car and Driver reported on Aug. 14, 2015, Volkswagen has recalled 420,000 cars due to potentially faulty airbags. According to filings which were made with the National Highway Traffic Safety Administration Volkswagen is concerned about driver’s-side front airbags that may fail to deploy in a crash. \nThe Volkswagen models which have been affected by this large recall include the 2010–2014 Volkswagen CC, Tiguan, and Passat; 2010–2013 Jetta and Eos; 2011-2014 GTI and Golf; and the 2011–2013 Jetta SportWagen. It has been discovered that the airbag clock spring may tear due to debris which has collected and disable the power of the airbag. The airbag clock spring is made up of a spiraled cable which allows electrical components within the steering wheel to continue to function as the wheel is being turned. \nAn investigation into this issue was opened up by NHTSA in March after nine reports of cable failures were received. This results in radio controls and other steering-wheel-located functions located in the steering wheel being disabled. There is no association between this recall and the issue with Takata airbags. Dealers are anticipated to repair the cars at a later date however Volkswagen has not yet specified what the exact remedy will be or a timeline for repairs. \nUSA Today reports Volkswagen has recalled hundreds of thousands of cars due to air bag issues. Volkswagen says the firm is working on a solution to this serious problem. Owners of Volkswagens will see a warning light for the air bag if the car is at risk for this problem. As of this time there have not been any injuries or deaths reported in association with this issue. Suggested Links", "external_links": [], "published": "2015-08-15T06:25:00.000+03:00", "crawled": "2015-08-15T06:56:52.672+03:00", "highlightTitle": ""}