{"organizations": ["Transfield"], "uuid": "bf38900c1912bc43d0bd2d982bb6c91a402134a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/transfield-run-clean-fy16-050808443.html", "country": "GB", "title": "Transfield to run 'clean' in FY16", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Transfield to run 'clean' in FY16", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T08:08:00.000+03:00", "replies_count": 0, "uuid": "bf38900c1912bc43d0bd2d982bb6c91a402134a5"}, "author": "", "url": "https://au.finance.yahoo.com/news/transfield-run-clean-fy16-050808443.html", "ord_in_thread": 0, "title": "Transfield to run 'clean' in FY16", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thu, Aug 27, 2015, 3:57 PM AEST - Australia Markets close in 3 mins. Transfield to run 'clean' in FY16 AAP – 49 minutes ago Print \nDetention centre operator and infrastructure firm Transfield Services expects underlying earnings to remain flat but without a repeat of the one-off costs that hit this year's bottom line. \nTransfield reported an 11.6 per cent drop in full year profit to $48.6 million for the 12 months to June 30, largely because of $36 million in costs relating to legacy contracts and the writing off of debt in North America. \nChief executive Graeme Hunt said Transfield now expects to run \"clean\" without those sort of costs. \nUnderlying earnings are forecast to be similar to its $265.3 million for 2014/15, which were up 22.4 per cent and in line with the company's earlier guidance. \n\"In the past, there have been asset sales which have contributed to the bottom line. This is a result that is completely reliant on the operating performance of the business,\" said Mr Hunt. \n\"It's the strongest one, so far as I can see, probably since the company has listed.\" \nDespite boosting its cash reserves and paying down net debt by more than $200 million over the past 18 months, Transfield did not pay a dividend. \n\"The board would like the debt to come down a little bit more,\" Mr Hunt said. \n\"We'll have a look at where the company stands in term of balance sheet and cash generation capacity at the half year. With a bit of uncertainty in the market, it was just viewed as judicious and conservative.\" \nChief financial officer Vince Nicoletti said the company was \"in the zone where we could consider a dividend\". \nShares in Transfield rose as much 14.5 cents during the day before falling back to $10.55 at 1445 AEST, still up 4.98 per cent or five cents on Wednesday's close. \nResources and industrial revenue fell 20.5 per cent to $761.3 million, while infrastructure revenue was down 3.4 per cent to $1.062 billion, but those were more than offset by a 29.5 per cent increase in defence, social and property - which includes its contract for Australia's offshore detention centres - to $1.556 billion. \nTRANSFIELD SITS TIGHT \n* Net profit down 11pct to $48.6m \n* Revenue up 1.3pct to $3.797b \n* No dividend", "external_links": [], "published": "2015-08-27T08:08:00.000+03:00", "crawled": "2015-08-27T08:58:28.773+03:00", "highlightTitle": ""}