{"organizations": [], "uuid": "7947e71cdfd0eae50fbe02d5e7f9f2ac6db6de38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29825651/paylink-payment-plans-connects-to-fi-express-online-aftermarket-insurance-provider-network", "country": "US", "title": "PayLink Payment Plans Connects to F&I Express Online Aftermarket Insurance Provider Network", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "PayLink Payment Plans Connects to F&I Express Online Aftermarket Insurance Provider Network - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T23:57:00.000+03:00", "replies_count": 0, "uuid": "7947e71cdfd0eae50fbe02d5e7f9f2ac6db6de38"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29825651/paylink-payment-plans-connects-to-fi-express-online-aftermarket-insurance-provider-network", "ord_in_thread": 0, "title": "PayLink Payment Plans Connects to F&I Express Online Aftermarket Insurance Provider Network", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "F&I Express leads the charge to digitize automotive aftermarket insurance sales processes\nDallas, Texas\nF&I Express® today announced it has added PayLink Payment Plans to the largest online network of aftermarket F&I product providers.\nF&I Express has aggregated aftermarket insurance provider product information online to make the automotive retail F&I process more efficient for dealers and their customers.\nPayLink Payment Plans, the nation’s leading vehicle service contract payment processing provider, creates payment plan solutions that are tailored to auto dealerships’ unique business requirements.\n“PayLink Payment Plans is a recognized leader in VSC financing and payment processing,” said Brian Reed, President and CEO of F&I Express. “Inclusion of PayLink Payment Plans to the F&I Express network will now allow its many dealers a responsive payment financing and the best-in-class solution for vehicle service contract providers. This is another important step forward in our efforts to help the auto industry bring more F&I processes online.”\nJoining the F&I Express network will help PayLink reach current and potential automotive retail clients more quickly and effectively.\n“With F&I Express as the digital connection for all aftermarket F&I needs, we are excited to integrate within their platform,” said Rebecca Howard, CEO of PayLink Payment Plans. “We are committed to applying our extensive industry expertise and technology resources to dealers and look forward to integration with F&I Express.”\nABOUT F&I EXPRESS\nIntersection Technologies Inc. - F&I Express® is the leading technology and solutions provider to the automotive F&I industry. The F&I Express eContracting network enables aftermarket providers and agents the ability to increase their dealer clients’ CSI ratings by providing a faster and error-free process to eRate, eContract, and eRegister all of their aftermarket products on one platform. The ExpressRecoveriesSM program helps auto finance sources improve recoveries and compliance for ancillary product cancellations. The CompliPriceSM solution ensures automotive dealerships are compliant with their aftermarket product pricing. For more information about our innovative technologies, please visit http://www.fandiexpress.com/ or follow us on Twitter @fandiexpress\nABOUT PAYLINK PAYMENT PLANS\nPayLink Payment Plans is a financial services firm that specializes in providing interest free financing for the purchase of vehicle service contracts and other F&I products when purchased outside of the auto loan. PayLink Payment Plans financing plans allow consumers to pay for VSCs in monthly installments, which is a critical driver of sales of VSCs and other F&I products. Over the years, PayLink Payment Plans has built strong partnerships with their clients: Dealers of all sizes selling new and pre-owned vehicles, independent vehicle service contract marketers, service contract administrators and highly-rated insurance companies. Based in Chicago, IL, PayLink Payment Plans finances programs throughout the United States. Additional information can be found at http://www.paylinkdirect.com/\n //www.prweb.com/releases/2015/08/prweb12910389.htm\n ", "external_links": ["http://www.fandiexpress.com/", "http://www.prweb.com/releases/2015/08/prweb12910389.htm", "http://www.paylinkdirect.com/"], "published": "2015-08-18T23:57:00.000+03:00", "crawled": "2015-08-18T23:07:00.760+03:00", "highlightTitle": ""}