{"organizations": [], "uuid": "6a80f40531ab619640afef89ec9be69951984eaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-reuters/?format=rss", "section_title": "Finance News | Reuters - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/oil-near-6-1-2-012750539.html", "country": "GB", "title": "Oil near six-and-a-half-year lows as China economy fears linger", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Oil near six-and-a-half-year lows as China economy fears linger", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T04:29:00.000+03:00", "replies_count": 0, "uuid": "6a80f40531ab619640afef89ec9be69951984eaf"}, "author": "", "url": "https://uk.finance.yahoo.com/news/oil-near-6-1-2-012750539.html", "ord_in_thread": 0, "title": "Oil near six-and-a-half-year lows as China economy fears linger", "locations": ["Tokyo", "Kawasaki", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A flame shoots out of a chimney at a petro-industrial factory in Kawasaki near Tokyo December 18, 2014. … \nBy Meeyoung Cho \nSEOUL (Reuters) - Crude oil futures dipped on Wednesday on fears of a hard landing for China's economy despite central bank moves to bolster stumbling growth and concerns about a supply glut. \nU.S. stock futures resumed their descent in early Asian trade and Asian shares were seen on the defensive on Wednesday as monetary easing by China's central bank had limited success in cheering up nervous investors. \nBrent lost 10 cents to $43.11 a barrel as of 0110 GMT after it settled up 52 cents at $43.21 a barrel in the previous session. \nU.S. October crude fell 20 cents to $39.11 a barrel, after finishing the previous session $1.07 higher at $39.31. \nANZ said in a note that China's rate cuts had calmed commodity markets, but they remained cautious and gains would be limited. \n\"The displacement of high cost supply from the United States is taking much longer than expected, and it's likely to keep the market substantially oversupplied in the short term,\" the bank said. \nU.S. crude stocks fell by 7.3 million barrels in the week to Aug. 21 to 449.3 million, compared with analysts' expectations for an increase of 1 million barrels as refinery runs increased, data from industry group the American Petroleum Institute showed on Tuesday. \nOfficial inventory data from the U.S. Energy Information Administration is due on Wednesday. \n\"While the rate of global oil stock build is still set to decline, stocks will build for longer than initially anticipated,\" BNP Paribas said late on Tuesday, \n\"As such, any price improvement will most likely take place from a lower starting point and the pace of any price improvement is likely to be slower than previously assumed.\" \nReuters market analyst for commodities and energy technicals Wang Tao said U.S. oil may retest a support at $37.91 per barrel. \nIran will ramp up crude oil production and reclaim its lost share of exports shortly after international sanctions on the OPEC member are lifted, Iran's oil minister Bijan Zanganeh said on Tuesday. \nNigeria plans to export a total of at least 2.04 million barrels per day (bpd) of crude oil in October, the highest level this year, according to provisional loading programmes. \nWith oil falling further, support is growing among non-Gulf members for action and even some Gulf officials are concerned about the latest drop in prices. Policymakers in top OPEC producer Saudi Arabia have remained publicly silent. \n(Reporting by Meeyoung Cho; Editing by Richard Pullin)", "external_links": [], "published": "2015-08-26T04:29:00.000+03:00", "crawled": "2015-08-26T04:45:58.346+03:00", "highlightTitle": ""}