{"organizations": ["World Bank Guarantee For Sankofa Gas", "World Bank Guarantee"], "uuid": "9a8d8f651585e325260fa9a35b867604355e42a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/x8p0sfe66m_dollars.gif", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/633745/1/700m-world-bank-guarantee-for-sankofa-gas.html", "country": "US", "title": "$700m World Bank Guarantee For Sankofa Gas", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "$700m World Bank Guarantee For Sankofa Gas", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T12:29:00.000+03:00", "replies_count": 0, "uuid": "9a8d8f651585e325260fa9a35b867604355e42a3"}, "author": "", "url": "http://www.modernghana.com/news/633745/1/700m-world-bank-guarantee-for-sankofa-gas.html", "ord_in_thread": 0, "title": "$700m World Bank Guarantee For Sankofa Gas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  3 August 2015 10:29 CET $700m World Bank Guarantee For Sankofa Gas By Daily Guide \nThe World Bank recently approved a record investment of $700 million in guarantees for Ghana's Sankofa Gas Project which will help address the country's drastic energy shortfall through the development of new sources of clean and affordable natural gas. \nThe board approved a unique combination of two guarantees for the Project - an IDA Payment guarantee of $500 million that supports timely payments for gas purchases by Ghana National Petroleum Corporation (GNPC), and an IBRD Enclave Loan guarantee of $200 million that enables the project to secure financing from its private sponsors. \nThe guarantees are expected to mobilize $7.9 billion in new private investment for offshore natural gas, representing the biggest Foreign Direct Investment (FDI) in Ghana's history. \nGhana has suffered macroeconomic shocks in recent years partly due to challenges in the country's power sector. \nA combination of water shortage for hydropower, erratic gas supplies from external sources and delays in the development of domestic gas resources and new power plants have led to frequent power outages that have affected the poor the most. \nGovernment has spent more than $500 million on fuel subsidies in the power sector in recent years, significantly draining public resources. \nDevelopment of the Sankofa Gas Project, located 60 kilometres offshore is expected to significantly benefit Ghana by fueling up to 1,000 megawatts of clean power generation to replace polluting and expensive oil-burning electricity. \nOnce the Sankofa field starts to produce gas in early 2018, Ghana will be able to reduce its oil imports by up to 12 million barrels a year and cut carbon emissions by 1.6 million metric tons of CO2 annually. \n'The Sankofa Gas Project is a good example of how Africa can address its infrastructure challenges and lay the foundation for sustained economic growth by providing affordable and reliable power to its population,' said Makhtar Diop, Vice President for the World Bank's Africa Region . \n' Innovative use of the bank's Guarantee Programme that helps mitigate the perception of risk and mobilizes private investment can help unlock billions of much-needed financing for large-scale infrastructure projects on the continent.' \nFinance Minister Seth Terkpersaid the project is a game-changer for Ghana and other middle income sub-Saharan African countries, as it would help shape the country's energy sector for the next 20 years. \nThe exploration and commercialization of the gas will be carried out by two private investors, Eni of Italy and Vitol Group of the Netherlands in close partnership with Ghana National Petroleum Corporation (GNPC). \nA business desk report", "external_links": [], "published": "2015-08-03T12:29:00.000+03:00", "crawled": "2015-08-03T13:01:55.211+03:00", "highlightTitle": ""}