{"organizations": [], "uuid": "5dfcd82286d4eb64aea7587d61f5e70a8409ee63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29825640/pira-energy-groups-weekly-natural-gas-power-and-coal-market-recap-for-the-week-ending-august-17th-2015", "country": "US", "title": "PIRA Energy Group's Weekly Natural Gas, Power and Coal Market Recap for the Week Ending August 17th, 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "PIRA Energy Group's Weekly Natural Gas, Power and Coal Market Recap for the Week Ending August 17th, 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T23:57:00.000+03:00", "replies_count": 0, "uuid": "5dfcd82286d4eb64aea7587d61f5e70a8409ee63"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29825640/pira-energy-groups-weekly-natural-gas-power-and-coal-market-recap-for-the-week-ending-august-17th-2015", "ord_in_thread": 0, "title": "PIRA Energy Group's Weekly Natural Gas, Power and Coal Market Recap for the Week Ending August 17th, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Return of Japanese Nuclear Capacity, Surging Asian LNG Supply, and the Weakness of Crude Prices Does Not Bode Well for Atlantic Basin Flows to Asia, while There Is Now a Distinct Possibility that German Power for 2016 or 2017 Can Fall Below 30/MWh\nNew York, NY\nNYC-based PIRA Energy Group believes that the return of Japanese nuclear capacity, surging Asian LNG supply, and the weakness of crude prices does not bode well for Atlantic Basin flows to Asia. In the U.S., the upcoming Bidweek cycle encompassing settlement of the September NYMEX contract looks especially prone to take the brunt of potentially bearish Henry Hub price fireworks. In Europe, The next two weeks mark the lowest demand point of the year for European gas. Specifically, PIRA’s analysis of natural gas market fundamentals has revealed the following:\nGlobal LNG Fundamentals Scorecard\nThe return of Japanese nuclear capacity, surging Asian LNG supply, and the weakness of crude prices does not bode well for Atlantic Basin flows to Asia. The broader compression of Asian spot prices at the high end against Henry Hub at the low end strongly implies shorter haul LNG trade and lower prices.\nBearish HH September Bidweek Fireworks Ahead?\nDespite sequentially faltering domestic production and robust electric generation (EG) gas burns, high absolute storage levels facing near-term gas balances continue to pose bearish price risks. As in 2012, the upcoming Bidweek cycle encompassing settlement of the September NYMEX contract looks especially prone to take the brunt of potentially bearish Henry Hub (HH) price fireworks.\nEuropean Gas Price Scorecard\nThe next two weeks mark the lowest demand point of the year for European gas. Combine it with this period also being the high point for holidays in Europe and we caution clients not to read too much into any price movements as sustainable indicators in the weeks ahead. Friday's close below 40p/th for Sept. 2015 was the first in over a year and the bias remains to the downside in the weeks to come. We do not believe in large amounts of downside risk on the prompt spot contracts, but we do see larger risks for the winter and summer strips ahead, which are more loosely tied to a falling ceiling on contract gas tied to lower oil prices.\nFlatter North American Gas Supply Curve\nThe North American natural gas supply curve continues to look flatter. We still believe that there will be an uptick in price as the US passes through its demand surge and LNG and industrial projects start up, but the extent of the inflation adjusted run-up post-2020 has been reduced as the resource base expands and productivity improves. We are also increasingly concerned that U.S. LNG projects will find it difficult to recover full costs plus a return in an increasingly competitive market.\nNYC-based PIRA Energy Group believes that there is now a distinct possibility that German power for 2016 or 2017 can fall below 30/MWh. In the U.S., on-peak prices increased from June in most markets, but despite stronger cooling loads, prices were down year-on-year in all markets. Specifically, PIRA’s analysis of electricity and coal market fundamentals has revealed the following:\nFrom \"Commodity Play\" to \"Capacity Play\"\nCan German power for 2016 or 2017 fall below 30/MWh? This drop is now a distinct possibility, especially considering the extraordinary weakness in the seaborne coal market, with further slides in API#2 coal prices quite likely, especially as China is devaluating its currency.\nEastern Grid/ERCOT Market Forecast\nOn-peak prices increased from June in most markets, but despite stronger cooling loads, prices were down year-on-year in all markets as gas prices averaged ~30% lower in the Southeast and Midwest, and ~50% lower in Appalachian basin. Eastern grid (U.S.) loads increased by 6% year-on-year in July with ERCOT 7.5% higher. Gas-fired generation in the two interconnects rose by 30% and 21%, respectively, as coal declined in response to lower gas prices and unit retirements. High storage and Appalachian basin production growth offset the impact of strong power sector demand on gas prices, and near term risks favor the downside. Power price forecasts have been revised down through mid 2016 due to downward revisions to PIRA’s gas price projections and changes in unit commitment and dispatch logic.\nChina Softness Spook Coal Prices Lower\nCoal prices again moved lower this week, with the weak economic numbers coming out of China along with a devaluation of the yuan causing downward pressure to the market. FOB Newcastle prices generally declined by the largest extent with the devaluation of the yuan the latest in a string of developments that make Australian coal more expensive relative to domestically-produced coal in China. With Chinese imports continuing to fall as sharply as they have over the past year, there is little hope of a recalibration in seaborne balances and by extension pricing.\nThe information above is part of PIRA Energy Group's weekly Energy Market Recap - which alerts readers to PIRA’s current analysis of energy markets around the world as well as the key economic and political factors driving those markets.\nClick here for additional information on PIRA’s global energy commodity market research services.\nCONTACT:\nPIRA Energy Group\n3 Park Avenue, 26th Floor\nNew York, NY 10016\n212-686-6808\nsales(at)pira(dot)com\n //www.prweb.com/releases/2015/08/prweb12911055.htm\n ", "external_links": ["http://www.pira.com/", "http://www.prweb.com/releases/2015/08/prweb12911055.htm", "http://www.pira.com/Insights#EMR"], "published": "2015-08-18T23:57:00.000+03:00", "crawled": "2015-08-18T23:07:02.211+03:00", "highlightTitle": ""}