{"organizations": ["MasTec"], "uuid": "7b64c7240534ceb8f4afbf3bbf64854206333ae3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=MTZ", "section_title": "Yahoo! Finance: MTZ News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125kpn6aa/*http://www.noodls.com/view/449B14C8E506FADD31AE939522B5262ECDCA7C89", "country": "US", "title": "MasTec Schedules Second Quarter 2015 Earnings Release and Conference Call", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "MasTec Schedules Second Quarter 2015 Earnings Release and Conference Call", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T01:09:00.000+03:00", "replies_count": 0, "uuid": "7b64c7240534ceb8f4afbf3bbf64854206333ae3"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125kpn6aa/*http://www.noodls.com/view/449B14C8E506FADD31AE939522B5262ECDCA7C89", "ord_in_thread": 0, "title": "MasTec Schedules Second Quarter 2015 Earnings Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close \nCORAL GABLES, Fla., Aug. 10, 2015 /PRNewswire/ -- MasTec, Inc. (NYSE: MTZ) today announced that it will release results of operations for the quarter ended June 30, 2015 after the market closes on Monday, August 17, 2015. Senior Management will also hold a conference call to discuss these results on Tuesday, August 18, 2015 at 9:00 a.m. Eastern time. \nAs previously announced, the Company will file SEC form 12b-25 to obtain the statutory extension of time to file its form 10-Q until August 17th. \nThe call-in number for the conference call is (913) 312-0416 and the replay number is (719) 457-0820, with a pass code of 3722826. The replay will run for 30 days. Additionally, the call will be broadcast live over the Internet and can be accessed and replayed through the investor relations section of the Company's website at www.mastec.com . \nMasTec, Inc. is a leading infrastructure construction company operating mainly throughout North America across a range of industries. The Company's primary activities include the engineering, building, installation, maintenance and upgrade of energy, utility and communications infrastructure, such as: electrical utility transmission and distribution; natural gas and petroleum pipeline infrastructure; wireless, wireline and satellite communications; power generation, including renewable energy infrastructure; and industrial infrastructure. MasTec's customers are primarily in these industries. The Company's corporate website is located at www.mastec.com . \nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act. These statements are based on management's current expectations and are subject to a number of risks, uncertainties, and assumptions, including the effect of economic conditions on demand for our services, trends in oil, natural gas, electricity and other energy source prices; reduced capital expenditures by our customers, reduced financing availability, customer consolidation and technological and regulatory changes in the industries we serve; market conditions, technological developments and regulatory changes that affect us or our customers' industries; our ability to accurately estimate the costs associated with our fixed price and other contracts, including any material changes in estimates for completion of projects, and performance on such projects; customer disputes related to our performance of services; disputes with, or failures of, our subcontractors to deliver agreed-upon supplies or services in a timely fashion; any material changes in estimates for legal costs or case settlements or adverse determinations on any claim, lawsuit or proceeding; our ability to replace non-recurring projects with new projects; the timing and extent of fluctuations in geographic, weather, equipment and operational factors affecting the industries in which we operate; our ability to attract and retain qualified personnel, key management and skilled employees, including from acquired businesses, and our ability to enforce any noncompetition agreements, integrate acquired businesses within expected timeframes and achieve the revenue, cost savings and earnings levels from such acquisitions at or above the levels projected; any exposure related to divested businesses; any exposure resulting from system or information technology interruptions or data security breaches; the impact of U.S. federal, local or state tax legislation and other regulations affecting renewable energy, electricity prices, electrical transmission, oil and gas production, broadband and related projects and expenditures; the effect of state and federal regulatory initiatives, including costs of compliance with existing and future environmental requirements; increases in fuel, maintenance, materials, labor and other costs; fluctuations in foreign currencies; risks associated with operating in international markets, which could restrict our ability to expand globally and harm our business and prospects or any failure to comply with laws applicable to our foreign activities; the highly competitive nature of our industry; our dependence on a limited number of customers; the ability of our customers, including our largest customers, to terminate or reduce the amount of work, or in some cases, the prices paid for services on short or no notice under our contracts; the impact of any unionized workforce on our operations, including labor availability and relations; liabilities associated with multi-employer pension plans, including underfunding and withdrawal liabilities, for our operations that employ unionized workers; the adequacy of our insurance, legal and other reserves and allowances for doubtful accounts; restrictions imposed by our credit facility, senior notes, and any future loans or securities; our ability to obtain performance and surety bonds; the outcome of our plans for future operations, growth and services, including business development efforts, backlog, acquisitions and dispositions; any dilution or stock price volatility that shareholders may experience in connection with shares we may issue as consideration for earn-out obligations or as purchase consideration in connection with past or future acquisitions, or other stock issuances; as well as other risks detailed in our filings with the Securities and Exchange Commission. Actual results may differ significantly from results expressed or implied in these statements. Other risks include uncertainties related to the Audit Committee's independent investigation described above, including, without limitation: the impact of the investigation on our operations, management and other corporate resources; the costs and expenses of the investigation; the time needed to complete the investigation; whether the Audit Committee's investigation will lead to the discovery of additional accounting errors, whether the investigation will discover any additional material weakness in internal control over financial reporting or discover other adverse facts; unanticipated material issues that could delay the completion of the investigation or cause additional delays in the release and filing of the Company's financial results and periodic financial reports; and possible regulatory action or private party litigation. We do not undertake any obligation to update forward-looking statements. \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/mastec-schedules-second-quarter-2015-earnings-release-and-conference-call-300126426.html \nSOURCE MasTec, Inc. \nJ. Marc Lewis, Vice President-Investor Relations, 305-406-1815, 305-406-1886 fax, marc.lewis@mastec.com", "external_links": [], "published": "2015-08-11T01:09:00.000+03:00", "crawled": "2015-08-11T02:49:31.009+03:00", "highlightTitle": ""}