{"organizations": [], "uuid": "e7003f09c2d66a36d8a46715fa5cf9f4c939c9ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/housingregs07082015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/251330-hud-audit-finds-25000-ineligible-families-in-public-housing", "country": "US", "title": "HUD audit finds 25,000 ineligible families in public housing", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "HUD audit finds 25,000 ineligible families in public housing", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T01:01:00.000+03:00", "replies_count": 0, "uuid": "e7003f09c2d66a36d8a46715fa5cf9f4c939c9ca"}, "author": "mmali@thehill.com (Vicki Needham )", "url": "http://thehill.com/policy/finance/251330-hud-audit-finds-25000-ineligible-families-in-public-housing", "ord_in_thread": 0, "title": "HUD audit finds 25,000 ineligible families in public housing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HUD audit finds 25,000 ineligible families in public housing By Vicki Needham - 08/17/15 06:01 PM EDT \nMore than 25,000 families received government assistance despite exceeding income thresholds, according to a sweeping audit of the Department of Housing and Urban Development’s public housing program. \nOf the 25,226 families, 68 percent or 17,761 receiving public housing assistance had earned more than the qualifying amount for more than a year. \nOf that number 13,388 (53 percent) had income that was up to $10,000 more than HUD’s 2014 income limits and 11,838 (47 percent) had income that was more than $10,000 greater than the income limits. ADVERTISEMENT The review found that HUD will pay $104.4 million over the next year for public housing units occupied by over-income families that otherwise could have been used to house low-income families, leaving many who need help stuck on waiting lists.\nFor example, the New York City Housing Authority said a family in the program since 1988 had exceeded income levels since at least 2009. \nAs of November 2013, the four-person household’s annual income was $497,911, while the low-income threshold was $67,100. \nAs of July 2014, the family paid an income-based ceiling rent of $1,574 a month. \nThe housing authority, did not evict this family from its four-bedroom unit \"because its policy does not require it to evict over-income families because HUD regulations don’t require it,\" the report said. \n\"The authority claimed that evicting over-income families would work against HUD’s efforts to deconcentrate poverty in public housing developments.\" \n“Although it would be reasonable to expect that a minimum number of over-income families would reside in public housing at any time, HUD can significantly reduce the number of over-income families that reside in public housing,” the HUD inspector general’s report said. \nHUD regulations require families to meet eligibility income limits only when they are admitted to the public housing program and they do not limit the length of time that families can stay. \n“We recommend that HUD direct housing authorities to establish policies to reduce the number of over-income families in public housing, thereby putting as much as an estimated $104.4 million to better use by providing those funds to eligible low-income families in need of housing assistance,\" the report said. \nIn 2013, Rep. Phil Roe (R-Tenn.) requested the review, which was done in 2014 and 2015, to examine the number of families residing in government-subsidized housing whose income exceeded current income limits. Tags:", "external_links": [], "published": "2015-08-18T01:01:00.000+03:00", "crawled": "2015-08-18T08:17:31.294+03:00", "highlightTitle": ""}