{"organizations": [], "uuid": "a1c23778c442a8c24e73f81c4dba1bef4547a624", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/regional-office-property-demand-surges-131800982.html", "country": "US", "title": "Regional office property demand surges in second quarter", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Regional office property demand surges in second quarter", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T16:18:00.000+03:00", "replies_count": 0, "uuid": "a1c23778c442a8c24e73f81c4dba1bef4547a624"}, "author": "", "url": "https://uk.finance.yahoo.com/news/regional-office-property-demand-surges-131800982.html", "ord_in_thread": 0, "title": "Regional office property demand surges in second quarter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 14:43 BST - UK Markets close in 1 hr 47 mins Regional office property demand surges in second quarter By Oliver Haill | Sharecast – 25 minutes ago 1,719.00 -20.0000 \nLONDON (ShareCast) - (ShareCast News) - Demand for office space in the UK regions sped 51% higher in the second quarter of the year, which is expected to lead to rental growth and further starts on new development schemes. Bolstered by a solid economic backdrop and the Tory election win, strong occupier demand saw a total of 2.08m sq ft taken up in the three months to the end of June, which was 51% ahead of the first quarter and 49% above the five year quarterly average, according to figures collected by Knight Frank. \nBirmingham was head and shoulders above the rest, with take-up of 0.52m sq ft, almost half from a pre-let to HSBC at the Arena Central mixed use development, being constructed by Galliford Try (LSE: GFRD.L - news ) , where around 1,000 head office roles will move from London before the end of 2018. \n\"Improved occupier confidence has led to a surge in pre-letting activity and high levels of take-up across the main regional office markets in Q2, which we anticipate will be reflected in rental growth and further starts on new development schemes over the next 18 months,\" said Stephen Hodgson, Knight Frank's head of regional offices. \nPre-letting activity increased in the quarter, which Knight Frank said impacted on new and Grade A availability, which was down by 17% year-on-year collectively to 2.2m sq ft. \nHodgson added: \"On the investment front, despite the fact that yields are approaching historic lows we also feel that there is scope for further yield compression.\" Almost £2.1bn of regional office assets were bought and sold, the strongest first six-month period since the financial crisis. \nBristol, Manchester and Birmingham were the main focus of investment activity in the second quarter, accounting for over half of total investment turnover. \nBristol in particular saw some sizeable transactions, including the off-market purchase of the 10 Templeback grade-A waterfront office building by Orchard Street Investment Management in June 2015 for £58.5m, reflecting a net initial yield of 5.34%, and Aviva Investors' acquisition of 66 Queen Square for £32.7m, at a net initial yield of 4.94%.", "external_links": [], "published": "2015-08-21T16:18:00.000+03:00", "crawled": "2015-08-21T16:44:21.792+03:00", "highlightTitle": ""}