{"organizations": [], "uuid": "6aedf5b00a23d46904cdefecb172aa3d72d6a7b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-pensions-retirement/?format=rss", "section_title": "Pensions & Retirement News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/firms-us-dare-suggest-might-155811353.html", "country": "GB", "title": "Firms say to us: how dare you suggest we might go bust?'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Firms say to us: how dare you suggest we might go bust?'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T18:58:00.000+03:00", "replies_count": 0, "uuid": "6aedf5b00a23d46904cdefecb172aa3d72d6a7b8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/firms-us-dare-suggest-might-155811353.html", "ord_in_thread": 0, "title": "Firms say to us: how dare you suggest we might go bust?'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "8.58 -0.41 \nAlan Rubenstein, head of the Pension Protection Fund, talks about rescuing companies, driving hard bargains and investing in farms \nCompanies grumble about paying for the Pension Protection Fund, and it’s no wonder the yearly levy is an unwelcome reminder that their duties to pensioners could one day leave them bankrupt. \nIn just a decade since its foundation, the PPF (Shenzhen: 300258.SZ - news ) has taken responsibility for nearly 223,000 people whose employers can no longer afford their final salary pensions. Its assets now total more than £20bn. \nOnly a handful of pension schemes in the private sector are larger than the PPF, and some in the industry have predicted that it will eventually become the biggest collection of final salary pensioners in the country. \nThe state-backed pensions lifeboat has estimated that British defined benefit pension schemes were £223.1bn in the hole last month, and while this massive sum is volatile, it lays bare the time bomb at the heart of otherwise successful companies. \n“They say, we’re BP, how dare you suggest we might go bust,” said Alan Rubenstein, the PPF’s chief executive. \n“One of the fun things to do at conferences is ask the managers to put their hands up, anybody who think their scheme will go bust in the next year. Not a hand goes up. Ask them whether they think anyone else in the room will go bust in the next year, and 95pc of the hands go up.” \nA quarter of the PPF’s current funding comes from levies on pension schemes that might one day need its help. It (Other OTC: ITGL - news ) charges firms more if they are deemed more at risk. \nMr Rubenstein has plenty of experience in fixing funding crises. Having joined the PPF in April 2009 after a career at Scottish Widows, Morgan Stanley (Xetra: 885836 - news ) and Lehman Brothers, he found that the pensions lifeboat was itself veering towards the rocks. \n“The first board meeting I went to, they said, ‘We’ve always said if were ever in deficit by more than £1bn, we’d have to go back to the government, the game is up, we’ll never get out of it’. The next meeting was with the actuary, who said we had a deficit of £1.2bn.” \nThe PPF has grown from “35 people in a back room borrowed from the Department for Work and Pensions in the old Adelphi building, with a twenty million quid grant from government to see them through the first year” to a staff of more than 300, based in Croydon. \nThe investment team has dug itself part-way out of the funding hole to reach a deficit of £322.3m and falling, and are now focused on finding the sweet spot between safely deploying the funds and ensuring that pension schemes only pay the necessary amount in irritating fees. \nFor pensioners, the PPF means that if their employer collapses, they will be compensated for almost all of their original pension, up to a cap of just over £36,000 a year. \nThe rescued schemes range from small outfits to formerly FTSE-listed organisations. One of the first companies to land on the PPF’s doorstep was the failing car maker MG Rover, and over the years companies such as Jessops, Silentnight and HMV have needed help. The Woolworths pensions also reside within the PPF. It’s the keeper of yesteryear’s high street. \nThe PPF has no obligation to support a firm through a rescue deal that offloads pensions on to its books. In fact, the fund and the Pensions Regulator can watch as a firm goes to the wall if it thinks that rescuing the pensioners out of insolvency will result in a better outcome for them. \n“We’re not obliged to think about whether the chairman’s a friend, but what is the recovery. Because we’ve got a system where the funding is dependent on the assets of the schemes plus the investment returns plus the levy paying the levy is the balance, so every time we intervene, the levy goes up.” \nMonarch Airlines was on the receiving end of the PPF’s bargaining power last year, in a deal that resulted in its rescuer, Greybull Capital, paying £37.5m and handing over 10pc of the firm in order to slip the reins of the firm’s £660m retirement obligations for 2,400 staff. \n“There was a conference call where they made the regulator an offer and I remember the lawyers on their side saying you have to accept this offer… But actually no, we don’t. We can wait until the company’s gone bust, although it’s clearly in everyone’s interests if you can do a reconstruction that keeps the company alive. \n“They came back 24 hours later with a much better deal.” * 'Beware phone calls about pensions' * Euro fall hands state pension boost to expats * Six key questions before you opt for pensions 'drawdown' A spokesman for Monarch declined to comment on the rescue process, but said the PPF was a valuable shareholder. \nMr Rubenstein said a 10pc equity slice was common in a deal like this, although “if it’s one of these pre-packs, meet the new owners, same as the old owners, then we have to ask for 33pc”. \nPre (Shanghai: 600048.SS - news ) -pack administrations, which are used to quickly transfer ownership of a failing company, have come in for criticism for allowing the new owners to walk away from the old firm’s debts. With no time for full due diligence, the PPF protects itself by asking for a larger equity stake in exchange for its help. \n“I think we are always sceptical of pre-packs. We’ve seen vulture-type funds buy into the debt of the lending bank and then, boom, you get a call at 4.59pm on a Friday and yet they’ve definitely got to be open again at 9am or all the value’s lost. \n“People forget that the regulator has the power to investigate these deals there is one of them where exactly that is going on,” he said, declining to name the firm under investigation. \nOnce a scheme has transferred to the PPF, the assets must be managed. The organisation recently brought some of its mandates in-house to save on fees, as it expands its horizons for generating cash to bridge its funding gap. “In the first few years we simply stuck the money in a bank account. At the time it was cash and then government bonds, and just before I arrived we started to think more seriously about hedging liabilities,” said Mr Rubenstein. \nWhile its goals are straightforward 1.8pc return over Libor, year in, year out it has bought into forests, Mancunian real estate and the Dalmore vehicle that is investing in the Thames Tideway to achieve them. \nMr Rubenstein said the team was considering more farms, having watched from the sidelines as the Wellcome Trust snapped up almost 40,000 acres from the Co-op last year. \nThe PPF would also like to expand its holdings in British infrastructure, despite running into difficulties with the Pension Infrastructure Platform (PIP), which it joined as a founding signatory when the Chancellor announced the plan in the 2011 Autumn Statement. \nThe PIP has just achieved its first £1bn of committed funding, having fallen short of its goals and shied away from contributing directly to new construction projects. \nLarge insurance and pension companies can already spend directly on transport and building work, Mr Rubenstein said, while smaller ones are reluctant to dive into a new form of investment. \n“Then you get into the herding cats kind of problem where 10 pension funds had 20 different views on where the money would go. \n“You could say, why do the Canadians buy more projects than us? But they’ve had more practice than us. If you look at their investment landscape, Canadian equities were nowhere near as diversified as in the UK. So in the 1970s and ’80s when we were putting money into the stock market, [Ontario’s investment vehicle] Borealis was investing in infrastructure. \n“Part of us supporting PIP is not for ourselves, but also doing our bit for other pension funds that are kind of scared to get involved.” \nThe PPF aims to have enough money to sustain itself by 2030, no matter how many defined benefit schemes get into trouble in future. There are 11 million final salary pension pots in the UK, and while most companies have switched to defined contribution schemes that place the risk on the employee, there’s a chance that the PPF will still be paying out as we approach the next century. \nThe Government founded the organisation in 2005 and stands ready to intervene again, should its funding situation become dire. However, Mr Rubenstein does not expect the lifeboat to need its own rescue, nor does he see civil servants peering over his shoulder. \n“They get to set remuneration for directors, but the important stuff like what should the levy be, that’s all down to the board, free from governmental input. Clearly we talk to them, but we’re mercifully allowed to get on with things pretty well.” \nThe levy on pension schemes for the next three years will be set in September, with Experian (Other OTC: EXPGF - news ) employed this time to score each scheme on its risk of collapse possibly cutting the amount of grumbles that the PPF hears from pension schemes that have to pay their share.", "external_links": [], "published": "2015-08-22T18:58:00.000+03:00", "crawled": "2015-08-22T22:17:51.654+03:00", "highlightTitle": ""}