{"organizations": [], "uuid": "4181821ad377d5b4aacbe912c482272d76d19cfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.finfacts.ie", "main_image": "", "site_section": "http://www.finfacts.ie/irelandbusinessnews/rss.xml", "section_title": "Finfacts Ireland Business & Finance Portal", "url": "http://www.finfacts.ie/irishfinancenews/article_1028943.shtml", "country": "GB", "title": "Eurozone manufacturing sector continued to expand in July", "performance_score": 0, "site": "finfacts.ie", "participants_count": 0, "title_full": "Eurozone manufacturing sector continued to expand in July", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T09:35:00.000+03:00", "replies_count": 0, "uuid": "4181821ad377d5b4aacbe912c482272d76d19cfb"}, "author": "", "url": "http://www.finfacts.ie/irishfinancenews/article_1028943.shtml", "ord_in_thread": 0, "title": "Eurozone manufacturing sector continued to expand in July", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eurozone manufacturing sector continued to expand in July   editor of Finfacts Aug 4, 2015 - 6:35 AM   \nThe Eurozone manufacturing sector continued to expand at a solid steady pace at the start of the third quarter, as continued growth in the Netherlands, Italy, Spain, Austria and Germany offset the deepest contraction of the Greek manufacturing sector in the survey history. \nAt 52.4 in July, above the earlier flash estimate of 52.2, the final seasonally adjusted Eurozone Manufacturing PMI (purchasing managers' index) held close to June’s 14-month high. The PMI has remained in expansion territory since July 2013. \nThe growth rate of Eurozone manufacturing output matched that registered in June, which was itself in line with March’s ten-month peak. Output was spurred higher by improved inflows of new business from domestic and export clients, despite the rates of increase in total new orders and new export business* easing to the slowest since April and January respectively. \nEmployment rose for the eleventh straight month, reflecting the continued expansion of output in the sector and a slight accumulation of backlogs of work. Growth of output, new orders and employment was registered across the consumer, intermediate and investment goods sectors in July. Rates of improvement were comparatively strong at consumer and investment goods producers, whereas only modest rises were seen in the intermediate goods sector. Cost pressures remained on the upside in July. Input prices rose for the fifth month running, albeit to the weakest extent since April. \nA number of manufacturers reported that the weakened euro was pushing associated costs higher. Meanwhile, selling price inflation remained muted, with only a slight increase in charges reported. \nMarkit said that national PMI data highlighted the impact of the Greek crisis on its domestic economy. Production, new orders, new export orders, employment and purchasing activity all suffered sharp slumps, dropping at the fastest rates since the Greek survey began in May 1999. \nThe Greek PMI reading of 30.2 was substantially worse than its previous record low (37.7 in February 2012). However, there was no conclusive evidence from survey respondents of events in Greece directly impacting operating performance elsewhere in the currency union’s manufacturing sector. The Netherlands and Italy both recorded strong expansions of both production and new business during July. \nSpain also remained a solid performer, despite seeing its rate of expansion cool further, while Austria continued to climb back up the PMI growth league table. Conditions remained comparatively subdued in Germany. The German PMI ticked lower to 51.8, from 51.9 in June, as rates of increase in new orders and output slowed slightly . This partly reflected the first drop in new export business at German manufacturers since January. In contrast, job creation accelerated to a three-month peak. \nThe French PMI slipped back below the 50.0 mark separating expansion from contraction in July, seeing output, new business and employment all decline during the latest survey month. Although France was the only nation apart from Greece to report a decline in any of these variables, rates of contraction were only mild and substantially less marked in comparison. \n*includes intra-Euro Area shipments.", "external_links": [], "published": "2015-08-04T09:35:00.000+03:00", "crawled": "2015-08-04T09:48:24.464+03:00", "highlightTitle": ""}