{"organizations": [], "uuid": "1164818cbe1ba21da618768d5d7f2ed4d79e5dfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/shortage-brickies-carpenters-plasterers-forcing-090908824.html", "country": "US", "title": "Shortage of brickies, carpenters and plasterers forcing building companies to turn down work", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Shortage of brickies, carpenters and plasterers forcing building companies to turn down work", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T12:09:00.000+03:00", "replies_count": 0, "uuid": "1164818cbe1ba21da618768d5d7f2ed4d79e5dfe"}, "author": "", "url": "https://uk.finance.yahoo.com/news/shortage-brickies-carpenters-plasterers-forcing-090908824.html", "ord_in_thread": 0, "title": "Shortage of brickies, carpenters and plasterers forcing building companies to turn down work", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 19, 2015, 10:18 BST - UK Markets close in 6 hrs 12 mins Shortage of brickies, carpenters and plasterers forcing building companies to turn down work By Sophie Jamieson | Telegraph – 9 minutes ago 1,119.4399 -9.5601 \nTwo-thirds of British builders have had to turn down work because they don't have enough skilled tradesmen, a survey has found \nTwo-thirds of British building companies have had to turn down work because they do not have enough skilled tradesmen, according to a survey by the Federation of Master Builders. \nThe trade body for construction firms said that 66pc of its members have had to refuse new business because of a lack of resources while almost half have been forced to outsource work. \nThe bosses of some of Britain’s biggest housebuilding companies have spoken out this week about the shortage. \nDavid Ritchie, chief executive of Bovis Homes (LSE: BVS.L - news ) , said the skills deficit was pushing up the price of hiring tradesmen, while Jeff Fairburn of Persimmon (Other OTC: PSMMF - news ) said rapid growth in the industry had cause a “squeeze in terms of resources”. \nBuilding companies attribute the shortfall to a difficulty in finding apprentices . \nYoung people are being put off construction work because they believe the industry is low paid. But according to the FMB, a 23-year-old bricklayer with five years’ experience can earn £31,000 - well over the national average. \nIn London a similarly qualified brickie could be paid up to £52,000, making the trade an attractive option for many teenagers receiving their GCSE results this week. \n= = \nColin Sheridan, an analyst for Davy, said skills capacity had dropped in the industry after the economic crisis. \n“Post the downturn, many skilled tradespeople left the industry as the number of housing starts in the UK dropped from over 200,000 homes a year, to close to 100,000. Many re-skilled or retired, thus leaving the industry with somewhat less capacity than it once had.” \nBricklayers, carpenters, and plumbers are among the tradesmen in shortest supply. \nThe skills shortage varies according to region, with London having the biggest dearth of bricklayers and carpenters, while the West Midlands lacks scaffolders and the East of England needs more plasterers. \nTony Passmore, chief executive of Leeds-based Passmore Group, said: “We urgently need tradespeople that are trained in more than one area, such as plumbing, tiling and joinery for bathroom installations - but we just aren’t seeing the candidates come through.”", "external_links": [], "published": "2015-08-19T12:09:00.000+03:00", "crawled": "2015-08-19T12:19:05.994+03:00", "highlightTitle": ""}