{"organizations": ["Sainsbury"], "uuid": "695de6a6b224bf4f6380cad07d6675401ff8358a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thegrocer.co.uk", "main_image": "", "site_section": "http://www.thegrocer.co.uk/XmlServers/navsectionRSS.aspx?navsectioncode=8902", "section_title": "The Grocer - finance", "url": "http://www.thegrocer.co.uk/people/people-news/sainsburys-gives-staff-biggest-pay-increase-in-over-a-decade/523769.article", "country": "GB", "title": "Sainsbury's gives staff biggest pay increase in over a decade", "performance_score": 0, "site": "thegrocer.co.uk", "participants_count": 0, "title_full": "Sainsbury's gives staff biggest pay increase in over a decade", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:01:00.000+03:00", "replies_count": 0, "uuid": "695de6a6b224bf4f6380cad07d6675401ff8358a"}, "author": "", "url": "http://www.thegrocer.co.uk/people/people-news/sainsburys-gives-staff-biggest-pay-increase-in-over-a-decade/523769.article", "ord_in_thread": 0, "title": "Sainsbury's gives staff biggest pay increase in over a decade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michelle Perrett"], "text": "Sainsbury's gives staff biggest pay increase in over a decade 27 Aug 2015 | Michelle Perrett Save \nSainsbury’s is to give 137,000 of its store staff a pay increase of 4%, lifting Sainsbury’s basic rate of pay from £7.08, to £7.36 per hour from 30 August. \nThe pay rise comes eight months prior to enforcement of the National Living Wage, the surprise addition to Osborne’s July budget which will require all employers to pay a minimum of £7.20 per hour as of April 2016. \nThe retailer will also not differentiate between over and under-25s in its pay structure and so the new hourly rate will apply to more than 40,000 staff under the age of 25, although a lower training rate will continue to affect staff under 18. \nThis goes beyond the requirements of Osborne’s NLW which applies only to staff over the age of 25, a distinction criticised by the Living Wage Foundation at the time of the Chancellor’s announcement. \n“We’re delighted to announce a 4% pay increase for the colleagues who work in our stores across the country. We know what a difference they make to our customers each and every day and we’re totally committed to rewarding them well for the great service they provide,” said Sainsbury’s CEO, Mike Coupe. \nBy lifting its basic rate of pay to 16p above the threshold, its highest pay increase for store staff in over a decade, Sainsbury’s still falls marginally behind rival Tesco however, which pays staff a basic hourly rate of £7.39 per hour making it the highest payer among the leading grocers. \n“The increase from Sainsbury’s is more a case of realignment than any significant uptick,” said Jon Copestake, retail analyst at the Economist Intelligence Unit. \nThe pay rise also remains 49p short of the £7.85 minimum hourly wage the retailer has been under pressure to pay staff by those calling for the higher Living Wage. \nFaced with scrutiny over the grocer’s pay packet at their July AGM this year, Coupe warned that the steeper pay rise could place its wider benefits package in jeopardy and called these to be taken into account alongside the basic hourly wage. \n“I’ve talked to thousands of colleagues over the past year and they tell me how much they value their package of benefits and the flexibility that we can offer as an employer, as well as hourly pay which has always been well over the minimum wage,” Coupe reiterated this week. \nSainsbury’s said it is one of the few retailers to pay colleagues for the breaks they take during their shifts. Other benefits include pension, life insurance, a discount card and an annual bonus. This year 133,000 colleagues shared a bonus pot of £50m.", "external_links": [], "published": "2015-08-27T03:01:00.000+03:00", "crawled": "2015-08-28T02:38:53.820+03:00", "highlightTitle": ""}