{"organizations": [], "uuid": "f1aef604158c01239ab228c88fdd9060fc20797a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/standard-chartered-plc-value-play-110405128.html", "country": "GB", "title": "Is Standard Chartered PLC A Value Play Or Value Trap?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is Standard Chartered PLC A Value Play Or Value Trap?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T14:04:00.000+03:00", "replies_count": 0, "uuid": "f1aef604158c01239ab228c88fdd9060fc20797a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/standard-chartered-plc-value-play-110405128.html", "ord_in_thread": 0, "title": "Is Standard Chartered PLC A Value Play Or Value Trap?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 20, 2015, 12:36 BST - UK Markets close in 3 hrs 54 mins Is Standard Chartered PLC A Value Play Or Value Trap? By Rupert Hargreaves | Fool.co.uk – 32 minutes ago 824.60 -1.4000 \nStandard Chartered's (LSE: STAN) shares have slumped by 14% so far this year, and over the past 12 months the company has lost more than a third of its value. \nThese declines are bound to attract bargain hunters. After all, Standard is now trading at a six-year low; it's not often an offer like that comes around. What's more, Standard's shares currently trade at a historic P/E of 8.9 and are set to support a dividend yield of 4% next year. \nHowever, while Standard Chartered looks cheap at first glance, the company could be a value trap. \nValue trap \nDistinguishing between value traps and genuine value plays isn't an exact science but most value traps have key three common traits. By avoiding companies that display these characteristics, you can increase your chances of avoiding these traps. \nSecular decline \nThe first common characteristic of value traps is that of secular decline. Simply put, the company may be serving a market that no longer exists in the way it used to. No matter how good the company is at what it does, if the sector itself is contracting, the firm will struggle to instigate a turnaround. \nStandard seems to be under pressure from cyclical forces. Standard has made a name for itself by lending to mining commodity-focused companies over the years. With the commodity sector in turmoil, Standard's bad loan losses are rising, and the company is working to change its business model. \nSo on balance, it looks as if Standard's troubles are a direct result of cyclical economic factors. \nDestroying value \nThe second most common trait of value traps is the destruction of value. In other words, investors need to ask if the company's management has destroyed shareholder value by overpaying for acquisitions and misallocating capital. \nStandard's current CEO, Bill Winters, has accused the bank's previous management of exposing the group to \"losses and fraud\" as its aggressive expansion plan put quantity over quality. But now the bank is working to fix these mistakes. \nWinters is looking to kick-start performance, reduce costs, slash bureaucracy, improve accountability and speed up decision-making. These goals should help the bank create value for shareholders and reverse some past mistakes. \nCost of capital \nThe third and final most common trait of value traps is a low return on equity (RoE). Put simply, RoE means the amount of net income returned as a percentage of shareholders equity. This figure should be above the cost of capital -- the cost of funds used for financing a business. \nEarlier this year, City analysts warned that Standard's business model \"isn't sustainable\" if the group's RoE stays below 15% for much longer. Current figures suggest Standard's cost of capital is in the low-teens. The bank is targeting a RoE of 10% in the medium term, which is clearly not enough. \nThe bottom line \nOverall, Standard exhibits one of the three most common traits of value traps. The company's RoE is below its cost of capital. However, the group is working to restructure its operations and repair past mistakes. \nWith this being the case Standard could be a value play, although the company has many challenges ahead. \nIf you're looking for a company with a more predictable outlook, the Motley Fool's top analysts have recently identified a company that they consider to be one of the market's \"top small caps\" . \nThe company in question is led by a renegade CEO, who has shunned the City but has managed to double group sales within five years . What's more, we believe that the company has the potential to increase profits by 300% to 500% over the next few years. \nAll is revealed in our new free report entitled \"Is This Stock Tomorrow's Big Winner?\" \nDon't delay, download the free report today -- but hurry, it's only available for a limited time. \nRupert Hargreaves has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-20T14:04:00.000+03:00", "crawled": "2015-08-20T14:37:22.856+03:00", "highlightTitle": ""}