{"organizations": [], "uuid": "905bf39785f2310b67b66e8faf5b19f2fda0d5bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/10/nokia-mobile-consumer-idUSL5N10G2CP20150810", "country": "US", "title": "Back to the future: Nokia prepares for mobile comeback", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Back to the future: Nokia prepares for mobile comeback | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T10:00:00.000+03:00", "replies_count": 0, "uuid": "905bf39785f2310b67b66e8faf5b19f2fda0d5bd"}, "author": "Eric Auchard", "url": "http://www.reuters.com/article/2015/08/10/nokia-mobile-consumer-idUSL5N10G2CP20150810", "ord_in_thread": 0, "title": "Back to the future: Nokia prepares for mobile comeback", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT/HELSINKI Aug 10 Nokia is hiring software experts, testing new products and seeking sales partners as it plots its return to the mobile phone and consumer tech arena it abandoned with the sale of its handset business.\nOnce the world's biggest maker of mobile phones, the Finnish firm was wrongfooted by the rise of smartphones and eclipsed by Apple and Samsung. It sold its handset business to Microsoft in late 2013 and has since focused squarely on making telecoms network equipment.\nNow Nokia boss Rajeev Suri is planning a comeback. He must wait until late 2016 before he can consider re-entering the handset business - after a non-compete deal with Microsoft expires - but preparations are underway.\nThe company has already dipped its toe into the consumer market; it has launched an Android tablet, the N1, which went on sale in January in China and days ago unveiled a \"virtual-reality camera\" - heralding it as the \"rebirth of Nokia\".\nIt has also launched an Android app called Z Launcher, which organises content on smartphones.\nMeanwhile its technologies division has advertised on LinkedIn dozens of jobs in California, many in product development, including Android engineers specialising in the operating software Nokia mobile devices will use.\nNokia had also planned to lay off about 70 people at the division, according to a May announcement, but a company source told Reuters that the figure had since been halved.\nPATENT TROVE\nNokia itself is not giving much away about its preparations, beyond saying some staff at the 600-strong technologies division are working on designs for new consumer products, including phones, as well as in digital video and health.\nBut it will not be easy to claw its way back to relevance in the fast-changing, competitive mobile business where Apple has been scooping up nearly 90 percent of industry profits, nor for it to carve out a place in electronics.\nOne ace Nokia that holds is ownership of one of the mobile industry's biggest troves of intellectual property, including patents it retained after selling its handset business. It does not want to waste such resources, built up with tens of billions of euros of investment over the past two decades.\nIt will also get an injection of talent when it completes the 15.6-billion-euro ($17 billion) acquisition of Alcatel-Lucent, announced in April, in the form of Bell Labs - a U.S. research centre whose scientists have won eight Nobel prizes.\nIt says it will not repeat the mistakes of the past of missing technology trends, being saddled with high costs, and reacting too slowly to changing consumer tastes.\nTo blunt such risks, it is seeking partners for \"brand-licensing\" deals whereby Nokia will design new phones, bearing its brand, but - in exchange for royalties - will then allow other firms to mass-manufacture, market and sell the devices.\nThis is stark contrast to its previous handset business which in its heyday manufactured more phones than any other company in the world and employed tens of thousands.\nSuri said last month that Nokia aimed to re-enter the mobile phone business, but only through such licensing agreements. It will not fall back on the \"traditional\" methods, said the CEO, who took the helm last May and has turned it into a slimmed down, more profitable company. He sold off its mapping business a week ago.\nSuch brand-licensing deals - as Nokia has struck for the N1 tablet - are less profitable than manufacturing and selling its own products, but also less risky. They can add a tidy sum of revenue for little investment for the company, which generates the bulk of income from selling telecoms network equipment to operators like Vodafone and T-Mobile.\n\"They want to be innovative and seen as a company with long-term vision in the (tech) industry and having a foot in devices plays into this impression, even if it's not bringing massive revenue at the outset,\" said Gartner analyst Sylvain Fabre.\nNEWCOMERS\nBrand-licensing models are not new in the industry; European companies like Philips and Alcatel have made money from consumer electronics by licensing out their brand after capitulating to Asian competitors more than a decade ago.\nBut given the crop of newcomers like China's Xiaomi and India's Micromax, it may not be possible for Nokia to reproduce even the minor successes that Philips and Alcatel were able to achieve by renting out their brand.\nWith advances in contract manufacturing and standardisation of software, components and features like touch-screens, it is also easier than ever for companies to outsource everything to produce lookalike phones.\n\"We only see this competitive pressure intensifying in coming years,\" said CCS Insight mobile analyst Ben Wood. \"Barriers to entry in the handset market are lower than ever and almost anyone can enter the smartphone market.\nThe strength of the Nokia brand - crucial to the success of such licensing deals - is also open to debate.\nThe company says its brand is recognised by four billion people. But, after being consistently ranked as one of the world's top-five brands in the decade up to 2009 according to market researcher Interbrand, it has since nose-dived and now looks set to disappear from top 100 lists.\n\"A brand is quickly forgotten if it is absent from the consumer business,\" said former Nokia executive Anssi Vanjoki, a professor at Finland's Lappeenranta University of Technology.\n\"The brand will not help much if the product is similar to what is already being sold out there. But if there is something new and interesting to it, the old heritage may be helpful.\"\n($1 = 0.9147 euros) (Editing by Pravin Char)", "external_links": [], "published": "2015-08-10T10:00:00.000+03:00", "crawled": "2015-08-10T09:10:54.904+03:00", "highlightTitle": ""}