{"organizations": ["Bovis Homes Group plc", "Costain Group PLC"], "uuid": "325209d8015321eba05c21eaaa27e6a995beb709", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-construction-materials/?format=rss", "section_title": "Construction & Materials News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/too-buy-bovis-homes-group-093601731.html", "country": "GB", "title": "Is It Too Late To Buy Bovis Homes Group plc, Costain Group PLC And Clarkson PLC?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is It Too Late To Buy Bovis Homes Group plc, Costain Group PLC And Clarkson PLC?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T12:36:00.000+03:00", "replies_count": 0, "uuid": "325209d8015321eba05c21eaaa27e6a995beb709"}, "author": "", "url": "https://uk.finance.yahoo.com/news/too-buy-bovis-homes-group-093601731.html", "ord_in_thread": 0, "title": "Is It Too Late To Buy Bovis Homes Group plc, Costain Group PLC And Clarkson PLC?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clarkson"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Aug 17, 2015, 14:45 BST - UK Markets close in 1 hr 45 mins Is It Too Late To Buy Bovis Homes Group plc, Costain Group PLC And Clarkson PLC? By Roland Head | Fool.co.uk – 4 hours ago 340.00 +4.0000 \nBovis Homes Group (LSE: BVS) and Clarkson (LSE: CKN) have fallen sharply today after publishing their latest results, while Costain Group (LSE: COST) has delivered a modest gain on acquisition news. \nAll three firms are trading close to multi-year highs. \nLong-term investors have enjoyed big gains, but is it now too late to buy into these cyclical stocks? \nBovis Homes \nProfits at housebuilder Bovis Homes rose by 9% to £56m during the first half of 2015, according to the firm's interim results, which were published this morning. The average sale price has risen by 10% to £264,200 over the last year, while completions hit a new record of 1,525 homes. \nYet despite all of this and a 14% hike in the interim dividend, which rose to 13.7p per share, Bovis shares are down by more than 4% at the time of writing. \nOne possible explanation is that with rising interest rates looming on the horizon, investors are becoming wary of housebuilders. Bovis's performance is not outstanding, either. All the other big housebuilders are delivering similar results. \nA concern, in my view, is that Bovis has joined the list of housebuilders using increased debt to add to its land bank. Although the firm's level of net debt remains relatively low, at £58.8m, it's almost 30% higher than at the same point last year (£45.3m). \nHousebuilders are extremely cyclical. While Bovis shares only trade on a 2015 forecast P/E of 12, they trade on 15 times 2014 earnings and 26 times 2013 earnings. \nI'm not sure now is a good time to buy, although I probably wouldn't sell just yet. \nCostain \nMid-cap construction and engineering firm Costain announced the acquisition of Rhead Group Holdings this morning, a programme management consultancy. This is a key area for Costain, whose strategy is to focus on larger, more complex projects in which it can take a leading role. \nCostain's shares have climbed 22% so far this year, against a gain of just 1.5% for the FTSE All-Share index. They now trade on a 2015 forecast P/E of 16.5, falling to 14.5 in 2016. The prospective dividend yield is a fairly average 3.0%. \nAlthough this valuation doesn't seem especially cheap, I believe Costain's strategy of focusing on high-value infrastructure projects could see the firm's profit margins and sales increase over the next few years. \nWe'll find out more on Thursday when the firm publishes its interim results, but in my view, Costain remains a reasonable buy. \nClarkson \nShares in shipping broker Clarkson fell by as much as 10% to 2,450p this morning, after the firm said market conditions were \"challenging\" . Clarkson also warned that profits would be more second-half weighted than usual. This is sometimes a sign that profits will miss expectations for the full year. \nAlthough underlying pre-tax profit rose by 49% to £23.6m, Clarkson's adjusted earnings per share fell from 62.2p to 54.3p. This was due to the additional shares issued to fund the acquisition of peer RS Platou, which completed earlier this year. \nHaving risen by 180% over the last five years, Clarkson shares currently trade on a 2015 forecast P/E of 16.5, with a prospective yield of 2.9%. \nI wouldn't rush to buy at this price. \nOf course, your views on Clarkson, Bovis and Costain may differ. \nHowever, even if you disagree with me, I believe you will be pleasantly surprised by the stock-picking strategy described in \" 7 Simple Steps For Seeking Serious Wealth \" . \nThis exclusive Motley Fool wealth report contains details of an investment strategy which could transform your portfolio performance in as little as 20 minutes each month . \nThis new report is FREE and without obligation . \nTo receive your copy today, simply click here now . \nRoland Head has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-17T12:36:00.000+03:00", "crawled": "2015-08-17T16:45:38.598+03:00", "highlightTitle": ""}