{"organizations": [], "uuid": "da0b15b9d7247e2cdac9d11b7eb55e83656c4c14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/download/pic/main/main/csiid/00260025:35948a5ee4ac45543da86fbbf452b933:arc614x376:w1200.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508250859.html", "country": "US", "title": "South Africa: Montana Widely Implicated in Prasa Report", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Montana Widely Implicated in Prasa Report", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T13:54:00.000+03:00", "replies_count": 0, "uuid": "da0b15b9d7247e2cdac9d11b7eb55e83656c4c14"}, "author": "", "url": "http://allafrica.com/stories/201508250859.html", "ord_in_thread": 0, "title": "South Africa: Montana Widely Implicated in Prasa Report", "locations": ["South Africa", "Montana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Prasa"], "text": "According to the report the complaints were principally levelled against Prasa management and Montana. \nAllegations included financial mismanagement, procurement irregularities, unmanaged conflict of interest, nepotism/cronyism/corruption, irregular appointments and maladministration. \n\"About 17 tenders and contracts collectively exceeding R2.8bn were specifically identified by the Complainant for investigation of supply chain irregularities, including non-competitive processes, cronyism, scope creep, cost overruns, overpayment and fruitless and wasteful expenditure,\" Madonsela said at the beginning of her report released on Monday. \nMadonsela said she held numerous meetings with Montana and his lawyers which were chronologically outlined in the report titled \"Derailed\". \nThe report directly implicates Montana on 8 charges: \n- The improper termination of contracts of 7 cleaning companies followed by an irregular replacement with two other companies constituted maladministration, abuse of power and improper conduct. \n- The improper appointment of a media company to produce a magazine for the agency. Montana acted 'unlawfully' and 'displayed a disconcerting disregard for the rule of law'. \n- Montana appointed a change management consultancy for an amount of about R6m without three quotations from suppliers. \n- Montana improperly awarded a R10m tender for the development of a 'Contingency Emergency Preparedness Programme' for Metrorail without a competitive process. \n- On the authority of Montana rental was paid for 20 months after Prasa vacated a building. \n- Fruitless and wasteful expenditure estimated at R5m after the improper termination of contracts of 5 executives. \n- Improper suspensions which gave rise to labour dispute settlements amounting to R3.35m. \n- The improper appointment of a special adviser at a cost of R2m. \nSource: Fin24", "external_links": [], "published": "2015-08-25T13:54:00.000+03:00", "crawled": "2015-08-26T03:25:04.619+03:00", "highlightTitle": ""}