{"organizations": [], "uuid": "ceeb88adffa1787c97a25ae225e5b90319fe88ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/ob7HxA5PUb6TCAjLPGrWeg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/96a4ba944d90db2ad5fbe632a21c2897bccbf7cf_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/us-stocks-dip-final-day-142419256.html", "country": "GB", "title": "US stocks dip in final day of 'crazy' week", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "US stocks dip in final day of 'crazy' week", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T17:24:00.000+03:00", "replies_count": 0, "uuid": "ceeb88adffa1787c97a25ae225e5b90319fe88ec"}, "author": "", "url": "https://uk.finance.yahoo.com/news/us-stocks-dip-final-day-142419256.html", "ord_in_thread": 0, "title": "US stocks dip in final day of 'crazy' week", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 28, 2015, 18:07 BST - UK Markets closed US stocks dip in final day of 'crazy' week AFP – 2 hours 42 minutes ago View Photo \n\nWall Street stocks dipped in early trade Friday as the US market clung to its gains for the week after turbulent trade prompted by fears about the Chinese economy. \nAbout 45 minutes into trade, the Dow Jones Industrial Average was down 76.05 points (0.46 percent) at 16,578.72. \nThe broad-based S&P 500 fell 6.01 (0.30 percent) to 1,981.65, while the tech-rich Nasdaq Composite Index lost 17.58 (0.37 percent) at 4,795.12. \nHeading into Friday, the S&P 500 was up about 0.85 percent for the week after strong gains on Wednesday and Thursday compensated for deep losses the prior two days. \nGlobal markets have been rocked by worries that a retreat in the Chinese equity market signals a major slowdown in the world's second-biggest economy. \nOn Friday, the Shanghai index gained 4.82 percent. Equity markets in Paris and Frankfurt were lower Friday, while London was up a bit. \nBriefing.com analyst Patrick O'Hare described trade this week as \"crazy,\" adding \"that craziness isn't likely to go away soon either.\" \nO'Hare said investors were feeling \"mistrust\" about price behavior following the gyrations this week. \n\"The speed at which the sell-off and the rebound occurred has left everyone grappling to explain why it happened, what it means, and what comes next,\" he said. \n\"No explanation is wholly sufficient and often matches the character of the market at the time it is provided.\" \nPetroleum-linked stocks were strong, with Dow member Chevron (Swiss: CVX.SW - news ) gaining 3.0 percent, oil services titan Halliburton (Hanover: HAL.HA - news ) up 2.3 percent and Apache (NYSE: APA - news ) up 4.0 percent. \nVideogame developer Activision Blizzard (NasdaqGS: ATVI - news ) and airline United Continental (NYSE: UAL - news ) both jumped following an S&P Dow Jones Indices announcement that they would be added to the S&P 500. \nActivision advanced 4.3 percent, while United rose 4.8 percent. \nMetals and oil producer Freeport-McMoRan surged 7.1 percent as activist investor Carl Icahn disclosed an 8.5 percent stake in the company. Icahn said in a securities filing that he will engage Freeport management on strategy and capital structure and may seek a board seat. \nBond prices rose. The yield on the 10-year US Treasury fell to 2.14 percent from 2.19 percent Thursday, while the 30-year dropped to 2.88 percent from 2.93 percent. Bond prices and yields move inversely.", "external_links": [], "published": "2015-08-28T17:24:00.000+03:00", "crawled": "2015-08-28T20:08:02.585+03:00", "highlightTitle": ""}