{"organizations": [], "uuid": "e4cd1e84b392c8e7a005675f91b4e9711cf6c624", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources.news.com.au/cs/newscomau/images/placeholders/story-thumb-large.jpg", "site_section": "http://www.news.com.au/finance/business/breaking-news", "section_title": "Business Breaking News | Finance &amp; Business News | News.com.au", "url": "http://www.news.com.au/finance/business/us-social-security-at-pivotal-point/story-e6frfkur-1227478535697", "country": "AU", "title": "US social security at pivotal point", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "US social security at pivotal point", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "e4cd1e84b392c8e7a005675f91b4e9711cf6c624"}, "author": "Stephen Ohlemacher", "url": "http://www.news.com.au/finance/business/us-social-security-at-pivotal-point/story-e6frfkur-1227478535697", "ord_in_thread": 0, "title": "US social security at pivotal point", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AS Social Security approaches its 80th birthday on Friday, the federal government's largest benefit program stands at a pivotal point in its history.\nRELATIVELY modest changes to taxes and benefits could still save it for generations of Americans to come, but Congress must act quickly, and even limited changes are politically difficult.\nThe longer lawmakers wait, the harder it will become to maintain Social Security as a program that pays for itself, a key feature since President Franklin Roosevelt signed the Social Security Act on August 14, 1935. \"The more time that they take, the less acceptable the changes will be because there needs to be adequate time for the public to prepare and to adjust to whatever changes Congress will make,\" Carolyn Colvin, acting commissioner of the Social Security Administration, said in an interview. Social Security's long-term financial problems are largely a result of demographic changes. As baby boomers swell the ranks of retirees, relatively fewer workers are left to pay taxes. In 1960, there were more than five workers for every person receiving Social Security. Today, there are fewer than three. In 20 years, there will be about two workers for every person getting benefits. \"Remember, these are our most vulnerable population,\" Colvin said. \"These are the elderly who helped to build this country. These are the disabled who certainly did not wish to become disabled.\" The options fall into broad categories: benefit cuts, tax increases or a combination of both. None is popular. Nearly 60 million retirees, disabled workers, spouses and children get monthly Social Security payments, a number that is projected to grow to 90 million over the next two decades. About 168 million workers pay Social Security taxes. Adding to the gridlock, policymakers are moving in opposite directions. Republicans are pushing to cut benefits while a growing number of Democrats is pulling to expand them. The debate is playing out in Congress and the presidential campaign, increasing the likelihood that Washington will deal with Social Security the same way it has so many other issues - not until it becomes a crisis. Some 72 members of Congress signed a letter to President Barack Obama in July, calling for Social Security benefits to be enhanced. \"In my view, given the fact that poverty among seniors is going up, that seniors are struggling, that people with disabilities are struggling, we have got to expand benefits, not cut them,\" said Senator Bernie Sanders, who is running for the Democratic nomination for president. The poverty rate among those 65 and older has inched up in recent years. But it still is significantly lower than the poverty rate for younger age groups, in large part because of Social Security. Sanders has proposed increasing Social Security's annual cost-of-living adjustment, or COLA, and increasing minimum benefits for low-wage workers. The average monthly payment is $US1,221 ($A1,647). That comes to about $US14,700 a year. Senator Orrin Hatch, Republican-Utah, scoffs at the idea of expanding benefits. \"Where are they going to get the money?\" asked Hatch, chairman of the Senate Finance Committee, which has jurisdiction over Social Security. \"They don't ever seem to give any consideration to how deeply in debt our country is and how difficult it's going to be to get out of it.\" For much of the past three decades, Social Security produced big surpluses, collecting more in taxes than it paid in benefits. Social Security's combined trust funds are now valued at $US2.8 trillion. The retirement trust fund has enough money to pay full benefits until 2035. At that point, the program would collect enough payroll taxes to pay about 79 per cent of benefits, triggering an automatic 21 per cent cut. The disability trust fund is projected to run out of reserves much sooner, in late 2016. If that happens, it would trigger an automatic 19 per cent cut in benefits. Obama and other Democrats want to redirect tax revenue from the much bigger retirement fund to the disability fund, as Congress has done in the past. But Republicans say that would be like robbing seniors to pay the disabled. If the two funds were combined, they would have enough money to pay full benefits for both programs until 2034, according to the trustees. But long before then, Social Security's long-term financial problems could become too big to solve without painful remedies or excessive borrowing. Once the surplus is gone, the gap between scheduled benefits and projected tax revenues starts off big and quickly becomes huge. In the first year, the gap would be $US571 billion, according agency data. Over the first decade, the deficit would total more than $US7 trillion. Social Security uses a 75-year window to forecast its finances, so the projections cover the life expectancy of every worker paying into the system. Options to address Social Security's finances, along with the share of the 75-year shortfall that each one would eliminate: TAXES Social Security is financed by a 12.4 per cent tax on wages. Workers pay half and their employers pay the other half. The tax is applied to the first $US118,500 of a worker's wages, a level that increases each year with inflation. Options: - apply the payroll tax to all wages, including those above $US118,500. This option would wipe out 66 per cent of the shortfall. - increase the combined payroll tax rate by 0.1 percentage point a year, until it reaches 14.4 per cent in 20 years. This option would eliminate 49 per cent of the shortfall. RETIREMENT AGE Workers qualify for full retirement benefits at age 66, a threshold that gradually rises to 67 for people born in 1960 or later. Workers are eligible for early retirement at 62, though monthly benefits are reduced. Options: - gradually increase the full retirement age until it reaches 68 in 2033. This option would eliminate 15 per cent of the shortfall. - raise the early retirement age to 64 in 2023, and the full retirement age to 69 in 2027. This option would wipe out 29 per cent of the shortfall. COLAs Each year, if consumer prices increase, Social Security benefits go up as well. By law, the increases are pegged to an inflation index. This year, benefits went up by 1.7 per cent. Options: - adopt a new inflation index called the Chained CPI, which assumes that people change their buying habits when prices increase to reduce the impact on their pocketbooks. The Chained CPI would reduce the annual COLA by 0.3 percentage point, on average. This option would eliminate 19 per cent of the shortfall. - adopt a new measure of inflation that takes into account the higher costs that older people have to pay for health care. This measure, called the CPI for the Elderly, would increase the annual COLA by about 0.2 percentage point, on average. This option would increase the shortfall by 13 per cent. ", "external_links": ["http://del.icio.us/post?url=http://www.news.com.au/finance/business/us-social-security-at-pivotal-point/story-e6frfkur-1227478535697?sv=1fe26a7142151122054ebfd06d4db0b9&title=US+social+security+at+pivotal+point", "http://www.myspace.com/index.cfm?fuseaction=postto&t=US+social+security+at+pivotal+point&c=THE+the+baby+boomer+generation+heading+to+retirement+the+US%27+80-year-old+Social+Security+scheme+is+approaching+a+make+or+break+point.&u=http://www.news.com.au/finance/business/us-social-security-at-pivotal-point/story-e6frfkur-1227478535697?sv=1fe26a7142151122054ebfd06d4db0b9", "http://digg.com/submit?phase=2&url=http://www.news.com.au/finance/business/us-social-security-at-pivotal-point/story-e6frfkur-1227478535697?sv=1fe26a7142151122054ebfd06d4db0b9&title=US+social+security+at+pivotal+point", "http://www.kwoff.com/submit.php?url=http://www.news.com.au/finance/business/us-social-security-at-pivotal-point/story-e6frfkur-1227478535697?sv=1fe26a7142151122054ebfd06d4db0b9", "http://www.facebook.com/share.php?u=http://www.news.com.au/finance/business/us-social-security-at-pivotal-point/story-e6frfkur-1227478535697?sv=1fe26a7142151122054ebfd06d4db0b9", "http://www.newsvine.com/_wine/save?popoff=0&u=http://www.news.com.au/finance/business/us-social-security-at-pivotal-point/story-e6frfkur-1227478535697?sv=1fe26a7142151122054ebfd06d4db0b9&h=US+social+security+at+pivotal+point"], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-11T07:53:05.212+03:00", "highlightTitle": ""}