{"organizations": [], "uuid": "aeb4da93cf47111b5a349ed9a5ebd1083a7bca77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/3/h/2/r/image.related.afrArticleLead.620x365.gj3dxl.png/1440068639879.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/technology/ashley-madison-data-questioned-as-sydney-and-melbourne-rank-high-20150820-gj3dxl", "country": "AU", "title": "Ashley Madison data questioned, as Sydney and Melbourne rank high", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Ashley Madison data questioned, as Sydney and Melbourne rank high | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T12:41:00.000+03:00", "replies_count": 0, "uuid": "aeb4da93cf47111b5a349ed9a5ebd1083a7bca77"}, "author": "Yolanda Redrup", "url": "http://www.afr.com/technology/ashley-madison-data-questioned-as-sydney-and-melbourne-rank-high-20150820-gj3dxl", "ord_in_thread": 0, "title": "Ashley Madison data questioned, as Sydney and Melbourne rank high", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Doubts have emerged about the legitimacy of some of the data leaked from Ashley Madison. AP Share on twitter Share on Google Plus by Yolanda Redrup Australians have been revealed as some of the most prolific users of cheating spouses website Ashley Madison but doubts have emerged about the authenticity of the leaked data.\nMore than 700 Australian public servant email addresses were included in the data hacked and leaked by a group calling themselves Impact Team.\nData mining website Dadaviz also reported that Sydney had the third-highest number of Ashley Madison accounts, with Melbourne coming in sixth.\nIntelligent Business Research Services (IBRS) information security adviser James Turner said he was skeptical of the number of people who had apparently used their work email addresses to sign up to the website.\n\"We don't yet know if the data is actually from the Ashley Madison breach. The second issue is that even if the data is from that breach, it doesn't mean that the data is 100 per cent accurate,\" he said.\n\"I think a person would have to be an idiot to use their real name and email address on a site like this.\"\nPretenders 'likely' Mr Turner said there was also likely to be cases where individuals' names and credentials had been used without their knowledge.\n \"It certainly wouldn't be the first time online that someone has pretended to be someone else,\" he said.\n\"The important lesson from this attack is that just because a website says that it is secure does not mean it is. Ashley Madison is a website built on the idea of breaking social rules so, with the wisdom of hindsight, it's not at all surprising that they were cutting corners behind the scenes.\"\nImpact Team breached the servers of Ashley Madison's parent company, Avid Life Media, in July, demanding that it close down the site, along with a sister site, Established Men, which promises to hook up young women with rich sugar daddies.\nAvid Life Media did not meet this request so earlier this week, the hackers dumped the 9.7 gigabytes of customer data, including names, email addresses, some website profile information and credit card transaction details.\nData not easily readable The data, which was posted on a .onion website that's only accessible through a Tor browser, has started to become more widely available for downloading through torrent sites, but it is not easily readable.\nThe 700-plus public servant email addresses leaked from Ashley Madison included employees from the federal and state governments, local councils, the Australian Taxation Office and emergency services.\nBut some of the email addresses appeared to be fake. For example, there were email addresses for ony.abbott and freddo.frog.\nAn interview with Ashley Madison's former chief technology officer, Raja Bhatia,(who has been consulting with the company since the news of the hack broke in July), published on KrebsonSecurity following the data dump also raised questions over its legitimacy.\nMost dumps 'entirely fake' \"On a daily basis, we're seeing 30 to 80 different claimed dumps come online, and most of these dumps are entirely fake and being used by other organisations to capture the attention that's been built up through this release,\" he said.\n\"The overwhelming amount of data released in the last three weeks is fake date. But we're taking every release seriously and looking at each piece of data and trying to analyse the source and the veracity of the data.\"\nAccording to the information posted on Dadaviz, Sao Paulo and New York had the highest number of Ashley Madison users. The average user was apparently male, had a medium build, black hair and brown eyes.\nAustralians concerned they might have been caught up in the data breach can check by using haveibeenpwned.com .", "external_links": ["http://dadaviz.com/s/ashley-madison", "https://twitter.com/YolandaRedrup", "http://krebsonsecurity.com/2015/08/was-the-ashley-madison-database-leaked/", "https://haveibeenpwned.com/", "https://plus.google.com/https://plus.google.com/114369306974649582739/about"], "published": "2015-08-20T12:41:00.000+03:00", "crawled": "2015-08-20T16:49:57.536+03:00", "highlightTitle": ""}