{"organizations": [], "uuid": "71ca38c45d9c2abb826a1312e799f48a8d9153eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/120652/money", "section_title": "Money: Personal Finance, Business, Small Business news features - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29919378/eurozone-inflation-stable-at-low-rate-of-02-percent", "country": "US", "title": "Eurozone inflation stable at low rate of 0.2 percent", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Eurozone inflation stable at low rate of 0.2 percent - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "71ca38c45d9c2abb826a1312e799f48a8d9153eb"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29919378/eurozone-inflation-stable-at-low-rate-of-02-percent", "ord_in_thread": 0, "title": "Eurozone inflation stable at low rate of 0.2 percent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (AP) - Inflation in the 19-nation eurozone was stable in August at an annual rate of 0.2 percent, an official report shows - another weak figure that may help push the European Central Bank toward doing more economic stimulus.\nThe European Union's statistics agency, Eurostat, said Monday that a large drop in energy prices made up for increases in the costs of food, alcohol and tobacco, services and industrial goods.\nThe inflation figures remains far below the European Central Bank's aim for an annual rate of just under 2 percent.\nA prolonged period of low inflation or, worse, an outright drop in consumer prices, is a sign of weak demand and can hurt an economy by encouraging consumers to delay purchases. It can also make it harder for eurozone governments to reduce debt and improve their cost competitiveness relative to other countries.\nThe ECB has vowed to push up weak inflation and stimulate growth through a 1.1 trillion euro ($1.2 trillion) stimulus program dubbed quantitative easing. The bank is pushing newly printed euros into the economy by purchasing 60 billion euros a month in government and corporate bonds through September 2016.\nECB President Mario Draghi has said the ECB intends to stick with the program until inflation turns up convincingly, implying the stimulus could be continued beyond September next year. The ECB publishes new inflation projections after its governing council meeting Thursday, which could provide clues to the bank's future stance.\nSeparately, France's economy minister said the eurozone's woes call for a strong eurozone \"economic government\" with its own budget, and is arguing that preserving Europe's shared currency will require financial transfers from its strongest countries.\nIn an interview with German daily Sueddeutsche Zeitung, Emmanuel Macron was Quote: d as saying that a commissioner with far-reaching powers should be put in charge of an \"economic government\" that would be able to secure financial transfers for countries in crisis or promote reforms.\nThe idea is to help smooth recessions in the eurozone, where sharing a single currency means countries cannot seek other remedies, such as letting their currency devalue to boost exports.\nGermany, Europe's biggest economy, is deeply averse to creating a \"transfer union.\" But Macron said if eurozone members continue to object to \"any form of financial transfer in the currency union, we can forget the euro and the eurozone.\"\n ", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-31T13:41:43.422+03:00", "highlightTitle": ""}