{"organizations": ["Zacks Downgrades S & T Bancorp", "STBA"], "uuid": "cb783932b5570050159ea63dfb1c5cc6b11ed3a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "sleekmoney.com", "main_image": "http://www.sleekmoney.com/logos/st-bancorp-logo.png", "site_section": "http://www.google.ca/finance/company_news?q=NASDAQ:STBA&ei=zIG5U_DmF4W-wQOOoICIDQ&output=rss", "section_title": "News for S & T Bancorp Inc - Google Finance", "url": "http://sleekmoney.com/zacks-downgrades-s-t-bancorp-to-hold-stba/413711/", "country": "IL", "title": "Zacks Downgrades S & T Bancorp to Hold (STBA)", "performance_score": 0, "site": "sleekmoney.com", "participants_count": 0, "title_full": "Zacks Downgrades S & T Bancorp to Hold (STBA)", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T21:22:00.000+03:00", "replies_count": 0, "uuid": "cb783932b5570050159ea63dfb1c5cc6b11ed3a5"}, "author": "", "url": "http://sleekmoney.com/zacks-downgrades-s-t-bancorp-to-hold-stba/413711/", "ord_in_thread": 0, "title": "Zacks Downgrades S & T Bancorp to Hold (STBA)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zacks Downgrades S & T Bancorp to Hold (STBA) Posted on Tweet \nS & T Bancorp (NASDAQ:STBA) was downgraded by Zacks from a “buy” rating to a “hold” rating in a research note issued on Tuesday, MarketBeat Ratings reports. \nAccording to Zacks, “S & T BANCORP, INC. is a bank holding company which is engaged in general banking business. The Bank is a full service bank with its main office in Indiana, Pennsylvania, providing service to its customers through a branch of 34 offices located in Armstrong, Allegheny, Indiana, Jefferson, Clearfield and Westmoreland counties. The Bank’s services include accepting time and demand deposit accounts, making secured and unsecured commercial and consumer loans, providing letters of credit, and offering discount brokerage services, personal financial planning and credit card services. “ \nIn related news, Director James Thomas Gibson sold 75,000 shares of the company’s stock in a transaction that occurred on Thursday, July 23rd. The shares were sold at an average price of $32.54, for a total transaction of $2,440,500.00. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which is available through this link . \nSeveral other brokerages also recently issued reports on STBA. Keefe, Bruyette & Woods reaffirmed a “buy” rating on shares of S & T Bancorp in a research report on Thursday, July 23rd. RBC Capital boosted their price objective on shares of S & T Bancorp from $29.00 to $32.00 and gave the stock a “sector perform” rating in a research note on Wednesday, July 22nd. Finally, Piper Jaffray downgraded S & T Bancorp from an “overweight” rating to a “neutral” rating and boosted their price target for the stock from $30.00 to $32.00 in a research report on Wednesday, July 22nd. They noted that the move was a valuation call. Four analysts have rated the stock with a hold rating and two have assigned a buy rating to the stock. The stock has an average rating of “Hold” and an average price target of $32.00. \nS & T Bancorp ( NASDAQ:STBA ) traded down 0.59% on Tuesday, reaching $30.13. 96,991 shares of the company’s stock were exchanged. S & T Bancorp has a 12 month low of $23.07 and a 12 month high of $32.88. The firm has a market cap of $1.05 billion and a PE ratio of 15.74. The firm’s 50-day moving average is $30.57 and its 200-day moving average is $28.87. \nS & T Bancorp (NASDAQ:STBA) last posted its earnings results on Tuesday, July 21st. The financial services provider reported $0.52 earnings per share for the quarter, topping the Thomson Reuters consensus estimate of $0.48 by $0.04. The firm earned $62.20 million during the quarter, compared to analyst estimates of $59 million. During the same quarter last year, the business posted $0.49 earnings per share. On average, equities analysts forecast that S & T Bancorp will post $2.04 earnings per share for the current year. \nThe company also recently disclosed a dividend, which will be paid on Thursday, August 20th. Shareholders of record on Thursday, August 6th will be given a dividend of $0.18 per share. The ex-dividend date is Tuesday, August 4th. \nS&T Bancorp, Inc. ( NASDAQ:STBA ) is a bank holding company. The Company operates through its wholly owned subsidiaries, including   S&T operates   which   deposits,   services; Wealth Management, which offers   deeds, guardian and custodian of employee benefits and other trust and brokerage services, as well as a registered investment advisor that manages private investment accounts for individuals and institutions, and Insurance, includes an insurance agency offering commercial property and casualty insurance, group life and health coverage, employee benefit solutions and personal insurance lines. S&T owns a one-half   \nTo get a free copy of the research report on S & T Bancorp (STBA), click here . For more information about research offerings from Zacks Investment Research, visit Zacks.com Receive News & Ratings for S & T Bancorp Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for S & T Bancorp and related companies with MarketBeat.com's FREE daily email newsletter .", "external_links": [], "published": "2015-08-13T21:22:00.000+03:00", "crawled": "2015-08-14T11:15:39.010+03:00", "highlightTitle": ""}