{"organizations": [], "uuid": "629a1f3c58cfd15ff50b7fd3874f964f6cd45547", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/9/r/m/f/image.related.afrArticleLead.620x365.gj2pjs.png/1440743536467.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/mining/its-not-lygon-street-battle-over-port-hedland-development-heats-up-20150819-gj2pjs", "country": "AU", "title": "'It's not Lygon Street': battle over Port Hedland development heats up", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "'It's not Lygon Street': battle over Port Hedland development heats up | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T14:32:00.000+03:00", "replies_count": 0, "uuid": "629a1f3c58cfd15ff50b7fd3874f964f6cd45547"}, "author": "Jonathan Barrett", "url": "http://www.afr.com/business/mining/its-not-lygon-street-battle-over-port-hedland-development-heats-up-20150819-gj2pjs", "ord_in_thread": 0, "title": "'It's not Lygon Street': battle over Port Hedland development heats up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Port Hedland cafe owner Ray Sampson says those who want to turn the port town into something that resembles Lygon Street, Melbourne, are \"Pilbara princesses\". Simon Phelps by Jonathan Barrett Port Hedland cafe and eatery owner Ray Sampson says people who want to transform the working iron ore export precinct to include an upmarket cafe strip, high-end apartments and a grand marina are dreaming.\n\"People who come here and think it's going to be like Lygon Street in Melbourne don't understand: they are Pilbara princesses,\" said Mr Sampson, who has given a bit of widely used mining slang a new meaning.\n\"This is a workingman's town – it's just not feasible.\"\nBut many locals of the West Australian town and their political representatives say it's time Port Hedland had the facilities to match the riches that flow through the town.\nThe development is earmarked to occur in the town's West End; with the romantically industrious views of a working port, and vision of the waiting ships glistening under the Pilbara sun.\nBut the regional city's most important employer, BHP Billiton, thinks it is a stupid idea.\n\"BHP Billiton supports the town's aspiration of a waterfront and landside development in Port Hedland; however, it believes Cooke Point is the better location for the proposed development,\" a BHP spokesperson said, referring to a coastal area away from the port.\n\"Our advocacy has focused on our concern relating to the land use conflict with port operations.\"\n For major industrial players like BHP, attracting more people to reside, drink coffee and take out their yacht at one of the world's busiest ports makes little sense.\nTug boats already need to beep their horns at unaware fisherman who have parked their tinnies in the water thoroughfare, and the dust from stock piles and ship loading operations poses a health risk to a more densely population area and cosmetic threat to any new development.\nCritically, if iron ore exporters are ultimately required to dramatically change their loading and stock pile practices to minimise dust and noise for a developing West End, that will come at a financial cost to the resources companies.\nNationals' Pilbara MP Brendon Grylls said BHP was being obstructionist. \"We are just disappointed that all of Port Hedland has bent over backwards to meet BHP's concerns. Despite this, they oppose it,\" Mr Grylls said. \"BHP doesn't want any development in the West End.\"\nResident opinion is divided.\nSocial media posts by boating enthusiasts overwhelmingly support the marina development. One Port Hedland Yacht Club member said: \"[BHP] don't care about the people of the town. It's just a factor in their way to profit.\"\nThe world's biggest mining company also has a large property portfolio in town. This controversially includes several vacant lots in the West End, which had led to accusations it is blocking development. BHP denies doing so.\nFor many, the West End development plans have long been considered a pipe dream, especially given the downturn in commodity prices and pullback in investment .\nThen listed property developer Finbar announced this year it would proceed with the first stage of a project that includes 109 apartments, five commercial outlets and a café in the West End. It recently received development approval, despite protest from BHP.\nThere is, however, an important caveat. Finbar's deal to buy a disused hospital site from the state government to build the project relies on it securing significant pre-sales. If it doesn't, then it can back out of the deal.\nFinbar managing director Darren Pateman said the developer had up to 12 months to make a final investment decision. He said BHP had opposed Finbar's plans, which included a recent submission to try to get the development approval refused.\nIt's not clear how the West End battle will end. What is clear, however, is that BHP won't be helping Finbar meet its pre-sales targets.", "external_links": [], "published": "2015-08-28T14:32:00.000+03:00", "crawled": "2015-08-29T12:09:59.064+03:00", "highlightTitle": ""}