{"organizations": [], "uuid": "b45e21c29b38e63ec0b429c267c506ceb6a96b1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/t/t/0/r/image.related.afrArticleLead.620x365.gissoz.png/1438930973461.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/world/it-took-30-seconds-for-trump-to-cause-a-stir-20150806-gissoz", "country": "AU", "title": "It took 30 seconds for Trump to cause a stir", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "It took 30 seconds for Trump to cause a stir | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T14:03:00.000+03:00", "replies_count": 0, "uuid": "b45e21c29b38e63ec0b429c267c506ceb6a96b1c"}, "author": "John Kehoe", "url": "http://www.afr.com/news/politics/world/it-took-30-seconds-for-trump-to-cause-a-stir-20150806-gissoz", "ord_in_thread": 0, "title": "It took 30 seconds for Trump to cause a stir", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Political analysts say if Donald Trump fails to win the Republican nomination and runs as a third-party independent, he will split the conservative vote and almost certainly hand the White House keys to Hillary Clinton. Reuters Share on twitter Share on Google Plus by John Kehoe It took Donald Trump barely 30 seconds to light a fuse under the first Republican presidential debate and emblaze himself in controversy.\nStanding front and centre among the top 10 conservative contenders in front of millions of TV viewers, the billionaire businessman defiantly raised his hand to the opening Fox News question. In making the gesture on Thursday night, he confirmed the worst fears of the Republican Party.\n\"Is there anyone on stage unwilling to pledge their support to the eventual nominee of the Republican primary and pledge not to run an independent campaign against that person,\" Fox's Brett Baier inquired.\nTrump's hand went up: \"I will not make the pledge at this time.\"\n\"I can totally make that pledge if I'm the nominee,\" he brazenly added, as boos swept through the Cleveland basketball arena.\nPolitical analysts say if Trump fails to win the party's nomination and runs as a third-party independent, he will split the conservative vote and almost certainly hand the White House keys to Hillary Clinton.\nAn interjecting Rand Paul, the libertarian desperately trying to revive his diminishing campaign, accused Trump of \"hedging his bets on the Clintons\", arguing the mogul was \"used to buying politicians\".\nThe fiery exchange was one of many colourful insights into the Republican primary contest, more than six months out from when the party will ultimately select its contestant.\n There was no standout winner in the debate, though the articulate and charismatic 44-year-old Marco Rubio enhanced his standing as he spoke of his \"American dream\" growing up under Cuban immigrant parents.\nDeclaring he was the candidate of the future, Rubio said Clinton couldn't lecture him on inequality, a focus of her populist campaign.\n\"I was raised paycheque to paycheque,\" the bartender's son said.\n\"How is she going to lecture me about student loans when I owed over a hundred thousand dollars four years ago?\"\nStanding next to Trump, Jeb Bush appeared nervous and stumbled through awkward moments. The \"I'm my own man\" former Florida governor declared he was \"proud\" of his presidential father and brother, before admitting the Iraq war was a mistake.\nTrump couldn't resist a niggle, claiming he had the \"vision\" to vocally oppose the war in 2004.\nThroughout the showdown, most candidates emphasised their conservative bona fides to the party's faithful.\nTexas Senator Ted Cruz accused President Barack Obama of being weak against \"radical Islamic terrorism\".\nWisconsin governor Scott Walker, running third in polls behind Trump and Bush, confirmed he was against the abortion of an \"unborn child\" in all circumstances, even in the case of where a pregnant mother would die.\n\"I've got a position that is in line with everyday Americans,\" Walker trumpeted.\nFormer Arkansas governor and Baptist minister Mike Huckabee went further, invoking the Constitution to urge the protection of children \"instead of ripping up their bodies and selling them like they're parts to a Buick\".\nA tough night at the office For the anticipated star of the night, Trump, it was a tough night at the office against seasoned politicians. He fended off questions about business bankruptcies, misogyny and financial contributions to politicians as a businessman.\n\"When I call they are there for me,\" Trump said, illustrating how politicians can be bought by rich donors.\n\"With Hillary Clinton I said, 'be at my wedding,' and she came to my wedding.\"\nThe property developer attracted rousing cheers, comical laughs and sometimes loud jeers, candidly admitting at one point \"I don't think they like me very much\".\nThe combative personality lost friends by attacking Fox moderator Megyn Kelly. She pressed Trump about a litany of past sexist comments when he called women \"fat pigs, dogs, slobs, and disgusting animals\", and telling a TV contestant that it \"would be a pretty picture to see her on her knees\".\n\"The big problem this country has is being politically correct,\" Trump said, before adding, \"honestly, Megyn, if you don't like it, I'm sorry. I've been very nice to you, even though I don't have to be, given the way you treat me, but I wouldn't do that.\"\nKelly didn't relent, pointing out Trump's flip-flops on abortion, public-funded health care and support for Democrats.\n\"When did you actually become a Republican?\" Kelly pressed Trump to rousing audience laughter.\nStill, he clearly loved the limelight. He spoke for a total of 11 minutes throughout the 100-minute fracas, about double the time of other candidates including African-American neurosurgeon Ben Carson and New Jersey governor Chris Christie.\nEarlier in the undercard debate featuring the bottom seven candidates, former Hewlett-Packard chief executive Carly Fiorina delivered a break-out performance that won big wraps.\nWhether the 17 Republicans can unite behind a single candidate or be Trumped remains a burning question.", "external_links": ["https://twitter.com/Johnkehoe23", "https://plus.google.com/https://plus.google.com/u/2/b/117110503471959828934/105888713093633772087/posts"], "published": "2015-08-07T14:03:00.000+03:00", "crawled": "2015-08-07T10:07:56.059+03:00", "highlightTitle": ""}