{"organizations": ["Stratasys AP"], "uuid": "a4010411340bf60ddc66925317d3fac857a25e6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=SSYS", "section_title": "Yahoo! Finance: SSYS News", "url": "http://finance.yahoo.com/news/stratasys-showcases-3d-printing-solutions-040000301.html", "country": "GB", "title": "Stratasys Showcases 3D Printing Solutions in Thailand to Help Local Plastic and Rubber Businesses Gain Competitive Advantage", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Stratasys Showcases 3D Printing Solutions in Thailand to Help Local Plastic and Rubber Businesses Gain Competitive Advantage", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T07:00:00.000+03:00", "replies_count": 0, "uuid": "a4010411340bf60ddc66925317d3fac857a25e6a"}, "author": "", "url": "http://finance.yahoo.com/news/stratasys-showcases-3d-printing-solutions-040000301.html", "ord_in_thread": 0, "title": "Stratasys Showcases 3D Printing Solutions in Thailand to Help Local Plastic and Rubber Businesses Gain Competitive Advantage", "locations": ["Bangkok", "Thailand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stratasys Showcases 3D Printing Solutions in Thailand to Help Local Plastic and Rubber Businesses Gain Competitive Advantage Features latest 3D printing products and solutions at Booth No.B16 T-PLAS in Bangkok, Thailand Stratasys AP 19 hours ago  Content preferences Done \nBANGKOK, Aug. 26, 2015 /PRNewswire/ -- Stratasys Asia Pacific,   Ltd. ( SSYS ), a global leader of 3D printing and additive manufacturing solutions, announced today its participation in the International Trade Fair for the Plastics and Rubber Industries (T-PLAS) in Bangkok, Thailand showcasing a wide range of 3D printing solutions to local manufacturing industries. Stratasys presents its latest FDM ® and PolyJet TM 3D printers and applications from Rapid Prototyping to Direct Digital Manufacturing, facilitating businesses expedite their design and manufacturing processes to gain competitive advantage. View photo . \n\"As one of the major hubs of plastics manufacturing in the South East Asia region, Stratasys sees great potential in the adoption of additive manufacturing technologies in Thailand, particularly for the automotive, healthcare and medical equipment industries,\" commented Ido Eylon, General Manager of Stratasys Southern Asia and Pacific. \"3D printing is transforming the way we design and manufacture products, streamlining product development processes at reduced costs while addressing the need for high-degree customization. T-PLAS is a great opportunity for us to demonstrate such capabilities and the boundless possibilities of 3D printing to the local market.\" \nStratasys features its comprehensives 3D printing solutions on prototyping and tooling such as injection molds and jigs and fixtures. Key highlights in the event: Live demos on 3D printing applications Showcase of the professional line of 3D printers, including uPrint SE and the multi-material, Objet Connex350 , as well as a wide range of specially engineered materials On-site consultancy services by 3D printing experts \nT-PLAS has been Thailand's leading regional trade fair for the plastic and rubber sectors, the event presents a diverse range of machinery and equipment, production parts and raw materials, attracting industry players and entrepreneurs to exchange insights on the latest trend in adoption of innovative technologies. Stratasys showcases its latest 3D printing solutions and products at Booth no. B16 at T-PLAS in Bangkok, Thailand from August 26 to 29, 2015. Name of Event: International Trade Fair for the Plastic and Rubber Industries (T-PLAS) Date:", "external_links": [], "published": "2015-08-26T07:00:00.000+03:00", "crawled": "2015-08-27T02:57:32.159+03:00", "highlightTitle": ""}