{"organizations": [], "uuid": "377a545aa698c19a58d7f0205b3a4d469912a141", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/11/markets-factors-britain-idUSL5N10M0YC20150811", "country": "US", "title": "UK Stocks-Factors to watch on Tuesday August 11", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UK Stocks-Factors to watch on Tuesday August 11 | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T10:38:00.000+03:00", "replies_count": 0, "uuid": "377a545aa698c19a58d7f0205b3a4d469912a141"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/11/markets-factors-britain-idUSL5N10M0YC20150811", "ord_in_thread": 0, "title": "UK Stocks-Factors to watch on Tuesday August 11", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds further company news)\nLONDON Aug 11 (Reuters) - Britain's FTSE 100 index is seen opening down 11 to 13 points, or 0.2 percent lower on Tuesday, according to financial bookmakers, with futures on the index down 0.4 percent at 0621 GMT. For more on the factors affecting European stocks, please click on\n* The blue-chip FTSE 100 index was up 17.73 points, or 0.3 percent, at 6,736.22 points by the close, boosted by a turnaround in the mining sector after early falls.\n* CHINA, MINERS - China devalued the yuan on Tuesday after a run of poor economic data, guiding the currency to its lowest point in almost three years in a move it billed as free-market reform.\n* SHIRE - Shire Chief Executive Flemming Ornskov is stepping up his campaign to get Baxalta to the negotiating table as he pushes the benefits a $30 billion takeover offer to the U.S. biotech company's shareholders.\n* LADBROKES - Ladbrokes, the British bookmaker that agreed to buy Gala Coral last month, posted a 44 percent drop in adjusted first-half profit to 24.7 million pounds ($38 million), reflecting lower betting on football and a string of customer-friendly results.\n* SERCO - The British outsourcing firm maintained its full-year profit guidance on Tuesday after it posted a better-than-expected fall in revenue in its first half.\n* STANDARD CHARTERED - Standard Chartered will not advise or help finance the multi-billion dollar Carmichael coal mine in Australia, marking the second big bank to walk away from the project in a week.\n* RIO TINTO - Australian-listed shares of the global miner rose on Tuesday, after the CFO told analysts that costs could be further reduced, stoking hopes of better cash flow.\n* JUST RETIREMENT GROUP AND PARTNERSHIP ASSURANCE - British retirement specialists Just Retirement Group and Partnership Assurance on Tuesday said they planned to merge in an agreed all-share deal worth 669 million pounds ($1.04 billion).\n* RETAIL - British retail spending grew at a slower annual rate in July after recording some of the fastest growth in two years the month before, as wet weather caused Britons to put barbecue plans on hold.\n* BANK OF ENGLAND - Bank of England policymaker David Miles said on Monday he had seen a reasonable case to vote for higher interest rates at his final policy meeting last week but did not find the arguments conclusive.\nTODAY'S UK PAPERS\n> Financial Times\n> Other business headlines Multimedia versions of Reuters Top News are now available for: * 3000 Xtra : visit topnews.session.rservices.com * BridgeStation: view story .134 For more information on Top News visit topnews.reuters.com (Reporting by Alistair Smout )", "external_links": [], "published": "2015-08-11T10:38:00.000+03:00", "crawled": "2015-08-11T09:49:31.093+03:00", "highlightTitle": ""}