{"organizations": [], "uuid": "cc0eb4ebdd4666f84efc4abad43c3de30d0277ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/05/markets-global-idUSL1N10G1QR20150805", "country": "US", "title": "GLOBAL MARKETS-Dollar, stocks up on strong U.S. service sector report", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "GLOBAL MARKETS-Dollar, stocks up on strong U.S. service sector report | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:31:00.000+03:00", "replies_count": 0, "uuid": "cc0eb4ebdd4666f84efc4abad43c3de30d0277ce"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/05/markets-global-idUSL1N10G1QR20150805", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Dollar, stocks up on strong U.S. service sector report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* September U.S. rates \"liftoff\" back on table\n* Oil rises for second day after U.S. inventories fall\n* Dollar index at highest since April (Adds U.S. market open, byline, dateline, previous LONDON)\nBy Herbert Lash\nNEW YORK, Aug 5 (Reuters) - The dollar rose on Wednesday after data showed the pace of growth in the U.S. service sector surged in July to its best level in a decade, helping lift stocks on Wall Street while solid corporate earnings pushed equities higher in Europe.\nLed by sharp increases in business activity, employment and new orders, the Institute for Supply Management's services sector index rose to 60.3, its highest reading since August 2005, beating expectations of 56.2.\nThe dollar rebounded on the ISM data, which supported views the Federal Reserve would raise interest rates in September. Weaker-than-expected July private hiring figures released earlier in the day had briefly raised doubts about a rate hike next month.\n\"For most people watching the market, whether it's September or December isn't that critical, most people are assuming it will happen this year. They've already factored that in to the way they look at the market,\" said Rick Meckler, president of hedge fund LibertyView Capital Management LLC in Jersey City, New Jersey.\nThe dollar also gained after Atlanta Fed President Dennis Lockhart, regarded as one of the Federal Open Market Committee's centrist policymakers, put September back on the table for the first U.S. rate hike in almost a decade.\nThe dollar rose to a two-month high against the yen, and strengthened against other major currencies. The dollar index erased earlier losses and was up 0.14 percent at 98.071.\nAgainst the euro, the dollar was up 0.13 percent at $1.0866. The greenback was up 0.39 percent at 124.87 yen.\nThe Dow Jones industrial average rose 96.08 points, or 0.55 percent, to 17,646.77. The S&P 500 gained 17.79 points, or 0.85 percent, to 2,111.11 and the Nasdaq Composite added 69.58 points, or 1.36 percent, to 5,175.13.\nStocks gained more than 1 percent in Europe, with the pan-European FTSEurofirst 300 index up 1.24 percent at 1,600.57. MSCI's all-country world stock index rose 0.44 percent.\nSociete Generale shares jumped 8.9 percent after the French bank became the latest major European company to post forecast-beating earnings, while regional carmakers, which fell in late July on concerns about a slowdown in the Chinese market, also rallied.\nU.S. Treasuries prices fell after the strong ISM report.\nThe benchmark 10-year U.S. Treasury note fell 17/32 in price to yield 2.2736 percent\nOil prices edged higher for a second day, recovering from a drop below $50 a barrel, after weekly data showed a fall in U.S. crude inventories, though a stronger dollar tempered gains.\nSeptember Brent crude futures rose 35 cents to $50.34 a barrel. U.S. crude for September delivery gained 13 cents to trade at $45.87 a barrel.\n(Editing by Larry King and Meredith Mazzilli; To read Reuters Global Investing Blog click here ; for the MacroScope Blog click on blogs.reuters.com/macroscope ; for Hedge Fund Blog Hub click on blogs.reuters.com/hedgehub )", "external_links": [], "published": "2015-08-05T19:31:00.000+03:00", "crawled": "2015-08-05T18:43:50.218+03:00", "highlightTitle": ""}