{"organizations": [], "uuid": "5b46decf9669ba0aea27c950175a8098a65cd7d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/g6rj6uboE7mkgYTjZP.cpg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/IN_AHTTP_REUTERS_WRAPPER_BUS_NEW/2015-08-27T154457Z_1_LYNXNPEB7Q0UA_RTROPTP_3_USA-ECONOMY_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/wall-street-set-open-higher-131420248.html?l=1", "country": "GB", "title": "What correction? Bulls charge the Street in second-straight rally", "performance_score": 1, "site": "yahoo.com", "participants_count": 0, "title_full": "What correction? Bulls charge the Street in second-straight rally", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T02:00:00.000+03:00", "replies_count": 0, "uuid": "5b46decf9669ba0aea27c950175a8098a65cd7d4"}, "author": "", "url": "http://finance.yahoo.com/news/wall-street-set-open-higher-131420248.html?l=1", "ord_in_thread": 0, "title": "What correction? Bulls charge the Street in second-straight rally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Done \nBy Noel Randewich \n(Reuters) - Wall Street rallied more than 2 percent on Thursday as strong U.S. economic data and hints that a September interest-rate hike was unlikely fuelled optimism that the worst of recent market turmoil was over. \nThe Dow Jones industrial average scored its biggest two-day percentage gain since 2008, while the S&P 500 and Nasdaq Composite racked up their biggest two-day increases since 2009. \n\"The worst is probably behind us but it's going to take a while before we get back to normal and we might still see some downward risk,\" said Scott Brown, chief economist at Raymond James in St. Petersburg, Florida. \nWith Thursday's gains, the S&P has recovered about half of the 11-percent meltdown it suffered over a six-day losing streak caused by fears of slowing growth in China. \nThe market slump stopped on Wednesday after New York Fed President William Dudley said the case for a September hike had become \"less compelling\". \nData on Thursday showed that the U.S. economy grew 3.7 percent in the second quarter - much faster than the previous estimate of 2.3 percent. \n\"It's the U.S. economy versus the global economy,\" said Peter Kenny, chief market strategist at Clearpool Group in New York. \"Can the U.S. economy prove the naysayers wrong? Well, so far it has been able to do that and today's data really puts a line under that.\" \nTraders gave a one-in-four chance that the Fed would increase interest rates in September even after the upbeat economic growth number. \nFed interest rates kept near zero helped fuel the stock market to historic levels since the financial crisis. \nEven if the Fed does not tighten policy in September, expectations of an eventual hike will remain a major overhang on sentiment, warned Jim Bianco, president of Bianco Research in Chicago. \n\"The era of easy money would officially be over,\" Bianco said. \"A rate hike would mean putting the needle away, no more drugs, time for the methadone.\" \nTo that end, investors will keep an eye on an annual conference of some of the world's top central bankers in Jackson Hole, Wyoming over the next few days for further clues on interest rates. \nThe Dow Jones industrial average (.DJI) 2.27 percent to end at 16,654.77 and the S&P 500 (.SPX) jumped 2.43 percent to 1,987.66. \nThe Nasdaq Composite (.IXIC) added 2.45 percent to 4,812.71. \nIn the past two sessions, the Dow is up 6.3 percent, the S&P is 6.4 percent higher and the Nasdaq has gained 6.8 percent. \nAll 10 major S&P sectors rose sharply, with the energy index's (.SPNY) 4.9 percent jump leading the advancers as oil prices soared more than 9 percent in one of the biggest one-day rallies in years. \nGiving the biggest boost to the S&P and Nasdaq, shares of Apple (AAPL.O) surged 2.94 percent. The company invited journalists to a Sept. 9 event, where it is expected to unveil new iPhones. \nTesla (TSLA.O) was up 8.07 percent after its Model S P85D received the highest possible score in tests by Consumer Reports magazine. \nThe recent pummelling in U.S. shares reduced valuations some investors had seen as pricey. The S&P 500's valuation was about 15.4 times expected earnings as of Wednesday's close, compared to around 17 for much of 2015, according to the most recent available Thomson Reuters StarMine data. \nAdvancing issues outnumbered decliners on the NYSE by 2,803 to 324. On the Nasdaq, 2,209 issues rose and 638 fell. \nThe S&P 500 showed one new 52-week high and one new low, while the Nasdaq recorded 19 new highs and 49 new lows. \nAbout 9.9 billion shares traded on U.S. exchanges and the 15-day moving average of 8.1 billion was the highest this year, according to Thomson Reuters data. \n\n(Additional reporting by Tanya Agrawal, Chuck Mikolajczak; Editing by Nick Zieminski) Stocks & Offerings", "external_links": [], "published": "2015-08-28T02:00:00.000+03:00", "crawled": "2015-08-28T02:09:21.211+03:00", "highlightTitle": ""}