{"organizations": ["Bet Against Tesco PLC"], "uuid": "b722d0e14169a512b12415d04217b606d96b26b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-retail/?format=rss", "section_title": "Retail News | Retail Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/why-market-wrong-bet-against-143438306.html", "country": "GB", "title": "Why The Market Is Wrong To Bet Against Tesco PLC’s Boss", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why The Market Is Wrong To Bet Against Tesco PLC’s Boss", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T17:34:00.000+03:00", "replies_count": 0, "uuid": "b722d0e14169a512b12415d04217b606d96b26b3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-market-wrong-bet-against-143438306.html", "ord_in_thread": 0, "title": "Why The Market Is Wrong To Bet Against Tesco PLC’s Boss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Aug 3, 2015, 22:35 BST - UK Markets closed Why The Market Is Wrong To Bet Against Tesco PLC’s Boss By Alessandro Pasetti | Fool.co.uk – 7 hours ago 211.60 -4.10 \nThe bears are in town. Investors are betting on a decline in Tesco 's (LSE: TSCO) stock price \" as optimism around chief executive officer Dave Lewis's revival plan has waned \", Bloomberg stated on Friday. \n\" Tesco short sellers are coming back in droves ,\" the news agency wrote, adding that \" the number of bets taken out against the company's share price has risen sevenfold since Tesco's annual results in April. \" \nIn a short selling, investors borrow shares from a broker in order to sell them to someone else at the current price, betting that their value will fall fairly quickly. If that happens, they can buy the borrowed shares for lower than the price they sold them for, in order to fulfil the trade, thereby banking a profit. \nThis sort of trading carries big risks. If the price goes up you've got to buy the borrowed shares for more than you've been paid -- and is likely to backfire with Tesco, in my view. \nTwo Problems \nThe first problem is to determine whether the UK's largest grocer will be able to hit a 2016 underlying trading profit higher than £1.3bn-£1.4bn, hoping that Tesco will meet estimates of £1.6bn and £1.8bn in 2017 and 2018, respectively. \nInvestors also have to make sure that based on the value of its assets Tesco is a reasonable value play. \nTrading Profit \nSay that Tesco's sales decline 2% to £61bn in the current year (fiscal 2016) -- a drop in line with that of fiscal 2015. Both its quarterly performance -- at constant rates, excluding fuel and VAT -- and market share data suggest that such a performance is pretty likely. I'd not expect Tesco to surprise investors on this front. \nIts 2015 trading profit was down 58% to £1.39bn year-on-year, with the UK -- the biggest revenue contributor at £43bn, excluding VAT -- generating some £467m. Previously a cash cow, the UK operations have become a money pit. \nIts domestic trading margin came in at 1.07% in 2015, a reduction of almost four percentage points year-on-year: t he impact of like-for-like sales decline was clearly felt, but the combination of \"prior initiatives\" and \"net cost base inflation\" had a bigger impact on Tesco' poor performance, which read -79% over the previous year in terms of trading profit. \nPrior initiatives , in particular, were a drag on performance, and a much bigger issue than much-publicised investment in lower retail prices. \nQuite simply, once \"prior initiatives\" in the UK are deducted -- and there's reason to believe they will go down over time -- the \"New Tesco\" led by Mr Lewis may be able to record a trading profit margin of between 2.5% and 3%, yielding a trading profit of between £1.5bn and £1.8bn -. There are risks associated with these estimates, but Tesco could indeed hit its medium-term goals sooner than expected. \nYou should also consider that its Asian operations reported £9.8bn of sales and a trading profit of £565m (down 18%, trading margin at 5.7%), while Europe's £8.5bn of revenues contributed £164m (down 31%, trading margin at 1.93%) to the group's underlying trading performance. \nManagement is playing down expectations, of course, but a target of at least £1.5bn for a 2016 trading income is doable, I'd argue. \nAssets \nSome £5bn of undrawn credit lines cover for the majority of its net debt position, while the duration of its debt profile offers some reassurance, although net leverage is high. \nSo, let's move on to the value of its current and long-term assets. \nTaking into account the book value of: inventories, £2.9bn (as at 28 February) trade and receivables, £2.1bn loans and advances to customers, £3.8bn Cash and equivalents, £2.1bn other current assets, £650m \nyou'd be buying Tesco's equity at 213p a share against £11.5bn of cash-like items, whose value is 141p a share. \nYet there are still some £30bn of long-term assets that must be taken into account. \nIf we apply to these non-current assets a massive discount of about 80%, thus betting on huge write-downs over time, we'd still have to add £6bn (about 74p a share) to a valuation of 141p a share for Tesco's current assets. \nThen, Tesco's equity would be valued at £17.5bn, which is bang in line with its current market cap, but does not include the difference between the book value of its total long-term assets and the aggregate value of net debt, discounted operating lease commitments and pension deficit. \nThat's about 37p a share, or £3bn in terms of additional market cap. \nThat said, several risks still surround Tesco, and you may also need more evidence to invest your savings in shares at present time. \nReturns north of 20% a year can be achieved investing in our top names. \nDownload our free report now -- it's completely free, but only for a limited amount of time! \nAlessandro Pasetti has no position in any shares mentioned. The Motley Fool UK owns shares of Tesco. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-03T17:34:00.000+03:00", "crawled": "2015-08-04T00:57:56.312+03:00", "highlightTitle": ""}