{"organizations": [], "uuid": "407722270750a122ab5d8e370b8345dfcdd51297", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/03/25/102535119-169856769.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss/rss.html", "section_title": "Finance", "url": "http://www.cnbc.com/2015/08/10/feds-lockhart.html", "country": "US", "title": "Lockhart: Fed 'close' to hiking rates, US economy near normal", "performance_score": 1, "site": "cnbc.com", "participants_count": 27, "title_full": "Lockhart: Fed 'close' to hiking rates, US economy near normal", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T03:00:00.000+03:00", "replies_count": 43, "uuid": "59cfcebc1abafb8d9a639c0f3e65b46976aac3e3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2015/08/10/feds-lockhart.html#post-0", "ord_in_thread": 0, "title": "Lockhart: Fed 'close' to hiking rates, US economy near normal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scott Eells | Bloomberg | Getty Images Dennis Lockhart, president of the Federal Reserve Bank of Atlanta Economic conditions in the United States have largely returned to normal and a Federal Reserve decision to raise interest rates should come soon, Atlanta Fed President Dennis Lockhart said on Monday.\n\"I think the point of 'liftoff' is close,\" Lockhart said in prepared remarks for an address to the Atlanta Press Club. \"The economy has made great gains and is approaching an acceptable normal ... conditions are no longer extraordinary.\"\nLockhart, regarded as a centrist on the U.S. central bank's policy-setting committee said he was \"disposed\" to begin raising rates in September, but expected there would be a gap of at least one policy meeting between any subsequent increases.\n\"I remain very disposed to September being a possible date for a liftoff decision,\" Lockhart told journalists following the speech. He emphasized, however, that rate hikes after the so-called liftoff would be gradual.\n\"In my mind, gradual is going to mean something less frequent than every meeting.\"\nAtlanta Fed's Lockhart fuels rate hike talk\nTodd Elmer, currency strategist at Citi, discusses comments from Dennis Lockhart, Federal Reserve Bank of Atlanta President, that the U.S. economy is ready for its first rate hike in more than nine years.\nIn his prepared remarks, he made clear he feels the economy has cleared the major hurdles that he saw earlier in the year.\nRisks from abroad, whether a Greek exit from the euro zone or a meltdown in China, have receded, he said. While oil prices have made it difficult to gauge inflation, he said the U.S. economy is now arguably \"just a shade\" from full employment, putting the Fed in reach off one of its key goals.\nLockhart said he is confident inflation will rise in the coming months as the economy continues to strengthen.\n\"Compared to earlier in the year, we know a lot more and can shelve some concerns,\" Lockhart said. \"We are getting closer and closer to what feels like a healed state.\"\nRead More Jobs report keeps Fed on track, September odds rise\nSince May, Lockhart has pointed to a likely September rate hike, and his comments have firmed alongside continued strong employment growth. Four of the current 10 voting members of the Fed's policy-setting committee have publicly put September in play - Lockhart, Fed Governor Jerome Powell, San Francisco Fed President John Williams and Richmond Fed President Jeffrey Lacker.\nChicago Fed President Charles Evans is the only committee member to have taken a public stand against a September increase, though others like New York Fed President William Dudley and Fed board member Lael Brainard have cited overseas risks and other issues that they feel could slow the U.S. recovery.\nFed Chair Janet Yellen has said she feels a rate hike will be appropriate later this year, without indicating a preference.\nRead More Fed waiting to hike is market's 'biggest fear': Expert\nBut Lockhart said on Monday he agreed with Yellen and many others that the rate hike path should be gradual once an initial increase is approved. The Fed's overnight lending rate has been near zero since 2008.\nLockhart said rates should rise slowly to nurse the U.S. recovery along.\n\"Policy will likely transition from being aggressively stimulative toward merely stimulative,\" he said.", "external_links": [], "published": "2015-08-10T03:00:00.000+03:00", "crawled": "2015-08-10T21:40:34.742+03:00", "highlightTitle": ""}