{"organizations": [], "uuid": "3a632cb4efbc7fe4f16914cb77e85495feb6a94d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2014/03/06/12913182/SCH Logo New.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12913182.htm", "country": "US", "title": "SC&H Group Hosts Second Annual “A Night of Doing Good. Better”", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "SC&H Group Hosts Second Annual “A Night of Doing Good. Better”", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a632cb4efbc7fe4f16914cb77e85495feb6a94d"}, "author": "Matt Langan", "url": "http://www.prweb.com/releases/2015/08/prweb12913182.htm", "ord_in_thread": 0, "title": "SC&H Group Hosts Second Annual “A Night of Doing Good. Better”", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SC&H Group, a leading audit, tax, and consulting firm, is hosting its second annual benefit event—A Night of Doing Good. Better, which aims to raise $100,000 to support Business Volunteers Maryland. Taking place at the scenic SC&H Group Sparks, Md. campus on September 26th from 5:00 to 10:00pm, this will be a celebratory evening including savory eats from Mission BBQ, raffles, lawn games, desserts, beer and wine, memorable musical performances, and the opportunity to support a vital community organization.\n“Community support is a key pillar to SC&H Group’s growth and long-term success,” said Ron Causey, CEO and Co-Founder of SC&H Group. “This second-annual event reinforces our commitment to supporting a wide range of charitable programs and events through volunteer activities and donation opportunities.”\nBorn in Baltimore and now a sought-after LA-based musician, Dennis Jones will once again bring his high-energy stage performance with sizzling guitar solos, smooth, soulful vocals and a dynamic rhythm section. The opening band will be Causey & Effect, featuring musicians from SC&H Group, including Ron Causey.\nFor the past 11 years, Business Volunteers Maryland has been a powerful community catalyst, matching individual and business volunteers with nonprofit partners to provide the resources and manpower needed by nonprofits to succeed in their respective missions. Since 2003, Business Volunteers has connected more than 175,000 volunteers to a wide variety of opportunities where they have been able to contribute more than 850,000 hours to hundreds of nonprofits. As a result, more than $24 million of time and talent has been infused into the Central Maryland community.\nTickets are $50. Attire is casual. The event will be held outdoors at the SC&H Group Campus, located at 910 Ridgebrook Rd., Sparks, MD, 21152.\n visit http://businessvolunteersmd.org/event/september-26-2nd-annual-fundraiser-a-night-of-doing-good-better/ or call 410-366-6030.\nAbout Business Volunteers Maryland\nBusiness Volunteers Maryland is a 501c3 nonprofit organization with a focus on connecting companies and individuals to results-focused volunteerism while fulfilling the needs of nonprofit organizations for talented, mission-driven volunteers. Specifically Business Volunteers trains and places business professionals on nonprofit boards, develops civic leaders, matches individuals to meaningful volunteer opportunities, creates partnerships between companies, local nonprofits and schools, and provides volunteer management training to nonprofits. Since 2003, we have connected more than 175,000 individuals from local businesses and the community at large to volunteer and board opportunities. This has resulted in more than $24 million of time and talent being infused into Central Maryland. To learn more, visit http://www.BusinessVolunteersMD.org or call 410-366-6030.\nAbout SC&H Group\nSC&H Group is an audit, tax, and consulting firm applying “expertise that works” to minimize risk and maximize value. SC&H Group’s practices advise leading companies from emerging businesses to the Fortune 500 on accounting, tax, profitability, and strategy solutions. Clients in all states and worldwide benefit from SC&H Group’s commitment to delivering powerful minds, passionate teams, and proven results on each and every engagement. http://www.scandh.com", "external_links": ["http://businessvolunteersmd.org/event/september-26-2nd-annual-fundraiser-a-night-of-doing-good-better/", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2J1c2luZXNzdm9sdW50ZWVyc21kLm9yZy9ldmVudC9zZXB0ZW1iZXItMjYtMm5kLWFubnVhbC1mdW5kcmFpc2VyLWEtbmlnaHQtb2YtZG9pbmctZ29vZC1iZXR0ZXIv", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5idXNpbmVzc3ZvbHVudGVlcnNtZC5vcmcv", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5zY2FuZGguY29tLw=="], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T17:13:47.846+03:00", "highlightTitle": ""}