{"organizations": [], "uuid": "023fe54e07402ca3a77e98064d96d120798cb733", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://images.smh.com.au/2014/02/12/5155383/FAIRFAX-logo.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/chanticleer/kpmgs-push-into-human-rights-20150803-giqocs", "country": "AU", "title": "KPMG's push into human rights", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "KPMG's push into human rights | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T17:17:00.000+03:00", "replies_count": 0, "uuid": "023fe54e07402ca3a77e98064d96d120798cb733"}, "author": "Tony Boyd", "url": "http://www.afr.com/brand/chanticleer/kpmgs-push-into-human-rights-20150803-giqocs", "ord_in_thread": 0, "title": "KPMG's push into human rights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ken Saro-Wiwa had a profound impact on Richard Boele. Illustration: David Rowe Share on twitter by Tony Boyd KPMG Australia's purchase of Richard Boele's human rights consultancy Banarra is the latest sign that business is taking corporate and social responsibility seriously.\nThe idea that commercial imperatives can override all other considerations is thankfully dead or dying. Companies are now conscious of their obligations to all of the people touched by their activities, whether it is those living near a BHP Billiton mine site or workers making products for the Wesfarmers-owned Target.\nBoards of directors in Australia have reputational risk at the forefront of their deliberations. They understand the importance of earning the licence to operate and the dangers in ignoring the careful management of the social impacts of corporate activity.\nUnder chief executive Gary Wingrove, KPMG has shown a sound understanding of the corporate and social responsibility challenges facing boards. He has moved quickly through strategic acquisitions to build the expertise that his clients are demanding.\nOver the past 18 months, KPMG has acquired eight small firms, including social media risk consultancy SR7, Pacific Strategy Partners and the cyber security consultant First Point Global.\nWingrove is honest when he says that the eight firms would probably add less than $50 million to KPMG's total annual revenue of $1.1 billion. But that type of analysis would ignore the long-term objectives.\nWingrove says it would have taken KPMG too long to build the expertise organically.\nAdrian King, who is KPMG's partner in charge of Climate Change and Sustainability Services, says the addition of a human rights consultancy will give the Australian arm of the firm global leadership.\n He agrees that the main human rights assessment work done at companies has been in the mining, retail and banking sectors. But he thinks it will expand to become an issue for all companies.\nRuggie principles One of the first companies in the world to publish a human rights policy was Rio Tinto. Along with BHP Billiton it is a supporter of the United Nations Guiding Principles on Business and Human Rights, which were developed by John Ruggie, who is now a professor at Harvard's Kennedy School of Government.\nRuggie principles can be summed up in three pillars: protect, respect and remedy. This stands for the responsibility of states to protect their citizens against bad corporate behaviour, the responsibility of companies to protect human rights and remedying problems when uncovered.\nThere are efforts to take the human rights principles to a new level by developing an international treaty but Ruggie has said that may be a futile exercise because the end treaty would probably have no teeth.\nAustralian corporate involvement in human rights discussions is primarily through The Global Compact, which has a network in Australia. It has a membership of about 50 organisations, including the big miners. Human rights considerations have been hard-wired into the processes and systems at Rio Tinto and BHP Billiton for years. Extractive industries were at the cutting edge of this corporate social responsibility. Boele, who is now KPMG partner, Banarra – human rights and social impact consulting services, has been the main driver for the annual conference of the Global Compact Network Australia.\nHe told his clients in an email on Monday that the KPMG acquisition \"means we will be growing – without compromising quality – those core services for which you have come to value us\". \"These include services in human rights risk, ethical sourcing and supply chain management, management and measurement of social impact, complex stakeholder engagement and strategy and report development,\" he said.\nBoele is living proof that the best activists end up inside the tent because they recognise they can do more for the cause than remaining outside yelling in.\nHe started out as a human rights campaigner working against corporations exploiting communities in different parts of the world, most notably Africa.\nHow it got started Boele's interest in human rights started when a backpacker in China and Tibet in 1987. He was swept up in an uprising, including having Tibetan protesters shot and killed next to him. Not surprisingly, he remains a strong campaigner for Tibetan human rights.\nHis next job was at a Hague-based international human rights organisation (UNPO) in 1993, where he met Ken Saro-Wiwa.\nHe had a profound impact on Boele. He worked with him to help the Nigerian Ogoni people's campaign against Shell. That association with Saro-Wiwa ended with him working with his son, who tried to desperately to save his father's life.\nKen Saro-Wiwa and eight other Ogoni were executed by the Nigerian military dictatorship on November 10, 1995. Boele actually told his son, Ken jnr, of his father's death at 5am in a hotel in Auckland at the Commonwealth Heads of Government Meeting.\nBoele then worked for The Body Shop International's first human rights campaigner in late 1995.\n\"Interestingly, my first job was to run a campaign to save the Ogoni 20, who were on the same charges that had led to the execution of the Ogoni 9. This campaign was predominantly focused on Shell, who had experienced a significant public backlash after the executions in Nigeria – the worst being the fire-bombing of Shell petrol stations in Germany.\"\nBoele later worked for Amnesty International, where he met the late Sir Geoffrey Chandler, a former senior Shell executive.\n\"He told me at my first meeting that I really didn't need to come to just to represent her [Anita Roddick from the Body Shop] and effectively showed me the door! I stayed,\" he says.\nChandler was a towering figure in the development of human rights as a critical consideration for corporations.\nOver the years, Boele has worked for many leading Australian companies, including Westpac Banking Corp and BHP Billiton.\nHe advised Australia Tibet Council (ATC) on a campaign against SinoGold, which had a property in Chinese-occupied Tibet – producing an alternative annual report, Who Owns Tibet's Gold.\nMany lessons learned Boele says there are many lessons learned from his career.\n\"The Shell Ogoni conflict was major turning point in terms of global society's expectations of corporates' responsibilities in relation to human rights,\" he says.\n\"Ken Saro-Wiwa articulated the injustice of the Ogoni in a way that captured people's attention around the world and his execution cemented that legacy.\"\n\"Into the aftermath of what was arguably the most traumatic year in Shell's history [Brent Spar and then Nigeria] stepped Geoffrey Chandler and articulated a way forward – and in 1997 Shell modified their Business Principles [which Sir Geoffrey was the architect of in the 1970s] a commitment to respect human rights.\n\"The United Nations engaged – there were initiatives such as the Global Compact, which Kofi Annan first telegraphed in 1999 – which have their heritage in Shell's experience in Nigeria and were a response to what was then a significant anti-globalisation movement\n\"Certainly Shell's experience in Nigeria with the Ogoni and BP's in Colombia led to the Voluntary Principles on Security and Human Rights. I believe Ken Saro-Wiwa and Sir Geoffrey Chandler were the two individuals who made the greatest contribution bringing attention to the corporate responsibility to respect human rights. Professor John Ruggie then codified global societal expectations into the United Nations Guiding Principles on Business and Human Rights.\"\nTONY BOYD\nTwitter: @TonyBoydAFR\ntony.boyd@afr.com.au", "external_links": ["https://twitter.com/TonyBoydAFR", "http://twitter.com/@TonyBoydAFR"], "published": "2015-08-03T17:17:00.000+03:00", "crawled": "2015-08-03T20:15:19.618+03:00", "highlightTitle": ""}