{"organizations": [], "uuid": "0c9362dcfadbafa8a2cf6211374a430149b5b05f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nz.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://nz.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Latest business and finance news from New Zealand and the world's key markets - Yahoo New Zealand Finance", "url": "https://nz.finance.yahoo.com/news/yellow-brick-road-lifts-earnings-060008432.html", "country": "US", "title": "$A lower as China's yuan drama fades", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "$A lower as China's yuan drama fades", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T10:26:00.000+03:00", "replies_count": 0, "uuid": "0c9362dcfadbafa8a2cf6211374a430149b5b05f"}, "author": "", "url": "https://nz.finance.yahoo.com/news/yellow-brick-road-lifts-earnings-060008432.html", "ord_in_thread": 0, "title": "$A lower as China's yuan drama fades", "locations": ["New Zealand", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tue, Aug 18, 2015, 12:29 AM NZST - New Zealand Markets open in 9 hrs 31 mins $A lower as China's yuan drama fades AAP – 5 hours ago Print \nThe Australian dollar has lost ground as China's massive currency devaluations fade from focus. \nAt 1700 AEST on Monday, the currency was trading at 73.77 US cents, down from 73.87 cents on Friday. \nChina's central bank raised the value of the yuan against the US dollar only fractionally by 0.01 per cent on Monday, having a minimal impact on the Aussie. \nLTG GoldRock director Andrew Barnett said in the absence of any major economic data, traders were waiting for the release of the Reserve Bank of Australia board meeting minutes on Tuesday and the US Federal Reserve July policy meeting minutes, due early on Thursday morning. \n\"Any move towards raising US rates is going to put negative pressure on the Aussie,\" he said. \n\"But there's some questions marks now about whether or not they will raise rates after what the Chinese did last week.\" \nLast week, the People's Bank of China moved the trading mid-point of the yuan 4.4 per cent lower, in three devaluations of more than one per cent, in an effort to boost demand for the nation's exports. \nAt 1700 AEST, the Australian dollar was at 91.77 Japanese yen, down from Friday's close of 91.83 yen, and at 66.47 euro cents, up from 66.17 euro cents. \nThe Australian bond market is virtually unchanged following a quiet, low volume local session. \nRBC Capital Markets fixed income and currency strategist Michael Turner said it had been a \"very uninspiring\" day of trade. \n\"Zero happened. We traded in a two-tick range with no new data coming out,\" he said. \nAt 1630 AEST on Monday, the September 2015 10-year bond futures contract was trading at 97.185 (implying a yield of 2.815 per cent), unchanged from Friday. \nThe September 2015 three-year bond futures contract was at 98.020 (1.980 per cent), down from 98.030 (1.970 per cent). @YahooNZBusiness on Twitter, become a fan on Facebook Inquiry into gender retirement income gap AAP \nA parliamentary committee will look at boosting retirement incomes for women, who have about 50 per cent less in …", "external_links": [], "published": "2015-08-17T10:26:00.000+03:00", "crawled": "2015-08-17T15:36:02.789+03:00", "highlightTitle": ""}