{"organizations": ["EVRAZ plc", "Vodafone Group plc"], "uuid": "e54e9789d1a159f58e62356cb27309ba07243958", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/bank-5-yields-vodafone-group-110714991.html", "country": "GB", "title": "Can You Bank On 5%+ Yields From Vodafone Group plc, EVRAZ plc and Carillion plc?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Can You Bank On 5%+ Yields From Vodafone Group plc, EVRAZ plc and Carillion plc?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T14:07:00.000+03:00", "replies_count": 0, "uuid": "e54e9789d1a159f58e62356cb27309ba07243958"}, "author": "", "url": "https://uk.finance.yahoo.com/news/bank-5-yields-vodafone-group-110714991.html", "ord_in_thread": 0, "title": "Can You Bank On 5%+ Yields From Vodafone Group plc, EVRAZ plc and Carillion plc?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 27, 2015, 12:10 BST - UK Markets close in 4 hrs 20 mins Can You Bank On 5%+ Yields From Vodafone Group plc, EVRAZ plc and Carillion plc? By Roland Head | Fool.co.uk – 3 minutes 37 seconds ago 223.25 +6.4500 \nThis week's sell-off has created some very tempting income buys. Three examples are Vodafone Group (LSE: VOD), Evraz (LSE: EVR) and Carillion (LSE: CLLN), each of which offers a forecast yield of more than 5%. \nHowever, each of these three companies is facing certain risks that could affect the safety of its dividend payout. \nVodafone \nVodafone's earnings have crumbled over the last two years, thanks to headwinds in Europe and the loss of its share of the profits from US firm Verizon Wireless. Earnings per share are expected to fall from 21.75p in 2014/15 to just 5.3p in the current year. Despite this, the mobile giant has promised to maintain its 11.5p dividend payout. \nVodafone's current share price suggests that the market believes this promise. The firm's shares currently trade on a forecast P/E of 42, falling to 36 in 2016/17. That's not a normal valuation for such a large firm, but is supported by Vodafone's 5% yield. \nAs a Vodafone shareholder myself, I'm not overly concerned about a dividend cut and expect earnings to improve over the next couple of years. However, I'd only add to my holding if the share price dipped below 200p. \nEvraz \nRussian coal miner and steel producer Evraz suffers from what I call the 'Russian discount'. The risks posed by currency problems, economic sanctions and potential political interference mean that Evraz shares currently trade on a 2015 forecast P/E of just 4.2. \nI'm starting to wonder whether these risks are overstated. Evraz reported its interim results today, revealing first-half free cash flow of $372m on turnover of $4.9bn. \nCost cutting has probably been helped by the Russian rouble's devaluation against the dollar, and Evraz generated cost savings of $149m during the first half. This was enough to push the firm's operating profit for the period up from $297m in 2014 to $479m, giving an operating margin of 10%. \nOne risk is that Evraz does have a lot of debt. Interest payments of $229m swallowed around half of the firm's operating profit during the first half of the year. \nHowever, the firm's 2015 forecast dividend of 7.5 cents would cost just $68m to pay. This looks safe enough to me. With a prospective yield of 6.2%, I think Evraz could be worth a closer look. \nCarillion \nOutsourcing and construction firm Carillion is currently the most heavily-shorted company in the UK. According to regulatory figures, 15.9% of Carillion shares are on loan to funds who are betting that the company's shares will fall. \nThe firm isn't an obvious basket case. According to this week's interim results, underlying earnings per share rose by 8% to 15.9p during the first half, while revenue was up 16%. Carillion expects to hit full-year earnings forecasts of 34.1p per share. \nHowever, one possible concern is that Carillion's profit margins are falling. Gross margin fell from 9.5% to 7.8% during the period, suggesting Carillion is struggling to maintain pricing power relative to its costs. The firm also has a £446m pension deficit that required £22m of additional payments during the first half. \nCarillion looks cheap, with a 2015 forecast P/E of 10 and a prospective yield of 5.5%. However, I think there is a risk that performance could stagnate, and would steer clear for now. \nToday's safest dividend? \nThe recent sell-off has created some exceptional buying opportunities for income investors. \nBut how safe are these payouts? Buying shares in a firm which then cuts its dividend could leave you with a big loss and a reduced income. \nTo help you spot the safest dividends, the Motley Fool's income experts are offering Fool readers exclusive access to \" How To Create Dividends For Life \" . \nThis unique income investing report contains details of the 5 golden dividend rules . \nThis report is FREE and carries no obligation , but availability is limited. \nTo receive your copy today, click here now . \nRoland Head owns shares of Vodafone Group. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-27T14:07:00.000+03:00", "crawled": "2015-08-27T14:11:44.736+03:00", "highlightTitle": ""}