{"organizations": [], "uuid": "a58384ef52cf781c123737df10d935f9d1a79b3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/03/chile-mine-protests-idUSL1N10E0TJ20150803", "country": "US", "title": "Chile's Codelco agrees to oversee talks as copper strike continues", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Chile's Codelco agrees to oversee talks as copper strike continues | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T17:29:00.000+03:00", "replies_count": 0, "uuid": "a58384ef52cf781c123737df10d935f9d1a79b3d"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/03/chile-mine-protests-idUSL1N10E0TJ20150803", "ord_in_thread": 0, "title": "Chile's Codelco agrees to oversee talks as copper strike continues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SANTIAGO Aug 3 Chile state miner Codelco said it would facilitate talks between striking contract workers and their employers, as a stoppage that has shuttered its smallest mine and affected others looked set to stretch into a third week.\nContract workers affiliated with the Confederation of Copper Workers, or CTC, have been on strike since July 21. They are demanding the right to negotiate a benefits package similar to the one offered to direct employees.\nCodelco, the world no.1 copper exporter, has called the stoppage illegal and said it is the responsibility of the companies that employ the contractors - cleaners, drivers, and other workers, including some miners - to agree any change in benefits.\nAn association of those companies planned to talk to workers' organizations on Tuesday at a meeting at which Codelco would be a 'facilitator,' the miner said in a statement late Sunday.\nThere should be no negotiation of bonuses or salary rises at the meeting, it said.\nBoth Codelco and the contractor companies say paying more in benefits is unrealistic at a time when the copper price is at multi-year lows.\nHowever, the CTC said Monday, \"Codelco is trying to trick workers and public opinion, insisting on this assembly and a false negotiation,\" and called on the government to establish direct talks with the company.\nThe protesters have blocked access roads to Codelco mines throughout Chile, attacked vehicles and occupied Salvador, the company's smallest complex. Codelco has said its operations other than Salvador have been largely unaffected.\n(Reporting by Rosalba O'Brien ; Editing by Bernadette Baum )", "external_links": [], "published": "2015-08-03T17:29:00.000+03:00", "crawled": "2015-08-03T16:38:09.464+03:00", "highlightTitle": ""}