{"organizations": [], "uuid": "5b0fe13b9961e4b88fe7146c99380d8f16e6618f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/c/d/2/l/image.related.afrArticleLead.620x365.gj8won.png/1440659032784.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/technology/why-a-bust-could-be-just-what-silicon-valley-needs-20150827-gj8won", "country": "AU", "title": "Why a bust could be just what Silicon Valley needs", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why a bust could be just what Silicon Valley needs | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T10:44:00.000+03:00", "replies_count": 0, "uuid": "5b0fe13b9961e4b88fe7146c99380d8f16e6618f"}, "author": "Farhad Manjoo", "url": "http://www.afr.com/technology/why-a-bust-could-be-just-what-silicon-valley-needs-20150827-gj8won", "ord_in_thread": 0, "title": "Why a bust could be just what Silicon Valley needs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The boom has made Silicon Valley soft: Companies are spending too much, investors are funding too many me-too ideas, and most founders have never had to confront any limits to their overweening ambitions. Reuters by Farhad Manjoo In October 2008, in the early days of the last economic collapse, Sequoia Capital invited founders of technology companies to a frank meeting outlining the new global reality.\nSilicon Valley had long since shaken off the doldrums of the dot-com bubble, but one of the industry's most respected venture capital firms was now counselling entrepreneurs to again \"batten down the hatches\" – to cut costs, to focus on profit, to \"spend every dollar as if it were your last\" because \"it is going to be a rough ride.\"\nThe presentation was called \"RIP Good Times,\" and it ended with a challenge meant to inspire founders as well as to scare them: \"Get real or go home.\"\nAs it happened, Sequoia's dire warnings never quite came to pass; the tech industry's good times merely paused for the recession.\nBut the presentation has achieved the status of legend among venture capitalists. Tech investors are known for their strutting optimism, but the best of them are keenly aware of the motivating powers of impending doom.\nSome of the most successful tech investments of all time – among them Google and Facebook – came about in Silicon Valley's lean times. This is a paradox of invention, as well as of investing: Bad times feed good ideas, which in turn lead to good times, which breed complacency, waste and lots of bad business plans.\nNo one in the tech industry knows if the recent stock market turbulence will prompt another opportunity to mourn good times. But some venture capitalists are beginning to plan for a leaner era ahead.\nSooner rather than later, some external shock – the Dow, China, Europe, Iran, interest rates, the inauguration of President Donald Trump – may prompt a slow-moving retrenchment in the fundraising for startups. Money will dry up, companies will face hard choices, and there will be layoffs, shutdowns and much heartache.\n That may just be what Silicon Valley needs. Many investors are optimistic about the clarifying possibilities of a downturn.\nBoom has made Silicon Valley soft The boom has made Silicon Valley soft: Companies are spending too much, investors are funding too many me-too ideas, and most founders have never had to confront any limits to their overweening ambitions. Venture capitalists won't quite say they are looking forward to a correction, but some do say that a bust could toughen the place up.\nAnd if a downturn in startup funding is going to come anyway, you might argue that it couldn't come soon enough: Not just RIP good times, but good riddance, and let the bad times roll.\n\"The founders who start companies in bad times are the ones who are really driven,\" said Roelof Botha, one of Sequoia's partners. \"They're not jumping on the bandwagon to get to Silicon Valley just because it's the fashionable thing to do today.\"\nBotha offered a story from his past at PayPal, where he began his Silicon Valley career in March 2000, the same month the Nasdaq hit a peak that it would take 15 years to reach again.\n\"Most of the people who were building startups in that era, including us at PayPal, had only seen one economic environment in our working lives,\" he said.\nBut Michael Moritz, another Sequoia partner who was one of PayPal's board members, repeatedly counselled caution.\n\"He was the one board member drilling into our heads, 'Guys, you need to work on the runway – how many months do you have left, and what are you going to do about it?'\" Botha said, recalling Moritz's advice.\nCautious voice at PayPal At Moritz's prompting, PayPal's executives decided to take what was then an extraordinary step: They began to charge users a fee to use the payment service. The company also worked hard to keep its costs down.\n\"That focus was instrumental in PayPal's survival,\" Botha said. \"We could have been spending money willy-nilly and fallen by the wayside by accident.\"\nInstead, within a year, PayPal was sold to eBay for $1.5 billion, and its founders and executives went on to become Silicon Valley luminaries.\nOver the last year, as money flowing into Silicon Valley went from a gush to a flood, Botha, like other venture investors, began advising startups to raise funds even if they didn't need it immediately, to have cash on hand for a potential downturn.\nThe companies that did so will have a leg up, because a downturn offers a few immediate advantages for well-positioned startups: It lowers prices and wreaks havoc on more vulnerable competitors. Salaries for software engineers could fall, and they could become easier to recruit. The price of office space could go down. Other less tangible costs – Bay Area traffic, marketing, employees' overall cost of living – could also decline significantly.\n\"For startups, the only thing that is easier during a boom is access to cheap capital,\" said Samuel H. Altman, president of the startup incubator Y Combinator. \"Every other thing is harder. And an environment of less noise and less competition makes it easier for people to do something that they're really committed to over the long term.\"\nUpsides for VCs too The Valley's established venture capitalists, too, will see some upside to a downturn. If the hedge funds and other global investors that have recently poured money into tech begin to pull back, competition for investment in the hottest startups will cool, allowing VCs to buy more of a company for less money.\n\"I'm not sure that we're ready to declare that we're now officially in leaner times,\" said Scott Kupor, the managing partner of the venture firm Andreessen Horowitz.\nStill, Kupor noted that as a relatively young firm, Andreessen will likely be putting more money into startups over the next few years instead of looking to extract money through sales or initial public offerings – which means that lower prices for startups could be good for its portfolio.\n\"All other things being equal, people would rather an environment where asset prices are lower and where there's less availability of capital, so if one of our companies breaks out, they have less competition from 10 other startups going after them,\" Kupor said.\nDanielle Morrill, co-founder of Mattermark, a company that collects and analyzes data on private market funding, pointed to another benefit that some startups may see in tougher times. They could begin to pitch themselves as money-saving services.\n﻿ Countercyclical value Mattermark is a software as a service business – a firm that charges a subscription fee for access – and businesses of that type, Morrill said, can say that they are saving customers money over the competition.\n\"People are going to start talking about which companies are countercyclical,\" meaning they'll prosper in bad times, Morrill said. But she noted a problem with making such calls: \"You don't really know if you're countercyclical until you go through a cycle like what we may have. And then you'll find out.\"\nAnd that gets to the biggest question if we do enter a gloomy period for startups: whether founders will be up for managing in a more stressful, frugal environment.\nMorrill said that the current market conditions \"could totally affect my fundraising, and there's only so much you can change in a week or a month about the way you're running your company.\"\nShe added: \"I can say we shouldn't buy this expensive coffee, but that's $100. The scarier thoughts are, when will we have to lay off some of our staff? You look at yourself in the mirror and you say, 'I don't want to be that CEO.'\"\nIn good times, in other words, it's relatively easy to be a great startup chief executive. When winter comes to Silicon Valley, we'll find out which founders really shine. A lot of them won't. Things won't be pretty. But maybe it's time.", "external_links": [], "published": "2015-08-27T10:44:00.000+03:00", "crawled": "2015-08-27T11:09:42.676+03:00", "highlightTitle": ""}