{"organizations": [], "uuid": "129c65da98e3f7da77297aa8e622b513009ac37e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/7/z/l/1/image.related.afrArticleLead.620x365.gj7xcm.png/1440557445898.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/the-fed-cues-markets-will-be-looking-for-at-jackon-hole-20150826-gj7xcm", "country": "AU", "title": "The Fed cues markets will be looking for at Jackon Hole", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The Fed cues markets will be looking for at Jackon Hole | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T10:29:00.000+03:00", "replies_count": 0, "uuid": "129c65da98e3f7da77297aa8e622b513009ac37e"}, "author": "John Kehoe", "url": "http://www.afr.com/markets/the-fed-cues-markets-will-be-looking-for-at-jackon-hole-20150826-gj7xcm", "ord_in_thread": 0, "title": "The Fed cues markets will be looking for at Jackon Hole", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The significance of this year's Jackson Hole event has been talked down by some observers due to the absence of US Federal Reserve chair Janet Yellen and European Central Bank president Mario Draghi. Bloomberg Share on twitter Share on Google Plus by John Kehoe Even though the official discussion topic is \"Inflation Dynamics and Monetary Policy\", when some of the world's top central bankers gather in the United States late this week, the China-induced global financial market ructions will be at the forefront of minds and almost certainty stoke intellectual debate.\nChina's stock market is swooning and its economy slowing. The rest of the world is feeling the brunt of the negative forces.\nSo the annual three-day Jackson Hole symposium of central bankers, academic economists and financial market participants comes at an opportune time to debate the appropriate monetary policy responses. That's if central bankers have not already run out of ammunition.\nThe significance of this year's Jackson Hole event has been talked down by some observers due to the absence of US Federal Reserve chair Janet Yellen and European Central Bank president Mario Draghi. Predecessors Alan Greenspan and Ben Bernanke sometimes used the platform to signal policy shifts to the markets.\nYet an impressive list of influential policy makers will be present at the event hosted by the Kansas City Fed in Wyoming from Thursday.\nUS Fed vice chair Stanley Fischer, Bank of England governor Mark Carney, Swiss National Bank chairman Thomas Jordan, Reserve Bank of India governor Raghuram Rajan and Central Bank of Chile governor Rodrigo Vergara are among the list of expected attendees.\nDavid Stockton, a former director of research at the Fed and a veteran of at least 10 Jackson Hole events, says the meeting is still important, especially only weeks out from the Fed's crucial September meeting and the recent international market volatility.\n\"Given it is a gathering of central bank governors, policymakers and financial participants, I suspect there will be a lot of discussion about the global economy and how much risk is associated with China and the emerging markets,\" says Stockton, a senior fellow at the Peterson Institute for International Economics in Washington.\n Top of the mind of investors is whether the plunge in China's stock market and resultant turbulence in global markets will cause the Fed to defer its first rate hike in nine years.\nAny hints from Fischer in his scheduled remarks on Saturday may provide a clue, as too might comments to media on the sidelines by regional Fed governors who vote on US interest rate decisions.\nThe private discussions between central bankers away from the microphones will likely be at least as illuminating.\nIf Fischer keeps to script, he is expected to tackle the thorny issue that is most troubling the Fed and holding it back from raising interest rates for the first time in almost a decade.\nInflation has remained stubbornly weak, even as unemployment has fallen from above 10 per cent to 5.3 per cent.\nTextbook economic theory, dictated by the Phillips curve, suggests that as unemployment falls, inflation should rise as the economy's spare capacity is eaten up and employers bid up wages in the pursuit of scarce labour.\nThe consumer price index rose just 0.1 per cent in July and is up only 0.2 per cent over 12 months, well below the Fed's 2 per cent target.\nThe Fed's preferred measure of core inflation, which excludes the more volatile energy and food prices, was up 1.8 per cent over the year, and shows few signs of accelerating.\nWage growth also appears subdued at around 2 per cent, in spite of a tightening labour market.\nUniversity of Michigan economics professor Justin Wolfers says monetary policy in the current environment is a debate between the theory and facts.\n\"The theory is that the Phillips curve tells us that when the economy runs out of slack, inflation will take off,\" Wolfers says.\n\"The facts say there is no sign of a take off in inflation.\"\nAround the world, policymakers are battling similar deflationary pressures, which are even more acute in Japan and Europe. The slump in commodity and energy prices is further compressing prices.\nThe Phillips curve is not infallible. Over the past 50 years there has been only a tenuous link between unemployment and inflation. Yet the theory is still a useful framework to think about monetary policy.\nInflation expectations have remained remarkably anchored in the age of central bank independence, including in recent years when the balance sheets of central banks have rapidly expanded to dizzying heights.\nReserve Bank of Australia researchers Christian Gillitzer and John Simon published a paper this week suggesting that inflation targeting may have become too successful in anchoring inflation expectations.\nSome economists have called for a re-engineering of inflation-targeting regimes, by explicitly adopting a dual target of employment or economic growth.\nStockton says relatively stable inflation, including when the US economy tanked and unemployment spiked, is a big \"puzzle\".\n\"I'll be waiting to see what Stan Fischer says on the inflation picture because it's very important at the moment and he's certainly an influential policymaker,\" Stockton says.", "external_links": ["http://www.rba.gov.au/publications/rdp/2015/2015-09.html", "https://twitter.com/Johnkehoe23", "https://plus.google.com/https://plus.google.com/u/2/b/117110503471959828934/105888713093633772087/posts"], "published": "2015-08-26T10:29:00.000+03:00", "crawled": "2015-08-26T08:09:18.155+03:00", "highlightTitle": ""}