{"organizations": [], "uuid": "1e6fb9910f9a8824663359dadd28912a31d3a13e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/y/w/d/m/image.related.afrArticleLead.620x365.gizz6y.png/1439753604783.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/technology/apple-pay-being-repelled-by-big-banks-20150815-gizz6y", "country": "AU", "title": "$2b fee sticking point as Apple wrangles with Australia's big four banks", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "$2b fee sticking point as Apple wrangles with Australia's big four banks | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T22:15:00.000+03:00", "replies_count": 0, "uuid": "1e6fb9910f9a8824663359dadd28912a31d3a13e"}, "author": "Share via Email", "url": "http://www.afr.com/technology/apple-pay-being-repelled-by-big-banks-20150815-gizz6y", "ord_in_thread": 0, "title": "$2b fee sticking point as Apple wrangles with Australia's big four banks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"The disruption is structural ... This level of innovation is here to stay,\" Commonwealth Bank chief executive Ian Narev says. Jessica Hromas Share on twitter by James Eyers Australia's largest banks are fending off the world's largest technology company, Apple, as it tries to muscle in on the hotly contested payments market .\nFairfax Media understands fees are a big sticking point in the negotiations, with big banks not willing to give Apple a slice of the $2 billion a year they earn in interchange fees, which are paid by merchants for use of payments infrastructure.\nIn the United States, Apple is believed to earn about 15¢ on every $100 of transactions. It is understood Apple has been asking for the same amount of interchange fee in Australia.\nBut Australia's big banks will not agree to this level given that interchange fees in Australia are about half the US level – equivalent to an average of 50¢ $100 of transaction compared with about $1 for $100 of transaction fees in the US.\nCommonwealth Bank of Australia chief executive Ian Narev would not comment on the progress of negotiations with Apple, but said Apple's attempts to offer Apple Pay in Australia won't be as easy as it was in the US given Australian banks' record of innovation.\n\"By most global standards, the capability that the Australian banking sector has generally, and Commonwealth Bank has specifically, to provide for customers is ahead of a lot of the other markets around the world where Apple has done well,\" Mr Narev said last week after delivering the bank's full-year cash profit of $9.14 billion.\n\"There is functionality associated with Apple Pay that we have had in the market for 18 months to two years.\"\nNAB closest to Apple deal? Apple Pay launched in October 2014 in the US and in Britain last month. It allows users of an iPhone 6 or Apple Watch to use a tap-and-go terminal to pay for items by holding their fingerprint on the phone or double-tapping the face of the smartwatch. But to be switched on in a market, Apple needs to strike a deal with banks to use the payments system.\nMr Narev said CBA had already offered the same functionality as Apple Pay through its app – for users of Android phones – for two years, so it was difficult for Apple to argue it is providing much value. In the US, Apple Pay was innovative because tap-and-go was not a feature of that market.\nWestpac also allows customers with Android phones to use them to pay via tap-and-go through the bank app. Take-up, however, has so far been low, with most customers preferring to pay with their cards.\nNational Australia Bank was rumoured to be closest to securing a commercial arrangement with Apple over its payments product but Fairfax Media has been told it is more likely a small bank will be the first to strike a deal with Apple and use it as a tactic to target iPhone users for transaction-account market share.\nIn Britain, the banks were successful in negotiating Apple down to a much lower fee. Apple is receiving only a few pence a £100 transaction, the Financial Times reported last month.\nCustomer concerns The Reserve Bank of Australia is trying to push interchange fees down even further, to an average of 30¢ per $100 of transactions. This increases the stakes in the negotiations between the banks and Apple in how to share the interchange-fee pie.\nThe big banks are also reluctant to open their payments infrastructure to Apple for two other reasons. First, because they are being forced by the RBA to tip hundreds of millions of dollars into building the New Payments Platform, new infrastructure that will have real-time capability, there are concerns about Apple seeking to free ride on this investment.\nSecond, the negotiations are also challenged because banks are concerned about the prospect of Apple getting in between them and their customer at the point of sale, as banks recognise that future revenue growth will come from being the \"interface\" when customers pay for goods and services, which will allow them to cross-sell products.\nApple is also negotiating from a position of weakness given that the take-up of Apple Pay in the US appears to be sagging. It is also facing competition from Samsung, which announced last week it would launch Samsung Pay in the US on September 28.\n'The disruption is structural' Despite the reluctance to cut a deal with Apple, Mr Narev said CBA was closely watching the movement of big tech players into financial services, as the global banking landscape is reshaped by ubiquitous mobile phones.\n\"If it not Apple, it might be Google; if it is not Google, it might be Samsung; if it is not Samsung, it might be Amazon; if is it not Amazon, it is going to be someone else,\" he said.\n\"Are we going to be able to sit here today and pick the major winners? No. But the disruption is structural. It is only going one way. And I don't think there will ever be a point where me or my successor, or his or her successor, is ever going to sit here and say their war is done and we won. This level of innovation is here to stay.\n\"But we have got customers, we have got distribution, we have got brand, we have got product. So as long as we are adding to that investment and have the right execution focus, we should be able to be really competitive.\"", "external_links": ["https://twitter.com/https://twitter.com/eyersj"], "published": "2015-08-16T22:15:00.000+03:00", "crawled": "2015-08-17T00:05:52.367+03:00", "highlightTitle": ""}