{"organizations": [], "uuid": "d4a7d3dd770c0dd3b4142b278d84f5bf0bd96d32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/mNEfo28cYk0DhPXdHnW6fA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/2aea12d436b9ff0c5f10525a527e90a4e735ae21_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/eurozone-approves-greek-bailout-return-213325551.html", "country": "GB", "title": "Eurozone approves Greek bailout in return for far-reaching reforms", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Eurozone approves Greek bailout in return for far-reaching reforms", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T00:33:00.000+03:00", "replies_count": 0, "uuid": "d4a7d3dd770c0dd3b4142b278d84f5bf0bd96d32"}, "author": "", "url": "https://uk.finance.yahoo.com/news/eurozone-approves-greek-bailout-return-213325551.html", "ord_in_thread": 0, "title": "Eurozone approves Greek bailout in return for far-reaching reforms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nEurozone finance ministers approved Friday a third bailout worth up to 86 billion euros to keep Greece in the single currency in return for an unprecedented package of reforms that Athens had previously rejected. \nEarlier Friday, Greek lawmakers passed the accord following a bitter all-night debate on the conditions demanded by Athens' creditors which could alter many aspects of daily life. \n\"New (KOSDAQ: 160550.KQ - news ) loans of up to 86 billion euros ($96 billion) will be made available over the next three years to Greece,\" the European Commission said after six hours of talks in Brussels. \nCommission head Jean-Claude Juncker said six months of negotiations with the left-wing government of Prime Minister Alexis Tsipras -- who won office in January opposed to the creditors' demands -- had been difficult and testing. \n\"Together, we have looked into the abyss. But today, I am glad to say that all sides have respected their commitments. Greece is living up to its ambitious reform commitments,\" Juncker said in a statement. \n\"The message of today's (meeting) is loud and clear: on this basis, Greece is and will irreversibly remain a member of the euro area.\" \nA first disbursement for Greece next week will total 13 billion euros, helping cover a debt payment to the European Central Bank due on August 20. \nTsipras came to power in January on a wave of popular anger against the tax hikes, spending cuts and reforms demanded by creditors in exchange for two previous bailouts costing 240 billion euros. \nHe said this austerity medicine had only damaged, not helped, an economy which emerged from six years of brutal recession in 2014. \n- Eurogroup confident of Greek prospects - \nDutch Finance Minister Jeroen Dijsselbloem, who chaired the Eurogoup meeting, said ministers \"welcomed the wide scope of policy measures (in the accord) which if implemented with determination will address the main challenges facing the Greek economy\". \n\"We are confident that decisive and swift as possible implementation ... will allow the Greek economy to return to a sustainable growth path based on sound public finances, enhanced competitiveness, high employment and financial stability,\" he added. \nUnder the programme, Greece will have to balance its books to produce a primary budget surplus -- that is, before interest payments -- and take on a major privatisation programme to help reduce a debt mountain of some 320 billion euros. \nThe sale of state assets should produce more than 6.0 billion euros in the three years but the ultimate target is 50 billion euros, to help pay to recapitalise the banking system and reduce the debt. \nDijsselbloem recognised that dealing with the debt was among the most important issues, especially for the International Monetary Fund which believes Greece cannot get back on its feet without some relief. \nBut Germany, Europe's paymaster, is sceptical when not outright opposed to any \"haircut\" or partial writedown, which could potentially cost it and other holders of Greek debt billions of euros. \nDijsselbloem said the Eurogroup also opposed any \"haircut\" but was ready to consider other options, including longer maturies for the debt. \n\"The Eurogroup considers the continued programme involvement of the IMF as indispensable,\" he said in a statement. \nIMF head Christine Lagarde participated in the meeting via a teleconference link and in a separate statement said the accord \"is a very important step forward\". \n\"However, I remain firmly of the view that Greece's debt has become unsustainable and that Greece cannot restore debt sustainability solely through actions on its own,\" she said. \n\"Thus, it is equally critical for medium and long-term debt sustainability that Greece's European partners make concrete commitments ... to provide significant debt relief, well beyond what has been considered so far.\" \nProgress would allow the IMF to consider further support for Greece after a review of the programme, expected in October, she added. \n- 'Prefer compromise to suicide' - \nA third of MPs in Tsipras's radical-left party Syriza rebelled against him in Friday's vote and he only managed to push the deal through with the help of the opposition -- raising fresh speculation he will be forced to call early elections. \nThe accord goes far beyond economic management to include an extensive overhaul of Greece's health and social welfare systems plus its business practices and public administration. \nSeemingly small details of daily life will also be affected by the new rules, from visits to the doctor to an extension of the expiry dates on pasteurised milk in the supermarkets. \nTsipras told parliament his government had \"taken on the responsibility to continue the fight rather than commit suicide and then go running to other international forums saying it wasn't fair that we had to kill ourselves (Other OTC: UBGXF - news ) \".", "external_links": [], "published": "2015-08-15T00:33:00.000+03:00", "crawled": "2015-08-15T01:00:45.797+03:00", "highlightTitle": ""}