{"organizations": [], "uuid": "d910d7f3f1b4d4f35fab24c1d259c3f76d93c14c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DS616_birthd_ZG_20150820104035.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/what-us-parents-can-learn-from-kids-birthday-parties-from-around-the-world-2015-08-26", "country": "US", "title": "What U.S. parents can learn from kids’ birthday parties around the world", "performance_score": 0, "site": "marketwatch.com", "participants_count": 3, "title_full": "What U.S. parents can learn from kids’ birthday parties around the world - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 2, "uuid": "31d6e5c4203dbe1bc4d1bc4818441c3402734626"}, "author": "Barbara Kollmeyer", "url": "http://www.marketwatch.com/story/what-us-parents-can-learn-from-kids-birthday-parties-from-around-the-world-2015-08-26#post-0", "ord_in_thread": 0, "title": "What U.S. parents can learn from kids’ birthday parties around the world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sanobar Khudaybergenova Slide 1 of 7 What could you buy with 21 years’ worth of birthday parties? Try a down payment on a house, or the first year of a private-college education.\nThe grand total for that many years of cake, balloons and stress is about £19,425 (a little over $30,000), according to a study commissioned by U.K. retailer Asda in May. The research found that first, 13th and 18th birthday parties set parents back the most, with 48% of those polled spending more than $780 (£500) each year.\nBlowing a “lifetime budget“ recently was Kylie Jenner, who reportedly got a Hermès Birkin bag (starting price tag: $10,000) from her mother for her 18th birthday. But even ordinary families get caught up in the festivities. The Learning Channel’s “Outrageous Kid Parties” series a few years back highlighted seemingly normal families spending beyond their means for parties, featuring $2,500 outdoor roller rinks and $1,250 foam pools. The popularity of Pinterest has only added to feelings of inadequacy for parents, with pictures of delicately crafted party favors, such as tiny fairies in a Mason jar.\nAt an average cost of £150 ($234), the venue can be the biggest cost for any parent, according to Asda. And there’s no escaping the party-favor bag, which was the top must-have item among parents. Also known as the goody bag, it can be the bane of both the parents giving it and those whose children are on the receiving end, since it’s generally filled with toys and candy — much of which ends up in the garbage. And they’re not cheap; the cost of putting them together averages around £40 ($62) per party, that survey showed.\nThe truth is, for parents of younger children, birthday parties are a grind, and, at the end, they’re lucky to get a decent picture of themselves, since they’ll be sweating and dehydrated, and Junior will be feral from adrenaline and sugar, or crying hysterically by the time the cake arrives.\nElizabeth Lombardo, a Chicago-based psychologist and author of “Better Than Perfect: 7 Strategies to Crush Your Inner Critic and Create a Life You Love,” said in a telephone interview that parents strive so hard with birthday parties because “these are memories they’re always going to have and they want these beautifully scripted memory books.”\nIf you’re curious how parents from as far as Tokyo manage, then read on. American traditions cast a long shadow, but there’s also plenty in here that might help any parent chill out when it’s time to throw a party.\nSanobar Khudaybergenova An extended-family affair. Slide 2 of 7 The party is the favor in Uzbekistan Sanobar Khudaybergenova lives in Tashkent, Uzbekistan’s capital, with her four children — three boys, 10, 8 and 5, and a girl, 22 months old. Maintaining annual birthday parties for each child can be costly, so her children don’t get big bashes every year.\nThe minimum she spends on any party is the equivalent of about $150, including the crucial birthday cake, at a cost of $50 to $70, which features a popular movie character or fancy shape. Answering questions via email, Khudaybergenova said she usually takes her children and their cousins to a family fun center, which has videogames, racing cars and a children’s playground. She buys $35 worth of coins for the children to spend on whatever game they wish.\nThe last big party she threw was for her second son, which went a bit over that budget. It was held at a restaurant with a playground, which cost $300, and she paid $100 for a photographer and $75 for a kid’s entertainment group. But goody bags aren’t really part of the scene in Uzbekistan, at least in her circle, and children are sent home with a few sweets and a juice box.\nShe laments the change that she’s seen in birthday celebrations over the years. “I remember when I was a kid, I would wake up with a doll each birthday morning. We didn’t know pizza existed, and it used to be a special day just within a family.”\n“Nowadays, parents throw huge parties at fancy restaurants, inviting their own adult friends along with their children,” said Khudaybergenova.\nAmanda Vaughan Birthday playtime. Slide 3 of 7 The venue is green in New Zealand One perk to hosting a birthday party in New Zealand: There are plenty of wide-open spaces. “The last one we had, my son’s 5th, was a sports-themed party at a local park so we just brought along a bunch of balls and sporting equipment and organized games, which kept him and nine friends very happy,” said Auckland-based Amanda Vaughan, mother to two boys, ages 5 and 3.\nVaughan asked a few of her friends and found that most fork out on average NZ$200 ($129) for a birthday party, whether at home or at a low-cost community venue, rentable for about NZ$50 (about $33).\nBut one friend of hers paid NZ$350 ($227) with food included, “just for it to be someone else’s mess,” while another family spent NZ$450 ($292) to hire out a trampoline venue.“ At one recent party, another set of friends brought in a truckload of ice from a fishing company and turned their driveway into snow so the children could go tobogganing, which could not have come cheap,” she says. The nearest snow is in the mountains, about four hours away.\nAs for one of the bigger birthday-party costs — the cake — Vaughan is lucky. Her “fantastic baker and cake decorator” sister helps her save NZ$100 to NZ$150 ($65 to $98).\nShe says goody bags are a recent phenomenon in New Zealand, but, once her children started to get them at parties, she, too, had to start giving them out. She keeps the cost of the party favors — a little car or Play-Doh, a bit of candy and a balloon or hat — to NZ$5 to NZ$10 ($3.25 to $6.50) per child. But she’s heard from several parents who have taken home party treats that cost more than the birthday presents received.\n“I wouldn’t say parties have changed for the worse exactly, just that there is more expectation I think to have a party and more conventions to follow now. Competitive parenting is part of the culture and this is just part of it,” said Vaughan.\nDaisuke Kiriyama Unhappy bearer of rice cakes. Slide 4 of 7 The tradition is respected in Japan In some countries, the birthday party can take a back seat to a long-held custom. “In Japan, we have some traditional event for celebrating children’s growth, like ‘ Shichi go san ,’ ” explains Tokyo-based Yuri Murayama, the mother of a 7-year-old girl.\nThe translation is “Seven Five Three.” Girls on their third and seventh birthdays and boys on their third and fifth usually dress in traditional Japanese clothing, and visit a shrine to pray for their health and growth.\n“I guess Japanese people spend more on a ‘Shichi go san’ event than a birthday party,” says Murayama, who tends to spend about ¥10,000 yen ($84) on a cake and ¥5,000 ($42) for a present for her daughter, with birthday parties always at home.\nDaisuke Kiriyama, father of two daughters, 9 and 12, recounts another Japanese birthday tradition, the issho mochi. On the first birthday, the parents strap on a heavy rice cake to the child, who must successfully crawl or walk with it. “She carried a rice cake, which weighs 1.8 kilograms, crying so much in order to pray for her health and a long life,” he recalls of one daughter.\nHe and his wife spend about ¥2,000 to ¥3,000 ($17 to $25) to buy a small decorated cake and some snacks. The children get to invite three to four close friends, the candles are blown out, “Happy Birthday” is sung, and then attendees give their gifts, limited to ¥500 ($4.21). And yes they give out goody bags — homemade cookies at a cost of about ¥100 (84 cents) for each guest.\nBeth Atkinson, an Australian expat based in Tokyo, has to source her party bags partly from the U.K. when tossing a bash, usually combined, for her 2- and 4-year-old girls. “Classic party supplies are hard to come by,” she says.\nGuests took home a pencil case, mini origami paper, eraser, washi tape (decorative masking tape), balloons, pencils for a grand total of ¥200 yen ($1.68) each. Otherwise, she tries to stick to ¥10,000 yen ($84) to ¥20,000 ($168) for most parties, but once spent ¥50,000 ($421) to hire a barbecue and kid-party entertainer. And given the tininess of apartments in Tokyo, the party goes outside or to a venue.\nOne of the best parties Atkinson went to was held in a restaurant with a play area in the center. “The place was completely booked for the party and it contained the children and occupied them whilst the adults were able to talk and enjoy a nice meal,” she said.\nMette-Louise Damgaard Birthday buns and bread rolls. Slide 5 of 7 The simple life in Denmark In Denmark, it seems laid-back parties are the norm. Mette-Louise Damgaard, mother to a 6-year-old boy and 8-year-old girl, lives with her family in Odense, the famed native city of Hans Christian Andersen. She has made an effort to stick to the birthday-party tradition she knew as a child — a homemade cake and a traditional sweet birthday bread roll, basic staples at Danish parties even to this day, she says.\n“I think most families try to have them at home … often it’s for a birthday cake or a treasure hunt or something like that. We just celebrated my son’s birthday and had 18 children from his class,” she said in a telephone interview. “We made a little treasure hunt where they found the treasure and it was sweets, which was the most expensive part.”\nSo her goody bag was just a small bundle of sweets, and made up half the cost, around 250 kroner ($38) of her parties, which average about 400 to 500 Danish krone ($62 to $77). That low price tag included a homemade pirate-themed cake, decked out in Playmobil characters in the above photo.\nIf there’s an escalation in a bid to outdo each other among Danish parents, she’s not seeing it. She said her daughter went to a party at the zoo once, but it was pretty unusual, as most parents stick to home-based celebrations. “It’s not too expensive in Denmark, as most places are not too big,” said Damgaard.\n@smarthappyorganized.com Booze boxes make the party. Slide 6 of 7 Battling to keep it basic in America? Clearly, British and American parents could learn something about keeping birthday celebrations in check from their overseas counterparts, though there are signs that the battle to make the best birthday ever will continue. Market researcher IBISWorld reports that revenue for party and event planners dropped during the recession years. Revenue has started to recover and the industry is expected to bring in $5.3 billion by 2020.\nColorado-based Autumn Leopold, mother of a seven-year-old boy and creator of the Smart Happy Organized blog, sees her friends increasingly throwing more old-fashioned parties, at the park, local pool or in their own backyard, with simple outdoor games.\nAmong her friends, one threw a homemade party for $75, though the norm is $250 to $300 on average, whether at home or a rented venue. The most she ever spent on a party was $500, with 24 children and 20 adults present, an at-home party with a tiki theme. It was almost perfect.\n@smarthappyorganized.com Cake fail Slide 6 of 7 “I bought all the supplies to make my own layer cake and it was a total Pinterest fail because it was so hot in August the icing melted. So instead of looking like a wave, it looked like a blue volcano had erupted,” said Leopold, in response to emailed questions.\nHer goody bag was a tiki mug filled with bath toys. She spent $12 per kid and tries to avoid the usual fake-tattoos and plastic toys. Leopold said she noticed goody bags getting popular after an episode of Tori Spelling and Dean McDermott’s reality show a few years ago, revealing celebrity moms going all out for their children’s birthday parties.\nHer best party cost about $200. She got empty boxes at the liquor store, painting them silver, and then painting some balls she picked up at Wal-Mart with Angry Birds characters, after which the children set up and knocked down the boxes with the balls, and ran through sprinklers. She caved at the end, though, and got some “lame” commercial party bags.\nWe mistakenly think our children are going to be made happy with material goods, says Lombardo, the psychologist. Then there’s the one-upmanship among parents, she adds, which boils down to the parents’ own sense of self.\n“My first book was on happiness. The research shows it’s not the amount of money you spend, but the experience you cultivate,” says Lombardo. “If you raise your children to enjoy hanging out with friends, then that’s going to be their normal and that’s what they’re going to enjoy.”\nIn other words, you don’t need the goody bag, the melted cake, the tears, and the stress in order for you and your children to create a lasting memory and have a good time.\n@smarthappyorganized.com Booze boxes make the party. Slide 7 of 7 Battling to keep it basic in America? Clearly, British and American parents could learn something about keeping birthday celebrations in check from their overseas counterparts, though there are signs that the battle to make the best birthday ever will continue. Market researcher IBISWorld reports that revenue for party and event planners dropped during the recession years. Revenue has started to recover and the industry is expected to bring in $5.3 billion by 2020.\nColorado-based Autumn Leopold, mother of a seven-year-old boy and creator of the Smart Happy Organized blog, sees her friends increasingly throwing more old-fashioned parties, at the park, local pool or in their own backyard, with simple outdoor games.\nAmong her friends, one threw a homemade party for $75, though the norm is $250 to $300 on average, whether at home or a rented venue. The most she ever spent on a party was $500, with 24 children and 20 adults present, an at-home party with a tiki theme. It was almost perfect.\n@smarthappyorganized.com Cake fail Slide 7 of 7 “I bought all the supplies to make my own layer cake and it was a total Pinterest fail because it was so hot in August the icing melted. So instead of looking like a wave, it looked like a blue volcano had erupted,” said Leopold, in response to emailed questions.\nHer goody bag was a tiki mug filled with bath toys. She spent $12 per kid and tries to avoid the usual fake-tattoos and plastic toys. Leopold said she noticed goody bags getting popular after an episode of Tori Spelling and Dean McDermott’s reality show a few years ago, revealing celebrity moms going all out for their children’s birthday parties.\nHer best party cost about $200. She got empty boxes at the liquor store, painting them silver, and then painting some balls she picked up at Wal-Mart with Angry Birds characters, after which the children set up and knocked down the boxes with the balls, and ran through sprinklers. She caved at the end, though, and got some “lame” commercial party bags.\nWe mistakenly think our children are going to be made happy with material goods, says Lombardo, the psychologist. Then there’s the one-upmanship among parents, she adds, which boils down to the parents’ own sense of self.\n“My first book was on happiness. The research shows it’s not the amount of money you spend, but the experience you cultivate,” says Lombardo. “If you raise your children to enjoy hanging out with friends, then that’s going to be their normal and that’s what they’re going to enjoy.”\nIn other words, you don’t need the goody bag, the melted cake, the tears, and the stress in order for you and your children to create a lasting memory and have a good time.\nPrev Page 1 2 3 4 5 6 7 Next Page You Might Also Like", "external_links": ["http://www.youtube.com/watch?v=fTQNttYD5T8", "http://smarthappyorganized.com/fortcollins-mom-organizing-blogger/"], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T20:31:36.075+03:00", "highlightTitle": ""}