{"organizations": [], "uuid": "2700d3238e50ea200dfc22b73c5de97a769477dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/h/q/x/a/h/image.related.articleLeadwide.620x349.gis7sl.png/1438785405720.jpg", "site_section": "http://www.canberratimes.com.au/business/carbon-economy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/comment-and-analysis/fortescue-shares-soar-on-hint-of-asset-sales-20150805-gis7sl.html", "country": "AU", "title": "Fortescue shares soar on hint of asset sales", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Fortescue shares soar on hint of asset sales", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T22:36:00.000+03:00", "replies_count": 0, "uuid": "2700d3238e50ea200dfc22b73c5de97a769477dd"}, "author": "", "url": "http://www.canberratimes.com.au/business/comment-and-analysis/fortescue-shares-soar-on-hint-of-asset-sales-20150805-gis7sl.html", "ord_in_thread": 0, "title": "Fortescue shares soar on hint of asset sales", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fortescue Metals Group's Andrew Forrest has long held that his company can ride out the iron ore price storm by chasing down its production costs, but the emerging consensus on the medium-term future of iron ore is that the current price band is not an aberration - it's the new normal. Photo: Michele Mossop\nThe sharemarket has given Andrew Forrest's Fortescue Metals Group a very clear message that it needs to sell assets in order to survive the iron ore price rout, with even Wednesday's speculation that the company might raise cash through asset sales pushing its share price up nearly 10 per cent by lunchtime.\nWhile Forrest has long held that his company can ride out the iron ore price storm by chasing down production costs, the emerging consensus on the medium-term future of iron ore is that the current price band of around US$50 ($A67) to US$55 per tonne is not an aberration - it's the new normal.\nIndeed, over recent months it has dipped below that price band a couple of times, to US$45 levels, and there are plenty of experts who argue it could go there again -- and even stay there for quite some time.\n(The 2015 federal budget assumed a price of US$48 per tonne.)\nAt these levels, Fortescue can keep its head above water, but it won't deliver decent returns. And if the price falls another notch, the company will face an existential moment. It has pared back costs and is predicting these will be lowered to US$39 per tonne, but all iron ore producers are finding it increasingly difficult to achieve even incremental gains in moving down the cost curve.\nFortescue undertook a reconnaissance mission a few years back to ascertain the appetite from infrastructure funds and Chinese steel makers for a piece of Fortescue's highly prized rail and port assets.\nAt the time it was clear that Forrest was not a particular fan of the strategy, but he went through the motions. While there was some buyer interest, it seems it was not at a price sufficient to tempt the seller over the line.\nForrest kept the idea of selling a minority stake in some of Fortescue's mines alive but there is no real evidence of any imminent deal.\nBut the world of iron ore -- Chinese demand, and oversupply -- has changed a lot over the past couple of years and, for producers, it is not a seller's market.\nThe price that Fortescue would attract for either a stake in its mines or its infrastructure must have diminished over the past year.\nA news report on Wednesday that China's Hebei Iron and Steel Group and Tewoo Group have approached Fortescue about acquiring a stake in its infrastructure assets has re-ignited the talk that this option is back on the table.\nIt is no real surprise. In recent months, Fortescue has been less inclined to hose down the notion -- and more prone to saying it won't comment on speculation.\nIn response to Wednesday's report, Fortescue told the ASX that \"whilst there is no imperative, Fortescue is open to commercial discussions with a range of groups on a regular basis at the mining asset level. There is no agreement of such nature with any party at this time.\"\nIt also noted that it was aware of its continuous disclosure obligations.\nWhile the statement took a bit of gloss off the earlier share price rise, the company still finished the day up almost 6 per cent.\nBut the share price response to Wednesday's speculation tells the company that investors are concerned about how Fortescue will fare in the medium term with a debt level that is still far too high (albeit debt with a long-dated repayment schedule). Investors would clearly like to see a few billion cut from the debt burden, which currently stands at about $9.5 billion net of cash. It's a debt pile that got more expensive a few months back when it was renegotiated in order to extend the timing of repayment.\nAnalysts generally agree that selling minority interests in mines would be a better option than letting go of a stake in any infrastructure assets. The latter would require Fortescue to enter into long contracts to use the infrastructure assets on an arm's-length basis -- which would be costly.\nMeanwhile, the noise around Fortescue diverted attention from what will be this week's big iron ore news: the delivery of Rio Tinto's interim results on Thursday afternoon. The market is already expecting earnings to roughly halve in the six months to June 30 from the same period last year, so the focus will be on further reductions in capital expenditure and dividends. To the extent Rio beats these expectations it will be on the back of taking out more in costs than it has already promised.\nA generous dividend will be a plus for the share price, but it risks another round of criticism from some analysts around whether this is prudent strategy in a more cash-constrained environment.", "external_links": [], "published": "2015-08-05T22:36:00.000+03:00", "crawled": "2015-08-06T11:44:56.604+03:00", "highlightTitle": ""}