{"organizations": [], "uuid": "69b48748d2b33d98d1cffd3d0c6eac760e8fd96e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/08/iggy_azalea_nose_job.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/iggy-azaleas-plastic-surgery-nose-job-adds-up-20000/", "country": "US", "title": "Iggy Azalea’s Plastic Surgery and Nose Job Adds Up to $20,000 or More", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "Iggy Azalea’s Plastic Surgery and Nose Job Adds Up to $20,000 or More", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T20:03:00.000+03:00", "replies_count": 0, "uuid": "69b48748d2b33d98d1cffd3d0c6eac760e8fd96e"}, "author": "Elyssa Kirkham", "url": "http://www.gobankingrates.com/personal-finance/iggy-azaleas-plastic-surgery-nose-job-adds-up-20000/", "ord_in_thread": 0, "title": "Iggy Azalea’s Plastic Surgery and Nose Job Adds Up to $20,000 or More", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Elyssa Kirkham August 5, 2015 \nIggy Azalea’s nose job was confirmed by the 25-year-old Australian rapper herself in an interview with Seventeen magazine said. “I’m not denying it,” Azalea told the teen magazine. “Denying it is lame.” Iggy Azalea’s Plastic Surgery Journey Was ‘Emotional’ and ‘Tough’ \nA nose job isn’t the only thing Iggy Azalea has got done; the rapper also told the magazine she has breast implants. Azalea decided to get plastic surgery after careful consideration and research, though. \n“Your perception of yourself can change a lot over time,” said Azalea, “so I think it’s important to wait and make sure it’s the right choice.” Her advice to young girls is to remember “you can’t change everything,” and “you’re never going to be perfect.” \nBut going under the knife isn’t a quick fix like it might seem, and Iggy Azalea’s plastic surgery journey proved to be more difficult than she originally expected. “Plastic surgery is an emotional journey,” said Azalea. “It’s no easy feat to live with your flaws and accept yourself — and it’s no easy feat to change yourself. Either way you look at it, it’s a tough journey.” \nRelated: Kesha’s Glitter Budget and Other Ridiculous Celebrity Expenses What Iggy Azalea’s Nose Job and Plastic Surgery Costs \nSo how much would plastic surgery like Iggy Azalea’s nose job and breast augmentation cost? Rhinoplasty, or a nose job, in Beverly Hills, Calif., costs between $3,000 and $9,000 depending on the surgeon’s skill and experience, according to Simoni Plastic Surgery . For celebrities like Iggy Azalea who have access to the best and most experienced plastic surgeons, it’s likely this procedure would run around $10,000. \nThen there are Iggy Azalea’s breast implants. “I don’t think you should be ashamed if you made a change to yourself, which is why I’ve spoken about the changes I’ve made, like with my breasts,” Azalea said of her breast augmentation to Seventeen magazine. \nAccording to the American Society of Plastic Surgeons , 2014 statistics found that the average cost of breast augmentation surgery is $3,708. But for stars who rely on their image as one of their biggest money-making assets, it’s worth it to pay more to ensure the highest-quality outcome. Some celebrities, such as Carmen Electra, are thought to have paid $10,000 on breast implants, reports The Richest. \nIn all, it’s safe to guess that Iggy Azalea’s plastic surgery journey has a starting price of around $20,000. If she opted for the best surgeons and also had other work done like a rumored chin implant, which runs between $3,000 and $5,000, Azalea might have shelled out as much as $25,000 for her new look. \nOf course, with Iggy Azalea’s net worth estimated at $10 million, the rapper can afford these elective surgeries. And with her status as a pop culture icon and rapper who banks on her looks and image, it might even count as a business expense.", "external_links": [], "published": "2015-08-05T20:03:00.000+03:00", "crawled": "2015-08-05T22:52:35.042+03:00", "highlightTitle": ""}