{"organizations": [], "uuid": "5a49f9e91497d998ca2cfb4bdc572043e17b39be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/n/m/o/d/image.related.afrArticleLead.620x365.giq68q.png/1438740688485.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/what-to-buy-as-the-big-four-banks-mark-time-20150803-giq68q", "country": "AU", "title": "What to buy as the big four banks mark time", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "What to buy as the big four banks mark time | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T08:06:00.000+03:00", "replies_count": 0, "uuid": "5a49f9e91497d998ca2cfb4bdc572043e17b39be"}, "author": "Trevor Sykes", "url": "http://www.afr.com/personal-finance/what-to-buy-as-the-big-four-banks-mark-time-20150803-giq68q", "ord_in_thread": 0, "title": "What to buy as the big four banks mark time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Investors may have to look for alternatives. Michel O'Sullivan by Trevor Sykes For two decades, bank shares have been the cornerstone of any well-constructed investment portfolio. Anyone who loaded up with, say, Westpac at $5 or the Commonwealth Bank at $6, could have forgotten about the rest of the market, lived on the dividends and just spent 20 years playing golf.\nAlas, if the pundits are right (and they are, sometimes) that magnificent run is about to stall. The economy is tightening, while the Australian Prudential Regulation Authority (APRA) is about to require the trading banks to increase their common equity tier 1 (CET1) ratios or the amount of equity and disclosed earnings they hold in relation to more risky assets.\nAPRA has said the banks need to increase their CET1 ratios by 200 basis points to be \"comfortably positioned\" in the top quartile compared with overseas banks.\nAPRA's stance is challengeable. Many of the lauded foreign banks are probably holding sovereign debt which is risk-rated at 100 per cent, even though the issuers are fiscally perilous European nations. To a layman, the Australian big four banks look as solid as any in the world and APRA's edict may be merely to cover its own backside in the event of any global banking collapse.\nInvestors may have to look for alternatives. Michel O'Sullivan But unfortunately, the banks must do as the regulator bids and investors have to live with the consequences. The banks can probably lift their CET1 ratios some distance by simply giving larger discounts on their dividend reinvestment plans and bridge the rest of the gap by making relatively modest rights issues while their share prices are high.\nBoth measures will be slightly dilutionary to existing shareholders in an environment where the bank's earnings growth is likely to slow. So the outlook is for bank share prices to mark time over the next year while dividends are held at current levels. Meanwhile interest rates look bound to stay around historic lows.\nHybrids One option for investors is to leave bank shares alone for the time being, but to consider their hybrids. The hybrids in the accompanying table are a selection of those issued by banks or leading financiers. The prices are for market close on July 31, when bank bill rates were 2.18 per cent for 90 days and 2.1 per cent for 180. The hybrids chosen were all issued at $100 and will be redeemed or converted into shares at maturity.\n So there's no prospect of meaningful capital growth in these hybrids. Indeed, any that sell above $100, such as BOQPD, will convert on maturity at a discount to the current market price.\nThe yields are as good as can be found on the current market, commensurate with reasonable safety. NABPCs, for example, were issued at the 90-day bank bill rate plus 3.5 per cent, which gives them a coupon rate of 5.65 per cent before brokerage. As the $5.65 was being paid on notes selling for $98.42 the effective running yield was more than 5.7 per cent. And as they are fully franked, the gross yield blows out to more than 8 per cent.\nAdmittedly investors don't get the full gross yield until the ATO credits them and maybe sends a cheque back, so it's partly a deferred benefit. However, as the hybrids rise and fall on the interest rate tide, investors have some protection against either rising or falling rates. Meanwhile the hybrids offer a lot better return than bank deposits.\nThe word 'hybrid' covers a multitude of financial creations, including corporate bonds, unsecured notes and preference shares. For investors who want maximum safety, however, it's hard to go past the hybrids issued by the banks.\nOne point worth checking is whether the hybrid has a maturity date. If it does you can be reasonably assured of getting your $100 capital back at that time. The reset dates tend to work in much the same way. Hybrids aren't sexy but if interest rates stay low for the foreseeable future, which looks likely, you can sleep at night holding them.\n[Disclosure: The author's super fund holds CGFPA and Westpac]", "external_links": [], "published": "2015-08-07T08:06:00.000+03:00", "crawled": "2015-08-07T10:56:31.557+03:00", "highlightTitle": ""}