{"organizations": [], "uuid": "c8bd0f4cf6be891fea02fa935b0b40688d5f6736", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/1ZcRqbSzLT7AEalD0EaAow--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/graph-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/ftse-records-biggest-weekly-loss-174313223.html", "country": "GB", "title": "FTSE Records Biggest Weekly Loss Of 2015", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "FTSE Records Biggest Weekly Loss Of 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T20:43:00.000+03:00", "replies_count": 0, "uuid": "c8bd0f4cf6be891fea02fa935b0b40688d5f6736"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ftse-records-biggest-weekly-loss-174313223.html", "ord_in_thread": 0, "title": "FTSE Records Biggest Weekly Loss Of 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 19:27 BST - UK Markets closed FTSE Records Biggest Weekly Loss Of 2015 By (c) Sky News 2015 | Sky News – 44 minutes ago View Photo \n\nThe FTSE 100 has recorded its biggest weekly loss of the year amid concerns over the failing Chinese financial market. \nThe index closed down at 6,187.65 points on Friday, a fall of 2.8% for the day's trading and a drop of more than 5% for the week. \nIt (Other OTC: ITGL - news ) is the index's worst performance since December , and comes after survey results showed that manufacturing in China had fallen by an unexpectedly large amount in August. \nThe index is down for nine straight sessions, its longest losing streak since 2011. It is almost 13% below an all-time high hit in April. \nChina's main index in Shanghai was also 4.2% down on Friday, falling below the 200-day moving average for the first time since July 2014. \nMarkets linked to the mainland also suffered with Hong Kong's Hang Seng dropping 1.9%. \nAnalysts have warned that the volatility is likely to continue as concerns grow over weak global growth and possible deflation. \n\"There are many, and legitimate, contributing factors to the global economic slowdown narrative,\" said Nigel Green, CEO of deVere Group. \n\"These include China-related issues, such as the recent devaluation of its currency, the stock market's boom and bust in recent months, and slower GDP growth. \n\"I believe that this volatility is likely to remain with us, at least until the end of the year ... But for most long-term investors, fears of a near-term financial apocalypse are overdone.\" \nThe broader FTSE 350 mining index also languished near its lowest level since 2009. \nMiners are cutting back on capital spending to cope with the China-led hit to metals prices. Rio Tinto (LSE: RIO.L - news ) said it expected to ship more iron ore to China in 2015. \nShares (Berlin: DI6.BE - news ) of Tesco (Xetra: 852647 - news ) fell broadly in line with the market after Reuters reported private-equity firms Affinity Equity Partners and KKR had teamed up to bid for the retailer's South Korean unit valued at about $6bn. \n\"Global markets are in panic mode as the full scale of China's slowdown becomes clearer,\" Angus Nicholson, market analyst at IG (LSE: IGG.L - news ) , said. \n\"The word on everyone's lips is deflation - poison for equity markets. \n\"The phenomenal six-year bull market may finally meet its match in China-induced global deflation.\"", "external_links": [], "published": "2015-08-21T20:43:00.000+03:00", "crawled": "2015-08-21T21:29:51.143+03:00", "highlightTitle": ""}