{"organizations": [], "uuid": "a23da3514309c68d0f14b1b2e5d4c2759ab3abc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-telecommunications/?format=rss", "section_title": "Telecommunications News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/time-come-buy-bombed-monitise-071433095.html", "country": "US", "title": "Has The Time Come To Buy Bombed-Out Monitise Plc And Tungsten Corp PLC?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Has The Time Come To Buy Bombed-Out Monitise Plc And Tungsten Corp PLC?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T10:14:00.000+03:00", "replies_count": 0, "uuid": "a23da3514309c68d0f14b1b2e5d4c2759ab3abc8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/time-come-buy-bombed-monitise-071433095.html", "ord_in_thread": 0, "title": "Has The Time Come To Buy Bombed-Out Monitise Plc And Tungsten Corp PLC?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "67.00 -2.5000 \nMobile money firm Monitise (LSE: MONI) is a company I've been none too flattering about in the past. However, with the shares having fallen from a high of 80p last year to just 5p today, could there now be value in this bombed-out stock? Similarly, is e-invoicing firm Tungsten (LSE: TUNG) worth reconsideration, with its shares have fallen from 400p last year to 70p today? \nMonitise \nMonitise boasts relationships with a roll-call of blue-chip companies, including Banco Santander and IBM , and describes itself in rather impressive terms: \"Monitise plc has created the most extensive and commercially successful mobile banking and payments service in the world\" . \nFor the 12 months ended December 2014, the world's most commercially successful mobile money firm posted an EBITDA (earnings before interest, tax, depreciation and amortisation) loss of £52m on revenue of £91m. However, the company has reiterated a target of positive EBITDA for its financial year ending June 2016. \nThe reason why I think Monitise has potential right now, though, is connected to the company putting itself up for sale on 22 January, then calling off the process on 25 March, having rejected \"a number of expressions of interest from various parties\" , which the Board believed undervalued the business. \nNow, I've no idea about Monitise's intrinsic worth. What I do know is that trade buyers were interested when the company went up for sale with a market value of £350m in January. I would suggest that the parties concerned value Monitise significantly higher than its current price in the market of £110m. If so, there would appear to be plenty of scope for a new offer for Monitise at a 100%+ premium, giving investors today significant upside. \nMonitise's Board may have waved suitors away just a few months ago, but the appetite of some major shareholders for a sale of the company would appear to have increased markedly since then. In a series of trades during July, Monitise's largest shareholder -- US group Omega -- reduced its holding from 13.9% to 10.9%. Also during the month, it was revealed that 5.3% shareholder Visa Europe intends to reduce its stake over time. \nWith strong indications that Monitise is worth more than its current market value in the eyes of trade buyers, and that some institutional shareholders appear happy to exit at a relatively low price, I think the stock currently looks a speculative buy on the potential for corporate activity. \nTungsten \nTungsten's relationship with blue-chip companies is, if anything, more impressive than Monitise's. Tungsten trumpets that it serves \"many of the world's largest companies\" , including \"56% of the Fortune 500 and 67% of the FTSE 100 \" . \nFor its financial year ended April 2015, this processor of global transactions worth £121bn, posted revenue of £23m and an EBITDA loss of £25m. House broker forecasts for positive EBITDA have been pushed back to the company's financial year ending April 2018, according to data from Thomson Reuters . \nAs with Monitise, I've no idea about Tungsten's intrinsic worth. But, unlike the case of Monitise, I can find no clues as to what kind of valuation a trade buyer might place on the e-invoicing firm. In the absence of such an independent valuation, leaving only the house broker's numbers to go on (of which I'm always sceptical), I find it impossible to reach a conclusion as to whether Tungsten's current market value of £88m is fair -- or whether it might be worth half or double that figure. As such, Monitise is my preferred choice for a speculative buy. \nOf course, there are many other smaller companies with high potential in the market today. And some are already profitable. In fact, a terrific opportunity has just been unearthed by the Motley Fool's shrewd small-cap analyst Mark Rogers. \nIn \" 1 Top Small-Cap Stock From The Motley Fool \", Mark explains why this company has strong near-term growth prospects, and long-term upside from potential entry into the US market. \nFor a limited time only you can access Mark's exclusive research report for FREE and without obligation -- click here now while the report is still available! \nG A Chester has no position in any shares mentioned. The Motley Fool UK owns shares of Monitise. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-03T10:14:00.000+03:00", "crawled": "2015-08-03T10:59:04.809+03:00", "highlightTitle": ""}