{"organizations": [], "uuid": "a64f7d207e98231dac9426d64925eef91365f089", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/business/finance", "section_title": "Winnipeg Free Press: Personal Finance", "url": "http://www.winnipegfreepress.com/business/finance/canadian-housing-markets-mostly-stable-hot-pockets-in-toronto-vancouver-banks-323437001.html", "country": "US", "title": "Canadian housing markets mostly stable; hot pockets in Toronto, Vancouver: banks", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Canadian housing markets mostly stable; hot pockets in Toronto, Vancouver: banks - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T13:06:00.000+03:00", "replies_count": 0, "uuid": "a64f7d207e98231dac9426d64925eef91365f089"}, "author": "The Canadian Press", "url": "http://www.winnipegfreepress.com/business/finance/canadian-housing-markets-mostly-stable-hot-pockets-in-toronto-vancouver-banks-323437001.html", "ord_in_thread": 0, "title": "Canadian housing markets mostly stable; hot pockets in Toronto, Vancouver: banks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO - The cost of owning a home has been holding steady in most parts of Canada, but affordability declined during the second quarter in the two most expensive markets, Vancouver and Toronto, a report by Royal Bank says.\nIn its latest analysis of housing trends, RBC also said Monday it expects prices will continue to rise in Toronto and Vancouver in the short term because of tight supplies of detached homes for sale.\nThe bank said supply and demand are more balanced in other Canadian markets and affordability has been close to the long-term average since 1985.\nIn a separate report, TD Bank (TSX:TD) said it expects a decline in Canadian borrowing rates in the first half of 2015 will likely boost demand into the early fall, but then have a waning effect in the late stages of this year.\nIt says the low-rate environment has helped to keep markets \"humming\" in hot markets and reduce the impact of low commodity prices in other markets, particularly in Alberta and Saskatchewan.\nTD said commodity-dependent regions such as Edmonton, Calgary, Regina and Saskatoon \"have weakened considerably so far this year, but to a lesser degree than was originally anticipated.\"\n\"Elsewhere, markets that had embarked on soft landings over the last few years, including Ottawa, Montreal and Quebec City, have seen activity either stabilize or perk up,\" TD said.\nThe RBC quarterly report takes into account income, property prices and the typical costs of home ownership, such as mortgage payments, utilities, taxes and fees when calculating its affordability measure.\n\"The central theme for housing affordability in Canada continues to be the wide divide between stretched conditions in Toronto and Vancouver, and fairly neutral conditions in the rest of the country,\" RBC said in its report.\n\"The split, in fact, widened during the second quarter of 2015, with strong price increases for single-detached homes in Toronto and Vancouver squeezing affordability further in these markets, whereas a slow pace of appreciation — at best —kept the cost of home ownership mostly stable in the majority of other markets.\"\nRBC said there was evidence that buyers were more confident in Alberta than they had been in the previous two quarters as a result of the dramatic decline in oil prices, but \"prices still remained under slight downward pressure for the most part . . . \"\n\"The picture was a little different in Saskatchewan where a recovery in single-detached home prices negatively affected the affordability of bungalows and two-storey homes.\"\nIn Quebec, RBC said home prices were \"quite stagnant\" and that contributed to improved housing affordability.\n\"Widespread improvements similarly took place in Atlantic Canada, although there remain few indications that housing demand is turning a corner in the region.\"\nReport Error Submit a Tip Refund Refund", "external_links": [], "published": "2015-08-31T13:06:00.000+03:00", "crawled": "2015-08-31T18:07:25.867+03:00", "highlightTitle": ""}