{"organizations": [], "uuid": "68ef9743d4ef5f4a8e9f9ddecf17e283bb713963", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/nifty-sensex-looks-weak-again---monday-closing-report/43246.html", "country": "IN", "title": "Nifty, Sensex looks weak again - Monday closing report", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Nifty, Sensex looks weak again - Monday closing report", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T17:02:00.000+03:00", "replies_count": 0, "uuid": "68ef9743d4ef5f4a8e9f9ddecf17e283bb713963"}, "author": "Moneylife Digital Team &amp; IANS", "url": "http://www.moneylife.in/article/nifty-sensex-looks-weak-again---monday-closing-report/43246.html", "ord_in_thread": 0, "title": "Nifty, Sensex looks weak again - Monday closing report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Nifty, Sensex looks weak again - Monday closing report 43246 Nifty, Sensex looks weak again - Monday closing report 0 Comments, Be the first to comment Moneylife Digital Team & IANS | 31/08/2015 07:32 PM | As long as Nifty closes below 7,980, the trend is down We had mentioned that we suspect that the market will struggle to rally and may suffer a further dip later in the coming week. On Monday, the market witnessed a downtrend and suffered marginal losses. Despite hopes of healthy economic expansion data, the slide in Asian bourses and a weaker rupee dented the Indian equity markets during the mid-afternoon trade session on Monday. As a consequence of a slide in the Asian markets, the rupee ended weaker by 35 paisa at Rs66.50 from its previous close of Rs66.15 on Friday. Bearish sentiments due to negative Asian cues dampened trade leading to a fall by 109.29 points or 0.41% on the S&P BSE Sensex. The S&P BSE Sensex, which opened at 26,469.42 points, closed at 26,283.09 points, down 109.29 points or 0.41% from the previous day's close at 26,392.38 points. The S&P BSE Sensex touched a high of 26,504.73 points and a low of 26,215.16 points in the intra-day trade. Weak sentiments were also witnessed at the wider 50-scrip Nifty of the National Stock Exchange (NSE). The CNX Nifty of the NSE declined by 30.65 points or 0.38% to 7,971.30 points. Analysts pointed out that the negative cues emanating out of Asian markets, especially due to the slide in the Chinese markets, made investors reluctant to chase higher prices. Sector-wise, capital goods, automobile, banks, consumer durables and fast moving consumer goods (FMCG) came under heavy selling pressure. The S&P BSE capital goods index plunged by 176.07 points, the automobile index receded by 138.23 points, the banks contracted by 66.27 points, the consumer durables index declined by 53.94 points and FMCG index tumbled by 31.29 points. On the other hand, healthcare index augmented by 316.06 points, metal index gained by 44.35 points and oil and gas sector was higher by 24.31 points. Major Sensex gainers during Monday's trade were: Lupin, up 3.55% at Rs.1,928.85; Cipla, up 3.30% at Rs681.50; Dr.Reddy's Lab, up 3.15% at Rs4,310.15; Coal India, up 2.50% at Rs366.35; and Vedanta, up 2.34% at Rs.98.60. The major Sensex losers were: BHEL, down 3.45% at Rs226.50; Bharti Airtel, down 2.14% at Rs354.50; Hindalco Industries, down 2.08% at Rs80.05; ICICI Bank, down 1.92% at Rs278.10; and Reliance Industries, down 1.65% at Rs856.80. Among the Asian markets, Japan's Nikkei tumbled by 1.28%. Hong Kong's Hang Seng gained by 0.27%. China's Shanghai Composite Index dropped by 0.78%. In Europe, London's FTSE 100 index rose by 0.90%, French CAC 40 tumbled by 0.50% and Germany's DAX Index slipped by 0.43% at close of trading here. The top gainers and top losers of major indices are given in the table below: The closing values of major Asian indices are given below:", "external_links": [], "published": "2015-08-31T17:02:00.000+03:00", "crawled": "2015-08-31T17:29:37.307+03:00", "highlightTitle": ""}