{"organizations": [], "uuid": "5a61fbf5527d548c1d6b3b3e2d607fa8ffa962fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/miner-strikes-gold-kazakh-currency-195720984.html", "country": "US", "title": "Miner strikes gold as Kazakh currency drops by a quarter", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Miner strikes gold as Kazakh currency drops by a quarter", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T22:57:00.000+03:00", "replies_count": 0, "uuid": "5a61fbf5527d548c1d6b3b3e2d607fa8ffa962fa"}, "author": "", "url": "https://uk.finance.yahoo.com/news/miner-strikes-gold-kazakh-currency-195720984.html", "ord_in_thread": 0, "title": "Miner strikes gold as Kazakh currency drops by a quarter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 20, 2015, 21:37 BST - UK Markets closed Miner strikes gold as Kazakh currency drops by a quarter By Tara Cunningham | Telegraph – 39 minutes ago DBAGF 0.00 \nKaz Minerals (LSE: KAZ.L - news ) jumped by almost 14pc after the National Bank (NYSE: NBHC - news ) of Kazakhstan decided to let its currency float freely. \nShares (Berlin: DI6.BE - news ) in mid-cap miner Kaz Minerals rallied after the National Bank of Kazakhstan decided to let its currency float freely . \nWhile the tenge immediately devalued by around 27pc, the implications for Kaz Minerals were strongly positive. With 55pc of the company’s costs denominated in tenge, the stock jumped by almost 20pc. The floating of the currency coincided with the release of the group’s half-year results, which came in about 18pc ahead of market expectations. \nCommodity stocks have been badly bruised by a slowdown in China, the world’s largest metals consumer. However, Oleg Novachuk, the company’s chief executive, said he was “very bullish” on copper. \n“Whilst lower commodity prices have affected the profitability and cash flow generation of our existing assets in the first half of 2015, we believe copper is a commodity with strong medium and long-term fundamentals,” Mr Novachuk said. Kaz Minerals also revised its cost guidance 7pc lower as a result of the cost performance in the first half of the year and the devaluation in the tenge. \nMichael Flitton, of Citigroup (NYSE: C - news ) , said: “While the currency devaluation of the tenge has clearly aided the quantum of cost guidance reduction, the run rate in the first half of the year suggests sustainable savings were already ahead of expectations.” The stock recorded its biggest one-day climb since February 2014, up 21.7p, or 13.9pc, to 177.4p. Kazakhstan-focused producer Central Asia Metals (Stuttgart: 9C3.SG - news ) also jumped following the devaluation in the local currency. Shares leapt 4.9pc to 160p. \nMeanwhile, all attention was on Britain’s benchmark index as it entered a correction , falling by 10.4pc since its record high in April of 7,104. The FTSE 100 tumbled 35.56 points, or 0.6pc, to 6,367.89, marking its worst losing streak since 2011. David Madden, of IG (LSE: IGG.L - news ) , said: “The great worry is that China will undergo a dramatic drop in the rate of growth, and the knock-on effect to Europe will damage the recovery”. \nThe biggest fallers on the FTSE 100 were hit by trading ex-dividend. Mondi lost 46p to close at £14.88, Taylor Wimpey (LSE: TW.L - news ) fell 5.5p to 198.5p, Carnival slipped 92p to £33.58, and Prudential (HKSE: 2378.HK - news ) was 42.5p lower at £14.72. \nPlatinum producer Lonmin (LSE: LMI.L - news ) went from FTSE 250 laggard to leader in a mere 24 hours. Investors appeared to have a short memory, as concerns that the FTSE 250 company will struggle to raise more debt next year all but disappeared. On Wednesday, the stock plummeted to a 27-year low of 28.8p following RBC Capital Markets’ move to lower its target price. \nHowever, platinum prices climbed to a five-week high of $1,025 yesterday, as minutes of the Federal Reserve’s latest policy meeting signalled an interest rate hike next month is unlikely. Lonmin shares leapt 22.4pc to 35.3p. \nThe Fed minutes also helped gold push higher to $1,151.9. Gold (Other OTC: GDCWF - news ) miner Randgold Resources became the darling of the FTSE 100, 233p higher at £42.55, while Fresnillo (Other OTC: FNLPF - news ) added 36.5p to 684.5p. \nAfter the mining sector hit its lowest level in six years on Wednesday, it bounced back as Anglo American (LSE: AAL.L - news ) edged 4.4pc higher to 740.5p. Antofagasta (LSE: ANTO.L - news ) also advanced 3.5pc to 571.5p, Glencore (Xetra: A1JAGV - news ) rose 2.5pc to 162.85p, BHP Billiton (NYSE: BBL - news ) jumped 2pc to £10.93 and Rio Tinto (LSE: RIO.L - news ) added 1.6pc to £23.61. \nPremier Oil (LSE: PMO.L - news ) leapt 15.4p, or 16pc, to 111.5p after half-year results impressed investors , despite posting a loss after tax of $375.2m. The mid-cap company also said it had renegotiated debt covenants with banks and bondholders to mid-2017 to ensure sufficient headroom should weak oil prices persist. Nathan Piper, of RBC Capital Markets, said “Premier Oil are making the changes they should”, highlighting cost control as an area in which it has excelled. \nFollowing a robust set of half-year results on Wednesday, Admiral Group (LSE: ADM.L - news ) extended its gains after four brokers Deutsche Bank (Other OTC: DBAGF - news ) , Credit Suisse (Other OTC: CDSSF - news ) , Barclays (LSE: BARC.L - news ) and Canaccord Genuity (Other OTC: CCORF - news ) all revised the stock’s target price upward. Ben Cohen, of Canaccord Genuity, who upgraded the stock from “sell” to “hold” said the move reflected the motor insurer’s “superior track record and cost advantage”. The stock was changing hands at £15.87p, up 65p, or 4.3pc. \nElectronics distributor Premier Farnell (LSE: PFL.L - news ) tumbled in afternoon trade, down 5.3pc to 127.8p, as a weakness in US industrials rippled its way across the Atlantic. Separately, Jefferies cut the stock’s target price to 180p from 210p, in response to the recent profit warning. In July, the FTSE 250 company noted sales per day growth had slowed in the first quarter from 5.4pc to 1.2pc in quarter two.", "external_links": [], "published": "2015-08-20T22:57:00.000+03:00", "crawled": "2015-08-20T23:37:19.663+03:00", "highlightTitle": ""}