{"organizations": ["Associated Press"], "uuid": "89d1df0da3d3285ddf46c0451b4e6fc74346417b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/category-currencies/?format=rss", "section_title": "Currency & Forex News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/eurozone-economy-resilient-face-greece-085009925.html", "country": "US", "title": "Eurozone economy resilient in face of Greece, survey shows", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Eurozone economy resilient in face of Greece, survey shows", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T12:14:00.000+03:00", "replies_count": 0, "uuid": "89d1df0da3d3285ddf46c0451b4e6fc74346417b"}, "author": "", "url": "https://au.finance.yahoo.com/news/eurozone-economy-resilient-face-greece-085009925.html", "ord_in_thread": 0, "title": "Eurozone economy resilient in face of Greece, survey shows", "locations": ["Greece", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fri, Aug 21, 2015, 9:17 PM AEST - Australia Markets closed Eurozone economy resilient in face of Greece, survey shows In face of Greek debt crisis, survey says eurozone economy was resilient Associated Press – 2 hours 3 minutes ago Recommend Print \nLONDON (AP) -- The 19-country eurozone economy was resilient in the face of the recent crisis in Greece, which saw the country on the brink of a euro exit, a closely watched survey showed Friday. \nFinancial information company Markit said its purchasing managers' index for the eurozone — a broad index of business activity — rose to 54.1 points in August from 53.9 the previous month. \nAnything above 50 means the economy is expanding. Markit estimates the economy to be growing at a quarterly rate of 0.4 percent, slightly ahead of the 0.3 percent recorded in the second quarter. \nThe increase was largely due to a pick-up in Germany, Europe's biggest economy, and in some of the countries that have been at the forefront of the region's debt crisis over the past few years. France, though, was a laggard once again. \nRob Dobson, senior economist at Markit, said the survey suggests that the eurozone is still experiencing \"one of its best periods of economic growth and job creation\" over the past four years, \"highlighting the resilience of the economy through last month's rollercoaster events of the Greek debt crisis and the ongoing negotiations to tie up the full details surrounding the third bailout.\" \nIn July, Greece's future in the euro currency was under threat until Greek Prime Minister Alexis Tsipras backed a third international bailout for the country. The final touches to the 86 billion-euro ($93 billion) rescue deal were completed this week and the first funds arrived in Athens. \nNow that the bailout has been completed, Tsipras has resigned ahead of likely elections next month, which he hopes will see him secure a mandate to push the reforms demanded by creditors. @y7finance on Twitter, become a fan on Facebook", "external_links": [], "published": "2015-08-21T12:14:00.000+03:00", "crawled": "2015-08-21T14:19:52.680+03:00", "highlightTitle": ""}