{"organizations": [], "uuid": "1d5f5c47615cdeb16f51fcad46d0be83f79b60d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/lifestyle/travel-tourism/70-travellers-feel-souvenirs-are-an-important-part-of-the-holiday-experience-survey/110173", "country": "IE", "title": "70 % travellers feel souvenirs are an important part of the holiday experience: Survey", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "70 % travellers feel souvenirs are an important part of the holiday experience: Survey | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T01:47:00.000+03:00", "replies_count": 0, "uuid": "1d5f5c47615cdeb16f51fcad46d0be83f79b60d9"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/travel-tourism/70-travellers-feel-souvenirs-are-an-important-part-of-the-holiday-experience-survey/110173", "ord_in_thread": 0, "title": "70 % travellers feel souvenirs are an important part of the holiday experience: Survey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Shahrukh Khan wraps Bulgaria shoot of 'Dilwale' Kareena Kareena to be the showstopper at the Lakme Grand Finale Hulk Hogan mourns wrestler pal Roddy Piper's death According to the second set of findings from the Holiday Inn Souvenir Study, 70 per cent of respondents feel that souvenirs are an important part of the holiday experience, and only 20 per cent of travellers return home empty handed.\nAlmost half of the respondents attributed this to the desire of bringing part of the holiday home though only one in 10 respondents are souvenir hobbyists. It was also found that younger travellers are more likely to place importance on buying souvenirs when compared to older travellers.\nThe new results follow on from the first edition of the Holiday Inn Souvenir Study, the “Evolution of Souvenirs”, which explored the development of souvenirs over time.\nWith over one billion tourists traversing the globe every year, the survey results, which are showcased in an infographic, takes a closer look at the multi-million dollar souvenir industry, discovering the latest trends in souvenir buying behaviour across the Asia, Middle East and Africa (AMEA) region. The Value of Souvenirs infographic reveals travellers’ motivations behind souvenir buying, their preferred souvenir buying haunts and gift preference.\nAs a region, buying souvenirs for family members remained as the top priority with an average spend of US$30 per gift, with travellers from Australia, Southeast Asia and Middle East prioritising their partners first. Buying gifts for co-workers fell lower on the list, except for travellers from Japan, where it is customary to give souvenirs to colleagues. The average budget set aside for colleagues is about US$13. Across the region, Japanese travellers were also found to be the most receptive to souvenir requests from others ahead of a trip.\nWith the growing trend towards locally-sourced and handmade products, over half of all travellers opt to do their souvenir shopping in local markets or specialty stores. Contrary to popular belief, less than a quarter of travellers will purchase souvenirs from tourist landmarks or attractions. The least preferred souvenirs were found to be novelty and educational items, and decorative trinkets.\nOver 900 travellers, from Australasia, India, Japan, the Middle East, South East Asia and South Africa took part in the survey, which focused on understanding the value travellers place on buying and receiving souvenirs as part of their travel experience.\nAccording to the findings from the survey, 34 per cent of Indian travellers are happy to accommodate a souvenir request from their friends or family. One of the most popular souvenirs that tourists visiting India can purchase are miniature replicas of the Taj Mahal. The monument is widely considered to be one of the most beautiful buildings ever created and an example of Mughal art. Tourists can buy a replica of the Taj Mahal across the country.\nFirst Published on July 29, 2015 5:47 pm", "external_links": [], "published": "2015-07-30T01:47:00.000+03:00", "crawled": "2015-08-01T14:41:37.014+03:00", "highlightTitle": ""}