{"organizations": [], "uuid": "a3499f0025f4da522e13434e2c6178baaecb1314", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/o/d/p/4/image.related.articleLeadwide.620x349.giyvs6.png/1439505942164.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/3510/health-care/health-care-equipment-and-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/apple-said-to-delay-tv-service-as-negotiations-stall-20150813-giyvs6.html", "country": "AU", "title": "Apple said to delay TV service as negotiations stall", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Apple said to delay TV service as negotiations stall", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "a3499f0025f4da522e13434e2c6178baaecb1314"}, "author": "Peter Burrows, Lucas Shaw and Gerry Smith", "url": "http://www.smh.com.au/business/apple-said-to-delay-tv-service-as-negotiations-stall-20150813-giyvs6.html", "ord_in_thread": 0, "title": "Apple said to delay TV service as negotiations stall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Television programming is a key part of Apple's strategy to use music, information and entertainment to keep the company at the centre of people's digital lives. Photo: Bloomberg\nApple customers waiting for the company to revolutionise live television as it did music and phones will have to keep waiting, at least until next year.\nThe company wanted to introduce this year a live TV service delivered via the internet, but is now aiming for 2016, said people familiar with Apple's plans. Talks to license programming from TV networks such as those owned by CBS and Rupert Murdoch's 21st Century Fox are progressing slowly, some of the people said. Apple also doesn't have the computer network capacity in place to ensure a good viewing experience, said some of the people, who asked not to be identified because the talks are private.\nWithout enough content deals in place, Apple has scrapped plans to announce the service at a September 9 event in San Francisco, which would have coincided with the beginning of the new network TV season in the US, the people said. The Cupertino, California-based company still plans to introduce a more powerful version of its Apple TV set-top box at the event, said the people, but customers -- for now, at least -- will need a cable or satellite TV subscription or an antenna to watch live network television.\nTelevision programming is a key part of Apple's strategy to use music, information and entertainment to keep the company and its devices at the centre of people's digital lives.\nThe main stumbling block is the price of content. Just as Apple once convinced music labels to sell songs for a lowly 99 US cents, it wants to offer a package of popular channels for $US40 ($54) a month, the people said. That's roughly half of the average cable bill in the US.\nHigher payments The TV programmers expect to receive more, not less, money from new internet-based services like Apple than from existing cable and satellite TV partners, because they're new to the market and are seeking to gain share. Talks with CBS, Fox and NBC, owned by Comcast, have been mired for the past several months, said the people. The prospect of a new player willing to pay for their networks is particularly appealing to media conglomerates, given the declining number of pay-TV subscribers.\nNegotiations between content providers and pay-TV companies often drag. Dish Network spent years securing a small bundle of cable channels for a service called Sling TV. Introduced in January, it includes Disney's ESPN and Time Warner's TNT and a few other live channels at a cost of $US20 a month.\nApple, which has been trying for more than a decade to remake video entertainment, is struggling to find the right mix of channels to appeal to cord-cutters for about $US40, said the people, who couldn't say when or if the negotiations would be completed.\nTV revenue A live TV service would provide a new revenue stream at a time when Apple is under pressure to bolster its long-term growth outlook. With iPhone sales slowing, the world's most valuable company is projected to grow revenue just 5.3 per cent in 2016, down from 28 per cent this fiscal year. Shares have fallen 13 per cent since reaching this year's high of $US133 in February.\nA TV service may generate $US2 billion to $US3 billion in revenue by 2018, said Daniel Ives, an analyst at FBR Capital Markets. That's not large relative to Apple's estimated $US233 billion in sales for the fiscal year ending in September, but a TV service would be essential in helping the company become a one-stop shop for entertainment.\n\"Streaming TV would provide another future growth avenue into the next generation consumer,\" Ives said. \"It represents the next frontier for Cook & Co.,\" referring to Apple Chief Executive Officer Tim Cook.\nCapacity concerns In addition to securing content, Apple has encountered problems creating a computer network that will ensure a fast, glitch-free viewing experience throughout the US. Such a network requires storing popular shows close to viewers, so each time a customer in New York for example wants to see local baseball game or the evening news, the shows don't have to be streamed all the way from one of Apple's four data centers in California, Nevada, North Carolina and Oregon.\n\"Apple could send every bit from one central point, but the bandwidth costs would be exorbitant,\" said Nick Del Deo, an analyst at Moffettnathanson. \"Plus, the service would be terrible.\"\nApple, Akamai Apple has worked for years with Akamai Technologies, which runs a \"content distribution network\" of 170,000 servers in thousands of locations, to speed delivery of music, movie downloads and app updates. More recently, it has been building some of its own capacity, but doesn't have enough to support a major TV rollout, said the people. Apple was Cambridge, Massachusetts-based Akamai's largest customer last year, according to data compiled by Bloomberg.\nAkamai CEO Tom Leighton declined to say whether the company's increased spending was tied to an Apple TV service. Christine Monaghan, a spokeswoman for Apple, didn't immediately respond to a request for comment.\nApple also is in talks with at least one operator of small \"micro-data centers\" that have popped up in areas far from content distributors' large data centers. Part of Apple's challenge is its insistence on creating a broad, national TV service.\nBuzzfeed first reported that Apple will introduce its new set-top device at the company's September event.\nBloomberg", "external_links": [], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-14T05:49:30.059+03:00", "highlightTitle": ""}