{"organizations": [], "uuid": "65ff0c0bec1b8c886f76e394b40db77ac2f4c1ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/07/press-digest-wsj-idUSL3N10I1YA20150807", "country": "US", "title": "PRESS DIGEST - Wall Street Journal - Aug 7", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "PRESS DIGEST - Wall Street Journal - Aug 7 | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T08:51:00.000+03:00", "replies_count": 0, "uuid": "65ff0c0bec1b8c886f76e394b40db77ac2f4c1ca"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/07/press-digest-wsj-idUSL3N10I1YA20150807", "ord_in_thread": 0, "title": "PRESS DIGEST - Wall Street Journal - Aug 7", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aug 7 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.\n* Donald Trump kicked off the first Republican presidential debate by refusing to promise not to run against the eventual party nominee if he doesn't clinch the nomination, an unpopular stance with GOP voters that could threaten his perch atop the primary field. ( on.wsj.com/1KTNmta )\n* Yodlee Inc, a provider of personal finance tools, tracks transactions and sells the data to investors, who mine the information for clues about trends that can move stock prices. The details are so valuable that some investment firms have paid more than $2 million apiece for an annual subscription to Yodlee's service, according to people familiar with the matter. ( on.wsj.com/1NdDRFx )\n* Does it make sense to reunite the old Kraft Foods business that activists helped split apart just three years ago? In the topsy-turvy world of today's U.S. food industry, some observers say the answer is yes, if the price is right. ( on.wsj.com/1eWr921 )\n* U.S. President Barack Obama's pursuit of congressional support for his Iran deal has hit turbulence in New York, with Sen. Chuck Schumer saying he must oppose the deal. ( on.wsj.com/1SWO0gz )\n* Despite all their spending cutbacks and idle drilling rigs, American energy producers are finding it hard to turn off the taps that have helped lead to a global glut of oil. ( on.wsj.com/1K6hPRS )\n* Officials said they would deploy ships, helicopters and a military plane to look for wreckage of Malaysia Airlines Flight 370 in the waters around Réunion Island. ( on.wsj.com/1OUlZ2Y )\n* Under pressure from New York regulators, Abercrombie & Fitch Co is ending a controversial scheduling practice for workers. The company will cease using on-call scheduling-which requires workers to make themselves available for shifts that may be canceled at the last minute-at its New York stores by the end of 2015, according to a letter sent Thursday to the office of New York Attorney General Eric Schneiderman. ( on.wsj.com/1J0tgjq ) (Compiled by Supriya Kurane in Bengaluru)", "external_links": ["http://on.wsj.com/1NdDRFx", "http://on.wsj.com/1SWO0gz", "http://on.wsj.com/1K6hPRS", "http://on.wsj.com/1OUlZ2Y", "http://on.wsj.com/1eWr921", "http://on.wsj.com/1J0tgjq", "http://on.wsj.com/1KTNmta"], "published": "2015-08-07T08:51:00.000+03:00", "crawled": "2015-08-07T08:00:24.700+03:00", "highlightTitle": ""}