{"organizations": [], "uuid": "c433dc393d9996ff7ccb481f59846bed31f5df4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/.UgxLExU_lamX_bYa73NBw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/cf8ed79aed98dd18d26f394ec905169cb2f852a1_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/european-stocks-slide-open-084945731.html", "country": "GB", "title": "European stocks slide at open", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "European stocks slide at open", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T11:21:00.000+03:00", "replies_count": 0, "uuid": "c433dc393d9996ff7ccb481f59846bed31f5df4f"}, "author": "", "url": "https://uk.finance.yahoo.com/news/european-stocks-slide-open-084945731.html", "ord_in_thread": 0, "title": "European stocks slide at open", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 09:29 BST - UK Markets close in 7 hrs 1 mins European stocks slide at open AFP – 8 minutes ago View Photo \n\nEuropean stock markets slid at the open on Friday, with traders reacting to fresh fallout from China and Greece. \nLondon's benchmark FTSE 100 index lost 1.10 percent to 6,298.38 points compared with Thursday's close. \nFrankfurt's DAX 30 tumbled 1.95 percent to 10,228.70 points and the CAC 40 in Paris shed 1.66 percent to open at 4,704.27. \nAsian stocks markets had already taken a heavy knock on Friday after weak manufacturing data from China added to fears about the health of the world economy. \nThe dollar meanwhile slid against the euro after the US Federal Reserve earlier this week dampened expectations of a US interest rate rise next month. \n\"When stock markets fail to rally in the wake of a dovish Fed then you know you're in trouble, and as if to reinforce this European stocks look set to post their worst weekly fall this year,\" Michael Hewson, chief market analyst at CMC Markets UK, said on Friday. \nThe European single currency was higher despite renewed unrest in Greece, where Prime Minister Alexis Tsipras announced his resignation on Thursday and called for snap elections. \nTsipras went on the offensive to defend the country's massive bailout after it triggered a rebellion within his own hard-left party. \nA leader who remains popular with the electorate, Tsipras had been widely expected to call polls in a bid to regain office with a stronger hand. \n\"Having secured... funding to help pay the ECB yesterday and also help recapitalise the banks the path now remains clear for the still fairly popular Greek prime minister to refresh his mandate,\" Hewson added. \nTsipras's announcement came on the same day the debt-crippled country received its first 13 billion euros ($14.7 billion) in bailout cash, effectively starting the mammoth rescue package agreed to last month, worth around 86 billion euros over the next three years. \nThe money arrived just in time to allow the Greek government to make a key debt repayment of 3.4 billion euros to the European Central Bank. \nAll eyes were also on China as Shanghai's main stocks index closed down 4.27 percent on Friday. \nIt (Other OTC: ITGL - news ) comes after a key indicator of China's manufacturing activity slumped to a 77-month low in August, an independent survey showed, fuelling concerns of further deceleration in the world's second-largest economy. \n\"Uncertainty concerning the Chinese economy continues to rattle stocks,\" said Markus Huber, senior trader at brokers Peregrine & Black.", "external_links": [], "published": "2015-08-21T11:21:00.000+03:00", "crawled": "2015-08-21T11:32:48.609+03:00", "highlightTitle": ""}