{"organizations": [], "uuid": "42a70c67859e352a6250545889e35b9cb4f19230", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/m/g/6/1/r/image.related.thumbnail.320x214.gjba9l.png/1441013180029.jpg", "site_section": "http://www.smh.com.au/business/planners-go-rogue", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/cbd/gordon-cairns-path-to-enlightenment-could-be-a-long-one-for-woolies-investors-20150830-gjba9l.html", "country": "AU", "title": "Gordon Cairns' path to enlightenment could be a long one for Woolies investors", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Gordon Cairns' path to enlightenment could be a long one for Woolies investors", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "42a70c67859e352a6250545889e35b9cb4f19230"}, "author": "CBD", "url": "http://www.smh.com.au/business/cbd/gordon-cairns-path-to-enlightenment-could-be-a-long-one-for-woolies-investors-20150830-gjba9l.html", "ord_in_thread": 0, "title": "Gordon Cairns' path to enlightenment could be a long one for Woolies investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Illustration: John Shakespeare.\nIf Woolworths investors felt a warm inner glow envelop them last night it might just have been the peace and serenity being projected by their newly appointed chairman – Tibetan meditation guru, Gordon Cairns .\nHis serenity took the chairmanship from Ralph Waters as of midnight last night.\nOf course, it was not always thus.\n\"I got some clear feedback from people who worked for me that they wouldn't tolerate my behaviour any more and the things that they disliked were that I was very competitive, autocratic, didn't care about people very much, and I was a perfectionist,\" said Cairns of his 1990s self, prior to conversion to the path of enlightenment.\nAdvertisement \"The fundamental thing is change – and I was given lots of help to change.\"\nThe 'change' is too late for departing Woolies CEO, Grant O'Brien .\nBut CBD wonders if Cairns might have a little chat to his departing CEO about letting go.\nO'Brien will remain an employee until after his 55th birthday, in July next year, to ensure his \"defined benefit\" superannuation scheme does not get blighted by his walking orders.\nCairns should have an easy time guiding his fellow shareholders through the Buddha's teachings, they are already well-versed in the first two of the Buddha's Four Noble Truths.\nDukkha: Suffering exists.\nSamudaya: There is a cause for suffering.\nNo fingers need to be pointed here, but we're looking at you Masters Hardware.\nHopefully Cairns, and his choice of CEO, can introduce investors to the last two.\nNirodha: There is an end to suffering.\nMagga: In order to end suffering, you must follow the Eightfold Path.\nAccording to analysts, the Woolies version of the Eightfold Path should take about five years, so investors better learn a bit of patience too!\nCairn's Repeat Cairns new underlings at Woolies might need to help orientate their chairman a little.\nAfter all, it was barely a year ago that the former Lion Nathan boss was selling David Jones to Woolworths – the South African Woolworths, that is.\nMind you. Woolworths is also in the groceries business – and they have done a bang up job when it comes to turning around the fortunes of DJs – so, Cairns might want to call Woolworths boss, Ian Moir , and see if he can repeat the magic with the embattled Aussie grocer.\nFor the right sum, of course.\nWoolies could at least try and emulate the South African retailer's latest initiative.\nLast week, Woolworth's supermarkets in South Africa will \"remove all sweets and chocolates from our checkout queues, reflecting our commitment to providing alternatives for children and parents.\"\nWoolworths exec Spencer Sonn , said, \"I am delighted that we are committing to remove sweets and chocolates from our checkout aisles. Customers can trust that Woolworths has their best interests at heart.\"\nCBD is not sure if that line would work for Woolies, which is our largest poker machine operator.\nBHP Bust With reporting season finally behind us, CBD can catch up on some of the announcements which inexplicably fell through the cracks.\nLike the fact that BHP went bust last Wednesday.\nMatthew Jess and Paul Burness from Worrells Solvency were appointed liquidators to BHP Roofing Pty Ltd, and will hold the first creditors meeting this Wednesday afternoon at the firm's Melbourne Offices.\nBYO Labour Days after the Fairfax Media/ABC expose made allegations of employee exploitation at 7-Eleven, the convenience store chain will take labour exploitation to a whole new level by enslaving customers.\nSeptember 1 is Slurpee's BYO Cup day, with customers being asked to bring their own cup and fill it at 7-Eleven Slurpee machines in the latest example of exploitation at the operation.\nNot that 7-Eleven boss, Warren Wilmot , is letting all the fuss get to him last week.\n\"Our business is currently experiencing an increase in media interest due to the FWO investigation into a small number of our franchisees businesses. In addition the alleged activities of some of our franchisees, primarily in relation to their obligations as employers, and our business model more broadly, are the subject of an investigative journalism program by ABC's Four Corners in conjunction with Fairfax (including The Age and Sydney Morning Herald ) newspapers,\" he told team 7-Eleven in a recent e-mail.\nDespite a few bumps in the road ahead, let's continue to focus our efforts on playing our individual parts in delivering on the Strategic Plan. We are the best team in the business, so let's continue our focus on our mission of being the best in Australia at meeting the ever changing needs of the convenience customer.\"\nIt is not clear if Slurpee-gate will be part of a review by an independent panel of the allegations.\nGot a tip? ckruger@fairfaxmedia.com.au", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-08-31T22:23:17.682+03:00", "highlightTitle": ""}