{"organizations": [], "uuid": "b4ae832f5020ae41c101347e76a800a1082b0ce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=3900_4850.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/sec-adopts-registration-rules-for-38167/", "country": "US", "title": "SEC Adopts Registration Rules for Security-Based Swap Dealers and Major Security-Based Swap Participants", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "SEC Adopts Registration Rules for Security-Based Swap Dealers and Major Security-Based Swap Participants", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T20:05:00.000+03:00", "replies_count": 0, "uuid": "b4ae832f5020ae41c101347e76a800a1082b0ce2"}, "author": "Katten Muchin Rosenman LLP", "url": "http://www.jdsupra.com/legalnews/sec-adopts-registration-rules-for-38167/", "ord_in_thread": 0, "title": "SEC Adopts Registration Rules for Security-Based Swap Dealers and Major Security-Based Swap Participants", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SEC Adopts Registration Rules for Security-Based Swap Dealers and Major Security-Based Swap Participants more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=0746953b-6b28-4799-9215-f43ba3069620\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nOn August 5, the Securities and Exchange Commission adopted new registration rules for security-based swap dealers and major security-based swap participants (SBS entities). In general, an SBS entity would register by filing the appropriate forms and certifications with the SEC through the EDGAR system. If the filing is complete, the SBS entity will be conditionally registered as a security-based swap dealer or major security-based swap participant with the SEC. The registration rules do not set a deadline by which the SEC must grant full registration or deny registration to an applicant. \nUnder the new rules, the registration application of an SBS entity must include two separate certifications by senior officers supported by appropriate due diligence. The first certification requires a senior officer of the applicant to certify that, after due inquiry, he or she has reasonably determined that the applicant has developed and implemented written policies and procedures reasonably designed to prevent violations of the federal securities laws and the rules thereunder and that he or she has documented the process by which he or she reached such determination. \nThe second certification requires the chief compliance officer (CCO), or his or her designee, to certify that he or she neither knows nor in the exercise of reasonable care should have known that any person associated with the SBS entity who effects or is involved in effecting security-based swaps on its behalf is subject to statutory disqualification, unless otherwise specifically provided by rule, regulation or order of the SEC. The second certification also requires the CCO, or his or her designee, to review and sign the questionnaire or application for employment executed by associated persons who are natural persons and who effect or are involved in effecting securities-based swaps on behalf of the SBS entity. \nThe registration rules also include two new defined dates (Compliance Date and Counting Date) that help to clarify how the final roll-out of the SEC’s full regime for security-based swaps will proceed. The Compliance Date for the new rules is defined as the later of: (1) six months after the date of publication in the Federal Register of a final rule release adopting rules establishing capital, margin and segregation requirements for SBS entities; (2) the compliance date of final rules establishing recordkeeping and reporting requirements for SBS entities; (3) the compliance date of final rules establishing business conduct requirements under Exchange Act Sections 15F(h) and 15F(k); or (4) the compliance date for final rules establishing a process for a registered SBS entity to make an application to the SEC to allow an associated person who is subject to statutory disqualification to effect or be involved in effecting security-based swaps on the SBS Entity’s behalf. (Although the drafting is ambiguous, it seems likely that the SEC intends to have the Compliance Date be six months after the latest date in the litany.) The new term Counting Date provides the welcome news that, for purposes of determining when registration is required, prospective SBS entities do not have to begin calculating whether their activities meet or exceed the thresholds established in Exchange Act Rules 3a71-2, 3a67-3, and 3a67-5 until two months prior to the Compliance Date. \nSeparately, the SEC proposed a new comprehensive rule—known as Rule of Practice 194—to create a process for SBS entities to seek permission from the SEC to continue effecting security-based swaps activities through associated persons that have been subject to certain adverse legal actions. Interested parties may comment on the proposed rule for 60 days after publication in the Federal Register . \nThe SEC’s registration rules for SBS entities are available here . The SEC’s proposed Rule of Practice 194 is available here .", "external_links": [], "published": "2015-08-12T20:05:00.000+03:00", "crawled": "2015-08-12T21:18:17.994+03:00", "highlightTitle": ""}