{"organizations": [], "uuid": "c2a41f092029f4f617465c7442f636087543cc21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/fm-radio-pti-t.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/intense-bidding-on-for-fm-radio-auctions/112489", "country": "IE", "title": "Intense bidding on for FM Radio auctions", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Intense bidding on for FM Radio auctions | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T00:05:00.000+03:00", "replies_count": 0, "uuid": "c2a41f092029f4f617465c7442f636087543cc21"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/intense-bidding-on-for-fm-radio-auctions/112489", "ord_in_thread": 0, "title": "Intense bidding on for FM Radio auctions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Reserve Bank of India may cut key rate by 0.25% on Tuesday: Moody's Barack Obama to unveil tougher climate change plan As Reserve Bank of India holds rates steady, firms debt burdens weigh heavily The intense bidding on initial five days of e-auctions for Private FM Radio Phase III expansion has led to “price discovery”, with bids far exceeding the reserve price, Information and Broadcasting Ministry officials said.\nAuctions under way for 135 channels in the first phase.\nReferring to a single FM channel in Delhi whose provisional winning price touched Rs 105.23 crore at end of Round 20 of bidding, more than three times its reserve price of Rs 31.42 crore, a senior official expressed optimism that with several more days to go, the auctions would contribute handsomely to the exchequer.\n“The process is such that several details including the identities of the parties which are bidding cannot be known till the process is complete. However, from the trends it is clear that the radio auctions would earn sizeable revenue and also demonstrate what the market value of these channels is,” an official said.\n“The auction process has in a way led to price discovery,” the official said, adding that at the close of the fifth day of bidding, 80 channels in 55 cities had become provisionally winning channels with cumulative provisional winning price of around Rs 714 crore, which far exceeded the aggregate reserve price of about Rs 391 Crore. The combined reserve price of 135 channels is Rs 550.18 crore.\nOfficials said certain cities like Delhi, Mumbai, Patna and Bhubaneswar were witnessing a lot of competition, but certain cities in south India or North East were yet to see similar activity.\nThe official, however, attributed it to the strategy that different companies might have adopted and said with several days more to go bidding for channels in these areas is likely to pick up.\nFirst Published on August 02, 2015 4:05 pm", "external_links": [], "published": "2015-08-03T00:05:00.000+03:00", "crawled": "2015-08-03T08:31:39.604+03:00", "highlightTitle": ""}