{"organizations": [], "uuid": "56b4f49aad2d66eea0b7730021b8e260ee526b5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-retail/?format=rss", "section_title": "Retail News | Retail Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/growth-company-not-growth-company-152349149.html", "country": "GB", "title": "When Is A Growth Company Not A Growth Company?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "When Is A Growth Company Not A Growth Company?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T18:23:00.000+03:00", "replies_count": 0, "uuid": "56b4f49aad2d66eea0b7730021b8e260ee526b5a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/growth-company-not-growth-company-152349149.html", "ord_in_thread": 0, "title": "When Is A Growth Company Not A Growth Company?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 7, 2015, 19:45 BST - UK Markets closed When Is A Growth Company Not A Growth Company? By Owain Bennallack | Fool.co.uk – 3 hours ago \nMany investors like to back fast-growing companies. They perennially hope to discover the next multi-bagging growth winner like Apple , ASOS (LSE: ASC) or Just Eat (LSE: JE). Owning sizeable stakes in just one or two such companies that multiply in value 5-10 times in a decade can do wonders for your returns. But getting the most out of growth stocks is a lot easier said then done. Look out below! \nThe most common pitfall is that you decide to put money into a growth company too late in the day, shortly before the rapid expansion in earnings dries up. This often happens when a company reports a slightly uncertain outlook and the share price declines 5-10%. \"Aha!\" you think. \"My time at last to be greedy when others are fearful, and to buy into this long-term growth story!\" But what if the market has correctly intuited that the wheels are in fact coming off the company's long expansion? The problem then is that you've almost certainly paid a premium to buy into the growth story - as represented by a lofty P/E rating of 30 or more - and that the 5-10% 'bargain' share price discount you were so proud of snagging will provide you with very little buffer if the market decides to re-rate the shares. \nIf growth in profits declines to a more normal and pedestrian 10% a year, a P/E rating of 10 to 15 might be deemed more appropriate. That alone could see your investment halve in value! Glory days \nMost growth companies eventually de-rate, as they saturate their market, attract competition, or simply become too big to compound as rapidly as they did in the early years. They may carry on being perfectly respectable businesses - and even fine shares to own for their dividend credentials, say - but their growth days are behind them. Indeed, most big FTSE 100 companies were at some earlier stage growth companies, although in many cases you'd have to go back decades to find their wild and crazy go-go years. A somewhat recent example would be Vodafone (LSE: VOD). Vodafone is now the quintessential boring FTSE 100 behemoth. However, back in the 1990s it was a darling of growth investors, as its share price multiplied tenfold with surging mobile phone use. Stomach churners \nBut there's another kind of company that growth investors need to be wary of - and it's a particular bugbear of mine in discussions among the analysts here at The Motley Fool. And that's when what's called a growth company is really a cyclical company in disguise. As the name suggests, a cyclical company is one whose fortunes rise and fall according to a cycle. (Usually a somewhat unpredictable cycle, with the market always doing its best to make things tricky.) \nClassic examples of cyclical firms would be auto manufacturers, steel producers, and the vast majority of firms in the commodity sector. Look at the following earnings per share record (the company reports in dollars and cents, but it's a London-listed firm):", "external_links": [], "published": "2015-08-07T18:23:00.000+03:00", "crawled": "2015-08-07T21:52:04.901+03:00", "highlightTitle": ""}