{"organizations": ["Credit Cards Auto Jim Cramer Points"], "uuid": "1747095c83f24f228aa9a0bb991c71e0c00dccb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/heritage-newspapers/rss/627", "section_title": "Heritage Newspapers : Personal Finance", "url": "http://business-news.thestreet.com/heritage-newspapers/story/jim-cramer-points-to-23-quality-stocks-down-30-or-more-that-could-be-good-buys/13271394", "country": "US", "title": "Jim Cramer Points to 23 Quality Stocks Down 30% or More That Could Be Good Buys", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Jim Cramer Points to 23 Quality Stocks Down 30% or More That Could Be Good Buys", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T18:13:00.000+03:00", "replies_count": 0, "uuid": "1747095c83f24f228aa9a0bb991c71e0c00dccb6"}, "author": "", "url": "http://business-news.thestreet.com/heritage-newspapers/story/jim-cramer-points-to-23-quality-stocks-down-30-or-more-that-could-be-good-buys/13271394", "ord_in_thread": 0, "title": "Jim Cramer Points to 23 Quality Stocks Down 30% or More That Could Be Good Buys", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Laurie Kulikowski", "Jim Cramer Points"], "text": "Credit Cards Auto Jim Cramer Points to 23 Quality Stocks Down 30% or More That Could Be Good Buys Written by: Laurie Kulikowski 08/31/15 - 11:13 AM EDT Tickers in this article: ABX AMAT AMD ANF BBRY COP CTL DVN ERF FSYS GNW HPQ NAVI NOV PHH SPW TDC UPL URI WFM WPX X YHOO \nNEW YORK (TheStreet) -- More than 240 stocks in the S&P 500 reached bear market territory as of last Tuesday, according to Jim Cramer. \nAs a result of last week's market volatility, 11 stocks plummeted more 50%; 24 more than 40%, 23 more than 30%, 78 more than 20% and 104 more than 10%, Cramer counts in a RealMoney post on Monday. \n\"The numbers understate the trashing,\" Cramer wrote. \"Many of these stocks have had incredible plummets from their 52-week highs, making these percentages seem benign. You could easily add another 100 to the down 10% if we look at Tuesday's close, and bump many more into the higher percentage brackets.\" More Headlines Oppenheimer's Picks 6 Consumer Stocks for Times of Market Volatility \nWhile some sectors didn't get hit as hard, such as health care, some biotech stocks and a small handful of retailers, \"after last week's lows, believe me, you don't find more than a couple of dozen stocks that are up more than 10%,\" he said. \"That's stunning to me.\" \n\"Plus, the stocks that are down 20% or more are true household names, companies: the big rails, the big truckers, a huge number of high quality industrials, utilities, media stocks, the works,\" Cramer wrote. \nHere's Cramer's list of stocks down at least 30% from their highs, with ratings from TheStreet Ratings for added perspective. And when you're done check out the list of stocks down 50% or more . \nTheStreet Ratings uses a quantitative approach to rating over 4,300 stocks to predict return potential for the next year. The model is both objective, using elements such as volatility of past operating revenues, financial strength, and company cash flows, and subjective, including expected equities market returns, future interest rates, implied industry outlook and forecasted company earnings. \nBuying an S&P 500 stock that TheStreet Ratings rated a \"buy\" yielded a 16.56% return in 2014 beating the S&P 500 Total Return Index by 304 basis points. Buying a Russell 2000 stock that TheStreet Ratings rated a \"buy\" yielded a 9.5% return in 2014, beating the Russell 2000 index, including dividends reinvested, by 460 basis points last year. \nSector: Consumer Goods & Services/Apparel Retail 52-Week High: $42.40 Decline from 52-week High: -54.8% TheStreet Rating: Hold, C TheStreet Said: TheStreet Ratings team rates ABERCROMBIE & FITCH as a Hold with a ratings score of C. TheStreet Ratings Team has this to say about their recommendation: \n\"We rate ABERCROMBIE & FITCH (ANF) a HOLD. The primary factors that have impacted our rating are mixed ? some indicating strength, some showing weaknesses, with little evidence to justify the expectation of either a positive or negative performance for this stock relative to most other stocks. At the same time, however, we also find weaknesses including deteriorating net income and a generally disappointing performance in the stock itself.\" \nHighlights from the analysis by TheStreet Ratings Team goes as follows: ABERCROMBIE & FITCH has experienced a steep decline in earnings per share in the most recent quarter in comparison to its performance from the same quarter a year ago. This company has reported somewhat volatile earnings recently. But, we feel it is poised for EPS growth in the coming year. During the past fiscal year, ABERCROMBIE & FITCH increased its bottom line by earning $0.73 versus $0.70 in the prior year. This year, the market expects an improvement in earnings ($0.77 versus $0.73). ANF, with its decline in revenue, underperformed when compared the industry average of 10.6%. Since the same quarter one year prior, revenues slightly dropped by 8.2%. Weakness in the company's revenue seems to have hurt the bottom line, decreasing earnings per share. Despite any intermediate fluctuations, we have only bad news to report on this stock's performance over the last year: it has tumbled by 57.34%, worse than the S&P 500's performance. Consistent with the plunge in the stock price, the company's earnings per share are down 105.88% compared to the year-earlier quarter. Turning toward the future, the fact that the stock has come down in price over the past year should not necessarily be interpreted as a negative; it could be one of the factors that may help make the stock attractive down the road. Right now, however, we believe that it is too soon to buy. The company, on the basis of change in net income from the same quarter one year ago, has significantly underperformed when compared to that of the S&P 500 and the Specialty Retail industry. The net income has significantly decreased by 106.2% when compared to the same quarter one year ago, falling from $12.88 million to -$0.80 million. You can view the full analysis from the report here: ANF Ratings Report", "external_links": [], "published": "2015-08-31T18:13:00.000+03:00", "crawled": "2015-08-31T18:51:19.046+03:00", "highlightTitle": ""}