{"organizations": [], "uuid": "b968e80da5b169fe70901536985705c1e643c92c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508101052.html", "country": "US", "title": "Kenya: Japan Threatens to Cut Aid As Treasury Changes Rules in Mombasa Port Tender", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Japan Threatens to Cut Aid As Treasury Changes Rules in Mombasa Port Tender", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T12:51:00.000+03:00", "replies_count": 0, "uuid": "b968e80da5b169fe70901536985705c1e643c92c"}, "author": "", "url": "http://allafrica.com/stories/201508101052.html", "ord_in_thread": 0, "title": "Kenya: Japan Threatens to Cut Aid As Treasury Changes Rules in Mombasa Port Tender", "locations": ["Kenya", "Tokyo", "Japan", "Mombasa Port"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "And he warned that the meddling could affect Tokyo's aid to Kenya. \n\"Any changes at this stage will affect future assistance to Kenya,\" said Mr Uguchi. \nThe Japanese have been the biggest financiers of port development projects with most of the money lent to Kenya on concessionary terms. \nIndeed, the new container terminal facility for which the government is procuring an international operator has itself been built with Japanese financing. \nAll along, the Japanese believed that having successfully funded and built the second terminal, and having signed a loan agreement with the Kenya Ports Authority to finance and construct the next phase, things would go according to plan. \nThe Japanese signed a loan agreement with the KPA for the financing and construction of the second phase in March this year. \nThe same month, President Uhuru Kenyatta, who was on a visit to Tokyo, agreed with the prime minister of Japan, Mr Shinzo Abe, to accelerate cooperation in infrastructure development in Mombasa. \nWhat would appear to be emerging, however, is that powerful elites with vested interests not only in the ongoing selection of an operator for the new facility but also on the next phase of projects had different schemes. \nIn the middle of the current procurement process, a last-minute amendment was introduced in the bid documents whose effect was to rubbish what the Japanese had negotiated with the government. \nHardly 10 days before the opening of the tender, the National Treasury ordered KPA to introduce new conditions in the bidding documents, which served to undermine the interest of the Japanese. \nThe conditions say that the company selected in the procurement will be given the powers to determine the financing mechanism for the next phases of the project. \nSecondly, that the next phases may be built under the so-called build, operate and transfer arrangement -- where private companies will be allowed to construct the terminal, manage it for a period of time and transfer the facility to the government. \nThirdly, that the selected company \"will be given the first right of refusal\" in the planning and arrangement for the remaining phases of the project. Japan also protested about the decision by the National Treasury to abruptly change the local shareholding threshold by introducing a 15 per cent free shares-for-the government rule. \nThe Japanese argued that since they were the ones who had financed the consultants helping the KPA in the procurement process, they had an obligation to play straight. \n\"As a financier to this process, Jica is under obligation to assure accountability and transparency in the process.\" \nBut weeks of intense lobbying by the Japanese have not made much of an impact as Kenya's power peddlers go for a piece of the big-money tender. \nAt one stage, State House has had to bring on the director of delivery, Mr Nzioka Waita, to hold meetings with officials of both the National Treasury and the Ministry of Transport and Infrastructure in a bid to preempt a major diplomatic falling out with Tokyo. \nSpeaking the Saturday Nation on the condition of anonymity, a top government official involved in the negotiations, while admitting that the government could not afford to antagonise the Japanese, stressed that it could not interfere with the procurement process. The changes in the bidding documents were merely brought in as sweeteners to attract investors, he said. Kenya \nNairobi's Westlands area and several other parts of the city will experience water shortage from Tuesday until 6pm … see more » Copyright © 2015 The Nation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-10T12:51:00.000+03:00", "crawled": "2015-08-10T13:19:37.865+03:00", "highlightTitle": ""}