{"organizations": [], "uuid": "d7dd9e27e2540e0736f8f605845e57e062fa5cfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/o/4/2/7/image.related.afrArticleLead.620x365.gik61a.png/1438331268875.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/a-fund-managers-guide-to-suriviving-profit-season-20150724-gik61a", "country": "AU", "title": "A fund manager's guide to suriviving profit season", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "A fund manager's guide to suriviving profit season | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T22:15:00.000+03:00", "replies_count": 0, "uuid": "d7dd9e27e2540e0736f8f605845e57e062fa5cfc"}, "author": "Jonathan Shapiro", "url": "http://www.afr.com/personal-finance/a-fund-managers-guide-to-suriviving-profit-season-20150724-gik61a", "ord_in_thread": 0, "title": "A fund manager's guide to suriviving profit season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wine drinkers and pointy questions are rare at management lunches with fund managers. Share on twitter by Jonathan Shapiro Fine wine goes undrunk, questions go unasked and cryptic outlooks are deciphered as analysts embark on the noble quest to solve the riddle of their investment. Welcome to the all important but often bizarre time in the corporate calender – profit season.\nTwice a year, in February and August, most of Australia's largest listed companies front the market and deliver their earnings to anxious investors. The period is the busiest and most stressful time of the year for equity analysts, and fires into action next week.\nSo how does a typical analyst survive the mania of profit season? Hugh Dive, senior portfolio manager at Aurora Funds Management, walks us through this often strange corporate ritual where analysts must navigate corporate spin, busy schedules, conflicted research analysts and cagey rival funds to work out the true meaning behind the numbers.\nAs Dive explains, all the action begins well before reporting season when analysts go over their forecasts to understand how they compare with the market's expectations. This helps the analyst to identify which companies are set to surprise and which are set to disappoint.\nBut the continuous disclosure regime has taken much of the fireworks out of reporting season. Most of the major companies hold monthly board meetings and should be well aware of how well they are tracking relative to their budgets. If it looks like they're veering off track, the onus is on them to inform the market.\nThe ASX listing rules have evolved over the years to make sure companies are aware of the market's expectations of the number they're likely to deliver and whether that number is going to be very different. If they're meeting their continous disclosure requirements, profit season should be a non-event.\nBut that doesn't stop the fanfare and there's plenty of work for analysts still to do. Reporting season is all about putting the \"meat on the bones\". This means scrutinising the financial metrics and looking for clues to deliver the outlook commentary.\nThe all-important dividend decision is also a crucial part of reporting season. The dividend is not a function of the company's performance but a decision taken by the board so it really is revealed on the day.\n The profit result is also not just about meeting expectations, but how they are met. If financial engineering is at work, the analyst community stands ready with financial models to quickly dissect the numbers and determine a more accurate measure of performance.\nWith that in mind, the big day arrives. The action kicks off at 9am when the company posts its results on the ASX, which gives investors an hour before the trading session to make sense of the results and brace for the resultant share market action. The task then is to make sense of the outlook statement and look for changes in tone or language \"much like students of Renaissance literature interpreting the meanings in Donne's Holy Sonnets \", Dive says.\nIt gets better. Later in the morning the shiny suits in management present the results to investors and analysts, the highlight being the Q&A session. Fund managers tend to stay tight lipped, leaving it to the sell-side analysts to quiz management. But the problem is sell-side analysts rely on access to management, which means not offending them with prickly questions in public. Sometimes it's the fund managers who have to step in when management has something to answer for.\n\"This is where you will see agitated fund managers asking questions in a public forum, such as 'what comparative advantage does QBE have in writing Argentinian workers' compensation insurance?',\" says Dive.\nThe low point is the lunch with the company management, usually hosted at the offices of an investment bank. Invites are extended based on how large the fund's stake is in the company or how much brokerage the fund has paid to the banks.\n\"These events are held in the boardroom of the bank and are fully catered events, though it is rare to see anybody accepting a glass of wine with their steak or fish. Many fine bottles of wine from the cellars of the investment banks get opened, offered around the table by waiters and then returned to the sideboard with one glass poured out,\" says Dive.\nThis sounds horribly unfair to the humble retail investor who gets no such invite but, as Dive assures us, you're not missing out on anything other than a good feed. Rarely is an insight gained. These lunches are essentially a \"a group meeting of rivals\" where the good questions aren't asked for the benefit of others.\n\"If you know the company well or have a particularly insightful question, an analyst will save that for a one-on-one meeting with the company,\" he says.\nWith no wine drunk and no questions asked, it's almost better not to go. Dive recalls a Fletcher Building lunch where the top three investors that owned more than a quarter of the company sat in silence, leading the lunch question time to degenerate into a \"building products 101\".\nIn the days and weeks that follow, investors do get a better handle on the quality of the results. The company also hits the road to meet investors through one-on-one meetings, both in Australia and offshore. It's through these meetings \"sometimes hostile, sometimes friendly\" that Dive says the analysts get a better sense of their investment, and for management to understand how far their investors are willing to go to back them.\n\"Several times I have been in these meetings where management has raised a potential strategy which seemed aggressive and quite alarming,\" he says. \"By institutional investors signalling that they would be unlikely to support a course of action or capital raising, these companies saved investors millions of dollars in investment banking fees.\"", "external_links": ["https://twitter.com/johnnyshap"], "published": "2015-07-31T22:15:00.000+03:00", "crawled": "2015-08-01T07:06:09.185+03:00", "highlightTitle": ""}