{"organizations": [], "uuid": "70ec9e633d984f75835df375c0e00b16e998cd86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/28/congodemocratic-mining-idUSL5N1133MO20150828", "country": "US", "title": "Power shortages threaten launch of Chinese-run Congo copper mine", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Power shortages threaten launch of Chinese-run Congo copper mine | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T18:48:00.000+03:00", "replies_count": 0, "uuid": "70ec9e633d984f75835df375c0e00b16e998cd86"}, "author": "Aaron Ross", "url": "http://www.reuters.com/article/2015/08/28/congodemocratic-mining-idUSL5N1133MO20150828", "ord_in_thread": 0, "title": "Power shortages threaten launch of Chinese-run Congo copper mine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KINSHASA Aug 28 Power shortages at a new Chinese-run copper mine in Democratic Republic of Congo could delay the expected October start of production or force output targets to be cut, the mine's deputy director said on Friday.\nThe Sicomines copper mine, a joint venture between Chinese companies and Congolese state entities in the southeastern mining hub of Kolwezi, is one of Africa's largest with about 6.8 million tonnes in proven reserves.\nChinese firms Sinohydro Corp and China Railway Group Limited are building roads and hospitals worth $3 billion in exchange for a 68 percent stake in the mine. China's state-run Exim Bank are providing most of the financing.\nInitial annual production of 125,000 tonnes requires a consistent supply of 54 megawatts (MW) but the national utility company has pledged 15 MW and even then only 10-12 MW is available with interruptions, said deputy director Jean Nzenga.\n\"Production is set for the month of October of this year,\" Nzenga told Reuters. \"But there are conditions like energy. We need to have energy .... With less (energy) we are going to see what needs to be prioritized.\"\nThe mine has secured another roughly 15 MW from southern African countries, including neighbouring Zambia and will try to obtain more next month, Nzenga said.\nWork on a 240 MW dam to supply Sicomines has been delayed by red tape and remains at least five years from completion.\nCongo is Africa's leading copper producer, having mined 1.03 million tonnes of the metal in 2014. Its chamber of mines has said it expects output to decrease slightly in 2015 due to a power deficit.\nNzenga said Sicomines had not yet been affected by sharp declines in copper prices linked to fears of a slowing economy in China, the world's top industrial metals consumer.\nBenchmark copper on the London Metal Exchange was up 0.8 percent at $5,179 a tonne at 1421 GMT on Friday after dropping to six-year lows earlier in the week at $4,885.\n\"Let's hope that the price of copper doesn't drop too much,\" Nzenga said. \"If that continues, it's going to affect a lot of projects.\"\nSicomines is part of a $6 billion \"minerals for infrastructure\" deal first signed in 2007 between the Congolese government and a consortium of Chinese companies. (Editing by Matthew Mpoke Bigg and William Hardy)", "external_links": [], "published": "2015-08-28T18:48:00.000+03:00", "crawled": "2015-08-28T18:08:02.778+03:00", "highlightTitle": ""}