{"organizations": [], "uuid": "a51edb23f9fdecf28f41a119b8b545a9d35fdd23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiplinger.com", "main_image": "http://www.kiplinger.com/slideshow/credit/T017-S002-9-secrets-to-better-credit/images/intro.jpg", "site_section": "http://www.kiplinger.com/about/rss/kiplinger.rss\r", "section_title": "Kiplinger's Personal Finance", "url": "http://www.kiplinger.com/slideshow/credit/T017-S002-9-secrets-to-better-credit/index.html?rss_source=rss", "country": "US", "title": "9 Secrets to Better Credit", "performance_score": 0, "site": "kiplinger.com", "participants_count": 0, "title_full": "9 Secrets to Better Credit", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T07:00:00.000+03:00", "replies_count": 0, "uuid": "a51edb23f9fdecf28f41a119b8b545a9d35fdd23"}, "author": "", "url": "http://www.kiplinger.com/slideshow/credit/T017-S002-9-secrets-to-better-credit/index.html?rss_source=rss", "ord_in_thread": 0, "title": "9 Secrets to Better Credit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Opening a New Account Won't Hurt Much Slide Show See All Slide Shows Page 8 of 11 9 Secrets to Better Credit Closing Credit Cards Could Hurt Thinkstock \nWhen you want to declutter your financial life, eliminating credit card accounts feels good. And if you find that you can’t control your spending when you have credit cards, shutting them down is probably a good idea. But if you have the willpower to simply leave them in a drawer, that’s the best move. \nSay you have three credit cards, each with a $5,000 limit. Two of the cards have zero balances, and one has a $4,000 balance. If you close the two cards with no debt, the overall ratio of your debt compared with your credit limits jumps from 27% to 80%. That percentage, called credit utilization, is part of the “amounts owed” portion of your FICO score, which accounts for nearly one-third of the score. A high utilization has a negative impact. To minimize the effect on your score, you’d be better off leaving all of the cards open, keeping zero balances on the first two and whittling down your balance on the remaining card. (Your utilization is calculated both for individual cards and your overall credit.) \nIf you keep relatively low balances on all of your credit cards, closing some of them may not inflict much damage on your score. Retail cards tend to have low limits, says Harzog, so those could be prime candidates for cutting, especially if you own other major cards with high limits. And closing a card won’t immediately shorten your average account age, another segment of your credit score. The history you’ve created with the card will remain on your credit report for about seven years after you’ve closed it.", "external_links": [], "published": "2015-08-17T07:00:00.000+03:00", "crawled": "2015-08-17T20:03:54.844+03:00", "highlightTitle": ""}