{"organizations": [], "uuid": "c251b5cb34353d4eb647b1c9ed305c576abb5dae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/m/k/0/u/image.related.articleLeadwide.620x349.gil99b.png/1438235333908.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2550/consumer-discretionary/retailing", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/markets/australian-shares-at-risk-when-the-federal-reserve-raises-interest-rates-20150727-gil99b.html", "country": "AU", "title": "Australian shares at risk when the Federal Reserve raises interest rates", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Australian shares at risk when the Federal Reserve raises interest rates", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "c251b5cb34353d4eb647b1c9ed305c576abb5dae"}, "author": "", "url": "http://www.smh.com.au/business/markets/australian-shares-at-risk-when-the-federal-reserve-raises-interest-rates-20150727-gil99b.html", "ord_in_thread": 0, "title": "Australian shares at risk when the Federal Reserve raises interest rates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "High P/E stocks are on notice when the US Federal Reserve lifts interest rates. Photo: Bloomberg\nThe US Federal Reserve's move to lift interest rates for the first time in almost a decade will be welcomed by companies benefiting from a lower Australian dollar, but companies with stretched valuations are at risk of a pull-back when the liftoff happens, fund manager Ben Griffiths says.\nEley Griffiths co-founder Mr Griffiths says a move into a tightening cycle immediately puts high price-to-earnings ratio stocks into focus, as the distance between high and low P/E stocks shrinks.\nResource names normally perform well at the early stages of a tightening but, again, the situation feels different this cycle given the languid Chinese economy.\nBen Griffiths, Eley Griffiths co-founder \"Higher P/E stocks will naturally recoil fastest,\" he said.\nFinancials, particularly banks over the insurers, and real estate investment trusts have traditionally been more sensitive to rate movements and in a US hike scenario would find it difficult to outperform, he said.\nMr Griffiths said companies in the ilk of REA Group, which has a P/E of 29-times earnings, CSL with 25-times and Navitas at 22-times were examples of those. By comparison, the ASX 200 has a P/E of about 20-times earnings, with a estimated ratio of 16-times by the end of 2015.\nBut he said this tightening cycle contrasted to previous events as other major central banks, including the Reserve Bank of Australia, were not in sync with the Fed.\n\"This will muddy the waters initially, but ultimately global bond markets will conform to the trend change and rates will commence their upward trajectory,\" Mr Griffiths said.\n\"Resource names normally perform well at the early stages of a tightening but, again, the situation feels different this cycle given the languid Chinese economy.\"\nHC Securities senior private client adviser Mark Lennox said companies with large US dollar-nominated debt and exposed to Fed tightening included AMP, BHP Billiton, Brambles, Crown Resorts, James Hardie, Oil Search, Sonic Healthcare, Rio Tinto and Westfield Corp.\nBut those companies should fare reasonably well as long as they also had US denominated assets earning US earnings, Mr Griffiths said.\n\"Those Australian companies who have taken advantage of the US private placement market in recent years to fund asset purchases, earning Australian dollar EBITDA [earnings before interest, tax, depreciation and amortisation], such as a few mining service companies, will be feeling qualmish about now,\" he said.\nFortescue and Santos were particularly susceptible to a US rate hike, Mr Lennox said.\n\"[They are] unlikely to benefit much from the lower Australian dollar and Fortescue now needs more Australian dollar profit to clear the interest repayments,\" he said.\n\"If US interest rates were to move higher than expected, sooner than expected (which is highly unlikely) then Fortescue is at the most risk due to its US dollar denominated debt.\"\nTide turning The tide is starting to turn against a widely-anticipated second-half lift off however, ahead of Wednesday night's Federal Reserve Open Markets Committee meeting.\nGoldman Sachs this week said in conversation with its investors, many believed economic uncertainty in China would cause the Fed to delay tightening until 2016.\nMr Lennox said futures pricing now indicated just a 50 per cent chance of a rate rise by January.\nMr Griffiths said investors had time to react, but needed to be aware of what could unfold.\n\"Higher P/E names will not be set upon as long as they are delivering on earnings expectations,\" he said.", "external_links": [], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-08-01T09:10:36.238+03:00", "highlightTitle": ""}