{"organizations": [], "uuid": "2d072bec7efba4f4c8753532c2085f872bece74d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/24/12921687/logo-GreenCoinX.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12921687.htm", "country": "US", "title": "GreenCoinX Forms Advisory Board", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "GreenCoinX Forms Advisory Board", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "2d072bec7efba4f4c8753532c2085f872bece74d"}, "author": "Carrol Van Stone", "url": "http://www.prweb.com/releases/2015/08/prweb12921687.htm", "ord_in_thread": 0, "title": "GreenCoinX Forms Advisory Board", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GreenCoinX Inc is pleased to announce that it has formed an Advisory Board of talented executives who collectively bring immense technological, corporate, financial and entrepreneurial experience that will assist in the further development of GreenCoinX, the world’s first identifiable crypto currency. The Advisory Board comprises the following distinguished members:\nDavid M. Lonsdale (Chairman) is President and CEO of The Lonsdale Group, a Dallas-based private investor in small cap companies. He is a director of GreenBank Capital Inc, a merchant bank listed on the Canadian Securities Exchange. He is also a director of GreenCoinX Inc. Previously he was for ten years the President of Allegiance Capital Corporation, a private investment bank focusing on mergers and acquisitions, with offices in Dallas, New York, and Chicago. Mr. Lonsdale has successfully built and sold three venture-funded information technology companies, including selling one of them to Microsoft. Earlier in his career he managed corporate divisions of McDonnell Douglas/Boeing and Dun & Bradstreet/A C Nielsen. He obtained his MBA in Finance & Marketing from Cornell University and his B.Sc. in Physics & Mathematics from Leeds Beckett University in the U.K.\nRob Levy is Founder of LIG Ventures, a Silicon Valley based investment and consulting firm, and Executive in Residence with PricewaterhouseCoopers (PwC), the worlds’ second largest professional services business with offices in 157 countries. Previously, he was the an enterprise application development and deployment software company. He was Chief Technology Officer of an enterprise software company with revenues in excess of $1.5B, and Chief Technology Strategist of one of the largest software companies in the world. He has previously been a director of Revelytix Inc, (sold to Teradata), an enterprise data company, CEO of Eyeona a software company marketing a retail pricing application, Managing Director US Operations of ItemField, a venture backed startup (sold to Informatica), and Senior Vice President of Nastel Technologies, an enterprise software company.\nDavid J. Robino is a private investor and corporate and nonprofit governance expert. He was previously a non-executive director of a Fortune 500 global provider of information technology, and a non-executive director of Memec, Inc., then the world’s largest distributor of specialty electronics and semiconductors. Before those board roles, Mr. Robino served as the Vice Chairman of Gateway, Inc. His earlier career was spent at The Maytag Corporation, Pepsi-Cola, AC Nielsen, and AT&T. He has a B.A. from Graceland University and an M.S. from Iowa State University. He currently teaches Business Ethics at Southern Oregon University.\nNigel Stuart Little is the former Group Vice Chairman of Canaccord Capital Corporation, one of the largest investment banking businesses in Canada. He was President of Canaccord Adams, the European division of Canaccord, for seven years. Previously, he headed up the international divisions at Nomura International, Morgan Stanley International, NationsBanc Panmure/WestLB and HSBC James Capel. Since retiring from Canaccord, he has been a Senior Advisor to Kleinwort Benson Bank, and is currently a Senior Advisor to PPR Estates, a London based private real estate investment company. He has been a Director or Chairman of a number of public and private companies involved in technology, finance, natural resources, and Real Estate. He graduated with an Honors degree in Natural Sciences from the University of London and is a Fellow of The Securities Institute and a Freeman of the City of London\nKevin Kuykendall is a serial entrepreneur and is currently CEO of a Canadian company commercializing a bacteria testing technology. He is also CEO and Founder of Tripad LLC, a manufacturer of travel and photography accessories, and Chairman of Health2o Products LLC, a nutraceutical beverage and cosmeceutical skincare products business. Previously he was CEO and Founder of White Energy Company LLC, an ethanol producer.\nDwayne Walker is Senior VP at a technology and domain services company. He has been a director, investor and executive at several technology and internet companies including iClick, Escrow.com, FreeShop.com, Micro General, US Connect, Network Commerce, DomainSponsor and Artemis Ventures. He was President of a provider of banking, real estate and payment technologies. Previously, he was Director of Sales and Marketing for Microsoft.\nBob Heckman is President of The Allen Group, a management consulting firm focused on business development and marketing. Previously, he was Director of Business Development at Accenture (formerly Anderson Consulting), and he has held senior management positions at MTech and IBM. He is the author of Boardroom Selling: Proven Strategies for Selling to Decision Makers. He is a seasoned international speaker at corporate sales meetings and industry conferences, and is a specialist at executive leadership coaching.\nJohann Tse is CEO of Aquarian Capital, an advisory firm which specializes in strategic opportunities in China and with Chinese businesses overseas, from M&A advisory to developing renewable power plants, agribusinesses and natural resources as principals, with offices in Dallas, Beijing, Shanghai, Hong Kong and Tel Aviv. Previously he was Director for International M&A for Yum! Brands, and founded corporate venture capital program for Rohm and Haas Company. He held senior management positions with Swire Group, a UK/Hong Kong conglomerate, where he established 13 companies across numerous industries and was responsible for government relations and corporate development for China. He was the founding Deputy Chairman of the Hong Kong Chamber of Commerce in Shanghai, and was an Executive Director of the Hong Kong Chamber of Commerce in China. He is currently board member of Texas-Israel Chamber of Commerce, Dallas Business Club, and Executive Board Member of Circle Ten Council, Boy Scouts of America. He has an MBA from INSEAD, France, and a Bachelor of Science (Hons.) from the Chinese University of Hong Kong in Electronics Engineering.\nAlan Molloy is Chairman of Hillberry Trust Company Limited, a Fiduciary company based in the Isle of Man. He provides independent director and consultancy services, and sits on the Investment Committee of a UK investment management company, having previously been the managing director of the international services of Duncan Lawrie, a British private bank. He is a Fellow of the Institute of Banking in Ireland, a Chartered Fellow of the UK Chartered Institute for Securities and Investments and is a Chartered Wealth Manager. He is also a published author on investment related matters.\nVinnie Grosso is a telecommunications and entertainment industry veteran having held senior posts with NBC, AT&T, PRIMEDIA, and as CEO of start-up Into Networks. He is an established entrepreneur with “disruptive” technology and business models for streaming video, interactive television, video-on-demand, software-on-demand and mobile commerce for more than two decades. As President of \"AT&T Downtown Digital\" he led the first interactive TV trials for AT&T, headed up NBC's efforts with TV affiliates on the Internet, led the technology effort for Primedia to distribute educational software by satellite and built the largest USA and Canadian distributor of broadband games for the cable industry at Into Networks. He is also recognized as a board member of The National Association of Television Program Executives, working the early business models for digital entertainment. He is currently a consultant to Fortune 500 Companies and startups alike.\nTrevor Koverko is the CEO of Polymath Computer Solutions Inc, a virtual reality real estate marketing business. Previously he was CEO of eProf Education Inc a technology startup connecting educators and students in a virtual classroom. He is an early adopter of crypto currency with a diversified angel investor portfolio. He is retired from the New York Rangers where he was a draft pick in 2005, and previously played professional hockey in the Ontario Hockey League. He is a graduate from the University of Western Ontario-Richard Ivey School of Business.\nJim Taylor is Senior Solution Architect for Liaison Technologies Inc, a data integration and data security company. He was Chief Technology Officer of bTrade Inc a venture-funded software company focused on providing a secure platform for internet-based business transactions, which was purchased by Click Commerce. He previously was head of systems programming teams at Pier 1 Imports and Levi Strauss.\nJoe Devich is a Partner at Newport Board Group, a national professional management services firm. He was previously Founder of TipApplause, a developer of mobile phone applications, and President of Knowberry, a web based utility focused on public safety. He was also President of three other technology companies, BizTube, Mosaix, and Asta Networks. He has held senior management positions with Covad Communications, Qwest Communications, Ameritech, and EDS.\nAbout GreenCoinX\nGreenCoinX Inc is the developer of GreenCoinX (crypto currency symbol XGC) which is the world’s first identifiable crypto currency. GreenCoinX identifies users and facilitates the collection of user defined optional taxes by worldwide governments. By eliminating anonymity, GreenCoinX has removed the biggest barrier to widespread adoption of crypto currency. For more information, please visit: http://www.GreenCoinX.com or contact Danny Wettreich at dw@GreenBankCapitalInc.com", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5HcmVlbkNvaW5YLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9ncmVlbmNvaW54LmNvbS8="], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T20:07:00.415+03:00", "highlightTitle": ""}