{"organizations": [], "uuid": "2869bac930ed4d63e929bdb23215818467aac267", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/oSWJS24IZGkeu77jNbJDtA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/rtx1kg77-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/alexis-tsipras-resigns-calls-snap-180738120.html", "country": "GB", "title": "Alexis Tsipras Resigns And Calls Snap Election", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Alexis Tsipras Resigns And Calls Snap Election", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T07:20:00.000+03:00", "replies_count": 0, "uuid": "2869bac930ed4d63e929bdb23215818467aac267"}, "author": "", "url": "https://uk.finance.yahoo.com/news/alexis-tsipras-resigns-calls-snap-180738120.html", "ord_in_thread": 0, "title": "Alexis Tsipras Resigns And Calls Snap Election", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alexis Tsipras"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 05:28 BST - UK Markets open in 2 hrs 32 mins Alexis Tsipras Resigns And Calls Snap Election By (c) Sky News 2015 | Sky News – 8 minutes ago View Photo \n\nAlexis Tsipras has confirmed he is resigning as Greek Prime Minister - paving the way for a general election to take place within the next 30 days. \nThere had been considerable speculation that an early vote would take place after Mr Tsipras secured a three-year, €86bn bailout package from creditors. \nAlthough he was only elected Prime Minister seven months ago, several Syriza MPs expressed opposition to the rescue plan - not least because of the punishing austerity measures they will bring. \nWhen Greece's parliament voted on the package last week, Mr Tsipras had to rely on opposition lawmakers for the bill to pass. \nIn a televised address to the nation, he said: \"I feel the deep moral and political obligation to set before your judgment everything I have done, both right and wrong, the achievements and the omissions. \n\"The popular mandate I received on January 25 has exhausted its limits.\" \nMr Tsipras hopes a second Syriza victory in the upcoming election - which will likely be held on 20 September - will seal public support for the bailout package, and quell the backlash from party rebels. \nHowever, before a polling date can be set, other parties will be given three days to try and form a new administration without Syriza. \nThe leader of Greece's second-largest party, New Democracy, has said it is his responsibility to exhaust all possibilities - and confirmed he is planning to meet with other political party leaders. \nSyriza swept to power on a mandate of scrapping spending cuts and tax increases - but under Mr Tsipras, the party made a major U-turn by accepting strict austerity conditions in exchange for another bailout. \nDespite this, he remains very popular with Greek voters, and in opinion polls before the bailout deal was finalised, he was far ahead of opposition rivals in opinion polls. \nIt (Other OTC: ITGL - news ) is possible that Mr Tsipras could get a more favourable result in a general election that is held before voters feel the impact of the spending cuts and tax hikes which Greece must implement as part of the bailout deal. \nThe election will bring unwelcome levels of political uncertainty, and there has already been a detrimental impact on the Greek Stock Exchange. \nAlso on Thursday, Greece received the first instalment of loans from creditors, worth €13bn (£9.25bn), enabling it to make a €3.2bn (£2.3bn) debt repayment to the European Central Bank.", "external_links": [], "published": "2015-08-21T07:20:00.000+03:00", "crawled": "2015-08-21T07:36:18.488+03:00", "highlightTitle": ""}