{"organizations": [], "uuid": "a3826eb2d5b45403dad34d7c052b8863778bd190", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508141382.html", "country": "US", "title": "East Africa: EALA to Debate Bill On Regional Electronic Transactions Next Week", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "East Africa: EALA to Debate Bill On Regional Electronic Transactions Next Week", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T16:55:00.000+03:00", "replies_count": 0, "uuid": "a3826eb2d5b45403dad34d7c052b8863778bd190"}, "author": "", "url": "http://allafrica.com/stories/201508141382.html", "ord_in_thread": 0, "title": "East Africa: EALA to Debate Bill On Regional Electronic Transactions Next Week", "locations": ["Nigeria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: Capital Markets Issuers Plan Cross-Border Listing of ETFs \nThese are the EAC Electronic Transaction Bill 2014, and the EAC Creative Industries Bill 2015,\" the bloc's secretariat said ahead of next week's session of the East Africa Legislative Assembly (Eala). \nThe Electronic Transaction Bill 2014 targets to encourage electronic-based transactions as a more efficient mode of linking both the private sector and governments in the region. \nMost government regulatory procedures are expected to go electronic. \n\"The Bill further wants to promote technology neutrality in applying legislation to electronic communications and transactions and to develop a safe, secure and effective environment for the consumer, business and the governments of the partner States to conduct and use electronic transactions,\" the EAC secretariat further said. \nEala has already undertaken a series of public hearings to source for stakeholders' views on the Bill. \nEAC countries are currently implementing a series of seamless systems, including a joint tax collection and cargo clearing system known as Single Customs Territory (SCT), to improve the flow of goods and reduce dumping. \nUnder the SCT deal, clearing agents within the EAC have been granted rights to relocate and carry out their duties in any of the partner states as part of a strategy to improve the flow of goods and curb dumping. \nImporters of commodities covered under the SCT are required to lodge import declaration forms in their home countries and pay relevant taxes to facilitate the export process. \nJoining the scheme \nThe tax authorities in the respective countries then issue a road manifest against the import documents submitted electronically by the revenue authority of the importing country. \nKenya, Rwanda and Uganda were the first to take up the SCT arrangement starting April 1, 2014 with Tanzania joining the scheme two months later. \nSeveral commodities including steel, edible oils, confectionery and milk are currently traded between Kenya, Uganda and Rwanda under the SCT platform. \nCement, cigarettes and neutral spirits were the first products to be handled under the SCT scheme. Kenya and Tanzania in June expanded the list of items traded between them under the SCT, raising hope for improved flow of goods and reduced dumping. East Africa \nNAMIBIAN authorities are frantically working to verify whether terrorist cells linked to al-Qaeda and its offspring, the … see more » Copyright © 2015 The East African. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-14T16:55:00.000+03:00", "crawled": "2015-08-14T20:16:04.905+03:00", "highlightTitle": ""}