{"organizations": ["The National Bonds"], "uuid": "631f96a780b4e57f2169eb130d06d471e1fbd68c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenational.ae", "main_image": "http://www.thenational.ae/storyimage/AB/20150819/ARTICLE/150818903/AR/0/AR-150818903.jpg", "site_section": "http://thenational.ae//section/rss/1034", "section_title": "Personal Finance RSS feed - The National", "url": "http://www.thenational.ae/business/economy/more-uae-residents-saving-for-retirement-and-paying-off-loans", "country": "", "title": "More UAE residents saving for retirement and paying off loans", "performance_score": 0, "site": "thenational.ae", "participants_count": 0, "title_full": "More UAE residents saving for retirement and paying off loans", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T18:19:00.000+03:00", "replies_count": 0, "uuid": "631f96a780b4e57f2169eb130d06d471e1fbd68c"}, "author": "", "url": "http://www.thenational.ae/business/economy/more-uae-residents-saving-for-retirement-and-paying-off-loans", "ord_in_thread": 0, "title": "More UAE residents saving for retirement and paying off loans", "locations": ["UAE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Silvia Razgova"], "text": "The National Bonds survey found that 47 per cent of respondents said they made monthly payments towards a personal loan. Silvia Razgova / The National More UAE residents saving for retirement and paying off loans Financial literacy \nMore UAE residents are saving for retirement, according to a report by the National Bonds Corporation. \nAt the same time the second-quarter survey by the Dubai-based savings and investment company found that more people are paying off personal loans, yet another indication that the cost of living in the Emirates is on the rise and that residents are struggling to make ends meet. \nForty-two per cent of respondents to the survey said they saved for retirement, a 6 percentage point increase from the first quarter of this year. The company is trying to promote financial literacy at a time when consumer lending is on the rise. \n“We utilise these survey results to come up with best plans designed for each age group according to their priorities, commitments and financial behaviour,” said Mohammed Qasim, the chief executive of National Bonds. \n“We need to inculcate the concept of regular saving so it becomes a year-long practice regardless of priorities or seasonal variations. Everyone needs to know their financial stability and security and limit possibilities of falling into debt.” \nNot falling into debt has however become increasingly difficult in the UAE. Inflation in Abu Dhabi and across the country last month grew at its fastest rate since 2009 as housing costs and utilities prices continued to increase. \nNationwide, prices rose by 4.4 per cent in the 12 months to July, up from 4.2 per cent in June. That was led by a 10 per cent increase in housing and fuel costs. In Abu Dhabi, inflation rose to 5.4 per cent in July, up from 4.9 per cent in June. \nDubai and Abu Dhabi are also the most expensive cities in the Middle East for expatriates, according to the most recent survey by the cost of living experts Mercer. Abu Dhabi and Dubai are the 33rd and 23rd most-expensive cities in the world, respectively – in large part because of a steep rise in rents for expatriates. \nThe National Bonds survey found that 47 per cent of respondents said they made monthly payments towards a personal loan, a 3 percentage point gain from the previous quarter’s survey. \nThe UAE has one of the world’s highest rates of indebtedness at US$95,000 per household, banking executives say. \nIn order to help keep credit growth in check and prevent consumers and corporations from overstretching themselves, the government launched the Al Etihad Credit Bureau last year. \nMost consumer debt is in the form of personal loans and credit cards, and the average resident with debt has two loans, according to statistics from the credit bureau. \nThe latest credit bureau figures show that about 3.1 million residents have 6.69 million active loans. Both those numbers are up 10 per cent from the end of December, according to the credit bureau. \n“Total personal loans are growing at a high rate,” said Alp Eke, senior economist at the National Bank of Abu Dhabi. “People are borrowing to cover living expenses but the lenders and the regulators are more careful.” \nEighty-one per cent of respondents to the National Bonds survey were married couples, with more than 64 per cent having children. \nFollow The National’s Business section on Twitter Pages:", "external_links": [], "published": "2015-08-19T18:19:00.000+03:00", "crawled": "2015-08-19T18:14:07.108+03:00", "highlightTitle": ""}