{"organizations": [], "uuid": "0c448e89560f82bfef52e5bf000535b8420dece5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-credit-cards/?format=rss", "section_title": "Credit Card News | Reviews | Advice - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/claude-littner-had-first-most-111550175.html", "country": "GB", "title": "Claude Littner: 'I had my first and most successful business when I was eight years old’", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Claude Littner: 'I had my first and most successful business when I was eight years old’", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T14:15:00.000+03:00", "replies_count": 0, "uuid": "0c448e89560f82bfef52e5bf000535b8420dece5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/claude-littner-had-first-most-111550175.html", "ord_in_thread": 0, "title": "Claude Littner: 'I had my first and most successful business when I was eight years old’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Claude Littner"], "text": "45.33 +0.13 \nFame and fortune: Claude Littner of 'The Apprentice' wasn’t just an entrepreneur in his youth, he was investing in shares too \nClaude Littner, 66, is known for his formidable interviewing style when grilling contestants on BBC One’s The Apprentice . The businessman, who is chairman of Viglen, the computer firm, has stepped up to replace Nick Hewer as Lord Sugar’s adviser on the programme this year. He lives in north London with his wife, Thelma. \n= What was your first job and how much did it pay? = \nThe degree I took was a sandwich, so I spent six months at college and six months working for a business, Lucas CAV [the motor and aerospace manufacturer]. \nMy first wage was £12 and I was very disappointed because after tax it came to about £7. \n= How did your childhood influence your attitude to work? = \nIt influenced me hugely. My father was in business so the conversation all the time was to do with business and how things were growing, obstacles and profit. I was lucky to have a sense of business from an early age. \nI had my first and most successful business when I was eight years old. At school I used my lunch break to go and take orders from my friends for gobstoppers. I bought them for a ha’penny each because I was buying them in such large quantities and I sold them for a penny each. \n• See the rest of today's personal finance news and advice \n= Are you a saver or a spender? = \nI’ve always been a very strong saver. I have always diligently put money in the Post Office or bank and watched it accumulate. \nFrom a very young age I was also buying shares. My parents and grandparents thought this was wonderful. But now, later in life, I think, what was the point in all that saving? What do I do with all this money? \nPerhaps in my earlier life I should saved a bit less, spent a bit more and enjoyed myself. \n'Perhaps in my earlier life I should saved a bit less, spent a bit more and enjoyed myself,' admits Claude Littner Photo: John Lawrence \n= Which shares did you buy? = \nThey were probably blue chips. I was about 13. I was watching every single day, looking in the papers to see if they’d gone up a penny or two. I would sell them and make a few pounds’ profit and I was very pleased. \nI held on to shares that were losing money, instead of cutting my losses. It’s a typical investors’ thing. \n= What’s the most expensive thing you’ve bought, apart from property? = \nI’m not a big spender. I don’t yearn for anything. I’ve got some nice, expensive cars but not because it gives me great pleasure particularly. \nI sound like a really lonely old person but it’s quite the opposite. It’s not to do with material things that give me happiness. I’ve got a big, healthy family. I’ve got a wonderful wife and wonderful children, grandchildren, friends. Those are the things that are priceless to me and give me the greatest enjoyment. \n= In The Apprentice you’re famed for putting contestants in their place when they make a mistake. What’s the biggest financial mistake you’ve made? = \nI’ve made loads. I continue to make them. I amaze myself at just how many mistakes I make. I certainly try to learn from them. \nInevitably, you get problems and dilemmas in business. You get situations where you’re not sure of the right answer. So, you have to make a decision based on your evaluation of the circumstances and very often I’ll make the wrong decision. \nThe beauty of that is not having a big ego and thinking because I made that decision I will carry it through to the bitter end but being sensible enough to recognise that you’ve made a bad call. \n= Could you give an example? = \nI think I’ve been too generous when I’ve had an opportunity. I’ve been very happy to share my opportunity with other managers or bring in people and give them a share or percentage. I could have been a lot tougher in terms of keeping a bigger share holding. \n= Has there ever been an idea on The Apprentic e that you wished you’d come up with yourself? = \nI don’t think so. There are lots of apprentices who come up with ideas which may seem good, but when you delve into it there are reasons why it wouldn’t make a good investment. I don’t think I’ve spotted an investment that we absolutely should have made that we didn’t make. Those companies that he [Lord Sugar] has invested in have done very well. \n• Poundland founder: 'I sold up and gave £25m to my Dad' \n• Hilary Devey: 'I made £1m from gold; £1.5m on Spanish property' \n• Nadine Dorries: 'Poverty drove me to a £500,000 salary ' \n= Do you have financial provisions for retirement? Do you have a pension? = \nThe companies I’ve worked for have always had a pension scheme and I’ve always gone in for it. So I have a large pension pot that I haven’t touched because I don’t really need the money. \n= What’s your most treasured possession? = \nWhen I was 13 my grandmother bought me a gold watch and when I was 18 my parents bought me a gold strap for it. I have a ring that was my father’s. If I lost my ring or my watch I’d be really upset. Apart from that there are no material possessions that I really care about. \n= Do you prefer to pay by cash, credit card or debit card? = \nI can’t see the point of debit cards. I use my credit card and always pay it off at the end of the month. I’d hate to miss a payment and get a ridiculously huge interest charge. \n= What piece of advice would you give your 18-year-old self? = \nIn the benefit of hindsight I would be a bit freer with money and wouldn’t have been so keen on saving. But at the time I didn’t know how my life would turn out and I was always worried. \nIf things went bad I would always have money saved up for a rainy day. This is a very expensive country, property is expensive, everything is expensive, but I think it’s very important for young people to save. \n= Is that the same advice you gave to your children? = \nMy children are in a fortunate position because they have a wealthy father. They are not in the same position I was in. They’ve both got very good jobs but they’ve got children and life is very expensive. My advice is to save if you can. \n'I don’t think I’ve spotted an investment that we absolutely should have made that we didn’t make,' says Claude, above with Lord Sugar Photo: REX Shutterstock \n= You’ve just been promoted from interviewer in The Apprentice to be on the bench with Karren Brady alongside Lord Sugar. What are your top tips for getting a promotion? = \nI don’t regard it as a promotion. It was something that Alan asked me to do and I was pleased that he asked me. Of course, I don’t like to refuse him anything so it was more of an honour than a promotion. \nI’ve always been quite brave if I wanted a promotion or another job. My first real job was with Unilever (NYSE: UL - news ) and I absolutely loved my time there. It didn’t take me very long before I said to my manager that I wanted a promotion. \nIf you’re doing a good job and you’re ambitious then I think there’s nothing wrong with finding the right time and the right person and explaining how keen you are to get a promotion, another job or something to stretch you further. \nOn the other hand, if you’re in an environment where you’re lucky to have a job and people are losing theirs then it’s not a good idea to ask for a promotion. You have to be sensible about the environment you’re working in and perhaps sometimes keep your head down and hope that the axe doesn’t fall on you. \n= What’s the most lucrative work you’ve ever done? = \nThe biggest opportunity that came my way was when I was at Tottenham Hotspur Football Club I was chief executive and Alan [Lord Sugar] was chairman. I was approached by 3i, which had invested about £350m in a five-a-side football company called Powerleague. \nIt was bleeding money and they couldn’t stand it as they just weren’t seeing any returns. They asked me if I could do something with it. I told them my skills and knowledge of professional football would be of no use to them. They didn’t listen and said I should try and do something with it. So I did. \nEventually 3i said they wanted to dispose of the company, so I bought it. Later I floated it and then sold it, and made a large sum of money in the process. \n= Do you support any charities? = \nA lot mainly Jewish charities, but a few years ago I had cancer. I’m very lucky to have survived that so I’ve got a particular affinity to some cancer charities. I had something called non-Hodgkin’s lymphoma and most people die from it, so I was incredibly lucky to survive. \n= What are you financial priorities for the next five to 10 years? = \nTo make sure that my children and grandchildren are well provided for. I haven’t really got a particular goal, just capital preservation. \n• Claude Littner promotes Sure Maximum Protection", "external_links": [], "published": "2015-07-31T14:15:00.000+03:00", "crawled": "2015-08-02T10:17:43.246+03:00", "highlightTitle": ""}