{"organizations": [], "uuid": "a0fddf748e167635431a5b306b51a85a577b7049", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=15363_1120.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/digital-currency-to-the-rescue-bitcoins-63401/", "country": "US", "title": "Digital Currency to the Rescue: Bitcoins as Solution to Greek Capital Controls", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Digital Currency to the Rescue: Bitcoins as Solution to Greek Capital Controls", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T23:10:00.000+03:00", "replies_count": 0, "uuid": "a0fddf748e167635431a5b306b51a85a577b7049"}, "author": "Goodwin Procter LLP", "url": "http://www.jdsupra.com/legalnews/digital-currency-to-the-rescue-bitcoins-63401/", "ord_in_thread": 0, "title": "Digital Currency to the Rescue: Bitcoins as Solution to Greek Capital Controls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=f1202c4a-07ce-4382-a616-3db8f807f4a7\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nThis week Cubits.gr and BTCGreece began a partnership aimed at providing a solution to Greek capital controls. Part of that solution entails supporting voucher payments backed by bitcoin and installing one thousand Bitcoin ATMs throughout the country. Cubits , a UK Registered company founded in 2014, is a Bitcoin platform where individuals can buy, exchange, or store bitcoin, and BTCGreece is a Greek Bitcoin exchange. Greece’s capital controls heavily restrict its citizens’ ability to make monetary transactions, and Bitcoin is seen as an opportunity for financial freedom and safety from the uncertainty of banks. \nFor example, a Greek citizen has a daily cash withdrawal limit of 60 euros from the bank – and they were only recently given the flexibility of withdrawing cumulative daily allowances up to 420 euros once a week. The Greek government “ relaxed” one of its banking transactions restrictions when the finance ministry published an amendment allowing Greeks to spend up to $500 euros abroad per person per month, but this limitation still greatly hinders commerce with foreign businesses. Further, Greek companies often have to wait for government commissions to sign off on large bills owed to foreign entities, and because of these restraints, they struggle to meet financial obligations to suppliers and partners. \nCubits and BTCGreece sought this partnership in an effort to help Greek businesses circumvent these controls and facilitate cross-border payments. Digital currency is seen as a possible alternative to waiting out the Greek debt crisis. It just may catch on, as Greeks have been turning to more creative ways to generate cash as of late (Greek police have recorded a spike in looting of antiquities and illegal excavations at ancient sites, often by people with no criminal histories). The first ATMs, which will allow for exchanging cash for bitcoins, are scheduled to launch by October this year.", "external_links": [], "published": "2015-08-20T23:10:00.000+03:00", "crawled": "2015-08-20T23:25:31.168+03:00", "highlightTitle": ""}