{"organizations": [], "uuid": "45f9f847f37db9b6a5b35c8fd8ce587483e7a4c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29871849/los-angeles-multifamily-housing-leader-nms-properties-announces-featured-apartment-community-for-september-2015", "country": "US", "title": "Los Angeles Multifamily Housing Leader NMS Properties Announces Featured Apartment Community for September, 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Los Angeles Multifamily Housing Leader NMS Properties Announces Featured Apartment Community for September, 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T13:46:00.000+03:00", "replies_count": 0, "uuid": "45f9f847f37db9b6a5b35c8fd8ce587483e7a4c8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29871849/los-angeles-multifamily-housing-leader-nms-properties-announces-featured-apartment-community-for-september-2015", "ord_in_thread": 0, "title": "Los Angeles Multifamily Housing Leader NMS Properties Announces Featured Apartment Community for September, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NMS Properties, Inc., one of Los Angeles’s top property management and development companies, has announced it’s featured apartment community for September 2015. With the Fall season quickly approaching, NMS’s featured community is fast becoming an especially coveted location to secure a rental.\nNMS Properties, Inc., a key provider of luxury and affordable multifamily housing in Los Angeles, Santa Monica, Brentwood, Westwood, and West Hollywood, at http://www.NMSproperties.com is pleased to announce their choice for September 2015’s featured apartment community: the Wilshire Margot. The selection of NMS’s Wilshire Margot luxury apartment community comes at a time when this location is at a high-demand.\nThe Wilshire Margot at http://www.WilshireMargot.com is located on the prestigious Wilshire corridor in Westwood, Los Angeles. Located just steps from Beverly Hills, Brentwood, and Century City; this is a location that offers all of the best of Los Angeles, right at your doorstep.\nNew and current residents have witnessed Los Angeles and the surrounding areas become one of the toughest markets to obtain quality rentals in. Often, the demand is greater than the supply. With high-quality rentals that NMS Properties most often develops themselves, NMS is exceedingly proud of the quality and the experience that their apartment homes bring. This sentiment is indeed apparent when one first steps foot into September’s featured community: the Wilshire Margot.\nWhat You Can Expect from NMS’s September 2015 Featured Property, the Wilshire Margot\nUpon entry, you will find yourself in a striking courtyard that features a perfectly placed fountain. The front lobby offers a secured entry, and secure underground parking. Your guests will feel right at home as they are greeted by Wilshire Margot’s affable (24/7) Concierge.\nThe interiors of the Wilshire Margot apartment homes are nothing short of spectacular, as they offer a truly rare LA amenity of spacious and inviting floor plans. Walk-in closets, package acceptance, a fitness room, and a sauna are just a few of the many additional amenities that come standard with every Wilshire Margot apartment rental experience. At the end of the day, Wilshire Margot residents can also relax and unwind as they watch the sunset near the outdoor fireplace, from the famous Wilshire Margot rooftop lounge area.\nThe Wilshire Margot offers fully-furnished, short-term housing, as well as Corporate Housing options that are perfect for enjoying Los Angeles at length.\nAbout NMS Properties, Inc.\nNMS Properties, Inc. (NMS) is a privately owned real estate development and management firm that specializes in the acquisition, entitlement, development and management of multifamily and mixed-use properties in the Greater Los Angeles area. NMS’s portfolio includes luxury, mixed-use and affordable residential units along with retail and commercial properties within core L.A. markets.\n //www.prweb.com/releases/2015/08/prweb12921405.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/08/prweb12921405.htm"], "published": "2015-08-25T13:46:00.000+03:00", "crawled": "2015-08-25T12:55:21.015+03:00", "highlightTitle": ""}