{"organizations": [], "uuid": "11b6a1ed8e18f4043b7417257bfdd532788e867a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/v/h/a/5/image.related.afrArticleLead.620x365.gj74yg.png/1433117681628.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/policy/independent-contractors-australia-baulk-over-100k-cap-for-unfair-contracts-law-20150825-gj74yg", "country": "AU", "title": "Independent Contractors Australia baulk over $100k cap for unfair contracts law", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Independent Contractors Australia baulk over $100k cap for unfair contracts law | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T12:03:00.000+03:00", "replies_count": 0, "uuid": "11b6a1ed8e18f4043b7417257bfdd532788e867a"}, "author": "Ben Potter", "url": "http://www.afr.com/news/policy/independent-contractors-australia-baulk-over-100k-cap-for-unfair-contracts-law-20150825-gj74yg", "ord_in_thread": 0, "title": "Independent Contractors Australia baulk over $100k cap for unfair contracts law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Independent Contractors Australia accuses the Abbott government of breaking an election promise to protect small business from unfair standard contracts imposed by big business and government agencies. Louie Douvis by Ben Potter The Abbott government has lost one of the main backers of its small business unfair contracts legislation because it includes a $100,000 cap on protected contracts.\nKen Phillips, executive director of Independent Contractors Australia (ICA), said the cap emasculates the protection that would have been afforded by the Treasury Legislation Amendment (Small Business and Unfair Contract Terms) Bill 2015.\n\"We're staggered. We're opposing the Unfair Contracts Bill,\" Mr Phillips says in an email to his members which accuses the government of trickery and breaking an election promise to protect small business from unfair standard contracts imposed by big business and government agencies.\n\"The Coalition didn't promise to protect some small business people some of the time! It's a sell out to big business and government bureaucracy who oppose small business protections. The government's stated excuse for doing this is irrational.\"\nIn submission to the Senate Economics Legislation Committee, ICA - a lobby group - says the cap will enable large corporations and government agencies to use the legal system to wriggle out of the protection.\nThe $100,000 cap is for contracts with a term of less than a year. Contracts for more than a year are included up to $250,000.\nMr Phillips says these amounts are deceptively low and would exclude many contracts entered into by self-employed accountants, lawyers, engineers, architects, builders, IT professionals, small retailers and family farmers.\nOwner-drivers of trucks would lose the shield because they have to include the implied rental of their expensive rigs. Many other contractors are in a similar position because of the high cost of their tools of trade.\n The need to cover other costs such as GST and workers' compensation premiums also reduces the real value of the cap to more like $80,000 for contracts of less than one year and $200,000 for longer engagements, ICA's submission says.\nThe ICA's support is important because it has been a strong backer of small business minister Bruce Billson since before the 2013 election - when he attended the group's events - and welcomed his inclusion in the cabinet after the coalition's victory.\nNow the relationship is strained as the ICA urges the Senate Committee to recommend the removal of the $100,000 limit and argues there should be no limit except a definition of small business as a firm with fewer than 20 employees.\nThe government argues that the bill still catches 80 per cent of contracts and large business maintains that businesses should negotiate terms beyond a reasonable contract value.", "external_links": [], "published": "2015-08-25T12:03:00.000+03:00", "crawled": "2015-08-25T13:07:54.411+03:00", "highlightTitle": ""}