{"organizations": ["Crisil", "Nomura India", "BNP Paribas Mutual Fund", "India Inc"], "uuid": "eb828793f4e5914e3ea73c11604579c630c6024a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48383974,width-600,resizemode-4/.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/1286551815.cms", "section_title": "Finance-Economy-News-The Economic Times", "url": "http://economictimes.indiatimes.com/news/economy/finance/india-incs-capital-investment-to-fall-by-2-in-2016-crisil/articleshow/48383966.cms", "country": "IL", "title": "India Inc’s capital investment to fall by 2% in 2016: Crisil", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "India Inc’s capital investment to fall by 2% in 2016: Crisil", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T01:51:00.000+03:00", "replies_count": 0, "uuid": "eb828793f4e5914e3ea73c11604579c630c6024a"}, "author": "", "url": "http://economictimes.indiatimes.com/news/economy/finance/india-incs-capital-investment-to-fall-by-2-in-2016-crisil/articleshow/48383966.cms", "ord_in_thread": 0, "title": "India Inc’s capital investment to fall by 2% in 2016: Crisil", "locations": ["MUMBAI"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Prabhat Awasthi", "Shah", "Anand Shah"], "text": "ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! MUMBAI: Investors who are betting on companies that would benefit from a recovery in the investment cycle, may have to wait longer. Capital investments across 22 sectors have declined and are expected to fall 2 per cent in the financial year ending March 31, 2016, according to a study by ratings agency Crisil. The drop in investments would be led by the private sector, whose spending is expected to decline 8 per cent in this fiscal — for the third year in a row. \"We believe that a meaningful recovery in capital investments will only be visible from fiscal 2017 — when we expect to see a 7 per cent increase,\" said Crisil on Thursday. The ratings agency said large sectors such as power generation, aluminium, steel, cement and refining & marketing are a drag, while the infrastructure segments such as urban infrastructure, national highways and renewable energy are preventing a bigger decline in overall investments. \"We don't have any exposure in our portfolio that's anticipating recovery in capital investments,\" said Anand Shah, chief investment officer with BNP Paribas Mutual Fund . \"We are avoiding this space as globally there is overcapacity in many sectors.\" Shah is bullish on select stocks in defence, railways and roads sectors, which could see an increase in investments. ET Metal Index, which comprises of steel and cement companies, are among the worst hit sectors. The index has dropped 39 per cent over past one year. ET Power Index has declined 17 per cent against the 12 per cent rise in the last one year. Crisil said utilisation rates in 10 out of 12 industrial sectors are stumbling at 5-year lows causing new project announcements to dry up. Consequently, fresh investments in projects announced over past 1 year are expected to account for 20 per cent of the total investments. \"We expect recovery in investment to start only from FY17,\" said Prabhat Awasthi, MD and head of equity at Nomura India. \"New projects may take some time to come, and doesn't matter whatever the government would have done this decline in investments for first 2 years was expected.\"  ", "external_links": [], "published": "2015-08-07T01:51:00.000+03:00", "crawled": "2015-08-07T02:20:59.891+03:00", "highlightTitle": ""}