{"organizations": [], "uuid": "cf1b5b22ff4b38eb210094d60bcd5bb06893a9c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/rXvIL_N_v9Lj1rio4.fOzA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/5f024d7a5be081958eafa7f94500bd814f48bd2f_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/us-judge-throws-amex-swiping-195610803.html", "country": "GB", "title": "US judge throws out AmEx swiping fee settlement", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "US judge throws out AmEx swiping fee settlement", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T22:56:00.000+03:00", "replies_count": 0, "uuid": "cf1b5b22ff4b38eb210094d60bcd5bb06893a9c9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/us-judge-throws-amex-swiping-195610803.html", "ord_in_thread": 0, "title": "US judge throws out AmEx swiping fee settlement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Aug 4, 2015, 22:36 BST - UK Markets closed US judge throws out AmEx swiping fee settlement AFP – 1 hour 40 minutes ago View Photo \n\nA US federal judge threw out a proposed class action settlement between American Express (Swiss: AXP.SW - news ) and merchants Tuesday after concluding that the lead attorney representing merchants had compromised the talks. \nUS District Judge Garaufis said the \"improper and disappointing\" conduct of attorney Gary Friedman of Friedman Law Group of New York City \"fatally tainted\" talks on a settlement to end litigation over American Express's swiping fee restrictions on its credit cards. \nThe proposed settlement would have permitted merchants to impose a surcharge on AmEx transactions in some cases. Friedman and other class counsel also filed a motion for attorneys fees of up to $75 million. \nSeveral leading merchants in the class, including Home Depot (Swiss: HD.SW - news ) , Target (NYSE: TGT - news ) , Wal-Mart Stores and Southwest Airlines (NYSE: LUV - news ) , had opposed the settlement. \nWithout ruling on the merits of the settlement itself, Garaufis said its legitimacy had been ruined by Friedman's conflict of interest. \nGaraufis said Friedman had compromised the litigation with unauthorized communications with Keila Ravelo, a former attorney at Wilkie Farr & Gallagher who had been representing MasterCard, a defendant in another class-action case in which merchants sued MasterCard and Visa (Xetra: A0NC7B - news ) for their alleged conspiracy to fix interchange fees. \nThe Department of Justice, in December 2014, filed a criminal case against Ravelo and her husband on charges of seeking to defraud Wilkie, another law firm, and MasterCard of $5 million. Wilkie discovered Ravelo's lengthy email trail with Friedman after learning of the DOJ case. \nGaraufis outlined lengthy and detailed email correspondence between Friedman and Ravelo on the terms of the evolving talks between AmEx and merchants. Friedman and Ravelo were longtime friends who had previously worked together at a large law firm. In one of the emails, Friedman instructed Ravelo to \"burn after reading.\" \nThe communication between Friedman and Ravelo raised a risk that \"Friedman, with Ravelo in his ear, negotiated settlement terms that are worse for class members than the terms he might have negotiated absent that conflict,\" Garaufis said. \n\"This risk requires the court to deny approval of the settlement.\" \nAmerican Express said it was \"disappointed\" with the decision. \n\"We continue to believe the agreement was fair to merchants, and would provide them with additional flexibility while ensuring our card members are treated fairly at the point of sale,\" AmEx said. \n\"We believe we have strong defenses against the merchants' claims, and will continue to fight our case in court.\"", "external_links": [], "published": "2015-08-04T22:56:00.000+03:00", "crawled": "2015-08-05T00:39:16.708+03:00", "highlightTitle": ""}