{"organizations": [], "uuid": "d7fa182610828195eed2198fbdb749686c7bcd33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/06/markets-stocks-usa-idUSL1N10H3AQ20150806", "country": "US", "title": "US STOCKS-Media stock selloff leaves Wall Street bruised", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "US STOCKS-Media stock selloff leaves Wall Street bruised | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T00:38:00.000+03:00", "replies_count": 0, "uuid": "d7fa182610828195eed2198fbdb749686c7bcd33"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/06/markets-stocks-usa-idUSL1N10H3AQ20150806", "ord_in_thread": 0, "title": "US STOCKS-Media stock selloff leaves Wall Street bruised", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Disney, Viacom lead media selloff\n* S&P media index records worst two-day tumble since 2008\n* Tesla, Green Mountain fall after results\n* Zynga falls after the bell following quarterly report\n* Indexes finish down: Dow 0.69 pct, S&P 0.78 pct, Nasdaq 1.62 pct (Updates to close, adds detail on Zynga)\nBy Noel Randewich\nAug 6 (Reuters) - Wall Street ended sharply lower on Thursday as weak earnings reports from media companies stirred fears that more viewers are ditching cable TV, dragging the sector to its worst two-day loss since the financial crisis.\nThe selloff was compounded by nervousness ahead of key jobs data on Friday that could provide clues about the timing of the first Federal Reserve interest rate hike in almost a decade.\nViacom fell 14.22 percent to its lowest in almost four years after reporting lower-than-expected quarterly revenue due to weakness in its cable TV business. Walt Disney was off 1.79 percent and down for a second session after it lowered profit guidance for its cable networks unit on Tuesday.\nThe S&P 500 media index lost 2.12 percent and notched its biggest two-day fall since November 2008, with Time Warner, Comcast and CBS all in the red and Twenty-First Century Fox down 6.4 percent.\n\"All the media stocks are down and it seems people just want to get out of the sector at any cost and take any loss,\" CLSA analyst Vasily Karasyov said.\nViacom's results and Disney's warning put the spotlight on a trend of viewers shifting from cable TV to Internet-based services such as Netflix, which rose 2.21 percent.\nThe Dow Jones industrial average fell 0.69 percent to end at 17,419.75 and the S&P 500 lost 0.78 percent to 2,083.56. The Nasdaq Composite dropped 1.62 percent to 5,056.44, its biggest one-day tumble since early July.\nEight of the 10 major S&P sectors were lower, with the health index's 2.09 percent fall leading the decliners. Allergan fell 5.1 percent after the Irish drugmaker reported a second-quarter loss.\nIn other earnings-driven stock moves, Tesla fell 8.88 percent and Keurig Green Mountain slumped as much as 29.75 percent after reporting disappointing numbers.\nInvestors were also jittery ahead of the release of U.S. non-farm payroll numbers, which are expected to have risen by 223,000 in July, matching gains in June.\nThe Fed has said it will raise rates only when it sees a sustained recovery in the economy.\nAfter the bell, Zynga fell 6 percent after it posted a disappointing quarterly report.\nWith about three-quarters of the S&P 500 companies having reported, second-quarter earnings are estimated to have increased 1.6 percent while revenues are projected to have fallen 3.4 percent.\nHowever, valuations look stretched. The S&P 500 is trading at a 25 percent premium to its historical median price-to-sales ratio, Jack Ablin, chief investment officer at BMO Private Bank said in a note to clients.\nIn Thursday's session, declining issues outnumbered advancing ones on the NYSE by a rate of 1.47 to 1. On the Nasdaq, that rate was 2.46 to 1 favoring decliners.\nThe S&P 500 index posted 18 new 52-week highs and 44 new lows; the Nasdaq Composite saw 64 new highs and 169 new lows.\nAbout 7.8 billion shares changed hands on all U.S. exchanges, well above an average 6.77 billion in the past five sessions, according to BATS Global Markets data. (Additional reporting by Tanya Agrawal and Lehar Maan; Editing by Saumyadeb Chakrabarty and Meredith Mazzilli)", "external_links": [], "published": "2015-08-07T00:38:00.000+03:00", "crawled": "2015-08-06T23:50:54.397+03:00", "highlightTitle": ""}