{"organizations": [], "uuid": "fef912bea68c83c949602123da6465834af13ef3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Janmanch0247.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/effective-public-action/43021.html", "country": "IN", "title": "Effective Public Action", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Effective Public Action", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T12:59:00.000+03:00", "replies_count": 0, "uuid": "fef912bea68c83c949602123da6465834af13ef3"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/effective-public-action/43021.html", "ord_in_thread": 0, "title": "Effective Public Action", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A social organisation for like-minded people, founded by late Justice Ashok Desai, has emerged as a public platform Way back, in 1987, a handful of public-spirited individuals came together, inspired by the late Justice Ashok Desai, to sow the seeds of a unique public platform that is now known as Jan Manch (public platform). Justice Desai was then on the Nagpur Bench of the Bombay High Court. One of the first decisions by the group was to steer clear of party politics in any form, and to keep the organisation open to all, irrespective of caste, creed or religion. Advocate Kilor recalls, “Our consistent performance gradually caught the attention of the people in general and the media in particular, and the network began to expand, just as Justice Desai had predicted. With increasing activities and expectations of people, it became imperative to assume a formal identity and, thus, Jan Manch was formed in 2008.” Advocate Kilor, a dedicated activist and lawyer, is the president of this Nagpur-based NGO. Over the years, Jan Manch has evolved as a social organisation that works with the grassroots administration as well as directly with the people. Advocate Kilor says “As the organisation grew, we branched into different directions like working for village uplift, setting up outlets to distribute generic medicines, extending financial assistance to rural students from families that are below the poverty line, supplying free medicines as well as cash assistance to patients in financial distress and so on. In fact, in 2012, when we established a store for generic medicines in Nagpur, it was one of the first in Central India.” At the same time, Jan Manch’s fight against corruption also intensified and became more focused. As lack of irrigation facilities is a major cause of farmers’ suicides in Vidarbha, Jan Manch decided to focus its energy on the issue. Its staff painstakingly gathered evidence of corrupt practices in irrigation projects and filed a public interest litigation (PIL) before the Nagpur Bench of the Bombay High Court. The PIL compelled the government to order a probe by the Anti-Corruption Bureau (ACB). Along with involving the government, Advocate Kilor points out, “We also started a Sinchan Shodh Yatra’ (irrigation search journey) to find out what exactly ails these projects and to help speed them up. In the last three months, our activists have started visiting at least one project every fortnight. They make a detailed inspection of the site, accompanied by officials of the irrigation department as well as representatives of print and electronic media. We have visited six projects so far, including the most ambitious and the corruption-ridden Gosikhurd National Project. During these visits, we have come across many instances of extremely shoddy and inferior quality of work, as a result of collusion between political bosses, officials and contractors.” The relentless shodh yatra, the glare of adverse publicity in the media and a footpath exhibition of photographs led the government to involve Jan Manch on a regular basis in Nagpur for feedback. Advocate Kilor said that Jan Manch has been invited to meet the government officials at their regional headquarters in Nagpur on the first Saturday of every month. Officials answer the NGO’s queries, outline their problems and give a written assurance about the deadline for finishing each project in all respects. Among other activities, Jan Manch has adopted a village named Pahurjira in Buldhana district (with a population of 12,000, located 350km from Nagpur). The NGO found that there was no playground or proper facilities for children. It not only acquired a suitable site from the gram panchayat, but also installed playthings and stocked toys in the premises—what you would find in any well-kept garden in a city. Now, more than a hundred children gather there every evening and the place is alive with their squeals of merriment and laughter. Work, thus, goes on at Jan Manch on grave matters and simple improvement of public facilities. Readers may donate to further the cause of Jan Manch. Donations are exempt under Section 80-G of the Income Tax Act. Premium Plaza, M-5, 242, Mata Mandir Rd, Khare Town, Dharampeth, Nagpur, Maharashtra 440010 Telephone +91 9373104125, +91 9822221423", "external_links": [], "published": "2015-08-04T12:59:00.000+03:00", "crawled": "2015-08-05T14:16:03.176+03:00", "highlightTitle": ""}