{"organizations": [], "uuid": "eba4cc8522115e6354f182bae2debf7edb82952e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business_Finance", "url": "http://www.menafn.com/1094321440/EGOTH-prioritises-investing-in-companys-assets-in-FY-20152015-Chairman&src=RSS", "country": "US", "title": "EGOTH prioritises investing in company's assets in FY 2015/2015: Chairman", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "EGOTH prioritises investing in company's assets in FY 2015/2015: Chairman | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "eba4cc8522115e6354f182bae2debf7edb82952e"}, "author": "Daily News Egypt", "url": "http://www.menafn.com/1094321440/EGOTH-prioritises-investing-in-companys-assets-in-FY-20152015-Chairman&src=RSS", "ord_in_thread": 0, "title": "EGOTH prioritises investing in company's assets in FY 2015/2015: Chairman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Daily News Egypt) The profits of the Egyptian General Company for Tourism and Hotels (EGOTH) amounted to EGP 156m during fiscal year (FY) 2014/2015, according to the company's Chairman and Managing Director, Samir Hassan.\n\nHe added that the company targets profits of EGP 404m by the end of the current FY 2015/2016.\n\nHassan said, in an interview with Daily News Egypt, that the company manages its investment plan according to a priorities policy, in order to maximise the benefit of its assets in the current FY, whether from the lands it owns or the hotels all over the country.\n\nHow did your company turn from losses into profitability during this difficult time for Egyptian tourism?\n\nYes, the past year was difficult. However, we were able to benefit from all the company's assets and follow up on the hotel management companies while operating the hotels owned by EGOTH. We made profits of EGP 156m.\n\nDuring last year, the occupancy rates of some hotels owned by the company improved a lot. These hotels are managed by international hotel management companies.\n\nI do not deny that some hotels are still incurring losses; the management of EGOTH seeks turning these losses into profits in a short period of time.\n\nWhat about the current FY?\n\nDuring this FY, we are working on making the profits reach EGP 240m through enhancing the utilised units of hotels and lands, and as I mentioned, we will work on benefiting from of all the company's assets sufficiently in a short time.\n\nYour company owns many hotels in which development works are still ongoing. When are these set to be completed?\n\nYes, we have development works in many hotels owned by EGOTH, whether in the Marriott, or the Elephantine in Aswan, or in the Montazah land in Sharm El-Sheikh.\n\nThe development works will be finished in a number of hotels during the current year, especially Elephantine hotel in Aswan, with an investment cost of EGP 220m; it is expected to be completed in October.\n\nWhat is your investment plan of the current FY?\n\nWe will work on pumping EGP 404m in investments to develop the company's hotels. EGP 325m will be self-funded, while the rest will be provided through partnership contracts with the companies that manage these assets.\n\nWe will not ask the banks to fund developing the company's assets. That will be through the revenues of EGOTH itself.\n\nYou mentioned that the occupancy rates enhanced in the last period; do you expect them to increase in the next period?\n\nIn the last period, the occupancy rates in some of the hotels owned by the company amounted to more than 70%. We hope that they exceed that level during the next winter season by the end of 2015. However, there is a very important point: we have priorities in developing the hotels and increasing their capacity under the current circumstances.\n\nOrdering priorities is one of the reasons behind the company's success in reaching profitability during the last FY.\n\nWhat about the land that the company owns in Sharm El-Sheikh?\n\nA memorandum of understanding was signed between Al-Montazah for Tourism and Investment, of which EGOTH owns a share, and Emak Aqaba Company to develop that land.\n\nWe target establishing a tourist resort with investment of EGP 800m to compete with the biggest tourism resorts in Sharm El-Sheikh.", "external_links": [], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-29T20:24:06.950+03:00", "highlightTitle": ""}