{"organizations": [], "uuid": "0295298733b8cdb9b43741c163eddba06878c5a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/kV8BQMGueFXsT9EjuM52eQ--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/910be3efe8eb9c4f001d34d0a80695f145a88011_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/nigeria-names-head-state-run-193155862.html", "country": "GB", "title": "Nigeria names new head of state-run oil company", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Nigeria names new head of state-run oil company", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T22:31:00.000+03:00", "replies_count": 0, "uuid": "0295298733b8cdb9b43741c163eddba06878c5a8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/nigeria-names-head-state-run-193155862.html", "ord_in_thread": 0, "title": "Nigeria names new head of state-run oil company", "locations": ["Nigeria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nNigerian President Muhammadu Buhari has appointed a new head of the country's corruption-hit state oil company, weeks after after sacking the entire board, his spokesman said on Tuesday. \nBuhari took office on May 29 and axed Nigerian National Petroleum Company (NNPC) chief Joseph Thlama Dawha and his directors less than a month later after vowing to tackle what he called \"the evil of corruption\". \nEmmanuel Ibe Kachikwu's appointment as NNPC group managing director was announced in a statement from Buhari's spokesman Femi Adesina, which also listed other changes at the top of the state-run company. \nNo reason was given for Dawha's removal after just 10 months in the job, but changes at the much-criticised NNPC have become routine and observers believe the move may have been a prelude to an in-depth probe of its activities. \n\"This appointment marks the beginning of the reforms which will establish the NNPC as corporation which fights corruption and drives growth in the Nigerian economy,\" the company said in a statement. \nKachikwu, a former executive vice-chairman of Exxon-Mobil Africa from the coastal Delta State, is a Harvard-trained lawyer with 30 years' experience in the energy sector, according to the NNPC. \n\"I am excited to be taking up this challenge,\" Kachikwu was quoted as saying in the NNPC statement. \n\"Being in a position to manage the most important natural resource in Nigeria is a source of pride and responsibility for the NNPC and I am committed to taking this forward and helping the NNPC achieve its potential as a globally competitive national oil company.\" \nNigeria is Africa's largest oil producer, churning out roughly two million barrels of crude per day. \nOrdinary people have largely not benefited from the nation's oil wealth, however, with much of the revenue lost to graft. \nThe NNPC is regarded as one of the world's most opaque and corrupt publicly-controlled oil firms and has been linked to the massive theft of vast crude revenues.", "external_links": [], "published": "2015-08-04T22:31:00.000+03:00", "crawled": "2015-08-04T22:39:54.179+03:00", "highlightTitle": ""}