{"organizations": ["Fed", "ECB"], "uuid": "6774b329251b95d4eba8a68be34d504f12f97c21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-sharecast/?format=rss", "section_title": "Finance News | Sharecast - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/bonds-ecb-fed-officials-sound-182700709.html", "country": "GB", "title": "Bonds: ECB, Fed officials sound dovish note", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Bonds: ECB, Fed officials sound dovish note", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T21:32:00.000+03:00", "replies_count": 0, "uuid": "6774b329251b95d4eba8a68be34d504f12f97c21"}, "author": "", "url": "https://uk.finance.yahoo.com/news/bonds-ecb-fed-officials-sound-182700709.html", "ord_in_thread": 0, "title": "Bonds: ECB, Fed officials sound dovish note", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0.0001 0.0000 \n  Sovereign bond yields on either side of the Atlantic diverged on Wednesday, feeding off investor sentiment towards equities in the US and Europe. Gilts were the exception, with the yield on the benchmark 10-year government note moving higher by five basis points to reach 1.96% despite the losses seen on the Footsie. \nYields on US Treasuries of similar maturity also gained ground, rising by five basis points to 2.13%. \nTo take note of, in remarks to Bloomberg TV Bank of America (Swiss: BAC.SW - news ) -Merrill Lycnh rates strategist David Woo said China´s need to prop up the Yuan would force it to sell US Treasuries, hindering any move lower in yields. \nGiven the situation in China and the risk that it will again begin to 'export' deflation to its main trade partners, on Wednesday all eyes were on speeches from central bank officials in the euro area and Stateside. \nSpeaking from Mannheim, Germany, European Central Bank chief economist Peter Praet indicated that events overseas had increased the downside risks for inflation. \nHis remarks were echoed later in the afternoon by the president of the Federal Reserve Bank of New York. In response to journalists´ remarks William C.Dudley said events overseas might blow the moderate recovery in the US economy off-track. \nNonetheless, he added: \"I really hope we can raise interest rates this year. Let´s see the data unfold before we make any statements when that might occur.\" To take note of, in June the European Central Bank became more \"aggressive\" in its search for appropriate asset-backed debt to purchase. It (Other OTC: ITGL - news ) hired fund managers to make unsolicited queries to possible sellers, Bloomberg reported. \nGerman 10-year Bund yields slipped by three basis points to 0.70% and those on French debt of similar maturity by another five basis points to 1.08%.", "external_links": [], "published": "2015-08-26T21:32:00.000+03:00", "crawled": "2015-08-27T00:14:22.406+03:00", "highlightTitle": ""}