{"organizations": [], "uuid": "4f7c45474cb320bafdc3d28ea18313b33ecfbf7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-banks/?format=rss", "section_title": "Banking News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/u-consumer-prices-rise-modestly-131504381.html", "country": "US", "title": "U.S. consumer prices up slightly, airfare weighs", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "U.S. consumer prices up slightly, airfare weighs", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T00:27:00.000+03:00", "replies_count": 0, "uuid": "4f7c45474cb320bafdc3d28ea18313b33ecfbf7c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/u-consumer-prices-rise-modestly-131504381.html", "ord_in_thread": 0, "title": "U.S. consumer prices up slightly, airfare weighs", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 19, 2015, 23:23 BST - UK Markets closed U.S. consumer prices up slightly, airfare weighs Reuters - UK Focus – 55 minutes ago \n* Consumer price index rises 0.1 percent in July \n* Gasoline, food prices moderate; shelter increases \n* CPI (Other OTC: CPICQ - news ) up 0.2 percent from a year ago \n* Core CPI rises 0.1 percent; up 1.8 percent from year ago \nBy Lucia Mutikani \nWASHINGTON, Aug 19 (Reuters) - U.S (Other OTC: UBGXF - news ) . consumer prices rose only slightly in July as airline fares recorded their biggest drop since 1995, but tame inflation pressures will probably not discourage the Federal Reserve from raising interest rates this year. \nThe Labor Department said on Wednesday its Consumer Price Index edged up 0.1 percent last month, with gasoline and food prices increasing marginally. July's rise marked a sixth straight monthly increase. \nWhile inflation remains soft, a strengthening economy, marked by a tightening labor market and a firming housing sector, should give the U.S. central bank confidence it will gradually move toward its 2 percent target, economists said. \n\"Fed officials made clear that they do not need to see higher inflation before hiking. They just need to have reasonable confidence it will return to mandate,\" said Michelle Girard, chief economist at RBS (LSE: RBS.L - news ) in Stamford, Connecticut. \nMost economists have been expecting the Fed to raise its short-term interest rate next month for the first time in almost a decade. \nFutures markets on Wednesday trimmed bets for a September liftoff after minutes of the Fed's July 28-29 meeting showed policymakers remained concerned about weak inflation and tepid wage gains, even as an improving job market had drawn them closer to a rate hike. \nU.S. stocks briefly turned positive after release of the minutes before ending almost 1 percent lower as concerns about China's economy continued to weigh. Treasury prices rose and the dollar fell against a basket of currencies. \n\"It (Other OTC: ITGL - news ) was a mixed message, but it still seems inevitable that we will get higher rates,\" said Macrae Sykes, analyst at Gabelli and Co in Rye, New York. \nIn the 12 months through July, the CPI climbed 0.2 percent. It was the second month the annual CPI increased after plunging crude oil prices pushed it into negative terrain in January. \nSigns of an ebb in the disinflationary trend, combined with easing labor market slack and a pickup in economic growth are likely to be welcomed by policymakers. \nGRADUAL RATE HIKES \nAny monetary tightening by the Fed is likely to be gradual given the dampening effect on inflation of a strong dollar, renewed weakness in oil and other commodity prices, and China's devaluation of the yuan, which should push down import prices. \n\"The low inflation profile will certainly keep the Fed communicating a gradual glide path, but little in the July CPI report suggests that hikes should be delayed,\" said Gennadiy Goldberg, an economist at TD Securities in New York. \nGoldberg noted that the six-month annualized pace of the CPI accelerated to 2.9 percent from 1.3 percent in June. \nAlthough the so-called core CPI, which strips out food and energy costs, rose only 0.1 percent last month, that was largely because of the 5.6 percent decline in airline fares. \nEconomists expect the drop in air ticket prices, which was the largest since December 1995, will be temporary. Housing costs shot up 0.4 percent, the biggest increase since February 2007. That was on top of a 0.3 percent gain in June. \nWith the rental vacancy rate near a 22-year low, housing costs are likely to continue pushing higher, which should support underlying inflation. \n\"One key issue that is likely to emerge in the debate on inflation is the run-up in shelter costs. Rents are surging and in the face of stagnant wages that leaves less for consumers to spend elsewhere in the economy,\" said Diane Swonk, chief economist at Mesirow Financial in Chicago. \nIn the 12 months through July, the core CPI increased 1.8 percent. It was the fourth time in five months that the 12-month change was 1.8 percent. \nApparel prices increased after three straight months of declines. Prices for used cars and trucks and household furnishings and new motor vehicles fell last month. \n(Reporting by Lucia Mutikani; Additional reporting by Sam Forgione in New York; Editing by Andrea Ricci)", "external_links": [], "published": "2015-08-20T00:27:00.000+03:00", "crawled": "2015-08-20T01:26:12.215+03:00", "highlightTitle": ""}