{"organizations": ["Hidden Costs of College"], "uuid": "0f7b752c3f8f4fd631e2eb017a1882bd996311db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiplinger.com", "main_image": "http://www.kiplinger.com/slideshow/college/T007-S001-5-hidden-costs-of-college/images/intro.jpg", "site_section": "http://kiplinger.com/about/rss/kiplinger.rss", "section_title": "Kiplinger's Personal Finance", "url": "http://www.kiplinger.com/slideshow/college/T007-S001-5-hidden-costs-of-college/index.html?rss_source=rss", "country": "US", "title": "7 Hidden Costs of College", "performance_score": 0, "site": "kiplinger.com", "participants_count": 0, "title_full": "7 Hidden Costs of College", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T07:00:00.000+03:00", "replies_count": 0, "uuid": "0f7b752c3f8f4fd631e2eb017a1882bd996311db"}, "author": "", "url": "http://www.kiplinger.com/slideshow/college/T007-S001-5-hidden-costs-of-college/index.html?rss_source=rss", "ord_in_thread": 0, "title": "7 Hidden Costs of College", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "See All Slide Shows Page 2 of 9 7 Hidden Costs of College Joining a Greek Organization Thinkstock \nMany club memberships require fees or additional expenses, and Greek life tends to be the most expensive, says Melanie Payne, director of new-student orientation at Indiana University. \nFor example, at Dartmouth College, in Hanover, N.H., where 51% of all students are in the Greek system, new-member dues (money you pay the first semester you join the chapter) for sororities range from $335 to $647, depending on the chapter. At the University of Michigan, a larger public college, dues for the first semester of sorority membership range from $220 (an unhoused chapter) to $1,753 (a housed, on-campus sorority). For fraternities at small private school Washington and Lee University in Lexington, Va., new members pay an average of $1,567. These new-member fees do not include housing. \nIn subsequent semesters, active members will generally pay even more. At Payne's IU in 2012, the average paid for per-semester dues by fraternity members who didn't live in a chapter house was $1,000. Members who lived in chapter houses paid, on average, $5,200 per semester. (Think of living in the chapter house as room and board, including meals. At some schools such as the University of Missouri, where renewing sorority members pay an average of $4,003 per semester to live in a chapter house, that's sometimes cheaper than living and eating in the dorms.) \nAsk the campus’s Greek-life coordinators to give you a specific rundown of fraternity and sorority fees to flesh out your budget. Chapters without houses may be significantly less expensive; dues are generally $200 to $300 per semester. And many Greek chapters have scholarship programs and payment plans for their members, so you may not have to pay the fees all at once.", "external_links": [], "published": "2015-08-07T07:00:00.000+03:00", "crawled": "2015-08-08T02:04:49.348+03:00", "highlightTitle": ""}