{"organizations": [], "uuid": "229fd8d7e62bae42fa5dd43ac0ddfe98d100b6c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/18/eurozone-greece-germany-idUSL5N10T3MI20150818", "country": "US", "title": "German parliament seen backing Greek bailout despite rebellion", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "German parliament seen backing Greek bailout despite rebellion | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T00:28:00.000+03:00", "replies_count": 0, "uuid": "229fd8d7e62bae42fa5dd43ac0ddfe98d100b6c7"}, "author": "Paul Carrel", "url": "http://www.reuters.com/article/2015/08/18/eurozone-greece-germany-idUSL5N10T3MI20150818", "ord_in_thread": 0, "title": "German parliament seen backing Greek bailout despite rebellion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN Aug 19 German lawmakers are expected to vote overwhelmingly in favour of Greece's third bailout on Wednesday, even though Chancellor Angela Merkel faces a dangerous rebellion in her own party ranks that suggests she cannot ask parliament to help Athens again.\nA significant minority of Merkel's conservatives may vote against the 86 billion-euro ($94.84 billion) bailout, sending the government a warning that the latest package is its last chance to keep debt-ridden Greece in the 19-country euro zone.\nIn a test ballot of conservative lawmakers late on Tuesday - a non-binding vote - a clear majority voted in favour of the bailout. Sixty of the 311 conservative lawmakers voted `no' or abstained - fewer than a rebellion by as many as 120 MPs that had been feared.\nThe vote on Wednesday in parliament will follow a debate scheduled to start at 09:00 a.m. (0700 GMT).\nMerkel, oddly enough, is not expected to address the lawmakers. She will leave her highly respected finance minister, Wolfgang Schaeuble, to speak for her government.\nLast month, he argued that Athens should consider a \"timeout\" from the euro zone, before later telling parliament that talks on the third bailout were a \"last attempt\" to solve the crisis.\nSchaeuble threw his weight behind the package before Wednesday's vote and said Athens was ready to reform. Senior figures in the ruling coalition agreed.\n\"One has to recognise that the Greek government has in recent weeks made a lot of concessions that it rejected for months,\" Gunther Krichbaum, conservative chairman of parliament's Europe committee, told Reuters.\nLast month, a record 65 lawmakers from the conservative camp broke ranks and refused to back negotiations on the bailout. The newspaper Bild estimated as many as 120 CDU and CSU members out of 311 might refuse to back the now-agreed deal.\nSupport from parties including the Social Democrats, Merkel's junior coalition partner, and the opposition Greens means approval of the bailout is not in doubt. But a rebellion by a large number of her allies would be a blow for Merkel, who remains highly popular after 10 years in office.\nOn Tuesday, the parliaments of Austria, Estonia and Spain voted to approve the bailout.\n($1 = 0.9068 euros) (Writing by Paul Carrel; Additional reporting by Andreas Rinke; Editing by Erik Kirschbaum, Larry King)", "external_links": [], "published": "2015-08-19T00:28:00.000+03:00", "crawled": "2015-08-18T23:43:55.452+03:00", "highlightTitle": ""}