{"organizations": [], "uuid": "bac8d6ed9420aea9a736a70f1d2925797150a2fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/r/b/f/i/image.related.afrArticleLead.620x365.gj05ms.png/1439718568876.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/brand/accc-sharpens-focus-will-hit-unions-harder-20150816-gj05ms", "country": "AU", "title": "ACCC sharpens focus, will hit unions harder", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "ACCC sharpens focus, will hit unions harder | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T16:18:00.000+03:00", "replies_count": 0, "uuid": "bac8d6ed9420aea9a736a70f1d2925797150a2fe"}, "author": "Marianna Papadakis", "url": "http://www.afr.com/brand/accc-sharpens-focus-will-hit-unions-harder-20150816-gj05ms", "ord_in_thread": 0, "title": "ACCC sharpens focus, will hit unions harder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ACCC chairman Rod Sims conceded the ACCC relied on too much on exemptions in competition law in its neglect of industrial relations cases in the past. Nic Walker by Marianna Papadakis The Australian Competition & Consumer Commission is sharpening its focus on cartels and collusive conduct involving unions and industrial cases, spurred by the royal commission into trade union corruption.\nACCC chairman Rod Sims conceded in a speech to the Law Council of Australia on Friday night, the ACCC relied on too much on exemptions in competition law in its neglect of industrial relations cases in the past.\nBut he said the ACCC will broaden its interpretation of competition laws to cover restrictive behaviour, such as contracts, agreements or understandings that substantially lessened competition.\n\"This type of alleged conduct can disrupt competitive markets, increase costs and impede productivity,\" Mr Sims said.\nEven though exemptions in competition laws meant the ACCC could not take action where agreements related to employment conditions, he said companies and unions had no role in regulating markets by fixing prices, deciding who could and could not operate in a market, or determining how bids were allocated.\nCompanies colluding with unions could find themselves subject to prosecution, he said.\nAs evidence of the ACCC's new approach, Mr Sims cited an investigation of alleged cartel behaviour in the Canberra construction sector which appeared \"to involve a wide range of restrictive behaviours beyond the specific allegations of price-fixing\".\nTrade union corruption The investigations were in response to revelations before the Royal Commission into trade union corruption of price fixing, anti-competitive agreements and attempts to bring about collusive arrangements in the scaffolding and concreting industries.\nMeanwhile Mr Sims told the Law Council the regulator may have more union-related major investigations than ever before.\nBut the ACCC could only act within its jurisdiction and it was frustrated by the scope and complexity of secondary boycott provisions that were open to differing interpretations and should be clarified.\nThe ACCC launched proceedings against the Construction, Forestry, Mining and Energy Union and others over breaches of the secondary boycott provisions last November, as well as attempting to pressure companies and coercing or harassing them to use particular supply or payment arrangements for goods or services.\nA CFMEU spokeswoman said the union did not condone nor engage in cartel activity.\nIn-depth investigations Mr Sims said the regulator had another two in-depth secondary boycott investigations underway, one at an advanced stage.\n\"The ACCC is also concerned that there are not appropriate mechanisms which will protect whistleblowers or other parties who provide information to assist with ACCC investigations.\"\nAmong examples he cited of where the ACCC could not act, were agreements between unions and companies that provide for the union to hinder the company's competitors.\nReferring to one such agreement revealed by the inquiry in which Toll Holdings agreed to make payments to a Transport Workers Union affiliated body in exchange for audits, wage inspections and safety checks on the company's smaller rivals, Mr Sims said he understood \"outrage\" over the matter but the conduct did not breach competition laws because it did not involve a \"substantial lessening of competition\".\nThe ACCC had between 10 to 15 court competition cases in court at any time, usually cartels, and was resourced to conduct 40 to 50 investigations a year, he said.", "external_links": [], "published": "2015-08-16T16:18:00.000+03:00", "crawled": "2015-08-17T00:59:28.665+03:00", "highlightTitle": ""}