{"organizations": [], "uuid": "a2c098433fcb7162c7b41d46fd148239fdd2be68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://images.forbes.com/media/assets/forbes_1200x1200.jpg", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/anthonynitti/2015/08/03/in-2016-election-candidates-tax-returns-simply-dont-matter/", "country": "US", "title": "In 2016 Election, Candidate's Tax Returns Simply Don't Matter", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "In 2016 Election, Candidate's Tax Returns Simply Don't Matter - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T16:51:00.000+03:00", "replies_count": 2, "uuid": "94da0f7654547c7f939d6c14fa47b443bc760989"}, "author": "Tony Nitti", "url": "http://www.forbes.com/sites/anthonynitti/2015/08/03/in-2016-election-candidates-tax-returns-simply-dont-matter/#post-0", "ord_in_thread": 0, "title": "In 2016 Election, Candidate's Tax Returns Simply Don't Matter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Did you hear the news? Hillary Clinton, who is married to a former President of the United States, and who herself was once Secretary of State, makes…you may want to sit down for this.. a lot of money . Crazy, right?\nClinton, the overwhelming favorite to win the Democratic nomination for the 2016 Presidential election, released her tax returns on Friday. What followed was the bombshell revelation that someone with one of the more famous surnames in American history earns a sh*t-ton of cash.\nAs has become the habit when any candidate publishes their tax information, Clinton’s returns have been dissected and summarized for a ravenous public. I know this, because I’m always part of the feeding frenzy — over the past five years, I’ve torn through the tax disclosures of Mitt Romney, Rick Santorum, President Obama, Vice President Biden, and, most recently, Jeb Bush, seeking out newsbyte-worthy items that might serve as a deeper indication of the individuals transparency, motives, or character.\nAnd I’ll admit, when Clinton published her much-anticipated returns, I began to run through those familiar paces, analyzing adjusted gross income ($27 million!), effective tax rate (35.7%!), and interesting headline-makers (they donate money to their own foundation!).\nBut before I could condense the statistics into enlightening text, it dawned on me that, well, none of this really matters.\nDon’t get me wrong, I appreciate the need for a candidate to disclose financial information and the public’s fascination with those numbers. Originally, however, these exercises were intended to clear up controversy surrounding and instill confidence in a candidate. But man, have we have we lost our way. Now the numbers on a candidate’s Form 1040 are used as a comparative measure of a candidate’s worthiness, and that’s a problem for a variety of reasons.\nIn 2010, Republican candidate Mitt Romney made the grave misstep of dancing around the release of his tax returns at a time when national distrust towards the wealthy was at an all-time high. He eventually relented in a limited manner, but only after his initial reluctance raised public anticipation to a level unmatched by all previous disclosures.\nAnd in the end, Romney was right to be cautious, because the reaction to his tax returns was surprisingly, well….surprise. It seems the voting public expected that a tremendously successful private equity fund manager should file a return with far fewer zeros. Romney’s 13.9% effective tax rate on over $20 million of adjusted group income left him universally panned as the embodiment of the wealthy elite: abusing the complex income tax laws to pay a lower rate than the standard secretary.\nThere’s one big problem with this way of thinking — Romney’s low rate was in no way his doing. He was merely fortunate to earn his money in a vocation that Congress, through nuances in the tax laws, saw fit to entitle to a preferential rates. The so-called “carried interest” loophole that Romney was accused of availing himself is no loophole, it is a well-known tax break that Congress bestowed upon very wealthy, very powerful taxpayers and, despite its controversial nature, refuses to remove for fear of angering those same influential voters.\nRomney didn’t create the rules governing carried interest, however, he merely benefitted from them. He was in a no-win situation — by paying only 13.9%, of his income in taxes he was painted as a cheat, when the reality was if he had paid any more than that, he would have been something far more damning in the world of politics: a fool.\nIf public consumption of financial information was misguided during the previous election, in the impending race it’s just plain pointless.\nWhen your leading candidates go by the names Clinton and Bush, how can financial disclosures matter? How can you be expected to differentiate between two people who share Thanksgiving dinner with a combined three former Presidents?\nThe entire process has been an exercise in testing voter naiveté. When Jeb Bush released his returns, he took the time to add the following:\nI have paid a higher tax rate than the Clintons even though I earned less income.\nYes, only in today’s America could the self-appointed “everyman” in an election be the son and brother of a former President. Hey, Jeb earned only $7 million last year! Hillary earned $28 million! That makes him four times more like me than she is!\nIt’s hard to blame Bush for the comment, however, because his approach is actually, and inexplicably, working. He is viewed as the everyman in an election that includes astronomical earners Clinton and Trump; that is, if you’re willing to believe that all of Bush’s wealth is neatly accounted for on the pages of that Form 1040 and not in various land holdings. And if you are, I’m selling a popcorn farm that you might be interested in.\nThe deeper issue, however, is that as I mentioned above, it just doesn’t matter. Your effective tax rate is merely a byproduct of the tax laws and the nature of your income; a high rate is no more a testament to your integrity as a low rate is an indictment of your character.\nIn the upcoming election, finances don’t matter because there is no choice to be made. You will be casting your vote for a Clinton, a Bush, or a Trump. And when you do so, you’re not voting for a person, you’re voting for a well-established brand , replete with all the same entrenched alliances, undisclosed liabilities, and yet-to-be-settled quid pro quos as any corporate enterprise. Bush has been paid millions from big banks, and inherits relationships cultivated by George H. and George W. Hillary Clinton has been paid handsomely by private equity firms, and inherits relationships cultivated by Bill. Trump has made billions in real estate, and if that doesn’t concern you about the nature of his business alliances, it certainly should.\nThe most important election in American history is always the next one. When you’re sealed inside the voting cubicle , there are an infinite number of reasons you should or shouldn’t support a candidate, but please don’t be fooled into believing that his or her tax returns is one of them.\nfollow along on twitter @Nittigrittytax\nGet The Forbes Investing Digest", "external_links": ["http://www.youtube.com/watch?v=Tv5CT7r3Txo"], "published": "2015-08-03T16:51:00.000+03:00", "crawled": "2015-08-05T20:31:03.492+03:00", "highlightTitle": ""}