{"organizations": [], "uuid": "bcf0f0df289ca79826f8813c7189bb38e560016e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/g.gxnB3.5C8R6RgD27xd4w--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/FIN_ANZ_AAP_ART_FTP_LIVE_1/2983327_040815m_RetailSpending_1280x720_original.jpg", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/housing-boom-boosts-retail-spending-063116706.html", "country": "GB", "title": "Housing boom boosts retail spending", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Housing boom boosts retail spending", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T09:31:00.000+03:00", "replies_count": 0, "uuid": "bcf0f0df289ca79826f8813c7189bb38e560016e"}, "author": "", "url": "https://au.finance.yahoo.com/news/housing-boom-boosts-retail-spending-063116706.html", "ord_in_thread": 0, "title": "Housing boom boosts retail spending", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nBig spending on building materials and electronics has given the retail sector a boost, as the housing sector finally delivers economic benefits. \nA jump in sales of household goods, as well as takeaway food and greater spending in restaurants and cafes, drove a better-than-expected rise of 0.7 per cent in retail trade in June. \nA 2.2 per cent lift in household goods was helped by renovations and people fitting out newly built homes. \n\"That's probably the residential construction upturn starting to kick in there,\" NAB senior economist David de Garis said. \nCommSec economist Savanth Sebastian said home improvement spending in the June quarter was its strongest in eight years, and tax breaks for small businesses in the federal budget were also helping to fuel spending. \n\"What the result highlights is a shift towards the back end of the June quarter, influenced by a rate cut and budget stimulus,\" he said. \n\"And it bodes well for coming months especially when coupled with the latest lift in (consumer) confidence.\" \nStrength in the household goods category was consistent with anecdotes of strong sales in hardware stores following the budget, JP Morgan economist Ben Jarman said. \nAustralian Retailers Association executive director Russell Zimmerman said the rise in spending was heartening for a sector that has suffered from lacklustre trade in recent years. \n\"Sales of household goods particularly are going from strength to strength, with growth of 10.6 per cent year on year,\" he said. \nJune's spending growth was an improvement on May's 0.4 per cent rise, and the largest monthly rise since February. \nRetail spending in the June quarter rose 0.8 per cent. \nNAB's Mr de Garis said the surprisingly good figures will help lift June quarter economic growth. \n\"It's suggestive of reasonably good growth in household consumption in the second quarter,\" he said. \n\"Overall we're still seeing some nominal growth in retailing and household consumption.\" \nJP Morgan economist Tom Kennedy said the figures were a good sign for consumer behaviour and risk appetite, but will need to be repeated. \n\"You'd have to see a sustained uplift in household consumption if the RBA's really going to change their overall cautious outlook on the household sector,\" he said. \nHOW AUSSIES SHOPPED IN JUNE \n* Hardware, building and garden supplies up 2.8pct \n* Electronics up 2.4pct \n* Cafes and restaurants up 1.1pct \n* Department stores down 0.1pct \n* Supermarket and grocery stores down 0.4pct \n* Newspapers and books down 1.5pct \n* Clothing down 1.9pct \nSource: ABS seasonally adjusted numbers @y7finance on Twitter, become a fan on Facebook Housing boom boosts retail spending AAP \nBig spending on building materials and electronics has given the retail sector a boost, as the housing sector finally …", "external_links": [], "published": "2015-08-04T09:31:00.000+03:00", "crawled": "2015-08-04T09:59:09.582+03:00", "highlightTitle": ""}