{"organizations": [], "uuid": "950bb766c80252bd772f29b111582cc003796d14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/z/d/6/q/image.related.afrArticleLead.620x365.gij7cx.png/1440665511606.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/afr-magazine/audis-new-r8-blends-luxury-and-sport-20150723-gij7cx", "country": "AU", "title": "Audi's new R8 blends luxury and sport", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Audi's new R8 blends luxury and sport | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T22:15:00.000+03:00", "replies_count": 0, "uuid": "950bb766c80252bd772f29b111582cc003796d14"}, "author": "Lucille Keen", "url": "http://www.afr.com/brand/afr-magazine/audis-new-r8-blends-luxury-and-sport-20150723-gij7cx", "ord_in_thread": 0, "title": "Audi's new R8 blends luxury and sport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Audi's second-generation R8, the fastest road car the German auto manufacturer has built. by Lucille Keen\nA luxury sports car can't be all style and no substance, insists the head of interior design at Audi , Karl-Heinz Rothfuss. It has to look, feel and drive, well, like a sports car. Hence Audi's second-generation R8 , the fastest road car the German auto manufacturer has built. Complete with a V10 engine, Rothfuss claims the coupe has been heavily influenced by the automaker's Le Mans 24 Hour race car.\n\"You can operate everything from the steering wheel,\" Rothfuss says. That ranges from turning the car on and off to controlling the exhaust and setting it for dry, wet or snow conditions. \"We've moved everything into the centre of the steering wheel, including the GPS which is on the screen in front of the driver. So we don't have driver disorientation any more; we have driver focus.\"\nThe enthusiast at the wheel can ascertain speed and tyre temperature with a glance at the screen's three-dimensional graphics, switch on laser beam headlights when dusk falls, and rock out to his or her favourite tracks thanks to Bang & Olufsen surround sound without so much as a glance sideways. Two iterations of the sleek new vehicle were unveiled in Portugal in August and are expected to arrive in Australia mid-next year.\n\"It's definitely a fine balance to create a luxury car without compromising the sports car feel,\" Rothfuss concedes. \"This is quite different to other luxurious cars; it's a real sports car with race car genetics.\"\nOf course the real test of a sports car is how fast it goes. Put your pedal to the metal and this baby will accelerate to 100km/h in 3.2 seconds and to 200km/h in 9.9 seconds, building to a top speed of 330km/h. Vroom.\n ", "external_links": ["http://www.audi.com.au/au/brand/en.html", "http://www.audi.com.au/au/brand/en/models/r8/r8.html"], "published": "2015-08-26T22:15:00.000+03:00", "crawled": "2015-08-27T20:13:15.329+03:00", "highlightTitle": ""}