{"organizations": ["Regeneron"], "uuid": "b80bd213ce40dc041971ff5c54db6c4a0a425545", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.investors.com", "main_image": "http://www.investors.com/image/Biz07-HCA-0806-iStock.jpg.cms", "site_section": "http://finance.yahoo.com/rss/headline?s=LPNT", "section_title": "Yahoo! Finance: LPNT News", "url": "http://news.investors.com/business/080515-765191-hca-holdings-warns-on-uninsured-earnings-top.htm?ven=yahoocp,yahoo&src=aurlled", "country": "GB", "title": "Hospitals Fall As HCA Sees Uninsured Patients Spike Despite ObamaCare", "performance_score": 0, "site": "investors.com", "participants_count": 0, "title_full": "Hospitals Fall As HCA Sees Uninsured Patients Spike Despite ObamaCare", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T21:58:00.000+03:00", "replies_count": 0, "uuid": "b80bd213ce40dc041971ff5c54db6c4a0a425545"}, "author": "", "url": "http://news.investors.com/business/080515-765191-hca-holdings-warns-on-uninsured-earnings-top.htm?ven=yahoocp,yahoo&src=aurlled", "ord_in_thread": 0, "title": "Hospitals Fall As HCA Sees Uninsured Patients Spike Despite ObamaCare", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stocks Set For Lower Start; Regeneron Jumps On Earnings \nStock futures were on pace for a weak start Tuesday, despite a rebound in oil prices. Nasdaq 100 futures dropped 10 points vs. fair value, and S&P 500 futures lost 4 points. Futures on the Dow Jones industrial average slumped 28 points. The major averages stumbled Monday, as Brent crude tumbled ... 08/04/2015 09:01 AM ET Community Health Stock Climbs On Q2 And Spinoff Plans \nCommunity Health Systems (NYSE:CYH) stock climbed more than 7% after hours in the stock market today as the acute care hospital operator reported second quarter profit that sailed past views and announced plans to create a new, publicly traded hospital company by spinning off a group of its ... 08/03/2015 07:27 PM ET Big Cap Leaders Sail Past Earnings Season \nWhile earnings reports have hammered some leading stocks, that hasn't been the case for most Big Cap 20 members. With most of the quarterly reports out of the way, the big capitalization leaders have sailed past earnings announcements. Most beat Wall Street's expectations. Also, most have climbed ... 08/03/2015 06:48 PM ET Stocks Start Little Changed; CDW Jumps On Earnings \nStocks opened narrowly mixed on this first trading day of August amid some mixed economic reports. The Nasdaq rose 0.1%, while the S&P 500 slipped 0.1%. Meanwhile, the Dow Jones industrial average fell 0.3%, hurt once again by Chevron (NYSE:CVX) and Exxon Mobil (NYSE:XOM). Volume was running ... 08/03/2015 10:28 AM ET Stock Indexes End Flat To Down, Though Small Caps, IBD 50 Rise \nStock indexes traded in a narrow range Friday, posting small losses in mixed volume. The S&P 500 fell 0.2%, while the Nasdaq was flat. The IBD 50 and the small-cap S&P 600 took a more positive path, adding 0.6% and 0.5%, respectively. Volume rose on the NYSE but fell on the Nasdaq. For the ... 07/31/2015 06:42 PM ET Gray TV Q2 Beats, Shares Plunge As Expenses Escalate \nGray Television (NYSE:GTN) reported better-than-expected second-quarter profit and sales early Wednesday but said that it expects operating expenses to climb this quarter, causing its stock to plunge 7.3% to close below its 50-day moving average. Earnings per share for the TV station operator ... 04:57 PM ET Amplify Snack Falls In Debut After IPO Prices High \nAmplify Snack Brands (NYSE:BETR) shares sank Wednesday after pricing above expectations in the company's initial public offering late Tuesday. The maker of SkinnyPop popcorn and Paqui tortilla chips offered 15 million shares of common stock at 18, above the 14-16 expected. It joins other recent or ... 04:30 PM ET Will Netflix Become Disney's Friend Or Frenemy? \nInvestors are concerned about Walt Disney (NYSE:DIS) getting strung up by cord cutters as ESPN's subscriber base came under scrutiny Wednesday, but one analyst says Disney content partner Netflix (NASDAQ:NFLX) could be more frenemy than friend down the line. ESPN, which Disney CEO Bob Iger said has ... 04:30 PM ET Slowing iPhone Growth Hits Apple; Disney Downgraded \nApple (NASDAQ:AAPL) and Walt Disney (NYSE:DIS) were downgraded Wednesday, and First Solar (NASDAQ:FSLR) had its price target cut after it reported earnings. Bank of America downgraded Apple to neutral from buy and trimmed its price target to 130 from 142. Analyst Wamsi Mohan sees near-term pressure ... 04:30 PM ET Lumber Liquidators Sees Red; Kate Spade Comps Jump \nMajor retail and media stocks announcing results Wednesday that mostly missed quarterly estimates as a strong dollar and cord-cutting consumers weighed on companies. Lumber Liquidators (NYSE:LL) swung to a 75-cent, per-share loss in Q2 from a year-ago profit of 60 cents a share. Analysts polled by ... 03:41 PM ET", "external_links": [], "published": "2015-08-05T21:58:00.000+03:00", "crawled": "2015-08-06T01:53:47.066+03:00", "highlightTitle": ""}