{"organizations": [], "uuid": "279bdeefc246a2335f2d154ee636cce98ff18d24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/48432446.cms", "site_section": "http://timesofindia.indiatimes.com/news/economy/finance/articlelist/1286551815.cms", "section_title": "News on Government Finance, Public Financing, Indian Finance | Economy News - Economic Times", "url": "http://timesofindia.indiatimes.com/tech/tech-news/PM-Narendra-Modi-Tim-Cook-Satya-Nadella-congratulate-Sundar-Pichai/articleshow/48433836.cms", "country": "IL", "title": "PM Narendra Modi, Tim Cook, Satya Nadella congratulate Pichai", "performance_score": 0, "site": "indiatimes.com", "participants_count": 6, "title_full": "PM Narendra Modi, Tim Cook, Satya Nadella congratulate Pichai - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T19:48:00.000+03:00", "replies_count": 5, "uuid": "34958f9100ad8b054892aa35fbaf5cd994f317cc"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/tech/tech-news/PM-Narendra-Modi-Tim-Cook-Satya-Nadella-congratulate-Sundar-Pichai/articleshow/48433836.cms#post-0", "ord_in_thread": 0, "title": "PM Narendra Modi, Tim Cook, Satya Nadella congratulate Pichai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK: Prime Minister Narendra Modi congratulated Chennai-born Sundar Pichai on being appointed Google's chief executive officer.\n\"Congratulations Sundar Pichai. My best wishes for the new role at Google.\" Modi tweeted.\nCongratulations @sundarpichai . My best wishes for the new role at @google .\n— Narendra Modi (@narendramodi) August 11, 2015\nThe 43-year-old Pichai, an IIT, Kharagpur, graduate, is the second person of Indian-origin to head the IT company after Hyderabad-born Satya Nadella, who became the CEO of software giant Microsoft in February 2014.\nMicrosoft CEO Satya Nadella, Google's executive chairman Eric Schmidt and other technology executives today congratulated India-born Sundar Pichai on his \"well deserved\" elevation as the new CEO of the search giant.\nPichai, 43, was named CEO of a newly organized Google, becoming only the third chief executive of the company after Schmidt and co-founder Larry Page.\nREAD ALSO:\nLow-key style, technical chops helped Sundar Pichai become new Google CEO\nReally excited about the vision and brilliance of Sundar.. he's going to be a great CEO! http://t.co/2bqtPEjoQH\n— Eric Schmidt (@ericschmidt) August 10, 2015\nSchmidt commented on Twitter as well as on Page's blog post announcing the surprise re-organization of the company and the formation of Google's new parent company Alphabet.\nSchmidt said the new name for the parent company 'Alphabet' is \"awesome\".\nCongrats @sundarpichai well deserved!\n— Satya Nadella (@satyanadella) August 10, 2015\nBret Taylor, co-creator of Google Maps, ex-CTO of Facebook and co-founder of technology Quip also congratulated Pichai, the first non-white CEO, on Twitter.\nCongrats to @sundarpichai on his well deserved promotion to CEO of @Google . One of the most capable technology leaders I have worked with.\n— Bret Taylor (@btaylor) August 10, 2015\nApple CEO Tim Cook also congratulated the new CEO.\n@sundarpichai Congratulations on your promotion!\n— Tim Cook (@tim_cook) August 11, 2015\nLinkedIn CEO also congratulated Sundar Pichai.\n@jeffweiner Thanks!\n— sundarpichai (@sundarpichai) August 11, 2015\nIn a filing with federal regulator Securities and Exchange Commission, Google informed about its organizational restructuring.\n\"Concurrently upon completion of the Alphabet Merger, Sundar Pichai, age 43, will become the new CEO of Google Inc. Sundar is currently the Senior Vice President of Products at Google and oversees product management, engineering, and research efforts for Google's products and platforms.\nREAD ALSO:\nSundar Pichai: The little-known new chief of Google\n\"Since joining Google in 2004, Sundar has led a number of key consumer products which are now used by hundreds of millions of people and, prior to his current role, served as Google's SVP of Android, Chrome and Apps,\" the company said in the filing in which it also noted that Pichai received a B.Tech from the IIT-Kharagpur, a MS from Stanford University, and an MBA from the University of Pennsylvania.\nGoogle CEO Sundar Pichai: 7 things to know of 8 Google just announced some huge changes to its executive structure.\nLarry Page will run a completely new company called Alphabet, a collection of Google companies including Life Sciences, which manufactures glucose-sensing contact lenses, and Calico.\nFormer Chrome and Android head Sundar Pichai will be Google's CEO.Many are still unfamiliar with Google's new CEO.\nHere are some little-known facts about the man at the helm. Originally from Tamil Nadu, one of India's 29 states, Pichai studied at the Indian Institute of Technology Kharagpur, where he received a Bachelor of Technology. He then received a MS from Stanford and obtained an MBA from Wharton School at the University of Pennsylvania. At Wharton, Pichai was honored as a Siebel Scholar and a Palmer Scholar. Before his first job at Google, Pichai worked at Applied Materials as an engineer and then at McKinsey & Company in management consulting. In 2004, Pichai joined Google as its vice president of product management, where he led the team working on Google's Chrome browser and operating system.\nPichai quickly began to receive more responsibility, however, taking on involvement with various Google search products including Firefox, Google Toolbar, Desktop Search, Gadgets, and Google Gears and Gadgets. http://timesofindia.indiatimes.com/followceleb.cms?alias= ", "external_links": ["http://t.co/2bqtPEjoQH", "https://twitter.com/ericschmidt/status/630856887173521408", "https://twitter.com/jeffweiner", "https://twitter.com/tim_cook/status/630914569385283584", "https://twitter.com/google", "http://ad.doubleclick.net/N7176/adi/TOI/TOI_ENT_ROS_ATF_Artical_Photo_300;sz=300x250;ord=", "https://play.google.com/store/apps/details?id=com.toi.reader.activities", "https://twitter.com/sundarpichai/status/630948328398675968", "https://twitter.com/satyanadella/status/630867202439143424", "https://twitter.com/narendramodi/status/630993253685334016", "https://twitter.com/btaylor/status/630846032738304000", "https://twitter.com/sundarpichai"], "published": "2015-08-11T19:48:00.000+03:00", "crawled": "2015-08-12T00:09:04.183+03:00", "highlightTitle": ""}