{"organizations": [], "uuid": "bd97da90bc90f5c270f821816135234f138a5822", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/t/0/z/1/image.related.articleLeadwide.620x349.git14e.png/1438837514035.jpg", "site_section": "http://www.canberratimes.com.au/business/carbon-economy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/are-brits-falling-out-of-love-with-their-cuppa-20150806-git14e.html", "country": "AU", "title": "Are Brits falling out of love with their cuppa?", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Are Brits falling out of love with their cuppa?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T13:05:00.000+03:00", "replies_count": 0, "uuid": "bd97da90bc90f5c270f821816135234f138a5822"}, "author": "Lauren Davidson", "url": "http://www.canberratimes.com.au/business/are-brits-falling-out-of-love-with-their-cuppa-20150806-git14e.html", "ord_in_thread": 0, "title": "Are Brits falling out of love with their cuppa?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As people turn away from sugary biscuits, they also cut back on the tea that goes with them. Photo: iStock\nBritons could soon have to find another pastime to fill the mid-afternoon slot as demand for the classic cup of tea cools.\nTea consumption in the UK has dropped by more than a fifth in the past five years, with the volume of tea sold dropping from 97 million kilograms in 2010 to 76 million kilograms this year. Consumers are opting for more exciting hot beverages, according to market research firm Mintel.\nSales of ordinary teabags dropped 17.5 per cent in two years, falling from 80 million kilograms in 2012 to 66 million kilograms in 2014.\nEmma Clifford, senior food and drink analyst at Mintel, said that standard black tea is being \"held back by a rather uninspiring image\" and is \"struggling to maintain consumers' interest amid growing competition from other drinks\".\nA key driver in tea's tumble is the growth of its main rival in the hot beverage market , coffee, which has surged in popularity and even turned non-traditional coffee purveyors such as pubs and fast food chains into would-be coffee shops.\nWhile coffee consumption per capita has not increased in the UK, Brits are spending more time in coffee shops and are more likely to grab their morning pick-me-up on the go.\n\"Reflecting a growing 'foodie' culture in the UK, people are branching away from standard teabags and towards these more interesting alternatives,\" Ms Clifford said.\nDespite the 22 per cent drop in tea sales by volume over the past five years, the value of the tea market declined less steeply, falling just 6 per cent over the past five years to £654 million ($1.39 billion), buoyed by increasing popularity and higher prices of novelty varieties.\nWhile £425 million worth of ordinary teabags were sold in 2014, a drop of 13 per cent from 2012, sales of green tea jumped by half to £36 million, fruit and herbal tea sales grew 31 per cent to £76 million and the value of specialty teabags – such as earl grey, chai and assam – sold increased by 15 per cent to £63 million.\nHowever, the tea market hasn't cooled entirely . Tea consumption is expected to continue its decline at a slower rate, while the value of the market should start to increase from 2016.\nMintel said that the rate of consumers switching from tea to coffee is likely to abate and the tea market will begin to create premium products and venues that will encourage more spending.\nTea has also lost out as consumer turn away from unhealthy snacks, with volume sales of sweet biscuits, the classic complement to a good cuppa, dropping 8 per cent from 2009 to 2014.\n\"It is widely accepted that tea is a good accompaniment to biscuits and cakes. Given the sugar scare, however, and that usage of such treats is in decline, these strong associations could have had a negative impact on the tea market,\" Ms Clifford said.\nWith The Great British Bake Off returning to television screens this week, perhaps biscuit scoffing will enjoy a seasonal bump and boost tea drinking along with it. The BBC show has already been credited with the saving the egg : why not the biscuit and the cuppa, too?\nThe Telegraph London", "external_links": ["http://www.smh.com.au/cqstatic/12z7v7/tea2.1.PNG", "http://www.telegraph.co.uk/lifestyle/10523367/Britain-now-a-nation-of-coffee-drinkers-as-tea-sales-plunge.html", "http://www.telegraph.co.uk/foodanddrink/foodanddrinkvideo/11679101/How-to-make-the-perfect-cup-of-tea.html", "http://www.telegraph.co.uk/foodanddrink/foodanddrinkpicturegalleries/10125172/Tea-traditions-around-the-world-in-pics.html", "http://www.telegraph.co.uk/finance/newsbysector/retailandconsumer/11513000/An-egg-is-for-life-not-just-for-Easter.html", "http://www.smh.com.au/cqstatic/12z7v7/tea1.PNG", "http://player.ooyala.com/iframe.js#pbid=7dfd98005dba40baacc82277f292e522&ec=FtNHhvdTpbMTaVYXy5v18kRre9l8KlU3", "http://www.smh.com.au/cqstatic/12z7v7/tea2.PNG"], "published": "2015-08-06T13:05:00.000+03:00", "crawled": "2015-08-06T11:40:43.622+03:00", "highlightTitle": ""}