{"organizations": [], "uuid": "74e4920fcc23edb69e2bf89120bdf3cbf49c9b2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/LXBgVAw1vED4lo6_v9FK7g--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/908d88fdc590fe465b5d5080c088ff57f8ef84bc_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/european-stocks-close-down-china-163237498.html", "country": "US", "title": "European stocks close down on China worries, despite Greek deal", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "European stocks close down on China worries, despite Greek deal", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T19:32:00.000+03:00", "replies_count": 0, "uuid": "74e4920fcc23edb69e2bf89120bdf3cbf49c9b2f"}, "author": "", "url": "https://uk.finance.yahoo.com/news/european-stocks-close-down-china-163237498.html", "ord_in_thread": 0, "title": "European stocks close down on China worries, despite Greek deal", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Aug 11, 2015, 20:06 BST - UK Markets closed European stocks close down on China worries, despite Greek deal By Ben Perry | AFP – 2 hours 33 minutes ago View Photo \n\nEuropean stocks ended lower Tuesday after a surprise devaluation of the yuan battered key exporters to China such as auto and luxury goods groups, offsetting news of a technical agreement in Greece's bailout deal. \nA survey indicating investor sentiment in Germany fell sharply in August also darkened investor outlook. \nLondon's benchmark FTSE 100 index ended the day 1.06 percent lower at 6,664.54 points compared with Monday's close. \nFrankfurt's DAX 30 finished 2.68 percent down at 11,293.65 points while the CAC 40 in Paris closed 1.86 percent behind at 5,099.03. \nAthens' main index grew 2.14 percent to 705 points. \nIn foreign exchange, the euro rose to $1.1069 from $1.1019 late in New York on Monday. \n\"European equities on the back foot... in reaction to China's currency devaluation and despite proximity to a Greek bailout deal,\" said Mike van Dulken, head of research at Accendo Markets. \n\"While markets normally welcome any form of China stimulus with open arms, today's move in the wake of truly awful weekend trade data is being interpreted as admission of growth slowing by even more than those rather questionable official statistics are to have us believe.\" \nChina on Tuesday announced a sharply lower daily reference rate for the yuan against the US dollar, saying it was part of moves to make its exchange rate regime more market oriented. \nThe 1.86 percent cut was the largest since the yuan was unpegged from the greenback in 2005. \nWeak trade and inflation data released last weekend reinforced concerns that growth is slowing in the world's second largest economy. \n- China hits autos - \nThe devaluation weighed on several sectors, notably the auto and luxury goods markets that rely heavily on Chinese demand. \nIn Paris, shares in LVMH Moet Vuitton shed 5.42 percent to 164.85 euros, Peugeot (Other OTC: PUGOF - news ) slid 3.65 percent to 17.70 euros and Renault (Swiss: RNO.SW - news ) gave up 3.79 percent to 84.84 euros. \nIn Frankfurt, Daimler (Xetra: 710000 - news ) shed 5.15 percent to 79.93 euros and BMW (Swiss: BMW.SW - news ) retreated by 4.26 percent to 89.42 euros. \nBurberry meanwhile slumped 4.42 percent to 1,536 pence in London. Miners also continued to fall under the pressure of weaker Chinese growth, with Glencore (Xetra: A1JAGV - news ) down 7.26 percent at 191 pence and BHP Billiton (NYSE: BBL - news ) losing five percent to 1,148.50 pence. \nThe move by Beijing also pulled US stocks mostly lower, with investors wary of weaker Chinese exports further strengthening the dollar. \nIn trades around noon, the Dow Jones Industrial Average was down 1.31 percent at 17,385.23. \nThe tech-rich Nasdaq Composite Index fell 0.46 percent to 5,048.35, thought the broad-based S&P 500 reversed initial losses to advance 1.28 percent to 2,104.18. \nThe news by China overshadowed developments within the eurozone -- notably that Greece has reached a technical deal on a multi-billion bailout with its international creditors after marathon talks. \n\"An agreement was reached,\" a government source told AFP, with Finance Minister Euclid Tsakalotos briefly telling reporters that \"one or two details\" remained to be worked out during the day. \nEuropean officials later noted, however, that the accord was a \"technical level agreement... What we don't have is a political agreement.\" \nThe talks between ministers and the ECB, the International Monetary Fund and the European Stability Mechanism aim to finalise the list of new reforms required of the Greek government in exchange for a lifeline of what officials in Athens Tuesday said was \"around 85 billion\" euros ($93.8 billion). \nThe deadline for Greece to reach an agreement on its third bailout is August 20, when it must repay 3.4 billion euros to the European Central Bank. \nGerman investor sentiment meanwhile dropped this month owing to nagging geopolitical uncertainty clouding the outlook for Europe's top economy, a leading survey found on Tuesday. \nThe widely-watched investor confidence index calculated by the ZEW economic institute sank 4.7 points to 25.0 points this month, ZEW said in a statement.", "external_links": [], "published": "2015-08-11T19:32:00.000+03:00", "crawled": "2015-08-11T22:12:14.963+03:00", "highlightTitle": ""}