{"organizations": [], "uuid": "5d8ac8c012b7401d1232369b4fddc04e13f04c09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/0/i/d/v/image.related.articleLeadwide.620x349.gi0e1g.png/1439347564844.jpg", "site_section": "http://www.smh.com.au/small-business/finance", "section_title": "Business Finance | Small Business Finance, Venture Capital Finance", "url": "http://www.smh.com.au/small-business/finance/making-business-insurance-work-for-you-20150629-gi0e1g.html", "country": "AU", "title": "Making business insurance work for you", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Making business insurance work for you", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "5d8ac8c012b7401d1232369b4fddc04e13f04c09"}, "author": "Christine Long", "url": "http://www.smh.com.au/small-business/finance/making-business-insurance-work-for-you-20150629-gi0e1g.html", "ord_in_thread": 0, "title": "Making business insurance work for you", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rachel Power: Bushfire affected her business. Photo: Supplied\nRachel Power had only been the owner of Waterfalls Cafe and Gallery in Mount Field National Park for three months when disaster struck.\nIn 2012, the national park was affected by one of the worst bushfires Tasmania had ever seen.\nThe cafe wasn't damaged but the bushfire took its toll.\n\"We were closed for five days in what is our busiest time of the year, a three-week period where we make roughly a quarter of our annual turnover,\" Power says.\nAdvertisement Even when the park reopened, its campground and access to the mountaintop, a popular track for hikers, remained closed.\nFortunately, Power was covered for loss of profits.\n\"From the first day we were closed, my insurance broker was on the phone to me. He let me know exactly what was and wasn't covered and we discussed possible outcomes.\"\nFour weeks after submitting her paperwork, she received a payout which didn't take into account the impact of the campground remaining closed when the park reopened. Her broker pushed for a further payment and within five weeks she received a second payout.\nIf you need to claim on your business insurance, here are four ways to make the road to recovery run smoothly.\nTake out adequate cover\nUnderinsurance can be a big issue at claim time.\nMcKenzie Ross director Lindsey Parks gives the example of a business that has building and contents with replacement value of $3 million.\n\"If you have a major fire and there's $1 million worth of damage but you've only got your building and contents insured for $1.5 million and you make a $1 million claim, the insurance company has the right within the policy terms to only pay a percentage of that claim.\"\nLeigh Smith, senior leader, commercial portfolio, GIO, says the problem is most small businesses opt to renew their policies without updating their cover.\n\"If you've hired more staff, acquired new property, stock and contents, increased your revenue or taken on additional contracts, your policy may need to be updated.\"\nThat includes any new purchases made under the revised small business tax write-offs.\nCover for loss of profits or business interruption is often overlooked.\n\"If you have a reasonably major claim, the insurers will pay out on the assets such as building and contents but in the meantime you're not earning any money; your clients walk away from you and your business goes broke,\" Parks says.\nAct quickly\n\"It's not much fun trying to settle a claim where all of a sudden you get a bunch of invoices for a $10,000 claim from a client telling you about an incident that happened three months ago,\" Parks says.\nHe points to a multimillion-dollar claim made by a manufacturing business as an example of what should happen.\n\"The building burnt down totally – it was a total loss – and it was reported to me as it was burning.\"\nThe owner was overseas but Parks was at the site within an hour.\n\"We had a loss adjuster there that day.\"\nFour days later, he met the owner, the insurance company and the assessor to go over the claim. Although they were still negotiating over the loss of profits 15 months later, the business was back up and running within 12 months.\nGather supporting documents\n\"The more information you can provide to your insurer, the better,\" Smith says.\nThat includes copies of receipts, other financial records, photographs (both before and after an event if possible) and asset registers. Having the details of suppliers can help, too.\nSmith suggests keeping these records somewhere other than your business premises.\n\"This could be with your accountant, backed up on a portable hard drive at home, or even stored in the cloud.\"\nBe patient\nSome circumstances will slow down the claims process.\n\"Minor damage to a commercial vehicle can normally be fixed in a week,\" Smith says. \"While a major storm or fire damage to a building can take many months to repair. When items have been stolen, it depends on how easy they are to replace.\n\"If there is a higher demand for builders or materials following a major disaster, repairs can be slower. Another factor is the presence of any hazardous materials, such as asbestos.\n\"Rebuilding can, obviously, take time, but if you can provide accurate information about your business and your policy is providing up to date coverage, there should be no reason for the claim to become drawn out.\".\nIf you are unhappy with an insurer's decision, you can ask to have it reviewed by its internal dispute resolution team, he says.\nOr it can be referred to the independent Financial Ombudsman Service.", "external_links": [], "published": "2015-08-17T03:00:00.000+03:00", "crawled": "2015-08-18T01:51:36.904+03:00", "highlightTitle": ""}