{"organizations": [], "uuid": "04c5aedb38baa3cc59be019a059170d6370a0a7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/10/markets-forex-idUSL5N10L1YK20150810", "country": "US", "title": "FOREX-Dollar index near 4-month highs on U.S. rate hike view", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "FOREX-Dollar index near 4-month highs on U.S. rate hike view | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T15:39:00.000+03:00", "replies_count": 0, "uuid": "04c5aedb38baa3cc59be019a059170d6370a0a7d"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/10/markets-forex-idUSL5N10L1YK20150810", "ord_in_thread": 0, "title": "FOREX-Dollar index near 4-month highs on U.S. rate hike view", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar index trading near 4-month highs\n* Net long dollar positions highest since June - IMM data\n* Aussie stung by weak Chinese data, drop in commodities\nBy Anirban Nag\nLONDON, Aug 10 (Reuters) - The dollar stayed close to a nearly four-month high against a basket of currencies on Monday on Fed rate hike expectations while commodity-related currencies weakened after soft weekend data on China's economy.\nThe Australian and New Zealand dollars both lost about 1 percent. The dollar index was up 0.3 percent at 97.876, after rising as high as 98.334 on Friday, its strongest since April 23, after data showed U.S. nonfarm payrolls rose 215,000 last month.\nThat fell short of expectations for a rise of 223,000 jobs but was still viewed as consistent with a strong labour market, and the previous two months were upwardly revised.\nThe dollar hit a two-month high of 125.07 yen on Friday, and was last up 0.5 percent at 124.75, buoyed by elevated two-year U.S. Treasury yields. The euro was down 0.3 percent at $1.0930.\n\"The jobs data was supportive for a September rate hike,\" said Jeremy Stretch, head of currency strategy at CIBC World Markets.\n\"U.S. yields are modestly higher, but dollar/yen needs more widening of the interest rate spread to take it higher. Right now, there isn't much of a conviction so it will be a slow grind higher for the dollar.\"\nSpeculators increased bullish dollar bets to their highest since early June, according to Reuters calculations and data from the Commodity Futures Trading Commission released on Friday. The value of the dollar's net long position climbed to $32.77 billion in the week ended Aug. 4, from $29.79 billion the previous week.\nMeanwhile, the Australian dollar fell 0.8 percent to trade at $0.7359, hurt by a drop in commodities and oil and by the biggest drop in Chinese exports in four months in July, 8.3 percent compared with a forecast 1 percent fall.\n\"The Aussie is the most exposed G10 currency to trade with China. Iron ore imports fell 29 percent in the year to July, highlighting that once the second-round effects of lower commodity prices kick into weaker data in Australia, there is likely to be another leg lower in the currency,\" Morgan Stanley said in a note to clients. (Editing by Tom Heneghan/Ruth Pitchford)", "external_links": [], "published": "2015-08-10T15:39:00.000+03:00", "crawled": "2015-08-10T15:02:28.858+03:00", "highlightTitle": ""}