{"organizations": [], "uuid": "745a8271f966e4861948444e985ea75005860a27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-06/trillions-of-assets-remain-central-bank-tools-amid-rising-rates", "country": "US", "title": "Trillions of Assets Remain Central Bank Tools Amid Rising Rates", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Trillions of Assets Remain Central Bank Tools Amid Rising Rates - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T16:59:00.000+03:00", "replies_count": 0, "uuid": "745a8271f966e4861948444e985ea75005860a27"}, "author": "Simon Kennedy", "url": "http://www.bloomberg.com/news/articles/2015-08-06/trillions-of-assets-remain-central-bank-tools-amid-rising-rates", "ord_in_thread": 0, "title": "Trillions of Assets Remain Central Bank Tools Amid Rising Rates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Unconventional monetary policy is now a conventional part of central bankers’ toolkit even with interest rates set to rise in the U.S. and U.K.\nAsset purchases introduced during the financial crisis of 2008 and beefed up in the subsequent fight against recession now represent a permanent part of the armor officials will use as a weapon against financial distress.\nThe bonds they bought bloated the balance sheets of the Federal Reserve, Bank of England and European Central Bank to the equivalent of about a fifth of their gross domestic product. The Fed’s alone totals $4.49 trillion, up from $810 billion in 2005.\nWhile such excesses will eventually be pared now the turmoil has abated there is little chance the balance sheets will ever return to their pre-crisis levels for the reason that central bankers are finding advantages to running bloated stockpiles.\n“It is unlikely that policy makers will simply seek to revert to balance sheet structures that prevailed ahead of the crisis,” Alain Durre and Kasper Lund-Jensen, economists at Goldman Sachs Group Inc., said in a recent report.\nCentral-Bank Arsenals The chief argument for keeping balance sheets swollen is that it hands authorities the arsenal to provide liquidity to corners of financial markets that seize up in future. Unlike tweaking interest rates or having to ramp up the balance sheets as they did after 2008, now they have the means to act at speed and by identifying a particular target do so without distorting other assets or the economy that may not need aiding.\nSo if one part of the financial sector gridlocks the central bank can seek to revive it by conducting asset swaps in which it exchanges the liquid securities they hold on their balance sheets for the troubled asset, reviving the market.\nThere is precedent. Following their currency crises of the late 1990s, Asian central banks beefed up their foreign-exchange reserves to about a third of GDP today, even after a recent dwindling. That allows them to provide dollars to their economies and intervene to support their exchange rates if needed.\n“In times of crisis, financial market frictions intensify,” wrote Durre and Lund-Jensen. “In that environment, the design -- both size and composition -- of the central bank balance sheet matters.”", "external_links": [], "published": "2015-08-06T16:59:00.000+03:00", "crawled": "2015-08-06T14:56:58.120+03:00", "highlightTitle": ""}