{"organizations": [], "uuid": "63a5c04ec1a07a08e0a4d67d5c1617805281941c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/BSE-Sensex-EP-2-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/indian-markets/stocks-that-are-in-focus-today-august-3-2015-hcl-technologies-bharti-airtel-hero-motocorp/112813", "country": "IE", "title": "Stocks that are in focus today: Hero MotoCorp, HCL Tech, Maruti Suzuki and more", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Stocks that are in focus today: Hero MotoCorp, HCL Tech, Maruti Suzuki and more | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T18:04:00.000+03:00", "replies_count": 0, "uuid": "63a5c04ec1a07a08e0a4d67d5c1617805281941c"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/indian-markets/stocks-that-are-in-focus-today-august-3-2015-hcl-technologies-bharti-airtel-hero-motocorp/112813", "ord_in_thread": 0, "title": "Stocks that are in focus today: Hero MotoCorp, HCL Tech, Maruti Suzuki and more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Outperform on Glenmark; one of our top mid-cap picks: IDFC Securities After dismal Q2, turnaround will be uphill task for Nestle: Edelweiss As DIIs play catch up, inflows surge to 7-year high The Indian stock markets opened on a flat note on Monday following weak global cues.\nAt 9.43 am, Sensex was up 39.13 points at 28,153.69. Similarly, Nifty was up 5.15 per cent at 8,538.00 during the same time.\nTrading sentiment this week would be driven by RBI ’s policy meet and quarterly earnings from blue-chips like Bharti Airtel and Tata Motors, say experts.\nBesides, progress of monsoon, investment trend by overseas investors and rupee movement would influence trading at the bourses.\nHere are the stocks that are likely to be in focus today\nHero MotoCorp: The stocks of the company will be in focus today as the country’s largest two-wheeler maker will announce its quarterly results later in the day. Hero MotoCorp reported 7.97 per cent decline in sales at 4,87,580 units in July.\nHCL Technologies: The stocks of the country’s fourth-largest IT services company will remain in focus today as the company declared its fourth quarterly result today. It said that its net profit grew by 5.9 per cent sequentially to Rs 1,783 crore and revenue increased by 5.5 per cent to Rs 9,777 crore in the quarter gone by.\nLarsen and Toubro: The country’s biggest engineering and construction firm Larsen & Toubro (L&T) on Friday missed analysts’ estimate by posting a consolidated net profit at Rs 606.2 crore for the April-June quarter, a 37.3% decline over the same period last fiscal, with the company stating that the short-term business environment continues to remain challenging.\nBharti Airtel: To bolster its position in 4G market ahead of launch of services by rival Reliance Jio, Bharti Airtel plans to open 1,000 more company-owned stores by December for to provide customers first-hand experience about its service as well as offer low-priced handsets.\nMaruti Suzuki : Country’s largest carmaker Maruti Suzuki India on Saturday reported 20.1 per cent rise in total sales in July at 1,21,712 units.\nFirst Published on August 03, 2015 10:04 am © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-08-03T18:04:00.000+03:00", "crawled": "2015-08-04T05:48:30.365+03:00", "highlightTitle": ""}