{"organizations": [], "uuid": "79199e1d8cbdb19edbe2d2cab872708b088db9fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/rajiv-mehrishi-pti-t.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/indias-gdp-may-have-grown-more-than-7-5-in-q1-of-current-fiscal-rajiv-mehrishi/126574", "country": "IE", "title": "India’s GDP may have grown more than 7.5% in Q1 of current fiscal: Rajiv Mehrishi", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "India’s GDP may have grown more than 7.5% in Q1 of current fiscal: Rajiv Mehrishi | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T05:21:00.000+03:00", "replies_count": 0, "uuid": "79199e1d8cbdb19edbe2d2cab872708b088db9fe"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/indias-gdp-may-have-grown-more-than-7-5-in-q1-of-current-fiscal-rajiv-mehrishi/126574", "ord_in_thread": 0, "title": "India’s GDP may have grown more than 7.5% in Q1 of current fiscal: Rajiv Mehrishi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "India’s GDP may have grown by more than 7.5% in the first quarter of the current fiscal, Finance Secretary Rajiv Mehrishi said on Thursday. “The (Q1) figure seems to be in excess of 7.5%,” Mehrishi told The Financial Express.\nThe government will release the GDP data for Q1FY16 on August 31.\nIndian economy grew by 7.3% in FY15. A growth above 7.5% could boost market confidence at this juncture given the fears emanating from the troubles of the Chinese economy, analysts said. “We are penciling a Q1 GDP growth as a big positive surprise,” SBI Research said on Thursday.\nMehrishi said the recent downside to Indian stock market as well as the rupee was due to purely external factors. Even though the benchmark BSE Sensex has suffered a decline and rupee has breached 66/$, still the data on equity premia and the comfortable foreign reserves show that the macro fundamentals are still in a significantly better shape than they were previously, analysts say.\n“The current account deficit, fiscal deficit and inflation are under control, and indirect tax collection is increasing. These are signs of health of the economy,” Rajiv Mehrishi said.\nGlobal rating agency Moody’s on Tuesday trimmed India’s growth forecast for the current fiscal to around 7% from 7.5% predicted earlier, citing risks from a deficient monsoon season. However, while the IMF has predicted India’s growth to touch 7.5% in the current fiscal, the finance ministry has pegged it in the range of 8-8.5% and the central bank retained its projection at 7.6% in the annual report released on Thursday.\nOn August 24, Finance minister Arun Jaitley asserted that India’s GDP would grow at the projected rate of 8-8.5% in FY16 as the government has stepped up public investment, monsoon has been better than anticipated and fall in global commodity prices would help the country.\nThe finance secretary said the fall in crude prices could lead to some savings in fuel subsidies, which the government would use to spend more on capital spending, seen crucial to boost economic activity as private investment is weak. It was difficult as of now to quantify how much savings would be in fuel subsidy in the full year, he added. The Indian basket of crude oil price was $42.63 per barrel, much lower than anticipated in budget this year. The government has provided Rs 30,000 crore for FY16 fuel subsidy.\nIndia Ratings and Research has estimated an additional fiscal space of Rs 37,000 crore for the central government during FY16 on account of both lower oil subsidy and additional revenue generated due to increase in some tax rates.\nIndirect tax revenue grew a healthy 37.6% in April-July this year, helped partly by additional measures taken in this year’s budget. Even after stripping of all additional revenue measures, indirect tax collections increased by 14.6% for April-July 2015, chief economic advisor Arvind Subramanian had said.\nMehrishi said any shortfall in disinvestment revenue would be offset by higher tax revenue collections. “In the first quarter the indirect tax collections growth rate has been higher than projected. I hope the trend continues,” Mehrishi said. The government has so far managed to sell stakes in four PSUs to raise about Rs 12,600 crore as against the ambitious disinvestment target of Rs 69,500 crore.\n 27, 2015 9:21 pm", "external_links": [], "published": "2015-08-28T05:21:00.000+03:00", "crawled": "2015-08-28T05:08:11.331+03:00", "highlightTitle": ""}