{"organizations": ["SBA", "Wemco Inc.", "K-L Mfg. Co.", "N. Ruby"], "uuid": "9e6fbda680a50f66e0e2898a5a99775e957d41ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spokanejournal.com", "main_image": "", "site_section": "http://www.spokanejournal.com/rss/finance.rss", "section_title": "The Spokane Journal of Business > Finance", "url": "http://www.spokanejournal.com/local-news/sba-touts-504-financing-tool/", "country": "US", "title": "SBA touts 504 financing tool", "performance_score": 0, "site": "spokanejournal.com", "participants_count": 0, "title_full": "SBA touts 504 financing tool", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T16:00:00.000+03:00", "replies_count": 0, "uuid": "9e6fbda680a50f66e0e2898a5a99775e957d41ec"}, "author": "", "url": "http://www.spokanejournal.com/local-news/sba-touts-504-financing-tool/", "ord_in_thread": 0, "title": "SBA touts 504 financing tool", "locations": ["W. Thorpe Road", "West Plains"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike McLean"], "text": "SBA touts 504 financing tool Overlooked loan program promotes job growth, retention here August 13th, 2015 -—Mike McLean Sewing manufacturer K-L Mfg. Co. has room to grow at its plant, at 2438 N. Ruby, which the company bought and renovated through a $4.6 million, SBA 504-financed project. -—Mike McLean Using SBA 504 financing, Wemco Inc., has moved to new, larger facilities on the West Plains, where it manufactures heavy equipment, including the self-propelled potato harvester pictured here. Its 82,000-square-foot manufacturing complex is located at 5510 W. Thorpe Road. \nA U.S. Small Business Administration financing program is helping businesses expand and better position themselves for the economic turnaround, and Ted Schinzel, the SBA’s Spokane branch administrator, says more businesses here could benefit from SBA 504 loans. \nSBA 504 financing requires smaller capital injections and has lower interest and longer terms than conventional loans, Schinzel says. \n“Businesses looking at some kind of expansion should take a look at it,” he says of the 504 loan program, which is named for the federal Section 504 job retention program. “There’s a lot of benefit to businesses, especially on larger projects, but they’re not always aware of it. It’s kind of an overlooked program.” \nSBA 504 financing packages are arranged through SBA-approved, nonprofit, certified development companies that work with conventional private-sector lenders. \nSpokane-based Northwest Business Development Association and Seattle-based Evergreen Business Capital are the most active certified development companies in the SBA’s Spokane branch region, which includes 20 counties in Eastern Washington and 10 northern Idaho counties. \nFor a $5 million project that qualifies for SBA 504 financing, the borrower would put up $500,000, the SBA would guarantee $2 million through a debenture brokered by the certified development company, and a bank or other conventional lender would have a maximum exposure of $2.5 million, he says. \n“The bank takes first position on all collateral so it’s in pretty good spot,” Schinzel says. \nCertified development companies sell the SBA-back debenture portion of the financing on the secondary market. \nInterest for SBA 504 financing usually is under 5 percent and the terms can be as long as 25 years. \nUnder conventional financing for a $5 million project, the borrower likely would have to put up at least 25 percent, or $1.5 million, for a 15- to 20-year loan with an interest rate of at least 6 percent, Schinzel says. \nSpokane area companies that recently have expanded through SBA 504-financed projects arranged through the Northwest Business Development Association include American Ironworks & Erectors Inc., of Spokane Valley; K-L Mfg. Co., of Spokane; Center for Pediatric Therapy, of Spokane; and Wemco Inc., which moved to the west edge of Spokane from Airway Heights. \nSBA 504 loans can be used for the purchase of land and buildings, new construction, property and building improvements, and long-term equipment. \nTo qualify, the borrower must operate a for-profit company in the U.S. with a net worth of less than $15 million and an average annual net income of less than $5 million after taxes for the preceding two years. \nSchinzel says 32 loans totaling $18.6 million have been issued in the Spokane branch region in the first nine months of fiscal 2015, which ends Sept. 30, up from 21 loans totaling $17.8 million in the year-earlier period, but below the 2013 level. \n\nSewing up a niche \nK-L Mfg. Co., a contract manufacturer of active outerwear, financed a $4.6 million project through the SBA 504 program. The project included the purchase of the 133,000-square foot former Camp Chevrolet parts warehouse, at 2438 N. Ruby. It also included extensive improvements to the building. \n“It was basically a shell,” says Joe Doohan, president of K-L Mfg. \nThe project included installing new mechanical, electrical, and sprinkler systems. It also included removing asbestos materials, installing new insulation, and reconfiguring windows to let in more daylight, he says. \nThe company moved to the facility this year from cramped quarters in the McCullough Block building, at 2726 N. Monroe. \nK-L Manufacturing currently employs 130 people. \nThe new facility puts K-L in a position to hire more employees, Doohan says. “That’s our plan,” he says although he adds, “I don’t want to go above 200 employees.” \nCompanies with fewer than 500 employees fall under SBA’s general definition of small business in regard to many of the agency’s programs. \n“This is definitely a small business,” Doohan says. “The factories we compete with have thousands of people.” \nK-L Mfg. specializes in manufacturing sports and outdoor apparel that requires a highly skilled employee base, he says. \n“You can do generic stuff anywhere,” he says. \nDoohan says some apparel companies are re-embracing U.S. manufacturing. Though he declines to identify them, he says K-L Mfg. has a strong client base among active-wear companies, including several based in the western U.S. \n“I speak English. I work in the same time zone. And I respect intellectual property,” he says. \nDoohan says he had been looking to expand for about two years. \n“We’re fortunate it came together the way it did,” he says of SBA 504 financing. “We couldn’t have done it without that support.” \nBecause Spokane is designated by the Washington state Department of Commerce as a community empowerment zone, K-L Mfg. also was able to defer sales tax on improvements to the plant. \nThe community empowerment zone designation is intended to stimulate job growth and business investment in areas where income levels are below the state average. \n\nAnticipating growth \nWemco Inc., an industrial equipment manufacturer, funded its move and expansion on the West Plains with a $6.6 million financing package. \nThe project includes an 82,000-square-foot manufacturing complex at 5510 W. Thorpe Road. It also includes infrastructure for future expansion, says John Rouse, vice president, who co-owns the company with his wife Karma, Wemco’s president. \n“We have the capacity to grow,” Rouse says. “We will be building more buildings.” \nThe company’s future expansion plans include constructing a 20,000-square-foot fabrication and assembly facility. \nWemco manufactures equipment for construction, aerospace, mining, and agricultural use. It also manufactures, installs, services, and inspects industrial overhead cranes. \nWemco previously had operated from a 33,000-square-foot leased complex at 2823 S. Craig Road. \nSince the move early last year, the company’s workforce has doubled to about 50 employees, Rouse says. \nThe company also is on track to more than double its annual revenue since the move, he says. \nWemco’s middle management and engineering teams are in place to handle projected continued increases in production, Rouse says. \n“We will be hiring more production people,” he says. \nInstead of contracting during and since the Great Recession, Wemco bought up equipment to be ready for the economic turnaround. \nThe new facility has the largest metalworking planer between the West Coast and Chicago, Rouse asserts. \nThe five-axis machine can work on metal parts measuring up to 50 feet by 12 feet by 18 feet, he says. \nA current project in production is a 24-ton piece of tooling equipment that will be used by Boeing Co. to build fuselages for commercial aircraft. \nRouse says the SBA, with the 504 program in its toolbox, is “one of the better departments” in the federal government. “It’s definitely pro-business,” he says. “That’s important to the economy.” \n\nAdding services \nIn a $1.8 million SBA 504-financed project, the Center for Pediatric Therapy recently bought the two-floor Sons of Norway lodge building at 6710 N. Country Homes Blvd. and converted it into a therapy center, where the practice now occupies 10,000 square feet on the main floor. \nRenovations included gutting the interior of the building, installing new mechanical and plumbing systems, and constructing therapy and office stations, says the center’s controller Brad Fryett, who co-owns the practice with his wife, Echo, a physical therapist. \nAs a result of the increase in space, the practice offers more specialized services. \n“Often kids are seeing multiple therapists,” Fryett says. \nThe practice currently has a staff of 27 therapists, and three social workers employed by Spokane County are based at the center, he says. \nBefore the move, the practice had occupied less than 6,000 square feet of space and had 14 therapists. \nThe Center for Pediatric Therapy offers physical, occupational, and speech therapy services. Patients range in age from birth to 18 years old, and often present delays in development or specific therapy needs, including difficulty with mobility, sensory processing, and feeding. \nThe center also has 10,000 square feet of unused basement space to accommodate future growth. \n\nConsolidating operations \nAmerican Ironworks & Erectors Inc., of Spokane Valley, took advantage of the SBA 504 program last year to acquire 4 acres of land occupied by a 4,500-square-foot office building and a 4,800-square-foot service and storage building for $916,000. \nLevernier Construction Inc. had owned and occupied the site at 7620 E. Spear, but scaled back operations during the recession and sold the property last year to American Ironworks. \nThe heavy-construction contractor had been based in the Central Business Park, at 11016 E. Montgomery, where its main office and equipment storage were in separate areas, says James Andrews, president of American Ironworks. \n“We consolidated operations here,” Andrews says. \nHe says the loan payment is lower than the company’s former lease payments. \n“It was a no brainer,” Andrews says of the financing and move. “Plus, we’re building up equity.” \nAndrews says American Iron Workers has 10 core employees in the office and 30 to 40 employees in the field. Depending on volume of active projects, the union ship has sometimes had more than 90 workers, he says. \nThe property has room to secure and store the company’s equipment and has room for American Ironworks to grow, he says. \n“We’d like to build a shop,” Andrews says. \nAmerican Ironworks had record revenue in 2014, Andrews says, adding that 2015 is looking active, but likely won’t top last year in revenue. \nLooking forward, Andrews says, “There seems to be a lot of stuff in the design phases for 2016.” Mike McLean \nReporter Mike McLean covers real estate and construction at the Journal of Business. A multipurpose fisherman and vintage record album aficionado, Mike has worked for the Journal since 2006. Sign up for our E-mail updates Now including the", "external_links": [], "published": "2015-08-13T16:00:00.000+03:00", "crawled": "2015-08-13T19:53:30.827+03:00", "highlightTitle": ""}