{"organizations": [], "uuid": "b5c337f8bb22d1ef82e28951e8611b610df701e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources0.news.com.au/images/2015/08/07/1227474/868944-4a3abae8-3cb4-11e5-9010-1183cc5d5089.jpg", "site_section": "http://www.adelaidenow.com.au/business", "section_title": "Business News | Business and Finance News | The Advertiser", "url": "http://www.adelaidenow.com.au/business/not-on-my-watch-says-commonwealth-banks-ian-narev/story-fnmxznqb-1227474870535", "country": "US", "title": "Not on my watch, says Commonwealth Bank’s Ian Narev", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 2, "title_full": "Not on my watch, says Commonwealth Bank’s Ian Narev | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-08-08T07:30:00.000+03:00", "replies_count": 1, "uuid": "72ef84e937d9d3053e8313f63ab7d857a9f38fef"}, "author": "Jeff Whalley", "url": "http://www.adelaidenow.com.au/business/not-on-my-watch-says-commonwealth-banks-ian-narev/story-fnmxznqb-1227474870535#post-0", "ord_in_thread": 0, "title": "Not on my watch, says Commonwealth Bank’s Ian Narev", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IT’S a well established part of Australian business folklore that Commonwealth Bank chief executive Ian Narev’s first job was playing curly-haired 11-year-old Davie on Kiwi television series Children of Fire Mountain .\nWhat is less known is what he did with the money.\n“At the time my father basically said we are going to take this and put it in inflation proof bonds,” he tells BusinessDaily .\nIt was the era of New Zealand prime minister Robert “Piggy” Muldoon and the inflation rate in 1978 was at eye-watering heights, well into double-digit levels.\n“I understood from that what inflation was, what the savings rate was. I was lucky to have that experience.”\nAnd then, as a young man fresh out of school, he blew it on a gap year in Europe.\n“It was looked after for awhile,” he says of his dad’s efforts to impart a financial education.\nBut it was an early financial education for the man who would go on to run Australia’s biggest bank with its $300 billion mortgage book.\nIt also underscores a growing concern of Narev’s.\nThat is, that many Australians are being left on the sidelines of financial literacy and whether the country is doing enough to bridge the gap.\nHe now says the government and big business need to start carrying more of the load by making long-term investments in schools.\nUnder Narev, the CBA has committed to spending $50 million over three years to improve financial literacy in schools.\n“No doubt that when you talk about education outcomes what happens at home is a critical part of success and if it doesn’t you’ve got to face up to that and compensate for it elsewhere.\n“You go to schools, there are a lot of people doing a phenomenal job, so it’s not like you’ve got to reinvent teaching.”\nFor a man known as a diplomat, who was brought into an extremely profitable bank with no sense of needing to change the game plan, these are strong words.\nThen again, while Narev may not have been hired as a change agent the fact is in the past several years it has become apparent the landscape for global banks is set to be churned up and rebuilt.\nIan Narev in the New Zealand TV series Children of Fire Mountain.\nThe challenges are diffuse and each in their own way spells the end of “banking as we know it”.\nNew bank rules from regulators — both local and international — threaten to stifle the fat margins that banks have thus far enjoyed.\nRecord low interest rates due to ongoing global malaise threatens the profit engines. And the emergence of online threatens the very existence of traditional lending.\nIan Narev’s watch says a lot about a dislike for fussiness.\nWhen BusinessDaily points out the battered and clunky face he uncomfortably shifts from his preferred topics of borrowing rates and the like.\n“I wear this watch, which is not an expensive watch, because it has a big digital face and when I’m turning in the pool I have a stopwatch.”\nIt’s ironic, then, that CBA’s considered the gold standard in Australia for digital banking and yet other CEOs across the spectrum are donning Apple Watches to flaunt their hi-tech credentials.\n“I’m not a big fan of spending lots of money on accessories ... it is very functional.”\nBut in his own uncluttered way he says maintaining the lender’s digital dominance is also about trusting others.\n“There are people who are far, far smarter on technology than I am, luckily a lot of them work for the Commonwealth Bank. I don’t have to be that smart.”\nBut he’s also cognisant of the way consumers now want to conduct their banking — it’s there at the click of a button or the swipe of a screen — and what that means for revenue.\n“We had a fundamental view that technology is completely changing our business and in our mind it is seen as an existential threat.”\nBut how then do you invest in innovation at the same time as your revenue base is under pressure?\nNarev says his bank must “invest through the cycle” and not blink if the conditions appear worrying.\nThe shape of the banks.\n“When you are trying to really adapt a big institution to the future ... you are going to need to do investment throughout the cycle.\n“Within reason — whatever the conditions are — you are going to have to keep up that base-level investment.”\nWhile many talk about data and technology, Narev says winning in technology is about investing in people.\n“Good people and long term investments are things you just can’t stop-start.”\nA part of that move around people is Commonwealth’s quiet focus on productivity over the past several years.\nPart of that involves examining and possibly redrawing every process the bank’s 52,000 staff go through with its 15 million-strong customer base.\n“We are not even anywhere near where we would like to be.”\nThe goal, Narev says, is to uphold industry-leading levels of customer satisfaction — which CBA already boasts — while also boosting its productivity.\n“So that the nirvana here is, you get simpler processes for customers that they like more and at the same time are more efficient — and technology should enable you to do that.”\nOne area of the bank’s culture he has been forced to confront is the handling of the mis-selling of financial advice products before he started at the lender.\nAnd he is brutally frank about the bank’s shortcomings.\n“I haven’t found a single person who thinks that the way under my leadership and before my leadership, the way the Commonwealth Bank dealt at the start with the challenge to its financial advice business was role modelling,” he said in a speech last month.\nThus far Commonwealth has paid $52 million in compensation and is still considering more claims.\nIf these challenges are not enough, the head of the nation’s biggest bank also spares a moment to think of global turmoil — which seems to be a week-to-week proposition with Greece and the US Federal Reserve’s rate-raising prospects weighing on investors’ minds.\nThe bank boss is keeping a steady as she goes approach, while not talking down the issues that have dominated the headlines.\n“We’ve all been thinking about these sorts of things for quite a while.\n“We don’t know what the outcome is but we’ve had a reasonable amount of time to think about them and think through the different scenarios, prepare for a bunch of different scenarios.\n“We’d like to think that the economy — all our economies and businesses are pretty well prepared for the most likely scenarios and we can withstand them.\n“But you know you can never take these things for granted.\n“Basically we feel the world will be in a relatively orderly position economically, continuing where it’s been.\n“But we have to be aware some of these things could create short term shocks and we have got to make sure we can withstand them.”\nEarlier this year Narev and his partner sold their four-bedroom Victorian terrace house in Sydney’s Paddington — surely a vantage point for Sydney’s roaring property market?\n“Nobody ever finds selling a house easy and nobody ever finds buying a house easy and that is a big part of our job in making it easier,” he says.\nHe says the Australian housing market is too vast to simply characterise a one-size-fits-all dynamic.\n“When we look at our own lending book we break it into more than a thousand postcodes across Australia, and each of those have different supply-demand dynamics and prices have gone up more in some and up less in others.\n“The important thing to bear in mind is there isn’t a single property market in Australia, there are probably hundreds of them.\n“In places where people really want to live ... which tend to be closer to CBDs of Sydney and Melbourne, you are seeing higher prices because largely there is more demand than supply, which is basic economics.\n“But there’s no doubt this has also been accelerated a bit by the lower interest rate environment, and that is the thing that is shorter term that we have to be pretty careful about.”\nAt the same time, Narev says the bank is leaving open its options about how to cope with the increased structures from the regulator as it imposes greater capital costs on banks’ mortgage books and a general buffer against a financial crisis.\n“There are a number of ways we can react if we need more capital.\n“We will react when we need to.”\nOf the big four lenders Narev is still the equal youngest (with newest member Westpac boss Brian Hartzer). But after ANZ’s long-time boss Mike Smith, Narev is the longest serving — clicking over to four years this December.\nWith the average shelf life of a modern CEO measured in half decades, is he now beginning to think about his legacy in the role?\nHis peer Cameron Clyne — who is the same age — last year retired from the top job at NAB.\n“With CEOs some are a bit older, some are a bit younger.\n“I can tell you with honesty all I ever think about is making sure I can get the job done with my team to the best of my ability.\n“This whole what-age-am-I, what-have-I-done, it doesn’t factor into the equation. There is too much else to think about.”\njeff.whalley@news.com.au\n Not on my watch, says CBA chief", "external_links": ["http://resources3.news.com.au/images/2015/08/07/1227474/870507-7065c41a-3ceb-11e5-9010-1183cc5d5089.jpg", "http://resources0.news.com.au/images/2015/08/07/1227474/871024-42985b22-3cf2-11e5-9cae-299e36cb5429.jpg", "http://www.heraldsun.com.au/business/not-on-my-watch-says-commonwealth-banks-ian-narev/story-fni0dcne-1227474870535"], "published": "2015-08-08T07:30:00.000+03:00", "crawled": "2015-08-09T01:49:46.809+03:00", "highlightTitle": ""}