{"organizations": [], "uuid": "1898a8dd75be66cd9ea57bf1d4547ed561f8dde2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/18/lng-shipping-pool-idUSL5N10T1OM20150818", "country": "US", "title": "LNG ship owners launch vessel pool to cut costs in depressed market", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "LNG ship owners launch vessel pool to cut costs in depressed market | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T15:00:00.000+03:00", "replies_count": 0, "uuid": "1898a8dd75be66cd9ea57bf1d4547ed561f8dde2"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/18/lng-shipping-pool-idUSL5N10T1OM20150818", "ord_in_thread": 0, "title": "LNG ship owners launch vessel pool to cut costs in depressed market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MILAN Aug 18 Three of the top liquefied natural gas (LNG) tanker owners have decided to market 14 vessels jointly on a spot charter basis, part of a new pooling arrangement that is aimed at cutting operating costs in a depressed market.\nThe pool, consisting of eight modern vessels from Norwegian shipper Golar LNG and three each from Gaslog and Dynagas, will commence chartering operations in September, a statement from Gaslog said on Tuesday.\nA glut of newly built LNG vessels emerging from shipyards in Asia has been one factor driving down daily charter rates to around $30,000/day, compared with $130,000 two years ago.\n\"The LNG Carrier Pool allows the participating owners to optimise the operation of the pool vessels through improved scheduling ability, cost efficiencies and common marketing,\" it said.\nThe vessels will seek employment exclusively for charters of 12-months duration or less.\nThe move reflects a growing LNG market shift towards short-term trading of cargoes as prices come under pressure and new production from Australia and the United States towards the end of the year is expected to add to oversupply.\n\"The real driver primarily is the fact that we are seeing the short-term shipping market growing substantially, in the year to date there have been 97 short-term vessel fixtures versus around 78 in 2014,\" Gaslog Chief Executive Paul Wogan told Reuters.\n\"It's becoming a much more important piece of the (LNG) shipping market,\" he said.\nThe pool is expected to cater to this need by making vessel scheduling more flexible for traders, including the provision of rare single-voyage charters known as Contracts of Affreightment and other contract forms new to LNG shipping, the firm said.\nIn May, Golar LNG broke the mould by allocating six LNG tankers to Swiss trader Trafigura on a single-voyage, or COA, basis, as part of a bid to keep its fleet busy and keep the ships refrigerated at low temperatures to make them more marketable.\nLNG is ordinary natural gas chilled into liquid form at minus 162 degrees Celsius. Tankers carrying the fuel must be \"cold\" in order to store and transport the fuel. If vessels become \"warm\" through lack of use, they have to go through a cooling process before accepting cargoes. (Reporting by Oleg Vukmanovic, editing by David Evans)", "external_links": [], "published": "2015-08-18T15:00:00.000+03:00", "crawled": "2015-08-18T14:11:21.546+03:00", "highlightTitle": ""}