{"organizations": [], "uuid": "34c2f7955a42f32b5889b346f4dd9d0fe1274d1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/category-currencies/?format=rss", "section_title": "Currency & Forex News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/aussies-biggest-bang-buck-nz-140611088.html", "country": "US", "title": "Aussies get biggest bang for buck in NZ", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Aussies get biggest bang for buck in NZ", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T17:06:00.000+03:00", "replies_count": 0, "uuid": "34c2f7955a42f32b5889b346f4dd9d0fe1274d1d"}, "author": "", "url": "https://au.finance.yahoo.com/news/aussies-biggest-bang-buck-nz-140611088.html", "ord_in_thread": 0, "title": "Aussies get biggest bang for buck in NZ", "locations": ["NZ", "Australia", "NZ AAP"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tue, Aug 11, 2015, 12:20 AM AEST - Australia Markets open in 9 hrs 40 mins Aussies get biggest bang for buck in NZ AAP – 14 minutes ago Price Change \nIf you're looking to book your next holiday, you may want to look across the ditch. \nOf Australia's international favourites, New Zealand is the only destination where travellers will get more bang for their buck than they did a year ago, a new report says. \nThe Aussie dollar may be struggling against most major currencies, but it's gained four per cent year-on-year against the kiwi, the Expedia Value Tracker shows. \nAnd while average accommodation prices have risen nine per cent to $180 per night, flight prices have slipped five per cent to an average of $463. \nManaging director of Expedia Australia and New Zealand Georg Ruebensal said demand for New Zealand is on the rise, with destinations including Taupo, Fiordland and Napier experiencing double-digit growth. \nOther countries where the Aussie has gained ground are Russia (up 31 per cent against the Ruble), Columbia (up 14 per cent on the Peso), Brazil (up 14 per cent on the Real) and Norway (up three per cent against the Krone). \nA vacation to the United States will hurt the wallet, with the Aussie falling 21 per cent against the greenback in the last 12 months. \nBut the American holiday dream may not be over for some, with airfares 11 per cent cheaper than last year, and demand still higher. \n\"Interest in Hawaii is up more than 25 per cent year-on-year,\" Mr Ruebensal said. \n\"People might choose to stay in a three-star over a four-star (hotel) or stay a few days less, but they are still taking that US holiday.\" \nA Eurotrip would also be harder on the purse strings given the Aussie has tumbled 12 per cent against the pound, and three per cent against the Euro. \nBut the average costs of flights are down across the board to Norway, the UK, Italy and France, which may entice jetsetters. \nEven cheap local favourites like Thailand and Indonesia are dearer, with the Aussie down nine per cent against the Rupiah and 16 per cent against the Baht. \nHotel rates and flights have bumped up in both these countries as well. \nHOW AUSSIE FAVOURITES RANK \n* New Zealand: $A up 4pct \n* Europe: $A down 3pct", "external_links": [], "published": "2015-08-10T17:06:00.000+03:00", "crawled": "2015-08-10T17:21:55.574+03:00", "highlightTitle": ""}