{"organizations": ["RSI", "Fed"], "uuid": "b0b62ce10ef91d36c7a664915c21271f206defff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/vuP5EYbF8F0G6VQEIAacJw--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/https://media.dailyfx.com/illustrations/2015/08/26/EURUSD-August-Rally-to-Erode-Further-on-Upbeat-2Q-US-GDP_body_ScreenShot306.png", "site_section": "https://au.finance.yahoo.com/news/category-commodities/?format=rss", "section_title": "Commodities Market News - Yahoo!7 Australia Finance", "url": "https://au.finance.yahoo.com/news/eur-usd-august-rally-erode-080000565.html", "country": "US", "title": "EUR/USD August Rally to Erode Further on Upbeat 2Q US GDP", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "EUR/USD August Rally to Erode Further on Upbeat 2Q US GDP", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T11:00:00.000+03:00", "replies_count": 0, "uuid": "b0b62ce10ef91d36c7a664915c21271f206defff"}, "author": "", "url": "https://au.finance.yahoo.com/news/eur-usd-august-rally-erode-080000565.html", "ord_in_thread": 0, "title": "EUR/USD August Rally to Erode Further on Upbeat 2Q US GDP", "locations": ["US", "U.S.", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Janet Yellen", "David SongShuyang"], "text": "Thu, Aug 27, 2015, 7:05 PM AEST - Australia Markets closed EUR/USD August Rally to Erode Further on Upbeat 2Q US GDP By David SongShuyang | DailyFX – 1 hour 5 minutes ago Recommend - 2Q U.S. GDP to Increase Annualized 3.2%- Fastest Pace of Growth Since 3Q 2014. - Personal Consumption to Pick Up for Second Consecutive Quarter. Trading the News: U.S. Gross Domestic Product (GDP) An upward revision in the 2Q U.S. Gross Domestic Product (GDP) report may boost the appeal of the greenback and spark a larger pullback in EUR/USD as it fuels speculation for a September Fed rate hike. What’s Expected: Click Here for the DailyFX Calendar Why Is This Event Important: The Fed may stay on course to normalize monetary policy in 2015 as the central bank still anticipates a stronger recovery to materialize over the coming months, and data prints encouraging an improved outlook for growth & inflation may spur a greater dissent within the committee as the economy gets on a more sustainable path. For LIVE SSI Updates Ahead of the U.S. GDP Print, Join DailyFX on Demand Expectations: B ullish Argument/Scenario Existing Home Sales (MoM) (JUL) -1.1% Advance Retail Sales (MoM) (JUL) 0.6% 56.2 60.3 The expansion in service-based activity along with the pickup in household spending may generate a stronger-than-expected GDP print, and a positive development may boost interest rate expectations as Fed Chair Janet Yellen remains upbeat on the economy. Risk: B earish Argument/Scenario 0.6% 0.1% However, easing job growth paired with the slowdown in building activity may drag on growth rate, and signs of a slower recovery may spur a further delay of the Fed’s normalization cycle as the central bank struggles to achieve the 2% target for inflation. How To Trade This Event Risk ( Video ) Bullish USD Trade: Growth Rate Expands Annualized 3.2% or Greater Need to see red, five-minute candle following the GDP report to consider a short trade on EURUSD. If market reaction favors a long dollar trade, sell EURUSD with two separate position. Set stop at the near-by swing high/reasonable distance from entry; look for at least 1:1 risk-to-reward. Move stop to entry on remaining position once initial target is hit; set reasonable limit. Bearish USD Trade: 2Q GDP Report Falls Short of Market Expectations Need green, five-minute candle to favor a long EURUSD trade. Implement same setup as the bullish dollar trade, just in reverse. Potential Price Targets For The Release EURUSD Daily Chart - Cre ated Using FXCM Marketscope 2.0 Near-term breakout in EUR/USD keeps the focus on the topside targets as the RSI retains the bullish momentum; will retail a constructive view along as the pair holds above former-resistance around 1.1180 (23.6% retracement) to 1.1210 (61.8% retracement). DailyFX Speculative Sentiment Index (SSI) shows the retail crowd remains net-short EUR/USD since March 9, but the ratio continues to come off of recent extremes as it narrows to -1.76, with 36% of traders long. Interim Resistance: 1. 1760 (61.8% retracement) to 1.1810 (38.2% retracement) Interim Support: Interim Support: 1. 0790 (50% expansion) to 1.0800 (23.6% expansion) Read More:", "external_links": [], "published": "2015-08-27T11:00:00.000+03:00", "crawled": "2015-08-27T12:06:57.638+03:00", "highlightTitle": ""}