{"organizations": [], "uuid": "9754adec7fd7a2bf878c92a652088010f949e007", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/8/n/2/s/image.related.afrArticleLead.620x365.gjbf8q.png/1440991715616.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/equity-markets/china-stockmarket-why-fears-of-a-collapse-are-overblown-20150831-gjbf8q", "country": "AU", "title": "China stockmarket: why fears of a collapse are overblown", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "China stockmarket: why fears of a collapse are overblown | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T10:37:00.000+03:00", "replies_count": 0, "uuid": "9754adec7fd7a2bf878c92a652088010f949e007"}, "author": "Rose Powell", "url": "http://www.afr.com/markets/equity-markets/china-stockmarket-why-fears-of-a-collapse-are-overblown-20150831-gjbf8q", "ord_in_thread": 0, "title": "China stockmarket: why fears of a collapse are overblown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chinese sharemarket plunges and the currency devaluations have spooked local and international investors. AP Share on twitter Share on Google Plus by Rose Powell China's allegedly imminent recession has become a popular topic recently after the plunges of its equity markets and the devaluation of the renminbi currency sent tremors through the international investor community, but a leading economic researcher says most of these fears are overblown.\nWhile there are many legitimate concerns about China's inevitable slowdown, Gavekal's China research director Andrew Baston says, fears China is teetering on the verge economic collapse are misguided.\n\"Such fears are exaggerated; China's economy is not collapsing. But it is slowing,\" Mr Baston said in a research note.\nThe note details how investors are rightfully concerned about the rising domestic debt, the government's recent failures to steer the economy coupled with the slow down in investment as well as in heavy industry and commodity sectors, but ultimately concluded an economic collapse was unlikely.\nThe renminbi fell 3 per cent after the People's Bank of China lowered its trading midpoint and investors are concerned it could have another 5 per cent or so to fall. Bloomberg With construction stagnating and investment at its weakest in 10 years, Mr Baston said Beijing deploying looser monetary policies would have limited impact so the slowdown was inevitable.\nBut this looser monetary policy will be hard to implement because the level of domestic debt is so high.\n\"With total debt at 250% of GDP, China today is far more leveraged than in 2009 when Beijing last launched a major monetary expansion. Today, such a debt-fueled stimulus program is out of the question, given the high starting point. As things stand, the combination of very high total debt plus deteriorating economic growth will push up the level of bad debt,\" Mr Baston said.\nHowever there were four commonly discussed issues where Mr Baston said fears of economic fragility are excessive.\n A total collapse of the Chinese property market is unlikely, says Gavekal's China research director Andrew Baston. 1. Renminbi devaluation is not part of a currency war The incident that caused the tides of concern to begin to rise was the devaluation of the renminbi in early August.\nThe renminbi fell 3 per cent after the People's Bank of China lowered its trading midpoint and investors are concerned it could have another 5 per cent or so to fall.\nThis sparked concerns the PBoC was not just preparing for lower domestic growth but potentially positioning for a currency war that would slash billions from global budgets, particularly throughout Asia and commodity driven economies such as Australia, New Zealand and Canada.\nHowever, Mr Baston said the fear the devaluation would launch a foreign debt crisis were overblown.\n\"China is well insulated from the sort of foreign currency debt crisis that has struck other emerging markets in recent decades,\" Mr Baston said.\n2. Market volatility won't trigger a broader meltdown The Shanghai stock market experienced significant plunges last week that brought the total value lost since the volatility began in June to almost 45 per cent.\nWhile investors and economics remain riveted by the market's tumultuous trading, Mr Baston said the sell-offs impact on the broader economy would be limited, as equities make up no more than 5 per cent of household wealth.\n\"Although a continued slump from current levels would generate plenty of hyperbolic headlines about a crashing China, even a further sell-off would have a limited spillover effect on the real economy,\" Mr Baston said, adding the Chinese banking system had little exposure to the stock market volatility.\n\"So, although wealth management products linked to the stock market may sustain big losses, and while it is possible some brokers could fail, it is highly unlikely that a further slump in equities will trigger a systemic crisis.\"\n3. Deep collapse of property prices unlikely While Chinese household equity exposure may be low, property investment is far more common and the local appetite for property has pushed prices to dizzying heights.\nMr Baston said the widely held view that the Chinese property market would collapse under the weight of an enormous speculative bubble fuelling high prices was out of step with the two key drivers of the housing price rise: expanding urban population and rising incomes, both of which are set to continue.\n\"That does not mean everything in the garden is rosey: these fundamentals indicate that housing demand is close to its peak, and that the sector has gone from being a growth driver to a drag on growth, a shift with huge knock-on effects for the rest of the economy,\" Mr Baston said.\n\"But the maturation and decline of housing demand is a very different thing from the unwinding of a massive speculative bubble.\"\nIn the last six months, the Chinese government have lowered interest rates and relaxing regulations that operated as restrictions to property purchasing to support continued buying and still has plenty of room for further cuts or policy changes.\n4. Unemployment surge to be limited A slowing economy is rarely good news for unemployment numbers and there are widespread concerns unemployment in China could trigger tranches of newly unemployed workers, which would cause a significant blow to already weak consumer demand.\nBut Mr Baston said the fact the major slowdowns had occurred in state-owned enterprises, such as heavy industrial and commodity management sectors, meant a record waves of redundancies were unlikely as these companies had far less flexibility to cut jobs.\n\"Even in the private sector, firms have balked at making mass lay-offs, with mining companies choosing instead to reduce working hours and award employees more holiday.\"\nMr Baston said while work hours and wages had declined, unemployment would remain relatively stable.", "external_links": ["https://twitter.com/@rosepowell", "https://plus.google.com/https://plus.google.com/116041942547218769712/posts"], "published": "2015-08-31T10:37:00.000+03:00", "crawled": "2015-08-31T14:10:12.653+03:00", "highlightTitle": ""}