{"organizations": [], "uuid": "fc353939a470db25c5d215f411e47c5d33a0c2e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508211172.html", "country": "US", "title": "Ethiopia: We Will Afford to Defer Addressing Dire Poverty", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Ethiopia: We Will Afford to Defer Addressing Dire Poverty", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T14:07:00.000+03:00", "replies_count": 0, "uuid": "fc353939a470db25c5d215f411e47c5d33a0c2e2"}, "author": "", "url": "http://allafrica.com/stories/201508211172.html", "ord_in_thread": 0, "title": "Ethiopia: We Will Afford to Defer Addressing Dire Poverty", "locations": ["Ethiopia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Govt Mulls Use of Ethanol to Cure Tobacco \n\"Though, it is quite obvious we need time to bring transformation, the poverty situation won't give us the luxury of time, \" said Prime Minister Hailemariam Desalegn two days ago in discussing the approaching GTP II. \" Therefore,we need plans that centralize the two to transform the country.\" We are starting from a very low base in terms of development, so it should actually take much longer for this impact to send down deeper roots. \nBut without doubt, additional drivers of poverty reduction will be needed to end the embedded poverty, particularly those that encourage the structural transformation of the economy based on further agglomeration of policies and strategies that encourage and would help increase poverty reduction in the form of GTP II. However, the unfinished and unmet agendas of GTP I, such as curbing bad governance, improving government bureaucracy, averting tax evasion, improving poor networking and proper utilization of technologies to boost the agriculture sectors, and many more need serious radical and timely action more than ever. Evidently, it might take years before the majority of people benefit from the economic growth, we also need to be patient while waiting for a trickle-down effect to lift more people from poverty. \nOn the lives of people we may not see the next day the impact of actually constructing a road today. It may take a couple of years to do that. Nevertheless, active public participation is central to bring the required radical change to realize those plans and strategies and build a developmental nation. It won't be redundant to say, primarily, unless there is a reinforced accountability and transparency system that constantly updates itself, it is impossible to effectively implement the approaching GTP II or other polices or directives. It won't be an exaggeration to say, lack of good governance and stifling bureaucracy are the fundamental challenges as well as the stumbling blocks that stand on the country's path towards progress. \nCitizens from every walk of life are not only affected by it but it has also become their daily struggle. Hence, immediate measures are called for beyond rhetoric. On the positive side, the country has made remarkable progress in the various reforms to improve good governance. But, despite good will,commitment and various intensified measures as well as the traditional denunciation and self denunciation, lack of good governance persisted from ever increasing price hike to lack of genuine commitment to solve public grievances related to quality service provision to mismanagement of public funds and poor procurement. Worsening the situation are also rent seeking, favoritism, and nepotism - common practices rampant in government offices. Change won't happen by loud rhetoric. Accountability and transparency have to be the norm. \nAs long as the culture within the civil service as well as societal attitude remains the same, it is unlikely that there will be any radical change in the near future. In order to strengthen good governance, first and foremost, public officials have to be molded and the government has to be steadfast in strengthening transparency and accountability. It is becoming common to hear government officials saying that reform comes in tandem with awareness. \nYes, that is true, but there must be a strong enforcement of the law, transparency and accountability, through a system that punishes the guilty and rewards the best. Government institutions have the responsibility to be a good stewards of the tax payers money, while, officials, be it at higher level or at lower one, have to be accountable and transparent in discharging assigned responsibilities. They have to see to task are performed as planned. Also they have to check the proper utilization of funds and authority. \nOn the other hand, businessmen must clearly understand that tax evasion is a serious crime that result in negative consequences such as imprisonment, punishment and loss of business. Good governance presupposes out of the box thinking. Building a society that upholds good governance is a demanding task. In order to achieve that, first, the leadership has to be a role model. The leadership at every level can't carry on 'business as usual' mentality, first change has to come within itself. Ethiopia \nThe Meles Zenawi Foundation in partnership with the African Development Bank (AfDB) and the Government of Rwanda is … see more » Copyright © 2015 The Ethiopian Herald. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-21T14:07:00.000+03:00", "crawled": "2015-08-21T15:34:27.001+03:00", "highlightTitle": ""}