{"organizations": ["ASOS plc & Royal Bank Of Scotland Group Plc"], "uuid": "5920a1cd7746cae9392eaffea7c56661b523b1d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/blame-government-fall-asos-plc-123537883.html", "country": "GB", "title": "Should You Blame The Government For The Fall In ASOS plc & Royal Bank Of Scotland Group Plc?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Should You Blame The Government For The Fall In ASOS plc & Royal Bank Of Scotland Group Plc?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T15:35:00.000+03:00", "replies_count": 0, "uuid": "5920a1cd7746cae9392eaffea7c56661b523b1d9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/blame-government-fall-asos-plc-123537883.html", "ord_in_thread": 0, "title": "Should You Blame The Government For The Fall In ASOS plc & Royal Bank Of Scotland Group Plc?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 19, 2015, 13:41 BST - UK Markets close in 2 hrs 49 mins Should You Blame The Government For The Fall In ASOS plc & Royal Bank Of Scotland Group Plc? By Alessandro Pasetti | Fool.co.uk – 5 minutes ago 336.70 -4.0000 \nThe recent disposal of a stake in Royal Bank of Scotland (LSE: RBS) by the UK government is likely to be followed by additional divestments at a significant loss, at least over the short term -- but is it time to sell or to buy the shares of RBS for long-term investors? \nIts stock price is down 15% over the last six months, which is roughly the amount of value that the shares of ASOS (LSE: ASC) have lost since mid-July. You may well wonder why I am going to discuss the prospects of ASOS in this article. \nWell, a direct correlation between the government and the online retailer is hard to determine, but there are signs that e-commerce platforms could face a tax crackdown. Stock Sale \nThe government launched the privatisation of Lloyds on 16 September 2013: a lengthy process had to be expected without the intervention of trade buyers. \nAbout 6% of the shares in the retail banking group were initially sold, reducing the government's stake to 32.7% from 38.7%. Since mid-September 2013, the shares of Lloyds have gained only 3% of value, and it may take another year or so to cut the Treasury's stake down to zero. \nIt'll likely take between three and six years to exit RBS, unless the Treasury finds a trade buyer willing to take a large equity position in the bank. The government just got rid of a 5.4% stake at 330p a share, selling RBS stock at almost 175p below the required break-even threshold, but it still holds a 73% stake. \nA significant discount will apply in every future sale -- that's necessary to attract new investors -- and that's why I'd avoid RBS. Although the bank clearly has more restructuring potential, a smaller assets base and operational improvements will unlikely contribute to value creation while offsetting prolonged downward pressure on its stock price, in my view. ASOS & Regulations: Nothing To Worry About? \nAccording to recent press reports, the government plans to obtain more data on internet transactions. \n\" HM Revenue and Customs wants to collect information from internet companies such as Paypal that would allow it to identify British users who have an income from online sales ,\" The Independent reported on 25 July. \nNow, ASOS is not Paypal, of course, and this may be an issue for its customers rather than for ASOS itself, but regulations in the online shopping arena remain a grey area, and could involve millions of daily transactions. \nVirtually nobody is paying much attention to the possible impact of tougher regulations, and surely regulatory risk is not behind the recent fall in ASOS shares, but a few legitimate questions remain. \nWill this kind of risk be a serious threat to shareholder value in future? \nWell, it might affect volumes in the broader online industry, as the ultimate user will likely have to face a higher tax burden in some circumstances. Internet penetration is the UK is incredibly high compared to Western and Eastern standards, and ASOS generates almost 40% of revenues domestically. \nThe retailer has historically invested in such websites such as Covetique, which targeted the luxury resale market before shutting up shop earlier this summer. More such deals will likely ensue, but will they require greater scrutiny? \nASOS stock is currently priced at around 3,200p, which implies stellar forward multiples based on earnings and cash flows. As you might know, in order to support a rich valuation, ASOS must grow annual revenues at 20% or more, while maintaining an operating margin of 4%. \nThat's surely possible, but then if you are chasing growth and steady margins, you must also keep an eye on a number of promising growth plays that have been selected by our Motley Fool analysts. \nIn our FREE report you'll find several cheaper stocks than ASOS and RBS, many of which could double in value over the next twelve month -- they have become even cheaper in recent times! --and boast an outstanding track record. \nTo get your free copy and to know everything about their prospects, click here right away ! \nAlessandro Pasetti has no position in any shares mentioned. The Motley Fool UK owns shares of ASOS. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-19T15:35:00.000+03:00", "crawled": "2015-08-19T15:41:44.867+03:00", "highlightTitle": ""}