{"organizations": [], "uuid": "b5c894f7f4c4bb8ec7fde4a7a175ba929fba99c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/2/0/3/1/image.related.afrArticleLead.620x365.gj1z8a.png/1439891466708.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/riot-act-hits-the-bestread-lists-as-abbott-reads-it-again-20150818-gj1z8a", "country": "AU", "title": "Riot Act hits the best-read lists as Abbott reads it again", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Riot Act hits the best-read lists as Abbott reads it again | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T16:05:00.000+03:00", "replies_count": 0, "uuid": "b5c894f7f4c4bb8ec7fde4a7a175ba929fba99c1"}, "author": "Fleur Anderson", "url": "http://www.afr.com/news/politics/riot-act-hits-the-bestread-lists-as-abbott-reads-it-again-20150818-gj1z8a", "ord_in_thread": 0, "title": "Riot Act hits the best-read lists as Abbott reads it again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Justice Minister Michael Keenan and Prime Minister Tony Abbott observe drug testing during their visit to the AFP training facility in Canberra on Monday. Alex Ellinghausen Share on twitter by Fleur Anderson Prime Minister Tony Abbott's copy of the Riot Act must be a rather well-thumbed document because he is, once again, attempting to quell \"tumults and riotous assemblies\" within his own cabinet.\nGiven the original Riot Act of 1714 from the Parliament of Great Britain was intended to disperse any group of 12 people or more or face the consequences, reading the riot act (again) could make the cabinet room a very lonely place.\nAs the debate among his own ministers over same-sex marriage dragged into a second week, Abbott's demand that everyone stick to the same script triggered some genre-crossing jaunts by his colleagues, from slapstick, into a little introspective art house and a hint of political thriller.\nAssistant Immigration Minister Michaelia Cash tried a tear-jerker before question time as she reminded voters to put aside personality judgments.\n\"You may not like us as individuals, I can accept that,\" Senator Cash told Sky News. \"But look at the policies, look at our achievements.\"\nAttorney-General George Brandis, who was one of the ministers who strayed off script to add that perhaps a gay marriage referendum was not quite the best thing, reminded his colleagues that Abbott was actually a very good team leader.\n\"The Prime Minister is very good at bringing out the best of all the members of his team. He's a bit like a coach,\" Senator Brandis said.\n\"One of the reasons Tony Abbott is such a great leader is because, like the captain or perhaps the coach of the team, he always insists on a team game and he always brings out the best in the players.\"\n Labor leader Bill Shorten was keen to needle Abbott again on the disastrous Liberal fundraiser-Dyson Heydon debacle. By the time question time rolled around the Coalition determinedly back on script, with the chant \"jobs, jobs, jobs\", and back on side with Team Abbott.\nLabor leader Bill Shorten was keen to needle Abbott again on the disastrous Liberal fundraiser-Dyson Heydon debacle and surprisingly was allowed by Speaker Tony Smith to ask a question that would have undoubtedly been ruled out of order by his predecessor, Bronwyn Bishop.\n\"Is it not the case that the PM's series of disastrous captain's picks continue to completely paralyse this government?\" Shorten asked.\nSmith instructed the Prime Minister to answer the question, which he did, turning the whole vexed issue of \"captain's picks\" back on Labor.\n\"Yet another piece of empty bombast from a Leader of the Opposition who has no answers, no answers for the questions facing our country,\" Abbott said, using the time to enumerate the government's achievements on the environment, the ice epidemic, the boats, and national security.\n\"We are getting on with the job and, just for once, I say to members opposite, why not stop playing politics and actually engage?\"\nOf course, telling politicians not to play politics is like telling humans not to breathe. But over the course of question time, a number of people and institutions – Labor, litigious environmental groups, Dyson Heydon, Labor MP Brendan O'Connor's brother – were accused by both sides of playing politics.\nIt was a high-spirited Labor MP Ed Husic​ who asked Foreign Minister Julie Bishop, speaking on the Syrian situation, to \"tell us in emojis\".\nIt was also a little historic. Liberal National backbencher Ewen Jones became the first Coalition MP to be punted on Speaker Smith's watch for unruly behaviour.", "external_links": ["https://twitter.com/https://twitter.com/fleur_anderson"], "published": "2015-08-18T16:05:00.000+03:00", "crawled": "2015-08-18T14:04:52.021+03:00", "highlightTitle": ""}