{"organizations": [], "uuid": "76fd8039bedbb8203fcd7443c23e7eb00571149e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "site_section": "http://rss.prnewswire.com/subject/fnc/", "section_title": "PR Newswire: Financing Agreements", "url": "http://www.prnewswire.com/news-releases/merus-enters-into-728-million-euro-series-c-financing-led-by-sofinnova-ventures-and-novo-as-300132962.html", "country": "IL", "title": "Merus enters into 72.8 million euro series C financing led", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Merus enters into 72.8 million euro series C financing led", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T19:49:00.000+03:00", "replies_count": 0, "uuid": "76fd8039bedbb8203fcd7443c23e7eb00571149e"}, "author": "Merus B.V.", "url": "http://www.prnewswire.com/news-releases/merus-enters-into-728-million-euro-series-c-financing-led-by-sofinnova-ventures-and-novo-as-300132962.html", "ord_in_thread": 0, "title": "Merus enters into 72.8 million euro series C financing led", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UTRECHT, Netherlands , Aug. 26,   Merus B.V., a clinical-stage immuno-oncology company developing innovative bispecific antibody therapeutics, today announced that it has entered into an agreement with investors for the sale of up to € 72.8 million ( $80.5 million ) of Series C preferred shares and consummated the first tranche under the agreement. New investors include Sofinnova Ventures and Novo A/S as the co-leads, along with RA Capital Healthcare Fund, Rock Springs Capital, Tekla Capital Management and an unnamed U.S.-based life sciences-focused investor.  The company's existing investors, including Novartis Venture Fund, Johnson & Johnson Innovation - JJDC, Inc., Pfizer Venture Investments, Bay City Capital, LSP Life Sciences Partners and Aglaia Oncology Fund, also participated in the financing.   \n\n\"The proceeds from this financing provide us with funding to advance our key clinical and preclinical programs and to broaden our pipeline of innovative therapeutics that recruit cells of the immune system to kill cancer cells,\" said Ton Logtenberg, Ph.D., Chief Executive Officer of Merus. \"This financing follows the progression of Merus into a clinical stage company.  Our first lead bispecific antibody, MCLA-128, has commenced phase 1/2 clinical  trials as a potential targeted therapy for solid tumors and our second lead bispecific antibody, MCLA-117 for the treatment of acute myeloid leukemia, is planned to commence clinical trials in the first quarter of 2016.\" \n\nAs part of the transaction, Anand Mehra of Sofinnova Ventures and Jack Nielsen of Novo A/S have joined the Merus board of directors. \n\n\"Cancer remains a disease of significant unmet medical need where targeted therapies that activate the immune system to kill tumor cells hold the promise of providing novel and effective treatment options for patients,\" said Anand Mehra . \"Merus' proprietary technology platform has enabled the company to build a significant pipeline of promising immuno-oncology drug candidates.\" \n\nAbout Merus B.V. \nMerus is a clinical-stage immuno-oncology company developing innovative bispecific antibody therapeutics, referred to as Biclonics. Biclonics are based on the full-length IgG format, are manufactured using industry standard processes and have been observed in preclinical studies to have several of the same features of conventional IgG-based antibodies, such as long half-life and low immunogenicity. Merus's lead Biclonics product candidate, MCLA-128 is being evaluated in a Phase 1/2 clinical trial in Europe as a potential treatment for HER2-expressing solid tumors. Merus's second Biclonics product candidate, MCLA-117, is being developed as a potential treatment for acute myeloid leukemia, and Merus expects to initiate clinical trials of this candidate in the first quarter of 2016. The company also has a robust pipeline of proprietary product candidates in pre-clinical development, including Biclonics designed to bind to various combinations of immunomodulatory molecules, including PD-1 and PD-L1. For further information, please visit www.merus.nl . \n\nSOURCE Merus B.V.\n\n\nRELATED LINKS\nhttp://www.merus.nl", "external_links": [], "published": "2015-08-26T19:49:00.000+03:00", "crawled": "2015-08-26T19:55:22.105+03:00", "highlightTitle": ""}