{"organizations": [], "uuid": "b6026d062fbd904ad9fa0b44b9c995ac45c79e6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/12/argentina-debt-idUSL1N10N2ZC20150812", "country": "US", "title": "UPDATE 1-U.S. judge sanctions Argentina in debt default litigation", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-U.S. judge sanctions Argentina in debt default litigation | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T02:32:00.000+03:00", "replies_count": 0, "uuid": "b6026d062fbd904ad9fa0b44b9c995ac45c79e6a"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/12/argentina-debt-idUSL1N10N2ZC20150812", "ord_in_thread": 0, "title": "UPDATE 1-U.S. judge sanctions Argentina in debt default litigation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details on court hearing and ruling, background on case)\nBy Nate Raymond\nNEW YORK Aug 12 (Reuters) - A U.S. judge on Wednesday sanctioned Argentina for failing to provide documents and information about U.S. assets sought by creditors holding defaulted debt and seeking to collect on unpaid judgments.\nThe ruling, by U.S. District Judge Thomas Griesa in Manhattan, is the latest setback to Argentina's effort to stop hedge funds and other creditors from pursuing repayment on the cash-strapped country's bonds following its 2002 default.\nGriesa said because Argentina's failed to produce documents in response to a 2013 order, any of its property in the United States, unless for diplomatic or military use, would be deemed commercial, making it easier for the creditors to go after it.\nGriesa said that Argentina also must produce a log in 10 days of any documents it deemed protected by attorney-client privilege or else that privilege would be waived.\n\"There's no doubt at all that the plaintiffs are entitled to sanctions based on that discovery order,\" Griesa said at a court hearing.\nThe ruling could make it easier for hedge funds including Elliott Management's NML Capital Ltd to collect on unpaid judgments they have amassed in litigation spilling out of Argentina's $100 billion default in 2002.\nThose creditors spurned Argentina's 2005 and 2010 debt restructurings, which resulted in 92 percent of its defaulted debt being swapped and investors being paid less than 30 cents on the dollar.\nThe country defaulted again in July 2014 after refusing to honor orders to pay $1.33 billion plus interest to the hedge funds.\nGriesa later held Argentina in contempt for failing to comply with his orders, and in June, ordered it to pay $5.4 billion to another 500-plus holders of defaulted debt before it could pay its other creditors.\nWednesday's hearing followed a federal appellate court ruling in December rejecting Argentina's bid to reverse Griesa's 2013 order requiring documents be produced about its assets. NML subsequently renewed its request, but Argentina has largely declined to produce anything.\nJonathan Blackman, Argentina's lawyer, warned Griesa that a ruling that all of its U.S. property was commercial could conflict with years of prior rulings.\nHe cited a ruling in March by a judge in Los Angeles finding that NML could not seek to go after Argentina's rights to launch two satellites because they were not for a commercial purpose.\n\"This is an effort to jump over all the issues litigated case by case for years,\" Blackman said. (Reporting by Nate Raymond in New York; Editing by Steve Orlofsky)", "external_links": [], "published": "2015-08-13T02:32:00.000+03:00", "crawled": "2015-08-13T01:44:07.141+03:00", "highlightTitle": ""}