{"organizations": [], "uuid": "13d3c3cf213350c48a599ea33f19e4cb60a3d298", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2014/12/PSU-Oil-s.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/with-crude-at-50-oil-firms-fear-deeper-crisis-than-in-1980s/114357", "country": "IE", "title": "With crude at $50, oil firms fear deeper crisis than in 1980s", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "With crude at $50, oil firms fear deeper crisis than in 1980s | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:48:00.000+03:00", "replies_count": 0, "uuid": "13d3c3cf213350c48a599ea33f19e4cb60a3d298"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/with-crude-at-50-oil-firms-fear-deeper-crisis-than-in-1980s/114357", "ord_in_thread": 0, "title": "With crude at $50, oil firms fear deeper crisis than in 1980s", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After slashing spending by $180 billion to deal with one of the worst industry downturns in decades, oil companies are still bleeding cash and slipping further into debt to maintain dividends to shareholders.\nDepressed crude prices – at below $50 a barrel Brent crude is half what it was a year ago – mean even more cuts are needed at new projects and existing operations. Companies trying to dispose of oilfields to raise cash could be forced to sell quickly and for less than they hoped.\nThere is little sign that the oil price will come to the rescue as the Organization of the Petroleum Exporting Countries (OPEC) continues to pump hard into an oversupplied crude market in response to explosive growth in U.S. shale oil.\nBrent is expected to average $60.60 in 2015 and $69 in 2017, according to a Reuters poll of analysts. The International Energy Agency said in February it saw it recovering to $73 in 2020 as the supply glut slowly eases.\nAnalysts at investment bank Jefferies say international oil companies lowered their break-even points by $10 a barrel after the latest round of spending cuts, but will still need a price of $82 a barrel in 2016 to cover spending and dividends, which have been the main investment attraction for the sector for decades.\n“In order to cover the shortfall, the sector will increase its borrowing. While leverage remains manageable within the sector, this is not a practice that can continue in perpetuity,” Jefferies said in a note on Wednesday.\nOil majors such as Royal Dutch Shell, Chevron and Total are helped by profitable refining operations. Most are increasing oil and gas output, squeezing as much revenue as they can from past investments but exacerbating the oversupply.\nSpending next year is expected to decline by a further 5 to 15 percent depending on the oil price, according to Oslo-based consultancy Rystad Energy. The world’s top oil companies used second-quarter results to show they were ready for deeper, more painful measures.\n“The tone has changed. Maybe we didn’t quite create the right impression of urgency back in January,” said Shell Chief Executive Officer Ben van Beurden.\nBP Chief Executive Bob Dudley said “oil prices will be lower for longer”.\nPart of the problem for the oil majors is that large national oil companies and shale producers have increased their share of global production gradually for years, leaving the majors victims of forces largely beyond their control.\nTheir heavy investment cuts are expected to lower global production capacity by 2 million barrels per day by 2020, according to Rystad Energy. But OPEC producers will only move in to make up the shortfall.\n“This has been really a tough time for the industry from Aberdeen to Angola to Houston … It does feel like 1986,” BP CEO Dudley said last week after a near two-thirds drop in quarterly profit.\nIn late 1985, oil prices slumped to $10 from around $30 over eight months as OPEC raised output to regain market share following an increase in non-OPEC production. The industry responded by cutting spending by nearly a quarter and slashing its workforce by a third, according to Morgan Stanley. Prices gradually recovered over the next decade as global demand rose.\nBut today’s supply overhang could last much longer. “If oil prices follow the path suggested by the forward curve … this downturn would be more severe than that in 1986,” Morgan Stanley said in a note.\nThe $180 billion of cuts this year represent roughly a 20 percent drop from 2014, according to Rystad. Oil companies have deferred up to $200 billion worth of projects including complex, expensive ventures that hold huge resources, such as Canadian oil sands and deepwater projects in Africa, Southeast Asia and the Arctic.\nProduction lags investments by a minimum of six months for onshore drilling, but up to ten years for complex deepwater fields, liquefied natural gas projects or Canadian oil sands mega projects.\nSome observers say the industry needed an efficiency drive with or without the oil price slump, after operating costs tripled over the past five years.\nBP found it easier to adapt to the halving of oil prices because it had already sold $45 billion of assets and lowered costs to cover the huge clean-up and fines from the 2010 Gulf of Mexico spill.\n“BP is probably the most advanced among these companies in actually achieving the cost savings,” said Jefferies analyst Jason Gammel, who holds a “buy” rating on BP and Chevron.\nFor now, the oil majors can cover the shortfall by higher borrowing, which currently averages around 15 percent of their market value – still relatively low compared with other industries.\nSmaller exploration and production companies that lack big refining operations such as Premier Oil and Tullow Oil have been forced to abandon dividends this year.\nTullow executives said the company had “reset the business” to be competitive at an oil price around $50. Like its peers, the Africa-focused company has slashed spending on new projects and shifted away from complex wells to focus on onshore and simpler offshore plays.\nTullow arranged financing before the oil price drop and that means it can weather the downturn for now, say analysts at Morningstar. But they said Tullow’s cash flow burn means it must eventually sell assets which, with oil where it is today, would probably fetch a depressed price.\nTullow’s interests in major oil discoveries being developed “will require far more capital than any company of its size can possibly generate from its operations,” Morningstar said.\n 05, 2015 7:48 pm", "external_links": [], "published": "2015-08-06T03:48:00.000+03:00", "crawled": "2015-08-05T18:27:16.213+03:00", "highlightTitle": ""}