{"organizations": [], "uuid": "0827299af51a94e93fce52855f69df1f467688f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/14/china-blast-idUSL3N10O66M20150814", "country": "US", "title": "China investigates cause of blasts at Tianjin port, firms assess damage", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "China investigates cause of blasts at Tianjin port, firms assess damage | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T04:38:00.000+03:00", "replies_count": 0, "uuid": "0827299af51a94e93fce52855f69df1f467688f8"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/14/china-blast-idUSL3N10O66M20150814", "ord_in_thread": 0, "title": "China investigates cause of blasts at Tianjin port, firms assess damage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* At least 12 firefighters among 50 killed\n* Warehouse stored toxic chemicals and gas\n* Many foreign firms sustain largely minor damage to facilities\n* Blasts hit iron ore deliveries, tanker operations\n* President says those responsible to be \"severely handled\"\nBy Sui-Lee Wee and Adam Rose\nTIANJIN, China, Aug 14 (Reuters) - Investigators searched for clues on Friday to identify what caused two huge explosions at a warehouse used to store toxic chemicals and gas at a busy port in northeast China, as foreign and local companies assessed the damage to their operations.\nThe blasts in the city of Tianjin on Wednesday night killed at least 50 people, including a dozen fire fighters, state media said. About 700 people were injured, 71 seriously.\nThe explosions at the port, the world's 10th largest, were so big they were seen by satellites in space and registered on earthquake sensors.\nThe warehouse was designed to store dangerous and toxic chemicals, according to an assessment by environmental inspectors published in 2014. It was storing mainly ammonium nitrate, potassium nitrate and calcium carbide at the time of the blasts, according to the police.\nA team from the International Atomic Energy Agency's Beijing environmental emergency response centre, as well as 214 Chinese military nuclear and biochemical materials specialists, had gone to Tianjin, the official Xinhua news agency said.\nSeveral thousand residents were moved to 10 nearby schools after apartment buildings and homes were damaged, mainly by shockwaves from the explosions, it said. Two fires were still burning late on Thursday.\nVast areas of the port were devastated, crumpled shipping containers were thrown around like match sticks, thousands of new cars were torched and port buildings reduced to burnt-out shells, Reuters witnesses said.\nForeign companies from across the globe were trying to determine the damage to their facilities in and around the port, a gateway to northeast China.\nThe Nikkei newspaper said windows were broken at Toyota Motor Corp's passenger vehicle assembly plant but no one was hurt. It said numerous other Japanese companies sustained minor damage to their operations.\nFrench carmaker Renault said more than 1,000 of its cars were damaged but no staff were hurt. Around 4,000 cars belonging to Hyundai Motor Co were at the site but damage had not yet been assessed, a spokesman said.\nMining giant BHP Billiton said its port operations and shipments were disrupted but its iron ore discharging berth had not been damaged.\nOil tanker arrivals and departures were also disrupted.\nJohn Deere & Co, the U.S. farm and construction equipment maker, said several workers who were at home at the time were injured, some critically.\nPACKAGING \"SUB-STANDARD\"\nXinhua identified the owner of the warehouse as Tianjin Dongjiang Port Ruihai International Logistics. The state-backed China Daily newspaper said its manager had been detained.\nThe Tianjin Maritime Safety Administration said the company violated packaging standards during a safety inspection two years ago.\nOf 4,325 containers that were checked, five failed the inspection because packaging was sub-standard, according to a report posted on the administration's website in January 2014.\nThe company's website said it was a government-approved firm specialising in handling \"dangerous goods\". Phone numbers listed on its website were disconnected and an email to the company went unanswered.\nPresident Xi Jinping said those responsible should be \"severely handled\".\nTianjin city officials had met recently with companies to discuss tightening safety standards on the handling of dangerous chemicals, authorities said.\nIndustrial accidents are not uncommon in China following three decades of breakneck economic growth. A blast at an auto parts factory in eastern China killed 75 people a year ago when a room filled with metal dust exploded.\nWednesday's blasts, which came roughly 30 seconds apart, sent shockwaves through apartment blocks kilometres away in the port city of 15 million people. Internet videos showed fireballs shooting into the sky.\nXinhua said several containers had caught fire beforehand.\nThe state-run Beijing News earlier cited Tianjin fire authorities as saying they had lost contact with 36 firefighters. By late afternoon, Xinhua reported 18 were missing, while 66 were among the hundreds of people being treated in nearby hospitals.\nAnxious residents rushed to hospitals to seek news about injured loved ones. Dozens of police guarded the entrance of the TEDA hospital, a Reuters witness said.\nThe blasts shattered windows in buildings and cars and knocked down walls in a 2-km radius around the site.\n(Additional reporting by Joseph Campbell in TIANJIN, Kazunori Takada, Chen Yixin, Brenda Goh and Sue-Lin Wong in SHANGHAI, Michael Martina, Jason Subler , Megha Rajagopalan and Judy Hua in BEIJING and Meredith Davis in CHICAGO; Writing by Dean Yates ; Editing by Raju Gopalakrishnan and Paul Tait)", "external_links": [], "published": "2015-08-14T04:38:00.000+03:00", "crawled": "2015-08-14T04:05:08.368+03:00", "highlightTitle": ""}