{"organizations": [], "uuid": "927f17fb034c5d63d10e0151cfa629c001aba1af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/17/markets-japan-stocks-idUSL3N10S1CI20150817", "country": "US", "title": "Nikkei rises after GDP contraction not as bad as expected", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Nikkei rises after GDP contraction not as bad as expected | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T06:05:00.000+03:00", "replies_count": 0, "uuid": "927f17fb034c5d63d10e0151cfa629c001aba1af"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/17/markets-japan-stocks-idUSL3N10S1CI20150817", "ord_in_thread": 0, "title": "Nikkei rises after GDP contraction not as bad as expected", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Investors shy away from cyclical shares due to China risk - analysts\n* Market relieved that Japan GDP slump not as bad as expected\nBy Ayai Tomisawa\nTOKYO, Aug 17 (Reuters) - Japanese stocks rose on Monday morning on relief the contraction in the world's third-largest economy was not as bad as the market had expected.\nThe Nikkei share average gained 0.6 percent to 20,650.93 in midmorning trade after falling 0.9 percent last week.\nJapan's economy shrank at an annualised pace of 1.6 percent in April-June as exports slumped and consumers cut back on spending. But the GDP contraction was shallower than a median market forecast of a 1.9 percent fall.\n\"There are concerns about consumption, but there are also slight expectations that the government may launch further economic support measures and today's market gains reflect that,\" said Hikaru Sato, senior technical analyst at Daiwa Securities.\nAnalysts say that China's economic slowdown and its impact on its Asian neighbours have also heightened the chance that any rebound in growth in July-September will be modest.\nLast week, global markets, including Japan, were rattled after China devalued its currency.\n\"Volatility in the market seemed to have settled for now, but in the long-term, risks that Beijing may launch another surprising action may cap further gains,\" said Norihiro Fujito, senior investment strategist at Mitsubishi UFJ Morgan Stanley Securities.\nInvestors seemed to shy away from global cyclical shares and shifted to domestic-demand sensitive firms.\nFinancials led the gains on Monday, with insurers advancing 2.5 percent and banks rising 1.2 percent. Sompo Japan Nipponkoa Holdings jumped 3.0 percent and Dai-ichi Life Insurance Co surged 2.2 percent.\nSumitomo Mitsui Financial Group rose 1.5 percent.\nKikkoman Corp soared 3.5 percent after SMBC Nikko Securities hiked its target price to 3,600 yen from 2,970 yen, citing strong sales of soy milk products in the domestic market and lower marketing fees.\nThe broader Topix gained 0.7 percent to 1,675.30 and the JPX-Nikkei Index 400 also advanced 0.7 percent to 15,099.34. (Editing by Shri Navaratnam)", "external_links": [], "published": "2015-08-17T06:05:00.000+03:00", "crawled": "2015-08-17T05:39:04.743+03:00", "highlightTitle": ""}