{"organizations": [], "uuid": "19714f6571d886597534c879fed5d709b14ea5b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/2/k/1/w/y/image.related.afrArticleLead.620x365.gj2cs6.png/1439983106337.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/street-talk/koch-grinding-numbers-on-arriums-molycop-20150819-gj2cs6", "country": "AU", "title": "Koch grinding numbers on Arrium's Moly-Cop", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Koch grinding numbers on Arrium's Moly-Cop | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T22:15:00.000+03:00", "replies_count": 0, "uuid": "19714f6571d886597534c879fed5d709b14ea5b6"}, "author": "afr.com", "url": "http://www.afr.com/street-talk/koch-grinding-numbers-on-arriums-molycop-20150819-gj2cs6", "ord_in_thread": 0, "title": "Koch grinding numbers on Arrium's Moly-Cop", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Arrium chief executive Andrew Roberts has kicked off a process to assess interest in its Moly-Cop division. Sahlan Hayes by Sarah Thompson Anthony Macdonald Jake Mitchell Koch Industries is one of several international trade buyers looking at Arrium's Moly-Cop division, as the mining services company prepares to kick off the potential $2 billion sale process.\nUnited States-based Koch knows the local market after teaming up with Pacific Equity Parties in a tilt for another embattled mining services group, Bradken. Other international trade buyers that are expected to look at the Moly-Cop mining consumables business include Brazilian steel giant Gerdau, Scandinavians Metso and FLSmidth and South Korean group POSCO.\nThen there are the big private equity firms Blackstone, KKR and The Carlyle Group.\nStreet Talk understands sale documents are due to hit the desks of interested parties this week.\nArrium said at its full-year result on Wednesday it had received significant interest in Moly-Cop and had decided to commence a process to \"understand the nature and level of this interest in order to make an assessment of whether a transaction would be in the interests of shareholders.\"\nMoly-Cop recorded full-year earnings before interest, tax, depreciation and amortisation of $211 million. Acquisitions of comparable businesses over the last five years have been completed on an average multiple of 11.2 times EBITDA, while Arrium picked up Moly-Cop for 9.3 times in 2010.\nIt's a difficult deal for the locals, given Moly-Cop's operations are in Latin America, and the Australian mining services industry is on its knees amid weak commodity prices.\nKKR might have trouble getting its head around another foray into the industry, after its troubled BIS Industries investment.\n Another potential deal-breaker could be acquisition financing. PEP withdrew a previous $5.10 a share offer for Bradken in January after struggling to get the financing to stack up in the weak commodity price environment.\nArrium's lenders are following the Moly-Cop process closely, as the company battles with its $1.75 billion debt pile.\nStreet Talk revealed two of Arrium's big four bank lenders sounded out distressed debt funds about selling their exposure to the company in June.", "external_links": [], "published": "2015-08-19T22:15:00.000+03:00", "crawled": "2015-08-19T20:16:56.196+03:00", "highlightTitle": ""}