{"organizations": ["Revelstoke Equity Inc", "ET Revelstoke Equity Inc"], "uuid": "b0137c7c5b5d7649a47133438e99d114940613db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "", "site_section": "http://www.marketwire.com/rss/mwFSPF.xml", "section_title": "Marketwired - Personal Finance", "url": "http://www.marketwired.com/press-release/revelstoke-equity-inc-completes-initial-public-offering-2047348.htm", "country": "CA", "title": "Revelstoke Equity Inc. Completes Initial Public Offering", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "Revelstoke Equity Inc. Completes Initial Public Offering", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T00:54:00.000+03:00", "replies_count": 0, "uuid": "b0137c7c5b5d7649a47133438e99d114940613db"}, "author": "", "url": "http://www.marketwired.com/press-release/revelstoke-equity-inc-completes-initial-public-offering-2047348.htm", "ord_in_thread": 0, "title": "Revelstoke Equity Inc. Completes Initial Public Offering", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 12, 2015 17:54 ET Revelstoke Equity Inc. Completes Initial Public Offering \nTORONTO, ONTARIO--(Marketwired - Aug. 12, 2015) - \nNOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES \nRevelstoke Equity Inc. (the \" Corporation \") is pleased to announce that it has successfully completed its initial public offering (the \" Offering \") of 3,289,300 common shares (the \" Common Shares \") at a price of $0.20 per share for gross proceeds of $657,860.00 with Hampton Securities Limited (\" Hampton \"), as agent. As a result of this issuance, the Corporation now has 4,289,300 Common Shares issued and outstanding. \nIn connection with the Offering, the Corporation granted a warrant to Hampton to acquire an aggregate of 328,930 Common Shares (the \" Agent's Warrant \") at an exercise price of $0.20 per Common Share. The Agent's Warrant will expire 24 months from the date the Common Shares are listed on the TSX Venture Exchange (the \" Exchange \"). Hampton also received a cash commission equal to 10% of the gross proceeds of the Offering and a corporate finance fee. \nThe Corporation has also granted options to acquire an aggregate of 428,930 Common Shares at an exercise price of $0.20 per option to the directors and officers of the Corporation, which expire 10 years from the date of grant. \nThe Corporation is a capital pool company under the policies of the Exchange. The Corporation now intends to make submission to the Exchange for final listing approval and it is expected that the Common Shares will commence trading on the Exchange under the trading symbol \" REQ.P \". \nInvestors are cautioned that trading in the securities of a capital pool company should be considered highly speculative. \nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. \nThis news release does not constitute an offer to sell or a solicitation of an offer to sell any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the \"U.S. Securities Act\") or any state securities laws and may not be offered or sold within the United States or to U.S. Personsunlessregistered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available. Contact Information", "external_links": [], "published": "2015-08-13T00:54:00.000+03:00", "crawled": "2015-08-13T01:20:26.585+03:00", "highlightTitle": ""}