{"organizations": ["Hollywood Boy Comes Home"], "uuid": "a3abc70e186a852f98df6a1c74f1394fd14abc9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508010217.html", "country": "US", "title": "Zimbabwe: China Following Path to Economic Ruin", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: China Following Path to Economic Ruin", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T12:32:00.000+03:00", "replies_count": 0, "uuid": "a3abc70e186a852f98df6a1c74f1394fd14abc9e"}, "author": "", "url": "http://allafrica.com/stories/201508010217.html", "ord_in_thread": 0, "title": "Zimbabwe: China Following Path to Economic Ruin", "locations": ["China", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Hollywood Boy Comes Home \nHow terrified is it? Consider its reaction to the recent sharp fall in the two main Chinese stock markets. \nChina has a capitalist economy, albeit a highly distorted one, and stock markets are a normal part of such economies. They go up, they go down, and normally governments do not intervene in the process. \nThe Chinese stock markets have recently been on a roller-coaster ride. \nAfter treading water for years, prices exploded in June 2014. During the next year, there was a 150% average rise in prices on the Shanghai Composite exchange, and almost 200% on the Shenzhen. \nObviously this was not sustainable, especially since growth in the real economy has been falling for years. A correction was inevitable. \nIt came with a bang, on June 12. Since then prices have fallen 30% on the Shanghai market, 40% on the Shenzhen. Around US$4 trillion US in paper values have been wiped out. \nBut Chinese stock prices are still far higher than they were a year ago. Indeed, at an average of 20 times earnings, they are still overvalued by real-world standards. \nWhy would any government intervene over this? \nSome investors will win, others will lose, and it will all work itself out. \nBut the Chinese government intervened in a very big way. First it cut interest rates to the lowest level ever. When that didn't stop the slide in prices, it banned large investors (holding more than 5% of a listed company's shares) and all foreign investors from selling their shares for six months. \nIt encouraged about 1 300 Chinese companies -- half the stock market -- to suspend trading in their stocks. It forbade any new listings on the markets. It even ordered a state-backed finance company to make new loans to people who want to make bigger bets on the stock market than they can afford. \nAnything and everything to stop the prices from falling. And, lo, they did stop. Last week, prices even rose a bit. \nThis may just be what traders call a \"dead cat bounce\" -- if the price falls from high enough, there is bound to be a little bit of a bounce at the bottom -- but that is mainly of interest to Chinese investors. \nThe interesting question for the rest of us is: why did the Chinese Communist regime do all this? \nThere are 90 million private investors in the Chinese stock markets. They tend to be older, two-thirds of them didn't finish high school, they have been betting their savings on the market and, according to state media they have lost on average 420 000 yuan (US$67 000) in the past six weeks. \nThat would be no problem if you were already in the market a year ago: you would still be well into the black. But a great many of the private investors piled in very late in the game. \nTwelve million new accounts were opened as recently as last May and they have already lost their shirts. They would have lost their skirts and trousers too if the government did not stop the collapse in prices. \nSo the regime intervened. This may be because the Chinese Communist Party loves the citizens so much it cannot bear to see them lose. It is more likely because it is frightened that those tens of millions of stock-market losers (who were officially encouraged to invest) will start protesting in the streets. \nWhether the Chinese regime's power is secure or not, it certainly does not feel secure. \nThis latest government action is part of a pattern that extends back to the global bank crisis of 2008, after which China was the only major country to avoid a recession. It did so by flooding the economy with cheap money. Few people lost their jobs, but the artificial investment boom created a bubble in the housing market that now is starting to deflate. Millions of properties lie empty and millions of mortgages are \"under water\". \nSooner or later, this game is going to run out of road. The risk is that China's road ends where Japan's 30 years of high-speed growth ended in the late 1980s, with a collapse to 2% growth or less and a quarter-century of economic stagnation. \nChina is around the 30-year point now, and its regime is doing all the same things that the Japanese government did just before the collapse there. \nDyer is a London-based independent journalist. Zimbabwe \nMotorists will pay at least 15 cents in urban toll fees when the exercise is implemented, compared to $2 that private … see more » Copyright © 2015 Zimbabwe Independent. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-01T12:32:00.000+03:00", "crawled": "2015-08-01T14:28:54.031+03:00", "highlightTitle": ""}