{"organizations": [], "uuid": "492815ff705772b2eee7a34a85a5aa860d32cb54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/companies/ngos-acting-at-behest-of-foreign-tobacco-firms-itc-chief-y-c-deveshwar/111666", "country": "IE", "title": "‘NGOs’ acting at behest of foreign tobacco firms: ITC chief Y C Deveshwar", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "‘NGOs’ acting at behest of foreign tobacco firms: ITC chief Y C Deveshwar | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T04:34:00.000+03:00", "replies_count": 0, "uuid": "492815ff705772b2eee7a34a85a5aa860d32cb54"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/companies/ngos-acting-at-behest-of-foreign-tobacco-firms-itc-chief-y-c-deveshwar/111666", "ord_in_thread": 0, "title": "‘NGOs’ acting at behest of foreign tobacco firms: ITC chief Y C Deveshwar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles BBPOS Unveils Best-in-Class Chipper 2X Scheduled for Q3 2015 Debut IT Minister of Telangana, K T Rama Rao, to launch Techwave Consulting Inc's Global Delivery Center at an investment of USD 5 mn StarTimes Entrusts SES Platform Services to Deliver TV Content across Sub-Saharan Africa As its core tobacco business faces pressure, ITC chief Y C Deveshwar today accused some ‘NGOs’ of acting as agents of foreign firms and helping them smuggle international cigarette brands ‘duty-free’ while steep taxes are hurting the domestic industry.\nAddressing diversified group’s annual general meeting here today, ITC’s Chairman Y C Deveshwar said if cigarettes were harmful, then why the product was being sold in airport duty-free shops.\n“Unprecedented pressure on the legal cigarette industry with imposition of steep taxes has led to consumption being diverted to tax-evaded as well as smuggled products,” he said.\nKolkata-headquartered company’s revenue from cigarettes dropped by 1.22 per cent to Rs 4,149.61 crore in the first quarter ended June 30, as against Rs 4,201.06 crore year-ago.\nFor the year ended March 31, ITC’s consolidated revenue from cigarettes stood at Rs 17,765.99 crore compared with Rs 16,368.46 crore, up 8.53 per cent.\nAt the AGM Deveshwar said, the wide proliferation of illegal cigarettes has deprived the exchequer of significant revenue, eroded income of Indian farmers and threatened livelihood of many engaged in the supply chain by driving the trade into unscrupulous hands and creating a large unaccounted flow of foreign exchange out of the country.\nReferring to the cigarettes business, he said the regulatory environment was not entirely rational.\n“We are continuously engaging with governments, both at the central and state levels, and hopefully there will some rationality next year,” he added.\nLashing out at the anti-tobacco lobby, Deveshwar said: “I wonder some NGOs are acting as agents of overseas cigarette companies helping smuggling of cigarettes into the country.”\nIn this year’s Budget, Finance Minister Arun Jaitley had increased excise duty by 25 per cent for cigarettes of length not exceeding 65 mm and by 15 per cent for cigarettes of other lengths. Moreover, excise duty on cut tobacco was also increased to Rs 70 per kg from Rs 60 per kg earlier.\n 31, 2015 8:34 pm", "external_links": [], "published": "2015-08-01T04:34:00.000+03:00", "crawled": "2015-08-01T04:16:24.186+03:00", "highlightTitle": ""}