{"organizations": ["Genworth Financial", "National Housing Bank", "IMGC", "ICICI Bank", "Asian Development Bank", "International Finance Corporation"], "uuid": "9b4607c1a72b273abcec7b57f668e119e523859d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48691999,width-600,resizemode-4/icici-bnk-bccl.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358319.cms", "section_title": "Banking-Banking/Finance-Industry-The Economic Times", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/icici-ties-up-with-imgc-to-offer-a-mortgage-guaranteed-home-loan-product/articleshow/48691964.cms", "country": "IL", "title": "ICICI ties up with IMGC to offer a mortgage-guaranteed home loan product", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "ICICI ties up with IMGC to offer a mortgage-guaranteed home loan product", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T07:49:00.000+03:00", "replies_count": 0, "uuid": "9b4607c1a72b273abcec7b57f668e119e523859d"}, "author": "", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/icici-ties-up-with-imgc-to-offer-a-mortgage-guaranteed-home-loan-product/articleshow/48691964.cms", "ord_in_thread": 0, "title": "ICICI ties up with IMGC to offer a mortgage-guaranteed home loan product", "locations": ["MUMBAI", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chanda Kochhar", "Rajeev Sabharwal"], "text": "  MUMBAI: ICICI Bank, India's second largest lender, has tied up with Indian Mortgage Guarantee Company (IMGC) to offer a mortgage-guaranteed home loan product that will enable individuals to borrow more by way of home loans and take a longer tenure loan than they are otherwise eligible for. The borrowers will have to pay a one-time premium of about 1-2 per cent of the loan's amount and depending on their age, salary , the margin that they can offer and type of occupation. In the event of pre-payment of the loan, the borrower will have to forego the premium. Under the new product, 'Extraa Home Loans', the bank will target middle-aged individuals in the affordable housing segment. Borrowers can avail themselves of a loan up Rs 75 lakh till the to age of 67. The interest rate and other terms of the loan under this product will be on a par with the bank's existing home loan rate. The product enables the borrower ables the borrower to increase the loan amount by 20 per cent without significantly changing the EMI (equated monthly instalment) which will be covered by IMGC. ICICI Bank is the first bank to tie up with IMGC, a joint venture between the National Housing Bank, Genworth Financial, International Finance Corporation and Asian Development Bank. IMGC will cover the first loss to ICICI Bank for the amount of loan that is guaranteed. \"It will give higher eligibility, enabling purchase of bigger house,\" said Chanda Kochhar , managing director and CEO of ICICI Bank. \"India will need an additional 11 crore housing units by 2022. This scheme, which is India's first mortgage-guaranteed home loans, will help us expand the concept of eligibility of people as far as home loans are concerned,\" she said. Rajeev Sabharwal, executive director of ICICI Bank, said the product is aimed at people in the 35-45 years age group who are striving to buy a house but are not able to get loan for a sufficiently long tenure due to the retirement age.  ", "external_links": [], "published": "2015-08-27T07:49:00.000+03:00", "crawled": "2015-08-27T08:01:15.144+03:00", "highlightTitle": ""}