{"organizations": [], "uuid": "9477b2f5810c4a4c35dd5a1ce2b4ed56d6c4769d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/greece-makes-debt-repayment-minister-110205019.html", "country": "GB", "title": "Greece makes debt repayment, minister calls for snap polls", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Greece makes debt repayment, minister calls for snap polls", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T14:02:00.000+03:00", "replies_count": 0, "uuid": "9477b2f5810c4a4c35dd5a1ce2b4ed56d6c4769d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/greece-makes-debt-repayment-minister-110205019.html", "ord_in_thread": 0, "title": "Greece makes debt repayment, minister calls for snap polls", "locations": ["Greece"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 20, 2015, 12:09 BST - UK Markets close in 4 hrs 21 mins Greece makes debt repayment, minister calls for snap polls Reuters – 7 minutes ago Print \nBy George Georgiopoulos \nATHENS (Reuters) - Greece made a crucial 3.2 billion euro debt repayment on Thursday using newly released bailout funds, a government source said, as a senior minister argued for rapid elections following a rebellion in the ruling party. \nThe repayment to the European Central Bank marked another step for Greece away from near financial collapse, but Prime Minister Alexis Tsipras must now tackle a political crisis after anti-bailout rebels robbed his government of its parliamentary majority. \nAthens repaid the debt using money from the first instalment of its new bailout after the programme cleared its final hurdle on Wednesday night, with the ESM European bailout fund approving the 86 billion euro ($96 billion) deal. \n\"The payment was made, the funds are on their way,\" the official told Reuters. \nGreece came close to the economic abyss and exit from the euro zone in late June as Tsipras tried to extract concessions which the bloc's finance ministers refused to grant. \nTsipras backed down last month, accepting terms that are so onerous that the hard left wing of his Syriza party refused to back the bailout in parliament last Friday, and is threatening to break away. \nEnergy Minister Panos Skourletis, a close Tsipras adviser, said the split had to be dealt with. \"The political landscape must clear up. We need to know whether the government has or does not have a majority,\" he told state TV channel ERT. \nTsipras got the bailout through parliament only with the support of opposition parties, who said they did so merely to save the nation from financial ruin. \nThe prime minister has talked about calling a Syriza congress to resolve differences with the rebels. But, expressing his personal opinion, Skourletis said Tsipras should move faster. \"I would say elections first, then the party congress,\" he said. \nThe government had to close the banks at the end of June for three weeks as panicking savers pulled out billions, and imposed capital controls strictly limiting withdrawals from the banking system. While these have since been eased, they remain in force, hurting businesses and raising the risk that unemployment will rise from its current 25 percent. \nTsipras, who came to power only in January, has remained silent over the election issue. But his ministers have openly debated the pros and cons of an early election - which would be the third in as many years - following the party split. \nTSIPRAS WEIGHS HIS OPTIONS \nTsipras is weighing at least two options. One is to call elections in September before voters start feeling the new bailout measures including further pension cuts, more value-added tax increases and a \"solidarity\" tax on incomes. \nKnock-on effects of the capital controls, which are likely to stay until Greek banks are recapitalised later this year with bailout funds, will also hurt voters. \nThe other option is to delay the vote till October, after international creditors have reviewed Greece's performance in keeping to the bailout programme. They will then start to consider some way of easing the country's huge debt burden. \nTsipras has long argued that Greece will never be able to repay all its debts and wants some to be written off. While the euro zone favours merely delaying interest and principal repayments, Tsipras could still present any debt relief moves as an achievement to the electorate. \nA Metron Analysis poll on July 24 put support for Syriza at 33.6 percent, making it by far the most popular party, but not enough to govern without a coalition partner, as it does now. No polls have been published since then due to the holiday season. \nSyriza members have argued that the party should aim for a majority, saying this would achieve the stable government which Greece has lacked through the past five years of crisis. \n\"These elections, whenever they are announced by the government, will provide a stable governing solution. My feeling is that Syriza will have an absolute majority,\" Dimitris Papadimoulis, a Syriza lawmaker in the European parliament, told Mega TV. \n($1 = 0.8990 euros)", "external_links": [], "published": "2015-08-20T14:02:00.000+03:00", "crawled": "2015-08-20T14:20:07.991+03:00", "highlightTitle": ""}