{"organizations": [], "uuid": "a7e13e69c12c7233111429056e2bdcc283d6bc7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/z/v/t/o/u/image.related.afrArticleLead.620x365.gj8zs6.png/1440659343543.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/politicians-urged-to-end-21b-super-fees-gouge-20150827-gj8zs6", "country": "AU", "title": "Politicians urged to end $21b super fees 'gouge'", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Politicians urged to end $21b super fees 'gouge' | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T15:09:00.000+03:00", "replies_count": 0, "uuid": "a7e13e69c12c7233111429056e2bdcc283d6bc7c"}, "author": "Post to Linkedin", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/politicians-urged-to-end-21b-super-fees-gouge-20150827-gj8zs6", "ord_in_thread": 0, "title": "Politicians urged to end $21b super fees 'gouge'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "National Seniors Australia chief executive Michael O'Neill says super fees are too high. Alex Ellinghausen by Joanna Mather Both main parties need to devise c policies to prevent the fees charged by superannuation funds carving large chunks out of people's retirement savings, National Seniors Australia says.\nWednesday's National Reform Summit heard that fees associated with super accounts cost Australians $21 billion a year, the equivalent of half the national age pension bill.\nNational Seniors chief executive Michael O'Neill said he was astonished by the figure and, if it did not come down, a future government might have to ask the regulator to step in.\n\"Whether you are an industry fund or retail fund the message is pretty strong: it's a retirement income, it needs not to be gouged by fees and charges,\" he said.\nJohn Daley, of the Gratan Institute, says there is insufficient competition in the super sector to drive down fees. Louie Douvis \"I wouldn't advocate [prescribing fees] but I think that's the bottom line. If you can't reduce the charges it maybe does require intervention by the regulator.\"\nIndependent researcher SuperRatings said the average annual fee for a fund with a $50,000 balance was $664. The average for somebody with $50,000 invested with a non-profit fund was $484, rising to $851 for funds such as those owned by banks.\nGrattan Institute chief executive John Daley, who raised the $21 billion figure, said there was insufficient competition in the sector to drive down fees.\nGrattan has put forward a plan to save up to $5 billion in fees. It involves a tender process to select a series of no-frills super products that could set quality and price benchmarks.\n \"When you talk about taking $5 billion a year out of fees and charges that's essentially productivity reform,\" Mr Daley said on Thursday.\n\"That's about a third of a per cent of GDP. There's not a lot of other reforms we could look at that would deliver that kind of return.\"\nThe session of the summit that considered retirement incomes urged the government to establish an overarching purpose for the superannuation system.\nPaul Howes, the former union boss who now heads KPMG's wealth management advisory group, said the purpose of super should be written into law.\n\"To have that overarching objective enshrined about providing secure and sustainable retirement incomes will shift the focus of the sector from accumulation to retirement phase,\" he said.\n\"If you had to point out one single initiative of the summit, that, we believe, is the most important.\"\nShadow treasurer Chris Bowen has offered to work with the government to devise a bipartisan objective for super.\nKMPG sponsored the summit, alongside The Australian Financial Review and The Australian .\nMr Howes said another key outcome of the summit was an agreement to pay particular attention to super for women and contractors, who typically ended their working lives with fewer savings.\n\"This is a really important issue for the nation to resolve. I think everyone acknowledges the problem but the solution is far harder to gain.\"\nThe government's paid parental leave scheme does not include a super component.", "external_links": [], "published": "2015-08-27T15:09:00.000+03:00", "crawled": "2015-08-27T11:49:09.516+03:00", "highlightTitle": ""}