{"organizations": [], "uuid": "bf2cadb0352abfbdc6988828fe08be8dd848cf97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DN319_asiama_ZG_20150604071332.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/chinese-stocks-set-for-best-day-in-a-month-2015-08-10", "country": "US", "title": "Chinese stocks score biggest one-day gain in a month", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "Chinese stocks score biggest one-day gain in a month - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T03:00:00.000+03:00", "replies_count": 2, "uuid": "c713fcae1b16c4c0a74311a7f85f44e5772995ab"}, "author": "By     Chao Deng", "url": "http://www.marketwatch.com/story/chinese-stocks-set-for-best-day-in-a-month-2015-08-10#post-0", "ord_in_thread": 0, "title": "Chinese stocks score biggest one-day gain in a month", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stocks in China on Monday posted their biggest one-day gain in a month on expectations Beijing will maintain its market support by buying shares.\nThe Shanghai Composite Index SHCOMP, +4.92% finished 4.9% higher at 3,928.42, while the smaller Shenzhen Composite 399106, +4.49% was up 4.5% to 2,274.84.\nThe gains come after poor economic data from the weekend encouraged hopes that the government would keep adding to its buying streak over the past month to prop up shares.\n“People are taking a contrarian view” to the data, said Gerry Alfonso, director of trading at Shenwan Hongyuan Securities in Shanghai. He noted that the market moved up throughout the day, suggesting that investors were buying in anticipation of government funds coming in the afternoon. “The buying was pretty broad,” which could imply that investors believe authorities will support the market broadly as well, he said.\nRegulators didn’t announce fresh measures to support the market Monday, although analysts estimate the government funds have bought hundreds of billions of yuan worth of shares to stabilize its performance. Last week China’s stock regulator began to crack down on short selling, which helped send Shanghai up more than 2% for the week.\nStill analysts believe the main benchmark faces pressure at the 4,000 level, with investors eager to take profits on quick rises. The index has traded between 3,500 and 4,000 since July 28. It reached a seven-plus year peak of 5166.35 on June 12, before a massive selloff that wiped out nearly a third of the market’s value.\n“The regulator has too much space to change and interpret rules, which makes this an abnormal market,” said Zhang Xin, an analyst at Guotai Junan Securities.\nOn Friday, China’s securities regulator said it has called on the nation’s securities brokers and fund managers to help stabilize the stock market, which is roughly a quarter off its mid-June peak.\nIn meetings with officials from the securities industry, a senior official with the China Securities Regulatory Commission also called for stepped-up supervision over margin trading in an effort to limit market risk, the regulator said. Margin trading, which allows investors to buy shares with borrowed funds, has been a factor in China’s huge stock-market run-up and subsequent dramatic drop.\nDisappointing trade and factory-price data from China over the weekend pressured shares in Hong Kong, where the Hang Seng Index HSI, -0.13% fell 0.1% to 24,521.12.\nExports in July slid 8.3% from a year earlier, reversing a gain of 2.8% in June, and imports fell for the ninth month in a row, dropping 8.1%, after a decline of 6.1% in June. The government also announced factory prices in July extended more than three years of declines, with the producer-price index taking its biggest year-over-year tumble in nearly six years.\nA number of Chinese shipping companies are halted from trading Monday, with analysts expecting potential consolidation by the state of the country’s massive shipping sector. Those firms include the Hong Kong- and Shanghai-listed units of state-owned China Ocean Shipping Co. and China Shipping Group, including China Cosco Holdings Co. 1919, +13.56% , Cosco Pacific Ltd. 1199, +1.80% , Cosco International Holdings Ltd. 0517, +0.90% , China Shipping Container Lines Co. 2866, +23.90% and China Shipping Development Co. 1138, +12.50%\nElsewhere in Asia, shares pared earlier losses, after a solid U.S. jobs report Friday increased confidence the Federal Reserve could raise short-term interest rates as soon as next month. The central bank’s low-rate policy has helped drive a six-year stock rally.\nJapan’s Nikkei Stock Average NIK, +0.41% rose 0.1%, and Australia’s S&P ASX 200 XJO, +0.63% gained 0.4%, bouncing from a 3.9% fall last week.\nThe Japanese yen weakened Monday, with the U.S. dollar USDJPY, +0.41% last at 124.49 Japanese yen, from ¥124.21 late Friday in Asia. The U.S. dollar had strengthened immediately after the jobs report before investors booked profits on its recent gains, pushing the currency lower.\nThe Malaysian ringgit is trading near 17-year lows, adding pressure to its central bank as foreign-currency reserves fall. The currency USDMYR, +0.4435% traded as high as 3.93 against the U.S. dollar, compared with 3.92 late Friday in Asia.\nSouth Korea’s Kospi SEU, -0.35% lost 0.4%.\nMore from MarketWatch", "external_links": [], "published": "2015-08-10T03:00:00.000+03:00", "crawled": "2015-08-10T12:54:06.329+03:00", "highlightTitle": ""}