{"organizations": [], "uuid": "0b4c0d97068f8a98c57a344f3cc992db3e49822f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-10/municipal-sales-set-to-rise-redemptions-fall-kansas-sells-1b", "country": "US", "title": "Municipal Sales Set to Rise, Redemptions Fall; Kansas Sells $1B", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Municipal Sales Set to Rise, Redemptions Fall; Kansas Sells $1B - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T19:49:00.000+03:00", "replies_count": 0, "uuid": "0b4c0d97068f8a98c57a344f3cc992db3e49822f"}, "author": "Kenneth Kohn", "url": "http://www.bloomberg.com/news/articles/2015-08-10/municipal-sales-set-to-rise-redemptions-fall-kansas-sells-1b", "ord_in_thread": 0, "title": "Municipal Sales Set to Rise, Redemptions Fall; Kansas Sells $1B", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Municipal bond sales in the U.S. are set to increase in the next month while the amount of redemptions and maturing debt falls.\nStates and localities plan to issue $10.1 billion of bonds over the next 30 days, according to data compiled by Bloomberg. A week ago, the calendar showed $8.6 billion planned for the coming month. Supply figures exclude derivatives and variable-rate debt. Some municipalities set their deals less than a month before borrowing.\nKansas State Development Finance Authority plans to sell $1.01 billion of bonds, New York State Convention Center Development Corp. has scheduled $640 million, Charlotte, North Carolina Water and Sewer System will offer $463 million and District of Columbia Hospital will bring $382 million to market.\nMunicipalities have announced $11.4 billion of redemptions and an additional $18.1 billion of debt matures in the next 30 days, compared with the $31.2 billion total that was scheduled a week ago.\nIssuers from Texas have the most debt coming due with $7.81 billion, followed by California at $2.07 billion and New Jersey with $910 million. Texas has the biggest amount of securities maturing, with $5.4 billion.\nThe $3.6 trillion municipal market shrank by 4 percent in 2014. This year, maturities are poised to drop 38 percent to $176 billion from the 2014 levels.\nInvestors removed $88 million from mutual funds that target municipal securities in the week ended July 29, compared with an increase of $250 million in the previous period, according to Investment Company Institute data compiled by Bloomberg.\nYield Ratios Exchange-traded funds that buy municipal debt increased by $72.4 million last week, boosting the value of the ETFs 0.42 percent to $17.2 billion.\nState and local debt maturing in 10 years now yields 106.083 percent of Treasuries, compared with 103.105 percent in the previous session and the 200-day moving average of 101.035 percent, Bloomberg data show.\nBonds of Michigan and Tennessee had the best performance over the past year compared with the average yield of AAA rated 10-year securities, the data shows. Yields on Michigan’s securities narrowed 3 basis points to 2.55 percent while Tennessee’s declined 2 basis points to 2.33 percent. Puerto Rico and Illinois handed investors the worst results. The yield gap on Puerto Rico bonds widened 129 to 11.05 percent and Illinois’s rose 31 basis points to 4.15 percent.\n\",\"byline\":\"Ken Kohn", "external_links": [], "published": "2015-08-10T19:49:00.000+03:00", "crawled": "2015-08-10T15:07:06.576+03:00", "highlightTitle": ""}