{"organizations": [], "uuid": "77ce7788d0c59eb0f3cae97431de79c4c26a506d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/17/markets-derivatives-china-idUSL1N10S13V20150817", "country": "US", "title": "Nerves mount over StanChart regulatory capital deal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Nerves mount over StanChart regulatory capital deal | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T20:48:00.000+03:00", "replies_count": 0, "uuid": "77ce7788d0c59eb0f3cae97431de79c4c26a506d"}, "author": "Mike Kentz", "url": "http://www.reuters.com/article/2015/08/17/markets-derivatives-china-idUSL1N10S13V20150817", "ord_in_thread": 0, "title": "Nerves mount over StanChart regulatory capital deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Aug 17 (IFR) - Standard Chartered may have completed its latest regulatory capital relief deal - a US$165m four-year synthetic securitisation of credit risk tied to a portfolio of trade finance receivables - in the nick of time. Although it yields a hefty 9.28%, the deal is heavily reliant on Chinese commodity demand and investors may be getting nervous after the People's Bank of China devalued the renminbi last week.\nThe underlying obligors in the SeaLane III transaction are largely Latin American commodity producers exporting to Asia, according to potential investors that passed on the deal because of concerns about China's growth story.\nThe deal closed on June 25 - just days before the Chinese government first intervened in domestic equity markets to stem an eventual 30% decline, ultimately culminating in last week's surprise currency action.\nThe pricing was tight at three-month Libor plus 900bp - tighter than the bank's previous iterations of the structure in 2007 and 2011.\nBut the devaluation could hurt the deal. The PBoC intervention raises further alarm bells about a slowing economy, which means reduced demand for commodities. And a weaker renminbi could further sap commodity demand, since most are denominated in US dollars and Chinese firms will have to pay more to import product.\nLower demand could mean more impairments, and more losses for investors. Those that passed on it said they could not stomach the China risk for precisely that reason.\n\"With the way things looked in China even back in June before the equity collapse, this just looked like too much bad risk for us,\" said one investor who passed on the deal.\nInvestors will lose out if losses on the tranche of trade finance receivables breach a 1% threshold. They then participate in losses up to 6.5%, at which point the risk reverts to the bank.\nThe appeal - aside from the hefty coupon - is the highly short-term nature of the underlying trade agreements. Expected losses on the tranche are only 50bp since \"it's hard for loans to go bad in such a short time period,\" according to the same investor.\nBut it is not the first time that China-related risk has threatened such a transaction. StanChart's last iteration of this structure - SeaLane II in 2011 - went bad for investors as a result of a 2014 metals warehousing scandal that forced the bank to set aside US$175m in impairment provisions.\nA StanChart spokesperson declined to comment on potential investor losses.\nWhether the renminbi devaluation represents that type of event remains to be seen, though some said it was not yet time for investors to panic.\n\"The deal itself is not rate-sensitive from an investor perspective as it's a dollar deal,\" said one banker familiar with the deal.\n\"The performance of the deal will only be positively or adversely impacted if loan impairments increase or decrease materially on the referenced entities. The outlook on that probably hasn't changed materially either way at this stage.\" BANK RELIEF\nThe off-loading of credit risk allows StanChart to post less collateral against that tranche of agreements and tap investor cash should impairments occur.\nThe deal represents a much smaller (5.5%) portion of a larger US$3bn trade finance portfolio, but following a tightening of Basel requirements around risk-weighted asset calculation and capital requirements, the relief could be crucial to keeping trade finance businesses afloat.\n\"Regulatory capital requirements for trade finance businesses are pretty draconian: the loss you have to assume is much larger than what the loss will most likely be in practice,\" said an investor specializing in credit risk transfer agreements.\n\"Even with guaranteeing such a high coupon, it can be more economical to structure this kind of deal than to let the assets sit on your book and tie up your liquid collateral.\"\nBankers say the new Basel requirements are spurring many other banks to structure deals, and the number of closed deals could increase as newer entrants become more accustomed to execution processes in the niche credit risk transfer market.\nA version of this story appears in the August 15 issue of IFR Magazine, a Thomson Reuters publication. (Reporting by Mike Kentz; Editing by Helen Bartholomew)", "external_links": [], "published": "2015-08-17T20:48:00.000+03:00", "crawled": "2015-08-17T19:55:47.138+03:00", "highlightTitle": ""}