{"organizations": [], "uuid": "ce34bfe85dd1a14ba6bc51d9d95665e834f239bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/u/z/i/a/image.related.thumbnail.320x214.gix2fp.png/1439346428401.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/why-cbas-profit-growth-is-slowing-20150811-gix2fp", "country": "AU", "title": "Why CBA's profit growth is slowing", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why CBA's profit growth is slowing | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T10:21:00.000+03:00", "replies_count": 0, "uuid": "ce34bfe85dd1a14ba6bc51d9d95665e834f239bf"}, "author": "Clancy Yeates", "url": "http://www.afr.com/business/banking-and-finance/why-cbas-profit-growth-is-slowing-20150811-gix2fp", "ord_in_thread": 0, "title": "Why CBA's profit growth is slowing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share on twitter Share on Google Plus by Clancy Yeates\nCommonwealth Bank rightly has a reputation as a profit-generating machine, but its latest $9.14 billion in earnings show the engine isn't running as smoothly as it has in the past.\nFor the first time since 2012, the bank's total profits fell in the second half of its financial year, with earnings slipping 2 per cent. Its annual growth over the financial year, at 5 per cent, is also the slowest in a few years.\nOne reason for the slowdown is the fact there were three calendar days less in the six months to June, meaning less time to charge interest. But more importantly, it reflects deeper challenges to the blockbuster profit growth banks have enjoyed.\nFierce competition to sign up home loan customers is crunching net interest margins - a gauge of of how much banks are paying for funds compared with what they are charging for loans.\nMargins have a critical influence on profits, and CBA's contracted by 5 basis points to 2.09 per cent in the year, due to lending competition and a need to hold more liquid assets.\nThe housing market is one of the few parts of the economy where there has been strong credit growth. So, banks have been fighting to win customers by offering bigger discounts on home loans, even though some of these were recently wound back.\nCBA cited this \"intense lending competition\" as one reason for the decline in profits at its flagship retail banking arm.\nThe division, which includes the bank's vast home loan business, posted a 6 per cent fall in its earnings during the second half, with interest income falling 1 per cent.\n The current record low interest rates are negative for bank profits because the banks' interest-earning assets, loans, are greater than their liabilities, or deposits. Plus they let people pay back their loans more quickly - which again means less interest income for banks.\nCBA's result also showed a slight rise in soured loans, which have been at historically low levels, boosting bank profits.\nThe bank said impaired loans were 0.17 per cent of its a share of its total portfolio in the second half, up from 0.14 per cent in the six months to December.\nThe lift in bad loans was mainly due to an increase in arrears in the consumer banking arm, especially personal loans, a trend CBA says reflects rising unemployment.\nNarrowing margins, fears or rising bad debts, and a perception that banks will need to raise capital have been some of the key reasons why some investors have fallen out of love bank shares in recent months. CBA's result, which also included plans to raise $5 billion from shareholders to meet tougher regulatory demands, confirmed these concerns were well-founded.\nInvestors are now assessing how banks respond to these pressures.\nWhile shareholders are wearing some of the pain through capital raisings, customers are also feeling an impact after the big four raised interest rates for property investors last month - a trend that analysts expect has further to run.", "external_links": ["https://plus.google.com/https://plus.google.com/u/0/117021518580315645042", "https://twitter.com/clancyyeates"], "published": "2015-08-12T10:21:00.000+03:00", "crawled": "2015-08-12T06:05:46.325+03:00", "highlightTitle": ""}