{"organizations": [], "uuid": "2224568a9b2c3e40701c748e617b21454c02fcb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/pankajamunde07815.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/pankaja-munde-ups-purchase-order-by-three-times-in-six-days/43054.html", "country": "IN", "title": "Pankaja Munde ups purchase order by three times in six days", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Pankaja Munde ups purchase order by three times in six days", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T16:41:00.000+03:00", "replies_count": 0, "uuid": "2224568a9b2c3e40701c748e617b21454c02fcb6"}, "author": "Vinita Deshmukh and Vijay Kumbhar", "url": "http://www.moneylife.in/article/pankaja-munde-ups-purchase-order-by-three-times-in-six-days/43054.html", "ord_in_thread": 0, "title": "Pankaja Munde ups purchase order by three times in six days", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Pankaja Munde ups purchase order by three times in six days 43054 Pankaja Munde ups purchase order by three times in six days 0 Comments, Be the first to comment Vinita Deshmukh and Vijay Kumbhar | 07/08/2015 07:11 PM | Pankaja Munde, Maharashtra Minister for Women and Child Welfare increased the order for child growth monitoring machines to Rs18 crore from Rs6 crore in just six days Under the Integrated Child Development Services (ICDS), successive governments in Maharashtra have allegedly misappropriated funds, partly allocated by the Centre, to unscrupulously buy child growth monitoring machines, by flouting procurement norms. Pankaja Munde, Minister for Women and Child Welfare, Maharashtra placed two separate orders for procurement of these growth-monitoring machines – once on 4 February 2015 for Rs6 crore and then suddenly increasing the order within 6 days – on 10 February 2015 to Rs18 crore. Two contractors, Sai Hi-Tech Products and Nitiraj Engineers Pvt Ltd, were awarded the contract (share of 50% each). Strangely, and scandalously, Nitiraj Engineers was literally gifted the contract, without the company even asking for it. What’s more, Sai Hi-Tech’s factory in Pune is untraceable and both Sai Hi-Tech as well as Nitiraj Engineers have given their postal address as State of Manipur, although the other details of the address pertain to Pune and Dhule! What is interesting is the same Nitiraj Engineers was awarded similar contract in 2011, which specially mentions \"transportation cost of the above (2,300) machines from Himachal Pradesh to Anganwadi at a rate of Rs200 per machine or Rs4.60 lakh\". So where exactly is Nitiraj Engineers located? Is it in Dhule in Maharashtra, Dhule in Manipur or Himachal Pradesh? On 4 February 2015, the Commissioner of Women and Child Welfare wrote to the Principal Secretary, stating that, “the WHO’s international Child Growth Standards are being implemented in the financial year 2014-2015 by supplying machines in 20 districts at 188 rural centres, 63 Adivasi centres and 66 urban slum centres. Thus, 7,852 machines would be required and each machine would cost Rs8,820. The procurement should be made from M/S Sai Hi-Tech Products, 365, Manjari Budruk, District Pune. The overall cost is Rs6,92,63,460.” Interestingly, in this communication, only Sai Hi-Tech’s letter dated 6 November 2014 was mentioned. ( Anne 48 ) There was no communication from Nitiraj industries, as per any available record, seeking any order from the government for supply of these machines. Even then, Pankaja Munde, the Minister, strangely and audaciously, awarded the contract to Sai Hi-Tech and Nitiraj Industries in equal proportion in another letter dated 13 February 2015.( Anne 48A ) But, the malpractice does not end here. Suddenly, and strangely, on 10 February 2015, the Commissioner of Women and Child Welfare appears to have realised that the department needs an additional 20,729 machines of the same specification. What prompted the Commissioner to again order for such a huge number of machines is not known. But something concocted between 4th and 10th February. Interestingly, in this letter also there is no reference to any communication from Nitiraj Engineers ( Anne49 ) .Even then the Minister issued one more order on 13 February 2015 of a whopping Rs18.37 crore contract, which was again equally distributed between Sai Hi-Tech and Nitiraj Engineers. ( Anne -49A ) Pankaja Munde, the daughter of Bharatiya Janata Party (BJP)’s deceased leader Gopinath Munde, has been in the eye of the storm for the Rs206 crore-chikki-scam. While giving Pankaja a clean chit, Maharashtra Chief Minister Devendra Fadnavis announced setting up of the three-member Committee headed by the present chief secretary to investigate the chikki-scam. Moneylife’s articles on this issue, Chikki moment: When the SCIC also keeps mum on RTI queries, Why Pankaja Munde cannot get away by saying sorry and After Chikki, now a biscuit scam! which went viral is but a tip of the iceberg of the scam. RTI activists have made documents of the biscuit scam public even as the CM and CIC are mum on the issue of putting them up in the public domain – mandatory under Section 4 of the RTI Act. As per the documents procured - on 12 February 2015, Munde ordered purchases of Ayurvedic biscuits worth Rs95.51 lakh. However, the very next day, that is on 13th February, the order was increased to Rs5 crore without any changes in the number of beneficiaries. We hope the Chief Secretary looks into the latest crucial documents on the purchase of child growth monitoring machines by flouting procurement norms, to understand why there is no question of giving Munde a clear chit and the criminality involved at the expense of health and nutrition of infants, children and pregnant mothers. In addition, the malpractice of procuring material does not end with just chikki, Ayurvedic biscuits or child growth monitoring machines. There is more, like handmade paper, steel plates, sprinkles, protein powder, books, and plastic mats. Hope the three-member Committee headed by the Chief Secretary also looks in to all these aspects as well.", "external_links": [], "published": "2015-08-07T16:41:00.000+03:00", "crawled": "2015-08-07T17:12:21.219+03:00", "highlightTitle": ""}