{"organizations": [], "uuid": "d5e1908e00ff20865534bcb053109f608f5a9b83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/v/e/o/r/image.related.afrArticleLead.620x365.gj3lhz.png/1440045751697.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/business/sport/telstra-still-interested-in-nrl-rights-even-after-signing-big-afl-deal-20150820-gj3lhz", "country": "AU", "title": "Telstra still interested in NRL rights, even after signing big AFL deal", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Telstra still interested in NRL rights, even after signing big AFL deal | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T12:42:00.000+03:00", "replies_count": 0, "uuid": "d5e1908e00ff20865534bcb053109f608f5a9b83"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/sport/telstra-still-interested-in-nrl-rights-even-after-signing-big-afl-deal-20150820-gj3lhz", "ord_in_thread": 0, "title": "Telstra still interested in NRL rights, even after signing big AFL deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dave Smith, NRL chief executive of the NRL, which says it is still talking to different parties about broadcast rights. Peter Rae Share on twitter by John Stensholt Telstra will still pursue rugby league rights, even though its joint venture partner in this week's record AFL deal News Corp has signalled a tough stance towards the NRL over broadcast rights negotiations.\nNews Corp, Telstra and Seven West Media agreed on Tuesday to pay $2.51 billion for six years from 2017 for AFL rights, a little over a week after the NRL granted an extra free-to-air game to Nine Entertainment Co in a deal worth $925 million over five years starting in 2018.\nThe NRL's move upset News Corp, the current holder NRL pay-television rights through its wholly owned Fox Sports, which was not told of the decision to sign with Nine without also agreeing to pay-TV and other digital rights at the same time.\nBut Telstra group managing director of media and marketing Joe Pollard said the telecommunications giant was still keen on the NRL, which it has digital rights for. \"We are still talking to the NRL and are still in negotiations,\" Ms Pollard said. \"We are still interested in a range of sports.\"\nTelstra agreed to pay about $300 million for AFL rights over six years, extending its agreement to also become the AFL's official technology and data partner. Telstra will also show a version of the AFL app through its upcoming Telstra TV service, including highlights packages and video of full matches on a 12-hour delay.\nNews Corp paid about $1.3 billion for AFL pay-TV rights, while also gaining some digital rights. But chairman Rupert Murdoch said this week that News would be likely to pay far more for AFL than NRL rights. \"We believe in the strength of the game and we will do everything we can to make it stronger,\" Mr Murdoch said of the AFL.\nIndustry sources have indicated Fox Sports could have been expected to pay the NRL about $700 million over five years in exchange for gaining all eight weekly games live, up from five now. But the next rights will only have four exclusive games after the Nine agreement, which cuts out Fox Sports' exclusive access to Saturday matches and Monday night games.\nThat has led to News sources claiming the group would pay far less for rugby league, even though the sport is vital for Foxtel to maintain subscriber numbers in NSW and Queensland and it gets heavy coverage in News newspapers in those states.\n An NRL spokesman said the league was still talking to different parties about the rights and it would not be drawn on any potential timing for deals to be finalised.", "external_links": ["https://twitter.com/JohnStensholt"], "published": "2015-08-20T12:42:00.000+03:00", "crawled": "2015-08-20T16:51:52.688+03:00", "highlightTitle": ""}