{"organizations": ["MGI", "MoneyGram International", "MoneyGram", "Dallas Business Journal", "DBJ", "MoneyGram Foundation"], "uuid": "7095c6d4f3e221d6940ec525a0338143b9872f6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://media.bizj.us/view/img/3119791/patsleypamela-moneygram-jld6011*1200xx1300-731-0-99.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=MGI", "section_title": "Yahoo! Finance: MGI News", "url": "http://us.rd.yahoo.com/finance/external/bizj/rss/SIG=1395fv11j/*http://www.bizjournals.com/dallas/news/2015/07/31/her-employment-contract-ending-pamela-patsley-to.html?ana=yahoo", "country": "GB", "title": "Her employment contract ending, Pamela Patsley to step down as MoneyGram CEO", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Her employment contract ending, Pamela Patsley to step down as MoneyGram CEO", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T22:38:00.000+03:00", "replies_count": 0, "uuid": "7095c6d4f3e221d6940ec525a0338143b9872f6f"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/bizj/rss/SIG=1395fv11j/*http://www.bizjournals.com/dallas/news/2015/07/31/her-employment-contract-ending-pamela-patsley-to.html?ana=yahoo", "ord_in_thread": 0, "title": "Her employment contract ending, Pamela Patsley to step down as MoneyGram CEO", "locations": ["North Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Patsley", "Jake Dean Pamela Patsley", "Pamela Patsley", "Holmes", "Alex Holmes", "Alex"], "text": "Jake Dean Pamela Patsley is stepping down as CEO of MoneyGram. With MoneyGram International (Nasdaq: MGI) CEO Pamela Patsley nearing the end of her employment contract, the company announced Friday that CFO Alex Holmes will take over the reins on Jan. 1. In a second quarter earnings call, Patsley said she will be stepping down from the CEO position she has held since 2009 as a publicly-filed contract states her tenure is up on Aug. 31. She will serve as executive chairman at MoneyGram through the end of 2017, a role that that will include a greater role in board governance; representing the company to customers, financial representatives and other representatives; and working closely with the company’s charitable arm, the MoneyGram Foundation. “We were going to have to make some announcement, and in the spirit of great government, good disclosure and continuing to build a good relationship with our shareholders, this was a perfect time,” Patsley told the Dallas Business Journal of her decision to step down. “I think it is really good for the company to give the five-month transition and to be open and honest with investors. And most of all, this is great for MoneyGram and great for Alex.” “But don’t get me wrong, I’m happy too,” she added, saying her smaller role will allow her to spend more time with her husband. Holmes, who has worked with Patsley for a decade, was named CFO of MoneyGram in 2009 and COO last year. Patsley has been grooming him to take over her job for several years, she said. “These are not something where we just said in a meeting ‘Let’s talk about succession planning’ and then made an announcement a few weeks later, “ she said. “It’s been an evolution.” “In succession planning, if you look back over the past several years, you will see that Alex has had a growing role, increasing responsibilities,” she added. “Had he failed at some of those responsibilities, the board would have had to gone another way. But he succeeded. With the new position, Holmes’ first order of business will be to wrap up financials for the company’s full-year earnings call in February. After that, he will look at expanding MoneyGram’s products and services. “We really have five months to sort through administrative issues, talk to the team and see where their areas of interest lie and get that taken care of so that by the time we hit Jan. 1, we have 2016 ready to go,” he said. “It’ll be about moving the company forward.” MoneyGram is the 48th largest publicly-traded company in North Texas, according to the latest Dallas Business Journal research. Patsley is the only female CEO in the DBJ’s 2015 list of the 100 largest public companies. The company, founded in 1940, reported full-year 2014 earnings of $1.45 billion. It beat analyst expectations with its Q2 earnings, logging $348.8 million in revenue and 20 cents in earnings per share over predictions of $347 million in revenue and 15 cents per share. \nWant Dallas Banking & Financial Services news in your inbox? Sign up for our free email newsletters.", "external_links": [], "published": "2015-07-31T22:38:00.000+03:00", "crawled": "2015-08-01T16:40:51.161+03:00", "highlightTitle": ""}