{"organizations": ["Asia-Pacific Data Center", "Equinix"], "uuid": "dd1dbe9322c29b6c4da0ea0f26f104226580fee8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=EQIX", "section_title": "Yahoo! Finance: EQIX News", "url": "http://finance.yahoo.com/news/equinix-begins-second-phase-expansion-023000891.html", "country": "US", "title": "Equinix Begins Second Phase Expansion of its Largest Asia-Pacific Data Center in Singapore", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Equinix Begins Second Phase Expansion of its Largest Asia-Pacific Data Center in Singapore", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T05:30:00.000+03:00", "replies_count": 0, "uuid": "dd1dbe9322c29b6c4da0ea0f26f104226580fee8"}, "author": "", "url": "http://finance.yahoo.com/news/equinix-begins-second-phase-expansion-023000891.html", "ord_in_thread": 0, "title": "Equinix Begins Second Phase Expansion of its Largest Asia-Pacific Data Center in Singapore", "locations": ["Singapore"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Content preferences Done \nREDWOOD CITY, Calif. and SINGAPORE, Aug. 4, 2015 /PRNewswire/ -- Equinix, Inc. ( EQIX ), the global interconnection and data center company, today announced the second phase expansion of its third International Business Exchange™ (IBX®) data center in Singapore, known as SG3. When complete, phase two of SG3 will see an additional 2,000 cabinets, bringing its total operational capacity to 3,000 cabinets. This brings Equinix's total investment in Singapore to over $350M. The second phase expansion is an indicator of Equinix's continued commitment to the region, where market demand for leading data center services from cloud and financial sectors is growing. \nSince March, Equinix has opened five new data centers across four continents with locations in New York, Singapore, Melbourne, London, and Toronto. This has not only greatly expanded Equinix's global footprint, but the increased capacity also strengthens its ability to help global companies connect directly to a large network of partners, customers and employees. With more and more businesses collaborating across borders and a range of platforms, Equinix is a key proponent of the interconnected era and, together with the Equinix Cloud Exchange , is bringing people and businesses closer together to accelerate business growth. Highlights / Key Facts With growing demand for interconnected data center facilities and managed services from the enterprise, financial services, network operators, cloud and IT sectors, Singapore is a key regional hub and a desired location for cloud service providers and major multinational enterprises. The continued expansion of SG3 will further extend Platform Equinix ™ to cater to the increased demand for premium interconnection and data center services in Singapore and the Asia-Pacific region. This expansion is in line with the steady growth of the company's leading global interconnection platform, in which Equinix has invested more than $7.5 billion over the last 16 years. SG3 is Equinix's largest data center facility in Asia-Pacific. The purpose-built facility has a gross floor area of approximately 385,000 square feet, which can accommodate approximately 5,000 cabinets at full build; 1,000 of which were available in the first phase, increasing by a further 2,000 cabinets in the second phase. By deploying in SG3, customers like Fujitsu have direct access to Equinix's network-dense ecosystem of more than 1,000 networks globally, over 190 of which are directly accessible in Singapore. This provides customers with access to a large marketplace of over 6,300 potential customers and partners across more than 100 data centers worldwide, and over 160,000 interconnections, generating revenue opportunities and reducing time-to-market. In the Forrester Research, Inc. report, \" Strategically Locate Your Next Data Center ,\" the firm analyzes the challenges that enterprises face when looking to reduce application latency, improve end-user experiences and service, and provide direct connectivity to cloud services. As a result, enterprises are increasingly turning to data center colocation environments for instant interconnection with partners, employees and customers, which are becoming essential to their ability to compete and succeed in the digital economy. Equinix's Singapore data centers have a high interconnection rate, with more than 12,200 interconnections between businesses in this country alone. The second phase expansion of SG3 is a $54M commitment to customers and prospective customers within the region. With three data center facilities located in close proximity, the second phase expansion of SG3, will provide increased capacity and network opportunities for new companies to join in and gain direct access to SG1, which is Singapore's most network-dense data center. This is through the dedicated fiber network interconnecting both data centers at low latency. The second phase expansion of SG3 also means that existing customers in SG1 have added capacity to easily scale when required, ensuring high-performance, network reliability, redundancy, and low latency. Cloud and IT service providers account for a quarter of Equinix's business and is the fastest growing segment for the company. By housing IT infrastructure in SG3, the only carrier-neutral facility in Singapore, businesses are able to expand their cloud and data capabilities rapidly as data consumption and content volume continue to increase. Quotes Clement Goh, managing director, Equinix South Asia: \"Singapore is en-route to becoming a Smart Nation, integrating all aspects of technology into a coherent and cohesive whole to improve the way people live, work and play. We hope to support Singapore's vision by providing our customers with direct access to established business ecosystems. Increasingly companies see great potential in multi-cloud access and the importance of a strong, reliable, yet flexible solution. SG3 phase two was launched to help companies like Fujitsu ensure that they are in a solid position to support their customers' needs. \nAbout Equinix Equinix, Inc. ( EQIX ) connects the world's leading businesses to their customers, employees and partners inside the most interconnected data centers. In 33 markets across five continents, Equinix is where companies come together to realize new opportunities and accelerate their business, IT and cloud strategies. www.equinix.com . \nForward Looking Statements This press release contains forward-looking statements that involve risks and uncertainties. Actual results may differ materially from expectations discussed in such forward-looking statements. Factors that might cause such differences include, but are not limited to, the challenges of acquiring, operating and constructing IBX centers and developing, deploying and delivering Equinix services; unanticipated costs or difficulties relating to the integration of companies we have acquired or will acquire into Equinix; a failure to receive significant revenue from customers in recently built out or acquired data centers; failure to complete any financing arrangements contemplated from time to time; competition from existing and new competitors; the ability to generate sufficient cash flow or otherwise obtain funds to repay new or outstanding indebtedness; the loss or decline in business from our key customers; and other risks described from time to time in Equinix's filings with the Securities and Exchange Commission. In particular, see Equinix's recent quarterly and annual reports filed with the Securities and Exchange Commission, copies of which are available upon request from Equinix. Equinix does not assume any obligation to update the forward-looking information contained in this press release. \nEquinix and IBX are registered trademarks of Equinix, Inc. \nInternational Business Exchange is a trademark of Equinix, Inc. View photo", "external_links": [], "published": "2015-08-05T05:30:00.000+03:00", "crawled": "2015-08-05T05:37:54.113+03:00", "highlightTitle": ""}