{"organizations": [], "uuid": "d2f936360574b1f0f7d6276dd53ef60344abc2ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.finfacts.ie", "main_image": "", "site_section": "http://www.finfacts.ie/irelandbusinessnews/rss.xml", "section_title": "Finfacts Ireland Business & Finance Portal", "url": "http://www.finfacts.ie/irishfinancenews/article_1028979.shtml", "country": "GB", "title": "Strong Swiss franc gloom deepens for exporters", "performance_score": 0, "site": "finfacts.ie", "participants_count": 0, "title_full": "Strong Swiss franc gloom deepens for exporters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T12:21:00.000+03:00", "replies_count": 0, "uuid": "d2f936360574b1f0f7d6276dd53ef60344abc2ce"}, "author": "", "url": "http://www.finfacts.ie/irishfinancenews/article_1028979.shtml", "ord_in_thread": 0, "title": "Strong Swiss franc gloom deepens for exporters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matthew Allen"], "text": "Strong Swiss franc gloom deepens for exporters By Matthew Allen, swissinfo.ch   \nWith the sky-high franc showing no signs of returning to earth, task forces at export-oriented Swiss companies are busily working out ways to tighten belts and stay competitive in the face of the currency crisis. \nBaumann Springs is one such small and medium-sized enterprise (SME). Unless it makes changes, the firm calculates it will lose around 10% of its turnover this year while its Swiss operations, based in Ermenswil in canton St Gallen, will run at an operating loss. \nBaumann is not alone among exporters of all sizes that are facing the pinch. Swissmem, the umbrella lobby group for the electrical engineering, metalworking, machine building and precision tools industries, said turnover had fallen 7.1% for its 1,000-plus members in the first half of the year. \nMargins and profits have also declined since the Swiss National Bank (SNB) abandoned its defence of the franc on January 15, and orders are drying up at the most alarming rate since the industry low point of 2009. \nBaumann is in many ways a typical Swissmem member. Employing 1,500 workers worldwide (500 in Switzerland), the company produces custom-made springs for cars, medical devices and electrical goods. It exports 88% of its products, mostly to the European Union, while many of its main competitors are based in lower-cost Germany. \nHansjürg Hartmann, a member of Baumann’s group management, told swissinfo.ch that trading conditions this year were harder to get to grips with than in 2009 when the world was in the throes of a post-financial crash economic crisis. \nHe explained that 2009 was a global crisis where their competitors were forced to act and adapt; today it is a Swiss problem their competitors do not face. \n\"Swiss companies have a margin problem (if invoiced in euros) or competitiveness problem (if invoiced in francs). In 2009 it was a demand problem. Today we need to become much more productive to stay competitive with our international competitors,\" he said. \n“In 2009 we saw an economic crisis that reduced demand globally. It was relatively straightforward to meet that challenge by restructuring our workforce and production,” he said. \n“Prior to January of this year, we were running at full capacity. But from one day to the next some of our products made 10% to 15% less profit with still the same workload. It is a very foggy environment in which to work because nobody knows what exchange rates will look like in the coming months.” Radical move \nHaving increased working hours for its Swiss employees earlier this year, Baumann is now analysing its product range, deciding which lines to keep and which to ditch. It has also considering freezing certain planned investments and job hires and taking a close look at the prices it charges to customers. \nOther options include reorganising management and back office structures and finding new ways of improving production efficiency. Perhaps the most radical potential move is increasing production in sites outside of Switzerland. \nBut this last option could prove the most difficult, according to Hartmann. “This is a very complex process. You cannot simply push a button and move parts of production outside Switzerland. Some of the necessary technology and know-how might not exist in other countries. Furthermore relocation of parts need to go through a time consuming and costly approval process by our customers,” he said. \nBut more and more Swiss firms are contemplating the relocation of parts of production abroad, according to Swissmem. A recent survey completed by 400 of its members found that 46% either had started this process in the eurozone or were planning to do so. This compares with 34% of firms in January. Worrying process \nSwissmem members already employ more people abroad (560,000) than in Switzerland (330,000). \n“The number of people employed abroad has continually grown in the past few years,” Swissmem President Hans Hess said. “This process will continue – even accelerate – because of the strong franc situation.” \nThis is a process that worries trade unions and the lobby group Employee Switzerland, which recently expressed concern that Swiss workers might have to pay too high a price for the strong franc effects on industry. \nThe organisation called for “investments in workers and innovation rather than job cuts or relocation”. \nThe number of people employed by Swissmem members fell from 333,675 at the end of 2014 to 329,173 in the first quarter of this year. \nRelated Articles", "external_links": [], "published": "2015-08-20T12:21:00.000+03:00", "crawled": "2015-08-20T12:01:08.320+03:00", "highlightTitle": ""}