{"organizations": [], "uuid": "212867724d7874906a356a8a44b237253f88ccf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/8/2/j/t/image.related.articleLeadwide.620x349.gjajsb.png/1440809370335.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/the-economy/rough-week-joe-hockeys-was-worse-20150829-gjajsb.html", "country": "AU", "title": "Rough week? Joe Hockey's was worse", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Rough week? Joe Hockey's was worse", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "212867724d7874906a356a8a44b237253f88ccf8"}, "author": "", "url": "http://www.smh.com.au/business/the-economy/rough-week-joe-hockeys-was-worse-20150829-gjajsb.html", "ord_in_thread": 0, "title": "Rough week? Joe Hockey's was worse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COMMENT\nRBA governor Glenn Stevens (left) and Treasurer Joe Hockey at the National Reform Summit. Photo: Louie Douvis\nIf you've had a rough week courtesy of market volatility , just consider how much worse it could have been – you could have been Joe Hockey.\nThe federal Treasurer began the week with what had been billed as a major speech on taxation with a message the Coalition was keen to get back to after various \"distractions\", as blunders and embarrassments are euphemistically labelled.\nInstead, the speech was a policy disaster , immediately shredded by just about everyone with an interest in the subject.\nCPA Australia CEO Alex Malley buried it for being \"long on rhetoric and short on substance\". When a conservative Treasurer loses the accountants…well, you know.\nAdvertisement Tax cuts The speech contained a predictable repetition of a predilection for offering income tax cuts going into the next election, an offering just in time for next month's Canning by-election.\nWhat allegedly made such cuts absolutely necessary was bracket creep – but Hockey's understanding of what bracket creep might be came under immediate fire from several commentators . And describing a pay increase for a promotion as part of bracket creep is not a good look for a federal Treasurer.\nAnd then, with the National Reform Summit, it got worse .\nHockey came, underwhelmed, and left – which was probably a good idea because after that there was pretty much universal scorn for Hockey's budgets and his \"happy ever after\" vision of painlessly returning the budget to surplus through fairytale growth assumptions.\nThe sharpest scorn though was reserved for the cringe-inducing small-mindedness of politicians ruling out reforms even before discussing them. At least that was shared with the Labor Party.\nBrave forecasts Come Thursday and the Australian Bureau of Statistics released its June quarter private fixed capital investment survey , which indicated Hockey's budget forecasts for non-mining investment were, shall we say, \"brave\". Or just wrong.\nThe ABS figures are flawed as they don't count about half of our non-mining capex, but as an indication of what's happening, or not happening, Joe's forecast of 2 per cent growth in non-mining investment for the last financial year has not happened. His forecast of 4 per cent growth for this financial year is not looking good either.\nThis is the missing ingredient in our economy's transformation. The surge in dwelling investment can only carry us for so long. There are promising anecdotal green shoots, but so far, the numbers (and the Reserve Bank) are saying CFOs just aren't putting their money where Hockey's forecasts are.\nBasically, the figures suggest we're facing more of the same sort of economic growth at least until 2017 – after the next election. No wonder Hockey wants to promise tax cuts going into that election.\nRepublican round-off To round off his week, Hockey publicly climbed aboard the republican movement bandwagon , for which he was allegedly criticised by some of his Coalition colleagues who saw it as a distraction.\nOne this occasion, maybe it's the colleagues who don't get it – sideshow distractions are starting to look good compared with the main game.", "external_links": [], "published": "2015-08-29T03:00:00.000+03:00", "crawled": "2015-08-30T07:13:46.981+03:00", "highlightTitle": ""}