{"organizations": [], "uuid": "de752d1c76fead94ecbd47e4c5347bdca8ca4cbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/22/590x/house-buying-597268.jpg", "site_section": "http://www.express.co.uk/posts/rss/21/finance", "section_title": "Daily Express :: Finance Feed", "url": "http://www.express.co.uk/finance/city/597268/Soaring-cost-property-ladder", "country": "IE", "title": "Soaring cost of moving up the property ladder", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Soaring cost of moving up the property ladder", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T09:48:00.000+03:00", "replies_count": 0, "uuid": "de752d1c76fead94ecbd47e4c5347bdca8ca4cbd"}, "author": "", "url": "http://www.express.co.uk/finance/city/597268/Soaring-cost-property-ladder", "ord_in_thread": 0, "title": "Soaring cost of moving up the property ladder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Soaring cost of moving up the property ladder Soaring cost of moving up the property ladder HOME movers paid more than £50,000 extra on average in 2015 to take their next step on the property ladder than they would have done five years ago, a report has found. PUBLISHED: 07:48, Mon, Aug 10, 2015 | UPDATED: 07:54, Mon, Aug 10, 2015 GETTY The average deposit put down buy a homeowner in 2015 was £87,954 \nThe average price paid for a home in the first six months of the year by someone who was already on the property ladder and moving to their next property was £261,524, according to the Lloyds Bank Homemovers Review. \nThis was 25 per cent, or £52,870, more than the typical home mover paid in 2010, when the home they were moving into had a price tag of £208,654. \nLondon home movers face paying 45 per cent, or £153,535, more for a property than they would have done just five years ago, with homes there now costing £492,882 on average. This is likely to partly reflect the high costs associated with moving home Andrew Mason, Lloyds Bank mortgages director \nIn Wales, home movers are paying 15 per cent more for a property than five years ago, and in Scotland the increase is 17 per cent. Northern Ireland, where house prices still have some way to go to recover to their pre-financial crisis levels, is the only region of the UK where a home mover would pay less for a property than they would have done five years ago, with a 7 per cent fall. \nThe average deposit put down by a home mover in 2015 was £87,954, which is 8 per cent, or £6,405, more than in 2014. The typical deposit size equates to just over one-third (34 per cent) of the average £261,524 price tag for a home. \nAcross the UK, an estimated 155,000 existing home owners moved to another property in the first six months of 2015, which is nearly one-third (32 per cent) more than in the depths of the housing market slump in 2009, but 9 per cent fewer than the number moving in the first six months of 2014. Related articles", "external_links": [], "published": "2015-08-10T09:48:00.000+03:00", "crawled": "2015-08-10T11:00:57.985+03:00", "highlightTitle": ""}