{"organizations": [], "uuid": "9f3614387b255c62d8057da4970cf31e8f07cf2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/z/g/o/9/image.related.afrArticleLead.620x365.giwi5g.png/1439754522834.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/leadership/careers/jobs/universities-offer-education-to-nowhere-as-youth-jobs-dry-up-20150811-giwi5g", "country": "AU", "title": "Universities offer 'education to nowhere' as youth jobs dry up", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Universities offer 'education to nowhere' as youth jobs dry up | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T12:21:00.000+03:00", "replies_count": 0, "uuid": "9f3614387b255c62d8057da4970cf31e8f07cf2f"}, "author": "Lachlan Campbell", "url": "http://www.afr.com/leadership/careers/jobs/universities-offer-education-to-nowhere-as-youth-jobs-dry-up-20150811-giwi5g", "ord_in_thread": 0, "title": "Universities offer 'education to nowhere' as youth jobs dry up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Graduates are facing a tough job market with unemployment the highest since the 1992 recession. Max Mason Hubers by Lachlan Campbell Youth unemployment and intense competition in the labour market is dominating the thoughts of many young Australians.\nIt is a particularly stressful issue for the thousands of university students who have spent years, and thousands of dollars on their studies, but now struggle to find a relevant, full-time job.\nAnd yet, we consistently hear about skills shortages in Australia. The most recent focus has been on the failure of young people to develop adequate science, technology, engineering and mathematics skills.\nIt begs the questions, is there a better approach to tertiary education than having students study degrees that lack the skills employers want?\nYoung people have been increasingly recognising this problem around the world, no doubt because as the complexity of the global economy grows, it places greater emphasis on tertiary education. So one of the core focuses of this year's G20 Youth Summit in Istanbul, will be how to improve the mismatch between labour market needs and tertiary education output.\nIn Australia, part of the growing youth unemployment problem seems to be a side effect of the success in opening up higher education to all. Australia's move to a demand-driven university system has been incredibly successful at expanding higher education opportunities – enrolment increased between 2009 and 2013. It's a vital step for today's modern, knowledge-focussed job market. The days when 12 years of education were enough to build an economy are long behind us.\nReward in numbers But the demand driven system principally rewards universities based on the number of students they enrol, not the number of graduates that find jobs.\n Youth unemployment among graduates is at levels not seen since the 1992 recession. Some of that is evidently cyclical. But there's clearly an imbalance when law-graduate unemployment is at a record high while the information and communication technology industry is crying out to rectify a 100,000 worker shortfall over the next five years.\nWe wouldn't be happy if the government built a highway to nowhere. We should be equally concerned if students spend four years and $40,000 studying for a subsidised degree that is not very useful for a job. That's wasted tax-payer money and enormous lost economic potential, not to mention youth unemployment's scarring effect on mental health.\nOf course, the demand system was supposed to fix all of these problems. If there's a surplus in graduates, lower wages should incentivise students to study alternative degrees in more demand, and the system's flexibility should facilitate that – or so the logic goes. Similarly, with greater competition between universities looking to entice students, there should be an improved focus on teaching and skill development.\nFor sure, the demand system certainly seems to have had some success in achieving this intended effect. But the fundamental problem with this idea is that 18-year-old high school leavers making choices about their future do not have all the facts available and cannot always be trusted to look at them properly when they do. The continued interest in overcrowded industries such as law and journalism shows that many are much more interested in the prestige of particular universities or degrees than graduate employment rates.\nSo what is the answer?\nWell there could certainly be an improvement in the way information about graduate employment prospects is presented to high school leavers. A 2012 McKinsey report highlighted the antiquated lack of data in the tertiary education industry. Similarly, complaints have existed for years that university rankings, often used by students to pick providers, focus on research output rather than teaching quality and employment outcomes.\nBasic failure But beyond information asymmetry, there seems to be a basic failure to link the education system with the demands of employers as well as the demands of students.\nOne answer may be incentivising education providers based on graduate employment success instead of just student enrolment. Certainly there needs to be better dialogue between employers and educators. Rather than designing the tertiary education system as a consumer market, we need to focus on its role in nation building. Tertiary education should be shaped as much by the needs of employers, as by the ambitions of students.\nIn this respect we can learn from the successes of countries such as Germany where excellent vocational systems work closely with employers. Despite much slower growth, German youth unemployment is well below Australia.\nThe G20 Youth Summit this year intends to consider just what sort of policies could help realise this goal. As the official youth engagement forum for the G20 Leaders' Summit, it has the potential to focus the attention of world leaders on the core issue of rising global youth unemployment. We can only hope that future university reforms in Australia consider the experiences of our G20 counterparts and focus not just on how universities can improve their financial feasibility, but also how they can better meet the demands of our 21st century knowledge economy.\nLachlan Campbell is attending the G20 Youth Summit as head delegate for Australia on a Global Voices national scholarship.", "external_links": [], "published": "2015-08-16T12:21:00.000+03:00", "crawled": "2015-08-17T00:06:32.641+03:00", "highlightTitle": ""}