{"organizations": [], "uuid": "b567e038f03f713cbecde0bbeb17ca0f4571ae05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508100410.html", "country": "US", "title": "South Africa: Slow Commodity Demand Affects country's Economy", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: Slow Commodity Demand Affects country's Economy", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T11:20:00.000+03:00", "replies_count": 0, "uuid": "b567e038f03f713cbecde0bbeb17ca0f4571ae05"}, "author": "", "url": "http://allafrica.com/stories/201508100410.html", "ord_in_thread": 0, "title": "South Africa: Slow Commodity Demand Affects country's Economy", "locations": ["South Africa", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: 20 Years for Raping Grade One Juvenile \n\"We cannot anticipate that there will be a return to the commodity super cycle anytime soon, not least, because there are structural factors including the change in the trajectory of growth in China,\" he said. He said government will use the nine point plan, announced by President Jacob Zuma earlier this year, to address challenges discussed in the meeting. Government also presented to the meeting plans to grow the economy in areas that include industrialisation, infrastructure, innovation, investment, inclusion and integration. \nMinister Davies said the meeting also discussed the state of the mining economy and those who attended welcomed the announcement that there will be Operation Phakisa in the mining sector in the near future. \n\"Our economy is facing challenges, growth rate is below what is ought to be, the inclusive growth levels are also where they need to be, but at the same time we have been registering progress even in areas of attracting investment,\" he said. South Africa \nAfrotainment boss, DJ Tira has confirmed that Big Nuz member, Sibusiso Khomo popularly known as R Mashesha has died. see more » Copyright © 2015 SAnews.gov.za. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-10T11:20:00.000+03:00", "crawled": "2015-08-10T11:48:59.884+03:00", "highlightTitle": ""}