{"organizations": [], "uuid": "34125db40299b10c3d4458fe4870114fd1715f19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/thursday-preview-us-economic-growth-142700474.html", "country": "GB", "title": "Thursday preview: US economic growth picks up second quarter, analysts estimate", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Thursday preview: US economic growth picks up second quarter, analysts estimate", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T17:27:00.000+03:00", "replies_count": 0, "uuid": "34125db40299b10c3d4458fe4870114fd1715f19"}, "author": "", "url": "https://uk.finance.yahoo.com/news/thursday-preview-us-economic-growth-142700474.html", "ord_in_thread": 0, "title": "Thursday preview: US economic growth picks up second quarter, analysts estimate", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "2.37 0.00 \nLONDON (ShareCast) - (ShareCast News) - As worries over China's slowdown persist, the US will be hoping for positive news closer to home with the release of gross domestic product data on Thursday. Analysts predict GDP rose an annualised 3.2% in the second quarter, accelerating from the previous quarter's 2.3% growth. \nA report on US personal consumption is forecast to reveal a 3.1% gain in the second quarter, compared to a 2.9% increase in the first three months. \nThe US will also see the release of weekly jobless claims figures and pending home sales. Initial jobless claims may have fallen to 275,000 in the week to 22 August from 277,000 the previous week, according to analysts' estimates. Pending home sales are projected to grow 8.4% in July following an 11.1% climb in June. \nThe Federal Reserve is looking for signs of further improvement in the economy before lifting interest rates for the first time in nine years. However concerns about the potential impact that China's flagging economy could have on the rest of the world has prompted analysts to push back expectations on the timing of a rate hike. \nOn \"Black Monday\" when global stocks plunged on China woes, Barclays (LSE: BARC.L - news ) changed its call for the first rate increase from September 2015 to March 2016. \n\"Given the uncertainty around the current global outlook, the timing of the rate hike seems more uncertain than usual. Should this episode of financial market volatility prove transitory, the FOMC could raise rates in December,\" economists at Barclays said. Wednesday 26 August UK ECONOMIC ANNOUNCEMENTS CBI Distributive Trades Surveys (11:00) Services Producer Price Index INTERNATIONAL ECONOMIC ANNOUNCEMENTS Crude Oil Inventories (US) (15:30) Durable Goods Orders (US) (13:30) MBA Mortgage Applications (US) (12:00) INTERIMS Anglo Pacific Group, Bioquell (Other OTC: BIQLF - news ) , Cape (LSE: CIU.L - news ) , Carillion (Other OTC: CIOIF - news ) , Frontline Ld, HSS Hire Group , NMC Health (LSE: NMC.L - news ) , Optimal Payments Plc (Other OTC: NVAFF - news ) , Paddy Power (LSE: PAP.L - news ) , PJSC Magnit GDR (REG S), Skyepharma (LSE: SKP.L - news ) , Vimetco NV GDR (Reg S), WPP (Swiss: OXWPP.SW - news ) Q2 Frontline Ld, MHP SA GDR (Reg S) GMS (Taiwan OTC: 6481.TWO - news ) Motive Television (LSE: MTV.L - news ) INTERIM DIVIDEND PAYMENT DATE Aberdeen UK Tracker Trust INTERIM EX-DIVIDEND DATE First Quantum Minerals Ltd (Toronto: FM.TO - news ) . AGMS Coral Products (LSE: CRU.L - news ) , Great Eastern Energy Corp Ltd. GDR, IGas Energy (LSE: IGAS.L - news ) , Iomart Group (LSE: IOM.L - news ) , Latham (James), Livermore Investments Group Ltd., New Century AIM VCT, Ovoca Gold (LSE: OVG.L - news ) , Oxford Technology 2 VCT, Oxford Technology 3 VCT, Oxford Technology 4 Venture Capital Trust, Oxford Technology VCT", "external_links": [], "published": "2015-08-26T17:27:00.000+03:00", "crawled": "2015-08-26T18:08:17.804+03:00", "highlightTitle": ""}