{"organizations": [], "uuid": "e62258915e15427117b2ea1e52dbe3155ed3c00a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508280964.html", "country": "US", "title": "Sierra Leone: Crown Technical College 'To Build Middle Manpower'", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Sierra Leone: Crown Technical College 'To Build Middle Manpower'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T14:08:00.000+03:00", "replies_count": 0, "uuid": "e62258915e15427117b2ea1e52dbe3155ed3c00a"}, "author": "", "url": "http://allafrica.com/stories/201508280964.html", "ord_in_thread": 0, "title": "Sierra Leone: Crown Technical College 'To Build Middle Manpower'", "locations": ["America", "Nigeria", "Sierra Leone"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: African Immigrant's Children Beat All Odds to Excel in America \nHe said the college has been operating for over three years in Sierra Leone and that they have introduced new courses to meet the country's needs in middle manpower, adding that the courses include Healthcare, Entrepreneurship,Information and Communications Technology ( ICT) and Business Administration, and training in Mining, Oil and Petroleum Management. \n\"The institution is based in the United Kingdom but as a Sierra Leonean, I thought it fit to bring it to my country with the aim of helping to build the manpower of my brothers and sisters. It is good to know that the certificates that we offer to our graduates are recognised and valued internationally,\" he said. \nHe boasted that they are the first institution to train students in Petroleum Engineering in the country, adding that acquiring such skill will come handy as the country is making progress in the area of petroleum. \nHe revealed the college is in alliance with the Ministry of Education, Science and Technology and other tertiary institutions in the country, with the sole aim of providing quality technical education. \nDr. Curtis said courses they offer would motivate students to achieve higher levels of success. \nThe newly appointed Principal of the College, Engineer Samuel Theophilus Powers, said he is of the view that the country has taken a giant step with the introduction of the college. Sierra Leone \nOver one thousand fishmongers in the Tambakula wharf in Aberdeen, west of Freetown, have lost their livelihoods after … see more » Copyright © 2015 Concord Times. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-28T14:08:00.000+03:00", "crawled": "2015-08-28T14:44:51.990+03:00", "highlightTitle": ""}