{"organizations": [], "uuid": "eaf4f52d6ac213a9089c09d363ac04067c4722e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/w/m/j/d/image.related.articleLeadwide.620x349.giwmkd.png/1439283634842.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2530/consumer-discretionary/consumer-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/property/residential-to-dominate-property-results-20150811-giwmkd.html", "country": "AU", "title": "Residential to dominate property results", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Residential to dominate property results", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "eaf4f52d6ac213a9089c09d363ac04067c4722e5"}, "author": "", "url": "http://www.smh.com.au/business/property/residential-to-dominate-property-results-20150811-giwmkd.html", "ord_in_thread": 0, "title": "Residential to dominate property results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Real Estate Investment Trusts are still seen as a safe haven in a low interest rate environment, thanks to the recurring rental income. Photo: Wayne Taylor\nThe coming two weeks will see all the real estate investment trusts report for the full year, with the focus firmly on residential development and improving office and retail leasing fundamentals.\nDEXUS Property is the first major REIT to report, with improvements forecast for its funds from operations (FFO), which is the more accurate earnings measure now used by the trust sector.\nAlthough the REIT sector has been sold down on the sharemarkets in the past week, it's still seen as a safe haven in a low interest rate environment, thanks to the recurring rental income.\nBrokers at Morgan Stanley predict that overall earnings will fall in line with guidance, albeit toward the top end if a guidance range has been provided, as office and retail fundamentals have improved steadily and residential conditions have remained buoyant since February.\nAdvertisement \"DEXUS reiterated its 59.48¢ FFO guidance for 2015, which was driven by marginal wins on the interest funds management and leasing fronts,\" Morgan Stanley brokers said.\nGeneral market consensus is DEXUS to report a $544 million net profit and a 21.3¢ distribution.\nUBS analysts said Mirvac and Stockland were likely to surprise the market with net tangible asset gains driven by their diversified portfolios and revaluations gains on residential developments.\nFor Mirvac, which is said to be looking at the Investa​ management platform, the brokers have forecast a 13 per cent growth in the 2016 financial year of lots sold (2600 lots) and initial guidance to be about 2400, driven by eight new land projects. The net profit is forecast at about $454 million with a second half distribution of 4.8¢.\nStockland is also a beneficiary of the housing boom, its recent third quarter update recording 4721 net deposits for the financial year to date, the highest number since 2011. UBS has forecast Stockland to settle 5900 lots in the 2015 financial year and 6200 lots in 2016.\nThe forecast net profit for Stockland is $608 million with a distribution of 12¢.\nRetail landlords will also be in the spotlight with leasing spreads for specialty stores, between existing and new leases, a key factor for investors.\nSpecialty sales are in the middle of a clear trend and were strongest they have been in the past five years at the Scentre third quarter updates, averaging 3.4 per cent versus 3.1 per cent at the first half.\nUBS predicts believe discretionary retail will outperform non-discretionary retail over 2015, driven by the combination of the wealth effect (strong house price growth to continue/equity markets to be supportive), the lower $A leading to increased net inbound tourism and less online expenditure as well as lower oil price and interest rates boosting discretionary income.", "external_links": [], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-12T12:48:38.634+03:00", "highlightTitle": ""}