{"organizations": ["PTI", "SBI", "State Bank of India"], "uuid": "3954d6f61699a3524038b65d839ff3fff26dcd93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48730472,width-600,resizemode-4/sbi-expects-jan-dhan-accounts-to-break-even-next-year.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358259.cms", "section_title": "Banking/Finance-Industry-The Economic Times", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/sbi-expects-jan-dhan-accounts-to-break-even-next-year/articleshow/48730425.cms", "country": "IL", "title": "SBI expects Jan Dhan accounts to break even next year", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "SBI expects Jan Dhan accounts to break even next year", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T10:07:00.000+03:00", "replies_count": 0, "uuid": "3954d6f61699a3524038b65d839ff3fff26dcd93"}, "author": "", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/sbi-expects-jan-dhan-accounts-to-break-even-next-year/articleshow/48730425.cms", "ord_in_thread": 0, "title": "SBI expects Jan Dhan accounts to break even next year", "locations": ["MUMBAI"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sriram", "Jan Dhan"], "text": "SBI expects Jan Dhan accounts to break even next year By PTI | 30 Aug, 2015, 12.37PM IST ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! MUMBAI: State Bank of India expects its accounts under the Jan Dhan scheme to break even next year given the healthy growth in average deposits in these accounts, while total deposits have more than doubled to Rs 5,125 crore as of June-end. \"We hope to break even with the Jan Dhan accounts by next year, if we maintain the deposits growth at the current level or even a little less. We spend Rs 132 on each such account,\" SBI managing director and group executive for national banking B Sriram told PTI. He said in terms of number of such accounts, the bank nearly doubled to 7.81 crore as of end June, of which pre-Jan Dhan accounts were 3.95 crore. In June 2014, the number of such accounts stood at 3.76 crore, he said. Sriram said of 7.81 crore accounts, 56 per cent still have zero balance, while this was 69 per cent a year ago and 54 per cent in the March quarter. The average balance in these accounts stood at Rs 656, which was Rs 606 a year ago. On the two social security schemes launched along with the Jan Dhan schemes, and the enrollment that SBI has done, he said the accident cover scheme saw SBI adding 131.14 lakh people, while the life cover plan added 33.15 lakh and the pension scheme added 1.45 lakh people. Meanwhile, the government said, as much as Rs 22,000 crore have been deposited in over 17.5 crore bank accounts within a year of the launch of the Jan Dhan scheme, the largest financial inclusion scheme in the world. The scheme was launched on August 28 last year after being announced by the Prime Minister on his first Independence Day speech. \"As of August 28, 2015, more than 17.5 crore bank accounts were opened under the Pradhan Mantri Jan Dhan Yojana and these accounts had over Rs 22,000 crore in deposits,\" the finance ministry said last week. Sriram said deposits in these accounts stood at Rs 4,415 crore as of the March quarter, while the number of accounts then stood at 7.28 crore. The bank said in terms of transactions, these account saw Rs 13,911 crore in the June quarter alone, up from Rs 8,252 crore a year ago and Rs 38,972 crore in the financial year ending March 2015, which stood at Rs 22,525 crore in FY14 and Rs 13,032 crore in FY13.  ", "external_links": [], "published": "2015-08-30T10:07:00.000+03:00", "crawled": "2015-08-30T10:35:43.224+03:00", "highlightTitle": ""}