{"organizations": [], "uuid": "301ed4f65668ce7fb9377917830c33a0e0729b6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DS337_japan__ZG_20150817104226.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/the-market-in-a-minute-is-the-us-turning-into-japan-2015-08-17", "country": "US", "title": "The market in a minute: Is the U.S. turning into Japan?", "performance_score": 0, "site": "marketwatch.com", "participants_count": 2, "title_full": "The market in a minute: Is the U.S. turning into Japan? - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T03:00:00.000+03:00", "replies_count": 1, "uuid": "175ed370562013513ab66bbb1f2094a0e02cb3bd"}, "author": "Oliver Pursche", "url": "http://www.marketwatch.com/story/the-market-in-a-minute-is-the-us-turning-into-japan-2015-08-17#post-0", "ord_in_thread": 0, "title": "The market in a minute: Is the U.S. turning into Japan?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shutterstock It's been an interesting week for investors. In spite of lackluster revenue growth during the second-quarter earnings-reporting season, deflationary pressures from oil and other energy-related commodities and at best mixed economic data, all 10 sectors of the S&P rose last week — on the heels of 2%-plus gains in July. Energy stocks led the way, as the sector rose by 3.25% in spite of falling oil prices. Treasurys were volatile, but ultimately ended near their starting point with the 10-year yield closing the week at 2.2%. The dollar lost a little ground during the week, mostly as a result of the surprise currency devaluation by China on Tuesday.\nThe push and pull of good news/bad news accompanied by poor earnings growth (which actually fell by some 2% year-over-year) and overall muted outlook are making me wonder if our markets are becoming more like Japan’s. Over the past three years, the Nikkei is up over 100%, while Japan’s economy has grown by just under 1% in the past quarter, and a meager 0.49% from 1980 to 2015. To be clear, I certainly do not expect a similar performance from our economy. But will markets continue to ignore economic realities and rally further on the hopes of continued policy intervention and support by the Fed? As I've said many times, I don't believe that the Fed will raise rates this year. And if they do, it will likely be by one-eighth of a percent — just enough to say they are off zero. Ah, shucks ... no more ZIRP (zero interest-rate policy).\nThe trade\nExpect continued light volume and accompanying volatility. The second half of August is traditionally one of the toughest environments to trade or invest in, but outsized swings can mean opportunities. The trend is higher, a light volume selloff could provide a good entry point before a fourth-quarter rally.\nThis week's market-moving events\nMonday: Empire State manufacturing survey, housing-market index, E-Commerce retail sales Tuesday: Housing starts, Redbook report Wednesday: Mortgage applications, FOMC minutes, consumer prices Thursday: Jobless claims, Philly Fed business-outlook survey, leading indicators Friday: PMI manufacturing More from MarketWatch", "external_links": [], "published": "2015-08-17T03:00:00.000+03:00", "crawled": "2015-08-17T20:06:38.495+03:00", "highlightTitle": ""}