{"organizations": [], "uuid": "6892cb2627ab105a009b3ebbb2718abff3580954", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/racing-past/112682", "country": "IE", "title": "Racing Past", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Racing Past | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T08:21:00.000+03:00", "replies_count": 0, "uuid": "6892cb2627ab105a009b3ebbb2718abff3580954"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/racing-past/112682", "ord_in_thread": 0, "title": "Racing Past", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Opinion: Why is the BJP crying foul at the Congress stance on GST Bill? Getting wind energy to work India failing to seize the opportunity Could the cab-hailing upsurge mean many would readily give up car ownership or shelve plans to add to their fleet? An Economic Times report suggests “hail a cab, don’t buy a car” all the rage in urban India. As per the report, the economics of hiring a cab beats the economics of buying and maintaining a car. The conditions in India are indeed rife for a cab-hailing explosion. For one, in almost every metro, public transport infrastructure leaves much to be desired; whatever is existing, is already careening under the demand. However, organised cab services, until the entry of an Ola and an Uber, were available in just two—Mumbai and Kolkata. Moreover, the rising penetration of smartphones means that app-based taxi-hailing services can be easily accessed by more number of people. And with affordable rates—Ola ‘mini’ taxis, for instance, charge R8 per km at non-peak demand timings in Delhi, the same as metered autorickshaws—they will sure hook passengers by the dozen.\nOwning a car means fuel charges, driver’s salary if you don’t drive, and perennial anxiety over parking space. So, if you don’t want a car, but don’t want to jostle for space on a bus or a metro train either—and can afford a cab ride—chances are high that you will be looking at an Ola or an Uber as your commuting solutions. Even though car ownership is really low in India, 18 per thousand population, as compared to 800 per thousand people in the US, organised cab services, too, are a nascent market at the moment, forming just 7% of the two million cabs in India, which means there is massive room for growth.\nFirst Published on August 03, 2015 12:21 am", "external_links": [], "published": "2015-08-03T08:21:00.000+03:00", "crawled": "2015-08-03T08:28:10.364+03:00", "highlightTitle": ""}