{"organizations": [], "uuid": "99026eccc2fcd43c212973e58f69aae9e6e7834d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-asia/?format=rss", "section_title": "Asian Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/china-isn-t-crisis-believe-190059673.html", "country": "US", "title": "China isn’t the crisis some would have you believe", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "China isn’t the crisis some would have you believe", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T22:00:00.000+03:00", "replies_count": 0, "uuid": "99026eccc2fcd43c212973e58f69aae9e6e7834d"}, "author": "", "url": "https://uk.finance.yahoo.com/news/china-isn-t-crisis-believe-190059673.html", "ord_in_thread": 0, "title": "China isn’t the crisis some would have you believe", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Aug 30, 2015, 21:37 BST - UK Markets closed China isn’t the crisis some would have you believe By Roger Bootle | Telegraph – 1 hour 36 minutes ago 0.0000 \nOther global economies have plenty to look forward to, despite the blustery conditions in Asia \nIt (Other OTC: ITGL - news ) is never possible to be sure that we aren’t about to face disaster. Some people seem to have made a living by foreseeing trouble ahead. The American stock market has “forecast” something like 10 of what turned out to be the past two recessions. And there is no reason why the Chinese stock market shouldn’t follow the same pattern. \nStock markets tend to get too much attention in the media. They are exciting, with quite large movements up and down occurring in very short order. By contrast, the processes of the real economy grind away slowly, and often in obscurity, their wonders to perform. But, in the end, it is the real economy that matters. \nThere have been two stories playing out in China. The first is the extreme weakness of share prices . But they are still up by almost 50pc since this time a year ago. \nThe bigger question, though, is whether the weakness of the stock market is itself a reflection of softness in the real economy. There is no doubt that the Chinese economy has slowed substantially. The official Chinese statistics suggest that growth is currently running at 7pc, down from about 14pc at its peak. In reality, at the moment growth is probably a good deal weaker than this between 4pc and 5pc. \nBut even this slower growth does not justify panic. A slowing of the growth rate was inevitable given China’s increased prosperity. The key question is about how much. As it happens, there are clear signs of stabilisation in the economy. \nYet some pessimists have seen parallels between China and the run-up to the great financial crisis of 2008-09. \nI suppose that events could prove them right. Nevertheless, I would be surprised if that happened this time. \nThe great financial crisis was precipitated by extreme weakness in the American sub-prime property market, which was pretty much wholly financed by debt provided, one way or another, by banks. This meant that when things went wrong there was bound to be a severely adverse impact on the banking system. \nWhat made things worse was that this debt had been sliced and diced in such a way that it landed up on the books of banking institutions around the world, including some apparently staid and safe ones. \nThis crisis imperilled particular financial institutions and, because of banking linkages, there was an acute danger of a chain reaction, made worse because no one knew quite where the bodies were buried. This, and the blow to bank capital and bank confidence, then sent the lending numbers into freefall. Without ready access to finance, international trade collapsed. \nIn these conditions, business and consumer confidence plummeted. \nNone of this sorry tale seems likely to be repeated in the current imbroglio, even though there has been a big rise in bank lending to corporates and the property sector. Most importantly, Chinese equities are not widely held outside China and certainly not by banks. \nBut perhaps the biggest contrast with the Great Recession concerns commodity prices . It is still not widely enough appreciated that in 2008 the world economy suffered a second blow from the huge upsurge in commodity prices, especially oil. At one point, the oil price hit $146 a barrel. (Recently it has been trading at just over $40.) \nThe rise of commodity prices squeezed real incomes in the West and transferred purchasing power to the commodity producers. Many of the leading oil producers had a marked tendency not to spend all of their income. The result was therefore an overall reduction in global aggregate demand. \nRecent weakness in oil and other commodity prices seems to be widely regarded as another aspect of the current impending disaster. In reality, it is nothing of the sort. A good part of it reflects a supply phenomenon. That is to say, for the umpteenth time, the basic forces of supply and demand have been doing their job. \nI have lived through I don’t know how many “crises” when supposedly the prices of key commodities, including oil, could only head in one direction namely up because of the clash between ever-growing demand and sluggish, or even declining, supply. In fact, on every occasion, the price movements have borne out the overriding importance of time lags. \nIt simply isn’t possible for commodity production to respond to price changes overnight. But given time, it does respond sometimes sharply. The supply of industrial metals has recently responded to the earlier strength of prices, and the supply of agricultural commodities, badly affected by adverse weather, has now recovered. Most importantly, there has been a supply revolution regarding oil. \nThe consequent fall in commodity prices should be regarded as a boon. This has not been the overwhelming reaction in the markets, partly because of the association with the China funk, and partly because the losers from lower commodity prices, many of them heavily represented in stock market indices, have been very badly hit. By contrast, the gains from lower commodity prices tend to be small and widely spread across the whole world economy. \nThe result is that the depressive effect of the losses occurs before the expansionary effect of the gains. \nThe upshot is that, in my view, the world economy is not on the brink of a China-induced relapse. On the contrary, as lower commodity and oil prices work their way through the system, in the US and the UK at least, we will see consumer spending rising and the economic recovery strengthening. \nRoger Bootle is executive chairman of Capital Economics \nroger.bootle@capitaleconomics.com", "external_links": [], "published": "2015-08-30T22:00:00.000+03:00", "crawled": "2015-08-30T23:43:05.907+03:00", "highlightTitle": ""}