{"organizations": [], "uuid": "d85aa9a56e1a34a67224589c991fa129ee877300", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/3/o/1/s/c/image.related.afrArticleLead.620x365.gj4lql.png/1440127761790.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/health/monash-ivf-shares-plunge-company-defends-patient-care-20150821-gj4lql", "country": "AU", "title": "Monash IVF shares plunge, company defends patient care", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Monash IVF shares plunge, company defends patient care | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T13:17:00.000+03:00", "replies_count": 0, "uuid": "d85aa9a56e1a34a67224589c991fa129ee877300"}, "author": "Jemima Whyte", "url": "http://www.afr.com/business/health/monash-ivf-shares-plunge-company-defends-patient-care-20150821-gj4lql", "ord_in_thread": 0, "title": "Monash IVF shares plunge, company defends patient care", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Monash IVF Group CEO James Thiedeman. Monash IVF shares fell more than 6 per cent on Friday morning. Jesse Marlow by Jemima Whyte Monash IVF has challenged a report that doctors, who have sought a meeting with the board following the resignation of two senior embryologists, have concerns with patient care.\nShares in the company fell more than 6 per cent on Friday morning, after a report in The Australian Financial Review revealed about one-third of its doctors had written to the board claiming \"something is fundamentally wrong \" at the company, which listed on the sharemarket last year. The 29 doctors are due to meet with the board on August 31.\n\"The media article infers that correspondence from a number of Monash IVF Group doctors received by chairman Mr Richard Davis suggests they are concerned about patient care,\" the statement said. \"This is incorrect. The correspondence referred to expressed concern in relation to the resignation of two senior embryologists. It is not unusual for the doctors to communicate collectively with the senior management team and the board.\"\nThe statement also said the group sought to improve its science and service to patients, which sometimes entailed personnel change.\nSome doctors have already met with the company to discuss the issues raised by the resignation of embryologists Tiki Osianlis and Maria Diamente.\nAfter the meeting, it was decided all 29 should meet with the company for further discussion. It is believed the doctors will be seeking a greater role in the vetting policies that could affect patients, be consulted about price rises and stop the hiring of new IVF specialists.\nThe letter said the doctors shared the embryologists' concerns that Monash IVF was moving away from its \"core values\".\n\"It is truly concerning that the management culture of Repromed [which is part of the Monash IVF Group] has had such a disproportional influence on the strategic decisions taken for the wider group,\" the letter said.\n \"The sudden resignation of [embryologists] Tiki Osianlis and Maria Diamente has left a deep and largely self-inflicted wound that will take a long time to heal. Both individuals are highly capable and very valued professionals who represent the best and finest that Monash IVF has to offer. Many of us have spoken to Tiki and Maria and it is obvious that their decision was very distressing and one they didn't make lightly.\"", "external_links": [], "published": "2015-08-21T13:17:00.000+03:00", "crawled": "2015-08-21T12:52:17.874+03:00", "highlightTitle": ""}