{"organizations": [], "uuid": "dbe59b9baf84e2b2c93d35b5770ef48c091517df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.investopedia.com", "main_image": "http://i.investopedia.com/dimages/graphics/shutterstock_85650661.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=NVS", "section_title": "Yahoo! Finance: NVS News", "url": "http://www.investopedia.com/stock-analysis/081215/pfizer-inc-good-financial-health-pfe-nvs-mrk-bmy-jnj.aspx?partner=YahooSA", "country": "US", "title": "Pfizer Stock Is Like An Extended Release Drug", "performance_score": 0, "site": "investopedia.com", "participants_count": 0, "title_full": "Pfizer Stock Is Like An Extended Release Drug", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T00:03:00.000+03:00", "replies_count": 0, "uuid": "dbe59b9baf84e2b2c93d35b5770ef48c091517df"}, "author": "", "url": "http://www.investopedia.com/stock-analysis/081215/pfizer-inc-good-financial-health-pfe-nvs-mrk-bmy-jnj.aspx?partner=YahooSA", "ord_in_thread": 0, "title": "Pfizer Stock Is Like An Extended Release Drug", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Prableen Bajpai"], "text": "By Prableen Bajpai, CFA (ICFAI) | August 12, 2015 A A A | \nPfizer Inc. (NYSE: PFE ) is a giant in the health space and is listed on the New York Stock Exchange as well as the London Stock Exchange, the Swiss Stock Exchange and the Euronext. Pfizer, founded in 1849, is the world’s biggest research-based pharmaceutical company with a market capitalization of $220 billion. Pfizer can boast of some of the most globally well-known products including Listerine, Visine, Rolaids, Sudafed, Celebrex, Viagra, Zoloft, and Lipitor. With heavy investment in research and development of new products, the company has an attractive product pipeline. \nPfizer has comfortably risen more than the S&P 500 in the last five years. Even when compared to peers like Novartis AG ( NVS ), Merck & Co. Inc. ( MRK ), Johnson & Johnson ( JNJ ) and Bristol-Myers Squibb Co. ( BMY ), Pfizer’s stock has performed reasonably well. (For more see The Future of the Big Pharma .) Financials \nPfizer reported revenue of $11,853 million in Q2FY15, stronger than the revenue of $10,864 million in Q1FY15 while weaker than the revenue of $12,773 million in Q2FY14 by 7.2 percent. The company has been suffering losses in sales with the expiry of patents on some of its popular drugs over recent years, along with combating generic competition. Net income for Pfizer was $2,626 million in Q2FY15, up by 10.92 percent as compared to the previous quarter while down by 9.82 percent as compared to the same quarter in the previous year. \nPfizer’s operates through two distinct businesses: the innovative products business and established products business. Within the innovative products segments are subsegments which are the global innovative pharmaceutical (GIP), global vaccines, oncology and consumer healthcare. The established products business consists of the global established pharmaceutical (GEP). In Q2FY15, the innovative products segment generated $6,630 million in revenue, which is 56 percent of the company revenue, while established products generated $5,090 million, which is 43 percent of the revenue, while a minor 1 percent came from other sources. \nThe company reported an improvement in its earnings per share in Q2FY15 by 10.53 percent as compared to Q1FY15; however there was a drop in earnings by 6.67 percent as compared to Q2FY14. Though there has been slight volatility in the earnings numbers, the same is likely to stabilize and move in uptrend in days ahead. According to the company’s report, Pfizer Inc has many new products that are in the advanced development phase and are likely to boost the sales in future. However as a result of massive spending, the research and development costs are 7 percent higher compared to the same period last year. \nPfizer has taken care of its shareholders via payment of regular dividends and share buyback . The company has consistently paid and increased dividends over the years except for a few phases, one of them being the year 2009, when Pfizer bought Wyeth and when dividends were slashed to half. Currently, the company has strong cash flows to fund its dividends; however in the event of another acquisition, dividends could be diminished again temporarily. (For more see Top Pharma Stocks That Pay Regular Dividends .) The Bottom Line \nPfizer is one of the good picks in the sector with a sound financial position, reasonable debt and valuation levels, dividend payouts and new products in the pipeline that should pay off in the future. All these factors together make Pfizer a decent pick for the long term and income investors. However, it’s not for someone who is looking at a quick upside potential. Related Articles", "external_links": [], "published": "2015-08-13T00:03:00.000+03:00", "crawled": "2015-08-13T02:39:52.896+03:00", "highlightTitle": ""}