{"organizations": [], "uuid": "dc6ad6d762ca947d5caf9beb2dd08570a5521838", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/m/c/e/d/3/image.related.articleLeadwide.620x349.giv9ap.png/1439163974929.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/15/materials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/banking-and-finance/nab-third-quarter-profits-rise-9-per-cent-to-175-billion-20150809-giv9ap.html", "country": "AU", "title": "NAB third quarter profits rise 9 per cent to $1.75 billion", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "NAB third quarter profits rise 9 per cent to $1.75 billion", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "dc6ad6d762ca947d5caf9beb2dd08570a5521838"}, "author": "The Sydney Morning Herald", "url": "http://www.smh.com.au/business/banking-and-finance/nab-third-quarter-profits-rise-9-per-cent-to-175-billion-20150809-giv9ap.html", "ord_in_thread": 0, "title": "NAB third quarter profits rise 9 per cent to $1.75 billion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NAB's third quarter profits rose 9 per cent compared with a year earlier. Photo: Nic Walker\nNational Australia Bank's third quarter profits rose 9 per cent to $1.75 billion, as the bank reported lower bad debt charges in its domestic arm.\nThe bank also said it expects to book additional provision charges of up to ₤500 million in its full-year results relating to misconduct in its United Kingdom arm.\nIt says these costs are already covered by ₤1.7 billion bank capital that NAB is planning to put aside to cover for future misconduct charges against its UK business, Clydesdale and Yorkshire.\nNAB chief executive Andrew Thorburn said the result had shown \"continuing momentum\" in its Australian and New Zealand business. Photo: Louie Douvis\nNAB it was making \"substantial progress\" in moving towards a sale of Clydesdale, and the latest charges related to increased costs of running a compensation program for the mis-selling of complex insurance products, and the impact of a business review.\nAdvertisement NAB is planning to spin-off up to 80 per cent of Clydesdale to shareholders later this year and float the remainder, subject to gaining regulators' approval.\nThe trading update from NAB on Monday said its revenue had risen 4 per cent in its third quarter, while expenses grew by a similar amount.\nIt said charges for bad and doubtful debts in its core Australian business fell 15 per cent to $193 million.\nThis was a key reason behind a lift in profits in NAB's Australian business, though the bank said the decline in bad debts was partly because it had increased provisions in resources and agriculture as a precaution a year earlier, and not repeated this in the June quarter.\nIn a sign of the pressure that competition is placing on bank profits, the bank said its total net interest margin had declined due to competition for business lending.\nNet interest margins are a gauge of how much banks are paying for funds compared with what they charge for loans, and have a key influence on profits.\nNAB chief executive Andrew Thorburn said the result had shown \"continuing momentum\" in its Australian and New Zealand business, alongside the bank making progress in its bid to sell off \"legacy\" assets in the United States and United Kingdom.\n\"Over this period we have maintained a clear focus on our core Australian and New Zealand business,\" Mr Thorburn said.\n\"We have continued to invest in a disciplined way in our priority customer segments of home lending, SME and Specialised Business, to deliver a better experience for customers and improve returns to shareholders.\"\nAn investment analyst at Watermark Funds Management, Omkar Joshi, said the profit result was in line with expectations but assisted by lower bad debts, rather than strong revenue growth.\nNAB last month sold the final tranche of shares in US business Great Western Bank, and the bank is pushing ahead with plans to spin off and float Yorkshire and Clydesdale bank by the end of this year.\n\"Substantial progress has also been made on our intention to pursue a demerger and IPO of Clydesdale Bank over the last three months and we will provide the market with a detailed update of the proposed transaction at our 2015 Full Year results,\" Mr Thorburn said.\nNAB said its full year accounts would recognise between ₤290 and ₤420 million pounds worth of additional provisions relating to the mis-selling of insurance products, and ₤60 to ₤80 million relating to interest rate hedging products.\nMr Joshi said the extra provisions would not affect capital or bank dividends, but would flow through to the bank's full-year profits.\nThere remained a \"wide range of uncertain factors\" in determining its final costs from misconduct in the UK, NAB said.", "external_links": [], "published": "2015-08-10T03:00:00.000+03:00", "crawled": "2015-08-10T02:51:50.792+03:00", "highlightTitle": ""}