{"organizations": [], "uuid": "b495e8d26aeec366c88266a26b1fe86e468691ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/brazil-gm-plant-strike-mercedes-161838541.html", "country": "GB", "title": "Brazil GM plant on strike; Mercedes eyes job cuts", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Brazil GM plant on strike; Mercedes eyes job cuts", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T22:55:00.000+03:00", "replies_count": 0, "uuid": "b495e8d26aeec366c88266a26b1fe86e468691ec"}, "author": "", "url": "http://finance.yahoo.com/news/brazil-gm-plant-strike-mercedes-161838541.html", "ord_in_thread": 0, "title": "Brazil GM plant on strike; Mercedes eyes job cuts", "locations": ["Brazil"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brazil GM plant on strike; Mercedes eyes job cuts 3 hours ago Content preferences Done \nSAO PAULO, Aug 10 (Reuters) - A strike on Monday paralyzed work at a General Motors plant in Brazil and a nearby Daimler truck factory threatened job cuts as labor tensions boiled over in a slumping market. \nMore than 4,000 workers at the GM plant outside of Sao Paulo voted to walk out indefinitely after hundreds of them received pink slips over the weekend, according to the local metalworkers union. \nGM confirmed that the strike had halted operations at its Sao Jose dos Campos factory, which makes motors, transmissions and light trucks. The company declined to say how many workers had been let go, but said the smaller payroll was an adjustment to the sharp downturn in the local market. \nBrazilian auto sales are down around 20 percent this year as rising inflation, unemployment and interest rates contribute to a slump expected to last through early 2016. \nThe Mercedes-Benz truck unit of Germany's Daimler AG also confirmed on Monday that it would cut its workforce at a plant outside of Sao Paulo at the end of the month. The company said it had about 2,000 excess workers at its plant in Sao Bernardo, which was running at less than 60 percent of capacity. \nWorkers at the GM factory overwhelmingly rejected the company's last wage proposal, which offered to avoid job cuts for a year in return for a 10 percent salary cut. The local metalworkers' union was not immediately available for comment on Monday. \nLast month GM said its Sao Jose plant would not be included in 6.5 billion reais ($1.9 billion) of new investments in Brazil through 2019 because the factory is not cost competitive. Labor relations at the plant have deteriorated amid layoffs and a dwindling production lineup. \nGM said the new investments are aimed at modernizing its Brazilian lineup rather than increasing capacity in a market where its car sales have plunged nearly 30 percent this year. \n($1 = 3.48 Brazilian reais) (Reporting by Brad Haynes; Editing by Alan Crosby) General Motors", "external_links": [], "published": "2015-08-10T22:55:00.000+03:00", "crawled": "2015-08-10T23:03:08.983+03:00", "highlightTitle": ""}