{"organizations": [], "uuid": "408ec2ed4a47e979bbcc3314d43dae06726297f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hffo.cuna.org", "main_image": "", "site_section": "http://hffo.cuna.org/22035/front/22035/rss", "section_title": "Missouri Credit Union Personal Finance", "url": "http://hffo.cuna.org/22035/article/3989/html", "country": "US", "title": "Financial Candor Vital in Second Marriages", "performance_score": 0, "site": "cuna.org", "participants_count": 0, "title_full": "Financial Candor Vital in Second Marriages", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "408ec2ed4a47e979bbcc3314d43dae06726297f2"}, "author": "", "url": "http://hffo.cuna.org/22035/article/3989/html", "ord_in_thread": 0, "title": "Financial Candor Vital in Second Marriages", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Judy Dahl"], "text": "Financial Candor Vital in Second Marriages by Judy Dahl \nWhen people marry for a second time, they typically bring along more baggagefinancial and otherwisethan with a first marriage. The situation often is more complicated, with children and two households in the mix, and partners with more ingrained money-handling habits. They may be paying child support, have significant debt, be involved with a family business, or have valuable investments or property. \nThat's why, before you marry again, it's essential to talk openly with your sweetheart about your individual financial situations and to plan how you'll handle finances going forward. \nStart by thinking individually about what you're bringing to the marriage in terms of debts and assets and how you'd like to see your finances handled, advises Jean Chatzky , author, and financial editor at NBC's Today Show . \"Then sit down and have a conversation, understanding that your future spouse might not want to do things exactly the way you do,\" she says. \"But it's important to get all the issues on the table.\" \nYour discussion needs to be very frank, notes Deirdre Wheatley-Liss , an attorney in Morristown, N.J. \"You need to plan how you'll handle your finances day to day, as well as more long-term issues like investments and estate planning, and things like how you'd support a spouse who became ill,\" she says. \nFull disclosure is important. \"Debt tops the list of causes for couples' marital problems, so you need to own up,\" says Chatzky. \"Share your credit history too, because it will affect your spouse's. The first time you go out to buy something significant, it could cause problems.\" Debt tops the list of causes for marital problems, so you need to own up. \nUnderstanding each other's expectations and having a plan makes for a more harmonious household. In fact, a report by Jeffrey Dew , assistant professor of family, consumer, and human development at Utah State University in Logan, shows couples who disagreed about finances once a week were more than 30% more likely to divorce than couples who had such disagreements only a few times a month. Day to day \nShare your attitudes toward spending and saving and your financial goals. Money issues can be emotional, so if things get heated, consider involving a certified financial planner. The professionals at your credit union may be able to assist or to refer you to qualified resources. \nTalk about how much each of you will contribute to expenses and what parts of your salaries and bonuses will pay each expense, Wheatley-Liss suggests. Some couples agree to allocate the same percentage of their incomes to certain goals or debts. \nChatzky believes the system of \"yours, mine, and ours\" works well. Each spouse keeps a separate account and each contributes a certain amount to a joint account. \"That way you can handle your own responsibilities, but preserve some romance with an account for vacations, dinners, your housethings you save for together,\" she says. \nIf you have children from previous marriages, decide how you'll each financially support them. How much support does your former spouse provide? How much will you and your new spouse provide? Will the money all come from your pooled funds or will you pay all or part from your personal accounts? If you have children or a business to protect, or expect an inheritance, a prenup is essential. Investments, insurance, and estates \nLook at the investments you each have and determine if you want to adjust them so your overall portfolio is optimal. Your insurance coverage needs may change as you combine households, so review and modify your policies as needed. You'll probably also need to change beneficiaries listed for your insurance policies and investment accounts. \nYou can choose to file income taxes jointly or separately, and your unique circumstances will dictate which method makes more sense. Keep in mind that, if you file jointly, you're both liable for the entire tax bill. \nYou'll need to change your wills and estate plans. \"Your spouse is entitled to somewhere between a third and half of your estate when you pass away, depending on your state's laws,\" says Wheatley-Liss. \"Your intention might be for those assets to go to your kids if your new spouse has monetary means, and you have to plan for that. Remember that if one spouse is wealthier and the other has to go into a nursing home, 100% of each person's assets will pay for it, no matter how ownership of the assets is titled.\" \nTo address that situation, Wheatley-Liss sometimes recommends buying a life insurance policy to benefit the children and leaving your house and other assets to your spouse. \"You need a way to protect both,\" she says. \nYou also can set up trusts to allocate your assets. Certain types allow your surviving spouse to receive income and, when your spouse dies, your children receive the balance. Share your attitudes toward spending and saving and your financial goals. Prenup \nTo ensure your assets are divided appropriately if you divorce or die, you might consider using a prenuptial agreement. \"People think they're only for the wealthy, but if either of you brings significant assets to the marriage, you need one,\" says Wheatley-Liss. \nIf you have children or a business to protect, or expectations of an inheritance, a prenup is essential. \"And it's not a do-it-yourself legal document; you each need your own attorney,\" Chatzky adds. \nA judge likely won't enforce an informal agreement. \"It has to be written and formalized,\" says Wheatley-Liss. \"I see so many couples come in with one page they've scratched out the day before the wedding.\" Communication \nBe sure to talk regularly about financial matters. \"You need open, honest communication about what's working, what's not, and how you can make it better,\" Chatzky says. \"If you don't like to talk about money, it can help to have a formal structure. Then it's something you know you're going to do every two weeks.\" \nAnd whatever you've agreed to, make sure it's in writing and your beneficiaries know where the documents are. \"It's not romantic, but it saves significant heartache and maybe even significant amounts of money. That's what it boils down to,\" says Wheatley-Liss.  ", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-30T01:30:55.255+03:00", "highlightTitle": ""}