{"organizations": [], "uuid": "fbbcfb7ef72e0817657da8999aa457d9b71fe1f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/naming-shaming-student-borrowers-a-human-rights-violation-nhrc/43052.html", "country": "IN", "title": "Naming, shaming student borrowers a human rights violation: NHRC", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Naming, shaming student borrowers a human rights violation: NHRC", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T13:15:00.000+03:00", "replies_count": 0, "uuid": "fbbcfb7ef72e0817657da8999aa457d9b71fe1f8"}, "author": "IANS", "url": "http://www.moneylife.in/article/naming-shaming-student-borrowers-a-human-rights-violation-nhrc/43052.html", "ord_in_thread": 0, "title": "Naming, shaming student borrowers a human rights violation: NHRC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Naming, shaming student borrowers a human rights violation: NHRC 43052 Naming, shaming student borrowers a human rights violation: NHRC 0 Comments, Be the first to comment + COMMENT IANS | 07/08/2015 03:45 PM | Terming the bankers practice of \"naming and shaming\" of students who defaulted on repaying education loans as violation of human rights, the National Human Rights Commission (NHRC) has issued notice to the Central Bank of India chairman. It has also issued notices to the district magistrate and superintendent of police of Nilgiris district in Tamil Nadu and the manager of Central Bank of India's Majoor Branch, Nilgiris. In a statement, the NHRC said it has taken cognizance of a complaint alleging harassment by Central Bank of India by a education loan-taker and her family as the bank had displayed the photographs of the girl student and her father as \"missing\" and \"defaulter\". It is alleged that the student borrower's father died due to shock after receiving threatening telephone calls from the bank despite paying off half of the loan amount in the first month after the moratorium period. According to the NHRC statement, panel member Justice D.Murugesan has observed that enforcing the practice of \"name and shame rules\" in educational loans would certainly amount to serious violation of human rights. \"Publishing photographs of parents and students (defaulters) have the potential of exposing the students to irreparable loss, injury and prejudice,\" the statement said. \"Apparently, the bank appears to have believed that shaming the defaulters would pressurize the families to repay outstanding educational loans. Such display of photographs of defaulters of educations loan (who normally come from poor families and particularly rural areas) would certainly amount to loss of their dignity apart from violation of their human rights,\" the apex rights panel said.", "external_links": [], "published": "2015-08-07T13:15:00.000+03:00", "crawled": "2015-08-07T13:33:22.967+03:00", "highlightTitle": ""}