{"organizations": [], "uuid": "84a48379c4f2d0831c0c9442bcea9643f053abf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/03/LPG-Re-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/rural-lpg-scheme-halted/114458", "country": "IE", "title": "Rural LPG scheme halted", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Rural LPG scheme halted | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T08:45:00.000+03:00", "replies_count": 0, "uuid": "84a48379c4f2d0831c0c9442bcea9643f053abf6"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/rural-lpg-scheme-halted/114458", "ord_in_thread": 0, "title": "Rural LPG scheme halted", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Narendra Modi government has discontinued the Rajiv Gandhi Gramin LPG Vitaran (RGGLV), launched by the previous UPA government in 2009 to cover more households in rural areas.\n“The rural LPG selections, under RGGLV, have been kept on hold by the petroleum ministry as it is contemplating some changes in the guidelines for the selection of dealers,” a top official at one of the PSU oil-marketing companies told FE.\nIt is learnt that petroleum minister Dharmendra Pradhan is wary about the selection process of rural dealers. Pradhan met some of the dealers and discussed issues related to RGGLV. It is not immediately known when the scheme would be relaunched.\nSince the launch of RGGLV nearly five years ago, 4,000 new domestic cooking gas distributors have been rolled out across the country. Indian Oil Corporation (IOC) has topped the chart with 2,187 distributors under this scheme. Regular distributorship requires certain minimum infrastructure and operating requirements to viably operate in a location. In towns or villages having smaller population s, such distributorships are not viable. In order to help the customers in such underserved areas, a new-format LPG distributorship — RGGLV — was launched.\nThe dealers under RGGLV are identified broadly on the basis of a potential average monthly sale of 600 refills and 1,200 customers. The godown and showroom are located close together with the godown having having a capacity to store about 300 cylinders. These dealers don’t deliver cylinders to consumers’ residences. However, the LPG refills are sold to the consumers at the prescribed retail selling price.\nTill now, the assessment of refill sale potential has been based on several factors including population, population growth rate, economic prosperity of the location and the distance from the nearest existing distributor.\nMeanwhile, the Modi government has rolled out one-time financial assistance to the below poverty line (BPL) category for new LPG connections under RGGLV. Under this scheme, one-time financial assistance is granted to the BPL card-holder for the release of a new LPG connection. Under this scheme, the cost of security deposit and pressure regulator, of nearly R1,600, is met from the funds of the public sector oil marketing companies created for this purpose by the contributions from the corporate social responsibility fund of six major oil firms.\n 06, 2015 12:45 am", "external_links": [], "published": "2015-08-06T08:45:00.000+03:00", "crawled": "2015-08-06T05:17:11.345+03:00", "highlightTitle": ""}