{"organizations": ["FORMER PLAYERS & FAMILY", "DEVRY UNIVERSITY NFL Alumni, Inc.", "DEVRY"], "uuid": "ff56b4b546cf26c28dbc9245e97647ed4421b811", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/EducationTrainingServices", "section_title": "Yahoo! Finance: Education & Training Services Industry News", "url": "http://finance.yahoo.com/news/pro-football-legends-announces-scholarships-171801923.html", "country": "GB", "title": "PRO FOOTBALL LEGENDS ANNOUNCES SCHOLARSHIPS FOR FORMER PLAYERS & FAMILY MEMBERS TO ATTEND DEVRY UNIVERSITY", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "PRO FOOTBALL LEGENDS ANNOUNCES SCHOLARSHIPS FOR FORMER PLAYERS & FAMILY MEMBERS TO ATTEND DEVRY UNIVERSITY", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T20:18:00.000+03:00", "replies_count": 0, "uuid": "ff56b4b546cf26c28dbc9245e97647ed4421b811"}, "author": "", "url": "http://finance.yahoo.com/news/pro-football-legends-announces-scholarships-171801923.html", "ord_in_thread": 0, "title": "PRO FOOTBALL LEGENDS ANNOUNCES SCHOLARSHIPS FOR FORMER PLAYERS & FAMILY MEMBERS TO ATTEND DEVRY UNIVERSITY", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PRO FOOTBALL LEGENDS ANNOUNCES SCHOLARSHIPS FOR FORMER PLAYERS & FAMILY MEMBERS TO ATTEND DEVRY UNIVERSITY NFL Alumni, Inc. 6 hours ago Content preferences Done \nMOUNT LAUREL, N.J., Aug. 17, 2015 (GLOBE NEWSWIRE) -- Pro Football Legends announced today that one former NFL player and one dependent of a former NFL player will each earn $2,500 educational scholarships to attend DeVry University, the exclusive education provider of Pro Football Legends. \n\"As a non-profit that focuses on supporting former football players and their families, we're thrilled to offer our members the chance to earn scholarships to further their education at DeVry University,\" said Joe Pisarcik, President and CEO of the NFL Alumni Association. \n\"We look forward to helping Pro Football Legends members complete their degrees and pursue new careers after football,\" said Robert Paul, president of DeVry University. \"Education is of vital importance in our country today, and, at DeVry University, our mission is to ensure students reach their education and career goals.\" \nApplications are now available at nflalumni.org . Candidates must be both a former NFL player and an active member of the NFL Alumni Association or the dependent of a former NFL player who is an active member of the NFL Alumni Association. Candidates must also be a degree seeking student or be looking to enroll in a program at DeVry University or its Keller Graduate School of Management. The application period will close on September 14, 2015 at 12:00 AM EST. \nAbout NFL Alumni and Pro Football Legends \nPro Football Legends is the commercial marketing name and logo of the NFL Alumni Association, a nationwide group comprised mainly of former National Football League players, coaches, and other employees whose mission is to serve, assist, and inform players and their families. The association offers a variety of medical, financial, and social programs to help members lead healthy, productive and connected lives, as well as community initiatives under its \"Caring for Kids\" programs. For more information, please visit: www.nflalumni.org . \nAbout DeVry University \nDeVry University's mission is to foster student learning through high-quality, career-oriented education integrating technology, business, science and the arts. Founded in 1931, the university offers undergraduate and graduate degree programs onsite and online covering 34 different career fields within its five distinguished colleges of study: Business & Management, Engineering & Information Sciences, Health Sciences, Liberal Arts & Sciences, and Media Arts & Technology. The university is accredited by The Higher Learning Commission (HLC, www.hlcommission.org ). It's highly credentialed faculty members work in the fields that they teach, providing real-world experiences that prepare students for in-demand careers. \nWith locations across the U.S., DeVry University is one of the largest private-sector universities in North America. The university is a part of DeVry Education Group ( DV ), a global provider of educational services. DeVry University", "external_links": [], "published": "2015-08-17T20:18:00.000+03:00", "crawled": "2015-08-18T03:16:39.471+03:00", "highlightTitle": ""}