{"organizations": [], "uuid": "8d8bc71032d9c840d07eb7b2ea7e4a914f581c9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/indian-markets/buy-rating-on-thermax-no-pick-up-yet-in-order-flow/112693", "country": "IE", "title": "Buy rating on Thermax; No pick-up yet in order flow", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Buy rating on Thermax; No pick-up yet in order flow | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T08:08:00.000+03:00", "replies_count": 0, "uuid": "8d8bc71032d9c840d07eb7b2ea7e4a914f581c9f"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/indian-markets/buy-rating-on-thermax-no-pick-up-yet-in-order-flow/112693", "ord_in_thread": 0, "title": "Buy rating on Thermax; No pick-up yet in order flow", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Stocks that are in focus today: Hero MotoCorp, HCL Tech, Maruti Suzuki and more BSE Sensex up over 80 points, Nifty above 8,550; Maruti Suzuki stocks up Asia dividend funds turn to China, India to counter US Fed hike Operating performance in-line; intake remains constrained: Thermax (TMX) reported in-line operating performance for Q1FY16. Revenue grew 19% year-on-year to Rs 10 bn, Ebitda (earnings before interest taxes depreciation and amortisation) margin expanded 221 basis point y-o-y to 9.1%, and net profit grew 49% y-o-y to Rs 617 mn. Consolidated revenue grew 23.9% y-o-y to Rs 12.5 bn; net profit grew 234% y-o-y to Rs 578 mn.\nThe Energy segment reported 25% y-o-y revenue growth, led by execution of the Reliance order. The Environment business reported revenue decline of 1.8% y-o-y, impacted by constrained intake in the Water segment. Ebit margin in the Energy business expanded 440 bp y-o-y to 11%. Environment segment Ebit margin expanded 190bp y-o-y to 6.4%, largely supported by base effect. Energy segment margins were impacted, as the Reliance project had not crossed the margin recognition threshold; Environment segment margins were impacted by losses in water projects in Q1FY15.\nSubsidiary losses narrowed to just Rs 39m, the lowest since Q3FY14. This shows losses on European business have been curtailed and that execution has possibly improved in the Thermax-Babcock JV (received orders of R6 bn + from Babcock & Wilcox overseas wins).\nStandalone order inflow in Q1FY16 was just R9 bn. Domestic intake has remained constrained at just R7 bn-8 bn in the last six-seven quarters, reflecting that activity on the ground is yet to pick up. The order book has shrunk 18% y-o-y.\nCost analysis for Q1 indicates that RM (raw material) costs stand at 63.4% (up 190 bps y-o-y); Other expenses at 16.4% are down 300 bps y-o-y.\nSubsidiary losses have narrowed to just Rs 39 mn, and is the lowest run-rate since Q3FY14. These clearly indicate that losses pertaining to European business have been curtailed; and also possibly improved execution in Thermax-Babcock JV (received orders of Rs 6 bn+ from Babcock & Wilcox overseas wins).\nConsolidated revenues stood at Rs 12.5 bn (up 23.9% y-o-y) and profits at Rs 578m (up 234% y-o-y).\nMaintain Buy; core portfolio holding: Strong commitment to the core ‘strategy’ and the journey till date has improved the investor perception about ‘sustainable superior performance’ and hence the stock’s premium valuations. Maintain Buy with a 12-month price target of Rs 1,275 (30x FY17e at Rs 1,117/share and Rs 141/share for subsidiaries). Premium valuations are supported by: (i) expectations of strong 43% earnings CAGR (compound annual growth rate) over the next five years, (ii) robust FY15 RoCE (return on capital employed) at 16.3% (in a down-cycle), (iii) FY15 net working capital at just eight days (reflecting the bargaining power of the business); and (iv) net cash at Rs 6.2 bn (up from Rs 4.2 bn in FY14).\nFirst Published on August 03, 2015 12:08 am", "external_links": [], "published": "2015-08-03T08:08:00.000+03:00", "crawled": "2015-08-03T08:25:56.238+03:00", "highlightTitle": ""}