{"organizations": [], "uuid": "de02a7b4fbbcbc25ba7982f2ec8fde289c83b796", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/4/3/0/c/x/image.related.afrArticleLead.620x365.gisyq8.png/1438915064223.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/dio-wang-steers-university-deregulation-into-the-rocks-20150806-gisyq8", "country": "AU", "title": "Dio Wang steers university deregulation into the rocks", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Dio Wang steers university deregulation into the rocks | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T21:00:00.000+03:00", "replies_count": 0, "uuid": "de02a7b4fbbcbc25ba7982f2ec8fde289c83b796"}, "author": "Phillip Coorey", "url": "http://www.afr.com/news/politics/dio-wang-steers-university-deregulation-into-the-rocks-20150806-gisyq8", "ord_in_thread": 0, "title": "Dio Wang steers university deregulation into the rocks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PUP senator Zhenya 'Dio' Wang said the whole process to deregulate the university sector had become haphazard and any plans to deregulate fees should be reworked and be put to the people first. Alex Ellinghausen Share on twitter by Phillip Coorey Plans to try one last time to deregulate the university sector are headed for the rocks after key senator Dio Wang said he would not be voting for any change before the next election, despite the government being prepared to consider changes he suggested.\nWith the spring session of parliament to resume next week, Education Minister Christopher Pyne wants to try for what will be the third time to have the Senate pass legislation to deregulate fees.\nThe Senate last rejected an amended bill in March and if the same bill is rejected again in the spring, it would qualify as a trigger for a double dissolution election.\nBut sources say the government is open to a further change which would enable universities to opt out of the current system of capped fees and deregulate their fees. This suggestion has been floated by Senator Wang in the past.\nIn recent weeks, former Education Department official Robert Griew has been contracted by the government to help find a way through and he has been meeting the Senate crossbenchers or their representatives to discuss this proposal and other concerns.\nHaphazard process Senator Wang, the last remaining Palmer United Party senator, told the The Australian Financial Review on Thursday that he still favoured the opt-out option as a compromise but said the whole process had become haphazard and any plans to deregulate fees should be reworked and be put to the people first.\n\"They need to look at this holisitically,\" he said.\n Senator Wang said the government, and Labor, should take their higher education plans to the next election to seek a mandate. He would not be voting for any reform \"this side of the election\".\nWith senators Nick Xenophon and Jacqui Lambie opposed to deregulation, Senator Wang's statement effectively kills any prospect of Mr Pyne salvaging his reforms because he needs six of the eight Senate crossbenchers.\nSenator Wang said he did not fear giving the government a double dissolution trigger because it was in no position to pull it, given its low standing in the polls.\n\"I can't see the point,\" he said.\nParliament resumes next week but Mr Pyne will not introduce the legislation until at least the week after.\nOriginally, the government wanted increase the interest rate on student loans, cut funding to universities by 20 per cent and deregulate fees.\nHECS indexation The government has since dropped the HECS indexation and the 20 per cent cut in a bid to just pass the deregulation of fees but that, too, failed in March.\nNext week will be dominated by the election of a new Speaker, the government unveiling its's post-2020 greenhouse gas reduction targets and an anticipated internal Coalition skirmish over gay marriage.\nDespite Tony Abbott's desire than there not even be a debate on the issue, MP Warren Entsch is planning to introduce his private members bill as early as Wednesday. Gay marriage advocates in the Coalition are demanding at least they can debate changing policy from one of opposition to a conscience vote.\nThe imminent defeat of the higher education reforms leaves the government without a guaranteed legislative victory in the Spring session. Social Services Minister Scott Morrison is still negotiating welfare cuts he needs to pass to fund the child care overhaul announced in the May budget.", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-08-06T21:00:00.000+03:00", "crawled": "2015-08-07T10:53:43.888+03:00", "highlightTitle": ""}