{"organizations": [], "uuid": "2a2078c5fced4ae3171222ce8343ce509ffb7a86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/category-commodities/?format=rss", "section_title": "Commodities Market News - Yahoo!7 Australia Finance", "url": "https://au.finance.yahoo.com/news/cost-cutting-lifts-aurizons-profit-031042421.html", "country": "US", "title": "Cost cutting lifts Aurizon's profit", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Cost cutting lifts Aurizon's profit", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T06:10:00.000+03:00", "replies_count": 0, "uuid": "2a2078c5fced4ae3171222ce8343ce509ffb7a86"}, "author": "", "url": "https://au.finance.yahoo.com/news/cost-cutting-lifts-aurizons-profit-031042421.html", "ord_in_thread": 0, "title": "Cost cutting lifts Aurizon's profit", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Aurizon"], "text": "Mon, Aug 17, 2015, 1:32 PM AEST - Australia Markets close in 2 hrs 28 mins Cost cutting lifts Aurizon's profit AAP – 21 minutes ago Print \nRail giant Aurizon is again counting on cost cutting to lift profitability after flagging another flat year for its operations. \nAurizon's underlying profit rose 15 per cent to $604 million in the 2014/15 financial year as efforts to lower staff costs and improve the efficiency of its operations offset a one per cent decline in revenue. \nChief executive Lance Hockridge is forecasting a similar performance in the year ahead, with a windfall from new enterprise bargaining agreements with staff offsetting flat coal haulage volumes. \n\"We have subdued expectations but nonetheless the momentum around the transformation in the business will continue,\" he said. \nMr Hockridge said the new EBAs, which have removed no-forced redundancy and free rail travel clauses that were a legacy of the state government's privatisation of the business, formerly named QR National, would make Aurizon more productive and efficient. \n\"We very much see that to be the next catalyst for productivity and cost benefits within the company,\" he said. \nCost cutting has been the major driver of Aurizon's performance - and its rising share price - since its privatisation in 2011. \nProfit has improved despite weakness in the coal sector, which accounts for most of the company's business. \nAurizon's expenses, when expressed as a percentage of revenue, have fallen from 91 per cent to less than 75 per cent since the float, and it is targeting a ratio of 70 per cent by 2018. \nThe company expects to haul between 210 and 220 million tonnes of coal during the 2015/16 financial year, steady from the previous year. \nMr Hockridge is adamant the long term demand for metallurgical and thermal coal from Asia will be strong. \nAurizon shares were up 21.5 cents, or 4.25 per cent, at $5.275 at 1300 AEST, due in part to an increased dividend. \nIts partly franked final dividend has improved 5.4 cents to 13.9 cents per share, and Aurizon says it will pay out between 70 and 100 per cent of its net profit in the future. \nAURIZON LIFTS PROFIT AND DIVIDEND \n* Net profit more than doubled to $604m \n* Revenue down 1pct to $3.78b \n* Final dividend up 5.4 cents to 13.9 cents \n* The reporter owns shares in Aurizon @y7finance on Twitter, become a fan on Facebook CBA's Narev earns $8m in a year AAP \nCommonwealth Bank chief executive Ian Narev's pay has fallen slightly to just under $8 million. Mr Narev took home …", "external_links": [], "published": "2015-08-17T06:10:00.000+03:00", "crawled": "2015-08-17T06:32:49.910+03:00", "highlightTitle": ""}