{"organizations": ["Zacks Investment Research", "CPRT", "Inc", "Advance Auto Parts", "Zacks Consensus Estimate", "Done Advance Auto Parts Inc", "CarMax Inc"], "uuid": "23378805d57481f64853d1de4bd5254451a9732b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=AAP", "section_title": "Yahoo! Finance: AAP News", "url": "http://finance.yahoo.com/news/advance-auto-parts-aap-q2-210009666.html", "country": "US", "title": "Advance Auto Parts (AAP) Q2 Earnings: A Surprise in Store? - Analyst Blog", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Advance Auto Parts (AAP) Q2 Earnings: A Surprise in Store? - Analyst Blog", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T00:00:00.000+03:00", "replies_count": 0, "uuid": "23378805d57481f64853d1de4bd5254451a9732b"}, "author": "", "url": "http://finance.yahoo.com/news/advance-auto-parts-aap-q2-210009666.html", "ord_in_thread": 0, "title": "Advance Auto Parts (AAP) Q2 Earnings: A Surprise in Store? - Analyst Blog", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Content preferences Done Advance Auto Parts Inc. AAP is expected to report second-quarter 2015 results on Aug 13. In the last quarter, the company posted a negative earnings surprise of 4.40%. Let’s see how things are shaping up for this announcement. Factors Influencing this Quarter Advance Auto Parts drives profits through its relentless focus on store expansion. During the 16-week period ended Apr 25, 2015, the company opened 25 stores. The rise in store count ensures higher availability of parts, thereby leading to higher sales. Advance Auto Parts is also poised to benefit from growing stability in the industry and an increasing average age of vehicles, along with a rise in the number of miles driven. The combination of a steadily improving job market and lower gasoline prices are also likely to boost the company’s results.However, price competition poses a serious threat to Advance Auto Parts as it competes with national and regional automotive retailers. Moreover, the improvement in the quality of new vehicles leads to reduced need for the maintenance and repair of parts. This, in turn, hampers demand in the automotive maintenance market. Earnings Whispers Our proven model does not conclusively show that Advance Auto Parts is likely to beat earnings this quarter. This is because a stock needs to have both a positive Earnings ESP and a Zacks Rank #1, #2 or #3 for this to happen. This is not the case here, as you will see below: Zacks ESP: Advance Auto Parts’ Earnings ESP is 0.00% as the Most Accurate estimate stands and Zacks Consensus Estimate both stand at $2.25. Zacks Rank: Advance Auto Parts carries a Zacks Rank #4 (Sell). We caution against stocks with a Zacks Rank #4 or 5 (Sell-rated stocks) going into the earnings announcement, especially when the company is seeing negative estimate revisions. Stocks to Consider Copart, Inc. CPRT will report fourth-quarter fiscal 2015 results on Sep 22. The company has a Zacks Rank #2 (Buy).AutoZone, Inc. AZO, will post fourth-quarter fiscal 2015 financial results on Sep 22. The company has a Zacks Rank #3 (Hold).CarMax Inc. KMX will release second-quarter fiscal 2016 results on Sep 22. The company carries a Zacks Rank #3.Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report >> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report", "external_links": [], "published": "2015-08-12T00:00:00.000+03:00", "crawled": "2015-08-12T08:40:44.991+03:00", "highlightTitle": ""}