{"organizations": [], "uuid": "185d7f28f89f3160e30d8c2d58fac0f967e52a37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=13266_2338.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/treasury-imposes-toll-charge-on-some-20929/", "country": "US", "title": "Treasury Imposes Toll Charge on Some Transfers of Assets by U.S. Taxpayers to Partnerships with Their Foreign Affiliates", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "Treasury Imposes Toll Charge on Some Transfers of Assets by U.S. Taxpayers to Partnerships with Their Foreign Affiliates", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T00:48:00.000+03:00", "replies_count": 0, "uuid": "185d7f28f89f3160e30d8c2d58fac0f967e52a37"}, "author": "Pillsbury Winthrop Shaw Pittman LLP", "url": "http://www.jdsupra.com/legalnews/treasury-imposes-toll-charge-on-some-20929/", "ord_in_thread": 0, "title": "Treasury Imposes Toll Charge on Some Transfers of Assets by U.S. Taxpayers to Partnerships with Their Foreign Affiliates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Treasury Imposes Toll Charge on Some Transfers of Assets by U.S. Taxpayers to Partnerships with Their Foreign Affiliates more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=85339dd8-37c5-4fe0-a5f2-fb9c2fa7de8b\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nOn August 6, 2015, the Treasury and the IRS issued Notice 2015-54, which implements a Clinton-era tax provision intended to prevent U.S. taxpayers from using the partnership provisions of the Code to shift built-in gain on property contributed to a partnership to non-U.S. affiliates of the transferor that are partners in the transferee partnership. These rules were announced in reaction to Treasury’s and the IRS’s belief that U.S. taxpayers have been using partnership structures that adopt Section 704(c) methods, special allocations under Section 704(b) and inappropriate valuation techniques with a view towards shifting income to their foreign affiliates. The effective date of the rules described in Notice 2015-54 is August 6, 2015, although the rules will apply to transactions that are deemed to have occurred prior to August 6, 2015 as a result of a check-the-box election made after that date. Under the rules, if a U.S. taxpayer transfers property with built-in gain to a partnership that has one or more foreign affiliates of the transferor as partners, and the U.S. taxpayer and the foreign affiliate or affiliates together own 50% or more of the interests in the partnership, the built-in gain will be taxable to the U.S. taxpayer at the time of the initial contribution unless the partnership agreement complies with rules designed to insure that the built-in gain will be taxed to the U.S. taxpayer in the future. To avoid current taxation, the partnership must (i) utilize the remedial allocation method under Section 704(c) for the property contributed by the U.S. taxpayer, (ii) allocate the items of income, gain, loss and deduction with respect to the property contributed by the U.S. taxpayer in the same proportion, (i.e., if a partner receives an allocation of 10 percent of the depreciation from the contributed property, she must receive an allocation of 10 percent of all other tax items associated with the contributed property), (iii) comply with new reporting requirements, (iv) recognize the built-in gain on an accelerated basis upon the occurrence of certain events, and (v) apply these principles to all property contributed to the partnership by the U.S. taxpayer and its U.S. affiliates during a period beginning with the initial contribution and extending for up to five years. There is a de minimis rule for cases where the aggregate built-in gains on the transferred property are less than $1,000,000—but in calculating the threshold, parties cannot net built-in losses against built-in gains. In addition, certain types of assets are excluded from the rules—namely (i) cash equivalents, (ii) certain securities, and (iii) assets with built-in gains of less than $20,000. The notice also indicates that Treasury and the IRS will adopt additional rules under Section 482 to address controlled transactions involving partnerships in cases where they believe that taxpayers are inappropriately shifting income to related foreign partners. Send Print Report Contact Latest Posts", "external_links": [], "published": "2015-08-15T00:48:00.000+03:00", "crawled": "2015-08-15T01:29:17.022+03:00", "highlightTitle": ""}