{"organizations": [], "uuid": "c3f06f95dbb35c038e30e87c4d0252407904775d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/23/590x/interest-rates-600903.jpg", "site_section": "http://express.co.uk//posts/rss/23/personalfinance", "section_title": "Daily Express :: Personal Finance Feed", "url": "http://www.express.co.uk/finance/personalfinance/600903/China-crash-stormy-markets-interest-rate-rise-2017", "country": "", "title": "China crash: Stormy markets could push back interest rate rise to 2017", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "China crash: Stormy markets could push back interest rate rise to 2017", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T16:23:00.000+03:00", "replies_count": 0, "uuid": "c3f06f95dbb35c038e30e87c4d0252407904775d"}, "author": "", "url": "http://www.express.co.uk/finance/personalfinance/600903/China-crash-stormy-markets-interest-rate-rise-2017", "ord_in_thread": 0, "title": "China crash: Stormy markets could push back interest rate rise to 2017", "locations": ["England", "London", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China crash: Stormy markets could push back interest rate rise to 2017 China crash: Stormy markets could push back interest rate rise to 2017 BRITISH interest rate increases could be pushed back until 2017 as a result of the market chaos and the continued fallout from the Chinese economic slowdown, according to experts. PUBLISHED: 14:23, Wed, Aug 26, 2015 | UPDATED: 14:47, Wed, Aug 26, 2015 GETTY The Bank of England in London \nA delayed rise spells good news for borrowers and mortgaged home owners, but comes as a blow to savers who had been tipped to benefit from a rate lift early next year. The Bank of England (BoE) had been urging households to prepare for rate rise at the turn of this year, before fears over the Chinese economy sent shock waves through financial markets across the world. In the past couple of weeks the FTSE 100, Britain's leading share index, has lost around 10 per cent of its value and critics say that worse could be yet to come. The change in temperament has led experts to forecast that the BoE's Monetary Policy Committee (MPC) will be more wary about increasing rates. Related articles Savers warned over 'catastrophic' effects of falling markets on... \nMichael Saunders, chief UK economist at Citibank, said: \"In our view it is now questionable as to whether the MPC will hike rates at all next year.\"As well at the market turmoil, China's slowed growth is reducing demand for oil, pushing down global prices and in turn keeping inflation in Britain low, which provides another reason for rates to be kept on hold. Laith Khalaf, senior analyst at Hargreaves Lansdown, said: \"As long as lower petrol prices are keeping inflation down, central banks in the UK and US are unlikely to raise interest rates, providing a supportive background for companies and consumers. \"This probably further extends the pain for savers, who can probably see that light at the end of the tunnel receding into the distance.\"The BoE base rate has been at 0.5 per cent since 2009, but thanks to Britain's continued economic recovery it looked as though a rise could come in the coming months. In the most recent meeting of the MPC at the start of August , members were split of the first time this year over whether to raise rates with immediate effect. It came after the BoE Governor Mark Carney said in July that rates could return to around two per cent over the next couple of years. Related articles", "external_links": [], "published": "2015-08-26T16:23:00.000+03:00", "crawled": "2015-08-26T17:56:09.694+03:00", "highlightTitle": ""}