{"organizations": [], "uuid": "b3db51445b1224357d0a1decac764641deddccbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/06/aircraft-orders-idUSL5N10H2Z120150806", "country": "US", "title": "Airbus orders lag Boeing in Jan-July", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Airbus orders lag Boeing in Jan-July | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T15:26:00.000+03:00", "replies_count": 0, "uuid": "b3db51445b1224357d0a1decac764641deddccbf"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/06/aircraft-orders-idUSL5N10H2Z120150806", "ord_in_thread": 0, "title": "Airbus orders lag Boeing in Jan-July", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS Aug 6 Airbus won 408 gross plane orders in the first seven months of the year, the European planemaker said on Thursday, lagging U.S. rival Boeing with 426 aircraft sales.\nExcluding cancellations for 24 A320, 10 A321 and seven A350-900 jets, Airbus had 367 net orders in the period from Jan. 1 to July 31. This compared with a total of 380 for Boeing in the period ended July 28.\nLast month brought 26 new orders for Airbus, including 25 A321neo jets for an undisclosed customer.\nAirbus said it delivered 353 planes in January to July, including 15 of its A380 superjumbos.\nParent Airbus Group said on Friday the A380 programme was still on track to break even by the end of this year despite forecasting it would deliver fewer than the 30 aircraft it had planned.\nThe company is deliberating whether to upgrade the A380 superjumbo with new engines, but has said it was confident of securing sales of the existing model this year.\nAirbus has forecast total deliveries should be slightly higher this year than the 629 achieved in 2014.\nAirbus clung to the top spot in commercial plane orders last year with a total of 1,796 gross orders and 1,456 net sales. It failed to close the gap on deliveries, however, leaving Boeing the world's largest plane manufacturer for the third year running.\nEarlier on Thursday, British Airways owner IAG said it had firmed up orders for eight A350-900 and three A330-200 long-haul aircraft for its Spanish carrier, Iberia. It also signed firm orders for 20 A320neo jets for which it had options. (Reporting by James Regan ; Editing by Mark Potter )", "external_links": [], "published": "2015-08-06T15:26:00.000+03:00", "crawled": "2015-08-06T14:42:42.507+03:00", "highlightTitle": ""}