{"organizations": ["Tiffany Kim"], "uuid": "98ac1112db72cfd978c73c8122761b2410b1a785", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/78", "section_title": "Artipot: Finance > Personal Finance Articles", "url": "http://www.artipot.com/articles/1921712/retirement-benefits.htm", "country": "US", "title": "RETIREMENT BENEFITS (Tiffany Kim)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "RETIREMENT BENEFITS (Tiffany Kim)", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T10:03:00.000+03:00", "replies_count": 0, "uuid": "98ac1112db72cfd978c73c8122761b2410b1a785"}, "author": "", "url": "http://www.artipot.com/articles/1921712/retirement-benefits.htm", "ord_in_thread": 0, "title": "RETIREMENT BENEFITS (Tiffany Kim)", "locations": ["Purisima"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Purisima", "Tiffany Kim"], "text": "By Tiffany Kim Aug 11, 2015 Retirement packages are considered rewards for one's hard work in the twilight of his years. However, there are unique cases that should require a thorough investigation before retirement benefits are released. Purisima's retirement benefits is one. The issues that surround him are too grave to be ignored. Many lower ranking officers, with clean records, have difficulty accessing/receiving their retirement packages; yet higher ranking officials, like Purisima, are assured.Police officers serves our country, not just with their time and efforts, but also with their lives. Every day, they put their lives at risk. They are the line of defense, we depend on, when an aggression or transgression of right arises. At the end of the day, they make peace a possible state of life. It is only fair for their services be rewarded, not only with a more reasonable retirement package, but also receiving it on a timely manner.Although General Purisima have served time and have done some good, issues concerning his involvements in botched operations, along with his questionable wealth, should not be disregarded. Though he has neither been proven guilty or innocent of the charges against him, there are indications that heavily challenges his integrity. Higher ranking officials' ethical behavior, should be a criteria that must be considered before releasing retirement benefits.I may be jumping the gun in regards to Purisima receiving his future retirement benefits on a timely manner. But this is not just about Purisima; he is just an example. This is about high ranking officers and high ranking government officials, with questionable ethical practices, receiving \"comfortable\" retirement benefit packages, while lower ranking officers are \"nickled and dimed\" and are made to play the waiting game. Granted, I understand the logic and status quo of higher level means more responsibility, more pay, and better benefits. But the discrepancy of benefit packages between the lower ranking officials and higher ranking officials is mind boggling. Rating:", "external_links": [], "published": "2015-08-11T10:03:00.000+03:00", "crawled": "2015-08-12T01:05:10.331+03:00", "highlightTitle": ""}