{"organizations": [], "uuid": "561d9cdba9b1e0ad89257ff5fe5cb27a247947fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/r/v/0/w/image.related.articleLeadwide.620x349.giofig.png/1438738271095.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/markets/business-days-guide-to-surviving-earnings-season-20150730-giofig.html", "country": "AU", "title": "Business Day's guide to surviving earnings season", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Business Day's guide to surviving earnings season", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "561d9cdba9b1e0ad89257ff5fe5cb27a247947fd"}, "author": "", "url": "http://www.smh.com.au/business/markets/business-days-guide-to-surviving-earnings-season-20150730-giofig.html", "ord_in_thread": 0, "title": "Business Day's guide to surviving earnings season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Be strong: While the boardroom leather chairs get their pre-earnings season workout, you can shape up reading this week-by-week guide. Photo: iStock photos/Theresa Ambrose\nYou've held on with both hands as the ASX rollercoaster rode the great Greek debt crisis ride in June.\nNow the northern hemisphere folk have packed up for their summer holidays, it would seem the global drama is beginning to taper off.\nDon't get too comfy though: it's August, and that of course means company reporting season .\nDon't worry, we've got your back. Welcome to our week-by-week guide to get you through the month.\nWeek One Don't discount the warm-up. There's only seven major companies reporting this week but it should be a good tone setter.\nUp on the block we have a Suncorp Group, Rio Tinto and Virgin Australia, representing the financial, material and industrial sectors.\nSuncorp got us off to a steady trot revealing a 55 per cent jump in its full-year profits to $1.1 billion, amid what it called the worst year for natural disasters.\nVirgin already dropped some numbers last week, saying it narrowed its full-year underlying pre-tax loss to $49 million, an improvement on the previous year, when it ran up losses of $211 million.\nIt's worth noting that the airliners have had a good go of it recently, benefiting from a lower Australian dollar and oil prices.\nSuncorp is under pressure from increasing competition in the insurance space. But UBS analyst David Cassidy says there is potential for a special dividend payment after it treated shareholders to a 30¢ per share payout last year. Got your attention now?\nGood, now don't pull a hammy on Rio. You haven't had a good run since February, remember.\nWeek Two It's punters and printers week. This is a big week for retail, financial, gaming and media stocks.\nJames Packer's Crown Resorts licking its wounds from the Battle of Brisbane and rival casino operator Echo Entertainment go head to head this week. Crown is feeling the pinch from a crackdown in corruption in Macau which is keeping the gamblers on their toes. Echo meanwhile, as the ink dries on its Brisbane casino deal, is on UBS's Cassidy's list of companies with the potential to beat earnings estimates thanks to the stronger NSW economy boosting Star City.\nWatch for Thursday, when media rivals Fairfax Media and Rupert Murdoch's News Corp report.\nFairfax, publisher of BusinessDay, is one company which Goldman Sachs says has seen poor investor sentiment, but could beat earnings expectations.\nGoldies also singles out JB Hi-Fi, which reports in this week. And for the dividend chasers, Commonwealth Bank is publishing its results on Wednesday. Remember these guys, the heaviest of heavyweights, reported an interim profit of $4.6 billion back in February.\nThen again, a six-week long sell-off on the ASX which dragged the bourse off its near-6000 perch in April, was sparked by the threat of increased capital requirements for banks, stoking investors fears of lower earnings. So the full-year picture should be interesting. By the way, CBA last paid out a dividend of $1.98 a share.\nWeek Three Hopefully by now you've bulk-bought your supply of protein bars, energy drinks, chocolate, or whatever gets you through the night.\nWeek three promises a thrilling ride as some more big names come onto the chopping block. Wesfarmers, Qantas, AMP, Tatts Group, Origin Energy, Fortescue Metals Group all fess up - and that's just Thursday.\nDeutsche Bank research analyst Michael Simotas said Wesfarmers should \"be okay\" despite competitor Woolworths' woes, with Bunnings the perennial jewel in the crown.\n\"Kmart and Officeworks should also be robust and the more problematic divisions have become small, which suggests the group should be robust,\" he said.\nProblematic? Ask Woolworths about Masters. But they're keeping their results under wraps until the last possible minute (see week four).\nMining and energy companies are a feature in week three, for those curious to see just what a collapse in commodity prices can do to a company.\nGold miners Arrium and Newcrest are up early, and their share prices have been especially susceptible to fluctuations in the price of gold, which has slipped 20 per cent over the past 12 months.\nAlso look out for Santos and Woodside Petroleum, reporting this week.\nThe property trusts are looking to be winners this year, so solid results are expected from GPT Group, Stockland and Federation Centres.\nCLSA analysts Michael Scott and Sholto Maconochie are estimating a not-too-shabby earnings per share growth of 4.8 per cent across the sector.\nWeek Four\nNow, how are those fingernails? This week reminds us of those old school workout videos where the impossibly chirpy instructor says \"are you all warmed up now? Let's start the cardio!\" to which you reply, \" start the cardio?\"\nBHP Billiton is up this week, book-ending a season that fierce rival Rio Tinto began.\nIn the energy sector, UGL should be interesting. Its share price has fallen almost 14 per cent since this week began. The bears at Morgan Stanley see short term risks to the downside for the energy company.\nEven after a management review in June, \"which highlighted a largely clean contract profile, the scale of risk that may still reside within contract exposures at the Ichthys project is significant in the context of UGL's [debt] position,\" they say.\nOuch. In English that means they are one of the many victims of the end of the commodities boom, in which companies' capital spending and new projects shrink as everyone tightens their belts.\nWith this in mind, it could be an interesting couple of days as Beach Energy, Spark Infrastructure, Oil Search are also among those reporting.\nThe week is a good one if you're in healthcare, with Japara and Ramsay on deck. Watch for Virtus Health though: The recently-listed IVF provider's share price plunged 20 per cent after it downgraded its earnings outlook last month.\nThat brings us to Friday, and possibly the most uncomfortable (if entertaining) investor briefing of the year.\nFinancial services company IOOF reports just weeks after Fairfax revealed it failed to report allegations of misconduct of its staff including insider trading, front running, misrepresentation of performance numbers and cheating on exams to the regulator.\nStruggling me-too supermarket company Metcash has its annual general meeting, and grocery giant Woolworths, fresh from its chief executive's departure announcement, will be in the spotlight. Investors will be keen to know the extent of the Masters home improvement chain disaster, and looking for signs things are getting better after its share price fell more than 20 per cent in the 12 months to June 30.\nAnd finally: Congratulations! Hopefully you've survived, and are a little bit wealthier with all those dividend payouts.", "external_links": ["https://www.youtube.com/embed/T-SNj1UNId4"], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-05T17:52:15.135+03:00", "highlightTitle": ""}