{"organizations": ["FATCA", "HSBC Geneva", "HSBC"], "uuid": "e0556db2f360fb0b0ba6ccf8c7093a0ead125ea3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48337873,width-600,resizemode-4/.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358319.cms", "section_title": "Banking-Banking/Finance-Industry-The Economic Times", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/hsbc-cautious-on-persons-with-political-connections-refraining-from-opening-accounts-of-us-based-indians/articleshow/48337858.cms", "country": "IL", "title": "HSBC cautious on persons with political connections, refraining from opening accounts of US-based Indians", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "HSBC cautious on persons with political connections, refraining from opening accounts of US-based Indians", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T01:49:00.000+03:00", "replies_count": 0, "uuid": "e0556db2f360fb0b0ba6ccf8c7093a0ead125ea3"}, "author": "", "url": "http://economictimes.indiatimes.com/industry/banking/finance/banking/hsbc-cautious-on-persons-with-political-connections-refraining-from-opening-accounts-of-us-based-indians/articleshow/48337858.cms", "ord_in_thread": 0, "title": "HSBC cautious on persons with political connections, refraining from opening accounts of US-based Indians", "locations": ["US", "MUMBAI", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  MUMBAI: HSBC has been asking all \"politically exposed persons\" (PEP) having accounts with the bank to disclose their source of fund and income. The bank is also refraining from opening accounts of US-based non-resident Indians and persons of India origin in the wake of the Foreign Account Tax Compliance Act (FATCA) passed by the US government to unearth black money of US residents outside the country. The British bank has been tightening anti-money laundering rules ever since its Swiss operations came under the glare of regulators and multiple governments. Data leaks five years ago revealed that several Indians figure in the list of individuals who used the services of HSBC Geneva to hide untaxed assets. One of the new rules put in place is closer vigil on PEPs. Such account holders, typically, include politicians, their family members and relatives, bureaucrats, realtors and hoteliers having links with political parties and other people who the bank perceives as having a certain kind of influence. Till recently, these customers were identified under \"special category accounts\" that were periodically reviewed. \"Over the past few months, we have been asking for additional information about their source of money. We will to do our bit but if they don't declare something, then there's not much that the bank can do,\" said a person familiar with the procedures. Responding to ET's email query, an HSBC spokesperson said, \"We do not comment externally about our customer relationships. However, over the past few years, we have enhanced our 'know your customer' (KYC) and anti-money laundering procedures to ensure a more complete consideration of a new/ existing client's source of wealth.\" While an eye on PEPs would minimise chances of local money laundering , FATCA is a reminder how US-based Indians could misuse banking services to invest in India and evade tax in the US. For years, many Indians working abroad have escaped tax on earnings like stock dividend, long termcapital gains, interest on zero-tax bonds and small saving schemes like PPF(which are not taxed in India but attract tax in the US). HSBC, which was fined $1.9 billion in the US, wants to keep such clients at bay. According to two HSBC employees, in the past two years the bank has closed different kinds of accounts—current, corporate, proprietorship, and partnership— whenever clients failed to meet KYC standards.  ", "external_links": [], "published": "2015-08-04T01:49:00.000+03:00", "crawled": "2015-08-04T02:54:07.524+03:00", "highlightTitle": ""}