{"organizations": [], "uuid": "c9fa9a2492d372f7ea2b39a3ab7d9a5ce1e9805f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/y/p/i/1/image.related.thumbnail.320x214.giypbd.png/1439455665859.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/10/energy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/property/education-sector-the-new-city-dweller-20150813-giypbd.html", "country": "AU", "title": "Education sector the new city dweller", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Education sector the new city dweller", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "c9fa9a2492d372f7ea2b39a3ab7d9a5ce1e9805f"}, "author": "", "url": "http://www.smh.com.au/business/property/education-sector-the-new-city-dweller-20150813-giypbd.html", "ord_in_thread": 0, "title": "Education sector the new city dweller", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The renamed Western Sydney University's planned campus at Parramatta.\nThe influx of foreign students into the country is providing a boom for the property sector, with offices being converted to schools and apartments.\nIt is a driving force behind the property boom, as evidenced by the new developments at various universities, particularly the re-named Western Sydney University's major development at Parramatta.\nThe urbanisation of capital cities, with the influx of residents, has also led to demand for vertical schools, from primary to secondary, to accommodate the families buying the apartments.\nThe new residents will also require day care centres, and early learning centres, which will be houses in former offices across the capital cities.\nAdvertisement A new CBRE Viewpoint shows Melbourne is witnessing the strongest trend, with close to 36,000 square metres in education lease deals closed last year, a 44 per cent increase from 2013.\nCBRE research analyst Anne Flaherty said the strong demand from education providers in Melbourne was unlikely to waver, with continued momentum expected in the sector over the next few years.\n\"Education and training is currently Victoria's largest export industry and shows no signs of slowing down,\" Ms Flaherty said.\nOver the past 18 months, the number of leases signed to education providers in the Melbourne CBD has more than doubled from 5 per cent or 20,000 square metres to around 10 per cent, or 45,000 square metres.\nSeveral pockets across Sydney have also witnessed a surge in leasing activity, with Parramatta, Blacktown and Bankstown in the west emerging as some of the city's largest education hubs.\nThese include Raffles' purchase of a 9,800 square metre office property at 1-3 Fitzwilliam Street, Cornerstone's leasing of an 834 square metre space at 17-21 Macquarie Street and Careers Aust's leasing of a 1,300 square metre at 25 George Street.\nCBRE director, office services, Stephen Panagiotopoulos​ said there was a developing trend of both small and large education providers demanding space in Parramatta.\n\"As the central hub of Western Sydney, Parramatta is becoming increasingly attractive, with extensive public transport amenities servicing students in the region,\" Mr Panagiotopoulos said.\n\"Large scale universities and private colleges are demanding upper B-grade to prime grade stock, whilst smaller private colleges are targeting lower C-grade assets.\n\"This demand has had an encouraging impact on the office market, absorbing unwanted C-grade stock and tightening the hard-to-move un-refurbished B-grade stock.\"\nNorth of the city, Australian Catholic University (ACU) is driving growth in the North Sydney office market, with the tertiary provider now one of the biggest occupiers in the area.\nThe former NCR House in North Sydney was bought by the Australian Catholic University, along with campus in Ashfield.\nIn further evidence of North Sydney's expanding education landscape, International College of Colour and Design recently increased its operations by leasing an additional 600 square metres of office space, translating to 100 per cent growth in just 12 months.", "external_links": [], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-14T19:53:36.136+03:00", "highlightTitle": ""}