{"organizations": [], "uuid": "0849d6a9cd88418db9d914c1c9b9d32bcc00d3a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508030480.html", "country": "US", "title": "Zimbabwe: Govt Must Lift Ban On Sale of Used Clothes", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Govt Must Lift Ban On Sale of Used Clothes", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T11:09:00.000+03:00", "replies_count": 0, "uuid": "0849d6a9cd88418db9d914c1c9b9d32bcc00d3a0"}, "author": "", "url": "http://allafrica.com/stories/201508030480.html", "ord_in_thread": 0, "title": "Zimbabwe: Govt Must Lift Ban On Sale of Used Clothes", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Adaptative Strategies Marred By Lack of Funding \nWith these words, Chinamasa might have pleased Priscilla Misihairabwi-Mushonga who was agitating for a ban on used underwear, but he dealt a serious blow to millions of Zimbabweans who get decent clothing from the bales imported, mainly through the Mozambican border. \nThe sale of second-hand clothes not only guarantees hard up Zimbabweans decent clothing, but also offers an opportunity for thousands of unemployed people who sell the merchandise. Banning the trade would leave many without clothing and traders without a source of income. \nThe country no longer has any textile industry to talk about and it would be foolhardy for Chinamasa to believe that this move, which will spawn the black market for second-hand clothing, could benefit any local company. \nJust how does one hope to resuscitate a dead industry without providing funding and an enabling environment for businesses to operate? \nThe ban on second-hand clothes is like rubbing salt to an injury considering how the loss of jobs in the country has been worsened by the Supreme Court ruling that has made it easy for employers to terminate employees' contracts. For those who unexpectedly woke up to find themselves without jobs, trading in second-hand clothes would have come in as an alternative. \nIf the ban is enforced religiously, it will not be surprising to see what used to be a common feature years ago in the rural areas -- grown up men and women moving around in patched up clothes and poor children's bare buttocks showing. \nOne wonders why a poor nation like Zimbabwe would ban trade in second-hand clothes when developed countries have thrift shops for used clothing and other items. \nWe suspect Chinese clothing stores in town, which are being shunned for their poor quality clothes, stand to benefit from this ban. \nIf our government cares in the least about the welfare of its people, it should revise its ban on second-hand clothes until a time when the local textile industry is up and running and is able to produce affordable clothing for all Zimbabweans. Zimbabwe \nPRESIDENT Robert Mugabe could have played both puppet and puppeteer, in the Zanu PF debacle that resulted in the removal … see more » Copyright © 2015 Zimbabwe Standard. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-03T11:09:00.000+03:00", "crawled": "2015-08-03T12:15:17.089+03:00", "highlightTitle": ""}