{"organizations": [], "uuid": "189fc1c2cc9ddddfc8109b7894d3ac0c6f8b099b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/executives/wp-content/uploads/sites/11/2015/02/Sales.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/executives/move/acadiasoft-secures-jpmorgan-veteran-mark-demo-as-its-product-director/", "country": "US", "title": "AcadiaSoft Secures JPMorgan Veteran Mark Demo as its Product Director", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "AcadiaSoft Secures JPMorgan Veteran Mark Demo as its Product Director", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T00:13:00.000+03:00", "replies_count": 0, "uuid": "189fc1c2cc9ddddfc8109b7894d3ac0c6f8b099b"}, "author": "", "url": "http://www.financemagnates.com/executives/move/acadiasoft-secures-jpmorgan-veteran-mark-demo-as-its-product-director/", "ord_in_thread": 0, "title": "AcadiaSoft Secures JPMorgan Veteran Mark Demo as its Product Director", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Demo"], "text": "AcadiaSoft Secures JPMorgan Veteran Mark Demo as its Product Director AcadiaSoft Secures JPMorgan Veteran Mark Demo as its Product Director In his new role as the Product Director, Mr. Demo will be tasked with the managing the company’s response to regulatory decisions. Advertising Print This Post \nAcadiaSoft Inc., a provider of the collateral hub solutions, has appointed Mark Demo as its newest Product Director, according to an AcadiaSoft statement. \nIn his new role as the Product Director at AcadiaSoft, Mr. Demo will be tasked with the managing the company’s response to regulatory decisions, whilst leading AcadiaSoft’s product and industry working groups. He will also be based out of the group’s New York office where he will be reporting to AcadiaSoft’s Chief Executive Officer (CEO) Chris Walsh. \nMr. Demo joins AcadiaSoft from JPMorgan Chase, having served as its Vice President of Business Architecture and Transformation in the over-the-counter (OTC) derivatives space. Collectively, he has also garnered more than two decade of experience managing at JPMorgan with another five working on process changes in collateral operations associated with Dodd Frank and EMIR regulation. \nAccording to Mr. Walsh in a recent statement on the appointment, “Mark is an industry leader who has pioneered many of the standards and best practices implemented within the MarginSphere hub today. We are thrilled to have him on board and confident in his ability to strengthen AcadiaSoft’s leadership role across the industry.” \n“I am excited to join AcadiaSoft as they implement this market-wide solution to the operating challenges posed by the new margin regulations. The expansion of margin requirements will increase margin activity significantly, making regulatory compliance difficult using current margin processes. I look forward to working with AcadiaSoft’s clients and partners to further develop the services that will enable regulatory compliance, improve industry processes, and reduce risk,” added Mr. Demo in an accompanying statement. \nEarlier this month, ICAP plc (IAP.L) fortified its investment in AcadiaSoft . The latest investment from ICAP is in parallel to DTCC, Euroclear and four additional banks, which brought the total to over thirteen individual investing institutions. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-08-27T00:13:00.000+03:00", "crawled": "2015-08-26T21:32:03.171+03:00", "highlightTitle": ""}