{"organizations": [], "uuid": "e9544d48cc4f47518f900ee190813bedea8af1ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/alicia028.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/activists-in-us-pursue-private-abortion-details-using-public-records-laws/43203.html", "country": "IN", "title": "Activists in US Pursue Private Abortion Details Using Public Records Laws", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Activists in US Pursue Private Abortion Details Using Public Records Laws", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T13:48:00.000+03:00", "replies_count": 0, "uuid": "e9544d48cc4f47518f900ee190813bedea8af1ce"}, "author": "Charles Ornstein (ProPublica)", "url": "http://www.moneylife.in/article/activists-in-us-pursue-private-abortion-details-using-public-records-laws/43203.html", "ord_in_thread": 0, "title": "Activists in US Pursue Private Abortion Details Using Public Records Laws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Activists in US Pursue Private Abortion Details Using Public Records Laws 43203 Activists in US Pursue Private Abortion Details Using Public Records Laws 0 Comments, Be the first to comment Charles Ornstein (ProPublica) | 27/08/2015 04:18 PM | Across the country, those who support abortion rights and those who oppose them are feuding in court over how much information should be disclosed about women undergoing abortions This story was co-published with the Washington Post . A few years back, Jonathan Bloedow filed a series of requests under Washington state’s Public Records Act asking for details on pregnancies terminated at abortion clinics around the state. For every abortion, he wanted information on the woman’s age and race, where she lived, how long she had been pregnant and how past pregnancies had ended. He also wanted to know about any complications, but he didn’t ask for names. This is all information that Washington’s health department, as those in other states, collects to track vital statistics. Bloedow, 43, isn’t a public health researcher, a traditional journalist or a clinic owner. He’s an anti-abortion activist who had previously sued Planned Parenthood, accusing the group of overcharging the government for contraception. “There are stories in the data that bring home the reality of what these people do,” Bloedow, a software engineer, said in an email. “Any good investigator knows that when you’re dealing with hard-core criminals, if you ‘keep crawling through their garbage’ some evidence of criminality and corruption will turn up.” The health department had already given him data for one provider, he said, and was on the verge of turning over more information when Planned Parenthood and other clinics sued , arguing that releasing the records would violate health department rules and privacy laws. The legal skirmish, and others like it nationwide, reveal a quiet evolution in the nation’s abortion battle. Increasingly, abortion opponents are pursuing personal and medical information on women undergoing abortions and the doctors who perform them. They often file complaints with authorities based on what they learn. Abortion opponents insist their tactics are generally not aimed at identifying women who have abortions but to uncover incidents involving patients who may have been harmed by poor care or underage girls who may have been sexually abused. They say they are trying to prevent situations such as the one involving Philadelphia abortion doctor Kermit Gosnell, who was convicted in 2013 of murdering three babies after botched abortions and of involuntary manslaughter in the death of a woman. “This is about saving the lives of women,” said Cheryl Sullenger, senior policy adviser for the anti-abortion group Operation Rescue, which is based in Wichita, Kansas. “A lot of people don’t understand that. It’s a systemic problem within the abortion industry today for abortion providers to cut corners on patient care.” But those who support abortion rights say the ultimate aim of these activists is to reduce abortions by intimidating women and their doctors — using the loss of privacy as a weapon. They say their opponents are amassing a wealth of details that could be used to identify patients — turning women, and their doctors, into pariahs or even targets. In a New Mexico case, a woman’s initials and where she lived became public as part of an investigation triggered by a complaint from activists. “I don’t think there’s any margin for error here,” said Laura Einstein, chief legal counsel of Planned Parenthood of the Great Northwest and the Hawaiian Islands, which challenged Bloedow’s request. “These women came to a private health center to have a private health procedure, and that’s just not anybody’s business.” In recent years, abortion opponents have become experts at accessing public records such as recordings of 911 calls, autopsy reports and documents from state health departments and medical boards, then publishing the information on their websites. Some activists have dug through clinics’ trash to find privacy violations by abortion providers — such as patient records tossed in dumpsters — and used them to… Continue Reading…", "external_links": [], "published": "2015-08-27T13:48:00.000+03:00", "crawled": "2015-08-27T14:07:05.556+03:00", "highlightTitle": ""}