{"organizations": [], "uuid": "d1b4f82d3293451bf3a6bcb2d06bd6896d4770a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/royal-twinkle-star-club-directors-asked-to-wind-up-holiday-investment-schemes/43195.html", "country": "IN", "title": "Royal Twinkle Star Club, directors asked to wind up ‘holiday’ investment schemes", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Royal Twinkle Star Club, directors asked to wind up ‘holiday’ investment schemes", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T16:39:00.000+03:00", "replies_count": 0, "uuid": "d1b4f82d3293451bf3a6bcb2d06bd6896d4770a0"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/royal-twinkle-star-club-directors-asked-to-wind-up-holiday-investment-schemes/43195.html", "ord_in_thread": 0, "title": "Royal Twinkle Star Club, directors asked to wind up ‘holiday’ investment schemes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Royal Twinkle Star Club, directors asked to wind up ‘holiday’ investment schemes 43195 Royal Twinkle Star Club, directors asked to wind up ‘holiday’ investment schemes 1 comments While asking Royal Twinkle Star Club and its directors not to collect money from investors, SEBI refused to lift the ban on Citrus Check Inns, the new avatar of RTSC Market regulator Securities and Exchange Board of India (SEBI) has directed Royal Twinkle Star Club Ltd (RTSC) and its four directors to refund within three months, money collected from investors under its holiday package plans. The markets regulator also refused to lift a ban on Citrus Check Inns (new avatar of RTSC) and its directors in a 'collective investment scheme' (CIS) case promising returns on 'holiday plans'. While asking RTSC and its directors, Omprakash Basantlal Goenka, Prakash Ganpat Utekar, Venkatraman Natrajan and Narayan Shivram Kotnis to refrain from garnering money under collective investment scheme (CIS), the market regulator barred them from accessing markets for four years. The company and its directors are also restricted from disposing off any assets, except for refunding money to investors, SEBI said in its order. In another order, passed on Monday, SEBI said, \"activities of Citrus Check Inns and its directors are prima facie found to be illegal and in violation of the SEBI directions, revoking the directions issued vide the interim order, at this stage will not be in the interest of the investors.\" The markets regulator found that Citrus Check Inn has about 4.5 lakh members under different holiday plans and as on 31 March 2013, had generated sales of about Rs770 crore and the amount went up to Rs1,600 crore at the end of March this year. SEBI began the probe after receiving a complaint alleging that Citrus Check Inn was running a 'Ponzi Scheme' and 'mis-selling' its schemes to the public. Last year in March, SEBI had barred Royal Twinkle Star Club and its directors from collecting money from investors. However, the company changed its name to Citrus Check Inn and continued collecting money from investors, which was informed to SEBI by Moneylife. As per SEBI, RTSC, which claimed to have 2.34 lakh rooms across the country for offering holidays to its members, has collected Rs668.33 crore from 3.69 lakh people! On 3 March 2014, Moneylife has sent an email to SEBI’s corporate communications department informing about RTSC and Citrus Check Inns' fund mobilizing activities and CIS. On 6 March 2014, Moneylife wrote an article ( Citrus Check Inns mis-selling holiday package as investment plan? ) explaining about how RTSC and Citrus Check Inns were collecting money from investors.", "external_links": [], "published": "2015-08-25T16:39:00.000+03:00", "crawled": "2015-08-25T17:24:50.263+03:00", "highlightTitle": ""}