{"organizations": [], "uuid": "2262096e70a1152279025f3720b01465e8328366", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/y5W1WRUR9bR9NPBGr49qAw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/8272a4e72755161561366ac87fce68c0eddee7c8_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/oil-prices-fall-metals-steady-220308966.html", "country": "GB", "title": "Oil prices fall; metals steady", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Oil prices fall; metals steady", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T01:03:00.000+03:00", "replies_count": 0, "uuid": "2262096e70a1152279025f3720b01465e8328366"}, "author": "", "url": "https://uk.finance.yahoo.com/news/oil-prices-fall-metals-steady-220308966.html", "ord_in_thread": 0, "title": "Oil prices fall; metals steady", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Aug 1, 2015, 12:06 BST - UK Markets closed Oil prices fall; metals steady AFP – 13 hours ago View Photo \n\nOil prices hit fresh multi-month low points this week, with no sign of an end to a global supply glut. \nMetals, including gold and copper, stabilised after a recent rout fuelled by cracks in the Chinese economy. \nOIL: Brent crude hit $52.28 a barrel on Tuesday, the lowest level since February 2. \nThe same day, New York's main contract dropped to $46.68 a barrel, the lowest point since March 24. \nAfter briefly recovering, both contracts tumbled on Thursday after Abdullah El-Badri, secretary-general of the Organization of Petroleum Exporting Countries, said the group would not cut output in response to lower prices. \nSpeaking in Moscow after meeting Russia's energy minister, he said the cartel is \"not ready\" to cut production, which is currently at around 30 million barrels per day. \nAnalysts said the statement shows OPEC is determined to defend its market share as it fends off competition from US shale oil. \n\"OPEC is telling the market that cuts will not come from them,\" said Daniel Ang, an investment analyst with Phillip Futures in Singapore. \nOPEC is \"emphasising that it is fighting for market share\", he added. \nAt its most recent meeting in Vienna in June, OPEC kept its output levels despite the supply glut that has depressed oil prices. \nCrude futures are under pressure also owing to the strength of the US currency, which makes dollar-priced oil more expensive to holders of weaker units, dampening demand. \nThe dollar has picked up steam on expectations the Federal Reserve will raise US interest rates later this year. \nThe chances of a September lift were raised Thursday after data showed the US economy expanded 2.3 percent in the April-June period, the strongest pace since the third quarter of 2014. \n\"The second-quarter GDP data support the Fed's more upbeat tone on economic conditions and suggests that the economy could cope with higher interest rates,\" research firm Capital Economics said. \nBy Friday on London's Intercontinental Exchange (NYSE: ICE - news ) , Brent North Sea crude for delivery in September slid to $52.69 a barrel from $54.42 a week earlier. \nOn the New York Mercantile Exchange, West Texas Intermediate (WTI) or light sweet crude for September fell to $47.66 a barrel from $48.01. \n- Metals steadier - \nPRECIOUS METALS: Gold rose slightly but stayed pressured after slumping to more than five-year lows the previous week. \n\"There remains clear hesitation from investors to purchase gold, and its reluctance to climb back above $1,100 highlights this,\" said Jameel Ahmad, chief market analyst at trading group FXTM. \n\"We have officially entered the next era of weakness for gold and as economic data continues to demonstrate that the US economy is progressing, gold will be exposed to further losses,\" he added. \nBy Friday on the London Bullion Market, the price of gold rose to $1,098.40 an ounce from $1,080.80 a week earlier. \nSilver climbed to $14.56 an ounce from $14.49. \nOn the London Platinum and Palladium Market, platinum was unchanged at $979 an ounce. \nPalladium fell to $610 an ounce from $616. \nBASE METALS: Prices mostly stabilised compared with a week earlier, but remained held back by a strong dollar and concerns over the Chinese economy, with copper hitting a fresh six-year low at $1,631 a tonne. \n\"One of the reasons for the weak prices is no doubt the appreciation of the US dollar in the wake of the Fed meeting,\" said analysts at Commerzbank (Xetra: CBK100 - news ) . \nThe Fed on Wednesday said the US economy had expanded \"moderately\" in recent months and the jobs market strengthened, though it noted continued \"soft\" business investment and exports. \nIt also said inflation was below target, but put much of that down to falling energy prices and cheaper imports caused by the strong dollar. \nBy Friday on the London Metal Exchange, copper for delivery in three months slipped to $5,218.50 a tonne from $5,245 a week earlier. \nThree-month aluminium decreased to $1,631.50 a tonne from $1,636.50. \nThree-month lead fell to $1,703.50 a tonne from $1,714.50. \nThree-month tin surged to $16,105 a tonne from $14,910. \nThree-month nickel retreated to $10,940 a tonne from $11,250. \nThree-month zinc dipped to $1,942 a tonne from $1,958.50. \n- Softs higher - \nCOCOA: Prices rebounded. \nBy Friday on LIFFE, London's futures exchange, cocoa for delivery in December edged up to £2,154 a tonne compared with £2,140 for the September contract a week earlier. \nOn the ICE Futures US exchange, cocoa for September increased to $3,237 a tonne from $3,197 the previous week. \nSUGAR: Prices recovered, helped by \"robust global demand and dryness in Thailand and India\" according to Commerzbank. \nBy Friday on LIFFE, a tonne of white sugar for delivery in October gained to $354 from $348.30 one week earlier. \nOn ICE Futures US, unrefined sugar for October dipped to 11.32 US cents from 11.38 cents. \nCOFFEE (NYBOT: KC-ZK15-c.NYB - news ) : Prices rose over the week as traders tracked movements in the currency of Brazil, the world's main coffee producer. \nBy Friday on LIFFE, Robusta for September edged up to $1,667 a tonne from $1,651 one week earlier. \nOn ICE Futures US, Arabica for delivery in September gained to 127.45 US cents a pound from 121.10 cents.", "external_links": [], "published": "2015-08-01T01:03:00.000+03:00", "crawled": "2015-08-01T14:09:42.990+03:00", "highlightTitle": ""}