{"organizations": [], "uuid": "0d009115c91525231b822e3355bd297e465d6e58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/moneybusiness0247.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/monkey-business/43017.html", "country": "IN", "title": "Monkey Business", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Monkey Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T11:55:00.000+03:00", "replies_count": 0, "uuid": "0d009115c91525231b822e3355bd297e465d6e58"}, "author": "Bapoo Malcolm", "url": "http://www.moneylife.in/article/monkey-business/43017.html", "ord_in_thread": 0, "title": "Monkey Business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bapoo Malcolm | 04/08/2015 02:25 PM | Would you punish a person for having a happy monkey as a pet? Igatpuri nestles on the top of Thal Ghat, on the way from Mumbai to Nashik. Picturesque place, it has a ‘forest’. Many gardens are larger. Yet, it is something; the view of the valley below is breathtaking! At the entrance of the forest is a poster showing a man-eater. No one has seen a live one in decades, or so the keeper says, but there is a caged monkey, friendly to a fault. So why is it in prison? For evidence. The simian is proof that is needed in court to convict its owner. Not for maltreatment, but for possession. Now, you be the judge . Would you punish a person for having a happy monkey as a pet? One can monkey around as much as one wants. But you can’t keep a monkey on your back. That is asking for trouble, giving meaning to the expression, ‘Get the monkey off your back’. One can keep a dog, a cat, even a horse. A cow, a bullock, a buffalo, a goat or rear sheep. But some animals are taboo. A monkey is one of them. This is where the Wildlife Protection Act kicks in. There is a list of dos and don’ts. About those that can be around as pets and those that must roam free. Endangered species and dangerous ones are best not kept near, on pain of conviction. THE INDIAN WILDLIFE (PROTECTION) ACT ensures that. Monkeys are not the only ones. The list is wide enough to incorporate just about any and every animal. And birds. And reptiles. And amphibians. And plants and trees and other flora. Also certain types of fish. The positive list is a hundred times shorter. No one would want to keep a rhinoceros in the bedroom or an elephant in the kitchen, much less a snake in the cupboard or an alligator in the swimming pool. But monkeys, parakeets, love birds, butterflies are… oh, soooo cute. Unfortunately, they, too, are a no-no. The earth is losing something like 3,000 species of flora and fauna every year. Nature’s balance is being upset. Each individual plant and animal has its own use and needs. A break in the chain is an irretrievable loss; it can lead to chaos and any one extinction can lead to a hundred others. This necessitates the need for legislation. India is not the only country to be rigid about wildlife preservation. Gaming licences have been around for centuries. Besides earning revenue, controls allow the seasonal stock to multiply, providing food for all without wastage. At other times, animals were killed, not for sustenance, but for fashion statements. The prime examples were mink coats and rhino horn dagger-handles, snake skin purses and bear tooth talismans. Ivory was for a variety of display pieces as well as intricate carvings and statutes. All unnecessary, except as avoidable status symbols. And monkeys were performing companions. Laws were made to stop the misuse. The laws, though, are sensible, to a great extent. One can kill in self-defence. Having said that, the onus of proof lies on the killer. Medicinal plants can be cultivated under supervision. Till recently, simians and rats were used for medical experiments. Snakes can be quarantined for extraction of venom which is then used for a variety of medical procedures. Certain tribal rights are also protected. What about zoos? While it is often perceived as cruel to confine animals, and especially birds, to restricted areas, open zoos do find favour. Notified parks are places where the animal is king. In India, we have Corbett, Bharatpur, Madumalai, Periyar; places where animals roam free, without fear. The flip side of the coin. What happens when, instead of too few, there are too many? Elephants in Africa, protected, increased in such large numbers that they invaded farmlands in search of food. Tinkering with natural balances had led to unseen problems. In England, too, royal parks were off limits for stag hunting. Until they became too many. They were then ‘culled’, not killed. Bureaucracy and semantics had come to the rescue! ( Bapoo Malcolm is a practising lawyer in Mumbai. Please email your comments to mail@moneylife.in )", "external_links": [], "published": "2015-08-04T11:55:00.000+03:00", "crawled": "2015-08-05T14:16:05.090+03:00", "highlightTitle": ""}