{"organizations": [], "uuid": "5fbf564999a93fcb86e0058ed60ccdb2a30784dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/housesale2-139x90_600x400.jpg", "site_section": "http://finance.yahoo.com/rss/PropertyManagement", "section_title": "Yahoo! Finance: Property Management Industry News", "url": "http://www.thestreet.com/story/13242235/1/avoid-zillow-until-concerns-about-its-business-model-are-resolved.html?puc=yahoo&cm_ven=YAHOO", "country": "GB", "title": "Avoid Zillow Until Concerns About Its Business Model Are Resolved", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Avoid Zillow Until Concerns About Its Business Model Are Resolved", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T16:06:00.000+03:00", "replies_count": 0, "uuid": "5fbf564999a93fcb86e0058ed60ccdb2a30784dd"}, "author": "", "url": "http://www.thestreet.com/story/13242235/1/avoid-zillow-until-concerns-about-its-business-model-are-resolved.html?puc=yahoo&cm_ven=YAHOO", "ord_in_thread": 0, "title": "Avoid Zillow Until Concerns About Its Business Model Are Resolved", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint \nNEW YORK ( TheStreet ) -- Concerns about Zillow's ( Z - Get Report ) business model should give investors pause about buying shares of the Internet real estate listing agent, which is scheduled to report fiscal second-quarter fiscal earnings after the close Wednesday. \nZillow will release earnings just two days before the chief financial officer is set to resign. Analysts expect a quarterly loss of 26 cents share on revenue of $168.7 million, with gross margins at 89.6%. \nFor the full fiscal year, analysts project that Zillow will record a loss of 5 cents a share on revenue of $666.5 million. \nIt is hard to understand how a company with an 89% gross margin can't generate an operating profit. For the years 2011 to 2014, Zillow generated total revenue of $706.3 million but posted a net loss of $49 million. \nMust Read: 13 Stocks to Buy for the Second Half of 2015 \nZillow's largest expense is sales and marketing. During that time, the company spent 49% of its revenue, or $351 million, on sales and marketing. \nZillow brings to mind Yelp ( YELP ) in that the business model has no leverage. In order to increase revenue, the company has to spend more on sales and marketing. \nOne would think that the profits would roll in, especially considering that Zillow claims to control 60% of the spending in the real estate portal industry. \nIn May, Zillow reported that it had 110 million pro-forma unique users. Although the number of users expanded 56%, organic growth slowed sequentially to 35% in the first quarter from 58% in the fourth quarter. \nThe competition is about to heat up, too. News Corp. ( NWS ) recently purchased Realtor.com and has promised to expand that company's advertising budget. \nAlthough Zillow and competitor Trulia ( TRLA ) have a 90% to 95% access to real estate listings, Realtor.com has upwards of 98% coverage with superior timeliness. Realtor.com has an advantage since its feeds are updated every 15 minutes because listings come directly from real estate agents' databases, while Zillow requires agents and brokers to manually update their listings. \nInvestors should avoid shares of Zillow until it becomes clear that the company can generate operating leverage from what amounts to free user-generated content. This article is commentary by an independent contributor. At the time of publication, the author held no position in the stocks mentioned. Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-08-04T16:06:00.000+03:00", "crawled": "2015-08-04T17:46:43.608+03:00", "highlightTitle": ""}