{"organizations": [], "uuid": "ce78f20fa9c6a3b968937d5b8d590d809a763d23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/20/diary-top-econ-idUSL3N10U4LG20150820", "country": "US", "title": "DIARY- Top Economic Events to Sept 2", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "DIARY- Top Economic Events to Sept 2 | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T04:01:00.000+03:00", "replies_count": 0, "uuid": "ce78f20fa9c6a3b968937d5b8d590d809a763d23"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/20/diary-top-econ-idUSL3N10U4LG20150820", "ord_in_thread": 0, "title": "DIARY- Top Economic Events to Sept 2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aug 20 For other diaries, please see:\nU.S. Federal Reserve\nPolling unit diary\nToday in Washington\nPolitical and general news\nIndex of all diaries\nMajor central bank events\n** This Diary is filed daily **\nTHURSDAY, AUGUST 20 JAKARTA, Indonesia - Federal Reserve Bank of San Francisco releases text of speech of President John Williams before the Bank Indonesia-BIS Research Conference in Jakarta - 0645 GMT. VIENNA - Austrian National Bank Governor Ewald Nowotny attends panel discussion on \"Europe's crisis: monetary policy, financial markets or real investments\" - 1130 GMT. SEOUL, South Korea - Federal Reserve Bank of Minneapolis President Narayana Kocherlakota speaks before the \"Macroeconomic Policy and Price Measurement Issues in a Low Inflation Environment\" conference - 0020 GMT. SYDNEY - Reserve Bank of Australia Deputy Head of Payments Policy (Financial System) Mark Manning participates in a panel discussion at the Risk Australia 2015 Conference - 0350 GMT. STOCKHOLM - Sweden's Riksbank holds Executive Board Meeting - 1100 GMT.\nFRIDAY, AUGUST 21 STOCKHOLM - Sweden's Riksbank First Deputy Governor Kerstin af Jochnick will speak on Current Monetary Policy and the Economic Situation - 0700 GMT.\nMONDAY, AUGUST 24\nBERKELEY, United States - Federal Reserve Bank of Atlanta President Dennis Lockhart speaks on \"Pensions and Economy\" before the 2015 Public Pension Funding Forum co-hosted by the National Conference On Public Employee Retirement Systems - 1955 GMT. MANNHEIM, Germany - 30th Annual Congress of the European Economic Association (to Aug. 27). Speakers: European Central Bank Vice President Vitor Constancio and ECB Chief Economist Peter Praet.\nTUESDAY, AUGUST 25\nMANNHEIM, Germany - European Central Bank Vice President Vitor Constancio speaks at the ECB session \"Effects of non-standard monetary policy measures: evidence and challenges\" at the 30th Annual Congress of the European Economic Association - 1040 GMT. STOCKHOLM - Sweden's Riksbank holds Executive Board Meeting - 0700 GMT. KINGSTON, Canada - Bank of Canada Deputy Governor Lawrence Schembri will speak at the Canadian Association for Business Economics' policy conference. WASHINGTON - Congressional Budget Office releases update to the \"Budget and Economic Outlook: 2015-2025\" - 1400 GMT. WEDNESDAY, AUGUST 26 SYDNEY - Reserve Bank of Australia Governor Glenn Stevens speaks at the National Reform Summit, hosted by The Australian and the Australian Financial Review. MANNHEIM, Germany - European Central Bank Chief Economist Peter Praet speaks at the session \"The Euro crisis and the role of different economic traditions\" at the 30th Annual Congress of the European Economic Association - 1040 GMT.\nTHURSDAY, AUGUST 27\nVIENNA - Western Balkans Summit. German Chancellor Angela Merkel, EU foreign policy chief Federica Mogherini, European Commission Vice President Maros Sefcovic, European Bank for Reconstruction and Development President Sir Suma Chakrabarti and prime ministers of Italy, Serbia, Slovenia, Croatia and Albania to attend. JACKSON HOLE, United States - Jackson Hole Economic Policy Symposium \"Inflation Dynamics and Monetary Policy\" (to Aug. 29). PARIS - European Central Bank board member Benoit Coeure speaks at the Conference of Ambassadors organized by the French ministry of foreign affairs in Paris - 1100 GMT.\nTUESDAY, SEPTEMBER 1\nREYKJAVIK - Launch of Economic Survey of Iceland 2015. NEW YORK - Federal Reserve Bank of Boston President Eric Rosengren speaks on the economic outlook before the Forecasters Club of New York - 1710 GMT. SYDNEY - Reserve Bank of Australia holds interest rate meeting - 0430 GMT. WEDNESDAY, SEPTEMBER 2\nWASHINGTON - Federal Reserve issues the Beige Book of economic conditions - 1800 GMT.", "external_links": [], "published": "2015-08-20T04:01:00.000+03:00", "crawled": "2015-08-20T03:21:55.774+03:00", "highlightTitle": ""}