{"organizations": [], "uuid": "6e6dc0a0a1d1693c6511772f01eb28bf8a0184c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/i28UcCa6MCOg/v0/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-03/a-towering-bond-trade-has-been-quietly-falling-apart", "country": "US", "title": "A Towering Bond Trade Has Been Quietly Falling Apart", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "A Towering Bond Trade Has Been Quietly Falling Apart - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T22:42:00.000+03:00", "replies_count": 0, "uuid": "6e6dc0a0a1d1693c6511772f01eb28bf8a0184c7"}, "author": "Tracy Alloway", "url": "http://www.bloomberg.com/news/articles/2015-08-03/a-towering-bond-trade-has-been-quietly-falling-apart", "ord_in_thread": 0, "title": "A Towering Bond Trade Has Been Quietly Falling Apart", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If credit ratings were food, AAA-rated bonds would be quinoa, healthy and entirely unsatisfying. BBB-rated debt might be roast potatoes, not so bad for you and flavorful. And CCC-rated debt would be a double cheeseburger with bacon, unhealthy but oh so very tasty .\nYears of low interest rates have encouraged some of the riskiest corporate borrowers to tap yield-hungry investors to finance their growth (or share buybacks and dividend payouts), spurring issuance of debt that comes with triple-C credit ratings. Such bonds are just a few notches above D for default and are typically classified as carrying \"substantial risks.\" For investors willing to shoulder the burden of those extra risks in exchange for heftier returns, CCC-rated bonds have been alluring.\nYou can see recent CCC issuance in the charts below, from Bank of America Merrill Lynch. Much of the burst in CCC sales came from energy companies such as shale drillers. Telecoms and health care, two industries that have been in the throes of consolidation in recent years, also played a significant role.\nSource:BofAML Source: Bloomberg But with worries over tumbling oil prices and a collapsing commodities complex, c-c-cracks are starting to show. Barclays analysts led by Bradley Rogoff note that the lowest-rated segment of the junk bond market has been the worst performer so far in 2015. While year-to-date returns are still (barely) positive, the weakness in CCC-rated debt compared to the broader high-yield index has been remarkable, and problematic for investors who have been chasing the junkier end of the junk spectrum. You can see the difference in yield between CCC bonds and the broader high-yield debt market in the chart below from Barclays.\nSource: Barclays The question now is whether investors continue to shirk CCC-rated debt or see its recent weakness as an opportunity to pick up some bonds on the cheap. Here&apos;s what the Barclays analysts have to say:\nDespite the evidence of building risks, the losses of the past two months appear to have been driven by fundamentals in one sector spilling over to technicals in the rest of the market. Commodity prices have dropped precipitously, and the relevant sectors have followed course, with high yield metals & mining down 9 percent and independent energy off 5 percent. While CCC returns that are approximately flat on the year have not been particularly painful, the declines in common hedge fund and distressed trades have been more extreme. For example, the admittedly small Ca – D portion of our Index has posted -30 percent returns, major defaulted credits such as Nortel are 20 points off their highs ... So while risks may be mounting over a longer horizon, on a short horizon (the next three months), we think we are more likely to see tightening than widening as the immediate technical pressures subside. If that happens, historical experience suggests that CCCs are likely to outperform.\nAccording to the analysts, CCC-rated bonds whose yields have increased significantly (denoting higher risk) compared to the high-yield index have beaten the wider junk market by an average of 6 percent in excess returns over the following three months. The analysts recommend that investors with sufficient digestive fortitude and optimistic views of the credit cycle go ahead and buy more triple-Cs.\nOver at BofAML, analysts led by Michael Contopoulos have very different advice. They don&apos;t like buying CCC-rated paper, and they don&apos;t even like buying safer investment-grade stuff as a substitute.\nWe discussed that portfolio managers would be much more discriminate about their holdings in 2015, and so far, that has clearly been the trend. There has been just one $375 million triple-C new issue in the last three weeks and two of the last three weeks have had just $805 million in issuance total. We think the trend towards higher quality continues, as so far buying the dips in higher beta paper hasn’t been a strategy that has paid during the last 12 months ... CCC spreads [have] widened relative to the high-yield index even as the market rallied into the first four months of the year. However, safety in quality may simply be a perception ... We don’t particularly like crowded trades (even if in “safer” sectors) as a likely backing out of high grade investors in double-B paper as rates increase and an influx of fallen angels could cause some weakness in the space.\nSomething to watch as August, with its traditionally thin credit trading volumes, proceeds.", "external_links": ["http://assets.bwbx.io/images/io6retRfBYNQ/v1/460x260.png\\", "http://assets.bwbx.io/images/iVg37DWJO02Y/v1/460x260.png\\", "http://assets.bwbx.io/images/ie_3DWSPEMpE/v1/460x260.jpg\\"], "published": "2015-08-03T22:42:00.000+03:00", "crawled": "2015-08-03T17:44:21.974+03:00", "highlightTitle": ""}