{"organizations": [], "uuid": "8d9a467de2d34ac495564c9efe01e56931a2024c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/27/caixa-ec-federal-results-idUSL1N1121E220150827", "country": "US", "title": "UPDATE 1-Brazil's Caixa mulls revising loan book growth guidance", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Brazil's Caixa mulls revising loan book growth guidance | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T21:36:00.000+03:00", "replies_count": 0, "uuid": "8d9a467de2d34ac495564c9efe01e56931a2024c"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/27/caixa-ec-federal-results-idUSL1N1121E220150827", "ord_in_thread": 0, "title": "UPDATE 1-Brazil's Caixa mulls revising loan book growth guidance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details on earnings, comments throughout)\nBy Guillermo Parra-Bernal and Aluísio Alves\nSAO PAULO Aug 27 (Reuters) - State-controlled Caixa Econômica Federal, Brazil's top mortgage lender, may revise loan book growth estimates for this year as a steep economic downturn and rising unemployment are hampering demand for new credit, Chief Financial Officer Márcio Percival said on Thursday.\nBrasilia-based Caixa will decide on whether to change so-called guidance, which forecasts loan book expansion, to between 12 percent and 16 percent this year, next month, Percival said in an interview to discuss second-quarter results. Caixa had trimmed guidance from a 14 percent-to-18 percent range in April.\nLast quarter, profit before one-off items fell 22 percent on a quarterly basis as a result of rising funding costs, flagging demand for credit and slumping income from securities trading. Recurring net income reached 631 million reais ($177 million) in the quarter, Caixa said in a statement.\nCaixa's loan book reached 648.1 billion reais, expanding 3.4 percent from the first quarter and 17.4 percent over the last 12 months. The pace of new disbursements will slow in coming months, Percival said.\nHis remarks underscore that the business outlook for banks will remain challenging as economic activity in Latin America's largest economy slumps. Economists expect Brazil's gross domestic product to shrink in 2015 and next year, which would be the first consecutive annual contractions since the 1930s.\nLoan delinquencies for 90 days or more remained largely stable at 2.9 percent of outstanding loans on a quarter-on-quarter basis. According to Alexsandra Camelo, Caixa's chief risk officer, the so-called default ratio may deteriorate further in coming quarters but will stay below Brazil's banking system's average of almost 5 percent.\nA reduction in loan-loss provisions that helped bolster profit reflected a slower loan book growth and does not represent a \"reversal of current provisioning policies,\" Camelo added.\nCamelo said Caixa has sold about 8 billion reais worth of delinquent loans so far this year. Additional sales of soured credit may take place, although at a less intense pace, she added.\nRecurring profit may rise through year-end as the highest borrowing costs in nine years allow Caixa to reprice new loans. The bank is working to bring down funding costs and keep non-interest expenses under control, Percival added.\n($1 = 3.5662 Brazilian reais) (Editing by Phil Berlowitz)", "external_links": [], "published": "2015-08-27T21:36:00.000+03:00", "crawled": "2015-08-27T20:44:07.696+03:00", "highlightTitle": ""}