{"organizations": ["Anglo American plc & SOCO International plc Really Worth Less", "Tullow Oil plc"], "uuid": "69bd0a7230641bd5cb948cb8379f68f983947789", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/tullow-oil-plc-anglo-american-071927198.html", "country": "US", "title": "Are Tullow Oil plc, Anglo American plc & SOCO International plc Really Worth Less Than In 2005?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Are Tullow Oil plc, Anglo American plc & SOCO International plc Really Worth Less Than In 2005?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T10:19:00.000+03:00", "replies_count": 0, "uuid": "69bd0a7230641bd5cb948cb8379f68f983947789"}, "author": "", "url": "https://uk.finance.yahoo.com/news/tullow-oil-plc-anglo-american-071927198.html", "ord_in_thread": 0, "title": "Are Tullow Oil plc, Anglo American plc & SOCO International plc Really Worth Less Than In 2005?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 20, 2015, 08:28 BST - UK Markets close in 8 hrs 2 mins Are Tullow Oil plc, Anglo American plc & SOCO International plc Really Worth Less Than In 2005? By Roland Head | Fool.co.uk – 8 minutes ago 191.50 -8.100 \nThe shakeout in the commodity market is becoming brutal. Shares in some major firms are now worth less than they were 10 years ago, in 2005. \nHere at the Fool, we generally advocate long-term investing, but shareholders in Tullow Oil (LSE: TLW), Anglo American (LSE: AAL) and SOCO International (LSE: SIA) may rightly feel this approach has not worked for them: \nShare price \n132p \n*Adjusted for 2010 4:1 share split \nThe biggest loser here appears to be Anglo American, where shareholders are 50% down on ten years ago. \nAt Tullow and SOCO, dividends and cash returns may mean that investors are still in the black. However, I suspect that when inflation and dealing costs are factored in, it's still a dismal picture. \nThe other side of the coin, of course, is that these companies' assets and liabilities have changed over this time, as have their earnings. Tullow, for example, has more oil and gas, but also more debt. \nAre any of these stocks compellingly cheap at today's prices? \nTullow Oil \nTullow shares rose from 43p in 1995 to an all-time high of 1,511p in February 2012, before beginning a dramatic descent that has wiped nearly £12bn off the firm's valuation in just 3.5 years. \nEnterprise value (market cap plus net debt) \n£1.25bn \n2P reserves (millions of barrels of oil equivalent) \n173.36 mmboe \n$11.27 \n$19.9 \nAlthough Tullow's market cap is now comparable to 2005, the firm's net debt has risen significantly, giving the firm a much higher enterprise value. Tullow's reserves have also risen during this period, but not enough to counteract this big rise in debt. \nAs a result, Tullow now has an EV/2P valuation of $19.90 per barrel of oil and gas reserves. That's 76% higher than in 2005. \nAlthough Tullow does have significant undeveloped assets, which are not reflected in its reserves, I'm going to steer clear of Tullow for a little longer. I'm not sure we've seen the bottom yet. \nAnglo American \nThese numbers highlight the cyclical nature of the mining business: \nEnterprise value (market cap plus net debt) \n£26.7bn \n$4.6bn \n$2.5bn \nWe are currently at a fairly low point in the cycle, in my view, although we may not yet be at the bottom. Despite this, I think Anglo shares look a fairly reasonable buy after recent falls. The current share price gives a 2015 forecast P/E of 12, falling to a P/E of 10 for 2016. \nIncome hunters should probably treat Anglo's prospective yield of 7.1% with caution, however. If current market conditions persist into 2016, I'd expect this payout to be cut. \nSOCO International \nSOCO shareholders received a painful blow in March, when the firm admitted that its proven and probable reserves had been downgraded from 125.1 mmboe to just 40.8 mmboe. This reduction was due to lower oil and gas prices making the economic viability of some of resources uncertain. \nSOCO shares nosedived and have yet to recover. \nEnterprise value (market cap plus net debt) \nc.£75m \n2P reserves (millions of barrels of oil equivalent) \n133.2 mmboe \n$0.90 \n$14.2 \nAs the figures above show, the firm looks considerably more expensive on an EV/2P basis than it did in 2005. Without further research, I'm not sure whether the balance of oil and gas in SOCO's reserves has changed over this period, which might help explain the extreme valuation difference between 2005 and 2015. \nRegardless of this, SOCO's EV/2P of $14.2 per barrel doesn't look especially cheap to me. With the dividend expected to fall by 50% in 2016, I wouldn't rush to buy quite yet. \nHowever, the problem with cyclical stocks is that you cannot usually identify the peaks and troughs until they have passed. \nThat's why it makes sense to include some defensive stocks in your portfolio. \nFive potential buys for long-term investors who don't want to be burned by the next commodity downturn are featured in \" 5 Shares To Retire On \" . \nThe Motley Fool's top experts believe the companies featured in this report are likely to be long-term outperformers that can deliver growth and a rising income over many years. \nI've been impressed by several of these selections and would urge you to take a look. \nThis report is FREE and carries no obligation . \nTo receive your copy today, just click here now . \nRoland Head owns shares of Anglo American. The Motley Fool UK has recommended Tullow Oil. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-20T10:19:00.000+03:00", "crawled": "2015-08-20T10:29:06.268+03:00", "highlightTitle": ""}