{"organizations": [], "uuid": "782b0704b86ac4342e8e10c742a04cc1685b8a41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/over-the-barrel-the-advent-of-the-social-entrepreneur/113259", "country": "IE", "title": "Over the barrel: The advent of the social entrepreneur", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Over the barrel: The advent of the social entrepreneur | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T08:21:00.000+03:00", "replies_count": 0, "uuid": "782b0704b86ac4342e8e10c742a04cc1685b8a41"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/over-the-barrel-the-advent-of-the-social-entrepreneur/113259", "ord_in_thread": 0, "title": "Over the barrel: The advent of the social entrepreneur", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Editorial: Can’t bank on Parliament Editorial: Whodunnit? No porn Sight Corporates have scrambled to meet their corporate social responsibility (CSR) obligations under the new Companies Act, 2013. This is not a surprise, as most companies have not regarded CSR as a business priority. The positive outcome is that the Act has compelled an introspection. Jeremy Rifkin’s latest book, The Zero Marginal Cost Society, contains within it the seeds of an idea that, if developed, could generate a bigger social bang for the corporate buck than the current financially focused approach to CSR.\nThe government notified Section 35 and Schedule VII of the new Companies Act, 2013, for implementation from April 1, 2014. The Act requires corporates that meet a defined threshold criterion of net worth, turnover or profits, to set aside 2% of their average net profits earned over the preceding three years for CSR. It was estimated that R14,000 crore would be spent for this purpose during the fiscal year 2014-15. In fact, much less has been spent. The Act is not mandatory, but it does require companies to “comply or explain”. Most companies are now drafting the explanations.\nThe inability of companies to comply is in part because the Act has not been well-drafted. There is still considerable confusion as to what qualifies as CSR-spend and what does not. But more than that, it is because companies have seldom placed CSR high on their business agenda. Most have subscribed to the Milton Friedman dictum “the business of business is business”. Funds have, of course, been allocated for social projects, but seldom out of social conviction. It has been done to please political and bureaucratic leaders, or to secure public support for specific project investments.\nThis approach may now be changing. There is growing recognition that in today’s connected world, social capital is a critical asset for building corporate reputation. Further, the Act has also had an impact. Companies are required to set up a board subcommittee chaired by a non-executive, independent director to review and define the CSR policy. This requirement has compelled introspective discussion of the fundamentals of CSR. Boards are now asking: Should the company limit its CSR involvement to simply meeting the financial obligations set down in the Act? Or should it get more deeply engaged in tackling the systemic problems of society?\nRifkin’s book is not about CSR, but its language does suggest a model for companies to make a more meaningful impact on social development.\nRifkin writes about the “third industrial revolution” and the new economic paradigm that will drive it. His thesis is that information technology and bandwidth will break down the conventional boundaries that have hitherto confined information flows and economic decisions within centralised, vertically structured, exclusive and profit-oriented organisations. As a result, relationships will be built around “distributed, lateral, peer-to-peer, and sharing” structures. A “collaborative commons” will come into being where success will be measured by the contribution made to improving public well-being and not by the return on capital invested.\nThe traditional “dichotomies of right versus left, socialism versus capitalism” will be rejected and profits will dry up, as the cost of producing an extra unit will be driven to zero. The raison d’etre of capitalism will come under severe challenge. Rifkin points to the exponential increase of social entrepreneurship as evidence of this emergent trend. He writes that social entrepreneurs look for returns not through the “invisible hand” of the market but through the “helping hand” of collaborative partnerships between their social enterprise and the community. While they accept the importance of “people, planet and profits”, they would rank “people and the planet” ahead of “profits” if push came to shove.\nRifkin’s thesis will not resonate in India because there is a huge swath of the country still waiting for the “second industrial revolution”. But in the context of the current discussion on CSR, Rifkin’s notion of a “collaborative commons” has relevance. It suggests that corporates should occupy the space created by the collaborative commons; that they should jettison their current siloed approach to CSR and adopt instead an intra-corporate partnership approach; and that the partnerships so created should endeavour to lever not only the conjoint financial resources of the partners but also their non-financial assets.\nToday, companies are not engaged with the beneficiary community. They provide money to build toilets, but they leave unaddressed the problem of locating the septic tank. They construct schools, but do little about enhancing the quality of education. They give money, but they have no understanding of the subculture of poverty. The result is that their contribution has had a limited impact. What they should do is take a holistic approach. They need to acknowledge that there is no silver bullet solution to the problems of poverty and that, while they have expertise, it is not of a breadth that can deliver end-to-end responses to these problems. What can make a difference are partnerships wherein the sum of the parts is greater than the whole. Take, for instance, a social enterprise between Wipro, NIIT, Larsen and Toubro (L&T) and Unilever. Each has specific domain knowledge, such as Wipro in technology, NIIT in education, L&T in engineering and project management; and Hindustan Unilever in marketing and distribution. Singly, these companies can make a meaningful and sustainable impact in their area of expertise alone. But together, given the complementarity of their assets, they can shift the needle systemically.\nResponsible corporates have long discarded the Milton Friedman dictum from their public vocabulary. They have not, however, excised it from their ethos. The new Companies Act has made CSR a financial obligation, but it is still a secondary priority. Rifkin is forewarning business that their key stakeholders (customers, employees and shareholders) are moving towards the collaborative commons and that they, too, must follow. Whether Indian business heeds this warning or not, the government would do well to take advantage of the debate taking place by tweaking Section 35 and Schedule VII of the Act and by encouraging such a move.\nThe author is chairman of Brookings India and senior fellow, Brookings Institution\nFirst Published on August 04, 2015 12:21 am", "external_links": [], "published": "2015-08-04T08:21:00.000+03:00", "crawled": "2015-08-04T05:59:13.330+03:00", "highlightTitle": ""}