{"organizations": [], "uuid": "31e88547b49d4a8551dc2be5384afbf4f253991d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/r/4/s/q/image.related.afrArticleLead.620x365.gir4p5.png/1438719388919.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/how-it-all-turned-bad-for-the-abbott-government-20150804-gir4p5", "country": "AU", "title": "How it all turned bad for the Abbott government", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How it all turned bad for the Abbott government | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T16:04:00.000+03:00", "replies_count": 0, "uuid": "31e88547b49d4a8551dc2be5384afbf4f253991d"}, "author": "Phillip Coorey", "url": "http://www.afr.com/news/politics/how-it-all-turned-bad-for-the-abbott-government-20150804-gir4p5", "ord_in_thread": 0, "title": "How it all turned bad for the Abbott government", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Abbott is copping flak from both ends of the spectrum. Jesse Marlow Share on twitter by Phillip Coorey It is a political truism that once things start going wrong, everything goes wrong, more so the harder you try.\nIn the past 48 hours the Abbott government, eager to emerge from the mire of Bronwyn Bishop's travel largesse, a has fallen foul of the ACTU, the Business Council of Australia, Indigenous elders and the Victorian government.\nEven Mrs Bishop, hitherto Tony Abbott's most loyal supporter in the party room, would be no longer even a little bit rusted on after the embattled Prime Minister threw her under a bus on Tuesday by declaring her political career over. She responded by indicating she would run again at the next election.\nBack in the days when Labor was as popular as rat poison and the Coalition could do no wrong, Abbott laid out a pretty simple plan. Introduce a tough first budget which voters would begrudgingly accept as mean but necessary, and ultimately respect you for.\nBy this stage of the cycle, they would be gagging for economic reform and this is where all the promised white papers and reviews would kick in with bold ideas to take to the next election.\nInstead, Abbott and his his team were in Adelaide on Tuesday, promising to build ships there to ameliorate the visceral anger caused by the broken promise over submarines, the hamfisted handling of the demise of the car industry and broken promises in the first budget.\nSimultaneously in Canberra, the Productivity Commission was handing down the draft report on the the industrial relations overhaul the government had long ago commissioned. The PC was never going to recommend anything mild, thus the recommendation of Work Choices-style individual contacts for small business employees.\nThe government won't touch any of it with a stick but that didn't stop the ACTU piling on with a vigour it has not had since Work Choices.\n On the same day, the government was being belted at the other end of the spectrum with the BCA leading moves to scuttle cabinet deliberations to introduce an effects test.\nTorn between Alan Jones and the BCA, the government is leaning towards the demands of the former and its traditional business ally is not happy.\nThe shipbuilding announcement may have calmed down things in SA but the Victorians are now fretting about the future of the Williamtown yards.\n\"I do fear that Tony Abbott is far more concerned about Christopher Pyne's job than the jobs of hundreds of Victorian shipbuilders and that is a disgrace,\" said Premier Daniel Andrews.\nRight now, the PM could use a friend.", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-08-04T16:04:00.000+03:00", "crawled": "2015-08-05T01:07:31.914+03:00", "highlightTitle": ""}