{"organizations": [], "uuid": "0d8d376f71fd17c6beeac41c5a4f4b51b34dab10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbn.com", "main_image": "", "site_section": "http://www.cbn.com/cbnnews/finance/feed/", "section_title": "CBN.com - Finance", "url": "http://www.cbn.com/cbnnews/finance/2015/August/Americas-Infinite-Resource-Oil/", "country": "US", "title": "America's Infinite Resource: Oil - Finance - CBN News - Christian News 24-7 - CBN.com", "performance_score": 0, "site": "cbn.com", "participants_count": 1, "title_full": "America's Infinite Resource: Oil - Finance - CBN News - Christian News 24-7 - CBN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "0d8d376f71fd17c6beeac41c5a4f4b51b34dab10"}, "author": "Stephen Moore", "url": "http://www.cbn.com/cbnnews/finance/2015/August/Americas-Infinite-Resource-Oil/", "ord_in_thread": 0, "title": "America's Infinite Resource: Oil - Finance - CBN News - Christian News 24-7 - CBN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"The United States of America cannot afford to bet our long-term prosperity, our long-term security on a resource that will eventually run out, and even before it runs out will get more expensive to extract from the ground.\" Barack Obama, 2011.\nA century and a half ago, in August of 1859 on the eve of the Civil War, Col. Edwin Laurentine Drake completed the first commercial oil well in the United States on Oil Creek, just outside of Titusville, Pennsylvania. Over the next 155-some years oil and gas companies have drilled tens of billions of barrels of oil from the ground, from California to New York and nearly everywhere in between.\nOver that time period one thing has been constant: doomsayers and declinists have predicted that we would soon drill the last barrel of oil. Famously in the 1920s, the U.S. Department of Interior projected less than a few decades worth of recoverable oil in the United States.‎ Jimmy Carter declared in 1980 that by 2000 we'd be nearly out of oil - running on empty.\nLast month, the Department of Energy reported that the United States hit a new energy milestone: we produced 9.52 million barrels a day. That was very close to the highest output level in recorded history. So much for running out.\nSomething else has happened in recent weeks that almost no one - least of all President Obama - would have predicted. The price of oil fell below $40 a barrel.\nAdjusted for inflation, that makes oil cheaper today than almost at anytime in history. These are nearly the lowest prices ever. Adjusted for wages, we work less to get gasoline and oil today than ever before.\nWelcome to the age of oil and gas abundance. One of the people who predicted all of this 40 years ago was the late, great economist Julian Simon. While the rest of the world, led by cultural icons like doomsdayer Paul Ehrlich of Stanford, ‎were assuring us that the end was nigh when it came to oil, food, copper, tin, farmland and that the earth would soon be freezing over because of cooling trends, it was Julian Simon who declared they were all wrong.\nHe was regarded as a lunatic, in today's leftwing jargon, a \"denier.\" But he was right and the \"scientific consensus\" was entirely and almost negligently wrong.\nThe experts at the Institute for Energy Research recently published an inventory of American energy given current technological capabilities. Figure x shows that we have 500 years worth of coal and natural gas and at least 200 years worth of oil. The wellspring of energy in America will never, ever run dry.\nThe reason we never run out of \"finite\" resources is that human ingenuity runs forward at a far faster pace than the rate we use up oil or gas or food. The shale oil and gas revolution, thanks to fracking technologies, nearly tripled overnight our ‎oil and gas reserves. We now produce three times as much food with one-third as much manpower at one-third the cost than we did in 1950.\nThat the leftwing doomsdayers have been time and again discredited in their Malthusian warnings has several policy implications. First, would you keep buying stock from a broker who kept giving you all the wrong advice and losing you money?\nWell then why do we listen to the same crowd of doomsayers who still say we are running out of oil or that the earth is going to heat up into a fire ball? Their credibility and their \"scientific consensus\" has rarely been right. They are literally the sheep that cries wolf over and over.\nSecond, there are high costs to false fears. Obama has many times justified the $100 billion we've wasted on renewable energy subsidies because we're running out of oil.\nThird, many of the same Malthusians who told us we were running out of oil and food are the intellectual giants behind the global warming industry. These are the one's who say that the debate is over on global warming, that they can't possibly be wrong, that the science is settled, and that those who question their religion are bought off by the Koch brothers or big oil.\nGiven their abysmal track record, is it asking so much for them to believe that they might just be wrong?\nSeveral years ago, I declared on a television show ‎that America will never run out of oil and gas and that our supplies are inexhaustible. I was flooded with angry letters and emails.\nMy favorite note came from a junior high school science teacher who wrote me: \"How could you say such a stupid thing. Even my sixth graders understand that oil is a finite resource.\"\nWell, a sixth grader might believe that tripe.\nWhat is disconcerting is that the president of the United States, the media, and many \"scientists\" still believe it. ‎Paul Ehrlich once said that the one thing the world will never run out of \"is idiots.\" Alas, he was for once right.\n*Stephen Moore is a CBN economics contributor and an economic consultant to Freedom Works.", "external_links": [], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-28T22:53:40.726+03:00", "highlightTitle": ""}