{"organizations": [], "uuid": "aecbc5bbfee8a68212b135ec22470e526e4e98d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/11/china-markets-yuan-currencies-idUSL5N10M26720150811", "country": "US", "title": "UPDATE 1-Central banks hold nerve after China depreciation", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Central banks hold nerve after China depreciation | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T16:55:00.000+03:00", "replies_count": 0, "uuid": "aecbc5bbfee8a68212b135ec22470e526e4e98d1"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/11/china-markets-yuan-currencies-idUSL5N10M26720150811", "ord_in_thread": 0, "title": "UPDATE 1-Central banks hold nerve after China depreciation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds South Africa, Bank of England, yuan graphic)\nSINGAPORE/LONDON Aug 11 (Reuters) - Global policymakers, including those at some of Asia's most intervention-minded central banks, are holding the line on their currency policies after China's surprise devaluation of the yuan.\nChina's central bank said Tuesday's 1.9 percent devaluation was a one-off move. It also switched to a more market-determined benchmark for the currency's daily trading band.\nA weaker yuan makes Chinese exports cheaper and competing exports more expensive. Countries that see themselves at a competitive disadvantage might be tempted to devalue their own currencies in retaliation. But so far policymakers from South Korea, India, Indonesia and Japan see no reason for tit-for-tat trade-war policies.\n\"I don't think the move would trigger a global currency war,\" a Japanese policymaker said.\nThe devaluation is unlikely to perturb the Bank of Japan, whose money-printing programme to stimulate the economy has weakened the yen by 50 percent against the dollar since 2012.\nBeijing's move may reverberate more strongly in South Korea. China is its largest trading partner, accounting for a fifth of total trade last year. Its policymakers have been talking down the won and actively encouraging outflows from their country, and the won has weakened against the yuan this year.\n\"We are not overly worried about the won, but we are closely watching the market to see if there's any excessive volatility happening,\" a South Korean foreign exchange official said.\n\"This came as emerging-market currencies have already been depreciating against the dollar,\" he said, but the yuan remained relatively stable.\nMost emerging market currencies have weakened this year. Commodity-linked ones such as the Malaysian ringgit, Indonesian rupiah and South African rand are at their lowest in well over a decade against the greenback.\nAlready weak metals and crude oil prices lost more ground as the devaluation fanned more worries about China's economy\n\"To the extent that the yuan has been devalued, what you are going to see is that it would impact on the competitiveness of South Africa's manufactured exports to China, but we do not sell a lot of manufactured exports to China,\" Lesetja Kganyago, governor of the Reserve Bank of South Africa, said.\n\"That as it might be, the yuan had been relatively stable and we have seen significant depreciation in the domestic currency over the past 18 months,\" he added, referring to the rand's 9 percent fall this year to the dollar.\nSOME MARGIN BEFORE CONCERN\nMost central banks appear willing to give Beijing's policy the benefit of the doubt, hoping economic recovery in China, the world's second-largest economy, will be the rising tide that eventually lifts all boats.\nThe Bank of England, for instance, said last week that Chinese demand was critical to the health of the global economy, and further yuan appreciation would probably reduce demand elsewhere for its exports.\nThe yuan has risen by more than 18 percent in trade-weighted and inflation-adjusted terms against the currencies of its trading partners since the middle of last year, analysts estimate. That suggests there is some margin before depreciation starts to raise concerns over trade competitiveness.\nSince 2005 when the fixed yuan peg was loosened, it has risen steadily: link.reuters.com/gef35w\nThis year, the yuan is down barely 2 percent against the dollar, versus a 13 percent decline in the Malaysian ringgit , a near 8 percent drop in the won and a 4 percent-plus fall in the yen.\nSince the \"taper tantrum\" of May 2013, when talk of ending the U.S. quantitative easing programme sparked an emerging market selloff, the yuan has fallen 3 percent against the dollar, while the yen has lost 23 percent and the euro 18 percent. Some currencies, such as Indonesia's rupiah, are down as much as 25 percent, Societe Generale estimated.\nSenior Deputy Governor Mirza Adityaswara at Indonesia's central bank pointed to how undervalued the rupiah already was, precluding the need for further depreciation. It has fallen more than 8 percent this year.\n\"China is playing catch-up rather than being the leader of this currency weakness,\" said Mitul Kotecha, head of currency and rates strategy at Barclays in Singapore.\nThe Indian rupee is one of the few emerging currencies with smaller losses than the yuan in 2015, thanks to foreign investment flows attracted to India's strong economy.\n\"It is like jogging - everyone has to keep pace so that at the end on a relative basis you don't lose,\" a senior Indian policymaker told Reuters.\n\"We have to carefully balance the rupee so that the country doesn't lose ground on the external side and neither do we import lot of inflation. (Reporting by Rajesh Kumar Singh in New Delhi, Suvashree Dey Choudhury in Mumbai, Yoo Choonsik in Seoul, Gayatri Suroyo in Jakarta, Tetsushi Kajimoto and Leika Kihara in Tokyo, Stella Mapensauzwa in Johannesburg and David Milliken in London; Writing by Vidya Ranganathan and Sujata Rao; Editing by Will Waterman, Larry King)", "external_links": [], "published": "2015-08-11T16:55:00.000+03:00", "crawled": "2015-08-11T16:04:25.320+03:00", "highlightTitle": ""}