{"organizations": [], "uuid": "d5fa1c8271b298dc9832567e92c1f62295e98ee9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/PropertyManagement", "section_title": "Yahoo! Finance: Property Management Industry News", "url": "http://finance.yahoo.com/news/cartus-launch-fifth-consecutive-010000211.html", "country": "GB", "title": "Cartus to Launch Fifth Consecutive", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Cartus to Launch Fifth Consecutive", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T04:00:00.000+03:00", "replies_count": 0, "uuid": "d5fa1c8271b298dc9832567e92c1f62295e98ee9"}, "author": "", "url": "http://finance.yahoo.com/news/cartus-launch-fifth-consecutive-010000211.html", "ord_in_thread": 0, "title": "Cartus to Launch Fifth Consecutive", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cartus"], "text": "Cartus to Launch Fifth Consecutive - Relocation's Biggest Challenges Survey Content preferences Done \nDANBURY, Conn., Aug. 20, 2015 /PRNewswire/ -- Cartus Corporation —the leading global mobility firm that offers its services in 185 countries, and who last year assisted more than 171,000 transferees—announces the launch of its fifth annual award-winning Trends in Global Relocation: Biggest Challenges survey. Companies large and small around the globe have previously contributed to what has become one of the relocation industry's most anticipated sources of current industry trends. \nLogo - http://photos.prnewswire.com/prnh/20140311/MM81238LOGO \nRespondents will have an opportunity to share their insights and perspectives on the relocation industry's biggest issues and what they believe are some of the best practices in global relocation. \nAn important component of Cartus' Trends in Global Relocation research series, the Relocation's Biggest Challenges surveys have produced insights on issues such as compliance, costs, and infrastructure challenges in countries around the world. This year, it also contains questions related to move types and companies' progress in Talent Management initiatives. \nRelocation managers who are responsible for their company's program in any part of the globe—in one region, or several—are urged to participate in this survey . Participants will receive a free copy of the survey results and gain an unparalleled perspective on the relocation industry's latest policies and practices. \nAbout Cartus Cartus provides trusted guidance to organizations of all types and sizes that require global relocation solutions. This year marks the 60 th anniversary for Cartus, which serves more than half of the Fortune 50 and offers its services in 185 countries, providing companies around the world with the full spectrum of relocation services, including language and intercultural training. Cartus is part of Realogy Holdings Corp. ( RLGY ), a global leader in real estate franchising and provider of real estate brokerage, relocation and settlement services. To find out how our greater experience, reach, and hands-on guidance can help your company, visit www.cartus.com click www.realogy.com for more information. Contact:", "external_links": [], "published": "2015-08-20T04:00:00.000+03:00", "crawled": "2015-08-20T05:26:59.281+03:00", "highlightTitle": ""}