{"organizations": [], "uuid": "b37395cc6e074bc7a089967a975a24213a9d3524", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static6.businessinsider.com/image/55ca1b3c2acae716008bf330/new-yorks-transportation-problems-go-far-beyond-laguardia-airport.jpg", "site_section": "http://feedproxy.google.com/clusterstock?format=xml", "section_title": "Finance", "url": "http://www.businessinsider.com/laguardia-airport-rethink-nyc-2015-8", "country": "IL", "title": "New York’s transportation problems go far beyond LaGuardia Airport", "performance_score": 0, "site": "businessinsider.com", "participants_count": 1, "title_full": "New York’s transportation problems go far beyond LaGuardia Airport", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T20:21:00.000+03:00", "replies_count": 0, "uuid": "b37395cc6e074bc7a089967a975a24213a9d3524"}, "author": "Graham Rapier", "url": "http://www.businessinsider.com/laguardia-airport-rethink-nyc-2015-8", "ord_in_thread": 0, "title": "New York’s transportation problems go far beyond LaGuardia Airport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You have successfully emailed the post. New York’s transportation problems go far beyond LaGuardia Airport Aug. 11, 2015, 1:21 PM 17 Frank Eltman/AP images Passengers maneuver through cramped hallways at New York's LaGuardia Airport. See Also Why Cuomo's $4 billion plan to overhaul LaGuardia doesn't impress New Yorkers Last month, Vice President Joe Biden joined New York Governor Andrew Cuomo to unveil a much needed $4 billion renovation to New York’s “third world” LaGuardia airport. Criticism of the plan to revitalize New York’s smallest and most despised airport came quickly . Most notably, there were complaints about a lack of adequate transportation to the terminals and decreased parking on site. While politicians patted themselves on the back in front of the decaying terminal, thousands of commuters faced repeated delays into and out of Penn Station, the busiest rail hub in North America, due to issues with aging infrastructure in the century-old tunnels beneath the Hudson River. A group called ReThink NYC has a plant to alleviate both of these issues, ease Penn Station overcrowding, raise the airport above the flood plane it currently inhabits and extend the runways to standard length. The hallmark of their proposal is an inter-modal rail hub, with connections to Amtrak and Metro-North, as well as a hotel and convention center, in the Bronx just across the bay from LaGuardia. ReThnkNYC ReThink NYC's proposal for a more connected LaGuardia. The lead designer of the group, Jim Venturi, told Business Insider that inspiration for the lofty plans came from the recently opened Fulton Center, a retail and transit complex near the World Trade Center, which overran projected time and costs to the tune of seven years and $650 million . “I thought ‘I have other ways to spend $1.4 billion dollars,’” said Venturi. “And eventually I thought to myself ‘well instead of criticizing someone else’s things why don't I come up with my own ideas?’” ReThink NYC’s plan solves more than just LaGuardia’s woes. It would also increase capacity at the clogged Penn Station, open space in the Sunnyside Yard, where trains from Penn Station bide their time between commuter runs, and allow easier access to the airport from the Northern Suburbs. ReThink NYC Rail capacity in the region would be greatly increased. “If you look at what Biden said least year , and you compare that with the scheme that was proposed, it doesn’t meet the goals that Biden set out,” said Venturi. “It is an evolutionary change, not a revolutionary one, and Biden specifically counseled against that.” It’s a big bet, and certainly won’t be cheap or easy, but big projects are what’s missing in the new New York, Venturi believes. “LaGuardia, with it’s proximity to the Northeast Corridor, has the opportunity to become the greatest rail connected airport in the world,” he said. “And its not hard to do it.”", "external_links": [], "published": "2015-08-11T20:21:00.000+03:00", "crawled": "2015-08-11T20:32:51.778+03:00", "highlightTitle": ""}