{"organizations": [], "uuid": "a2c501083c48ae4a9a688f46aca0e7bb8020f3e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/slightly-higher-due-us-dollar-073513157.html", "country": "GB", "title": "$A slightly higher due to US dollar falls", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "$A slightly higher due to US dollar falls", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T10:43:00.000+03:00", "replies_count": 0, "uuid": "a2c501083c48ae4a9a688f46aca0e7bb8020f3e8"}, "author": "", "url": "https://au.finance.yahoo.com/news/slightly-higher-due-us-dollar-073513157.html", "ord_in_thread": 0, "title": "$A slightly higher due to US dollar falls", "locations": ["US", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mon, Aug 3, 2015, 5:53 PM AEST - Australia Markets closed $A slightly higher due to US dollar falls AAP – 10 minutes ago Print \nThe Australian dollar has finished slightly higher as concerns a US interest rate hike could be delayed weighs on the greenback. \nAt 1700 AEST on Monday, the currency was trading at 72.99 US cents, up from 72.84 cents on Friday. \nThe Aussie dipped slightly during the morning session when a key gauge of Chinese factory activity plunged to a two-year low. \nHowever, further falls in the US dollar has buoyed the Aussie, IG chief market strategist Chris Weston said. \nHe said Friday's surprisingly weak US wage inflation data has fuelled concern that the US Federal Reserve could delay lifting the Federal Funds rate. \n\"Asian traders have been paring back some of their US dollar exposure today because of what we saw from the employer cost index,\" he said. \n\"The weak read has seen the probability of a September US rate hike drop from 48 per cent to 40 per cent. \n\"This has been the biggest driver for the Aussie dollar than the Chinese manufacturing numbers.\" \nThe US employment cost index grew at its slowest pace in nearly three decades in the second quarter. \nUS wages and salaries rose 0.2 per cent in the second quarter, decelerating from 0.7 per cent growth in the first. \nMeanwhile, a bank holiday in NSW and the ACT on Monday had created a quiet local trading day. \nThe Reserve Bank's interest rate decision and monetary statement due Tuesday afternoon are the next big events on the economic calendar. \nAt 1700 AEST, the Australian dollar was at 90.53 Japanese yen, up from Friday's close of 90.48 yen, and at 66.40 euro cents, down from 66.48 euro cents. \nMeanwhile, the bond market was firmer. \nAt 1630 AEST on Monday, the September 2015 10-year bond futures contract was trading at 97.210 (implying a yield of 2.790 per cent), up from 97.205 (2.795 per cent) on Friday. \nThe September 2015 three-year bond futures contract was at 98.100 (1.900 per cent), up from 98.090 (1.910 per cent). @y7finance on Twitter, become a fan on Facebook Rio extends offer to work with explorers AAP \nMining giant Rio Tinto is eager to work with junior exploration companies to develop the next high quality mine. …", "external_links": [], "published": "2015-08-03T10:43:00.000+03:00", "crawled": "2015-08-03T10:54:27.222+03:00", "highlightTitle": ""}