{"organizations": [], "uuid": "19c3a19d9ab7c26f61f8f5641ac5ded031f93a8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/18/emergingmarkets-debt-volume-idUSL1N10T1B320150818", "country": "US", "title": "Emerging market debt trading volumes down 27 pct in Q2", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Emerging market debt trading volumes down 27 pct in Q2 | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T21:18:00.000+03:00", "replies_count": 0, "uuid": "19c3a19d9ab7c26f61f8f5641ac5ded031f93a8f"}, "author": "Daniel Bases", "url": "http://www.reuters.com/article/2015/08/18/emergingmarkets-debt-volume-idUSL1N10T1B320150818", "ord_in_thread": 0, "title": "Emerging market debt trading volumes down 27 pct in Q2", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK Aug 18 Emerging market debt trading volumes fell to $1.211 trillion in the second quarter of 2015, from $1.668 trillion in the same period a year ago, due to economic weakness in the sector and regulations tied to the Volcker Rule, a new survey showed.\nSecond-quarter trading volumes declined 27 percent versus a year ago, but fell only 1 percent from the first quarter of 2015, EMTA, the association for the emerging markets debt trading industry, said in a statement.\n\"EM's weakening fundamentals have also played an important role, underpinning relentless outflows from both local and hard currency funds,\" Drausio Giacomelli, head of emerging markets research at Deutsche Bank, said in EMTA's statement.\n\"And the implementation of the 'Volcker Rule' starting in July is also a key factor, as dealers may have been forced to scale back their inventories and market-making activities to conform with the new regulations,\" he added.\nThe so-called Volcker Rule, named for former U.S. Federal Reserve Chairman Paul Volcker, is meant to curb the risky proprietary trading blamed for worsening the 2007-2009 financial crisis.\nLocal market debt instruments accounted for 60 percent of total reported volume, or $721 billion, a 30 percent decline on a year-on-year basis, EMTA said.\nMexican local market debt volumes were the highest in the category at $219 billion, followed by Brazil with $93 billion, South Africa at $82 billion, India at $69 billion and South Korea at $38 billion.\nEurobond trading volumes fell 23 percent to $487 billion year-on-year in the second quarter. Sovereign bonds made up 51 percent of Eurobond volumes. Corporate Eurobonds accounted for 46 percent of the category's trading volume.\nRussia's 2030 issue and Brazil's 2025 bond, each with approximately $8 billion in turnover, were the most traded Eurobonds. Brazil's 2045 bond followed at $4 billion, while Mexico's 2025 bond and Ukraine's 2017 bond each had $3 billion in turnover.\nMexican instruments were the overall leaders with $266 billion in total volume, up 3 percent from a year ago.\n\"Less inventory and liquidity in EM generally, favoring more stable and deeper markets, such as Mexico's,\" Giacomelli said\nBrazilian debt instruments, the second most actively traded, saw volume drop 36 percent year-on-year to $159 billion. South African debt volumes rose 20 percent during the same period to $92 billion.\nEMTA surveyed 50 participants, seven more than the first quarter of 2015 but equal to the number tallied a year ago. (Reporting by Daniel Bases; Editing by Paul Simao)", "external_links": [], "published": "2015-08-18T21:18:00.000+03:00", "crawled": "2015-08-18T20:25:56.675+03:00", "highlightTitle": ""}