{"organizations": [], "uuid": "c6a53481356bd185383433b9ecaba0e2161347e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/7/q/h/m/image.related.thumbnail.320x214.gj7q9m.png/1440547612800.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/15/materials", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/markets/unhappy-chinese-investors-kidnap-fanya-metals-exchange-boss-shan-jiuliang-20150825-gj7q9m.html", "country": "AU", "title": "Chinese investors kidnap Fanya Metals Exchange boss Shan Jiuliang", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Chinese investors kidnap Fanya Metals Exchange boss Shan Jiuliang", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "c6a53481356bd185383433b9ecaba0e2161347e7"}, "author": "The Sydney Morning Herald", "url": "http://www.smh.com.au/business/markets/unhappy-chinese-investors-kidnap-fanya-metals-exchange-boss-shan-jiuliang-20150825-gj7q9m.html", "ord_in_thread": 0, "title": "Chinese investors kidnap Fanya Metals Exchange boss Shan Jiuliang", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended #makearhino hopes IVF can save the white rhino\nSyrian temple destroyed by Islamic State\nAfrica keeps duty-free access to US\nUnivision anchor thrown out of Trump event\nRefugee girl born on navy ship\nReplay video Return to video Video settings Please Log in to update your video settings\nChina cuts rates to halt stocks plunge A move from China's Central Bank to kick start its wavering economy was welcomed by investors. Shares, oil and core bond yields all extended gains in midsession European trade on Tuesday.\nPT1M37S 620 349 Autoplay On Off Video feedback Video settings Furious investors have kidnapped the head of a Chinese exchange for minor metal trading from his hotel and handed him to police, the Financial Times (FT) has reported.\nThe investors were angry that authorities had failed to find out why their funds had been frozen and believed by handing over Fanya Metals Exchange boss Shan Jiuliang to police they could spark an investigation.\nThe FT reported investors had been protesting for weeks about their funds being frozen at the exchange which is based in the southwestern city of Kunming and traded minor metals. It also offered high interest investment products from offices in Shanghai and Kunming.\nShan had been holding regular meetings with exchange backers and was on the way to Guangzhou for a business trip when he was captured. Photo: Weibo\nThe exchange, which had purchased minor metals for above market prices, has faltered as China's economy slowed.\nAdvertisement Investors travelled to Shanghai and besieged a luxury hotel where Shan was staying.\nWhen he tried to check out they manhandled him into a car and delivered him to the nearest police station, according to the FT report published on August 23.\nFanya Metals Exchange boss Shan Jiuliang is bundled into a car. Photo: Weibo\nPolice took Shan into custody promising to investigate what happened to investors money. Shan was later released without charge.\nFanya, which had started to experience liquidity problems months ago, had stockpiled metals as Indium and Bismuth that are used in high tech and military applications.\nThe FT said it interviewed investors who claimed they were attracted to invest in Fanya financial products because it was advertised on CCTV – the national broadcaster.\nShan had been holding regular meetings with exchange backers and was on the way to Guangzhou for a business trip when he was captured.\nAccording to the FT, a report by the local regulator had identified the exchange as an investment risk but was redacted to remove the reference to Fanya last year.\nFairfax Media", "external_links": [], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T05:00:43.941+03:00", "highlightTitle": ""}