{"organizations": [], "uuid": "7c9679019ada46a5fde11f27d025552cef6fe2a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-27/caesars-bondholders-denied-quick-ruling-on-7-billion-promise", "country": "US", "title": "Caesars Bondholders Denied Quick Ruling on $7 Billion Pledge", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Caesars Bondholders Denied Quick Ruling on $7 Billion Pledge - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T23:00:00.000+03:00", "replies_count": 0, "uuid": "7c9679019ada46a5fde11f27d025552cef6fe2a4"}, "author": "Steven Church", "url": "http://www.bloomberg.com/news/articles/2015-08-27/caesars-bondholders-denied-quick-ruling-on-7-billion-promise", "ord_in_thread": 0, "title": "Caesars Bondholders Denied Quick Ruling on $7 Billion Pledge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Caesars Entertainment Corp. won a court ruling that gives it breathing room to try to negotiate an end to a bondholder lawsuit that could force the gambling company into bankruptcy alongside its main operating unit.\nA federal judge Thursday denied a bondholder request for an immediate ruling that Caesars broke federal law when it reneged on a promise to help repay $7 billion owed by the operating subsidiary.\nCaesars had said it might file for bankruptcy should the judge rule that it must stand behind the debt guarantee. The company dropped the guarantee as it tried to restructure debts of the unit, which filed bankruptcy in January.\nThe judge’s interpretation of the law, if upheld on a possible appeal, could make it harder for other companies to restructure debt outside of bankruptcy court. Because her decision “may have serious implications,” the judge said either party may file an immediate appeal.\nIn her ruling, U.S. District Judge Shira Scheindlin in Manhattan reiterated her position that Caesars may have violated the federal Trust Indenture Act by stripping debtholders of a repayment guarantee. She said trustees for bondholders owed about $7 billion will have a chance, beginning at an October hearing, to prove Caesars’ actions made it impossible for them to collect.\nSweeps Broadly In siding with Caesars, she said the bondholders’ request for an immediate ruling “sweeps too broadly.” The judge, however, rejected arguments Caesars raised to justify its decision to renege on the repayment guarantee.\nScheindlin dismissed Caesars’ claim that the bond contract wasn’t really intended to ensure repayment. She also ruled that an out-of-court debt restructuring that leaves bondholders with “no practical ability to receive payment” may violate the law.\nThe ruling gives Caesars more time to try to make a deal with creditors who have rejected a proposal to end the lawsuit and restructure billions of dollars in debt owed by the operating unit.\nCaesars’ shares swung dramatically on news of the ruling, initially climbing more than 25 percent to $10.61 before dropping as low as $7.83. At 3:21, shares were trading at $8.30, down about 1.5 percent.\nCaesars spokesman Stephen Cohen didn’t have an immediate comment on the decision. Andrew Silfen, an attorney for one of the bondholder trustees, didn’t immediately return a call for comment.\nThe case is BOKF NA v. Caesars Entertainment Corp., 15-cv-01561, U.S. District Court, Southern District of New York (Manhattan).", "external_links": [], "published": "2015-08-27T23:00:00.000+03:00", "crawled": "2015-08-27T23:11:34.316+03:00", "highlightTitle": ""}