{"organizations": ["Norstar", "Norstar Tankers"], "uuid": "0128540145f1534c12c5d22f7592ebd58c86cde6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.equipmentfa.com", "main_image": "", "site_section": "http://www.equipmentfa.com/rss/feeds/latestnews.xml", "section_title": "Equipment Finance Advisor", "url": "http://www.equipmentfa.com/news/4592/cit-provides-32mm-in-financing-to-norstar-tankers", "country": "US", "title": "CIT Provides $32MM in Financing to Norstar Tankers", "performance_score": 0, "site": "equipmentfa.com", "participants_count": 0, "title_full": "CIT Provides $32MM in Financing to Norstar Tankers", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T14:04:00.000+03:00", "replies_count": 0, "uuid": "0128540145f1534c12c5d22f7592ebd58c86cde6"}, "author": "", "url": "http://www.equipmentfa.com/news/4592/cit-provides-32mm-in-financing-to-norstar-tankers", "ord_in_thread": 0, "title": "CIT Provides $32MM in Financing to Norstar Tankers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  CIT Provides $32MM in Financing to Norstar Tankers August 14, 2015, 07:04 AM Related: CIT Maritime Finance , Sale Leaseback \nCIT Group announced that CIT Maritime Finance provided a $32 million senior secured credit facility to Norstar Tankers Ltd. to acquire two long range (LR1) product tankers. Financing was provided by CIT Bank, N.A., the principal bank subsidiary of CIT. Terms of the transaction were not disclosed.“Evolving refinery dynamics favor product tankers, as U.S., Middle Eastern and Indian refinery capacity has increased, and European refinery capacity, burdened by higher costs, continues to decline,” said Chris Bonehill, Principal, Norstar Shipping Group. “Thanks to their deep knowledge of the maritime sector, CIT understood the impact of these trends and quickly arranged a flexible financial solution that allowed us to seize the opportunities we saw in the market. We look forward to working with CIT again.”Svein Engh, Group Head and Managing Director, CIT Maritime Finance, said, “Norstar Shipping is an experienced technical and commercial manager, that is well connected within the maritime industry and has strong existing relationships with cargo providers and charterers. We are pleased to establish a relationship with Norstar and are glad we were able to bring our maritime finance expertise to bear to help them build their tanker fleet.”Norstar is a fully integrated shipping company carrying out all aspects of ship owning, investment, chartering, operations and finance. Norstar’s expertise is in the tanker sector. The principals of Norstar are Chris and Tom Bonehill, who have over 40 years combined experience in the shipping industry. Norstar was founded in 1998 in London, initially as a ship brokerage firm. In 2001 Norstar relocated to Monaco to focus on ship owning, investment and management. In 2005, Norstar Shipping (Asia) Pte. Ltd. was formed in Singapore, which is now the Company’s headquarters, covering all areas of commercial, technical and crew management. Norstar Shipping USA, LLC was established in Connecticut in 2012. CIT Maritime Finance offers senior secured loans, sale-leasebacks and bareboat charters to owners and operators of oceangoing cargo vessels, including tankers, bulkers, container ships, car carriers, and offshore vessels and drilling rigs. Today's Other News", "external_links": [], "published": "2015-08-14T14:04:00.000+03:00", "crawled": "2015-08-14T17:08:38.353+03:00", "highlightTitle": ""}