{"organizations": ["CBRE’s Valuation & Advisory Services", "PKF Canada", "PDT Industries & Tags Dennis McCoy | Sacramento Business Journal CBRE Group", "Americas Valuation & Advisory Services", "PKF Canada Aug", "PKF", "CBRE", "PKF Consulting USA", "PKF Canada ​CBRE", "PKF Consulting Inc.", "Valuation & Advisory Services", "CBRE Group Inc."], "uuid": "00d42f5357787c319b9a27b170c1e14cff97cc9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://media.bizj.us/view/img/3024691/cbre4527a*400xx2848-2848-0-184.jpg", "site_section": "http://finance.yahoo.com/rss/PropertyManagement", "section_title": "Yahoo! Finance: Property Management Industry News", "url": "http://us.rd.yahoo.com/finance/external/bizj/rss/SIG=13dlt76no/*http://www.bizjournals.com/losangeles/news/2015/08/04/cbre-buys-hospitality-consulting-firm-pkf-canada.html?ana=yahoo", "country": "GB", "title": "​CBRE buys hospitality consulting firm PKF Canada", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "​CBRE buys hospitality consulting firm PKF Canada", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T22:45:00.000+03:00", "replies_count": 0, "uuid": "00d42f5357787c319b9a27b170c1e14cff97cc9a"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/bizj/rss/SIG=13dlt76no/*http://www.bizjournals.com/losangeles/news/2015/08/04/cbre-buys-hospitality-consulting-firm-pkf-canada.html?ana=yahoo", "ord_in_thread": 0, "title": "​CBRE buys hospitality consulting firm PKF Canada", "locations": ["North America", "U.S.", "Canada", "Vancouver", "Toronto"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Thomas B. McDonnell", "David Larone", "Brian Stanford"], "text": "​CBRE buys hospitality consulting firm PKF Canada Aug 4, 2015, 12:35pm PDT Industries & Tags Dennis McCoy | Sacramento Business Journal CBRE Group is expanding its global reach in the hospitality sector with its purchase of… more Commercial real estate services firm CBRE Group Inc. is expanding its global reach in the hospitality sector with its purchase of PKF Consulting Inc. , a consulting and research firm in Canada that specializes in the Canadian hospitality and tourism industries Financial terms of the deal weren’t disclosed. The acquisition follows Los Angeles-based CBRE’s (NYSE: CBG) purchase in July last year of PKF Consulting USA, which provides similar advisory and consulting services for the U.S. and global hospitality sector. PKF Canada’s clients include hotel owners and operators, financial institutions, real estate developers, investors, product and service providers to the industry, and governmental agencies. Its key services to the Canadian hospitality industry include market and economic feasibility studies, real estate appraisals, operational reviews, asset management, management contract negotiations and acquisition due diligence. The firm has offices in Toronto and Vancouver. “Combining their deep knowledge and insight into the Canadian hospitality sector with CBRE’s valuation and transaction expertise will significantly enhance our service offering and support our ability to create real advantages for hospitality clients worldwide,” Thomas B. McDonnell , president of CBRE’s Americas Valuation & Advisory Services division, said in a statement. Founded in 1970, PKF Canada is led by David Larone and Brian Stanford , who will remain in leadership roles with CBRE. During the past four years, PKF Canada has provided advisory services for more than $4 billion of hotel assets, serving a wide range of owners, lenders, purchasers and developers. PKF Canada’s professionals will become part of CBRE’s Valuation & Advisory Services business and will collaborate closely with CBRE Hotels’ professionals. The firm’s market research data and analysis will be integrated into the larger PKF research platform at CBRE, which the firm said will provide the most comprehensive source of hotel financial information in North America. CBRE’s Valuation & Advisory Services business provides appraisal, consulting, environmental and property condition consulting services. It has a staff of more than 1,700 appraisers, engineers, architects and environmental scientists in more than 300 major metro areas worldwide. CBRE Hotels has nearly 300 professionals in key markets around the world. CBRE Group is the world’s largest commercial real estate services and investment firm, with more than 52,000 employees and 370 offices worldwide. \nWant Los Angeles Banking & Financial Services news in your inbox? Sign up for our free email newsletters. Industries", "external_links": [], "published": "2015-08-04T22:45:00.000+03:00", "crawled": "2015-08-05T01:26:17.564+03:00", "highlightTitle": ""}