{"organizations": [], "uuid": "7e387dedea0c1bdcf2c8f1246ebf5f87060b31e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/zEYnmMyhEEAxELHoAe_Xdg--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/109360275-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-banks/?format=rss", "section_title": "Banking News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/greek-bank-stocks-plummet-third-132908274.html", "country": "US", "title": "Greek Bank Stocks Plummet For Third Day", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Greek Bank Stocks Plummet For Third Day", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T16:29:00.000+03:00", "replies_count": 0, "uuid": "7e387dedea0c1bdcf2c8f1246ebf5f87060b31e9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/greek-bank-stocks-plummet-third-132908274.html", "ord_in_thread": 0, "title": "Greek Bank Stocks Plummet For Third Day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 5, 2015, 15:01 BST - UK Markets close in 1 hr 29 mins Greek Bank Stocks Plummet For Third Day By (c) Sky News 2015 | Sky News – 32 minutes ago View Photo \n\nGreek banks are coming under substantial selling pressure for the third consectuive day as markets remain sceptical that a third bailout for the country will be reached by 18 August. \nGreek officials are confident that the €86bn rescue package will be agreed in time for the next European Central Bank (ECB) repayment which is due on 20 August. \nBut shares in the country's biggest bank, the National Bank Of Greece, are in free fall and have more than halved in value since the reopening of the Athens Stock Exchange on Monday. \nThe stock exchange had been closed since capital controls were installed on 26 June. \nNational Bank (NYSE: NBHC - news ) of Greece has seen nearly 70% of its value eroded since Syriza came to power at the end of January. This equates to €3.4bn being wiped off the bank's value in a matter of months. \nThings are no rosier at the smallest of the country's big four banks - Piraeus. \nShares (Berlin: DI6.BE - news ) there have been hit hardest - falling by the permitted maximum of 30% on three consecutive days this week. \nThe permitted maximum, or so-called \"limit-down\" restriction, is a mechanism which is imposed by the stock exchange to foster stability of a company's share price. \nSince the beginning of the credit crunch in 2007, shares in the National Bank of Greece have fallen by 98.6%, causing shareholders to bear losses well in excess of €100bn. The other three banks have hardly fared better. \nAside from the scepticism concerning an agreement on the new bailout, investors are fearful of a bail-in. Bail-in rules would mean that losses from failing banks would be forced on to bondholders and large depositors. \nAccording to Royal Bank of Scotland (LSE: RBS.L - news ) (RBS) research of the country's four large banks, the two with the greatest exposure to bail-ins are Piraeus Bank (EUREX: 21535576.EX - news ) and Alpha Bank (Other OTC: ALBWF - news ) . \nFearful of losing their savings Greek citizens have been withdrawing money from the banks as fast as they can. \nAccording to the Bank of Greece, Greece's central bank (not to be confused with the National Bank of Greece), €40bn or 23% of Greek GDP was withdrawn from the banks in the first half of 2015. \nSince capital controls were installed in June depositors have only been able to withdraw a maximum of €60 per day, although more recently they have been allowed to withdraw their full weekly allowance of €420 in one go. \nThe Greek banks - still deemed solvent by the ECB - had the vital level of Emergency Liquidity Assistance (ELA) raised to €89.9bn in mid-July. \nA report by the National Institute of Economic and Social Research (NIESR) has also concluded that Greece needs over €95bn of debt relief in order to avoid a permanent depression. \nThe chances of a Greek exit from the eurozone, a so-called Grexit, have fallen sharply since the €7.1bn bridging loan was approved last month. \nBut given that most of this money has since been used to clear IMF arrears and repay ECB debts, any delay to the agreement of the bailout could bring Grexit back to the forefront of investors' minds. \nPrices from Betfair, the exchange platform, currently imply just an 8% chance of a Grexit in 2015. This had been as high as 39% in early July. \nNIESR summarise the predicament by saying: \"The irony is that if Greece is forced to leave the single currency, the losses which creditors would face are greater than the debt write-down required to stay in the Euro Area.\"", "external_links": [], "published": "2015-08-05T16:29:00.000+03:00", "crawled": "2015-08-05T17:02:48.898+03:00", "highlightTitle": ""}