{"organizations": [], "uuid": "65a9e187a485e4496f3330653ebfcf12dc75744b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/26/stocks-bargain-hunters-idUSL1N1111QH20150826", "country": "US", "title": "Retail brokers cheer stomach-churning volatility", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Retail brokers cheer stomach-churning volatility | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:07:00.000+03:00", "replies_count": 0, "uuid": "65a9e187a485e4496f3330653ebfcf12dc75744b"}, "author": "Jed Horowitz", "url": "http://www.reuters.com/article/2015/08/26/stocks-bargain-hunters-idUSL1N1111QH20150826", "ord_in_thread": 0, "title": "Retail brokers cheer stomach-churning volatility", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK Aug 26 Forget the May 6, 2010, Flash Crash when the U.S. stock market fell 600 points in five minutes or that confidence-shattering day on August 5, 2011, when Standard & Poor's Corp downgraded the credit rating of the United States.\nFor sheer volatility, nothing in recent memory compares with the market turmoil of the past few trading days, and many brokers couldn't be happier about it.\n\"Monday was the most active day in recent history,\" said Elizabeth Dennis, the head of wealth management capital markets at Morgan Stanley, the world's biggest brokerage firm.\nAfter months of lackluster activity in equity and bond markets, brokers at large and small firms willingly canceled late August vacations to calm nervous clients and make money guiding them to stock-market bargains.\n\"After such a low-volatility environment, our strategists could tell advisers and their clients to move,\" said Dennis, noting that lots of money has poured into the SPDR S&P 500 ETF Trust as well as individual stocks such as Apple. Some 10,000 stock brokers and their clients listened in for a special market call after Monday's close of trading at Morgan Stanley, according to a company spokesman.\nStock-trading volume on each of the three days beginning last Friday, when fears about infection from China's economy began toppling world markets, was double or triple this year's daily average at Morgan Stanley and Wells Fargo Advisors, officials said.\nClients of Edward Jones, which fields the third biggest brokerage force after Morgan Stanley and Wells, put in about 76,000 stock trading orders on Monday, and another 66,000 on Tuesday. That compares with a daily average of about 22,000 orders by Jones clients, who primarily invest in mutual funds, said John Rahal, head of branch development at the St. Louis-based partnership.\nDespite concerns that many retail investors would panic and sell amid the cumulative 1,322-point, 7.9 percent three-day decline in the Dow Jones Industrial Average, buys outweighed sells at most firms as advisers focused on the growing strength of the U.S. economy and opportunistic buys.\n\"It's hard to be upset when you see some of the best dividend-paying companies on sale right now,\" said Ralph Courage, whose Courage Miller Partners, LLC in Norfolk, Virginia oversees about $256.5 million for some 670 clients.\nCourage has steered clients primarily to large-cap exchange-traded funds.\nSteven Dudash, president of the Chicago-based independent advisory firm, IHT Wealth Management, said roughly 20 percent of the cash his advisory firm received this year was deposited in the last three days. \"I called almost...to tell them, 'Don't panic,'\" Dudash said. \"Turns out that message moved a lot of them to place orders.\"\nThe relative optimism of retail investors and advisers stands in sharp contrast to rising bearish sentiment from institutional investors at banks, pension and hedge funds.\nStock trading volume appeared to return to more normal levels on Wednesday, when the Dow and the Standard & Poor's 500 index rebounded 3.9 percent, said Morgan Stanley's Dennis.\n(Reporting By Jed Horowitz, additional reporting by Elizabeth Dilts; Editing by Andrew Hay)", "external_links": [], "published": "2015-08-27T03:07:00.000+03:00", "crawled": "2015-08-27T02:16:33.548+03:00", "highlightTitle": ""}