{"organizations": ["The Economic Times App"], "uuid": "505b0ab4d7bc35d673da884fcbf258991ccc45a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48445066,width-600,resizemode-4/indirect-tax-collections-surge-for-4th-straight-month-in-july.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/13358311.cms", "section_title": "Finance-Banking/Finance-Industry-The Economic Times", "url": "http://economictimes.indiatimes.com/industry/banking/finance/indirect-tax-collections-surge-for-4th-straight-month-in-july/articleshow/48445049.cms", "country": "IL", "title": "Indirect tax collections surge for 4th straight month in July", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Indirect tax collections surge for 4th straight month in July", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T22:26:00.000+03:00", "replies_count": 0, "uuid": "505b0ab4d7bc35d673da884fcbf258991ccc45a5"}, "author": "", "url": "http://economictimes.indiatimes.com/industry/banking/finance/indirect-tax-collections-surge-for-4th-straight-month-in-july/articleshow/48445049.cms", "ord_in_thread": 0, "title": "Indirect tax collections surge for 4th straight month in July", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Indirect tax collections surge for 4th straight month in July 12 Aug, 2015, 12.56AM IST ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! NEW DELHI: India's indirect taxes collections continued to grow at a rapid pace for the fourth consecutive month in July, adding to evidence that economic recovery may be accelerating. Indirect taxes, which include excise duty levied at factory gate, customs duty and service tax grew 39.1% in July and 37% in April-July, according to data released by the finance ministry on Tuesday. These levies are seen as a key barometer of production, consumption and demand in the economy. The growth holds even after adjusting for increase in duties on fuel and withdrawal of tax incentives for automobiles. Car sales increased 17.47% in July, highest in three months and marking the ninth consecutive month of domestic sales growth, providing evidence of improvement in consumer sentiment. Indirect tax collections in July are pegged at Rs 56,739 crore while April-July collections stood at Rs 2.1 lakh crore. India's industrial production expanded 2.7% in May but analysts expect better numbers for the next month. The data for June will be released on Wednesday. India's economy expanded 7.3% in 2014-15 and 7.5% in the January-March quarter. The government hopes to end the current fiscal with near 8% growth. While the pace in the first quarter appears to have been muted, early data for July suggests a stronger second quarter. Nikkei Purchasing Managers' Index (PMI) rose to 52.7 in July from June's 51.3, a six-month high while the PMI for services bounced back into positive zone after two months of contraction. During April-July, the excise collections jumped 75.4% to Rs 83,454 crore. Revenues from service tax rose 20.1 % to Rs 60,925 crore and that from customs duty 21% to Rs 66,076 crore. In July the central excise collections jumped 64.8% to Rs 22,273 crore, compared to the yearago figure; customs duty rose 23.2% to Rs 18,996 crore while service tax revenues were up 30.3% to Rs 15,470 crore, according to the data. Stay on top of business news with The Economic Times App. Download it Now! DON'T MISS any stories, follow us on Twitter Follow", "external_links": [], "published": "2015-08-11T22:26:00.000+03:00", "crawled": "2015-08-11T23:55:26.931+03:00", "highlightTitle": ""}