{"organizations": [], "uuid": "06beb5bba4594f5411e606562a324f306cda3250", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/06/Sebi-UK-Sinha-S.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/indian-markets/dont-enter-commodities-market-for-quick-bucks-sebi-to-investors/112463", "country": "IE", "title": "Don’t enter commodities market for quick bucks: Sebi to investors", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Don’t enter commodities market for quick bucks: Sebi to investors | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T23:10:00.000+03:00", "replies_count": 0, "uuid": "06beb5bba4594f5411e606562a324f306cda3250"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/indian-markets/dont-enter-commodities-market-for-quick-bucks-sebi-to-investors/112463", "ord_in_thread": 0, "title": "Don’t enter commodities market for quick bucks: Sebi to investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles UTI Mutual Fund crosses Rs 1 trillion mark; eyes leadership slots Not enamoured by size of corporates committing crimes: Sebi's U K Sinha Outlook: Reserve Bank of India policy, earnings from Bharti Airtel, Tata Motors key for market Ready to regulate commodity trading, Sebi has cautioned small investors against coming for quick gains through speculation in this market, which is “risky” and requires a lot of technical expertise.\n“People will come and tell you that with a small margin, you can make a lot of money. Do not fall into the trap,” Sebi Chairman U K Sinha said, even as he asserted that the capital markets watchdog was fully prepared to begin regulating commodities trading and all necessary safeguards would be put in place to keep the scamsters and manipulators at bay.\nSebi, which expects the merger of commodities market regulator FMC with it to be completed by next month, will soon put in place a new set of regulations for this segment and the restrictions, including for trading lot sizes, would also be implemented to ensure safety of the small investors.\nSinha said his message to the small investors would be to keep away from the commodities market as it was meant for the experts and for those seeking to hedge their risks.\n“If you put your hard-earned money into this market, it may not be ultimately good for you. The commodities market is for those who are experts in this space. For non-experts, it is a risky area,” the Sebi chief told PTI in an interview.\nAnnounced by Finance Minister Arun Jaitley in his Budget for 2015-16, FMC’s merger with Sebi will help streamline regulations and curb wild speculations in commodities market, while facilitating participation of domestic and foreign institutional investors and launch of new products.\nThe commodities market has been known to more prone to speculative activities compared to the stock market, while illegal activities like ‘dabba trading’ have also been more frequent in this segment.\nBesides, the high-profile NSEL scam has rocked this market in the recent past and the subsequent regulatory and government interventions in this case eventually led to the government announcing FMC’s merger with Sebi.\nAt present, there are three national and six regional bourses for commodity futures in the country. Together, all the exchanges clocked a turnover of nearly Rs 60 lakh crore in 2014-15, from over Rs 101 lakh crore in the previous fiscal.\nAsked about Sebi’s preparedness for regulating the commodities market and his assurance to the investors, UK Sinha said Sebi has got more than 15 years of experience of managing and regulating the derivatives trading.\n“Since 2000, derivatives in stocks have been present in our county and Sebi has been regulating it and the stock exchanges have been providing this trading.\n“Later, currency derivatives were also introduced and that is also being regulated by Sebi. Our belief is that commodities derivatives regulation will not be a problem.\n“I would like to assure that Sebi is well prepared to handle this responsibility and Sebi has more than 15 years of experience in handling and regulating derivatives,” he said.\nSinha said that Sebi has got sufficient experience on “what should be the contract size, what should be the risk management, how much margin should be taken, how to do the surveillance of trades, how to regulate the brokers and how to regulate the clearing corporations and exchanges”.\n“On all these things, we have got sufficient experience. To the citizens of this country and the investors, I would like to assure that we are very well prepared for this.”\n“However, I would like to add one point of caution that these are very technical and risky areas,” Sinha said.\nThe Sebi chief said it requires a lot of technical knowledge to understand the commodity derivatives market and it involves a lot of risk.\n“So unless somebody who is not an expert on the market, if he is taking a position, he should do it only for hedging his own risks. If he is a farmer, or a miller, or an exporter, he can come to hedge the risk. But, do not come to this market for making a quick money and for speculation. My advice would be these are risky areas and technical areas,” Sinha said.\nMumbai-headquartered FMC (Forward Markets Commission) was set up in 1953 under the Forward Contracts (Regulation) Act (FCRA) as a statutory body under the aegis of Consumer Affairs Ministry. It was brought under Finance Ministry in 2013.\nIn the beginning, FMC was only regulating regional commodity exchanges and its role was expanded after the emergence of national electronic trading platform in 2000.\nSeeking to make FMC an autonomous body, the government had proposed amendments to FCRA in 2010 but the concerned bill could not be taken up in Parliament.\nThe Sebi Chairman said he has a twofold message on the commodities markets.\n“One, Sebi is fully prepared to handle this responsibility and we have got 15 years of experience in handling derivatives contracts, so it will not be a problem for us.\n“Secondly, I am giving an advice to the small, uninformed investors that commodity market is risky and requires technical knowledge.\n“Do not come into this market only if you want to make some quick money through speculations. It is meant for the experts. These are my main two messages.”\nHe further said Sebi will put all necessary regulations and requirements in place for trading.\n“All the restrictions etc in terms of lot size and other factors will come,” he added.\nFirst Published on August 02, 2015 3:10 pm", "external_links": [], "published": "2015-08-02T23:10:00.000+03:00", "crawled": "2015-08-02T21:31:39.626+03:00", "highlightTitle": ""}