{"organizations": [], "uuid": "0eed66aa7cf935da6e093bf1835d0a5c36ffd30e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/r/3/w/v/image.related.afrArticleLead.620x365.gir8gr.png/1438683514445.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/bank-of-tokyomitsubishi-wants-to-lend-more-in-australia-20150804-gir8gr", "country": "AU", "title": "Bank of Tokyo-Mitsubishi wants to lend more in Australia", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Bank of Tokyo-Mitsubishi wants to lend more in Australia | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T17:32:00.000+03:00", "replies_count": 0, "uuid": "0eed66aa7cf935da6e093bf1835d0a5c36ffd30e"}, "author": "Post to Linkedin", "url": "http://www.afr.com/business/banking-and-finance/bank-of-tokyomitsubishi-wants-to-lend-more-in-australia-20150804-gir8gr", "ord_in_thread": 0, "title": "Bank of Tokyo-Mitsubishi wants to lend more in Australia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Go Watanabe, CEO of Asia & Oceania, and Nobuyuki Hirano, President & Group CEO, of the Bank of Tokyo-Mitsubishi, in Sydney on Tuesday. Louie Douvis Share on twitter by James Eyers The Bank of Tokyo-Mitsubishi UFJ, Japan's largest bank, held a grand dinner at the Museum of Contemporary Art in Sydney on Tuesday night to celebrate 30 years since it was awarded a banking licence in Australia.\nEach of the 200-plus guests received a bottle of Australian-made sake, from the Go-Shu Australian Sake Brewery in the Blue Mountains, which the bank described as a symbol of \"taking the best from two countries and customising it without losing the essence of the original taste and flavour\".\nIn the traditionally conservative and relatively staid world of Japanese banking, the shindig by Bank of Tokyo-Mitsubishi is also symbolic of a growing confidence among the country's financial institutions and reflects the quiet, structural revolution in Japanese finance alongside the reforms of Prime Minister Shinzo Abe.\nThese dynamic policies known as Abenomics are encouraging Japanese companies and investors to look outwards in order to improve their returns after more than 20 years of deflation. BTMU, with assets of $3 trillion and a market capitalisation about the size of Commonwealth Bank of Australia, has been the most aggressive of Japan's banks in forging a regional footprint.\nIn its early days in Australia, most of BTMU's lending was to expanding Japanese companies, but it now earns more revenue in Australia from banking non-Japanese corporates – often through loan syndicates alongside the major Australian banks.\nIt has $13 billion of loans in Australia to non-financial companies, including to mega-infrastructure projects such as the Port of Brisbane, toll roads Peninsula Link and Connect East, and energy deals including the Dampier Bunbury Natural Gas Pipeline. It is also funding large mining and energy projects, including Pilbara iron ore mine Roy Hill, and the Ichthys LNG project off the north-west coast.\nMore lending Nobuyuki Hirano, the president and chief executive of BTMU and of Mitsubishi UFJ Financial Group, BTMU's parent company, told Fairfax Media on Tuesday the bank wants to do more lending in Australia and to diversify its portfolio into healthcare, food and value-added services, while also bolstering its advisory work.\n He also said Japanese companies were increasingly keen on doing deals in Australia . \"Investment in Australia is attracting more interest,\" he said, pointing to the $6.5 billion acquisition of Toll Holdings by Japan Post in February and the arrival of retailer Uniqlo , attracted to Australia because the population is growing and incomes are relatively high.\n\"The current bilateral relationship between Australia and Japan is symbolised by the excellent relationship between prime ministers Abbott and Abe. That steady government-to-government relationship lays the ground for business leaders to pursue work.\"\nGo Watanabe, BTMU's CEO for Asia and Oceania, said interest from Japanese companies in Australia was a function of the ageing and decline of Japan's population.\n\"Most of Japan's big and mid-sized companies, in order to grow, have to look for opportunities outside Japan,\" he said. \"Despite the devaluation of the yen, they are getting more aggressive looking for more opportunities to buy and invest into foreign assets and companies. That's a trend we will see continue. And many companies are looking for those opportunities in Australia.\"\nWith iron ore prices tumbling this year, putting heavy dents in various equity prices and a hole in the commonwealth budget, BTMU remains comfortable with its exposures from a credit perspective and says the projects it has backed are all cost competitive compared with others in the region.\n\"Natural resources will keep its importance, not only for Australia but also for Japan,\" Mr Hirano said. \"We are the second-largest trade partner with Australia and that won't change, no matter how the price might fluctuate. So Australia will keep its position as a steady exporter and provider of natural resources and energy to Japan.\"\nCorporate deposits While it has more deposits in Japan than it makes in loans globally, in Australia BTMU plans to lift its corporate deposits as part of its liquidity management. Deposits in Australia are about $5 billion, but BTMU will target more by offering a cash management service to iron ore and gas projects as they come on line and start generating cash. With a quarter century of low interest rates in Japan shrinking loan margins, high levels of cash in Japanese companies, and anaemic housing markets keeping a lid on credit growth, BTMU has been forced to diversify its operations by targeting services for which it can charge fees, including asset management.\nMitsubishi UFJ Financial Group's trust banking unit owns 15 per cent of AMP Capital and BTMU has sold hundreds of millions of dollars worth of AMP products to Japanese households, an arrangement Mr Hirano said had boosted fee income and is providing an opportunity for Japanese households to diversify financial assets. \"We are encouraging retail and institutional clients to diversify their portfolios.\"\nReflecting on the \"third arrow\" of Abenomics – regulatory reform – Mr Hirano said more needs to be done on reform of labour markets, agriculture and industry deregulation while addressing government spending on healthcare was becoming more urgent. Abenomics was dealt a blow by the failure of the Trans Pacific Partnership to reach an agreement last week, which would have provided momentum for Japanese exporters. But he said: \"I am quite hopeful they will reach the agreement within the foreseeable future – that would have big benefits for all countries involved. This is a very strategic agreement.\"\nAs for the risks in capital markets, Mr Hirano says rising US interest rates looms large, especially for the \"Fragile5\" developing markets of Brazil, Turkey, South Africa, Indonesia and India, whose currencies fell sharply when the taper was initially announced by former US Federal Reserve chairman Ben Bernanke.\n\"The US will manage the exit of their QE policy reasonably well – within their border,\" he said. \"However, the impact will probably be more severe and visible in peripheral countries, particularly emerging market countries, because of the reversal of capital flow out of those emerging countries into the US.\"\nHe also points to the \"liquidity illusion\" as another headwind markets will need to face up to. \"There is a lack of liquidity in the marketplace because of the lower ability of investment banks to act as intermediaries or market makers as a result of tightening capital and liquidity requirement from the Basel 3 committee. That could further increase the volatility.\"", "external_links": ["https://twitter.com/https://twitter.com/eyersj"], "published": "2015-08-04T17:32:00.000+03:00", "crawled": "2015-08-04T17:41:36.553+03:00", "highlightTitle": ""}