{"organizations": ["Costain"], "uuid": "243d4fc04e85348259fba00a51eccbf03c84c7ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/questor-share-tip-costain-profits-180821461.html", "country": "GB", "title": "Questor share tip: Costain profits from rebuilding Britain", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Questor share tip: Costain profits from rebuilding Britain", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T21:08:00.000+03:00", "replies_count": 0, "uuid": "243d4fc04e85348259fba00a51eccbf03c84c7ea"}, "author": "", "url": "https://uk.finance.yahoo.com/news/questor-share-tip-costain-profits-180821461.html", "ord_in_thread": 0, "title": "Questor share tip: Costain profits from rebuilding Britain", "locations": ["Britain"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0.0001 0.0000 \nCostain's working on huge projects including rebuilding London Bridge Station and can look forward to a steady pipeline of major contracts \nCostain 370p +23½p Questor says HOLD \nTHE UK needs to modernise its antiquated infrastructure and construction firm Costain said yesterday that it is generating steady profits by ploughing through a record order book to modernise Britain. \n= Rebuilding Britain = \nCostain has focused its business on transport, energy and water in the UK. It has secured work programmes on the controversial high-speed rail link HS2, London’s Crossrail, nuclear projects at Sellafield and the new Hinckley Point endeavour. \nCostain said yesterday that the \norder book was up 16pc to a record £3.7bn, the top end of market expectations. The giant backlog of work is steadily working its way through the system and revenue increased 17pc to £621m, and adjusted pre-tax profits jumped 25pc to £11.4m during the six months to the end of June. \nThe order book means that more than £950m, or more than three quarters, of next year’s £1.24bn in forecast revenue is already guaranteed. This gave Costain the confidence to raise its interim dividend by 15pc to 3.75p, going ex-dividend on September 16 and payable on October 23. The company also has money in the bank, with net cash of £126.8m at the end of June, down slightly from £148.5m six months earlier. \n= Track record = \nThe construction group has a good track record of delivering its projects. Andrew Wyllie, chief executive, said that customers are looking to consolidate their supply chains and work more closely with the construction companies. \nThis close relationship is also key when it comes to big, complex projects, where unforeseen issues often spring up. \nConstruction companies work on wafer-thin profit margins Costain’s adjusted profit margin is 1.8pc so when things go wrong it can have a drastic effect on full-year performance. \nMr Wyllie claims Costain has insulated itself to some extent by moving from fixed price contracts, which exposed the company to yawning losses when projects overrun, to what are known as cost-target contracts. \nUnder the new contracts, Costain and the client share in both the upside and the downside during the life of the project. “This is why our collaborative approach is important.” \n= Profit upgrades = \nAround 90pc of Costain’s work is now cost-target based, up from 50pc in 2010. \nAndrew Gibb, from broker Investec (LSE: INVP.L - news ) , upgraded the full-year, pre-tax profit forecast by 12pc. \nIt (Other OTC: ITGL - news ) is an impressive performance from Costain and the shares jumped almost 6pc higher yesterday, bringing gains for the year to 31pc. We tipped Costain’s recovery back in March (Buy, 302p, March 3) as we liked the strengthening order book, and the shares have since delivered a more than 20pc gain. \nThe shares now trade at a price-earnings (p/e) ratio of 17, which is very high for a low-margin cyclical industry, and yield 3pc. We still like the order book and demand for Costain’s services but, after the rapid gains, we downgrade to a hold.", "external_links": [], "published": "2015-08-20T21:08:00.000+03:00", "crawled": "2015-08-20T21:50:42.118+03:00", "highlightTitle": ""}