{"organizations": [], "uuid": "b0fb06c980a3533c43f2b01904f2039fd157b384", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arabianbusiness.com", "main_image": "http://www.arabianbusiness.com/incoming/article486045.ece/BINARY/Abraaj+Group_FINAL.JPG", "site_section": "http://www.arabianbusiness.com//industries/banking-finance/?service=rss", "section_title": "Arabian Business - Banking & Finance", "url": "http://www.arabianbusiness.com/dubai-s-abraaj-inks-deal-exit-stake-in-peru-s-condor-travel-603870.html", "country": "US", "title": "Dubai's Abraaj inks deal to exit stake in Peru's Condor Travel", "performance_score": 0, "site": "arabianbusiness.com", "participants_count": 0, "title_full": "Dubai's Abraaj inks deal to exit stake in Peru's Condor Travel", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T09:04:00.000+03:00", "replies_count": 0, "uuid": "b0fb06c980a3533c43f2b01904f2039fd157b384"}, "author": "", "url": "http://www.arabianbusiness.com/dubai-s-abraaj-inks-deal-exit-stake-in-peru-s-condor-travel-603870.html", "ord_in_thread": 0, "title": "Dubai's Abraaj inks deal to exit stake in Peru's Condor Travel", "locations": ["Dubai", "Peru"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Abraaj"], "text": "By Staff writer Saturday, 29 August 2015 10:04 AM \nDubai-based Abraaj Group has announced the signing of an agreement to exit its stake in Condor Travel to The Carlyle Group. \nThe exit, through Abraaj's Latin American Fund, marks the first secondary private equity sale in Peru, and Abraaj's fourth exit from the fund in the last 12 months. The transaction is expected to close by the end of September. \nOver the course of its investment, Abraaj said it has helped Condor Travel expand its service offerings and enhance its regional footprint. \nThe diversification of services offered, in addition to the establishment of a new subsidiary in Chile, helped increase Condor Travel's sales globally, and augmented its reputation as the leading specialty operator for tourists to Peru, Abraaj said in a statement. \nIn 2014, Condor Travel served over 40,000 customers representing a 55 percent increase in customer traffic from 2010. In the same period, the average spend per customer increased by 56 percent, it added. \nHector Martinez, managing director of Abraaj's Peru office said: \"Our investment and partnership with Condor Travel helped create a leader in the Peruvian tourism market. \n\"Condor Travel is well-positioned to maintain its market-leading status in the high-growth Peruvian tourism sector and we wish the company every success for the future.\" \nAbraaj has been investing in the Pacific Alliance countries of Colombia, Mexico and Peru since 2008, across a range of sectors including retail, tourism, technology, food and beverage, and consumer goods. \nIn Peru, Abraaj exited its investment in leading Latin American retail company Iasacorp last year, and currently holds stakes in well-known restaurant group Acurio Restaurantes and light logistics and courier service provider Urbano.", "external_links": [], "published": "2015-08-29T09:04:00.000+03:00", "crawled": "2015-08-29T10:59:43.447+03:00", "highlightTitle": ""}