{"organizations": [], "uuid": "bf5ceb0587093bdd31878770abddee1a5e61e351", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/08/Kylie-Jenner-Net-Worth.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/kylie-jenner-5-million-net-worth-gets-boost-320000-birthday-ferrari-tyga/", "country": "US", "title": "Kylie Jenner $5 Million Net Worth Gets Boost With $320,000 Birthday Ferrari From Tyga", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "Kylie Jenner $5 Million Net Worth Gets Boost With $320,000 Birthday Ferrari From Tyga", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T20:15:00.000+03:00", "replies_count": 0, "uuid": "bf5ceb0587093bdd31878770abddee1a5e61e351"}, "author": "Elyssa Kirkham", "url": "http://www.gobankingrates.com/personal-finance/kylie-jenner-5-million-net-worth-gets-boost-320000-birthday-ferrari-tyga/", "ord_in_thread": 0, "title": "Kylie Jenner $5 Million Net Worth Gets Boost With $320,000 Birthday Ferrari From Tyga", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Elyssa Kirkham August 10, 2015 \nThe youngest of the Kardashian-Jenner clan, Kylie Jenner , turned 18 on Aug. 10. Ahead of her birthday, Jenner celebrated Sunday evening with family and friends in a huge birthday bash. \nWith a guest list including Jenner’s boyfriend Tyga, parents Kris Jenner and Caitlyn Jenner, sisters Kendall Jenner, Kourtney Kardashian, Kim Kardashian and Khloe Kardashian, Kanye West, James Harden and more, Kylie Jenner’s birthday party was a lavish event. Kylie Jenner’s Ferrari: A $320,000 Birthday Gift From Boyfriend Tyga \nThe reality star has openly been dating rapper Tyga, and he had a huge surprise for her girl on her 18 th birthday: a white Ferrari 482 Italia convertible — which costs up to $320,000, according to varying estimates. \nThis gift alone gave Kylie Jenner’s net worth a boost of at least 6.4 percent, making this a very impressive gift for the birthday girl. Tyga presented the gift to Kylie Jenner in front of friends outside Bootsy Bellows in West Hollywood, Calif. \nThe new car also helped Tyga save face. After Kylie Jenner was seen behind the wheel of a Mercedes G-Wagon that Tyga had gifted reportedly to ex Blac Chyna, he was accused of giving his girl a hand-me-down. But with Kylie Jenner’s Ferrari, he proved that it’s only the best for his girlfriend. \nRelated: Khloe Kardashian, Lamar Odom Divorce: It’s Official — Who Gets What in the Kardashian Odom Net Worth Split Kylie Jenner Net Worth: A Multi-Millionaire With a $2.7M House \nAt just 18, Kylie Jenner is already worth $5 million, reports CelebrityNetWorth (not including the $320,000 Ferrari). The youngest Jenner has been financially independent of her parents, Kris Jenner and Caitlyn Jenner, since she was 14, reports Daily Mail. Much of this money was likely earned through the paychecks Jenner earned from E! for appearing on “Keeping Up With the Kardashians” and other shows related to her family, like “I Am Cait.” \nBut Kylie Jenner has had plenty of other sources of income, like a modeling career that includes gigs for Sears, Nip + Fab and even brother-in-law Kanye West. Jenner also has clothing lines designed with sister Kendall Jenner, one for PacSun and another that’s sold at Topshop and Nordstrom. As one of the hottest young stars, the 18-year-old is ability for her power to sell well to youngsters. \nKylie Jenner has been an adult for some time, purchasing a $2.7 million home in Calabasas, Calif. (near other members of the Kardashian family) back in February. She has plans to move in and make this her full-time residence now that she has turned 18 and is no longer a minor. \nShare This Article", "external_links": [], "published": "2015-08-10T20:15:00.000+03:00", "crawled": "2015-08-10T21:50:43.043+03:00", "highlightTitle": ""}