{"organizations": [], "uuid": "499396684847c716cdd82dec1a1a4942c53135e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn1.scmp.com/sites/default/files/styles/620x356/public/2015/07/27/china_yuan.jpg?itok=hLqTLeJJ", "site_section": "http://www.scmp.com/rss/11/feed", "section_title": "South China Morning Post - Banking &amp; Finance feed", "url": "http://www.scmp.com/business/banking-finance/article/1844043/what-wider-trading-band-when-yuan-frozen", "country": "HK", "title": "What wider trading band when yuan is frozen?", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "What wider trading band when yuan is frozen? | South China Morning Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T05:20:00.000+03:00", "replies_count": 0, "uuid": "499396684847c716cdd82dec1a1a4942c53135e1"}, "author": "Jake Van Der Kamp", "url": "http://www.scmp.com/business/banking-finance/article/1844043/what-wider-trading-band-when-yuan-frozen", "ord_in_thread": 0, "title": "What wider trading band when yuan is frozen?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China's decision to widen the yuan's trading band marks the government's latest effort to push ahead with market reforms to increase the yuan's chances of being included in the IMF's currency basket later this year despite the backdrop of a weakening economy.\nBusiness, July 27\nBig hopes indeed, but it seems to me that you don't have much widening to speak of in a widened currency trading band when that currency itself is frozen.\nLook at the first chart of the yuan to US dollar rate since the beginning of this year and tell me that the word \"frozen\" does not describe the track of this exchange rate over the past four months.\nBear in mind that we are looking at a period during which the Shanghai stock market was at last partially opened to foreigners, then took off like a rocket and as suddenly crashed. Cross your heart and tell me it is entirely normal for the currency in which a market is denominated to hold absolutely firm in such circumstances.\nTell me also that it would be unusual for consistent reports of deepening economic gloom on most fronts to have any impact on this currency. I'm a good listener.\nAnd while we are looking at the news, here is a ding-ding alarm bell to another statistic that will have to come out soon and makes such a stable exchange rate all the more unusual.\nFigures for merchandise trade balance and foreign reserves, two key components of the balance of payments, have now been published for the second quarter. They make it possible to estimate private capital flows for the quarter with reasonable accuracy.\nThe second chart shows you the trend. Taking errors and omissions as being capital flow (any economist will tell you this is a safe assumption), investment capital is now fleeing China on a net basis at a rate of US$458 billion a year. Nothing like this has ever been seen before.\nNor, I am sure, has any country in the world ever seen such a stark reversal in capital movements with no impact on its currency.\nWhat we have here is evidence that the authorities are actively manipulating the yuan's exchange rate, either to create the appearance of a stable financial system or in the hopes that freezing the exchange rate will itself help make this financial system stable.\nI can understand why they are tempted to do it although it increasingly looks like a desperation measure and I doubt that they can keep it up indefinitely.\nBut what I cannot understand is why they should then still indulge in talk of widening the yuan's trading band as if things were still exactly the same as four years ago and gradual strengthening of the currency to buy off obstreperous American politicians was still the order of the day.\nThe game has changed. A weaker yuan is now as likely as a stronger yuan and who wants to be in the International Monetary Fund's seniors' club when all it means is an obligation to lose greater sums of money in Greece?\nSomeone needs to install a wake-up clock at the People's Bank of China.\nThis What widening when yuan is frozen?", "external_links": [], "published": "2015-07-28T05:20:00.000+03:00", "crawled": "2015-08-11T17:24:47.993+03:00", "highlightTitle": ""}