{"organizations": [], "uuid": "19fcaf0199d8794b7e88460e5d0ab308860f1e09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/06/12893493/Philly Screen Shot 2015-06-03 at 9.36.57 AM.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12893493.htm", "country": "US", "title": "2015 Philadelphia Fiduciary Summit Gathers Local Employers and Plan Sponsors to Discuss 401(k) and 403(b) Best Practices", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "2015 Philadelphia Fiduciary Summit Gathers Local Employers and Plan Sponsors to Discuss 401(k) and 403(b) Best Practices", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "19fcaf0199d8794b7e88460e5d0ab308860f1e09"}, "author": "Jon Freye", "url": "http://www.prweb.com/releases/2015/08/prweb12893493.htm", "ord_in_thread": 0, "title": "2015 Philadelphia Fiduciary Summit Gathers Local Employers and Plan Sponsors to Discuss 401(k) and 403(b) Best Practices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Xponential Growth Solutions is pleased to announce that it will be hosting the 2015 Philadelphia Fiduciary Summit . The Fiduciary Summit will bring together both local and national expertise to interact with employers made up of CFOs, HR Directors, and Business Owners. Speakers will provide insights to help employers reduce fiduciary risk, identify plan upgrades, and make better decisions that positively impact participants. Mike Falcone, Director, East Region at NFP Retirement emphasizes, \"The 2015 Philadelphia Fiduciary Summit will give plan sponsors a forum to interact with leading local experts who will share the latest trends, best practices and new definitions of a successful plan. The future of retirement plans revolves around having the right plan with the right provider, at the right price, while also helping employees make well-informed investment decisions to be able to retire with financial security.\"\nFalcone will lead the discussion on fiduciary topics impacting local plan sponsors. Guest speakers include:\n Matthew Goerke, Memory Coach\nTopics to be discussed include:\nEvaluating the Reasonableness of Plan Fees Ask the Experts: Local Professional Panel The Latest in Executive Benefits Beyond Retirement – The Bigger Benefits Picture RFI & RFP Best Practices “Memory Switch” Workshop\nThe 2015 Philadelphia Fiduciary Summit is the 12th stop of the Retirement Plan Road Show and is tentatively being held at The Union League of Philadelphia, located at 140 S Broad Street, Philadelphia, PA 19102 from 11:00 am to 3:00 pm (lunch will be served). The Philadelphia Fiduciary Summit is approved for 3 CPE/CPA credits and 3 HRCI general credits. Seating is limited and local plan sponsors will receive priority registration. Additional details and registration information can be found using the link below:\nhttp://xgrowthsolutions.com/retirement-events/2015/10/2015-philadelphia-fiduciary-summit/\nAbout NFP Retirement\nNFP Retirement is a group of dedicated specialists focused on delivering superior retirement plan consulting services. As one of the largest independent retirement plan advisory firms, with over $33 billion in assets under advisement (as of 01/01/2015), NFP Retirement’s 80+ team members assist plan sponsors in the areas of plan design, benchmarking, investment advice, fiduciary compliance and participant outcomes. NFP Retirement is among the first investment advisory firms to be certified by CEFEX for ERISA-qualified plan level consulting. NFP Retirement helps create successful retirement plan outcomes for plan sponsors and plan participants.\nFor more information, please visit nfp.com/retirement.\nAbout Xponential Growth Solutions\nXponential Growth Solutions (XGS) unites 401(k), 403(b) and retirement plan sponsors with elite resources and exclusive connections. Through research, fiduciary summits, and industry expertise, they help the nation’s retirement plan sponsors, fiduciaries, and trustees evaluate their plan and navigate the retirement plan industry. Working to help America reach their retirement goals one retirement plan at a time, XGS also founded the Retirement Plan Road Show, a national series of fiduciary educational summits dedicated to human resources, finance and business professionals in charge of America's 401(k), 403(b), and retirement plans.", "external_links": ["http://xgrowthsolutions.com/retirement-events/2015/10/2015-philadelphia-fiduciary-summit/", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3hncm93dGhzb2x1dGlvbnMuY29tL3JldGlyZW1lbnQtZXZlbnRzLzIwMTUvMTAvMjAxNS1waGlsYWRlbHBoaWEtZmlkdWNpYXJ5LXN1bW1pdC8="], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-31T23:42:33.702+03:00", "highlightTitle": ""}