{"organizations": [], "uuid": "9d423516d8134eda3037959ff51d53531f4513da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l.yimg.com/bt/api/res/1.2/2c4Ur_sSblJVMo47Lj0PFA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-08-18T010250Z_2_LYNXNPEB7H00P_RTROPTP_3_MARKETS-JAPAN-STOCKS_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/asian-shares-steady-now-mixed-005905600.html?l=1", "country": "GB", "title": "Asian shares bounce back from two-year lows, dollar firm", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Asian shares bounce back from two-year lows, dollar firm", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T06:55:00.000+03:00", "replies_count": 0, "uuid": "9d423516d8134eda3037959ff51d53531f4513da"}, "author": "", "url": "http://finance.yahoo.com/news/asian-shares-steady-now-mixed-005905600.html?l=1", "ord_in_thread": 0, "title": "Asian shares bounce back from two-year lows, dollar firm", "locations": ["Tokyo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peter"], "text": ". View photo People walk past a display showing the Nikkei average in Tokyo August 12, 2015. REUTERS/Thomas Peter \nBy Hideyuki Sano \nTOKYO (Reuters) - Asian shares recovered from two-year lows on Tuesday as strong U.S. housing data offset concerns from a weak U.S. manufacturing report, while the dollar's prospective yield advantage kept it firm. \nJapan's Nikkei (.N225) rose 0.1 percent and most shares markets in Asia rose, lifting the MSCI's broadest index of Asia-Pacific shares outside Japan 0.4 percent from its two-year low marked on Monday. \nTwo highly contrasting U.S. economic indicators published on Monday left many market players scratching their heads on the state of the U.S. economy and added to uncertainty over when the Federal Reserve will begin raising interest rates. \nThe New York Fed's Empire State general business conditions index tumbled from 3.86 in July to -14.92 in August, its lowest since April 2009, due to steep drops in new orders and shipments. \n\"The New York Fed's index is a relatively new and volatile index. Still, one would hesitate to brush it aside when it is hitting the lowest level since April 2009, when the world was still reeling from the aftermath of the Lehman shock,\" said Chotaro Morita, chief fixed income strategist at SMBC Nikko Securities. \nBut a later report from the National Association of Home Builders showed U.S. homebuilder sentiment rose in August to its highest level since a matching reading almost a decade ago. \nIn the end, Wall Street shares rose. The S&P 500 Index (.SPX) rose 0.5 percent, while U.S. bond yields dropped, with the benchmark 10-year yield slipping to 2.169 percent from last week's close of 2.198 percent. \nU.S. interest rate futures hardly budged, with markets still not fully convinced the Fed will raise rates in September. \nMost investors, however, are certain a rate hike will occur by the end of year but any subsequent rate hikes will come very slowly, given the fragile state of the global economy. \nThat outlook is enough to set the dollar apart from other currencies which are likely to be capped by continued or further monetary easing. \nThe dollar index against a basket of currencies held firm after three days of gains to stand at 96.842 (.DXY) (=USD), off one-month low of 95.926 hit last Wednesday following China's surprise devaluation of the yuan. \n\"It's not that China is trying to intentionally lower the yuan long-term. It has just brought down the yuan in line with realistic levels as the yuan had been kept in a way artificially high,\" said Shuji Shirota, head of macro economic strategy group at HSBC in Tokyo. \n\"The impact of the yuan move on global markets isn't large,\" he said. \nChina's central bank set the yuan's midpoint (CNY=PBOC) near Monday's closing price. The yuan held little changed at 6.3902 to the dollar (CNY=CFXS) in the onshore trade. The offshore yuan edged up 0.1 percent to 6.4355 per dollar. \nThe euro stood at $1.1075 (EUR=), stabilizing for now after slipping 0.3 percent on Monday. The dollar traded at 124.47 yen (JPY=), up slightly from late U.S. levels. \nThe Thai baht (THB=TH) fell 0.4 percent to a fresh six-year low of 35.55 baht to the dollar, after a bomb blast in Bangkok on Monday killed 19 people, including three foreign tourists, raising worries about fall in tourism revenues. \nCommodity prices remained under pressure from worries about a slower growth in China. \nBrent oil futures (LCOc1) marked a six-month closing low of $48.74 per barrel on Monday, also hurt by news of an April-June economic contraction in Japan, the world's third biggest consumer of oil. \nIt fell another 0.3 percent to $48.58 in Asia on Tuesday while U.S. crude futures (CLc1) flirted with 6 1/2-year lows. \nThe copper futures (CMCU3) fell 0.4 percent to $5,095 per tonne, edging near its six-year low of $5,062 set last week. \n(Reporting by Hideyuki Sano; Editing by Eric Meijer & Kim Coghill) Japan", "external_links": [], "published": "2015-08-18T06:55:00.000+03:00", "crawled": "2015-08-18T07:03:33.512+03:00", "highlightTitle": ""}