{"organizations": [], "uuid": "831951636571c47ea3210900ceafcb20ec453261", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508050499.html", "country": "US", "title": "Zambia: Dangote Creates 7,000 Jobs in Ndola", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zambia: Dangote Creates 7,000 Jobs in Ndola", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T12:22:00.000+03:00", "replies_count": 0, "uuid": "831951636571c47ea3210900ceafcb20ec453261"}, "author": "", "url": "http://allafrica.com/stories/201508050499.html", "ord_in_thread": 0, "title": "Zambia: Dangote Creates 7,000 Jobs in Ndola", "locations": ["Zambia", "Ndola Namibia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Namibia: Child Prostitution Convict Faces Sentencing \n\"This investment is expected to create at least 1,000 direct and 6,000 indirect jobs for Zambians when fully operational. Besides employment creation, the project is already greatly benefiting the local people of Masaiti and the surrounding districts through the transfer of skills, technology and business linkages,\" he said. \n\"In this regard, I hereby direct the Masaiti District Council to reserve land around Dangote cement plant for us to create related industrial clusters whose purpose will be to solely depend on this timely project.\" \nPresident Lungu is confident that management at the cement plant will flow with the Government's intention to ensure Zambians feel part and parcel of the investment. \nHe noted that for years, Zambians have been subjected to high monopolistic pricing structure for cement but was glad that since Dangote came on the market, the prices of the product had been dropping. \n\"This implies that the cost of construction is now becoming more reasonable and affordable by the majority of our people. This is what it should be,\" the President said. \nHe said the principles of the Patriotic Front (PF) Government are to achieve pro-poor inclusive growth aimed at creating real wealth and jobs for the people. \nGovernment, he said, also wants to rehabilitate and upgrade the country's infrastructure and ultimately restore the pride and dignity of Zambians. \nLungu said he considers the private sector as an engine for economic growth and development. Zambia \nPresident Edgar Lungu has finally put his foot down and told Emmanuel Mwamba to take up his appointment as envoy to … see more » Copyright © 2015 Zambia Reports. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-05T12:22:00.000+03:00", "crawled": "2015-08-05T13:22:23.266+03:00", "highlightTitle": ""}