{"organizations": ["Liberty Videocon General Insurance"], "uuid": "24d371c8727ecfd93e52a3346517d4c00c3766bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/common/no_preview.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/festive-season-to-bring-new-cheer-to-motor-insurance-sales-115082800719_1.html", "country": "IN", "title": "Festive season to bring new cheer to motor insurance sales", "performance_score": 0, "site": "business-standard.com", "participants_count": 0, "title_full": "Festive season to bring new cheer to motor insurance sales", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T13:56:00.000+03:00", "replies_count": 0, "uuid": "24d371c8727ecfd93e52a3346517d4c00c3766bf"}, "author": "", "url": "http://www.business-standard.com/article/finance/festive-season-to-bring-new-cheer-to-motor-insurance-sales-115082800719_1.html", "ord_in_thread": 0, "title": "Festive season to bring new cheer to motor insurance sales", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roopam Asthana"], "text": "Festive season to bring new cheer to motor insurance sales Industry, which grew at a rate of 8-10% is expected to see a growth upwards of 20% The festive season is expected to drive better demand for purchase of new automobiles, leading to a further uptick for the motor insurance industry. The industry, which grew at a rate of 8-10 per cent is expected to see a growth upwards of 20 per cent, especially furthered by new product launches in the two-wheeler and four wheeler space during Dussehra-Diwali period. Presently, motor insurance and health insurance take up about 65-70 per cent of the overall business and premiums for the industry, While the average ticket size for auto insurance is not very high, the volumes are high. Roopam Asthana, CEO of Liberty Videocon General Insurance explained that with the new auto launches to cater to the upcoming festive from September to November, motor insurance would see better growth numbers than the first half of the fiscal (FY16). He added that arrival of new models in the market would insurance purchase as well, with third party motor insurance being mandatory in the country.The new . \nThe festive season is expected to drive better demand for purchase of new automobiles, leading to a further uptick for the motor insurance industry. The industry, which grew at a rate of 8-10% is expected to see a growth upwards of 20%, especially furthered by new product launches in the two-wheeler and four wheeler space during Dussehra-Diwali period. Presently, motor insurance and health insurance take up about 65-70% of the overall business and premiums for the industry, While the average ticket size for auto insurance is not very high, the volumes are high. Roopam Asthana, CEO of Liberty Videocon General Insurance explained that with the new auto launches to cater to the upcoming festive from September to November, motor insurance would see better growth numbers than the first half of the fiscal (FY16). He added that arrival of new models in the market would insurance purchase as well, with third party motor insurance being mandatory in the country. The new launches for the festive season in the two-wheeler and four-wheeler segment would include Mahindra TUV300, Renault Kwid and a new Bajaj Pulsar 200SS among several others. Sanjay Datta, chief-underwriting, reinsurance and claims, ICICI Lombard General Insurance said, \"We have seen a good uptick in insurance sales in motor during the festive season. Dealers also come up with better options and we are hopeful that the theme continues this year as well.\" Motor insurance segment had seen some slowdown in sales, with auto sales being under purchase last fiscal. However, it came back on track when sales of automotive vehicles improved in the country. Overall, the non-life industry growth in FY15 was lower than previous year due to slowdown in motor segment. Insurance Regulatory and Development Authority of India (IRDAI) has also brought out an exposure draft on obligation of the insurer with respect to motor TP insurance business. It said every insurer would have a new minimum percentage of business which they have to underwrite every financial year. The regulator said every insurer, during a financial year, shall underwrite such minimum percentage of the 90% of the overall motor TP insurance business premium of the industry for the immediate preceding financial year. Here, the minimum percentage so decided shall be equal to the simple average of insurer's share in total gross premium of the industry and that in total motor insurance premium of the industry, both in the immediate preceding financial year. Also, it was prescribed that no insurer shall refuse motor TP cover to any individual/entity that approaches them. Latest News", "external_links": [], "published": "2015-08-28T13:56:00.000+03:00", "crawled": "2015-08-28T14:51:45.572+03:00", "highlightTitle": ""}