{"organizations": [], "uuid": "3431624609870fbcc4bcd5eda9464c7a32925409", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/19/usa-detroit-bonds-idUSL1N10U17T20150819", "country": "US", "title": "UPDATE 1-Detroit's $245 mln bonds priced in first post-bankruptcy issue", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Detroit's $245 mln bonds priced in first post-bankruptcy issue | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T21:05:00.000+03:00", "replies_count": 0, "uuid": "3431624609870fbcc4bcd5eda9464c7a32925409"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/19/usa-detroit-bonds-idUSL1N10U17T20150819", "ord_in_thread": 0, "title": "UPDATE 1-Detroit's $245 mln bonds priced in first post-bankruptcy issue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds yield spreads, bond rating, details of the issue, background)\nAug 19 (Reuters) - Detroit's post-bankruptcy debut in the U.S. municipal bond market on Wednesday resulted in hefty yields for $245 million of bonds, signalling that investors remain skeptical of the city's recovery.\nTax-exempt bonds totaling $134.7 million were priced at par with a top yield of 4.50 percent in 2029. That resulted in a spread over Municipal Market Data's benchmark yield scale for top-rated bonds of 194 basis points. The yield on the A-rated bonds was also 133 basis points over MMD's single-A scale.\nNearly $110.3 million of taxable bonds maturing in 2022 were priced at par with a 4.60 percent coupon - a 300-basis-point spread over comparable U.S. Treasuries, according to the deal's pricing scale.\nThe city, which exited the biggest-ever U.S. municipal bankruptcy on Dec. 10, warned potential investors ahead of the sale \"there can be no assurance the city of Detroit will not file another bankruptcy petition in the future.\" The prospectus for the deal added it is \"impossible to predict accurately\" what the consequences of a new Chapter 9 bankruptcy filing by the city would be for bondholders.\nThe bonds earned an investment-grade A rating from Standard & Poor's largely based on a Michigan law that placed a specific statutory lien on Detroit income taxes pledged to pay off the debt. S&P kept Detroit's underlying credit rating deep in the junk category at B, citing the city's \"very weak\" economy, management and budgetary flexibility as well as its previous bond defaults\nThe bonds, sold through the Michigan Finance Authority, will replace variable-rate bonds issued last year to fund Detroit's bankruptcy and other costs.\nProceeds from the initial $275 million of bonds, which were privately placed with Barclays Capital, were earmarked for retiring a prior $120 million Barclays loan to the city, to pay certain creditor claims from the bankruptcy and to finance city improvements. Detroit has said it was able to reduce the size of the upcoming borrowing by $30 million to $245 million after the city's bankruptcy consultants reduced their fees.\n(Reporting by Karen Pierog in Chicago; Editing by Matthew Lewis)", "external_links": [], "published": "2015-08-19T21:05:00.000+03:00", "crawled": "2015-08-19T20:28:40.097+03:00", "highlightTitle": ""}