{"organizations": [], "uuid": "a7980a0b8da0a4dcb201ddd5d99a89b6f969d2b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/05/Arvind-Subramanian-PTI2s.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/india-pitches-for-rating-upgrade-by-sp-on-strong-macro-data-report/128189", "country": "IE", "title": "India pitches for rating upgrade by S&P on strong macro data: Report", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "India pitches for rating upgrade by S&P on strong macro data: Report | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T01:08:00.000+03:00", "replies_count": 0, "uuid": "a7980a0b8da0a4dcb201ddd5d99a89b6f969d2b9"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/india-pitches-for-rating-upgrade-by-sp-on-strong-macro-data-report/128189", "ord_in_thread": 0, "title": "India pitches for rating upgrade by S&P on strong macro data: Report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "India on Monday pitched for rating upgrade by Standard and Poor’s citing strong macroeconomic indicators, low inflation and improvement in fiscal as well as current account deficits.\nIn his presentation to the visiting S&P officials, Chief Economic Advisor (CEA) Arvind Subramanian said that country has strong medium-term growth potential on back of persistent economic reforms which are being pursued by the government.\nS&P has BBB- rating on India with stable outlook.\nAccording to the sources, Subramanian also expressed the government’s commitment to implement the Goods and Services Tax (GST) bill and said that country’s growth in the current fiscal was expected to improve to around 8 per cent.\nSubramanian based his optimism for higher growth on macroeconomic stability, better-than-expected monsoon and cumulative effect of reforms.\nS&P, according to sources, inquired about time line for implementing the GST bill and also plans for setting up a holding company to deal with the problem of stressed assets in the banking sector.\nBanking secretary Hasmukh Adhia, who has been appointed as the revenue secretary, in his presentation highlighted the steps taken by the government to enhance governance reforms and encourage accountability.\nAdhia is reported to have told the S&P officials that ARCs were functioning and there was no need for setting up a holding company to deal with the problem of stressed assets.\nHe also spoke about the government’s plan to infuse fresh capital in the state-owned banks and added there was no shortage of credit in the banking system.\nS&P officials, according to sources, inquired about the plans of the government to deal with impact of the turbulence created by devaluation of yuan by the Chinese government.\nThey also expressed concern about the slowdown in exports and problems in the external sector.\nSubranamian on his part said that India’s fiscal deficit and current account deficit were under control and declining oil prices would help in improving the external sector.\nThe government, he added, was committed to bring down fiscal deficit to 3 per cent.\nHe further said that gold imports have come down and the growth in the corporate as well as indirect taxes were on track and efforts were being made to broaden the tax base.\nHe also reiterated the government’s commitment not to take recourse to retrospective amendments of the tax laws that might create fresh liabilities.\nSubranamian gave an elaborate presentation on the various government initiatives like ‘ Make in India ’ campaign and social security programmes.\nHe said that distribution of cooking gas subsidy through the direct benefit transfer scheme has helped in saving Rs 12,700 crore.\n 31, 2015 5:08 pm", "external_links": [], "published": "2015-09-01T01:08:00.000+03:00", "crawled": "2015-08-31T22:18:22.502+03:00", "highlightTitle": ""}