{"organizations": [], "uuid": "b2a638495dc87fa961baeb4b46735d39474d3e6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/v/9/9/o/image.related.articleLeadwide.620x349.giuvcx.png/1439157966468.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2010/industrials/capital-goods", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/world-business/robots-set-to-exterminate--your-job-20150809-giuvcx.html", "country": "AU", "title": "Robots set to exterminate ... your job", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Robots set to exterminate ... your job", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "b2a638495dc87fa961baeb4b46735d39474d3e6f"}, "author": "Robert Trigaux, Tampa Bay Times Columnist", "url": "http://www.smh.com.au/business/world-business/robots-set-to-exterminate--your-job-20150809-giuvcx.html", "ord_in_thread": 0, "title": "Robots set to exterminate ... your job", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A Japanese hotel's reception area is 'manned' by a robot. Photo: Bloomberg\nWill a robot replace you at work? The odds, increasingly, say yes.The good news is that one recent analysis of the job with a 99 percent chance to be replaced by a machine is telemarketing.\nThere is admittedly some personal delight in learning that. I also now understand why parents always cherish the idea that their child wanted to be a doctor. Not for the prestige or money but for job security. The same analysis gives only a 0.4 percent chance a robot will replace that occupation.\nIf you keep up on the chatter about the future of work, it's tough to avoid the buzz about a new wave of automated machines and robots empowered with advanced artificial intelligence. (We're way past the Roomba automated vacuum cleaner from iRobot.) Next-generation robots will begin to take over not just blue-collar, repetitive-motion jobs, but also white-collar occupations like bankers and even fashion model.\nBillionaire Masayoshi Son will start selling his humanoid robots in the US next year. Photo: Bloomberg\nIf we shift to driverless (automated) cars (goodbye, taxi drivers), then in theory we'll have far fewer collisions (see ya, auto repair shops), ambulance calls (farewell, emergency med techs), less need for auto coverage (so long, insurance agents), attorneys (adios, personal injury lawyers) and certainly their overwhelming barrage of radio and TV ads (adieu, advertising agencies).\nThese jobs won't disappear entirely, but the growth of work opportunities in these occupations will undoubtedly shrivel.\nVersions of this ripple effect from a robotic revolution are going on all around us. We just don't always recognize it for what it is. At direct mail marketer Valpak, one of the most automated materials handling systems in the world stuffs blue envelopes with coupons.\nAt USF Health's Centre for Advanced Medical Learning and Simulation, visiting surgeons can learn robotic surgical techniques. And some financial advisory firms are easing into the burgeoning automated investment management business - better known as robo-advising. It's about providing clients with automated investing services that let algorithms do the work of financial advisers, assuring quality control in investment advice without the need to hire more expensive people.\nLast year, Aloft Hotels announced an unusual hire at its California location: a robotic butler, or a Botlr, that can deliver room service to its guests. This is just the beginning.\nTwo Oxford researchers recently analyzed the skills required for more than 700 different occupations to determine how many would be susceptible to automation in the near future. The news, says an article in the Atlantic magazine last month, \"was not good.\" The two concluded that machines are likely to take over 47 percent of today's jobs within a few decades.\nThat's the same analysis that says telemarketers, umpires, lending officers, fashion models, restaurant cooks and manicurists are among many professions that have a 94 percent or higher risk of being replaced by a machine.\nConversely, teachers of younger children, doctors, occupational therapists and clinical counselors all run a very low risk -- less than 1 percent -- of a robot taking their jobs, according to this analysis. How did they determine who was more or less at risk? Some aspects of a job are easier to automate than others. It all depends on the tasks.\nIf your job requires you to be creative, to squeeze into small spaces, to personally help someone or to demonstrate negotiation skills, it's unlikely a machine will replace you.\nThe trick, of course, is that robots, automated systems and the rise of algorithms -- step-by-step procedures for solving a problem or accomplishing some task by a computer -- are getting more capable at a faster clip than human beings are improving their skills. Just look at smartphones and the number of apps we are all so happy to rely on.\nJob hunters today, especially younger adults trying to find work at busy companies, must already get by algorithms used to initially screen the thousands of resumes sent online. Certain words or phrases indicating specific job skills, for example, may open the digital door enough to eventually reach a human and possibly an interview. Use the wrong word or phrase and you may be out of luck.\nPart of the recent buzz over the coming robot invasion into the workplaces is because of a new book written by Silicon Valley entrepreneur Martin Ford. Rise of the Robots: Technology and the Threat of a Jobless Future tells how the use of robots is about to dramatically increase, in part because technology has at last created a standard operating platform -- like Android for smartphones or Windows for computers -- that can now be built upon efficiently.\n\"We are at the leading edge of a wave of innovation that will ultimately produce robots geared toward nearly every conceivable commercial, industrial and consumer task,\" Ford writes. Robots may even help reduce jobs being outsourced overseas because adding more robots to factories will reduce costs and make U.S.-based facilities more competitive. Ford calls this potential trend \"factory re-shoring.\"\nIn Florida, Amazon (which is the world's biggest retailer by market value) is rapidly expanding its warehouse and distribution footprint, most recently planning 2,000 more jobs to accommodate growth and the company's push for same-day delivery to customers. Amazon is no fool and already uses plenty of robotic systems. It seems likely many of those new jobs now cheered by area politicians will be replaced over time by additional robots.\nIn Rise of the Robots , Ford also points to automated technology in fast-food chains like McDonald's -- from touchscreens for ordering and robotic cooking systems -- that he says could easily trim a workforce by half or more. Think of that cost-cutting change clashing with the recent push by unions to seek dramatic wage increases to $15 an hour for fast-food workers.\nWhat happens as our population grows and more and more jobs become mechanized? Ford writes that the United States has always believed it can generate higher-wage, higher-skill jobs to \"absorb all those newly freed up workers\" -assuming they acquire the necessary training.\n\"That assumption rests on increasingly shaky ground,\" Ford warns. \"The machines are coming for the high-wage, high-skill jobs as well.\"\nIt's tough to argue with Ford. We've grown used to believing there's always time to prepare for economic change, socially and politically. I'm not so sure. We can't all be doctors.", "external_links": [], "published": "2015-08-10T03:00:00.000+03:00", "crawled": "2015-08-10T03:41:59.612+03:00", "highlightTitle": ""}