{"organizations": [], "uuid": "8b4af84f6cd84c31f3c9aa8911d7e8657c8b0a90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/mahindra-vs-skoda-s.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/automobiles/new-mahindra-xuv500-vs-skoda-yeti-one-is-loaded-with-features-the-other-is-loaded-with-technology/123506", "country": "IE", "title": "New Mahindra XUV500 vs Skoda Yeti: One is loaded with features; the other is loaded with technology", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "New Mahindra XUV500 vs Skoda Yeti: One is loaded with features; the other is loaded with technology | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T08:15:00.000+03:00", "replies_count": 0, "uuid": "8b4af84f6cd84c31f3c9aa8911d7e8657c8b0a90"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/automobiles/new-mahindra-xuv500-vs-skoda-yeti-one-is-loaded-with-features-the-other-is-loaded-with-technology/123506", "ord_in_thread": 0, "title": "New Mahindra XUV500 vs Skoda Yeti: One is loaded with features; the other is loaded with technology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Toyota extends halt in Tianjin operations through Wednesday CV makers also want slice of meaty second-hand pie Zoom into the future One is named after the abominable snowman, the other looks more so. One is made to conquer most terrains, the other wins you over with the equipment it offers. One is clearly a driver’s car, the other spoils the passengers. Today we try and find out which, of the Skoda Yeti and the new Mahindra XUV500, is a better SUV to buy.\nAppearance\nThe XUV500 has been thoroughly updated. Up front, the new static bending projector headlamps with light guides embrace the bold new grille, which now comes with chrome inserts. The high-intensity projector headlamps light up curves when you turn the steering.\nThe bonnet has been raised and it gets modern-looking 17-inch alloy wheels.\nThere is a chrome line along the windows and at the rear above the licence plate. Because of its size, the XUV500 has massive road presence. A unique feature is that the ORVMs project the XUV500 logo on the ground as soon as the car comes to a halt—an ego-enhancing gimmick.\nThe Yeti, which was updated last year, gets horizontal lines at the front and the logo is neatly placed on top of the grille. While from the sides it looks boxy, the wheel housing has a curvy profile. At the rear, it gets the characteristic Skoda tail-lamps and a restyled bumper.\nWhat attracts attention is the contrasting roof—you can choose silver roof rails with a matte black roof. Because of its relatively small size, the Yeti tends to get lost in the crowd.\nCabin\nThe XUV500 gets dual-tone dashboard with integrated cluster hood, a GPS navigation system consisting of over 1.5 million km of road data across 1,200 cities, and a driver information system that reports vehicle’s vital information in real time.\nAs soon as you open the door, you are greeted by illuminated scuff plates and beige leather seats. The driver’s seat is six-way power-adjustable, and you get a tilt and telescopic steering.\nThere are also rain-sensing wipers and light-sensing headlamps. Second row passengers get ample seating space, while the third row can accommodate two adults. There are multiple charging points in each seating row as well as an inbuilt laptop holder.\nThe new XUV500 gets an icy-blue lounge lighting feature—simply push a button and concealed lights will transform the cabin into a lounge. However, we found it too gimmicky, just like the ORVM logo projection feature. The top-end variant gets electric sunroof.\nOverall, the XUV500’s cabin is loaded with so many features that it might take you days, if not weeks, to understand and use all of these.\nThe Yeti’s three-spoke multifunctional steering wheel—adjustable for height and reach—looks far more upmarket than the XUV500’s. There is decent space all around and even rear-seat passengers get enough legroom—there is no third row, though.\nAll three rear seats have adjustable backrests and can be folded down. The boot is large and a low loading lip adds to convenience. It doesn’t have as many features as the XUV500, but the ones it has are usable. The plastic quality is top-notch, materials used are premium, and its European build quality is solid.\nDrive\nThe XUV500 is powered by the 2179cc mHawk diesel engine that develops a peak power of 140bhp and a maximum torque of 330Nm. It is mated to a 6-speed manual gearbox. The engine is powerful enough to take this 2.5-tonne vehicle from 0-60 kmph in just 5.4 seconds.\nHowever, from there on, the engine starts to feel the weight. No, it doesn’t feel underpowered, but the acceleration is not as linear as in the Yeti.\nAt three-figure speeds on curvy highways there is a noticeable body-roll; in fact, body-roll is also apparent when you take sharp turns on city roads at speeds under 60 kmph.\nIts turning radius is 5.6 metres, so parking or turning around on narrow lanes or in the malls isn’t effortless, but what helps is the parking camera with dynamic assist. Dual front airbags are standard. The view from the driver’s seat is commanding.\nThe Yeti comes with two diesel engine options—the 2.0 TDI (109 bhp) two-wheel drive mated to 5-speed manual transmission and the 2.0 TDI (138 bhp) all-wheel drive mated to 6-speed manual transmission.\nBoth engines provide brisk acceleration.\nVisibility is good and, thanks to large ORVMs and sensors, parking this small SUV is a breeze. Rear passengers may find the ride a bit jerky, especially on bad roads. It gets four disc brakes as standard. As far as sheer driving experience is concerned, the Yeti is hard to beat—it drives like a sedan.\nHowever, if the Yeti has to really portray Skoda’s technology at its best, it must come with the famed DSG automatic transmission option.\nVerdict\nThe XUV500 comes in six variants. The base W4 costs R11.29 lakh, while the top-end W10 AWD costs R16.2 lakh. This Mahindra vehicle, clearly, is immense value-for-money.\nThe top-end variant gets wares that might even put some luxury cars to shame. While some of these features are gimmicky, it doesn’t really hurt having these in your SUV. What adds to XUV500’s advantage is that it can be turned into a 7-seater at the pull of a string. Add to that Mahindra’s vast sales and service network and you have a vehicle that you won’t mind owning and living with.\nThe Yeti comes in two variants—Elegance 4×2 (R20.11 lakh) and Elegance 4×4 (R21.81) lakh. Everything about this European SUV is likeable, but the price.\nWhile the price may seem right for the quality and technology you get, for a few lakhs extra you can even buy the much bigger Fortuner. Our opinion is that the Yeti is an SUV for the discerning few; the XUV500 is an SUV for all others.\n(Prices are ex-showroom, Delhi)\n 22, 2015 12:15 am", "external_links": [], "published": "2015-08-22T08:15:00.000+03:00", "crawled": "2015-08-23T22:10:13.453+03:00", "highlightTitle": ""}