{"organizations": [], "uuid": "640417ea6117a00dd675fa3c5cea52514153855e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/solar-cell-t.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/tech/now-worlds-first-aqueous-solar-flow-battery-that-saves-20-energy/112390", "country": "IE", "title": "Now, world’s first ‘aqueous solar flow battery’ that saves 20% energy", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Now, world’s first ‘aqueous solar flow battery’ that saves 20% energy | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T20:23:00.000+03:00", "replies_count": 0, "uuid": "640417ea6117a00dd675fa3c5cea52514153855e"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/tech/now-worlds-first-aqueous-solar-flow-battery-that-saves-20-energy/112390", "ord_in_thread": 0, "title": "Now, world’s first ‘aqueous solar flow battery’ that saves 20% energy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Indian rupee recoups 17 paise against US dollar in early trade HCL Tech Q4 net slips 2.8% to Rs 1,783 crore; shares fall Hitchhiking Robot: Vandals trash hitchBOT, bring cross-country trip in US to end In a breakthrough discovery, researchers have designed a solar cell and battery into a single device, which achieves more energy savings than a regular battery.\nOhio State University’s Yiying Wu said that 20 percent energy saving comes from sunlight, which is captured by a unique solar panel on top of the battery.\nThe solar panel, on top of the battery, is now a solid sheet, rather than a mesh as in the previous design.\nAnother key difference comes from the use of a water-based electrolyte inside the battery as water circulates inside it. The new designs are called aqueous flow batteries.\nWu said that the truly important innovation here was that they have successfully demonstrated aqueous flow inside their solar battery.\nIt is the first aqueous flow battery with solar capability.\nWu added that it was also totally compatible with current battery technology, very easy to integrate with existing technology, environmentally friendly and easy to maintain.\nThe new aqueous flow battery doesn’t need air to function, so the solar panel is now a solid sheet.\nIn the study, the researchers compared the solar flow battery’s performance to that of a typical lithium-iodine battery.\nThey charged and discharged the batteries 25 times. Each time, both batteries discharged around 3.3 volts.\nThe difference was that the solar flow battery could produce the same output with less charging. The typical battery had to be charged to 3.6 volts to discharge 3.3 volts. The solar flow battery was charged to only 2.9 volts, because the solar panel made up the difference. That’s an energy savings of nearly 20 percent.\nThe project is still ongoing, and the solar flow design will undoubtedly evolve again as the researchers try to make the battery more efficient.\nThe study is published in journal of the American Chemical Society.\nFirst Published on August 02, 2015 12:23 pm", "external_links": [], "published": "2015-08-02T20:23:00.000+03:00", "crawled": "2015-08-03T08:31:12.454+03:00", "highlightTitle": ""}