{"organizations": [], "uuid": "c5ea834212bff91ef559326a42624ea34b0965bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneyweb.co.za", "main_image": "http://www.moneyweb.co.za/wp-content/uploads/2014/07/shutterstock_156580772-Large.jpg", "site_section": "http://www.moneyweb.co.za/category/mymoney/moneyweb-personal-finance/page/2/", "section_title": "Personal Finance - Page 2 of 4 - Moneyweb", "url": "http://www.moneyweb.co.za/mymoney/moneyweb-tax/opened-tax-free-savings-account/", "country": "ZA", "title": "Have you opened a tax-free savings account?", "performance_score": 0, "site": "moneyweb.co.za", "participants_count": 2, "title_full": "Have you opened a tax-free savings account? - Moneyweb", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T08:31:00.000+03:00", "replies_count": 1, "uuid": "54a1002b18533a1115d2d52e09589f62077f0bdd"}, "author": "Ingé Lamprecht", "url": "http://www.moneyweb.co.za/mymoney/moneyweb-tax/opened-tax-free-savings-account/#post-0", "ord_in_thread": 0, "title": "Have you opened a tax-free savings account?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG – Although initial numbers suggest several thousand tax-free savings accounts (TFSAs) have been opened since its introduction, a lot more education and product innovation may be necessary to incentivise a broader take-up – especially amongst lower income earners.\nSome product providers were still mulling their options at the regulatory launch on March 1 this year and to an extent it is probably too early to gauge the initial success of TFSAs.\nHowever, preliminary indications imply that aggressive marketing efforts by some product providers have paid off.\nYet, financial advisors Moneyweb have spoken to, said only a handful of clients have asked about TFSAs. And alarmingly, there are cases where investors have already withdrawn money from their accounts, perhaps suggesting that they don’t understand the long-term benefits.\nSome products may also be inaccessible or too expensive for those with only R250 a month to invest.\nThe background\nSince March 1 this year, individuals may invest up to R30 000 a year in one or more TFSAs (collectively) up to R500 000 over their lifetime. Returns on the accounts are completely tax-free.\nInvestors have access to their funds at any point, but in order to discourage withdrawals for impulse purchases, deposits are subject to the annual and lifetime contribution limits. Thus, if an individual deposits R10 000 in a TFSA during a tax year and withdraws all the money during that same year, he or she will only be able to deposit another R20 000 during that tax year.\nThe TFSA is an effort by National Treasury to encourage South Africans to save and to reduce the financial vulnerability of households.\nHave South Africans embraced this opportunity?\nOlano Makhubela, chief director for financial investments and savings at National Treasury, says while they have received limited feedback, one product provider has advised that 3 500 individuals had opened accounts with a total balance of R34\nmillion, “which is really a good start”.\nArguably the most visible advertising campaign has been that of Old Mutual.\nRichard Treagus, investment and savings general manager at Old Mutual, says around 17 000 TFSAs have been opened.\n“In the four months until the end of June 2015 customers have invested more than R120 million into their tax-free investments,” he says.\nMore than 8 000 accounts have been opened across the JSE broker network since the launch, says Mpho Ledwaba, head of marketing at the JSE.\nMultimanager Sygnia, who ran a fairly small ad campaign, has opened around 400 accounts with a total of R7.3 million invested.\nTreagus says customers from all walks of life have participated.\n“We are particularly pleased about the large number of customers investing directly online, of whom a third are under 30 years old. We are seeing higher take-up amongst urban investors, with more than half of the investors from Gauteng and Cape Town.”\nLedwaba says most interest came from first-time investors who are still learning about investing on the exchange as well as experienced investors.\n“There are over 38 exchange-traded funds (ETFs) available for the account as per the regulations. Moreover, some brokers have developed specific packages or products for the tax-free savings.”\nThe take-up has been in line with expectations although they need to work harder in collaboration with their brokers to create and raise awareness amongst potential consumers, Ledwaba says.\nCharlene Swartz, head of retail investment administration at Sygnia, says a large number of accounts have been opened by investors that are new to Sygnia.\nWhile most of its other business comes via independent financial advisers (IFAs), it seems the TFSA is something people access directly without the appointment of an IFA, she says.\nThis may in part explain the lack of appetite reported by IFAs.\nJohannes Burger, CFP® and private client adviser at Autus Private Clients, says if 5% of his clients have asked for a TFSA, it is a lot.\nAlthough he likes the accounts and appreciates the long-term benefits of TFSAs he has opened relatively few on behalf of clients.\nHis big frustration is that Allan Gray hasn’t launched a product yet .\nIt doesn’t make sense for an adviser to support too many platforms, because it is administratively quite burdensome. Allan Gray’s administration is first class and most of his clients’ money is managed via its platform, he says.\nWhere he has opened TFSAs on behalf of investors, this was done directly through Nedgroup Investments.\nBurger says to really benefit from the compounding in a TFSA the investor has to have time on his side and avoid withdrawals. Where clients will likely withdraw money from an investment in the near future, he prefers not invest the funds in a TFSA.\nWouter Fourie, director at Ascor Independent Wealth Managers and the FPI’s Financial Planner of 2015/16, also says very few clients have inquired about TFSAs.\nFourie says they have been communicating the benefits of the structure to clients, but have also advised them to wait.\n“Very few companies and banks were ready to launch their full product offering in the first few months after the announcement by Treasury and very little information was available to compare the products with each other. This has changed in the last month and we are getting more and more information and have started our due diligence on the different offerings available. There is a big difference in the offerings and the public should take time and get advice before just jumping into the first product available,” he says.\nUltimately it seems more education needs to be done while there is also room for more innovative, low cost products.\nTreagus says although they are offering one of the lowest minimum contributions amongst providers, they believe the lower income market is not yet accessing the product.\n“We are hoping that the regulations will be extended to allow the inclusion of smoothed performance funds, because our research consistently shows that this market seeks funds that offer real growth without volatility.”\n* The journalist has a tax-free savings account with Sygnia.", "external_links": [], "published": "2015-08-12T08:31:00.000+03:00", "crawled": "2015-08-12T07:39:41.965+03:00", "highlightTitle": ""}