{"organizations": [], "uuid": "761ab015ba60d3b09c8f2dd0895d28918f2d5423", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/i/j/y/t/image.related.afrArticleLead.620x365.gj7ruf.png/1440562732197.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/equity-markets/asx-bears-in-charge-as-a-quarter-of-asx-200-down-20-per-cent-or-more-20150825-gj7ruf", "country": "AU", "title": "ASX: Bears in charge as a quarter of ASX 200 down 20 per cent or more", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "ASX: Bears in charge as a quarter of ASX 200 down 20 per cent or more | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T11:40:00.000+03:00", "replies_count": 0, "uuid": "761ab015ba60d3b09c8f2dd0895d28918f2d5423"}, "author": "Vanessa Desloires", "url": "http://www.afr.com/markets/equity-markets/asx-bears-in-charge-as-a-quarter-of-asx-200-down-20-per-cent-or-more-20150825-gj7ruf", "ord_in_thread": 0, "title": "ASX: Bears in charge as a quarter of ASX 200 down 20 per cent or more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A quarter of the ASX 200 is in a bear market with no signs of recovery. Share on twitter Share on Google Plus by Vanessa Desloires A quarter of Australia's top listed companies are trapped in a bear market, and the continuing global market rout is threatening to swell the number to a third.\nThe indiscriminate selling of ASX 200 companies has pulled the benchmark index down 16 per cent from its April high.\nOver the past four months, 48 of the top 200 companies have had their share price fall by 20 per cent or more, the definition of a bear market, and 18 more are down more than 17 per cent.\nColliding concerns over the true extent of the slowdown in China's economy and the timing of the first interest rate rise in the United States are the main drivers of market volatility this time around, IG markets analyst Angus Nicholson said.\nWhat characterised this correction is that the selling has been indiscriminate, he said.\n\"All the sectors have been dragged down together, and not all of them have exposure to China ,\" he said.\nThe list of the worst performers is littered with oil and gas companies savaged by plunging oil prices.\nSenex Energy is the worst performer, plummeting 74 per cent, while Drillsearch Energy and Liquefied Natural Gas have each shed 50 per cent of their share price.\n The heavyweight banks and resources stocks have been doing the bulk of the dragging on the ASX during what has been the biggest sell-off since the Eurozone crisis in 2011.\nWestpac Corporation and ANZ Banking Group are both 21 per cent down, with Commonwealth Bank and National Bank closely behind but not in official bear mode yet.\nJust 15 per cent of companies were trading above their 50-day moving average on Monday. Mr Nicholson said historically, the market tended to rally when that number reached 20 per cent or below.\n\"It would be uncharacteristic to see further declines in the ASX, but I don't see the foundations for a strong bounce given the macro economic uncertainty,\" Mr Nicholson said.\nMany of the companies in the bear's grip include those punished during reporting season, including SEEK and Ansell, both down 27 per cent.\nThe numbers indicated many of companies had been oversold and some were beginning to look attractive, particularly in consumer staples and healthcare, Mr Nicholson said.\n\"Domino's is one example, and some of the healthcare names that aren't related to China have been sold down and they're buying opportunities,\" he said.\nThe banks were looking oversold, although capital concerns still loomed, potentially stemming their short term performance.\n\"Westpac is below its long term price-earnings ratio, there is a clear buy there,\" Mr Nicholson said.\nUBS equities analyst David Cassidy said while the big miners would likely join in on a market bounce, their ultimate fate would be determined by iron ore and oil prices, which are showing little signs of recovery as supply continues to outstrip demand.\n\"Outperformers in the correction have generally been the lower beta sectors [consumer staples, healthcare and utilities],\" Mr Cassidy said. \"Lower beta\" stocks are those which tend to be less volatile than the broader sharemarket.\n\"General industrials have been best performing, buoyed by stock specific performance from the likes of Qantas Airways and Asciano.\"\n​Mr Cassidy said a number of stocks of note looked oversold, with attractive price-earnings ratios, including Flight Centre, Computershare, Ansell, ANZ Banking Group, Fairfax Media (publisher of The Australian Financial Review and BusinessDay ), Incitec Pivot and Lend Lease Group.\nCredit Suisse analyst Hasan Tevfik said the low cost of debt in Australia, combined with a recovery in corporate free cash flow as uncovered this reporting season, meant equities still looked attractive.\nBut he said investor sentiment was still fragile, and more central bank easing was needed to improve the \"fragile state of the financial markets\".\nCompanies with free cash flow margins at 10 per cent or more and yield at 4 per cent or more that looked attractive included Sonic Healthcare, ResMed, Oil Search, REA Group and Aristocrat Lesiure, according to Credit Suisse.", "external_links": ["http://www.smh.com.au/business/markets-live/markets-live-tensions-simmer-20150825-gj7rki.html", "https://twitter.com/http://twitter.com/VDesloires", "https://plus.google.com/https://plus.google.com/110505490532745073834/posts", "http://www.smh.com.au/business/markets/china-analysis-interest-rate-cut-raises-fresh-questions-20150825-gj7ojn.html"], "published": "2015-08-26T11:40:00.000+03:00", "crawled": "2015-08-26T08:07:37.479+03:00", "highlightTitle": ""}