{"organizations": ["Samsung Electronics", "JK Shin", "Samsung"], "uuid": "dcc31ebbdda358b76e6609adeb3fcce1a027f116", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6JpS7jBbwokT_MWFpQiItA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://l.yimg.com/os/publish-images/finance/2015-08-13/4b61a420-41e3-11e5-b4fc-637e103c4905_IMG_3154.JPG", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/same-old-phone-strategy-may-not-help-samsung-much-173936860.html?l=1", "country": "GB", "title": "Same old phone strategy may not help Samsung much", "performance_score": 1, "site": "yahoo.com", "participants_count": 0, "title_full": "Same old phone strategy may not help Samsung much", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T02:30:00.000+03:00", "replies_count": 0, "uuid": "dcc31ebbdda358b76e6609adeb3fcce1a027f116"}, "author": "", "url": "http://finance.yahoo.com/news/same-old-phone-strategy-may-not-help-samsung-much-173936860.html?l=1", "ord_in_thread": 0, "title": "Same old phone strategy may not help Samsung much", "locations": ["New York City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Aaron Pressman", "Merrill Edge"], "text": "Merrill Edge is not responsible for the editorial content of this program Same old phone strategy may not help Samsung much By Aaron Pressman 5 hours ago  . View photo Samsung Electronics CEO JK Shin announced two new phones at an event in New York City on August 13, 2015. \nAfter failing to beat competitors with beautifully crafted, premium smartphones earlier this year, Samsung Electronics ( 005930.KS ) is back -- with more of the same.The struggling South Korean phone maker unveiled two snazzy new models on Thursday at Lincoln Center's Alice Tully Hall in New York City: the Galaxy Note 5 and the Galaxy S6 Edge+. But there was no sign of a change in approach that might help Samsung claw back the market share it has lost to Apple's ( AAPL ) iPhones at the high end and to Chinese competitors Xiaomi and Huawei at the low end. Shares of Samsung, which have lost 14% in the past three months, fell 1% on Thursday.Apple's decision last year to offer larger screens combined with the increasing quality of cheap Chinese-made phones has put a squeeze on Samsung. Still the world's top smartphone maker, Samsung saw its global market share shrink to 22% in the second quarter from 25% a year earlier, according to International Data Corp. And profits at its smartphone unit dropped 38% in the quarter. Still, other parts of the company, like semiconductor production, are booming -- an 83% increase in chip profits nearly offset the decline from phones.Samsung also made news on Thursday about its mobile payment app, Samsung Pay, announcing that the service will be available in the United States starting on Sept. 28. Although the app faces strong competition from Apple Pay and Google's ( GOOGL ) Android Pay, Samsung was able to convince most of the major U.S. cellphone carriers to preload the service, overcoming a major hurdle that could have crippled consumer adoption.The updated phones are certainly gorgeous. The new Galaxy S6 Edge+ has the same attractive curved glass screen as Samsung's S6 Edge released four months ago, but with even bigger dimensions. The screen is 5.7 inches measured diagonally versus the 5.1-inch screen on the earlier model. A new Galaxy Note 5 updates last year's model, which already had a 5.7-inch screen, in a lighter, thinner package. Yahoo Tech reviewer Dan Howley said he was impressed with both new models .The phones, available on Aug. 21, will go to head-to-head with Apple's iPhone 6+ and its 5.5-inch screen. Of course, Apple is expected to announce an update to the 6+ next month. Samsung virtually invented the \"phablet\" category of oversized phones with its Note line, now on its fifth iteration. \"Each new version of the Note has been more popular than the last,\" Samsung Vice President Justin Denison said at Thursday's event. But Apple has succeeded by copying the larger-screen design while adding its own iOS software and iTunes media ecosystem. Samsung's phones run on Google's Android software, as do most phones from its Chinese competitors. The more promising news may actually have been the Samsung Pay launch date. Samsung has a huge technological advantage over other mobile payment apps because of LoopPay, a small Boston startup it bought in February. LoopPay's technology allows a phone to mimic the signal a typical store's credit card reader receives when a card is swiped. View photo . Samsung said it would start offering its new mobile payments service, Samsung Pay, in the U.S. on Sept. 28. That means Samsung Pay will work at almost every cash register on the planet, while apps from Apple and Google work only with specially equipped wireless registers that are much less common. Samsung says its app can be accepted at 10 million locations in the U.S., more than 10 times the number equipped to handle Apple and Google apps.\nSamsung Pay can also work wirelessly or via bar code readers, if a check out register supports one of those technologies. And the app will be able to incorporate store-branded cards, membership cards and gift cards, Samsung said. \"Your wallet's going to miss you,\" Injong Rhee, who oversees the payments service, joked at Thursday's event. \nEarlier this year, it wasn't clear whether the major U.S. cellphone carriers would allow Samsung to preload its payments app on the Samsung phones they sold. The carriers have partnered with Google on Android Pay. Without preloading, most consumers probably wouldn't take the extra step to install Samsung's app, greatly hampering usage. But as of Thursday, AT&T ( T ), T-Mobile ( TMUS ) and Sprint ( S ) had agreed to preload the app. Among the major carriers, only Verizon Wireless ( VZ ) has not. \n\"We are still in the process of evaluating Samsung Pay and we will keep our customers updated on any news regarding the service,\" Verizon spokesman Chuck Hamby said. \nSamsung said it would also offer its payments app in South Korea starting next week, and in China, Spain, the United Kingdom and other countries in the \"near future.\" Google hasn't announced a launch date for its payment service. And a solution being developed by a consortium of retailers, the Merchant Customer Exchange, said this week it had begun a single-city test of its CurrentC app but declined to say when it would be available nationwide. Samsung Electronics", "external_links": [], "published": "2015-08-14T02:30:00.000+03:00", "crawled": "2015-08-14T02:36:50.266+03:00", "highlightTitle": ""}