{"organizations": [], "uuid": "aee5a7e3069ba4fb44dc6636be13a5b69c83a3d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/21/markets-hongkong-china-stocks-midday-idUSL3N10W1SM20150821", "country": "US", "title": "China stocks slump on weak factory activity; Hong Kong also down", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "China stocks slump on weak factory activity; Hong Kong also down | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T09:06:00.000+03:00", "replies_count": 0, "uuid": "aee5a7e3069ba4fb44dc6636be13a5b69c83a3d8"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/21/markets-hongkong-china-stocks-midday-idUSL3N10W1SM20150821", "ord_in_thread": 0, "title": "China stocks slump on weak factory activity; Hong Kong also down", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* CSI300 -3.1 pct; SSE -3.0 pct; HSI -2.3 pct\n* China factory activity shrinks, adding to growth concerns\n* Investors make speculative bets as they lose direction-analyst\nSHANGHAI, Aug 21 (Reuters) - China stocks tumbled more than 3 percent on Friday morning, heading for their biggest weekly loss in nearly two months, as weak factory activity deepened concerns about the economy.\nA sharp economic slowdown comes at a time when investors are already fretting about a possible withdrawal of government support for the volatile stock market.\nStock index futures also fell sharply across the board, signalling that bears have the upper hand against bulls as they face a showdown in the afternoon when August contracts will be settled.\nThe CSI300 index of China's biggest listed companies fell 3.1 percent, to 3,646.45 points at the lunch break, while the Shanghai Composite Index lost 3.0 percent, to 3,552.82 points.\nBoth indexes are set to fall over 10 percent for the week, and not far from a low hit on July 9 during the height of the recent market rout, calling into question whether a series of government rescue measures will help keep prices stable.\nHong Kong stocks also fell sharply, following tumbles in China and global markets.\nThe Hang Seng index dropped 2.3 percent, to 22,230.06 points, while the Hong Kong China Enterprises Index lost 3.0 percent, to 10,094.77.\nInvestor sentiment was hit by a private survey showing activity in China's factory sector shrank at its fastest pace in almost 6-1/2 years in August as domestic and export demand dwindled.\nThere are also concerns of fresh capital outflows triggered by a sharply weaker yuan, after Beijing devalued the currency last week, but some analysts expect China to launch policies to ease liquidity and aid the economy.\n\"Today's weaker-than-expected PMI will add to mounting concerns over Chinese growth,\" economists at Capital Economics said in a report.\n\"Nonetheless, we continue to believe that sentiment is currently overly downbeat and that policy support will limit the downside risk to economic activity over the course of the next couple of quarters.\"\nInvestors dumped shares across the board, including companies with investments from government rescue funds, making their share price surges in the past two days short-lived.\nMoney into these stocks backed by the \"national team\" - institutions enlisted by the government to support the market - are speculative in nature, according to Gui Haoming, analyst at Shenwan Hongyuan Securities.\n\"Many market participants are totally at a loss, so they can only make speculative bets on such concepts,\" he said.\nTelecoms and infrastructure were among the weakest sectors, while banking outperformed the broader market.\nIn Hong Kong, most sectors fell, amid concerns that money was flowing out of emerging markets amid the region's currency turmoil and an anticipated U.S. interest rate hike. (Reporting by Samuel Shen and Pete Sweeney ; Editing by Jacqueline Wong)", "external_links": [], "published": "2015-08-21T09:06:00.000+03:00", "crawled": "2015-08-21T08:20:00.985+03:00", "highlightTitle": ""}