{"organizations": [], "uuid": "f1c829a6ecde634784ea359e43b2194f347889b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.finfacts.ie", "main_image": "", "site_section": "http://www.finfacts.ie/irelandbusinessnews/rss.xml", "section_title": "Finfacts Ireland Business & Finance Portal", "url": "http://www.finfacts.ie/irishfinancenews/article_1028956.shtml", "country": "GB", "title": "China's exports slide in July; Fx reserves dip $42.5bn in month", "performance_score": 0, "site": "finfacts.ie", "participants_count": 0, "title_full": "China's exports slide in July; Fx reserves dip $42.5bn in month", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T10:30:00.000+03:00", "replies_count": 0, "uuid": "f1c829a6ecde634784ea359e43b2194f347889b4"}, "author": "", "url": "http://www.finfacts.ie/irishfinancenews/article_1028956.shtml", "ord_in_thread": 0, "title": "China's exports slide in July; Fx reserves dip $42.5bn in month", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China's exports slide in July; Fx reserves dip $42.5bn in month   editor and founder of Finfacts Aug 10, 2015 - 7:30 AM   \nSingapore's Prime Minister Lee Hsien Loong (r) greets Chinese Vice President Li Yuanchao for the lunch held at Singapore's Istana, Aug. 9, 2015 for the various government representatives attending the National Day Parade on Sunday, celebrating the 50th anniversary of thh city state's independence. Photo: Xinhua/Ministry of Foreign Affairs Singapore \nChina's exports fell more than expected in July while foreign exchange reserves dipped by $42.5bn in the month. \nExports slid 8.3% in the month from a year earlier, following a rise of 2.8% in June, customs data released Saturday showed. Imports declined for the ninth month in a row, dropping 8.1% in July from a year earlier, after a drop of 6.1% in June. \nTrade with the EU, China's largest trade partner, slipped 7.6% year on year in the first seven months to 1.98tn yuan (US$320bn), with exports dropping by 4.4% to 1.22tn yuan and imports plunging by 12.4% to 757.32bn yuan. Trade with fifth-largest partner Japan fell 11.1% to 976.7bn yuan, with exports and imports both dropping by 11.1% to 471.06bn yuan and 505.64bn yuan respectively. However, trade with the United States and the Association of Southeast Asian Nations (ASEAN), China's second- and third-largest trade partners, managed to climb by 2.7% and 1.3% to reach 1.92tn yuan and 1.62tn yuan respectively, driven by increased exports to those countries. \nThe customs agency said that during the first seven months, China exported more electrical equipment and electronics while exporting fewer labour-intensive products such as clothing, textiles and shoes. \"Made-in-China products need to look for a new competitive edge in order to move up the value chain,\" said Zhang Yansheng, an economist with the National Development and Reform Commission, according to Xinhua, the official news agency. China's exports are expected improve as the EU shows signs of growth and US employment and consumption get better, Zhang said. Growth prospects for imports may remain bleak as commodity prices are likely to stay low on global markets in the third and fourth quarters, he added. \nThe Wall Street Journal says that adding to the problems for exporters is the relatively strong Chinese currency, which has held steady against a buoyant dollar. That has carried the yuan more than 10% higher against the euro, providing a drag on exports to some key European markets. \n“Pressure is intensifying on the central bank to let the currency depreciate but I don’t think they will give in to the pressure,” said Singapore-based ING economist Tim Condon. \nThe Journal said that the combination of weak exports and even weaker imports left the nation with a trade surplus of $43bn in July, down from $47bn in June. Weak imports have also reflected a steep fall in prices for key raw materials on global markets, in addition to the weak demand in China. But the newspaper says that in volume terms, there were encouraging signs for import demand ahead, as imports of copper and iron ore were up in the month and imports of soybeans and crude oil jumped sharply. Analysts said they saw more signs of hope as Beijing rolls out additional infrastructure projects to keep growth near the government’s target of a 7% expansion for the economy for the full year. \nMeanwhile, Xinhua reports that China's foreign exchange reserves slipped to a two-year low by the end of July, the People's Bank of China, the central bank, said on Friday, implying more capital outflows amid expectations of a fragile economic rebound and a stronger dollar. The nation's reserves dropped to US$3.65tn last month, down by $42.5bn from the level in June, the sharpest monthly decline since March, according to PBoC data. July's dip marks the third consecutive month that the forex reserves have fallen. They have dropped by $343bn from a historic high of $3.99tn June 2014. Despite the fall, China still has the largest foreign exchange reserves in the world. Worries about weak economic growth in the second half of the year have triggered capital outflows, said Zeng Gang, a researcher covering the banking industry at the Chinese Academy of Social Sciences. \"Market expectations of an appreciation in the US dollar have also fueled capital outflows,\" he said. Earlier data showed that in the second quarter, the country's foreign exchange reserves fell by $36.2bn, the fourth consecutive quarter of decline. \"It is a reasonable and acceptable adjustment so far, which will help reverse the long-term expansion of the large foreign exchange reserves, without any risks,\" said Zeng. \nRelated Articles", "external_links": [], "published": "2015-08-10T10:30:00.000+03:00", "crawled": "2015-08-10T11:20:58.668+03:00", "highlightTitle": ""}