{"organizations": [], "uuid": "e327efad7eae37a80182f38d4de2f17eb9132c48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8693762_G.jpg", "site_section": "http://www.cbs8.com/category/120652/money", "section_title": "Money: Personal Finance, Business, Small Business news features - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29918960/asian-stocks-fall-after-fed-suggests-sept-rate-hike-possible", "country": "US", "title": "Asian stocks fall after Fed suggests Sept rate hike possible - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Asian stocks fall after Fed suggests Sept rate hike possible - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "e327efad7eae37a80182f38d4de2f17eb9132c48"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29918960/asian-stocks-fall-after-fed-suggests-sept-rate-hike-possible", "ord_in_thread": 0, "title": "Asian stocks fall after Fed suggests Sept rate hike possible - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JOE McDONALD\nAP Business Writer BEIJING (AP) - Asian stocks fell Monday after a U.S. Federal Reserve official suggested a September interest rate hike still was possible and Japanese factory activity weakened.\nKEEPING SCORE: The Shanghai Composite Index fell 2 percent to 3,167.76 and Tokyo's Nikkei 225 shed 1.1 percent 18,920.90. Sydney's S&P/ASX 200 lost 0.9 percent to 5,213.50 and Hong Kong's Hang Seng retreated 0.3 percent to 21,539.59. Seoul's Kospi was off 0.3 percent at 1,931.49 and Singapore also fell. New Zealand advanced.\nFED PLANS: The Fed vice chairman, Stanley Fisher said there was a \"pretty strong case\" for raising rates in September. That ran counter to recent market sentiment that China's economic slowdown and global market volatility might prompt the Fed to wait. Speaking at the U.S. central bank's annual gathering in Jackson Hole, Wyoming, Fisher emphasized he was not saying what action the Fed might take at its September meeting but analysts took his comments to mean he saw the economy moving close to satisfying the Fed's conditions for a hike. It would be the Fed's first reverse from its policy in place since the 2008 crisis of ultra-low rates that have pushed up stock prices.\nANALYST'S TAKE: \"The Fed is still at the drawing board with regards to the specifics of the timing of a rate hike this year. But to be sure conviction for a hike this year was not watered down,\" said Mizuho Bank in a report. \"What's more, a rate hike sooner rather than later is preferred on forward-looking inflation.\"\nJAPAN WEAKNESS: Industrial production declined unexpectedly by 0.6 percent in July from the previous month, defying forecasts of a small increase following June's 1.1 percent rise. \"The drop in industrial production in July suggests that economic activity will recover only slowly this quarter,\" said analyst Marcel Thieliant of Capital Economics in a report.\nENERGY: Benchmark U.S. crude declined 63 cents to $44.59 per barrel in electronic trading on the New York Mercantile Exchange. The contract soared $2.66 the previous session to close at $45.22. Brent crude, used to price international oils, fell 87 cents to $49.18 per barrel in London after jumping $1.49 the previous day to $50.05.\nCURRENCIES: The dollar declined to 121.08 yen from 121.38 yen on Friday. The euro rose to $1.1237 from $1.1180.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-08-30T03:00:00.000+03:00", "crawled": "2015-08-31T07:08:19.205+03:00", "highlightTitle": ""}