{"organizations": ["Earth Minerals PLC"], "uuid": "12dc5670ea937ed8af8c9add0015520539787f89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/now-perfect-time-buy-rare-071917977.html", "country": "GB", "title": "Is Now The Perfect Time To Buy Rare Earth Minerals PLC, Hunting plc And Lamprell Plc?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is Now The Perfect Time To Buy Rare Earth Minerals PLC, Hunting plc And Lamprell Plc?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T10:19:00.000+03:00", "replies_count": 0, "uuid": "12dc5670ea937ed8af8c9add0015520539787f89"}, "author": "", "url": "https://uk.finance.yahoo.com/news/now-perfect-time-buy-rare-071917977.html", "ord_in_thread": 0, "title": "Is Now The Perfect Time To Buy Rare Earth Minerals PLC, Hunting plc And Lamprell Plc?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 08:45 BST - UK Markets close in 7 hrs 45 mins Is Now The Perfect Time To Buy Rare Earth Minerals PLC, Hunting plc And Lamprell Plc? By Peter Stephens | Fool.co.uk – 26 minutes ago 0.9155 -0.0095 \nFor many companies in the resources sector, 2015 is going to be something of a write-off. In other words, it is set to be one of the most challenging years in a very long time, with profits being hit, investor sentiment in decline and share prices having posted stunning losses. And, while there is likely to be more pain to come as companies in the oil and gas and mining sectors report their difficult years in the first quarter of 2016, there may also be a lot for investors to look forward to. \nIn fact, looking ahead to the forecast performance of resources stocks in 2016 highlights that the sector has considerable potential to deliver strong capital gains. And, with investors having the potential to change their views on the sector and begin to look ahead to improved financial performance from resources stocks, now could be a great time to gain exposure to oil and gas and mining companies. \nFor example, oil services company Hunting (LSE: HTG) is expected to post a fall in net profit of 75% in the current year. As a result, its share price has come under severe pressure in recent months and has fallen by 51% in the last year. However, investor sentiment could improve dramatically, since Hunting is expected to bounce back in 2016 with earnings growth of 58%. Certainly, this will not fully offset this year's decline, but it is something for the market to potentially reward. And, with Hunting trading on a price to earnings growth (PEG) ratio of just 0.3, it appears to offer superb growth potential at a very reasonable price. \nSimilarly, oil services sector peer Lamprell (LSE: LAM) is also due to have a tough year in 2015, with its earnings set to fall by as much as 42%. As with Hunting, its shares have fallen heavily in the last year, with them being down by 20%, and this means that they now trade on an exceptionally low price to earnings (P/E) ratio of just 11.1. This indicates that there is significant upward rerating potential on offer - especially since Lamprell is forecast to deliver an 8% rise in its bottom line next year. \nFurthermore, both Hunting and Lamprell offer excellent income prospects at the present time. They yield 3.5% and 2.1% respectively but, with strong profit and relatively low payout ratios of 62% and 30% respectively, shareholder payouts could rise at a rapid rate. \nMeanwhile, Rare Earth Minerals (LSE: REM) has also endured a tough twelve months, with its share price falling by 44% during the period. However, its news flow continues to be relatively positive, with the company this week confirming the grant of a mining lease Yangibana Main, in which Rare Earth Minerals has a 30% stake. This is good news for the company and represents one of the critical milestones for the project and, with Rare Earth Minerals still to complete its pre-feasibility study, its shares could start to reverse their disappointing performance of recent months. \nHowever, Rare Earth Minerals remains relatively high risk and, should news flow disappoint, its share price could come under pressure. So, while the potential within the lithium space is enticing, it may be best to pair the company up with more stable businesses due to the relatively high level of risk involved. \nOf course, there are a number of other stocks that could be worth buying right now and, with that in mind, the analysts at The Motley Fool have written a free and without obligation guide called 1 Top Small-Cap Stock From The Motley Fool. \nThe company in question may have flown under your investment radar until now, but could help you to build a great income from your investments and retire early, pay off the mortgage, or simply enjoy a more abundant lifestyle. \nClick here to find out all about it - it's completely free and comes without any obligation. \nPeter Stephens has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-21T10:19:00.000+03:00", "crawled": "2015-08-21T10:45:58.786+03:00", "highlightTitle": ""}