{"organizations": [], "uuid": "670ebe0262b66a01af6a974a428e2122072fa037", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508261208.html", "country": "US", "title": "Nigeria: With Slowing Growth, Oil Slump, Petrol Subsidy May Be Ready to Go", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: With Slowing Growth, Oil Slump, Petrol Subsidy May Be Ready to Go", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T14:58:00.000+03:00", "replies_count": 0, "uuid": "670ebe0262b66a01af6a974a428e2122072fa037"}, "author": "", "url": "http://allafrica.com/stories/201508261208.html", "ord_in_thread": 0, "title": "Nigeria: With Slowing Growth, Oil Slump, Petrol Subsidy May Be Ready to Go", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: Teenagers Bomb Damaturu, Kill Pregnant Woman, Themselves, Three Others \nThe price of Brent crude fell close to a six-year low of $42 on Monday, before rising to $43 a barrel yesterday, while the West Texas Intermediate (WTI) traded at $38.73 per barrel, up 1.2 per cent on the day, and off Monday's low of $37.75. \nBut yesterday's marginal recovery was considered temporary, as oil analysts have predicted that oil could fall to a 16-year low of $20 a barrel due to the over supply from the US and Middle East and the economic slowdown in China. \nBased on the computation undertaken by THISDAY using the average price of $527.25 per metric ton for petrol quoted by Platts yesterday and at the exchange rate of N197 to the dollar used by the Petroleum Products Pricing Regulatory Agency (PPRRA), the cost of petrol stood at N77.45 per litre, almost N10 below the official pump price of the product. \nThe price of petrol quoted by the PPPRA on Monday, which was the prevailing price used to pay marketers was $553.12 per metric ton or N81.26 per litre. \nThe agency also put its landing cost for petrol at N92.34 per litre and total cost at N107.83 per litre when marketers' distribution margins were added. \nHowever, market analysts believe that several of the costs inputted by PPPRA are unrealistic in a competitive market and would be eliminated under a deregulated price regime, as several importers of petroleum products will be eliminated, leaving only the major marketers with the economies of scale and therefore lower costs. \n\"Most of the charges on the PPPRA pricing template for petrol and kerosene only exist because it keeps inviting smaller marketers without the facilities and infrastructure to import products. \n\"But once the subsidy is removed, they will fall on the wayside and leave only the major marketers and the Nigerian National Petroleum Corporation (NNPC), which have the depots and distribution channels to convey fuel at lower costs to filling stations nationwide. \"So with crude oil prices this low, this is an opportune moment for the federal government to eliminate the subsidy element completely. \n\"This will go a long way in helping the government to reduce the current fiscal imbalance and free up funds for other projects, and at the same time reduce pressure on our foreign reserves as fuel imports alone account for more than 30 per cent of forex demand in the foreign market,\" explained one analyst, who preferred not to be named. \nBut even as market analysts pushed for the removal of subsidies, President Muhammadu Buhari yesterday blamed past administrations for the billions spent by the country on subsidies for petroleum products. \nThe president also said that it was unconstitutional for any revenue-generating agency to retain part of the revenues they make. A statement by the Senior Special Assistant to the President, Media and Publicity, Mr. Garba Shehu, said Buhari spoke at a meeting in Abuja with the Chairman and members of the Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC). \nBuhari expressed the view that the escalation of petroleum products subsidy payments in recent years was due to the deliberate neglect of the nation's refineries, oil pipelines and other related infrastructure to pave the way for the importation of petroleum products and for corruption to thrive. \nThe president, who restated his huge disappointment with the way Nigeria's oil industry had been run since he left office as petroleum minister and military head of state, said he was convinced that if the development of the country's domestic refining capacity and petroleum products distribution network had kept pace with national demand, there would not have been a need for the huge subsidies currently being paid to importers. \n\"They allowed the infrastructure to collapse so that their cronies can steal by bringing in refined products from overseas,\" Buhari said. The president urged the chairman and members of the RMAFC, who availed him of their view on petroleum subsidy payments, to go \"back to the drawing board\" and come up with more humane proposals to rescue ordinary Nigerians from the \"wicked manipulation\" of the country's oil industry by corrupt operators. \nBuhari also warned that severe sanctions would be visited on any individual or organisation that violated the directive on the payment of all national revenue into the Federation Account. \nThe president said NNPC, the Nigerian Ports Authority (NPA) and other MDAs, which previously relied on the laws establishing them to retain all or part of the revenues collected by them, did so illegally and must now comply with the Nigerian constitution by paying all revenues into the Federation Account. \nIn a related development, the Group Managing Director (GMD) of NNPC, Dr. Ibe Kachikwu, has acknowledged that the Petroleum Industry Bill (PIB), which has been pending before the National Assembly for the last eight years, requires extensive engagement with all stakeholders to iron out all grey areas. \nKachikwu, who yesterday chaired a special session on the proposed law at the ongoing 55th Annual General Conference of the Nigerian Bar Association (NBA) in Abuja, in his paper titled: \"Legal and Regulatory Framework of the Petroleum Industry in Nigeria: Review of Existing Laws and the Petroleum Industry Bill (PIB)\", described the bill as an essential legislation which must be approached with all the seriousness and the thoroughness it deserves. \nA statement from the NNPC spokesman Ohi Alegbe quoted Kachikwu as stating: \"PIB is a serious affair, it is an essential piece of legislation but as we all know a lot of engagement is required to address all the issues because the oil and gas environment has changed. \"There are issues of cost, with oil going down to $40 per barrel, the PIB cannot be the same.\" \nThe NNPC GMD explained that because of the volume of extensive consultation and time required to make the bill a workable document, it was only natural to kick-start the reforms in the industry with the existing laws while waiting for the eventual passage of the proposed law. \n\"The reform of the petroleum industry is key and it is an area where we are going to put a lot of focus. Transparency is key. Restructuring is key. \n\"Sometimes people don't realise that the problem hasn't been NNPC, it is a problem of political will to go forward and implement the outcome of researches and reports that had been done. But fortunately for us this time around, that is what the president has brought to the table. He has the strong political will to see this through,\" he said. \nCommenting on what the federal government intends to do with the draft legislation, Kachikwu stressed that the PIB had come to stay though it would take a bit of time to perfect the draft. \n\"The PIB is important, but we need to x-ray the issues. We need at least one year to get it back on track. The reality is that we cannot afford to wait any longer for change in the petroleum sector because of the delay in the passage of PIB. Things have got to start happening and that's exactly what we are doing,\" the GMD stated. \nEchoing Kachikwu's position, Mr. Peter Esele, a former President of the Trade Union Congress (TUC) who was also President of the Petroleum and Natural Gas Senior Staff Association of Nigeria (PENGASSAN), noted that though the PIB was key, the industry could make do with existing laws to activate essential reforms in the sector. \nWith the oil industry reforms taking centre stage yesterday, Reuters reported that Nigeria plans to export some 2.04 million barrels of crude oil per day (bpd) in October, the highest level this year, with planned shipment of 68 cargoes of 17 grades of crude oil, even as loading programmes for about two grades were yet to be released. \nThis is coming as the non-Gulf members of the Organisation of Petroleum Exporting Countries (OPEC) have called on the organisation to take action on the glut in the oil market. \nAlgeria has written to OPEC expressing concern about the slump in oil prices, and Iran said on Sunday an emergency OPEC meeting may be \"effective\" in stabilising prices. \nNigeria's export figure for October is above the less than two million barrels per day to be exported in September and is the highest volume since January when the country initially planned to export 2.03 million bpd, according to the provisional loading schedules obtained by Reuters. \nIt was not however clear if the international market will absorb these volumes of crude as European refinery maintenance typically peaks in October, thus limiting the amount of crude oil they refine. \nAccording to the provisional loading schedules, Nigeria will export one cargo of Abo grade (23,000 barrels per day); eight cargoes of Agbami (252,000 barrels per day); three cargoes of Amenam (92,000 bpd); seven cargoes of Bonga (215,00bpd); and seven cargoes of Bonny Light (221,000bpd). \nOthers include five cargoes of Brass River (133,000bpd); one cargo of EA (31,000bpd); one cargo of Ebok (21,000bpd); three cargoes of Erha 97,000bpd); six cargoes of Escravos (184,000bpd); six cargoes of Forcados (184,000bpd); one cargo of Okono (29,000bpd); and one cargo of Oyo (21,000bpd). \nAdditional loading schedules include 12 cargoes of Qua Iboe (368,000bpd); three cargoes of Usan (97,000bpd); two cargoes of Yoho (61,000bpd); and one cargo of Okwuibome (10,00bpd). \nHowever, the loading schedules for Antan, Okwori and Pennington were still pending, according to Reuters. Meanwhile, Algeria and Iran have called on OPEC to convene an emergency meeting to address the current glut in the oil market. The last extraordinary meeting to discuss a price slump in 2008 resulted in the OPEC's largest ever production cut, paving the way for prices to double within a year. \nBut the current calls for an unscheduled meeting to address spiralling prices were more a sign of growing friction within the group than a leading indicator of policy action, according to Reuters. \nAlthough OPEC's statutes say support from a simple majority of the 12 members can trigger an extraordinary meeting, none will occur without support from Saudi Arabia, which has yet to give its blessing, according to OPEC delegates. \nWith oil falling further, support is growing among non-Gulf members for action and even some Gulf officials are concerned about the latest drop in prices. But the top OPEC producer's policymakers have remained publicly silent. \nWithout the Saudis on board, even some OPEC members who are desperate to shore up prices, say an abrupt public gathering is not the way to go and might only make matters worse. \nExpectedly, low oil prices continued to take their toll on the Nigerian economy, as the country's growth slowed in the second quarter of this year to 2.35 per cent the National Bureau of Statistics (NBS) said yesterday. \nNigeria's gross domestic product (GDP) expanded by only 2.35 per cent on an annual basis, compared with 3.96 per cent a quarter earlier, the head of the NBS, Yemi Kale, said on his Twitter account. According to Bloomberg, Kale said the oil industry contracted 6.8 per cent. \nAt 2.35 per cent, this is the slowest growth recorded by the country in well over a decade. The oil-price slump has forced Nigeria, the top producer in Africa, to cut its budget and deplete foreign currency reserves to stem depreciation in the currency, which has declined 7.8 per cent against the dollar this year. \nThe Nigerian Stock Exchange (NSE) All Share Index also fell to the lowest in six months yesterday on concerns that oil prices near a six-year low will deepen the country's economic challenges. \nManufacturing contracted by 3.8 per cent during the quarter, compared with growth of 14 per cent a year ago, Kale said. Buhari, who took office in May in the country's first democratic transfer of power between parties, has yet to name a cabinet and hasn't articulated his economic vision for the nation. Nigeria \nTwo teenage suicide bombers yesterday morning detonated two bombs that left six persons dead, including a pregnant … see more » Copyright © 2015 This Day. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-26T14:58:00.000+03:00", "crawled": "2015-08-26T15:30:51.444+03:00", "highlightTitle": ""}