{"organizations": [], "uuid": "0e7a8d182a39cbfd593fe4e0e9e6b514704c226b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/sbi-chairman-arundhati-bhattacharya-inaugurates-new-corporate-office-of-sbicap-securities/127000", "country": "IE", "title": "SBI Chairman Arundhati Bhattacharya Inaugurates New Corporate Office of SBICAP Securities", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "SBI Chairman Arundhati Bhattacharya Inaugurates New Corporate Office of SBICAP Securities | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T17:45:00.000+03:00", "replies_count": 0, "uuid": "0e7a8d182a39cbfd593fe4e0e9e6b514704c226b"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/sbi-chairman-arundhati-bhattacharya-inaugurates-new-corporate-office-of-sbicap-securities/127000", "ord_in_thread": 0, "title": "SBI Chairman Arundhati Bhattacharya Inaugurates New Corporate Office of SBICAP Securities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Smt. Arundhati Bhattacharya, the Chairman of State Bank of India, inaugurated the new corporate office of SBICAP Securities Ltd (SSL) in Lower Parel, Mumbai. The function was also graced by the senior management of SBI, comprising of MDs, DMDs and CGMs. The new office, located on the 12 th Floor of Marathon Futurex, spans two wings, covering a magnanimous area of 30000 sq feet and has state-of-the-art facilities.\nSpeaking on the inauguration of SBICAP Securities; new office, which is the broking arm of the State Bank Group, SBI Chairman Smt. Arundhati Bhattacharya said, I am delighted to inaugurate the corporate office of SBICAP Securities with state-of-the-art facilities in Mumbai. Through a broad range of product offerings, servicing capabilities and its growing geographical reach, SBICAP Securities will be able to grow deeper relationship with existing customers and reach out to new ones. We look forward to provide a whole new world of convenience and flexibility to customers. I wish team SBICAP Securities success in their future endeavors.\nSSL seeks to become a leading financial intermediary, having a diversified customer base, broad range product offerings and state-of- the-art execution and servicing capabilities and believes that financial inclusion can be achieved in Capital markets through affordable institutionalized, professional set ups that bring transparency and reliability to the table. The company currently has wide segment of clients including Banks, Financial Institutions, FIIs, Mutual Funds, Corporates, HNIs, NRIs and Retail domestic investors. Its broking product range covers Institutional and Retail Equity, Derivatives, Depository Participant services, On-Line trading and a wide variety of Third Party Distribution products.\nSBICAP Securities has presence in 65 major cities with over 100 branches across the country. The company has increased its reach from 800 SBI branches to more than 2500 branchesin the last 3 years with 1250 sales staff actively catering to 125 cities. SBICAP Securities has been awarded Certificate of Appreciation;from the National Stock Exchange for being among the top performing member in 2014 (F14-F15) for New Client Acquisition. The company is amongst the most active partner in organising more than 40 Investor Awareness Programs; in association with CDSL NSDL.\nAbout SBICAP Securities Ltd (SSL):\nSBICAP Securities Ltd (SSL), a wholly owned subsidiary of SBI Capital Markets Ltd, commenced operations in the first quarter of financial year of 2006-2007, providing primary and secondary capital market access to investors both within the Group as also in the wider public domain. SSL seeks to become a leading financial intermediary, having a diversified customer base, broad range product offerings and State-of- the-Art execution and servicing capabilities and believes that financial inclusion can be achieved in Capital markets through affordable institutionalized, professional set ups that bring transparency and reliability to the table.\n 29, 2015 9:45 am", "external_links": [], "published": "2015-08-29T17:45:00.000+03:00", "crawled": "2015-08-31T03:26:26.554+03:00", "highlightTitle": ""}