{"organizations": ["Milacron Initiated"], "uuid": "2b5534a80820fffda02081b8344962c252fbb505", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.investors.com", "main_image": "http://www.investors.com/image/IT90-DDD-0805-company.jpg.cms", "site_section": "http://finance.yahoo.com/rss/headline?s=SSYS", "section_title": "Yahoo! Finance: SSYS News", "url": "http://news.investors.com/080515-765104-3d-systems-second-quarter-earnings-preview.htm?ven=yahoocp&src=aurlled&ven=yahoo", "country": "GB", "title": "3D Systems Earnings Coming During Market Turbulence", "performance_score": 0, "site": "investors.com", "participants_count": 0, "title_full": "3D Systems Earnings Coming During Market Turbulence", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T15:02:00.000+03:00", "replies_count": 0, "uuid": "2b5534a80820fffda02081b8344962c252fbb505"}, "author": "", "url": "http://news.investors.com/080515-765104-3d-systems-second-quarter-earnings-preview.htm?ven=yahoocp&src=aurlled&ven=yahoo", "ord_in_thread": 0, "title": "3D Systems Earnings Coming During Market Turbulence", "locations": ["TransUnion"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stratasys Upgraded; TransUnion, Milacron Initiated \nStratasys (NASDAQ:SSYS) was upgraded on Tuesday, a day after rival 3D Systems' (NYSE:DDD) price target was lowered. JPMorgan upgraded Stratasys to overweight. Last week, the 3-D printer maker gave light guidance. On Monday, Needham lowered 3D Systems' price target to 22 from 28. Stratasys shares ... 08/04/2015 04:28 PM ET Disney Price Target Raised, 3D Systems' Lowered \nEntertainment conglomerate Walt Disney (NYSE:DIS) and hard drive maker Seagate Tech (NASDAQ:STX) were among companies receiving price target upgrades Monday. Disney's price target was raised to 130 from 120 by RBC Capital Markets. Shares closed up 0.9% to 121.12 on the stock market today. RBC also ... 08/03/2015 04:42 PM ET Stratasys Gets Upgrade On Long-Term 3-D Printer Hope \nWith its stock trading at a 3.5-year low, 3-D printer maker Stratasys (NASDAQ:SSYS) received a rare upgrade Friday. Piper Jaffray analyst Troy Jensen upgraded Stratasys to overweight from neutral, though he also lowered his price target on Stratasys stock to 39 from 42. Stratasys stock was down ... 07/31/2015 03:17 PM ET Stratasys Warns, Pulls Guidance For 3D Printer Maker \nContinuing to show hard times in the 3D printer market, Stratasys (NASDAQ:SSYS) withdrew its full-year guidance after reporting second quarter earnings Thursday morning. Stratasys reported Q2 revenue of $182.3 million, up 2% from the same quarter a year ago. That was its slowest growth in years, ... 07/30/2015 12:25 PM ET Stratasys Earnings: 'Turnaround' For 3D Printer Maker? \nBeleaguered 3D printer maker Stratasys (NASDAQ:SSYS) is expected to report a sharp slowdown in sales with second-quarter earnings Thursday. The consensus estimate is for revenue of $182.3 million, up 2% from the same quarter a year ago but a sharp deceleration from a healthy string of double-digit ... 07/29/2015 08:02 AM ET Epam Systems Shows Q2's Challenge For Software Firms \nEpam Systems (NYSE:EPAM) stock slipped in late trading Tuesday after the provider of outsourced software engineering and other IT services beat second-quarter revenue expectations but edged earnings views as it again faced foreign currency headwinds. Epam gets more than half its business from ... 08/04/2015 08:25 PM ET Cerner Lowers Sales Forecast, Q2 EPS In Line \nCerner was right on target with Q2 earnings reported after the close Tuesday, but sales missed expectations, and the company lowered its guidance for full-year revenue. Cerner (NASDAQ:CERN) said that it expects 2015 revenue of $4.48 billion to $4.58 billion, down from its previous range of $4.65 ... 08/04/2015 06:55 PM ET SoftBank CEO Masayoshi Son Takes Center Stage At Sprint \nSoftBank CEO Masayoshi Son took center stage on Sprint's earnings conference call with analysts Tuesday, declaring he will not sell the struggling wireless firm and disclosing new off-balance-sheet financing plans aimed at keeping Sprint's turnaround on track. Sprint (NYSE:S)stock rose 4.5% Tuesday ... 08/04/2015 06:16 PM ET Paycom In Heaven As Cloud Strategy Pays Off In Q2 \nPaycom Software (NYSE:PAYC) raised its full-year sales outlook Tuesday after second-quarter earnings and revenue easily topped Wall Street targets amid the shift to cloud computing. The cloud-based developer of payroll and human resources software said adjusted Q2 earnings soared 150% to 10 cents ... 08/04/2015 06:12 PM ET Regeneron, Abiomed Hit New Highs On Strong Guidance \nShares of top-rated medical firms Regeneron Pharmaceuticals and Abiomed hit new highs in the stock market early Tuesday after both companies beat quarterly earnings estimates and raised guidance. Regeneron (NASDAQ:REGN) reported Q2 earnings of $2.89 a share excluding one-time items, up 17% from a ... 08/04/2015 06:00 PM ET", "external_links": [], "published": "2015-08-05T15:02:00.000+03:00", "crawled": "2015-08-05T16:50:48.168+03:00", "highlightTitle": ""}