{"organizations": ["Wal-Mart"], "uuid": "bafd1f90729018e425c14322127a32cb49414ead", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/backtoschool_600x400.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://www.thestreet.com/story/13268140/1/eyeing-a-bottom-in-wal-mart.html?puc=yahoo&cm_ven=YAHOO", "country": "GB", "title": "[video]Eyeing a Bottom in Wal-Mart", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "[video]Eyeing a Bottom in Wal-Mart", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T14:22:00.000+03:00", "replies_count": 0, "uuid": "bafd1f90729018e425c14322127a32cb49414ead"}, "author": "", "url": "http://www.thestreet.com/story/13268140/1/eyeing-a-bottom-in-wal-mart.html?puc=yahoo&cm_ven=YAHOO", "ord_in_thread": 0, "title": "[video]Eyeing a Bottom in Wal-Mart", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint \nNEW YORK ( TheStreet ) -- After six straight days of heavy distribution, shares of Wal-Mart ( WMT - Get Report ) may be finally washed out. Last Tuesday, the stock broke out of a 10-week bear flag with a very damaging downside gap. Wal-Mart closed that day at fresh 2015 lows with the help of a huge surge in volume. Since then the stock has continued to attract extremely heavy selling pressure. On Wednesday this week, trade levels remained well above average but, in a sharp change in trend, Wal-Mart was on the plus side for nearly the entire session. For Wal-Mart bulls, this is an encouraging sign and may indicate a significant bottom could be developing. At Monday's spike low, Wal-Mart had fallen over 14% from its Aug. 17 close. This nasty selloff has pushed the stock to the deepest oversold weekly moving average convergence/divergence reading since the 2009 bottom. The momentum that has driven the stock to this extreme is also noteworthy. Last week's downside volume was its heaviest since early 2012. This week that level will likely be surpassed. The bearish action over the last seven sessions looks very much like total capitulation by Wal-Mart investors. The sellers have pushed the stock all the way back down to its 2008 high of $63.85. Wal-Mart didn't move past this major high until the summer of 2012. By early January of this year, the stock had risen more than 40% above its 2008 peak. It's quite possible that Wal-Mart is beginning to build a significant base near this key level. Over the near term, Wal-Mart bulls should consider the $64-to-$62 area as a major support zone. If the stock can base in this area, while volume returns to more normal levels, a significant rebound could develop. A rally back up to the July low of $70.35 would be a logical target. A close below $60 would indicate that a great deal of downside pressure remains and an investable bottom has not been reached. This article is commentary by an independent contributor. At the time of publication, the author was long WMT. Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-08-27T14:22:00.000+03:00", "crawled": "2015-08-27T14:59:06.807+03:00", "highlightTitle": ""}