{"organizations": [], "uuid": "fb31011dcc7fc5ac7d3c206778fbb2fbdee82380", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/25/markets-global-idUSL5N1102GE20150825", "country": "US", "title": "GLOBAL MARKETS-Stocks, oil, dollar extend gains after China cuts rates", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "GLOBAL MARKETS-Stocks, oil, dollar extend gains after China cuts rates | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T15:49:00.000+03:00", "replies_count": 0, "uuid": "fb31011dcc7fc5ac7d3c206778fbb2fbdee82380"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/25/markets-global-idUSL5N1102GE20150825", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks, oil, dollar extend gains after China cuts rates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Tentative market rebound gathers pace\n* Driven by cut in Chinese base rates, reserve requirements\n* European shares up 4 percent, oil up 3 percent\n* Beijing acted after Chinese shares plunged again overnight\n* Policy response draws mixed reaction\nBy John Stonestreet and John Geddie\nLONDON, Aug 25 (Reuters) - Shares, oil and core bond yields extended gains in midsession European trade on Tuesday as a tentative market rebound picked up pace after China cut interest rates and banks' reserve requirements to kick-start its wavering economy.\nThe dollar motored ahead against most major currencies, rising 1.8 percent against the safe-haven yen and 0.8 percent against its currency basket as the stimulus boost to the world's second largest economy gave fresh impetus to a debate over when the Federal Reserve will raise interest rates.\nGlobal markets were pummelled on Monday, with Chinese shares falling 8 percent, prompting investor calls for remedial action from authorities that grew louder overnight after the Shanghai Composite Index slumped a further 8 percent.\nKallum Pickering, senior economist at Berenberg, said Tuesday's response sent a clear signal that Beijing, which has intervened several times this year to keep China's high-powered growth story on track, was still prepared to respond to market concerns.\n\"(This) has proved to markets that China is willing to act. Investors have been waiting for them to act and they have,\" he said.\n\"Is this sufficient? It might not be but it does set a precedent that they are engaged and looking to prevent any further declines.\"\nGerman Bund yields rose as the previous day's rush for safety reversed, with the 10-year benchmark up 11 basis points at 0.69 percent. Yields on safe-haven U.S. Treasuries also rose.\n'A BIT OF PANIC'?\nThe pan-European FTSEurofirst 300 index gained 4.2 percent, also supported by takeover news to recoup the bulk of the 5 percent-plus it lost the previous day, when around 450 billion euros ($520 billion) was wiped off the value of leading stocks.\nSwiss agricultural chemicals maker Syngenta bounced 9.0 percent after a source said Monsanto had sweetened a takeover bid, and British insurer RSA gained 4.7 percent after an offer from Zurich Insurance.\nWith China the world's biggest consumer of commodities, crude and metals markets also responded to Beijing's move.\nU.S. crude futures traded at $39.40 per barrel, up 3.1 percent on the day, while Brent rose 3.3 percent to $44.08. A 6 percent drop on Monday had sent the market to 6-1/2-year lows.\nCopper, often considered a proxy for global economic activity, rose 1.4 percent to $5,020 a tonne.\nIn China where recent market volatility has been at its most extreme, the central bank's policy move - coming on the heels of a shock devaluation of the yuan two weeks ago - drew a more guarded reaction.\n\"Frankly this shows a bit of panic in my mind,\" said Andrew Polk, resident economist at the Conference Board in Beijing.\n\"This is a big-bang move. It's meant to address some real issues and also prevailing market sentiment over the past two days.\" (Additional reporting by Lionel Laurent, Marc Jones and China Economics; writing by John Stonestreet editing; by Anna Willard)", "external_links": [], "published": "2015-08-25T15:49:00.000+03:00", "crawled": "2015-08-25T15:05:00.112+03:00", "highlightTitle": ""}