{"organizations": ["Audit Committee", "Mastec Inc.", "Inc", "MasTec"], "uuid": "cc4559d331ce78fac4e12481cefbc85220898147", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=MTZ", "section_title": "Yahoo! Finance: MTZ News", "url": "http://finance.yahoo.com/news/mastec-q2-earnings-line-estimates-140002618.html", "country": "US", "title": "MasTec Q2 Earnings in-Line with Estimates, Revenues Lag", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "MasTec Q2 Earnings in-Line with Estimates, Revenues Lag", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T17:00:00.000+03:00", "replies_count": 0, "uuid": "cc4559d331ce78fac4e12481cefbc85220898147"}, "author": "", "url": "http://finance.yahoo.com/news/mastec-q2-earnings-line-estimates-140002618.html", "ord_in_thread": 0, "title": "MasTec Q2 Earnings in-Line with Estimates, Revenues Lag", "locations": ["Canada", "Alberta"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Content preferences Done MasTec, Inc. MTZ reported-second quarter 2015 adjusted earnings (excluding one-time items barring non-cash stock compensation expense) of 8 cents per share, in line with the Zacks Consensus Estimate but a significant drop from 39 cents per share earned in the prior-year quarter. Earnings declined due to the adverse impact of rain and flooding across multiple segments as well as significant disruptions within the Electrical Transmission segment. Including one-time items, MasTec posted a loss of 5 cents per share as against year-ago quarter’s earnings of 39 cents. Second-quarter earnings include non-operating and non-core charges, composed primarily of the WesTower acquisition integration costs, Audit Committee investigation related costs and the nonrecurring impact of an income tax law change in Alberta, Canada. Mastec Inc. - Earnings Surprise | FindTheBest \nOperational Update MasTec’s net sales decreased 4% year on year to $1.07 billion in the quarter. Revenues also fell short of the Zacks Consensus Estimate of $1.02 billion. Revenues in the Oil and Gas segment increased 12% to $411 million and in the Power Generation and Industrial segment improved 9% to $103 million. Sales in Electrical Transmission decreased 33% year over year to $78 million and in the Communication segment it went down 11% to $469 million. Cost of sales in the quarter decreased 1% year over year to $946 million. Gross profit declined 23% to $121 million from $157 million in the year-ago quarter. Gross margin contracted 280 basis points to 11.3% in the quarter. General and administrative expenses increased 28% year over year to $69 million. Operating profit declined 88% to $8.2 million in the quarter from $65.5 million in the prior-year quarter. Consequently, operating margin contracted 510 basis points (bps) year over year to 0.8%. Adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) were $71 million as against $109 million in the prior-year quarter. Financial Details MasTec ended the second quarter with cash and cash equivalents of $4.8 million, down from $15.9 million at the end of the year-ago quarter. The company generated cash flow from operations of $166 million in the first half of 2015 compared to cash usage of $55.3 million in the prior-year comparable period. Long-term debt was $1.14 billion as of Jun 30, 2015 compared with $1.06 billion as of Dec 31, 2014. Guidance For 2015, MasTec expects adjusted earnings per share between 73 cents and 83 cents on the back of revenues of $4.2 billion to $4.3 billion. Adjusted EBITDA is projected in a range of $325 million to $340 million. For the third quarter of 2015, MasTec expects adjusted earnings per share between 31 cents to 37 cents, revenue of $1.1 billion to $1.2 billion and adjusted EBITDA between $100 million to $108 million.Coral Gables, FL-based MasTec is a leading infrastructure construction company that operates primarily in North America and caters to a range of industries. Its services include engineering, building, installation, maintenance and upgrade of energy, utility and communications infrastructure as well as industrial infrastructure.At present, MasTec has a Zacks Rank #5 (Strong Sell).Some better-ranked stocks in the construction sector are Dycom Industries Inc. DY, Chicago Bridge & Iron Company N.V. CBI and EMCOR Group Inc. EME. While Dycom sports a Zacks Rank #1 (Strong Buy), Chicago Bridge and EMCOR Group carry a Zacks Rank #2 (Buy).Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days . Click to get this free report >> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report", "external_links": [], "published": "2015-08-18T17:00:00.000+03:00", "crawled": "2015-08-18T19:42:48.604+03:00", "highlightTitle": ""}