{"organizations": [], "uuid": "a7033e1753123cbac19616e98be366c71898baf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/4/p/w/2/image.related.afrArticleLead.620x365.gj9a9d.png/1440667931520.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/industrial-relations/dyson-heydon-delays-bias-ruling-20150827-gj9a9d", "country": "AU", "title": "Dyson Heydon delays bias ruling", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Dyson Heydon delays bias ruling | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T16:19:00.000+03:00", "replies_count": 0, "uuid": "a7033e1753123cbac19616e98be366c71898baf6"}, "author": "afr.com", "url": "http://www.afr.com/news/policy/industrial-relations/dyson-heydon-delays-bias-ruling-20150827-gj9a9d", "ord_in_thread": 0, "title": "Dyson Heydon delays bias ruling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Unions urged Dyson Heydon to delay his ruling on disqualifying himself. Anna Kucera by Ewin Hannan Tim Binsted Royal commissioner Dyson Heydon won't decide whether to sack himself until next week, after agreeing to the eleventh-hour release to unions of new documents relating to his withdrawal from a Liberal Party and NSW Bar Association speech.\nJustice Heydon announced late on Thursday that he would delay his ruling, which was due on Friday, until at least Monday.\nHis decision came after ACTU secretary Dave Oliver called for him to defer his decision following new claims, unions suggesting his explanation for withdrawing from making the Sir Garfield Barwick address \"might be misleading\".\nAnnouncing the deferral, lawyers for the commission released correspondence between Chris Winslow, the publications manager for the NSW Bar Association and counsel assisting the commission, Jeremy Stoljar.\nBoral chief executive Mike Kane said the controversy over the former judge's now cancelled appearance at a Liberal Party event was a \"side issue\". Peter Braig ​Before the correspondence, former Australian Financial Review journalist and former Labor political adviser Marcus Priest had telephoned Mr Winslow and expressed surprise that Justice Heydon had agreed to make the speech given the connection to the Liberal Party.\nIn an August 12 email, Mr Winslow asked Mr Stoljar whether Justice Heydon was aware the address \"is a Liberal party fundraiser\". Mr Stoljar replied that he would \"raise it with\" Justice Heydon.\nMr Stoljar also released the diary notes on a conversation he had with Justice Heydon on August 13 in which Justice Heydon showed Mr Stoljar an August 12 email from the event organiser, Gregory Burton, saying it was not a fundraiser.\nThe diary notes reads: \"JDH: Burton is closer to the action than Winslow – he ought to know. So OK to go ahead if JDH writes clarifying and response OK.\"\nRelated Before the developments on Thursday night, it is understood the offices of Tony Abbott and Attorney-General George Brandis had held discussions about a potential replacement for Justice Heydon.\nMr Abbott said earlier on Thursday that he intended the commission would continue regardless of Justice Heydon's decision.\nLabor leader Bill Shorten said the new information raised questions such as \"Did Mr Stoljar tip off Mr Heydon?\".\nMr Oliver said unions were concerned the explanation contained in the commission's August 13 media release – that Justice Heydon had acted to withdraw from the event \"if it could possibly be described as a Liberal party event\" and before it attracted any media attention – might be misleading.\nMr Oliver said unions believed there has been inadequate disclosure by the commission of relevant documents.\nHe said Mr Stoljar had criticised the ACTU's application as \"grand-standing\" when in fact there were now allegations he knew events had not been disclosed to the ACTU or to the public.\nMeanwhile, Boral chief executive Mike Kane has urged the Labor Party and the union movement to act against the militant construction union.\nMr Kane said the controversy over the former judge's now cancelled appearance at a Liberal Party event was a \"side issue\".\n\"I think it is bizarre that is where the nation is focusing when we have rampant criminality,\" Mr Kane said. \"There is evidence of bribery, thuggery, and mismanagement of moneys. We have a crisis in the construction market that has been brewing for decades, and all this controversy about who might have given a speech where is a distraction.\"\nHe said the labour movement needed to \"clean its own house\" by acting against the Construction, Forestry, Mining and Energy Union.\n\"Right in the house of Labor you have a corrupt union that everyone is pretending is not there, especially the leader of the Labor Party,\" he said. \"The only ones fully capable of, [on] an expedient basis, dealing with this is the labour movement itself. Labor has a role to play. They have been completely absent. In fact they have obstreperous in attacking the royal commission.\"", "external_links": [], "published": "2015-08-27T16:19:00.000+03:00", "crawled": "2015-08-27T21:06:56.465+03:00", "highlightTitle": ""}