{"organizations": [], "uuid": "ee28132a2fcd2f95ca8075fb637aec52bdb21e15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/8/n/o/z/image.related.afrArticleLead.620x365.gj0vpm.png/1439805805809.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/how-to-deal-with-new-investor-loan-standards-20150817-gj0vpm", "country": "AU", "title": "How to deal with new investor loan standards", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How to deal with new investor loan standards | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T17:17:00.000+03:00", "replies_count": 0, "uuid": "ee28132a2fcd2f95ca8075fb637aec52bdb21e15"}, "author": "Kate Cowling", "url": "http://www.afr.com/personal-finance/how-to-deal-with-new-investor-loan-standards-20150817-gj0vpm", "ord_in_thread": 0, "title": "How to deal with new investor loan standards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Savers with above-average incomes are still taking measures to save money. Share on twitter by Kate Cowling Property investors can expect to hit a series of new loan hurdles, even if they've already scored approval, thanks to a crackdown by the chief banking regulator on investment lending standards.\nIn an effort to reduce risk in what's been described as an overheated market the country's biggest lenders have either changed their review processes or increased investor rates, or a combination of both, in part at the direction of the Australian Prudential Regulation Authority (APRA).\nAnd smaller lenders won't be immune, according to John Flavell, head of Mortgage Choice, who says it's only a matter of time before \"the system will balance itself out\".\nNavigating the maze will require borrowers to be across the changing landscape and to be able to spot the legitimate loopholes.\nGetting around LVR changes Loan to value ratios (LVRs) were among the first measures to be targeted, with Westpac, BankWest, St George and Heritage capping borrowings at 80 per cent of the value of a property.\nING Direct announced a maximum LVR of 80 per cent for NSW properties and 90 per cent for properties elsewhere, while ANZ and NAB set their maximum LVR at 90 per cent.\nOne strategy mortgage brokers use to get around LVRs is \"blending\" house and investment loans to bring the LVR down.\n \"Investors generally have an owner-occupier loan and they have equity in it, so they would use the equity in that home to reduce the LVR across both properties,\" says John Kolenda, managing director at 1300 Home Loans. \"So if you buy a property, you might even borrow 100 per cent [of the cost of the property], but you're using that security and the equity in your home to reduce the LVR.\"\nUsing parents' equity in parents' properties to secure loans is something else investors can do, Flavell says.\n\"We see instances of parents who are being asked to put their property on the line in the form of a guarantee increasing,\" he says.\n\"Imagine that mum and dad's property was worth a million and the investment was in the vicinity of $500,000, to get to the loan devaluation ratio cap you'd take a guarantee over $100,000 of equity in mum and dad's property to make the loan devaluation ratio on the investment property at 80 per cent.\"\nFlavell encourages buyers who go down this path to take measures to protect their parents' interests, like getting income protection insurance.\nShould you change lenders? The second round of tightening could be most crippling for investors, with a number of banks increasing investor rates by more than a quarter of a percentage point.\nFor instance, Commonwealth Bank and ANZ increased their rates for existing property investors by 0.27 percentage points, NAB lifted its rate by 0.29 percentage points, and AMP's went up 0.47 percentage points.\nMortgage brokers say the moves have facilitated a shift towards smaller lenders.\n\"The ones that have largely been forced to increase their rates have been the large ones and there are still some lenders who have not increased their rates for investors at all,\" Kolenda says, adding building societies and non-bank lenders are exempt from the APRA clampdown.\nBut Flavell believes the exemption will be short-term, with small lenders' regulator the Australian Securities and Investments Commission (ASIC) expected to catch up to the APRA and apply tighter standards.\n\"In the interim there's been a little bit of movement towards those enterprises but I imagine the system will balance itself out and I think the prudential regulator, in conjunction with ASIC, are working to that end,\" he says.\nProving you can pay back the loan A number of the banks have also changed the way they assess the likelihood you'll be able to pay back your loan.\nWestpac no longer takes negative gearing into account on investment loans and has reduced the proportion of annuity income from pensions it assesses towards the loans from 100 per cent to 80 per cent.\nIn similar form, CBA has removed the negative gearing benefit for investment loans above 90 per cent of the property's value, while capping the impact of certain income payments like overtime and bonuses at 80 per cent.\nNAB and St George have also told the market they are taking external debt into the equation.\nFlavell says there are few shortcuts when it comes to proving your ability to pay back your investment loan and recommends investors save more to compensate for changed criteria.", "external_links": ["https://twitter.com/kate_cowling"], "published": "2015-08-17T17:17:00.000+03:00", "crawled": "2015-08-17T19:59:56.883+03:00", "highlightTitle": ""}