{"organizations": [], "uuid": "638650a45e33878c35f602e889c12e4968ee76ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-construction-materials/?format=rss", "section_title": "Construction & Materials News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/life-insurers-upswing-philippines-long-040912039.html", "country": "GB", "title": "Life insurers on upswing in Philippines but long slog ahead", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Life insurers on upswing in Philippines but long slog ahead", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T07:09:00.000+03:00", "replies_count": 0, "uuid": "638650a45e33878c35f602e889c12e4968ee76ec"}, "author": "", "url": "https://uk.finance.yahoo.com/news/life-insurers-upswing-philippines-long-040912039.html", "ord_in_thread": 0, "title": "Life insurers on upswing in Philippines but long slog ahead", "locations": ["Philippines"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Aug 3, 2015, 09:18 BST - UK Markets close in 7 hrs 12 mins Life insurers on upswing in Philippines but long slog ahead Reuters - UK Focus – 4 hours ago -0.33 \nGRAPHIC: Insurance premiums: http://link.reuters.com/cyq35w \nBy Neil Jerome Morales MANILA, Aug 3 (Reuters) - The Philippine life insurance sector is predicting a record year for premiums, but poor financial literacy and the relatively high cost of insurance plans mean it would be a while before penetration rates catch up with the rest of the region. \nThe improving Philippine economy, one of the fastest in Southeast Asia, is giving ordinary Filipinos stronger incentive to save. Filipinos, particularly those working in business process outsourcing firms and families of overseas workers, are increasingly buying insurance policies thanks to more disposable income. The local insurance industry expects premiums to rise by more than a quarter to a record 200 billion pesos ($4.39 billion) this year from 2014, nearly triple the total five years ago. But that's coming from a very low base, and some long-term hurdles remain. \n\"For some, they don't have the means and some don't know how (to prepare financially),\" Rizalina Mantaring, president of the Philippine unit of Sun Life Financial Inc (Toronto: SLF-PC.TO - news ) , told Reuters. Formal financial institutions and insurance agents, two important intermediaries in an insurance sector, are also absent in many parts of the Philippines, she said. One-third of the country's 1,630 cities and municipalities remain uncovered by banks, central bank data shows. \nAlso, the cost of insurance is still beyond the reach of many Filipinos, prompting the industry to offer coverage for as low as 500 pesos a month, a shade above the 481 pesos minimum daily wage in the capital, Insurance Commissioner Emmanuel Dooc told Reuters. \nLife insurance penetration, measured in premiums-to-gross domestic product, is around 1.5 percent, below the benchmark 3 percent in Southeast Asia. That means the local units of Sun Life, AXA SA, AIA Group Ltd's Philam Life and Prudential Plc (HKSE: 2378.HK - news ) have room for growth. \"We are aiming to at least achieve the penetration rate of Southeast Asia within the next three to four years,\" Dooc said. (Editing by Ryan Woo)", "external_links": [], "published": "2015-08-03T07:09:00.000+03:00", "crawled": "2015-08-03T11:19:35.464+03:00", "highlightTitle": ""}