{"organizations": [], "uuid": "7b5c056c881d299c76a37fc41057c9f0c370086f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/u/a/z/s/image.related.afrArticleLead.620x365.gj4a3p.png/1440144199232.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/world/asia/the-growth-has-only-just-started-in-china-says-treasury-wine-estates-20150820-gj4a3p", "country": "AU", "title": "The growth has only just started in China says Treasury Wine Estates", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The growth has only just started in China says Treasury Wine Estates | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T22:15:00.000+03:00", "replies_count": 0, "uuid": "7b5c056c881d299c76a37fc41057c9f0c370086f"}, "author": "Angus Grigg", "url": "http://www.afr.com/news/world/asia/the-growth-has-only-just-started-in-china-says-treasury-wine-estates-20150820-gj4a3p", "ord_in_thread": 0, "title": "The growth has only just started in China says Treasury Wine Estates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Treasury Wine Estates MD for Asia Robert Foye in Shanghai, believes there are plenty of opportunities for growth. Olivia Martin-McGuire by Angus Grigg Six months ago Treasury Wine Estates (TWE) had barely made a sale into Chinese supermarket chain, Yonghui.\nNow the maker of Penfold's, Wolf Blass and Wynns counts the Fuzhou-based retailer as its largest single customer on the mainland.\nSuch examples made China the stand-out performer in TWE's full year results on Wednesday, as volumes in Greater China rose 36 per cent and profits across the region were up 52 per cent.\nBut TWE's President for Asia, Robert Foye, insists this is not a one-off performance.\n\"The growth has only just started in China. We are at the very beginning,\" says Foye during an interview with The Australian Financial Review in Shanghai.\nThe 49-year-old Texan, who has spent most of his career in and around Asia with Coca-Cola, sites the story of Yonghui to emphasis the growth opportunities.\n\"They [Yonghui] would be our biggest customer [in China] but we account for just 1 per cent of their wine category,\" he says.\n\"There's no reason why we should not be 10 per cent to 20 per cent. And there's no reason why they can't increase their wine sales by 50 per cent.\"\n It is this potential growth that led TWE chief executive Mike Clarke to say Asia would be the largest contributor to the wine maker's profits within 18 months.\nTo achieve this, TWE's earnings out of the region will need to continue growing above 30 per cent to see it surpass Australia and North America.\nFoye says such growth will happen by aggressively targeting Chinese supermarkets, convenience stores and online retailers, in what is a highly fragmented mainland market.\nYonghui with its 450 outlets still accounts for less than 2 per cent of all supermarkets and hypermarkets across China.\nBig chain opportunities That means TWE has not even made basic introductions to other big chains like Bubugao, which has over 450 stores mainly in the central and southern provinces.\n\"We are very keen to build our brand out there [regional China], while everyone else is still fighting it out in the east,\" says Foye.\nTWE is focusing on hypermarkets across China as these are the big drivers of volume while also showing good growth – the sector is forecast to grow at nearly 40 per cent between 2013 and 2016, according to researcher Euromonitor International.\nLower volumes but higher growth can be found in convenience stores, which are emerging as small-scale bottle shops across China.\nThey are showing annual sales growth of about 25 per cent, while online sales are growing at double this pace.\nTWE's renewed success in China comes at a time when the likes of Coke and Unilever are reporting single-digit growth in China, while beverage group Diageo saw its full year sales fall 2 per cent across the Asia-Pacific.\nThe macro trends in TWE's favour include China's overall retail sales rising at an annual rate of 10.5 per cent and imported wine stealing market share from local brands.\nSales of Chinese-made wine are expected to decline by about 6 per cent this year, while imported labels are forecast to grow by the same amount annually through to 2019.\nThis follows a difficult 2013 and 2014 for foreign winemakers in China after the central government cracked down hard on official banquets and gift giving, a category that was the dominate sales channel for many beverage companies.\nThis saw Australian wine imports to China decline 8 per cent in 2013, before returning to growth last year, according to Wine Australia the country's peak marketing body.\nIn response to the new sales environment in China, TWE took back sales and marketing from its long-time distributor in October 2014, under a strategy championed by Foye.\nThis has seen a 150 per cent increase in marketing budgets across Asia, the roll-out of China specific packaging for gift boxes and the ramping up of promotions.\nThis newly aggressive approach to capturing market share will see TWE shortly begin giving away gold bars worth ¥6000 yuan ($1277) to Chinese customers who spend ¥23,000 yuan on Penfold's products.", "external_links": [], "published": "2015-08-21T22:15:00.000+03:00", "crawled": "2015-08-21T21:59:13.929+03:00", "highlightTitle": ""}