{"organizations": [], "uuid": "5456a9ed077719c5a8b7521e559217c4d57b42b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/ikkfXlCpAmWw/v2/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-05/rajan-presses-modi-on-india-reforms-rebuts-sniping-on-inflation", "country": "US", "title": "Rajan Presses Modi on India Reform, Rebuts Inflation Sniping", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Rajan Presses Modi on India Reform, Rebuts Inflation Sniping - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T15:30:00.000+03:00", "replies_count": 0, "uuid": "5456a9ed077719c5a8b7521e559217c4d57b42b2"}, "author": "Sandrine Rastello", "url": "http://www.bloomberg.com/news/articles/2015-08-05/rajan-presses-modi-on-india-reforms-rebuts-sniping-on-inflation", "ord_in_thread": 0, "title": "Rajan Presses Modi on India Reform, Rebuts Inflation Sniping", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "India central bank Governor Raghuram Rajan, under pressure from government officials to ease up on inflation concerns, turned the focus back to fiscal and regulatory reforms that the Modi administration has struggled to put in place.\nProgress on stalled legislation -- including a national sales tax and land bill -- would help further “immunize” India just weeks before a potential increase in U.S. interest rates that may trigger capital flows out of emerging markets, Rajan said. He also defended his focus on inflation , saying he was looking to meet a target given to him by the government.\n“It would help if we could get more clarity on some of the reform measures that are taking place because that would send a strong signal to the outside,” Rajan told Bloomberg TV India in Mumbai on Wednesday. “This would send a strong message to the outside that India is still on the move, which is very important in times of turbulence, to send a signal that we are a safe haven,” he said.\nRajan, who on Tuesday left interest rates unchanged after three cuts this year, said India cannot be complacent at a time when worries about global growth have shifted to emerging markets including China and Brazil. Progress on the pace of reforms would help reinforce the buffers the country has built up in narrowing its current-account and budget deficit while building foreign-exchange reserves, he said.\nEconomists have long said that an overhaul of antiquated and byzantine land, labor and tax laws are essential to spur India’s growth. Optimism that Prime Minister Narendra Modi could push through reforms prompted the benchmark stock index to surge the most in five years when he swept to power in 2014.\nInflation Target That’s faded now as bills have gotten tied up in parliament. The S&P BSE Sensex index has gained about 3 percent this year, compared with 30 percent in 2014.\n“We know that those reforms haven’t been delivered yet and they’re looking unlikely to be delivered some time this year,” Faraz Syed, an economist at Moody’s Analytics in Sydney, said by phone. “Our best hope could be sometime early next year.”\nIn one of its biggest reforms so far, Modi’s government agreed earlier this year to an inflation target of 2-6 percent. Still, signs of discord have emerged in recent weeks.\nThe Finance Ministry last month released a draft bill that would give the administration control over a rate-setting panel, putting it at odds with a central bank recommendation. In addition, on the eve of Rajan’s latest rate decision, a government official told reporters in New Delhi that inflation can’t be the main concern for policy makers.\n“What else do you want me to look at?” Rajan said on Wednesday with a chuckle. “If you gave me an inflation target, what do you want me to look at?”\nEven so, Rajan downplayed differences with Modi’s administration over the proposed monetary policy committee, echoing comments he made on Tuesday.\n“As far as the broad understanding goes I think we are in a good place,” he said while declining to give details.", "external_links": [], "published": "2015-08-05T15:30:00.000+03:00", "crawled": "2015-08-05T13:00:55.669+03:00", "highlightTitle": ""}