{"organizations": [], "uuid": "23f95e0f40d28de6fe9e357ee9535b821e2c9025", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/lifestyle/health/research-must-to-address-menstruation-related-issues-among-school-girls/112338", "country": "IE", "title": "‘Research must to address menstruation-related issues among school girls’", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "‘Research must to address menstruation-related issues among school girls’ | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T17:15:00.000+03:00", "replies_count": 0, "uuid": "23f95e0f40d28de6fe9e357ee9535b821e2c9025"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/health/research-must-to-address-menstruation-related-issues-among-school-girls/112338", "ord_in_thread": 0, "title": "‘Research must to address menstruation-related issues among school girls’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A global health NGO has suggested more rigorous research to address menstruation-related issues among school-going girls including hearing their voices and discussing about their needs, claiming that a majority of girls skip school when they have their periods.\n“The relationship between menstruation and girls’ attendance in schools is a critically important research issue. We have seen that poor sanitation systems and lack of information on proper disposal, along with inadequate hand- washing and waste disposal bins are barriers to limit a girl’s ability to manage menstruation in school in India,” senior program officer of PATH (Devices and Tools) Nancy Muller told PTI.\n“At a global level, studies linking use of effective menstrual care products and girls’ school attendance have generated varied results. Scale and quality of research have been significant constraints,” she said, stressing that voices of girls should be included while designing these systems.\n“In designing these systems, it is important to include the voices of the girls and their particular needs. The challenges is what drives addressing and assuring good menstrual hygiene management for school,” she added.\n“In some parts of India girls are forbidden to touch food or sleep in the house when they’re menstruating. Lack of sanitation facilities can put girls at risk when needing to manage menstruation in the open. As a result, girls miss out on a host of opportunities, limiting their participation in their own development and that of their communities too,” Muller said.\nHailing Uttar Pradesh government’s recent decision to distribute free sanitary napkins to all girls in state-run schools, she said that the “move” could be an exciting model for other states of India as well as other countries.\n“The move is certainly highly commendable. It gives a truly important message about the importance of educating girls, and can be seen as an exciting model for other states in India and elsewhere.\n“However, for the same procuring large quantities of menstrual hygiene products for low-income girls and women and identifying selection criteria is also important, both to ensure the proper usage of the product and to maximise government investments,” she said.\n“It will be useful to evaluate the results of Uttar Pradesh’s policy initiative, to see where it is working well or not and to look for ways to ensure that the policy is sustainable in the long term,” Muller said.\nBesides, information on effective and ineffective distribution channels and methods (i.e. how products are reaching schoolgirls through pubic-and private-sector channels) will maximise government investments, she added.\nThe PATH official further cited a study by UNICEF in Uttar Pradesh which revealed that many adolescent girls skip school during menstruation due to lack of appropriate sanitation facilities in schools.\n“Women have to manage menstruation-related hygiene in fields and open spaces, which exposes women, especially young girls, to physical and psychological problems and sexual harassment. Anecdotal evidence suggests girls limit their food and water intake during the menstrual period in order to minimise their visits for urination and defecation,” she said.\nThe lack of understanding about menstruation and lack of access to menstrual care products could affect the girls’ confidence and mobility which would indeed impact the family as well as the society more generally, Muller said.\nDescribing menstruation as a problem of product availability, she said that it has much wider roots which could only be dealt with effectively if all aspects of the issue are taken into consideration.\n“Lack of disposable products is one issue while availability of hygienic and environmentally products is still a big gap. This gap is exacerbated when the problem is looked at from a lens of low-income communities.\n“Additionally, affordability is also a gap that limits access to hygienic menstrual management methods and it can be addressed by not just making disposable products affordable but also coming up with low cost reusable solutions to limit cost over time,” she stated.\nAsked what could be a solution to menstruation-related problems in India, she said, “Awareness generation needs to take a multi-pronged approach by targeting not just women but men, elders, community leaders including religious leaders in conversations about menstruation. It’s to deal not just with information on hygiene management but also to address how traditions around menstruation limit gender equity in communities.\n“Hence, it is essential to look at menstruation comprehensively ensuring the ongoing school participation for adolescent girls and overall gender equity in families and communities,” Muller advised.\nFirst Published on August 02, 2015 9:15 am", "external_links": [], "published": "2015-08-02T17:15:00.000+03:00", "crawled": "2015-08-03T08:21:25.834+03:00", "highlightTitle": ""}