{"organizations": [], "uuid": "96b0c8d01c4b47d4c8d94056a41796af10aa1723", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/g/w/l/0/f/image.related.afrArticleLead.620x365.gizze4.png/1439753938311.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/street-talk/macquarie-to-field-offers-for-17b-healthscope-stake-20150815-gizze4", "country": "AU", "title": "Macquarie to field offers for $1.7b Healthscope stake", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Macquarie to field offers for $1.7b Healthscope stake | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T22:15:00.000+03:00", "replies_count": 0, "uuid": "96b0c8d01c4b47d4c8d94056a41796af10aa1723"}, "author": "$2b sticking point as Apple wrangles with Aussie banks", "url": "http://www.afr.com/street-talk/macquarie-to-field-offers-for-17b-healthscope-stake-20150815-gizze4", "ord_in_thread": 0, "title": "Macquarie to field offers for $1.7b Healthscope stake", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Healthscope chief executive Robert Cooke led the company through its successful float. Patrick Scala by Sarah Thompson Anthony Macdonald Jake Mitchell Private equity giants TPG and The Carlyle Group have appointed Macquarie Capital to field offers for their $1.7 billion stake in private hospital operator Healthscope.\nThe stake is the biggest potential block trade to be released from escrow this reporting season.\nBut Street Talk can reveal TPG and Carlyle appointed Macquarie after receiving approaches from up to four trade buyers interested in the holding.\nIt will be interesting to see how the trade buyers measure up against institutional demand, after a 6 per cent drop in the benchmark S&P/ASX 200 over the last two weeks.\nTPG and Carlyle retained a 38 per cent holding in Healthscope after its $3.6 billion initial public offering last year and the stake is to be released from escrow when the company reports its full-year result on August 25.\nThe company's shares are trading around 25 per cent above their $2.10 IPO price.\nAn exit would mark the end of TPG and Carlyle's five-year association with Healthscope, after they paid an enterprise value of $2.7 billion for the company in 2010.\nMacquarie advised on the acquisition and was a joint global co-ordinator on the Healthscope float.\n The silver donut was also there for TPG's $880 million purchase of poultry producer Ingham Enterprises in 2013, which is widely seen as one of the best deals of the last ten years.\nThe Healthscope mandate sees Macquarie grab a leg up on its rivals this reporting season, as the market prepares for a flurry of block trades.\nOther companies with large parcels of stock to come out of escrow this reporting season include Regis Health Care, Eclipx, Estia Health, Japara Healthcare, Mantra, oOh!Media and Monash IVF.\nThe Paul Ramsay Foundation's $4.1 billion stake in Ramsay Health Care has also been a focus for deal-hungry bankers.", "external_links": [], "published": "2015-08-16T22:15:00.000+03:00", "crawled": "2015-08-17T00:06:52.419+03:00", "highlightTitle": ""}