{"organizations": [], "uuid": "ec92cdcc5ff0fe8a6f9cdbb62c9f422d4a75f01f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/u/w/7/9/image.related.afrArticleLead.620x365.giuvar.png/1439148645615.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/market-wrap/antipodes-jacob-mitchell-is-not-afraid-of-china-20150809-giuvar", "country": "AU", "title": "Antipodes' Jacob Mitchell is not afraid of China", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Antipodes' Jacob Mitchell is not afraid of China | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T13:14:00.000+03:00", "replies_count": 0, "uuid": "ec92cdcc5ff0fe8a6f9cdbb62c9f422d4a75f01f"}, "author": "$A whipsawed by hot-and-cold jobs report", "url": "http://www.afr.com/brand/market-wrap/antipodes-jacob-mitchell-is-not-afraid-of-china-20150809-giuvar", "ord_in_thread": 0, "title": "Antipodes' Jacob Mitchell is not afraid of China", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jacob Mitchell who has set up boutique fund manager Antipodes Partners. Brendon Thorne by Vesna Poljak Philip Baker As growth in China slows and its sharemarket reverses spectacular gains , the herd instinct is to sell and look away.\nNot so for Jacob Mitchell, who after 14 years at Platinum Asset Management has set up global boutique fund manager Antipodes Partners.\n\"China today in my mind is reminiscent of Japan's big multi-decade unwind. You could get yourself all caught up in how bad things are,\" says Mitchell, who has followed Asia's market cycles closely.\n\"While you've been debating the macro, lo and behold, Canon, Toyota – the classic blue chip Japanese stocks -– just made you a lot of money. [In] China, I'd be less hung up about the bigger picture and just thinking about how are stocks being priced.\"\nOne of Antipodes' early plays is the brewer China Resources Enterprise which controls about 21 per cent of China's beer market through the Snow beer brand. Or as Mitchell explains, it is the world's largest beer brand by volume which nobody has ever heard of. And it's not a mining company.\n\"It's an interesting example, I think, of what's happening in China where the government is clearly conscious that the economy needs to transition away from infrastructure intensive growth,\" he says.\nOne area where the government still has a lot of leverage is in shaping the behaviour of state-owned enterprises by resetting their targets away from growth for growth's sake and towards profitability and return on capital.\nChina Resources Enterprise has transformed itself into a pure-play brewer and has conveyed its intent to become more premium in its offering.\n \"The average beer price in their business is 35¢ a litre. The equivalent price in the US is $1.20 and per capita consumption is about 60 per cent what it is in the US,\" says Mitchell.\n\"The consensus is something is horribly wrong, their EBITDA margins are low relative to global peers. Our response is there's a good reason for that, they've been focused on growth rather than profits.\"\nThe fund manager is backing the company to lift prices and its partnership with SABMiller means it is well placed to introduce some imported brands into the Chinese market.\nAnd yet its enterprise value is only $US7 billion.\n\"You think about that in the context of China, you can buy 21 per cent of the Chinese beer market for seven billion dollars US.\"\nBlind to the boom The potential pay-off for investors reminds Mitchell of when he was investing in the Indian market back at Platinum and nobody in the wider market could see the boom coming.\n\"In India when I started there, there was absolutely no interest in investing in domestic facing businesses because the domestic economy wasn't particularly interesting, no one had discovered the BRICs story. The 'I' in BRIC wasn't particularly well understood.\"\nMitchell got his break in funds management after responding to an advertisement for a financial analyst, found in the general classifieds, at insurer Tyndall.\nGrowing up in Penrith, in Sydney's west, he was inspired by the story of his grandfather who came to Australia from England as a teenager as one of the Dreadnought Boys, a program which offered training for child and youth migrants.\n\"It's an immigrant story, and as I observed him through his whole entire life, he was very independent in his thinking,\" recalls Mitchell.\n\"For me, it was about what he did next, which was by the time he was in his twenties he owned a lot of property. He worked super hard in the country doing manual labour. He was surrounded by people who were obsessed by farming, and he took this view that the way to get ahead was to become the merchant.\"\nAlmost as influential in Mitchell's thinking was the reformist 1980s.\n\"It was the era of Hawke and Keating, on the one hand you had all this economic reform and I had this inspirational economics teacher, and I was interested in what was going on in that sense. You could see there was this energy to change the way Australia integrated with the rest of the world.\n\"The reforms that were put in place in the 80s really underwrote the transformation of the economy in the 90s.\"\nAfter Tyndall, he went to UBS where he followed small caps. But from day one, he was interested in global investing and eventually an opportunity opened up at Platinum, the fund manager founded by Kerr Neilson.\n\"When I joined I think it had two billion under management, there was a real edge to the place, it was a small team and you couldn't hide anywhere. I thought I'd learnt a lot but clearly there was a lot more to be learned,\" says Mitchell. By the time he left Platinum he was the deputy chief investment officer.\nHe had also served as manager for the Platinum Unhedged Fund for seven years, outperforming the benchmark index by 5.7 per cent a year after fees; and managed the Japan Fund for just under seven years, where he returned 9.9 per cent a year above the index after fees.\nHe remembers one trip to Japan which genuinely tested his resolve; it was after the financial crisis and the high Japanese yen was decimating the industrial heartland. \"You get off the Shinkansen [bullet train] and go out to catch a taxi, the taxi queue would be kilometres long. To me that summed up Japan, Japan was just grinding to a halt… I remember meeting with Sharp investor relations, I didn't even get to ask a question they just simply said 'why are you here?'\n\"It's difficult to invest because you're really up against it. Yes there's great value, but you just have to be patient.\"\nAntipodes' view is that it is rare to be able to buy a great business at a good price and when it does happen it is usually because of the impact of change.\n\"It pays off in markets to not be contrarian for the sake of being an arse.\n\"But just consider the fact that whether it's just a traditional recovery cycle, which often happens in domestic sectors like banking and property, right through to structural change where a business can be on a certain trajectory and then for a confluence of reasons all of a sudden just goes exponential.\"\nAntipodes has nine people on the investment team, two of which are dedicated to Asia, $220 million under management. and Pinnacle owns a minority stake. Its strategies are global long only, global long-short and Asia long-short.\nAnother investment the fund has gone long early in is Microsoft.\n\"We think of it as just a great transformation story where the market has been slow to understand how positive the cloud is,\" Mitchell explains.\n\"[Microsoft is] becoming more and more staple-like but the market doesn't give it that credit. In the last five years Microsoft has grown at 8.5 per cent top line… their enterprise business has been flourishing. The market is paying 24 times [earnings] for Colgate and I suspect not only is emerging markets going to be a drag but also in developed markets we're seeing this real change in the dynamic where the disruptive player is now the hard discounter.\"\nHe sees big brands in Western markets as quite expensive because they are being priced as bond proxies. \"And many of them are heavily exposed to emerging markets, for Colgate that's half their business. Colgate's been struggling to grow with emerging market tailwinds let alone the fact that they're now headwinds.\"\nThe so-called SEEK of Asia, Zhaopin, is another addition to the portfolio – \"to me it just looks incredibly cheap for what it is\".", "external_links": [], "published": "2015-08-09T13:14:00.000+03:00", "crawled": "2015-08-10T05:11:55.264+03:00", "highlightTitle": ""}