{"organizations": [], "uuid": "c641993dfa9476349ea424e53afdef7f8ea56f07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/4/i/y/5/image.related.afrArticleLead.620x365.gj67be.png/1441002638340.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/equities-bias-puts-smsfs-on-the-edge-20150824-gj67be", "country": "AU", "title": "Equities bias puts SMSFs on the edge", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Equities bias puts SMSFs on the edge | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T10:01:00.000+03:00", "replies_count": 0, "uuid": "c641993dfa9476349ea424e53afdef7f8ea56f07"}, "author": "Jeremy Chunn", "url": "http://www.afr.com/personal-finance/superannuation-and-smsfs/equities-bias-puts-smsfs-on-the-edge-20150824-gj67be", "ord_in_thread": 0, "title": "Equities bias puts SMSFs on the edge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Self-managed superannuation funds look as though they're taking a lot of risk to get lower returns, according to Vanguard Australia. Mark Rogers by Jeremy Chunn Trustees of self-managed superannuation funds crave control but lack refinement. As a result, their life savings are vulnerable.\nStacked high with direct shares, the average SMSF portfolio is more risky than a high-growth investment fund but manages returns below levels of a fund following a conservative strategy, according to modelling by Vanguard Australia.\nBased on research from Investment Trends which showed 41 per cent of do-it-yourself super money is allocated to Australian shares, Vanguard simulated 1000 scenarios for a typical SMSF portfolio (including S&P/ASX 300, S&P/ASX 20 and high-yield stocks), and compared the results with the past performance of its own diversified funds.\nThe result will make DIY super fund trustees nervous. If they understand risk, they'll see that their retirement savings are as likely to suffer heavy losses as they are to make significant gains.\nSelf-managed super fund trustees are taking on more risk than they realise. \"The average portfolio landed where you don't want to be,\" says Robin Bowerman, Vanguard's principal of market strategy and communications. \"You're right up the risk scale but lower on the forecast return scale.\"\nBowerman says criticism is often directed at SMSF portfolios regarding asset allocations that are wildly at odds with institutional super funds, particularly the absence of fixed income and international assets.\n\"One thing we know for sure about SMSFs is that they are very heavily invested in banks and large-cap miners,\" he says. \"We also know they are very hungry for yield.\"\nSMSF trustees typically describe themselves as following conservative or balanced investment strategies, he says, but the simulation exercise shows they are far from it.\n \"If people understand the risk they're taking in a portfolio, that's fine. But there would appear to be a significant level of people not being cognisant of the risk they're taking when they've got a concentrated equity portfolio and a large exposure to cash.\"\nHigh cash levels partially offset losses to share portfolios throughout the financial crisis, but SMSFs' paltry allocation to international sharemarkets will have seen them miss out from gains in US equities over the past three years.\n\"It's the lack of diversification that's probably the issue here,\" Bowerman reckons.\nRisk is defined as the standard deviation of returns, and the higher the risk the wider the range of expected returns. A well-diversified portfolio will include \"uncorrelated\" assets, which are not inclined to move in unison. Variance of returns in a portfolio is minimised when investments are uncorrelated. The pay-off to lower risk is lower returns.\nBut SMSFs look as though they're taking a lot of risk to get lower returns anyway.\nIf they have a long time to go to drawdown phase, it might work out for them. If not, look out.", "external_links": [], "published": "2015-08-31T10:01:00.000+03:00", "crawled": "2015-08-31T15:03:17.167+03:00", "highlightTitle": ""}