{"organizations": [], "uuid": "f2eb672e84e998b7897c939dafcb8b0d756a03a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/y/n/q/v/image.related.articleLeadwide.620x349.giydt0.png/1439866318907.jpg", "site_section": "http://www.smh.com.au/business/planners-go-rogue", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/money/super-and-funds/how-to-get-the-boss-to-help-pay-the-mortgage-20150813-giydt0.html", "country": "AU", "title": "Line ball call when it comes to tax breaks", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Line ball call when it comes to tax breaks", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "f2eb672e84e998b7897c939dafcb8b0d756a03a1"}, "author": "", "url": "http://www.smh.com.au/money/super-and-funds/how-to-get-the-boss-to-help-pay-the-mortgage-20150813-giydt0.html", "ord_in_thread": 0, "title": "Line ball call when it comes to tax breaks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The good old Hills hoist in the backyard is being shoved aside for a money-making venture. Photo: Michele Mossop\nWhere once it was a Hills hoist in the backyard these days it's more likely to be a granny flat. And I'm not sure granny lives there either.\nSubscribe to Money’s weekly newsletter , delivered to your inbox every Wednesday A real estate flyer lobbed into our letterbox was extolling the investment virtues of building a granny flat. Hey, if it helps pay down the mortgage why not?\nAdvertisement Anyway, this got me thinking about the tax breaks on investment properties. Which one works best - negative gearing, setting up a selfie super fund, or both?\nIt's line ball about which one is likely to last longer, I'm afraid.\nBoth deliver the same tax saving though they get there in different ways. Negative gearing works best for high-income earners, while a selfie allows your boss to help pay off the mortgage.\nWith such low interest rates and high rents it must be hard to negatively gear – that is, lose money to reduce your tax - though I'm sure you can manage it if you try.\nAs any home owner knows, there's always something going wrong. I'm told a rule of thumb for investment properties is that every five years they need new floor and window coverings and a coat of paint at the minimum.\nThe only point of negative gearing, meaning you're going backwards, is the capital gain when you sell because there's a 50 per cent tax discount.\n If you can positively gear from the start, so much the better. Better to make money and pay tax than lose less by saving tax, I always say.\nIn a selfie super fund the capital gains tax is only 10 per cent, or zero even if you wait til you're retired to sell.\nThis generous capital gains discount in or out of super, which applies to any asset not just property sold after a year, gets in the craw of Treasury and tax worthies much more so than negative gearing itself. Their beef is that when something is the most valuable, the tax concession is the biggest, not what you'd call fair and equitable.\nIt's a sort of death duty in reverse – making for a lightly taxed asset so more can be passed on to the kids.\nWhere was I? Oh yes, the virtue of buying an investment property through your super fund is no tax at the other end when you sell. If you're positively geared, so that you're making a profit, it's a no-brainer for the super fund – the tax is15 per cent instead of up to 49 per cent.\nThere's just one problem. The potential capital gain may not be as great. How's that? Because there are very strict rules about borrowing in a super fund, not least of which is that you can't renovate or improve the property. Buy an older place, for instance, and you're barred from doing it up.\nYou can't sub-divide or develop. If you buy a vacant lock of land you can't build on it.\nOh, and you can't build a granny flat with borrowed money because it doesn't have its own title.\nMost of all you can't buy it from yourself unless it's used for a business.\nAlthough the interest is deductible it may be slightly higher because the bank's security is limited to the property – unlike a normal mortgage where it has a claim on everything you own until it gets its money back – and the paperwork makes filling in a tax return like a walk in the park.\nIt'll cost at least $1500 to set up the loan because there are a lot of fingers in the pie including two sets of solicitors (yours and theirs), a custodian for the so-called bare or holding trust, an accountant, a financial planner and of course the stamp duties office.\nAny salary-sacrificed payments including your boss's compulsory contribution, all taxed at just 15 per cent, can be used for the loan repayments. That's akin to a tax deduction – up to 34 per cent off the top rate - for your loan repayments. Unfortunately, you can't pay in more than $30,000 if you're under 50 or $35,000 otherwise.\nBut wait, there's more. The earnings on anything in super are also taxed at 15 per cent which could well be wiped out by the deduction on the interest.\nAnyway, while property and tax breaks seem a perfect fit, and I have nothing against granny flats, frankly the sharemarket gives a bigger bang for your tax break. That's because franked dividends come with a 30 per cent tax credit.\nSelfies need a separate loan for every stock they buy on borrowed money though you could always choose an exchange traded fund that tracks, say, the ASX200. Or better still, one that tracks high-dividend paying stocks because there'd even be a tax rebate.\n@moneyPOTTS\n﻿", "external_links": ["http://twitter.com/@moneyPOTTS", "https://membercentre.fairfax.com.au/NewsletterSubscription.aspx"], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-20T22:25:00.898+03:00", "highlightTitle": ""}