{"organizations": ["Better Pick Than Barclays PLC"], "uuid": "667a77f66d947f7cbf579f3ade1ba2c710c3ac1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-banks/?format=rss", "section_title": "Banking News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/why-virgin-money-holdings-uk-064605131.html", "country": "US", "title": "Why Virgin Money Holdings (UK) PLC Could Be A Better Pick Than Barclays PLC", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why Virgin Money Holdings (UK) PLC Could Be A Better Pick Than Barclays PLC", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T09:46:00.000+03:00", "replies_count": 0, "uuid": "667a77f66d947f7cbf579f3ade1ba2c710c3ac1e"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-virgin-money-holdings-uk-064605131.html", "ord_in_thread": 0, "title": "Why Virgin Money Holdings (UK) PLC Could Be A Better Pick Than Barclays PLC", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "449.90 +2.30 \nVirgin Money (LSE: VM) and Barclays (LSE: BARC) are two very different banks. Barclays is one of the most recognisable brands of the British banking world, with a global presence and more than £1trn of assets. While Virgin Money is an upstart, with less than 100 branches and a limited product offering. \nNevertheless, Virgin Money has many advantages over its larger peer. For a start the company is growing at an alarming rate as customers flock to the bank. \nRapid growth \nVirgin Money has been trying to shake up the UK banking market over the past ten years with a customer-focused approach to banking. And, so far, customer seem to appreciate the bank's differentiated offering. \nDuring the first half of this year, Virgin's underlying profit before tax jumped 37%. Growth was driven by a 44% increase in mortgage lending, along with the successful migration of the group's credit card business in March 2015. The value of retail deposits at the bank increased by 3% during the period to £22.8bn. \nBarclays' growth was more subdued during the first half of 2015. Total income for the group's personal and corporate banking division grew 1% year-on-year. After deducting costs, profit before tax rose 4%. \nBut while it's easy to see from Virgin's headline figures that the bank is growing faster than Barclays, it is the quality of Virgin's earnings that's really impressive. \nIndeed, at the group level, Virgin's return on tangible equity -- a key measure of profitability -- came in at 10.2% for the first half. Barclays' RoTE stood at only 9.1% for the period. Moreover, at the end of June Virgin's core equity tier one capital ratio -- financial cushion -- was reported as being 18.7%. Barclays on the 0ther hand only reported a tier one capital ratio of 11.1%. \nOverall, these figures indicate that Virgin is taking less risk than its larger peer but is also achieving a faster rate of earnings growth and a higher return on equity. \nSimplicity \nThere are many reasons why Virgin is a better bet than Barclays but one of the most important factors is the bank's simplicity. \nYou see, the banking sector's increasing complexity is a key concern for the industry's analysts. It has now become extremely difficult to understand and interpret the balance sheets of large financial institutions'. \nBarclays is no exception. \nBarclays' half-year results release weighed in at a staggering 200 pages. The group has two separate reports, one for Barclays bank, another for the Barclays group, each one is around 100 pages long. Most of the release is devoted to explaining the risks at the group's investment bank, as well as Barclays' exposure to exotic financial instruments. \nHowever, Virgin's half year results release is around 80 pages long, which is hardly bedtime reading but is manageable. What's more, with Virgin's condensed report it is easy to dissect results and break down the bank's exposure to risky credit. \nSo overall, there are several key reasons why Virgin is a better bet than Barclays. \nA hidden gem \nOur top analysts here at The Motley Fool have recently discovered a company that they believe could see its sales increase by 300% to 500% over the next few years. \nThis company could be one of the most impressive growth stocks around. \nNevertheless, few have realised its potential, and as a result, the company in question has been touted a one of the market's hidden gems . \nTo find out more download our free report today . The report will be delivered to your inbox immediately, and there's no further obligation. \nThis is something you do not want to miss! \nRupert Hargreaves has no position in any shares mentioned. The Motley Fool UK has recommended Barclays. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-05T09:46:00.000+03:00", "crawled": "2015-08-05T10:23:15.160+03:00", "highlightTitle": ""}