{"organizations": [], "uuid": "ebd6862df81c9278fafb940cb573805050707e91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/g/y/2/t/c/image.related.afrArticleLead.620x365.gj01zy.png/1439721990853.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/accounting/charities-under-crackdown-for-dodgy-accounting-20150816-gj01zy", "country": "AU", "title": "Opaque charity sector under fire for accounting failures", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Opaque charity sector under fire for accounting failures | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T22:00:00.000+03:00", "replies_count": 0, "uuid": "ebd6862df81c9278fafb940cb573805050707e91"}, "author": "Adele Ferguson", "url": "http://www.afr.com/business/accounting/charities-under-crackdown-for-dodgy-accounting-20150816-gj01zy", "ord_in_thread": 0, "title": "Opaque charity sector under fire for accounting failures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Susan Pascoe says that despite uncertainty over the ACNC's future, the vast majority of charities are complying with regulations. Penny Bradfield Share on twitter by Adele Ferguson Australia's $107 billion charity sector has always been a black hole of the economy.\nIt is big, powerful – financially and politically – and lacks transparency and accountability.\nIt is little surprise then that the Australian Charities and Not-for-profits Commission (ACNC) was forced on Friday to issue a statement that it had put a red mark against 4000 charities listed on the charities register for failing to lodge financial reports.\nAnother 5500 charities had their charity status revoked after failing to complete their reporting for two consecutive years.\nIllustration: Rod Clement Since the regulator was set up in December 2012, almost 9000 charities have had their status revoked.\nWhile most of the 55,000-plus charities do great things, some don't.\nSome of the charities that failed to lodge accounts did so in the hope that the regulator wouldn't be around to assess them.\nIt follows a pre-election promise made by the Coalition to abolish the charities regulator – post-haste. The Coalition's plan was to scrap the ACNC as part of its commitment to reducing red tape. The plan was to return the sector's regulatory powers to the Australian Taxation Office and the corporate regulator ASIC.\n Indeed, in March 2014 the Abbott government introduced the ACNC repeal bill after some serious lobbying by at least one religious giant.\nBut then something happened: many in the sector, including Hillsong and St John Ambulance, decided a dedicated regulator, and a national database, was a good thing. They lobbied hard for it to stay.\nA ministerial reshuffle in December allowed the Coalition to quietly back-track on the gung-ho policy. In April a statement was made that the Coalition's policy was to abolish the ACNC, but that it was no longer a priority.\nThen in May the federal budget allocated the ACNC its full budget and included it in its forward estimates. Nevertheless, uncertainty remains, which is never a good thing.\nACNC commissioner Susan Pascoe told The Australian Financial Review that despite the uncertainty the vast majority of charities were complying.\nUntil the charities regulator was established and started collecting financial accounts, there was little transparency. The amount and type of information collected still falls short, but it is a start. When the Australian Taxation Office was regulating the sector we didn't know what the sector was worth, how the organisations were spending their money, or how many people they employed.\nNow, we know the sector comprises 60,000 registered charities generating an estimated $107 billion in revenue and assets of $176 billion. It employs almost 1 million people, equivalent to 8 per cent of the workforce.\nSacred cow Over the past 20 years there have been numerous inquiries into the charities sector. All agreed the sector was complex and lacked transparency and accountability and needed a dedicated regulator.\nIn 1995 the Industry Commission (now the Productivity Commission) found there was a \"lack of consistent data, a lack of access to public information and a lack of standardised financial reporting\". It made a series of recommendations, including the introduction of an accounting standard for the sector and better public access to information.\nThere still isn't a standardised financial reporting that charities must comply with. This means there is no way to detect how efficient a charity is in the delivery of services because there is no accounting standard to benchmark charities.\nThere have also been attempts to investigate whether the tax arrangements are appropriate. None have been adopted, mainly due to the massive political and financial clout of the biggest charities. To put it into perspective, 10 per cent of charities generate sales of $90 billion a year and own the bulk of the $176 billion assets estimated to be owned by the sector. Put simply, any attempts to take money from this sacred cow have been quashed.\nThe latest, the Abbott government's tax white paper will look at \"to what extent do the tax arrangements for the not-for-profit sector raise particular concerns about competitive advantage compared to the tax arrangements for for-profit organisations?\"\nIt is no doubt referring to the fact that some charitable organisations run businesses which are eligible for myriad tax concessions, grants and government subsidies which costs taxpayers billions of dollars a year.\nThe Catholic Church, which turns over billions of dollars a year, runs schools, hospitals and aged-care facilities, but it also runs an insurance company, which has assets of more than $1 billion, a winery and it runs super funds. The Seventh-day Adventists run the Sanitarium food business, Hillsong has its own record label and the Lutheran Church takes deposits and provides loans through its Lutheran Laypeople's Fund.\nOver the years, some in the private sector have argued that tax breaks violate what is known as \"competitive neutrality\".\nIt will be interesting to see how big an appetite the Abbott government has when it comes to making some hard decisions on this sector when it comes to tax.\nMost charities do a fine job, but a lack of transparency and accountability makes it a hot bed for corruption and abuse. Last year the Australian Transaction Reports and Analysis Centre (AUSTRAC) wrote a report into terrorism financing and found charities were a key channel for raising and distributing money.\nDamp squib The ACNC has acknowledged terrorism as a key area of concern. It has received a number of complaints and launched formal investigations into some charities.\nNot all complaints are terrorist-related. Most complaints were that charitable resources were being used inappropriately, possible fraud, lack of transparency and accountability and sham charities and fundraising.\nAll up, it has received 1300 complaints, launched 100 investigations into charities and revoked the charity status of 10 charities as a result of these investigations.\nThe charities were named and shamed but the legislation prevents the release of any details of what the charity did wrong, which makes it a damp squib.\nIf the government is serious about cleaning up the charity sector it needs to beef up the powers of the regulator so that it can not only name and shame the wrongdoers but also detail what they have done wrong.\nGary Johns, a former politician and author of the book The Charity Ball, believes the sector is a poorly informed market, and philanthropic donors don't know how their money is being spent. Using numerous case studies, he believes most charities spend their time lobbying state and federal governments for more money. \"I call it the charity ball. It goes round and round.\"\nThere is no question that the charitable sector plays an important role in society and the economy. At a time when pressures to cut government spending are shifting more of the burden of social programs onto the sector, charities have never been more important.\nWith hundreds of thousands of charities vying for government grants and donations or access to volunteers, it is vital to improve transparency and efficiencies in the sector.\nBut this won't be easy. The so-called third sector is a sacred cow, which means scrutiny is often deemed uncharitable. It explains why politicians throughout the decades have preferred to steer clear of radical changes.\nThe ACNC is the best hope to shine a small light on the sector but it needs certainty from the Abbott government about its future.\nIf it is to be taken seriously, it needs to have its powers beefed up to allow it to detail wrongdoings by individual charities. It also needs to impose uniform accounting standards across the sector so that they can be compared and contrasted and measured on performance.\nIf not, the sector will continue to operate in the dark and the many good things that so many charities do will get lost in the noise.", "external_links": ["https://twitter.com/@adele_ferguson"], "published": "2015-08-16T22:00:00.000+03:00", "crawled": "2015-08-17T00:12:27.088+03:00", "highlightTitle": ""}