{"organizations": [], "uuid": "5e478cebcdbdba0d7128548d381af09c4b67faf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l1.yimg.com/bt/api/res/1.2/J_Og5YnzGJ5rr35pbp1EKQ--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-08-03T002619Z_1_LYNXNPEB7200D_RTROPTP_3_MARKETS-JAPAN-STOCKS_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/asia-dips-wall-street-dollar-002619484.html?l=1", "country": "GB", "title": "Asian stocks near 2015 lows on China economy worry, dollar strong", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Asian stocks near 2015 lows on China economy worry, dollar strong", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T06:50:00.000+03:00", "replies_count": 0, "uuid": "5e478cebcdbdba0d7128548d381af09c4b67faf0"}, "author": "", "url": "http://finance.yahoo.com/news/asia-dips-wall-street-dollar-002619484.html?l=1", "ord_in_thread": 0, "title": "Asian stocks near 2015 lows on China economy worry, dollar strong", "locations": ["Tokyo", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peter"], "text": "Asian stocks near 2015 lows on China economy worry, dollar strong 57 minutes ago . View photo People are reflected in a board showing market indices in Tokyo July 28, 2015. REUTERS/Thomas Peter \nBy Saikat Chatterjee \nHONG KONG (Reuters) - An index of Asian shares outside Japan fell close to this year's lows thanks to a deepening selloff in commodities and concerns over slowing growth in China, while the dollar held its ground against a basket of currencies. \nChina's factory activity shrank more than initially estimated in July, contracting by the most in two years as new orders fell, according to a private survey that dashed hopes that the economy may be steadying. \n\"We believe the stock market panic in early July chilled economic activity, which is what the manufacturing PMIs picked up,\" ING economist Tim Condon said in a research note ahead of the Caixin PMI release. \nMSCI's broadest index of Asia-Pacific shares outside Japan fell more than 1 percent before paring losses to be down 0.9 percent. The biggest losers were financials and cyclicals. The index's low for this year was on July 8. \nStock markets across the region declined with Japan's Nikkei (.N225) down 0.5 percent and South Korea's Kospi (.KS11) falling 0.9 percent. \n\"We believe the macro environment remains challenging for emerging market assets amid headwinds of low commodity prices, concerns over China and a looming Fed tightening cycle,\" Barclays strategists wrote in a daily note in clients. \nRecent flows data confirm that trend. Net foreign selling from emerging Asia has reached nearly $10 billion over the past two months with only India seeing some tiny inflows. \nAlthough outflows have pummeled stock markets from Korea to Taiwan, valuations suggest more downside is likely. \nWhile recent weakness in stocks has made emerging market valuations more attractive than those of developed market counterparts, they are twice as expensive as Asian financial crisis lows, according to research from Julius Baer. \nOn Wall Street on Friday, the Dow (.DJI) lost 0.3 percent and the S&P 500 (.SPX) shed 0.2 percent, due to a drop in energy shares.[.N] \nIn currencies, the dollar on Monday held broadly steady at 123.97 yen (JPY=). The euro was steady at $1.1097 (EUR=). \nWhile recent dollar moves have been buffeted by U.S. economic data, the broader trend was on the upside after the Federal Reserve last week left the door open for a possible interest rate increase in September. \nThe U.S. dollar has rallied 7.75 percent so far this year against the world's main trading currencies (.DXY), after a 12.8 percent rise last year. \nAnd \"the dollar's recent rally may just be getting started,\" according to research from the BlackRock Investment Institute. \n\"Since the 1970s when the Bretton Woods fixed-currency regime ended and currencies began floating, a typical dollar rally has lasted roughly six to seven years,\" according to Russ Koesterich, BlackRock global investment strategist, who noted dollar rallies tend to be self-reinforcing, leading to greater inflows into U.S. assets in expectation of further dollar appreciation. \nThat traditionally is also a headwind for emerging markets, which have an inverse relationship to the dollar. \nCommodities too are singing the emerging market blues. \nCrude oil continued to flounder after posting its biggest monthly drop since 2008 in July on China's stock market slump and signs that top Middle East producers were pumping out crude at record levels. \nU.S. crude (CLc1) was down 0.7 percent at $46.81 a barrel after losing 21 percent in July. \nCopper prices fell 10 percent in July, the worst month since January and are now at their lowest levels since June 2009. \nOverall the Reuters commodity index (.TRJCRB) fell 10.8 percent in July, its biggest monthly fall since September 2011. \nReflecting the economic slowdown in China and sluggish growth in Europe and the Americas, international trade is also slowing. \nBonds were the sole bright spot. \nThe benchmark 10-year note yield held firm at 2.21 percent while 10-year Japanese bond yields stabilized at 0.41 percent. \n(Additional reporting by Shinichi Saoshiro in TOKYO and Clive Mckeef in NEW YORK) USA News", "external_links": [], "published": "2015-08-03T06:50:00.000+03:00", "crawled": "2015-08-03T06:55:37.460+03:00", "highlightTitle": ""}