{"organizations": [], "uuid": "9f9625f7f67085648741f454f9a67dd7c14f84a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/miscellaneous/dealing-with-hardik-patel/126662", "country": "IE", "title": "Dealing with Hardik Patel", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Dealing with Hardik Patel | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T11:01:00.000+03:00", "replies_count": 0, "uuid": "9f9625f7f67085648741f454f9a67dd7c14f84a1"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/miscellaneous/dealing-with-hardik-patel/126662", "ord_in_thread": 0, "title": "Dealing with Hardik Patel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With the near universal reaction to the Hardik Patel agitation being that the Patels are too well off to be included in the list of OBCs, attention has once again focused on the ‘creamy layer’, that the benefits of reservations can’t go to those who are well off. But, with several OBC groups also relatively well off and not facing any kind of social discrimination, the argument doesn’t necessarily hold water. Also, with several upper caste groups worse off than SCs, are they to be given reservations—according to the PRICE all-India survey, while 17% of SC households had at least one matriculate and earned R1.7 lakh per annum in 2013-14, around the same proportion of upper caste households did not have even one matriculate and earned substantially less.\nIndeed, given our founding fathers had not envisaged reservations in perpetuity, the government needs to examine whether the policy is working. Certainly, reservations have meant more SC/ST/OBC candidates are getting into colleges, but is this making them more employable? If not, greater attention has to be given to how to do this, just preferential entry into colleges may not do the trick—special classes at the school/college level, for instance, may be the solution; more so in tougher disciplines like medicine and engineering. Thought also needs to be paid to the longer-term consequences of reservations. The number of Indian universities among the best in the world, low to begin with, has fallen over the years—from three in the ARWU list of Top 500 universities in 2005, India has just one today, while the number for China has risen from 18 to 44 in the same period. While few countries without top class universities have grown in any sustained fashion, how much does the reservations policy—for teachers as well as students—contribute to this, or is this just a larger problem related to most government institutions?\nIn the context of the Hardik Patel challenge, questions have to be asked on the impact of reservations on those who suffer because of them. If education is the surest passport to a better life, it is idealistic to expect that those losing out are not going to protest; more so since, as economic growth picks up, the benefits to be got from higher education are higher than ever in the past. So far, the argument of the political class has been that once there are more jobs and more universities, upper castes will have other options—in other words, the problem is one of shortages, and GDP growth and time will take care of that. But, as the Patel agitation—and several others before it—shows, this has not happened, so the clamour to be included in the reservations list has only grown. It is ironic that, at a time when the political class has to be planning for phasing out reservations, it is faced with a demand for more—more ironic, of course, is the fact that while the Patel agitation was at its peak, the Cabinet agreed to add more groups to the list of OBCs.\n 28, 2015 3:01 am", "external_links": [], "published": "2015-08-28T11:01:00.000+03:00", "crawled": "2015-08-28T04:57:12.748+03:00", "highlightTitle": ""}