{"organizations": [], "uuid": "8fae5653c6f7e41ea764d307cd55a327605c112f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/mgnLOUgvMvpXJozeu57hbQ--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/US_AHTTP_AP_FINANCIALTIMES/963fae9b717fec227d0f6a706700376a_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/wins-loses-under-obamas-stricter-071825825.html", "country": "US", "title": "Who wins and loses under Obama's stricter power plant limits", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Who wins and loses under Obama's stricter power plant limits", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T16:21:00.000+03:00", "replies_count": 0, "uuid": "8fae5653c6f7e41ea764d307cd55a327605c112f"}, "author": "", "url": "https://uk.finance.yahoo.com/news/wins-loses-under-obamas-stricter-071825825.html", "ord_in_thread": 0, "title": "Who wins and loses under Obama's stricter power plant limits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Aug 3, 2015, 14:35 BST - UK Markets close in 1 hr 55 mins Who wins and loses under Obama's stricter power plant limits Who wins and loses under Obama's stricter greenhouse gas emission limits for power plants By Josh Lederman, Associated Press | Associated Press – 14 minutes ago View Photo \nFILE - In this Jan. 20, 2015 file photo, a plume of steam billows from the coal-fired Merrimack Station … \nWASHINGTON (AP) -- President Barack Obama is mandating even steeper greenhouse gas cuts from U.S. power plants than previously expected, while granting states more time and broader options to comply. \nThe tweaks to Obama's unprecedented emissions limits on power plants, to be unveiled at the White House on Monday, aim to address a bevy of concerns raised by both environmentalist and the energy industry in more than 4 million public comments received by the Environmental Protection Agency. \nOpponents plan to sue to stop the rule, and on Monday, the National Mining Association wrote the EPA a letter requesting that the agency put the rule on hold while the legal challenges play out. If the EPA refuses, industry groups plan to ask the courts to take that step instead. \nSome of the changes Obama is making in the final version of the plan go even further in cutting the heat-trapping gases blamed for global warming. Other changes delay implementation and eliminate certain options that states could use to show they're cutting emissions, making it harder to comply. \nAll states are eagerly awaiting word of changes to the individual emissions reduction targets that Washington is assigning each state. Some states will be given a more lenient target than they were assigned under the proposed version, while others will have tougher targets to meet. The Obama administration has yet to disclose those state-specific targets. \nA look at potential winners and losers in Obama's final plan: \nWINNERS: \n— ENVIRONMENTALISTS \nTo the delight of environmental groups, Obama tightened the emissions requirements in his final plan. That means power plants will have to attain an even lower level of carbon dioxide pollution to be in compliance. Obama's proposal from last year set the target as a 30 percent nationwide cut by 2030, compared to the levels in 2005. His revamped plan calls for a 32 percent cut in the same time period. \nLeft unchanged is Obama's overall goal for U.S. emissions cuts from all sources of pollution, including cars and trucks. As the U.S. commitment to a major global climate treaty that Obama is championing, the U.S. committed to cutting its emissions 26 percent to 28 percent by 2030, compared to 2005. \n— PROCRASTINATING STATES \nMany of the complaints directed at Obama's plan over the last year centered on the amount of time states would have to figure out how to meet their targets. Plans for how states will comply are technically due next year, but there's no penalty to asking for a two-year extension, so most states are expected to delay. Under the earlier plan, the rock-bottom deadline was 2017, but that's being pushed back to 2018. \nAnd while states previously had until 2020 to achieve their targets, they'll now have an extra two years — until 2022. \n— RENEWABLE ENERGY \nObama's revised plan relies more heavily on renewable energy sources like wind and solar replacing dirtier coal-fired power plants. Obama now wants the U.S. to get 28 percent of its power from renewables by 2030, compared to 22 percent in his earlier proposal. \nIn a new element, the administration now intends to offer pollution credits to states that drive up renewable energy generation in 2020 and 2021 ahead of the compliance deadline. States that invest early in wind and solar can store away those credits to offset pollution emitted after the compliance period starts in 2022. \nLOSERS: \n— YOUR POWER BILL \nAlthough the administration predicts the plan will actually lower the average U.S. energy bill by almost $85 in 2030, companies that produce and distribute electricity aren't buying it. The savings come from increased use of wind, power and hydro plants, which operate at a cost of close to zero after they're installed. But acquiring and constructing renewable power sources is still very costly, making it less cost effective in many circumstances. \nThe National Association of Manufacturers, the American Coalition for Clean Coal Electricity, the National Mining Association, the American Energy Alliance and the National Rural Electric Cooperative Association all predicted the rule would drive electricity bills up. \n— NATURAL GAS \nThe earlier version of Obama's plan sought to accelerate the ongoing shift from coal-fired power to natural gas, which emits far less carbon dioxide. But the final rule aims to keep the share of natural gas in the nation's power mix the same as it is now. \nEPA Administrator Gina McCarthy said government estimates show renewable energy has ticked upward even since the rule was proposed last year, but that natural gas remained an important part of the U.S. energy mix. \n— ENERGY EFFICIENCY \nUnder the revamped plan, state energy efficiency efforts are no longer factored into the individualized reduction targets being assigned to each state. In other words, what states are already doing to reduce energy demand won't be included in their baseline the way that other measures, like replacing coal plants with cleaner sources, will be. That means some states could face more stringent targets despite their efforts in the past to cut down on electricity use. \nBut states will still be able to get credit for energy efficiency programs when it comes to meeting their targets in 2022. The revised power plant rule also offers polluting credits to states that deploy energy efficiency programs in poorer communities. \n___", "external_links": [], "published": "2015-08-03T16:21:00.000+03:00", "crawled": "2015-08-03T16:35:36.674+03:00", "highlightTitle": ""}