{"organizations": [], "uuid": "1e392909802e52cc3ab24c230849fe911f87905f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508080234.html", "country": "US", "title": "South Africa: President Jacob Zuma Announces Initiative for Increased Investment", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: President Jacob Zuma Announces Initiative for Increased Investment", "spam_score": 0.0, "site_type": "news", "published": "2015-08-08T16:08:00.000+03:00", "replies_count": 0, "uuid": "1e392909802e52cc3ab24c230849fe911f87905f"}, "author": "", "url": "http://allafrica.com/stories/201508080234.html", "ord_in_thread": 0, "title": "South Africa: President Jacob Zuma Announces Initiative for Increased Investment", "locations": ["South Africa", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jacob Zuma"], "text": "Zimbabwe: Coup De Grace? Plots and Purges in Zimbabwe \n\"The objective of the investment feasibility study is to ascertain an appropriate mechanism to simplify and streamline regulatory procedures for investment and to strengthen the approach to investment promotion, facilitation and aftercare,\" said President Zuma. \nHe added that the initial consultative workshops were conducted towards the end of June 2015, and further engagements continued to take place. \nPresident Zuma also called on business to fly both South African and African Union flags at their premises to promote our true African identity as a people. He added that significant progress had been made in a number of areas particularly on energy, education, industrialisation, regulatory measures, as well as other areas that need intervention for our economy to prosper. \nJoint government and business working group reports were presented to the meeting in the following areas: \n1. Education and skills development \nThe National Education Collaboration Trust (NECT) has enabled business, labour, civil society, national and provincial government to collaborate in implementing the 2030 National Development Plan targets for basic education. A major achievement is the commitment by the National Skills Fund to provide R700 million to support the establishment of centres of excellence to develop skills in areas where scarce skills have been identified. By July 2015, 26 private sector organisations, labour unions and government had contributed R195 million to the Trust and over R100 million in indirect investments in the NECT districts and schools. Additionally, the Trust works in 4362 schools, in 8 districts and 5 provinces. These schools receive support in improving the quality of learning and teaching. 500 Mathematics and science master teachers are being trained in the NECT districts. Furthermore the issue of work based learning was cited as one of the successes. \n2. Labour market \nGovernment and Business agreed that restoring trust between parties is important in growing our economy and increasing employment. This is done through the bilateral meetings at NEDLAC and the Presidential Business Working Group. Under the leadership of the Deputy President, NEDLAC convened a Labour Relations Indaba on the 4 November 2014 followed by the establishment of a Committee of Principals and two task teams that have been meeting on average four times a month. The task teams seek to ensure labour market stability, which is currently threatened by prolonged and violent strike action and address issues of growth, inequality and minimum wages. \nFurthermore Business and Government agreed to simplify processes for SME's to be established and registered for all employment matters. This includes consideration of the feasibility of establishing a single-point registration process to assist SME's with registration processes for VAT, PAYE, UIF and other regulatory requirements. \n3. Regulatory impact on investment \nSignificant progress has been made in addressing delays, errors and frustration experienced by companies seeking to register or change their registration with the Companies and Intellectual Property Commission (CIPC). CIPC has introduced the online registration facility which resulted in turnaround times for registration reduced to an average of two days, from the previous average of three months. \nA critical milestone has been achieved particularly in the area of converting red tape into smart tape and a better alignment of regulations with government priorities. This was done through the development of a tool for assessing the socio-economic impact of legislation. The system was adopted by Cabinet in February 2015. Training of Departments' officials on the Socio-Economic Impact Assessment System (SEIAS) was completed and implementation commenced on 1 July 2015. \n4. Infrastructure \nGovernment and Business are working on innovative financial and risk sharing solutions to ensure cost-effective and efficient bulk water and sanitation services. Ultimately this will lead to the release of funds by the private sector for investment in municipal bulk infrastructure on a sustainable basis. Some of the success stories where government and business worked together are in the Waterberg and Steelpoort mining areas. The private sector worked closely with the government to ensure that the infrastructure matches future demand and helped reduce the risk exposure to government. \n5. Inclusive growth \nGovernment and Business have identified the following Local Industrial Parks which are to be revitalised: Dimbaza, Queendustria, Fort Jackson, Isithebe, Botshabelo, Siyabuswa, and Babalegi amongst others. In addition, Business has requested that Government double the number of prioritised Local Industrial Parks to 20 as it wishes to partner with Government to roll this out. \nWith regards to revitalising the township economies, government has partnered with the Wholesale and Retail SETA to implement the Informal Trader Upliftment Project (ITUP). The project has so far trained 373 informal traders. \nThe President further noted that of great interest to him, Government and Business had committed to scale-up work placements for Technical and Vocational Education and Training Colleges learners facilitated by a web-based database providing a \"market place\" for firms and learners to register their opportunities and needs respectively. \nIn addition, Business and Government had committed to - within 6 months - identify high-demand skills for the Strategic Infrastructure Projects (SIPs), identify Public Education and Training Institutions as centres of specialization and ensure their curricula meet economic needs, and provide work-based learning. \nFurthermore, the Chamber of Mines will meet with government to discuss differences over the Mineral and Petroleum Resources Development Act (MPRDA). Both parties expressed confidence that the meeting would contribute positively to resolving the matter outside the courts. South Africa \nA Pretoria man was killed during the siege of a hotel in Mali, an international relations spokesperson said on Saturday. see more » Copyright © 2015 South African Government. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-08T16:08:00.000+03:00", "crawled": "2015-08-09T09:10:48.194+03:00", "highlightTitle": ""}