{"organizations": [], "uuid": "bb8af26b251321c6632fc2857e907bbaf550b4c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/1/3/b/r/z/l/image.related.articleLeadwide.620x349.gis3ru.png/1438766287607.jpg", "site_section": "http://www.canberratimes.com.au/business/carbon-economy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/banking-and-finance/genworth-calls-for-capital-relief-on-mortgage-insurance-20150805-gis3ru.html", "country": "AU", "title": "Genworth calls for capital relief on mortgage insurance", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Genworth calls for capital relief on mortgage insurance", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T17:18:00.000+03:00", "replies_count": 0, "uuid": "bb8af26b251321c6632fc2857e907bbaf550b4c8"}, "author": "", "url": "http://www.canberratimes.com.au/business/banking-and-finance/genworth-calls-for-capital-relief-on-mortgage-insurance-20150805-gis3ru.html", "ord_in_thread": 0, "title": "Genworth calls for capital relief on mortgage insurance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Genworth chief executive Ellie Comerford: \"We want to point out the unintended consequences that could occur if there isn't explicit capital relief,\" Photo: Peter Rae\nAs banks move to raise billions of dollars to make them more resilient against shocks, Genworth Mortgage Insurance is stepping up calls for regulators to give big lenders more incentive to pass some of their home loan risk onto insurers.\nThe Australian Prudential Regulation Authority (APRA) last month said the big four banks would need to boost their loss-absorbing capital buffers by $12 billion by next July, and likely more in the future.\nOn Wednesday, Westpac confirmed it was raising $1.25 billion through a hybrid, after originally targeting $750 million. The margin on the hybrid was set at 4 per cent.\nGenworth chief executive Ellie Comerford says there could be \"unintended consequences\" if major banks don't receive capital relief for using mortgage insurance. Photo: Jessica Hromas\nA key risk on APRA's radar is the booming $1.3 trillion mortgage market, which accounts for about two-thirds of bank loans and has been turbocharged by record low interest rates.\nAdvertisement However, the big four banks and Macquarie do not receive a capital benefit from APRA when their customers pay for a mortgage insurance policy.\nLenders mortgage insurance (LMI) protects banks against losses in a default, and is often mandated by banks when a borrower has a deposit of less than 20 per cent.\nGenworth chief executive Ellie Comerford​ on Wednesday warned the current approach ran the risk of ultimately leaving Australia with smaller buffers against a shock in the housing market.\n\"We want to point out the unintended consequences that could occur if there isn't explicit capital relief,\" she said in an interview.\n\"Were the major banks . . . to discontinue using LMI for that reason, putting aside the fact that they use it for risk diversification as well, the LMI capital from private mortgage insurance could very much leave the system.\"\nIf that occurred, she said it would leave Australia with less capital and without the \"second set of eyes\" on bank lending standards that mortgage insurance provided.\nThe financial system inquiry by former Commonwealth Bank chief executive David Murray last year recommended mortgage insurance be recognised in the capital framework \"where appropriate\".\nYet APRA's recent announcements on capital have not mentioned the topic.\nInsurance Council of Australia chief executive Rob Whelan last month said the current approach adopted by APRA could ultimately mean more riskier loans with low deposits being written by banks, without the extra buffer provided by LMI.\n\"This could increase the system's susceptibility to significant stress events,\" Mr Whelan said.\nMs Comerford said the issue had been debated for several years and with bank capital levels being revised, it was time the question was resolved.\n\"We don't shy away from the fact the banks have now been told they need to hold more capital. On that basis, it's something that we think would actually be good to put to rest now,\" she said.\nWhile regulators had highlighted the rapid growth in housing investor borrowing as a concern, Ms Comerford said Genworth was managing the risks in housing and 74 per cent of its portfolio covered owner-occupier loans.\nShe also noted the \"huge\" growth in Sydney – where house prices are up 18.4 per cent in the past year – but said Genworth's portfolio was not \"disproportionately situated\" in the city.\nOn Wednesday, Westpac confirmed it was raising $1.25 billion through a hybrid, after originally targeting $750 million. The margin on the hybrid was set at 4 per cent.", "external_links": [], "published": "2015-08-05T17:18:00.000+03:00", "crawled": "2015-08-06T11:44:25.261+03:00", "highlightTitle": ""}