{"organizations": [], "uuid": "eafb1240b77e6cf91f8d68d0189c1a1115b8a12b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/c/c/h/w/image.related.afrArticleLead.620x365.gisn4w.png/1438829083192.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/legal/slater--gordon-did-not-rely-upon-quindells-accounting-stands-by-uk-division-due-diligence-20150805-gisn4w", "country": "AU", "title": "Slater & Gordon 'did not rely upon' Quindell's accounting, stands by UK division due diligence", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Slater & Gordon 'did not rely upon' Quindell's accounting, stands by UK division due diligence | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T07:10:00.000+03:00", "replies_count": 0, "uuid": "eafb1240b77e6cf91f8d68d0189c1a1115b8a12b"}, "author": "Share via Email", "url": "http://www.afr.com/business/legal/slater--gordon-did-not-rely-upon-quindells-accounting-stands-by-uk-division-due-diligence-20150805-gisn4w", "ord_in_thread": 0, "title": "Slater & Gordon 'did not rely upon' Quindell's accounting, stands by UK division due diligence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Slater & Gordon says its stands by its British acquisition. Jessica Shapiro by James Thomson and Jonathan Shapiro Slater & Gordon says it did not rely on the questionable accounting policies of the UK law firm from which it purchased its Professional Services Division for $1.3 billion in April.\nBritish law firm Quindell, which sold Slaters the business earlier this year, was forced to restate it accounts following investigations by British regulators.\nThe company told investors it had revised its revenues down by £289 million to report a £137 million loss rather than a £175 million profit.\nOf most relevance to Australian investors were the notes to the financial statements that restated the earnings of the 'discontinued' businesses sold to Slater & Gordon. They showed a £60.1 million loss in 2013 and a £133.2 million loss in 2014.\nThe cash flow statement showed negative cash flow in 2014 of £3.75 million and a positive cash flow of £26 million. But those figures include funds raised. Operating cash flow showed a negative £60 million balance in 2013 and a negative £83 million balance in 2014.\nIt also emerged overnight that Quindell was the subject of an investigation by the Serious Fraud Office with spokesperson confirming to the UK media that it had \"opened a criminal investigation into accounting practises at Quindell\".\nHowever, Slater & Gordon said in an announcement on Thursday morning that \"Quindell's accounting policies were not relied on by Slater & Gordon in its due diligence of the PSD, which ws undertaken with the assistance of Ernst & Young LLP.\n\"Slater & Gordon's assessment of the PSD, including its historical financial performance, was based on a fundamental, bottom-up analysis including the review of 8,000 case files by 70 lawyers.\n \"The PSD is now focused on higher velocity, cash generative fast track road traffic accident segment rather than growth in cash consumptive hearing loss claims.\n\"The publication of these statutory accounts does not alter Slater & Gordon's view of the PSD, nor the economic benefits Slater & Gordon expects the business to generate.\"\nIn addition to the new probe by the Serious Fraud Office, two of Quindell's previous auditors KPMG and RSM Tenon, which was later rebranded as Baker Tilley, are reported to be the subject of a probe by the UK's accounting authority.\nBaker Tiley is the UK affiliate of Slater & Gordon's auditor Pitcher Partners, and had conducted the UK leg of Slater & Gordon's audit.\nSlater & Gordon shares fell by as much as 18 per cent to $2.60 but have since recovered to trade down 5 per cent at $3.12\nSlater & Gordon said in a statement that it has no liability in relation to the investigations. Meanwhile the company is still under the spotlight of its own regulatory investigation with the Australian Securities and Investment Commission looking into its accounts which were audited by Pitcher Partners.\nSlater & Gordon said its 'engagement' is ongoing and progressing in 'a timely manner'.\nWhen asked by the AFR if the SFO was in contact with Australian authorities a spokeswoman said it \"does have an International Assistance Unit which handles requests for mutual legal assistance by overseas authorities. These requests are received via the UK Central Authority.\"", "external_links": [], "published": "2015-08-06T07:10:00.000+03:00", "crawled": "2015-08-06T06:06:38.992+03:00", "highlightTitle": ""}