{"organizations": [], "uuid": "9f44148d3b4ecc0c6a0fe60bde1e562a31ca9cc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/k7wxX4XLgW8y71fEJTz9hA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/47f5f4276dd6f301a591d65f6a0941251acbbfcb_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/european-stocks-shed-more-one-082824541.html", "country": "GB", "title": "European stocks shed more than one percent at open", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "European stocks shed more than one percent at open", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T11:28:00.000+03:00", "replies_count": 0, "uuid": "9f44148d3b4ecc0c6a0fe60bde1e562a31ca9cc3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/european-stocks-shed-more-one-082824541.html", "ord_in_thread": 0, "title": "European stocks shed more than one percent at open", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 26, 2015, 09:38 BST - UK Markets close in 6 hrs 52 mins European stocks shed more than one percent at open AFP – 9 minutes ago View Photo \n\nEurope's stock markets fell by more than one percent at the open on Wednesday despite gains in Asia, as investor enthusiasm waned over China's interest rate cut. \nIn initial trade, London's benchmark FTSE 100 index lost 1.30 percent to 6,002.28 points, Frankfurt's DAX 30 tumbled 1.69 percent to 9,956.85 and the CAC 40 in Paris sank 1.44 percent to 4,499.23 points. \nEuropean markets had rebounded Tuesday after China cut interest rates in an attempt to boost the flagging Chinese economy, which had sent markets into a tailspin on Monday. \nWall Street also rallied on the news but optimism soon fizzled and New York ended with sharp losses. \nThe Dow Jones Industrial Average sank 1.29 percent as the market remained jittery over China after recent stock gyrations, especially Monday, when the Dow tumbled more than 1,000 points at one stage. \n\"The equity market rollercoaster continues,\" said TrustNet analyst Tony Cross. \n\"It (Other OTC: ITGL - news ) 's Wall Street's slump... that appears to be setting the pace for the UK market and, as is often the way after these excessive moves, this volatility appears likely to be with us for some time yet.\" \nOn the upside, Asian equities pushed higher Wednesday after China's rate cut -- aimed at soothing fears about stalling growth in the world's number-two economy -- but more volatility was forecast in a crisis that has panicked global markets. \nChina's central bank reduced interest rates on Tuesday and slashed the amount of money banks need to hold in reserve -- its second such double move in two months -- in a bid to stimulate growth. \nThe measures are not only expected to help boost cash flow in China, but also revive confidence that Beijing can steer the world's second-largest economy away from a hard landing and keep global growth on course.", "external_links": [], "published": "2015-08-26T11:28:00.000+03:00", "crawled": "2015-08-26T11:38:53.416+03:00", "highlightTitle": ""}