{"organizations": [], "uuid": "97a5eabdf6783354338d7a08170a04ea9dba2c74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/us_economy_getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/252184-wages-make-biggest-increase-since-november", "country": "US", "title": "Wages see biggest increase since November", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Wages see biggest increase since November", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T18:33:00.000+03:00", "replies_count": 0, "uuid": "97a5eabdf6783354338d7a08170a04ea9dba2c74"}, "author": "rshabad@thehill.com (Rebecca Shabad)", "url": "http://thehill.com/policy/finance/252184-wages-make-biggest-increase-since-november", "ord_in_thread": 0, "title": "Wages see biggest increase since November", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wages see biggest increase since November Getty Images By Rebecca Shabad - 08/28/15 11:33 AM EDT \nWages and salaries saw their biggest increase in July since last November, the Commerce Department reported on Friday. \nThey increased by 0.5 percent in July, or by $35.8 billion last month. That’s compared to the much lower $14.3 billion increase in June. \nOverall, personal incomes rose by 0.4 percent, or by $67.1 billion. ADVERTISEMENT In July, consumer spending also had a moderate increase of 0.3 percent, according to Friday’s report, which noted that car purchases accounted for a chunk of it.\nConsumer spending makes up about 70 percent of economic activity and is considered an important indicator of how well the economy is doing. \nThe report comes a day after a separate government report found that the economy expanded by 3.7 percent between April and June — a much faster rate than what was originally predicted. \nThese new reports are positive news for the U.S. economy after wild swings in global stock markets over the last week. 1 day Pollsters dumbfounded by Trump The experts agree: They’ve never seen anything like it. Cruz hits Megyn Kelly on 'liberal... Cruz called the Fox News host's immigration question a \"distraction.\" Federal judge blocks Obama’s water... EPA struck a defiant tone, saying the injunction only applies in 13 states. Trump: ‘This isn’t a gun problem,... “Mental illness is a massive problem,” Trump said after Virginia shootings. Trump: ‘I don’t mind’ raising... “You've seen my statements, I do very well, I don't mind paying some taxes... Ricky Martin: Trump makes my '... \"I am surprised that we Hispanics continue to accept these aggressions,\"... NLRB rules against business in... The decision could have broad repercussions for the business world. Trump impersonates Asian... The presidential candidate used broken English to portray Asian people. Ex-HP board member who voted to... Tom Perkins is now calling his vote to oust Fiorina \"a mistake.\" Sanders wants better overnight... The Vermont Independent said he would be introducing legislation on the... Donna Brazile praises Bush’s... “Under President Bush’s leadership, we got it right,” she said on Air... Rand Paul suggests Black Lives... Paul said \"bullying people\" won't help the group get its message out. Slain reporter's father to... “This can’t happen anymore,\" Andy Parker said. Manifesto purportedly sent by... The \"suicide notes\" claim the slayings were a response to the Charleston... Univision CEO attacks Trump for ‘... He called Trump's treatment of Jorge Ramos \"beneath contempt.\" Trump: Univision anchor is a '... Trump said the Univision anchor was \"ranting and raving\" during a press... Petition urges retailer to pull '... A Caitlyn Jenner costume is also facing criticism, two months before... Conservative group releases... The Clinton campaign went on high alert after reports of suspicious... Obama: Shooting ‘breaks my heart’ “It breaks my heart every time you read or hear about these kinds of...", "external_links": [], "published": "2015-08-28T18:33:00.000+03:00", "crawled": "2015-08-29T05:18:14.228+03:00", "highlightTitle": ""}