{"organizations": [], "uuid": "af27b66dcf206035efca5995beffee4ff4520792", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/yoga03815.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/after-yoga-climb-a-tree-to-boost-your-memory/42995.html", "country": "IN", "title": "After yoga, climb a tree to boost your memory", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "After yoga, climb a tree to boost your memory", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T16:34:00.000+03:00", "replies_count": 0, "uuid": "af27b66dcf206035efca5995beffee4ff4520792"}, "author": "IANS", "url": "http://www.moneylife.in/article/after-yoga-climb-a-tree-to-boost-your-memory/42995.html", "ord_in_thread": 0, "title": "After yoga, climb a tree to boost your memory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » After yoga, climb a tree to boost your memory 42995 After yoga, climb a tree to boost your memory 0 Comments, Be the first to comment + COMMENT IANS | 03/08/2015 07:04 PM | You may have attempted this during childhood but climbing a tree and balancing on a beam along with yoga exercises can dramatically improve cognitive skills in adults too, researchers at the University of North Florida have found. By doing activities that make us think, we can exercise our brains as well as our bodies, they said. “By taking a break to do activities that are unpredictable and require us to consciously adapt our movements, we can boost our working memory to perform better in the classroom and the boardroom,” said research associate Dr Ross Alloway. The results suggest that working memory improvements can be made in just a couple of hours of these physical exercises. “Improving working memory can have a beneficial effect on so many areas in our life. It is exciting to see that 'proprioceptive dynamic activities' can enhance it in such a short period of time,” added study co-author Tracy Alloway. For the study, researchers recruited adults ages 18 to 59 and tested their working memory. Proprioception, the awareness of body positioning and orientation, is associated with working memory. One group was given dynamic activities while the other were asked to join yoga classes, defined as “static proprioceptive activities”. The participants undertook activities like climbing trees, walking and crawling on a beam approximately three-inches wide, moving while paying attention to posture, running barefoot, navigating over, under and around obstacles, as well as lifting and carrying awkwardly-weighted objects. After two hours, participants were tested again. The researchers found that their working memory capacity had increased dramatically by 50 percent. “Proprioceptively dynamic training” may place a greater demand on working memory because as environment and terrain changes, the individual recruits working memory to update information to adapt appropriately. “Though the yoga control group engaged in activities that required awareness of body position, it was relatively static as they performed the yoga postures in a small space which did not allow for locomotion or navigation,” the authors noted. However, neither control group experienced working memory benefits. The paper was published in the journal Perceptual and Motor Skills. More in Moneylife", "external_links": [], "published": "2015-08-03T16:34:00.000+03:00", "crawled": "2015-08-03T16:42:59.229+03:00", "highlightTitle": ""}