{"organizations": ["New York Times Sue Nordman"], "uuid": "0e6df3e2c446c057923f78eccd511adff0125653", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/08/21/102938527-RETIRE_TRANSITION_2.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/21324894/device/rss/rss.xml", "section_title": "Personal Finance", "url": "http://www.cnbc.com/2015/08/21/as-workers-delay-retirement-some-bosses-become-more-flexible.html", "country": "US", "title": "Is delayed retirement giving rise to kinder bosses?", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "Is delayed retirement giving rise to kinder bosses?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T21:31:00.000+03:00", "replies_count": 0, "uuid": "0e6df3e2c446c057923f78eccd511adff0125653"}, "author": "", "url": "http://www.cnbc.com/2015/08/21/as-workers-delay-retirement-some-bosses-become-more-flexible.html", "ord_in_thread": 0, "title": "Is delayed retirement giving rise to kinder bosses?", "locations": ["Maine", "Dexter"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Craig Dilger", "Kerry Hannon", "Erda Handbags"], "text": "As Workers Delay Retirement, Some Bosses Become More Flexible Kerry Hannon SHARES Craig Dilger | The New York Times Sue Nordman, owner of Erda Handbags, works a pattern at the company's production facility in Dexter, Maine, Aug. 4, 2015. \nCorliss Fanjoy is turning 65 this year, but she is not ready for retirement. And at a small handbag maker in Maine, where Mrs. Fanjoy spends her working hours cutting intricate patterns in leather, she is not alone. \nMost of her co-workers are over 55. One of them is her boss, Susan Nordman, 60, who bought the then-struggling company, Erda, based in Dexter, in 2013. She inherited a mostly older work force; Ms. Nordman was determined to keep those workers on the job. \n\"Preserving critical knowledge is vital to the longevity of any business,\" she said. \"The skills that my employees possess require hands-on learning. With time and training, new workers can learn these skills, but only if someone is there to teach them. \nRead more from the New York Times : Topless in Times Square: A legal view \n\"Yes, you have to accommodate older workers' needs,\" Ms. Nordman added, \"but they're an asset, and you have to take care of an asset.\" \nOne way that Ms. Nordman has been able to retain her older workers is by offering more flexible work arrangements. \n\"At Erda, everyone has a key to the office, so workers can work the hours that fit their needs,\" she said. \"Some elect to come as early as 5:30, and others work nine-hour days and take a half day on Friday. I've always felt the more autonomy that you give someone, the better job they're going to do.\" \nRead More Build a better retirement income strategy \nThe extra effort has paid off, according to Ms. Nordman. This year, the company, which sells to about 700 stores, will produce nearly 16,000 bags, up from 9,000 in 2013. Erda, she said, is now turning a profit. \nAs more workers like Mrs. Fanjoy are saying no to a traditional retirement, more employers are informally introducing flexibility into their schedules or allowing employees to step slowly out of the work force with a phased retirement arrangement. It can be a win-win for both. But there are plenty of challenges to overcome. <p>5 things you don&#039;t know about your 401(k)</p> <p>Investing in a 401(k) is vital for us to make sure we are set for the future but here are some things you may have not known about your 401(k). CNBC&#039;s Landon Dowdy zeros in on what you need to know.</p> \nFrom 1985 to 2014, the rate of participation in the labor force for people 65 to 69 increased to almost 32 percent from about 18 percent, according to the Bureau of Labor Statistics. \n\"That's a whopping increase,\" said Sara E. Rix, a former senior adviser with the AARP Public Policy Institute. \"Even at the oldest ages — 75 and above — people are more likely to be in the labor force today than they were 20 or 30 years ago.\" \nDelayed retirement is a consideration for an array of reasons, but for many people, money is the fundamental factor. \"Financial necessity dictates the need to work for most of my older workers,\" Ms. Nordman said. \nIn June, the Senate Special Committee on Aging held a hearing to investigate the topic: \"Work in Retirement: Career Reinventions and the New Retirement Workscape.\" Senator Susan Collins, a Republican from Maine and the chairwoman of the committee, has been a leading voice advocating the value of older workers. \nRead More Unclaimed assets on the rise—are you missing money? \n\"The face of our nation's work force is changing,\" Senator Collins said. \"I think we're facing a tsunami of retirees who will find that they are going to outlive their savings, that they have not prepared for their retirement.\" \nMs. Nordman, Ms. Rix and James C. Godwin Jr., vice president of human resources at the nonprofit Bon Secours Virginia Health System, testified at the hearing. (In full disclosure, I also spoke at the hearing, after being invited to testify on my views of the challenges Americans who work into their 60s and 70s may face and the value that older workers can add to the workplace.) \nAlthough having flexible work schedules and phased-in retirement programs is popular with workers, employers have been slower to adopt them in a formal way. \nThe good news is that a majority of employers with 50 or more employees do offer flexible work options to some of their workers. But few do for all. \nRead More How employers can boost retirement savings \nWith labor still relatively plentiful, most employers don't feel compelled to do so. \"They simply don't want another benefit that may be subject to laws and regulations, as a formal program probably would,\" Ms. Rix said. \"Employers want to keep certain workers, but they don't want to offer a new benefit to everybody, and in fact, they probably couldn't. It can be expensive from both an administrative and benefits perspective.\" \nBon Secours Virginia Healthcare System, a nonprofit organization based in Richmond, Va., with more 13,000 employees, is a good example. \"Phased retirement isn't a specific program that one enrolls in,\" Mr. Godwin said. \"Rather, it is a corporate philosophy built on workplace flexibility and a willingness to accommodate workers' needs in a way that also benefits our ministry.\" \nBon Secours employees can gradually work fewer hours or step down to less demanding positions. That typically results in a drop in salary, but they can start drawing their retirement benefits to help maintain their income. Employees can also keep their employer-provided health insurance benefits as long as they are working at least 16 hours a week. \nThe federal government has plans to ease the transition to retirement for its older workers. But the program is off to a halting start. \nRead More What disability, pensions mean for Social Security benefits \nThree years ago, Congress approved legislation for an employee phased retirement program. Under the program, federal workers who take phased retirement work 20 hours a week and agree to mentor other workers. During that time, they receive half their pay and half their retirement annuity payout. When workers retire completely, their annuities will include an increase to account for the part-time service. \nAgencies could start accepting applicants last autumn, but it is not mandatory and those that introduce it are able to limit the jobs that are eligible and how long someone can retain a partial retirement status, among other options. And some agencies, including the United States Postal Service, have announced that they will not adopt the program now. <p>How to build a better retirement income strategy</p> <p>This strategy can give you a consistent stream of income in retirement while protecting you against rising interest rates. Find out how.</p> \nSometimes it takes more than flexible hours to hold on to older workers. Ms. Nordman focuses on flexible bodies, too. Every morning at 10, Erda's employees gather for a gentle qigong exercise session. \n\"It gets everyone moving, stretching and spines rotating,\" Ms. Nordman said. \"The women tend to get almost hyper-focused on their work.\" Once-a-month massage sessions paid for by the company also help to ease tight shoulders. \nShe also modernized the equipment to make it more ergonomic. The new equipment allows her workers to sit more of the time, rather than stand, and it reduces repetitive motion, which is a huge savings on joints. \nDisproving stereotypes about older workers being slow to learn new ways of doing things, Ms. Nordman has found that learning has nothing to do with age. \n\"My older workers embrace new methods quickly and easily,\" she said. \"When I added a French seam to a design, we all gathered round the computer and watched a YouTube video to see how it was executed. The older staff picked it up immediately.\" \nMs. Rix argues that far more attention needs to be paid to older worker training and retraining than in the past. \n\"I worry about tomorrow's generation of older workers ending up just as badly off as some of today's older workers are if we don't start thinking about expanding work life and what that means for lifelong learning,\" she said. SHOW COMMENTS", "external_links": [], "published": "2015-08-21T21:31:00.000+03:00", "crawled": "2015-08-22T00:17:10.367+03:00", "highlightTitle": ""}