{"organizations": [], "uuid": "04cdd9ada85c1dd6079b9548634bbbfb70edc294", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-credit-cards/?format=rss", "section_title": "Credit Card News | Reviews | Advice - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/money-manners-socially-acceptable-084901461.html", "country": "GB", "title": "Are your money manners socially acceptable?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Are your money manners socially acceptable?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T11:49:00.000+03:00", "replies_count": 0, "uuid": "04cdd9ada85c1dd6079b9548634bbbfb70edc294"}, "author": "", "url": "https://uk.finance.yahoo.com/news/money-manners-socially-acceptable-084901461.html", "ord_in_thread": 0, "title": "Are your money manners socially acceptable?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Aug 18, 2015, 11:03 BST - UK Markets close in 5 hrs 27 mins Are your money manners socially acceptable? By Katie Morley | Telegraph – 1 hour 14 minutes ago 46.55 0.00 \nPeople's attitudes toward their own - and other people's - money are changing. Would you ask a friend about their salary? Take our poll and test your money manners \nMoney has always been a sensitive topic of conversation. \nBut British attitudes towards the financial \"do's\" and \"don'ts\" are rapidly evolving. Some of the established \"money etiquette\" has now become inappropriate. \nLikewise, attitudes which in the past would have been considered rude or intrusive are now commonplace - and accepted. \nBut where to draw the line? What exactly is the difference between the generally acceptable and the frankly embarrasing? \nTake part in our poll to find out how your financial attitudes compare with other Telegraph readers: \n= 1. Haggling in high street stores = \nTraditionally, bartering has been a borderline-rude tactic reserved for market stalls in foreign countries. Not something polite British shoppers practise in high street stores. But times are changing. \nShoppers have grown hungrier for bargains, and well-known shops such as Carphone Warehouse, Currys, Homebase and John Lewis have started to accomodate those brave enough who ask for a discount. Savings (Shenzhen: 300056.SZ - news ) -guru Martin Lewis has claimed customers are having surprisingly high success rates in some of these shops. \nBut in stores where prices are advertised as fixed, shoppers are now left to decide between causing a potentially embarassing scene to save a few pounds, or choosing to get on with their shopping as they have always done, knowing they might have paid over the odds. \n= 2. Talking about who earns what = \nAn age-old rule of social etiquette is that one should not discuss one's salary. \nIn decades gone by, before joint bank accounts, it was common for husbands not to tell even their wives how much they earned. \nBut today, with increasingly pressure for companies to disclose staff wages, as well as rows about public sector pay fimly in the public eye, our earnings have become a political hot topic - as well as a talking point at parties. \nBut it remains controversial. Where do you stand? \n= 3. Asking parents for money = \nIt (Other OTC: ITGL - news ) 's no secret that people in their twenties, thirties and forties today seem to be having a hard time financially. \nYounger adults are saddled with huge debts from university and massive housing costs. Older offspring, in their forties, have vast mortgages and are unable to upsize their property to accommodate children. \nThis creates a dilemma between adult children and their parents. Most parents want to help, but they need to think carefully about not sacrificing their own security. \n= 4. Using discount vouchers = \nThe past five years have seen the meteoric rise in the popularity of discount voucher codes. Sites like Groupon (NasdaqGS: GRPN - news ) and Wowcher offer everything from fine dining, to DIY equipment, to teeth whitening, all at big discounts. \nFor shoppers on a budget it's brilliant. \nMany people find the best thing about buying with a voucher is that no-one has to know you didn't pay full price. \nBut a dilemma lies in that many of the best deals are for things you might do as a group of friends - such as a meal out or a birthday gift - which makes the fact you've got something \"on the cheap\" much more difficult to hide. \nBargains are currently in fashion, but no-one wants to look like a stinge when they're supposed to be treating their friends and family. Where to draw the line? \n= 5. Paying with 1p and 2ps = \nEvery couple of years in the UK the debate around whether to scrap 1p and 2p coins is reignited. \nAs prices rise they have become increasingly worthless. \nThe dilemma people have is how to get rid of them. You'd need a lot of 1p and 2p coins to buy even a chocolate bar these days. As well as weighing down your wallet, you might worry that paying with shrapnel could cause an awkward situation at the supermarket till, with much tut-tutting in the queue behind you. \nAs a result some people even admit to chucking small change in the bin - while others hoard them at home with the hope of one day finding time to take them down the bank. \n= 6. Asking for money instead of presents = \nGiving and receiving presents is supposed to be a joy - but is the art of present giving dying out? \nThese days, requesting money instead of presents is becoming more common among adults - at birthdays, Christmas and even weddings. In a bid to avoid the deluge of unwanted toastie makers, fondue sets and tacky garden ornaments, a growing number of couples planning a wedding are asking guests for cash donations - rather than gifts. \nThis is leaving the present-givers among us to question what to do for the best. \n= 7. Bragging about spending or saving = \nThe things people buy - or at least the things they are seen to be buying - have always played a part in defining their social status. \nBut for some, the buzz of letting others know how much they've splashed out is wearing off. They are now pursuing a different thrill: buying these prestigious items at bargain prices - and bragging about their savings. \nImagine the scene. A dinner party at which the host proudly serves Aldi smoked salmon, while the guests express shock that it's not from M&S, Waitrose or the local deli. They also gasp with approval after being told the charming Wedgwood crockery it's served on was picked up for £2 in a charity shop. \nBut the question remains - do our friends now respect us more for the bargains or the splurges? \nTell us your views by posting in the comments below or emailing: katie.morley@telegraph.co.uk", "external_links": [], "published": "2015-08-18T11:49:00.000+03:00", "crawled": "2015-08-18T13:03:23.061+03:00", "highlightTitle": ""}