{"organizations": [], "uuid": "fe09bb208c37090ae8085dca97b91d8ee09bce90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.3news.co.nz", "main_image": "http://cdn.3news.co.nz/3news/AM/2015/8/16/af0092a1-29e4-4d72-9878-add38d06d442/Poia-1200.jpg", "site_section": "http://feeds.feedburner.com/co/hYAN", "section_title": "Business / Finance news", "url": "http://www.3news.co.nz/opinion/opinion-heart-pain-2015081613", "country": "NZ", "title": "Opinion: Heart pain", "performance_score": 0, "site": "3news.co.nz", "participants_count": 0, "title_full": "Opinion: Heart pain", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T15:44:00.000+03:00", "replies_count": 0, "uuid": "fe09bb208c37090ae8085dca97b91d8ee09bce90"}, "author": "", "url": "http://www.3news.co.nz/opinion/opinion-heart-pain-2015081613", "ord_in_thread": 0, "title": "Opinion: Heart pain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sunday 16 Aug 2015 1:44 p.m. \nPoia Strickland-Laumemea \nBy Paula Penfold and Eugene Bingham \nIt's an unusual feeling knowing you'll never get to meet the person right at the heart of your story, the person the whole story is about, especially when that person is a larger-than-life character. \nBut it would have been impossible for us to have come away from filming with the Strickland-Laumemea family without feeling that we had somehow got to know their much-adored wife, mother, sister and aunt – Poia. \nA Porirua social worker, family matriarch and highly respected member of the Rarotongan community, Poia lives on in the hearts of the thousands of people whose lives she touched. \nThree years ago, aged just 51, she went to Wellington Hospital by ambulance one Sunday afternoon suffering chest pains and shortness of breath. About 12 hours later she was dead. \nIn between times, she was let down, dismally. Our story, Heart Failure , set out what happened. \nIt's important to say that not for a moment would it have been the case that any of the doctors, nurses or other health professionals involved would have wanted to cause harm or distress. They're all hard-working people who work under the strain of a health system restricted by limited resources, doing the best they can. \nBut in terms of how the family has been treated since Poia's death, you have to wonder if the powers that be understand the impact her death has had. \nHere's one small example. Desperate for answers, the family, led by Poia's oldest child, Paula, laid a complaint with the Health and Disability Commissioner. A few weeks back, when the commissioner's office published an anonymous version of its damning report, the story was picked up by the Dominion Post newspaper. There on the front page the Capital and Coast District Health Board was reported as saying it had apologised to the family. \nNope, not directly. \nRight then, the family had received no apology or acknowledgement from the DHB. \nSometime later, a letter arrived. It talks about the \"sub-optimal care\" provided to Poia. It says how they \"acknowledge there were delays\". It recognises the \"significant distress\". \nAnd at the end of a long paragraph in the middle of the letter it says this: \"I unreservedly apologise to you and your family for these failings.\" \nAt the bottom of the page, the DHB offered to meet the family if it wished. \nBy this stage, the Strickland-Laumemea family had approached us for help in highlighting Poia's story. In part, they wanted accountability for what happened; they also wanted a way to encourage other families to speak up – loudly – if they felt their loved ones were being ignored in hospital. \nThe offer of the meeting was tempting to the family – there were questions they wanted answering. But, as Poia's daughter, Paula, put it, by that stage they simply didn't trust the DHB. \nSo they asked if we could help. We approached the DHB offering to facilitate a meeting on the family's behalf. Yes, of course, we would prefer if we could film it. \nThe immediate answer came back that the clinicians did not want to be filmed. Fair enough. So we offered to come along to the meeting merely as support, without cameras. \nAt this point, the DHB made direct contact with the family – the first time this had happened in three years. There was a phone call out of the blue one Friday to Paula and then they sent an email imploring the family to reject the idea of having us at any meeting. \n\"My experience of media involvement is that they are very selective in what they report and the slant that they take,\" said an email. \"This is not conducive to open communication and would be an impediment to you receiving the information you are seeking.\" \nEr, what possible \"slant\" could you put on this case? Poia died in a hospital emergency department where there had been a \"serious departure from accepted standards\". \nIt doesn't get much worse. \nAnd yet to the family, the DHB's response over the meeting once again made them feel disempowered. As Paula put it at the time: \"My gut is fuming with hurt and feeling as if we aren't being listened to.\" \nBut the DHB was adamant. And so the family has had to hire a lawyer to try and arrange a meeting they feel safe enough to attend. Yes, that means it's costing them money, money they should not have to be spending. \nWe asked the DHB for an interview, repeatedly. But in the end, it declined, saying it did not wish to do so \"out of respect to the family\". \nSeriously? \nSo, let's be clear: this story is proudly brought to you out of the deepest respect for Tera'i-Poia Strickland-Laumemea; for her husband, Anitelea Laumemea; for her daughters, Temehari Paula and Tera'i Ake; her son Andre-Jospeh; her son-in-laws Amani Natoealofa and Simaota Magele; her grandchildren Teriifaaotua Losalio Natoealofa and Sammy Magele; and all her amazing siblings, cousins, nephews and nieces. \nIt was a privilege to meet you all. We hope that you finally get the respect you, and Poia, deserve.", "external_links": [], "published": "2015-08-15T15:44:00.000+03:00", "crawled": "2015-08-16T05:34:39.191+03:00", "highlightTitle": ""}