{"organizations": [], "uuid": "4a986c433a76d28eac8eaf942b2170d01f417a9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/4c0PqVVshlVtkCq9a2hYjw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/US_AHTTP_AP_HEADLINES_BUSINESS/e37ff0e2268f1b26800f6a706700901a_original.jpg", "site_section": "https://au.finance.yahoo.com/news/category-commodities/?format=rss", "section_title": "Commodities Market News - Yahoo!7 Australia Finance", "url": "https://au.finance.yahoo.com/news/latest-us-stocks-gains-heading-194817164.html", "country": "US", "title": "The Latest: US stocks give up gains heading into the close", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "The Latest: US stocks give up gains heading into the close", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T22:48:00.000+03:00", "replies_count": 0, "uuid": "4a986c433a76d28eac8eaf942b2170d01f417a9a"}, "author": "", "url": "https://au.finance.yahoo.com/news/latest-us-stocks-gains-heading-194817164.html", "ord_in_thread": 0, "title": "The Latest: US stocks give up gains heading into the close", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \nA fund manager looks at screens displaying activities of shares on the French Stock Exchange, in a financial analysis office in Paris, France, Tuesday, Aug. 25, 2015. Chinese stocks fell Tuesday for a fourth day, hitting an eight-month low amid signs Beijing was no longer buying shares to stem a price slide, and Japanese stocks also dropped. But other Asian and European markets bounced back from a day of heavy losses.(AP Photo/Francois Mori) \nNEW YORK (AP) -- The latest on the global financial market turmoil (all times local): \n___ \n3:42 p.m. \nU.S. stocks are giving up the gains shortly before the market close after a day in which they surged back on an interest-rate cut by China's central bank. \nThe Dow Jones industrial average was up three points, or 0.1 percent, at 15,886. The Standard & Poor's 500 index gained one point, or 0.1 percent, to 1,895. The Nasdaq composite rose 39 points, or 0.9 percent, to 4,565. \n___ \n3:04 p.m. \nThe price of oil logged its biggest gain in more than two months, as it rebounded from its lowest closing level in more than six years. \nThe price of U.S. crude rose $1.07, or 2.8 percent, to $39.31, its biggest one-day gain since June 9. Brent crude, a benchmark for international oils used by many U.S. refineries, gained 52 cents, or 1.2 percent, to $43.21. \nNatural gas and heating oil prices also rose, and wholesale gasoline dropped. \n___ \n2:13 p.m. \nU.S. stocks are paring their gains, after surging in early trading on news that China had cut interest rates to shore up its economy. \nThe Dow Jones industrial average rose 213 points, or 1.4 percent, to 16,088 as of 2: 18 p.m. Eastern time. It was up as much as 430 points earlier in the day. \nThe Standard & Poor's 500 index is up 27 points, or 1.5 percent, at 1,920 and the Nasdaq composite index gained 105 points, or 2.3 percent. \nMetals have closed for the day; \nGold fell $15.30 to $1,138.30 an ounce. Silver dropped 15.2 cents to $14.61 an ounce. Copper rose 5.5 cents to $2.31 per pound. \n___ \n12:01 p.m. \nU.S. stocks are sharply higher in midday trading after China's central bank cut its key interest rate in a bid to boost growth in the world's second-largest economy. Concerns over a slowdown in China's economy rattled global markets on Monday. \nThe Dow Jones industrial average was up 333 points, or 2.1 percent, at 16,204 as of 12:01 p.m. Eastern Tuesday. The Standard & Poor's 500 index rose 43 points, or 2.2 percent. The Nasdaq composite gained 141, or 3.1 percent, to 4,668. \nOil also rose, but was still trading below $40 a barrel. \nTreasury notes fell, pushing up the yield on the 10-year benchmark note to 2.10 percent. \nBest Buy's stock surged 14 percent after it reported earnings that handily beat analysts' estimates. The consumer electronics chain benefited as shoppers picked up major appliances, large screen televisions and mobile phones. \n___ \n11:14 a.m. \nThe New York Stock Exchange invoked a rarely-used rule both on Monday and Tuesday to help ensure a smoother open to the stock market. \"Rule 48\" allows designated market-makers to forgo their obligation to circulate price indications before the opening bell. It is only used when there is the potential for extreme market volatility. \n___ \n10:13 a.m. \nStocks stay higher in the U.S. after a report shows that Americans stepped up their purchases of new homes in July, with sales surging in the Northeast. \nThe Commerce Department says new-home sales rose 5.4 percent last month to a seasonally adjusted annual rate of 507,000, recovering from a slide in purchases in June. \nAll 10 sectors in the S&P 500 index are higher, led by gains for technology stocks. \n___ \n9:30 a.m. \nU.S. stocks jumped at the open after China's central bank cut interest rates to support its economy. \nThe Dow Jones industrial average rose 296 points, or 1.9 percent, to 16,180.61, as of 9:45 a.m. Eastern time. The Standard & Poor's 500 index climbed 38 points, or 2 percent, to 1,932. The Nasdaq composite rose 109 points, or 2.4 percent, to 4,635. \nOil prices are up, but U.S. crude is still trading below $40 a barrel. \nTreasury notes are falling, pushing up the yield on the 10-year benchmark not to 2.08 percent. \nBest Buy was the biggest gainer in the S&P 500 index. The stock surged 16.4 percent after its fiscal second-quarter results handily beat analysts' estimates as shoppers picked up major appliances, large screen televisions and mobile phones \n___ \n8:30 a.m. \nChina's interest rate cuts will not be enough to ease concerns about the country's economy, says Kamel Mellahi, professor at Warwick Business School in Britain. \n\"The Chinese economy is going to be on this bumpy road for a while and it will have ebbs and flows that will no doubt have a serious impact on the global economy,\" he says. \nThe Chinese central bank cut its key interest rate and deposit rate on Tuesday after its main stock market plunged for a fourth day. The move boosted markets around the world. \nMellahi says that while the rate cuts may buoy markets in the short-term, the underlying causes of investors' concerns — the slowdown in the Chinese economy — will last for some time. \n___ \n8:00 a.m. \nWall Street futures are rallying further after China's central bank cut interest rates to support its economy. \nDow futures are up 600 points, or 3.8 percent, while the broader Standard & Poor's 500 futures are up 72.8 points, or 3.9 percent. \nThe jump follows a stomach-churning day on Monday, when the Dow plunged more than 1,000 points at one point before finishing down 588.40 points, or 3.6 percent. The Standard & Poor's 500 index slid 77.68 points, or 3.9 percent, into \"correction\" territory — jargon for a drop of at least 10 percent from a recent peak. The last market correction was nearly four years ago. @y7finance on Twitter, become a fan on Facebook Related Headlines", "external_links": [], "published": "2015-08-25T22:48:00.000+03:00", "crawled": "2015-08-25T23:33:36.381+03:00", "highlightTitle": ""}