{"organizations": [], "uuid": "c7987e0cd45286b2ae9d8d6561e489f6d9e2bbdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/i/d/h/g/image.related.afrArticleLead.620x365.gior3u.png/1438611409649.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/technology/senate-committee-says-bitcoin-should-be-treated-as-a-regular-currency-20150731-gior3u", "country": "AU", "title": "Senate committee says bitcoin should be treated as a regular currency", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Senate committee says bitcoin should be treated as a regular currency | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T22:15:00.000+03:00", "replies_count": 0, "uuid": "c7987e0cd45286b2ae9d8d6561e489f6d9e2bbdc"}, "author": "afr.com", "url": "http://www.afr.com/technology/senate-committee-says-bitcoin-should-be-treated-as-a-regular-currency-20150731-gior3u", "ord_in_thread": 0, "title": "Senate committee says bitcoin should be treated as a regular currency", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senator Sam Dastyari urges the states to work with the Commonwealth to change GST rules for bitcoin and digital currencies. Fiona Morris by Paul Smith Jessica Sier A Senate inquiry has found bitcoin and other cryptocurrencies should be recognised as a regular currency for Goods and Services Tax purposes, overturning an earlier Australian Taxation Office ruling that classifies it as an \"intangible asset,\" and providing incentive for start-up bitcoin operators to stay in the country.\nThe Senate Economics References Committee into digital currency, which was chaired by Labor Senator Sam Dastyari, is expected to make the recommendation when the completed report is tabled in the Senate this week. It will be seen as a major boost to the local bitcoin industry, which was hit hard by the July 2014 ATO ruling, as it meant transactions are hit by GST and are also subject to capital gains and fringe benefits tax.\nThe ATO ruling meant a number of emerging companies, which were trying to forge their way in the unregulated and highly volatile new arena of cryptocurrencies, decided to relocate to countries with more progressive regimes.\nThe GST change is the most notable recommendation to emerge from the wide-ranging review, which was kicked off in October 2014, to look at issues facing the regulation and governance needed around bitcoin.\nFounder of bitcoin trading company Digital CC, Zhenya Tsvetnenko, says the current tax treatment of bitcoin is the chief barrier to growth and innovation for digital currency in Australia. Aaron Bunch It received 48 submissions and heard evidence from organisations including the Reserve Bank of Australia, Westpac Banking Corporation, The Australian Bankers' Association, The Australian Federal Police, The Australian Crime Commission and the ATO at three public hearings.\nThe committee has found that further investigation will be needed before bitcoin can be fully regulated by the likes of the RBA and the Australian Securities and Investments Commission, something that big four banks have indicated will be required before they consider offering customers the possibility of banking their bitcoins.\n'Simple change' Other committee recommendations are understood to include the need to further investigate how bitcoin is treated for income tax and FBT purposes; the creation of a digital economy taskforce to conduct greater examination of how bitcoin is being used and its related risks for regulation purposes; and also a move to insist that anti-money laundering and counter-terrorism financing regulations are applied to bitcoin exchanges.\n Senator Dastyari told The Australian Financial Review the states did not stand to lose a great amount of revenue from changing the GST rules for bitcoin and digital currencies, and that resultant benefits should help sway any resistance to change.\n\"The amount of revenue in question is negligible. The opportunities for trade, investment, high salaries and world-leading skills are far more important, and I urge the states to work with the Commonwealth to make what amounts to simple change,\" Senator Dastyari said.\n\"Without a doubt, the main benefit will be the confidence and certainty that removing a GST will provide to our own digital entrepreneurs, and the foreign businesses who want to set up here … The Treasury ministers need to work with the states to make the changes necessary to bring our legislation into the 21st century.\"\nThe changes would certainly bring Australian tax treatment closer to that of the United Kingdom, which had originally classified virtual currencies as gift vouchers and charged a 20 per cent value-added tax. The UK changed its approach and exempted digital currencies from VAT in March 2014.\nIn December 2014, Australia's biggest cryptocurrency platform, Coinjar, relocated its headquarters to the UK in a bid to avoid GST charges on bitcoin transactions. Its chief executive, Asher Tan, said the issue had hit the Australian bitcoin market hard, and that several companies were forced to downsize or shut down completely.\n\"If it is defined as a global currency, this would be a positive step to encourage the bitcoin market to continue innovating. The Australian bitcoin market will significantly improve,\" Mr Tan said.\n'Exciting development' Founder of ASX-listed bitcoin trading company Digital CC, Zhenya Tsvetnenko, said the current tax treatment of bitcoin was the chief barrier to growth and innovation for digital currency in Australia and a change would provide a major boost to the industry.\n\"If the definition of bitcoin under tax law were changed from a commodity to a currency, it would be a very exciting development,\" Mr Tsvetnenko said.\nSenator Dastyari said he believed Australia still had the time to establish itself as a global leader at the forefront of change in global attitudes towards digital currencies, and that the country shouldn't risk being left behind by failing to investigate all the opportunities.\nHe said he believed the changes proposed by the Senate committee would cause a relatively small, but symbolically significant shift to the broader future economy.\n\"Most importantly, it will send the message to local tech entrepreneurs that their government is listening to them, and that in itself is a major step forward,\" Senator Dastyari said.\n\"We have been contacted by many young Australians in the global tech industry who have told us they would love to come home to work in this field.\"", "external_links": ["https://s3-ap-southeast-2.amazonaws.com/sasha-project/afr-prod/2015/08aug/bitcoins_gst_hype/index.html", "https://sasha-project.s3.amazonaws.com/afr-prod/archive/responsiveJSV2/pym.min.js"], "published": "2015-08-03T22:15:00.000+03:00", "crawled": "2015-08-03T20:05:50.566+03:00", "highlightTitle": ""}