{"organizations": [], "uuid": "c7d6951a206499fbdb771715cba735b7eb41e8bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/gR8LAJ4uam_hfNipzuJ6.w--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/FIN_ANZ_AAP_ART_FTP_LIVE_1/3014956_28Aug_RBA_1280x720_original.jpg", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/economic-growth-solve-budget-woes-050506446.html", "country": "GB", "title": "Economic growth will solve budget woes:RBA", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Economic growth will solve budget woes:RBA", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T08:05:00.000+03:00", "replies_count": 0, "uuid": "c7d6951a206499fbdb771715cba735b7eb41e8bc"}, "author": "", "url": "https://au.finance.yahoo.com/news/economic-growth-solve-budget-woes-050506446.html", "ord_in_thread": 0, "title": "Economic growth will solve budget woes:RBA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View Photo \n\nReserve Bank boss Glenn Stevens believes the budget debate should focus on how to increase tax revenue by lifting economic growth, rather than the distribution of the proceeds. \nMr Stevens told the National Reform Summit in Sydney that despite record low interest rates and business and consumer confidence staying around average, economic growth has not been able to get to three per cent. \n\"It may be that potential growth is a bit lower than we used to think though I don't think we can know whether that is so at present,\" he said. \nHe said the challenge of setting a federal budget that is fair for all gets easier when there is more tax revenue. \n\"The fiscal policy debate, usually framed as when will we get back to surplus? is actually about: how do we get more growth?\" he said. \n\"Other discussions, so often framed as about fairness that is income distribution might be better framed as: how do we grow the pie?\" \nMr Stevens said that the most people understand that economic policy is about increasing economic growth on a sustained basis and that most budget measures to improve growth are only short term solutions. \n\"The kind of growth we want won't be delivered just by central bank adjustments to interest rates or short-term fiscal initiatives that bring forward demand from next year, only to have to give it back then,\" he said. \n\"A key question worth asking is: how do we generate more growth? Not temporary, flash-in-the-pan growth, but sustainable growth.\" \nThe conference Mr Stevens was speaking at was also attended by Treasurer Joe Hockey and Opposition Leader Bill Shorten as well as business and union leaders. \nJP Morgan Australia chief economist Stephen Walters said the RBA governor in his speech was essentially asking for help in getting the economy going. \n\"Interest rates cuts can do only so much by encouraging demand to be dragged forward from future periods, but he wants sustainable sources of expansion,\" Mr Walters said. \n\"There are no direct implications for the policy outlook in today's comments but, at a stretch, a case could be made that the governor still sounds pretty content with current policy settings.\" \nThe RBA has cut the cash rate twice this year, in February and May, to a new record low of two per cent. @y7finance on Twitter, become a fan on Facebook Economic growth will solve budget woes:RBA AAP \nReserve Bank boss Glenn Stevens believes the budget debate should focus on how to increase tax revenue by lifting …", "external_links": [], "published": "2015-08-26T08:05:00.000+03:00", "crawled": "2015-08-26T08:23:39.693+03:00", "highlightTitle": ""}