{"organizations": [], "uuid": "29f6855f5a50d3aaefdc2a5606fd56cd1a3ed6d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/05/15/102682666-469716780.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss/rss.html", "section_title": "Finance", "url": "http://www.cnbc.com/2015/08/27/carnage-made-these-tech-stocks-cheap-says-analyst.html", "country": "US", "title": "Carnage made these tech stocks cheap, says analyst", "performance_score": 0, "site": "cnbc.com", "participants_count": 3, "title_full": "Carnage made these tech stocks cheap, says analyst", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 2, "uuid": "9983056629610b9d6a8f12f5a174b49eda3e95dc"}, "author": "Anita Balakrishnan", "url": "http://www.cnbc.com/2015/08/27/carnage-made-these-tech-stocks-cheap-says-analyst.html#post-0", "ord_in_thread": 0, "title": "Carnage made these tech stocks cheap, says analyst", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Netflix not in our top 5: Pro\nYoussef Squali, Cantor Fitzgerald global head of Internet and media research, discusses the future of big media names like Alibaba and some of the top names to own.\nWith numerous analysts highlighting \"FANG\" stocks— Facebook , Amazon , Netflix and Google —as technology trades to buy on the stock market's latest dip, one analyst took a different stance.\n\"Yesterday, you were able to buy Alibaba at below the IPO price,\" Youssef Squali, Internet company analyst at Cantor Fitzgerald said Thursday on CNBC's \"Squawk Alley.\" \"Which we always think is a great price to own a strong franchise like that.\"\nFor Squali, Facebook, Amazon and Google are in the top five tech stocks to buy amid the carnage—but instead of Netflix, he's eyeing Chinese e-commerce giant Alibaba and travel-booking company Priceline .\nRead More 5 technology stocks to buy at a discount\nThough a steep stock selloff Monday followed fears surrounding China's growth, Alibaba remains a strong pick based on market dominance, growth in excess of peers, and valuations, he said.\n\"We find concerns about China to be overblown,\" Squali wrote in a note Wednesday night. \"Recent market turmoil appears to have had little impact on retail spending.\"\nWhile online travel company Priceline also does business in China through a local partner, it mainly focuses on getting Chinese travelers abroad, a travel market which shows no signs of weakening, he wrote.\nDespite shares of content-streaming service Netflix trading up almost 7 percent Thursday midday, Squali didn't see the FANG darling as a top buy, because it was still trading at a high valuation compared to the other stocks.\nRead More Priceline—the big US Web company that's figured out China\n\"We do like Netflix over time, we have a buy on it, but it wasn't able to make it into the top list,\" Squali said.\nStill, the recent pullback has caused many companies to come back to more attractive prices, especially among smaller and mid-size companies, he said.\n\"There have been a number of people that have stayed on the sidelines, and this pullback has given them an opportunity to jump in,\" Squali said. \"People are looking at these as good opportunities, probably great opportunities if you look at the next couple of years.\"\nOn Thursday at midday, closely followed technology barometers such as the S&P 500 Information Technology sector were trading up 2.21 percent, and the Nasdaq 100 was trading up 2.46 percent, right in line with the overall indexes.\nRead More FANG snap back pulls tech out of correction territory", "external_links": [], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-28T01:48:57.502+03:00", "highlightTitle": ""}