{"organizations": [], "uuid": "f75e9d1290271b6ca38551ea34525f8a5c686684", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508311391.html", "country": "US", "title": "Kenya: New Kenyan Law to Regulate Oil, Gas Exploration", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: New Kenyan Law to Regulate Oil, Gas Exploration", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T13:33:00.000+03:00", "replies_count": 0, "uuid": "f75e9d1290271b6ca38551ea34525f8a5c686684"}, "author": "", "url": "http://allafrica.com/stories/201508311391.html", "ord_in_thread": 0, "title": "Kenya: New Kenyan Law to Regulate Oil, Gas Exploration", "locations": ["Nigeria", "Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: Fuel Subsidy - Agony of an Oil Producing Nation \nThe county governments are expected to legislate on the establishment of boards of trustees and the prudent utilisation of the funds received, says the Petroleum Exploration and Production Bill, 2015, which is already before parliament. \nThe aim of establishing a sovereign wealth fund is to provide an endowment to support development for the benefit of future generations and develop infrastructure. \nThe Bill further requires the national government to create a conducive environment for exploration of crude oil and natural gas. \nThe model production sharing contract (PSC) has adopted the (R)-factor ratio derived from cumulative hydrocarbons revenues to total costs for sharing of revenue between the government and companies. The R-factor was recommended by the World Bank. \nThe government and exploration firms will each get 50 per cent of revenue from hydrocarbons when the R-factor is less than 1. \nKenya will take 65 per cent of the revenue if the R-factor is equal to or greater than 1 and less than 2.5. The government will get 75 per cent if the R-factor is equal to or greater than 2.5. \nKenya's current PSCs have profit sharing computed on the basis of the first 20,000 barrels of oil per day (bpd). The next level is 30,000bpd, then 50,000 bpd and over 100,000bpd. \nThe new petroleum Bill was prepared by a technical committee of Ministry of Energy after reviewing the Petroleum Exploration and Production Act of 1986 that was deemed oil-centric. \nThe Bill proposes the establishment of the Upstream Petroleum Regulatory Authority (UPRA) and National Upstream Petroleum Advisory Committee (NUPAC). \nAnalysts say that if it is passed, the law will \"de-risk\" Kenya as a hydrocarbons exploration destination, pointing out that the absence of an upstream law has delayed investments. \n\"The greatest value added by the Bill is the creation of institutions to regulate the sector,\" said George Wachira, an oil consultant. \nUPRA will regulate the industry while NUPAC, comprising a panel from the Energy and Finance Ministries as well as the Kenya Revenue Authority, will advise the Energy Cabinet Secretary. \nUPRA will also manage a national data centre for storage, analysis, interpretation and management of petroleum data and information from sedimentary basins and field operations on behalf of the government. \nActing Energy Cabinet Secretary Henry Rotich said that within one year of enactment of the law, UPRA will come into force. The powers and functions of the authority will in the meantime be exercised by the Energy Regulatory Commission. \nThe Bill proposes awarding of exploration blocks through competitive tendering. \nThe proposed law also requires the Cabinet Secretary to develop a framework for reporting, transparency and accountability in the sector. This requires publication of all agreements, records, annual accounts, reports of revenues and fees. \nIt includes taxes, royalties and other charges, relevant data and information support payments made by a contractor and payments received by the national government, county governments and local communities. \nThe Energy Cabinet Secretary will, upon an exploration company declaring a commercial discovery, approve the field development plan, which has to be submitted to Parliament for ratification. Kenya \nTwo people have been killed in chaos that rocked Orange Democratic Movement grassroots elections in Migori County. see more » Copyright © 2015 The East African. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-31T13:33:00.000+03:00", "crawled": "2015-08-31T13:46:02.410+03:00", "highlightTitle": ""}