{"organizations": [], "uuid": "a8fc43520c68b91a09cff28cae7d010b1ba5e099", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/16/eurozone-greece-opposition-idUSL5N10R0MD20150816", "country": "US", "title": "Greek opposition party refuses to back PM in any confidence vote", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Greek opposition party refuses to back PM in any confidence vote | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T23:18:00.000+03:00", "replies_count": 0, "uuid": "a8fc43520c68b91a09cff28cae7d010b1ba5e099"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/16/eurozone-greece-opposition-idUSL5N10R0MD20150816", "ord_in_thread": 0, "title": "Greek opposition party refuses to back PM in any confidence vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ATHENS Aug 16 Greece's socialist PASOK party joined the main opposition on Sunday in saying it would not back Prime Minister Alexis Tsipras if he calls a confidence vote following a rebellion in the governing party over a new bailout deal.\nTsipras had to rely on opposition groups including PASOK to win a parliamentary majority on Friday in favour of the 86 billion euro bailout programme, Greece's third with international creditors since 2010.\nBy contrast, Tsipras suffered the biggest rebellion yet among anti-bailout lawmakers from his leftist Syriza party, forcing him to consider a confidence vote that would pave the way for early elections if he loses.\nPASOK made clear that while it had backed the government over bailout for the sake of saving Greece from financial ruin, that support would not extend to any confidence vote in the coming weeks.\nThe party blamed Tsipras and Panos Kammenos, who leads the minority partner in the coalition government, for the fact that Greece had to take yet another bailout with tough austerity and reform conditions demanded by the euro zone and IMF.\n\"The government has signed the third and most onerous bailout. All the negative consequences for the country and its citizens bear the signatures of Mr Tsipras and Mr Kammenos,\" the party said in a statement. \"We have no confidence in the Tsipras-Kammenos government and of course will not give it if we are asked.\"\nPASOK, once the dominant force on the Greek left, now has just 13 members in the 300 seat parliament but Tsipras may need all the support he can get. Crucially, it did not say whether it would vote against the government, or merely abstain.\nOn Friday, support for the government from within its own coalition parties fell below 120 votes, the minimum needed to survive a confidence vote if some others abstain.\nThe main conservative opposition party, New Democracy, has also said it would not back the government, which won power in January on promises to reverse austerity policies. Tsipras was forced to back down to secure the new deal.\nOpinion polls show Tsipras remains popular, even though he presided over the closure of banks for three weeks, the imposition of capital controls and a near brush with financial collapse. This has raised doubts about how much the opposition parties may want to force new elections.\nA government official said earlier on Sunday that until Greece had secured the new funding, it would focus solely on the technicalities which need to be wrapped up.\nThe official, who spoke on condition of anonymity, said Tsipras would hold meetings with government officials after Aug. 20, when a 3.2 billion euro debt payment to the European Central Bank falls due, \"in order to determine further moves\". (Reporting by Karolina Tagaris; editing by David Stamp )", "external_links": [], "published": "2015-08-16T23:18:00.000+03:00", "crawled": "2015-08-16T22:34:32.038+03:00", "highlightTitle": ""}