{"organizations": ["TUI Travel Ltd", "National Grid plc", "Should Smith & Nephew plc"], "uuid": "490a534608e1c1eef05740f56cf691719cc9c701", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-retail/?format=rss", "section_title": "Retail News | Retail Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/smith-nephew-plc-national-grid-083329253.html", "country": "GB", "title": "Should Smith & Nephew plc, National Grid plc, TUI Travel Ltd And Sports Direct International PLC Continue Their Charge Higher?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Should Smith & Nephew plc, National Grid plc, TUI Travel Ltd And Sports Direct International PLC Continue Their Charge Higher?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T11:33:00.000+03:00", "replies_count": 0, "uuid": "490a534608e1c1eef05740f56cf691719cc9c701"}, "author": "", "url": "https://uk.finance.yahoo.com/news/smith-nephew-plc-national-grid-083329253.html", "ord_in_thread": 0, "title": "Should Smith & Nephew plc, National Grid plc, TUI Travel Ltd And Sports Direct International PLC Continue Their Charge Higher?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 12:04 BST - UK Markets close in 4 hrs 26 mins Will Smith & Nephew plc, National Grid plc, TUI Travel Ltd And Sports Direct International PLC Continue Their Charge Higher? By Royston Wild | Fool.co.uk – 2 hours 31 minutes ago \nToday I am looking at the prospects for four of the FTSE's recent risers. Smith & Nephew \nShares in pharma giant Smith & Nephew (LSE: SN) have enjoyed a stellar run in recent weeks, although prices have receded more recently as wider macroeconomic fears have weighed -- the stock was last 1% higher from the middle of July. Still, I believe the artificial limbs and joints specialist should regain momentum as sales across the world explode -- indeed, the London firm saw revenues rev 5% higher during April-June, to $1.17bn. \nSmith & Nephew remains locked on an aggressive acquisition strategy to supercharge its growth prospects, with purchases like EuroCiencia Colombia boosting its exposure to emerging markets, and the acquisition of Zimmer 's knee implant business expanding its US operations. Consequently the City expects Smith & Nephew to bounce from an expected 1% earnings fall this year to record a 14% rise in 2016, pushing the P/E multiple of 21.7 times to a far more respectable 19.2 times for next year. National Grid \nThanks to the indispensable nature of electricity in today's world, I believe National Grid (LSE: NG) is a great selection for those seeking reliable earnings expansion. The stock has risen 2% during the past four weeks as investors have flocked to more defensive companies, and boosted by its lively expansion scheme on both sides of the Atlantic, I reckon the network operator is on course to deliver increasingly-appetising rewards. \nOn top of this, National Grid is also benefitting from RIIO price controls in the UK that are steadily drawing costs out of the system. As a result, the City expects the power play to chalk up a 1% earnings gain for the period ending March 2016, leaving it dealing on a P/E multiple of just 14.9 times -- a reading around or below 15 times is widely considered great value. And forecasts of a further 3% advance in fiscal 2017 push the earnings multiple to just 14.5 times. TUI Travel \nShares in TUI Travel (LSE: TUI) flipped higher in July following weeks of heavy weakness, and the stock has gained 4% during the past four weeks alone. With economic conditions steadily improving on the continent, and massive investment to improve its distribution network, I believe that the travel operator is in great shape to extend its bull run. \nIndeed, these factors helped TUI Travel -- which operates the Thomson and First Choice brands -- enjoy underlying revenue growth of 6% during April-June, to ?5.08bn. And the City fully expects sales to keep on ticking higher, while ongoing restructuring is also expected to hive off underlying assets and keep costs falling. As such, earnings growth of 33% is pencilled in for the year concluding September 2016, and 20% in 2017. As a result TUI Travel's P/E ratio of 17 times for the current period drops to just 14.2 times for the following year. Sports Direct International \nThanks to surging sportswear demand across Europe, trainer and tracksuit giant Sports Direct (LSE: SPD) continues to enjoy brilliant sales growth, the firm having clocked up a further 4.7% revenues advance during the 12 months to April 2015, to more than £2.8bn. The investment community has cottoned onto the increasing appeal of the company's sports togs and shares have risen 4% since the middle of July. \nAnd I am convinced the stock should continue rising as Sports Direct builds its network of superstores from the 19 European countries from which it currently operates, and investment in brands like Everlast and Karrimor keeps shoppers flocking through the doors. This view is shared by the number crunchers, and the firm is expected to enjoy earnings expansion of 11% and 14% in 2016 and 2017 respectively, resulting in decent P/E ratios of 18.6 times and 16.2 times. \nSo if the stocks mentioned above have whetted your appetite for even FTSE superstars, I strongly recommend you check out this totally exclusive report that highlights even more London lovelies waiting to deliver spectacular returns. \nOur \" 5 Dividend Winners To Retire On \" wealth report highlights a selection of incredible stocks with an excellent record of providing juicy shareholder returns. Among our picks are top retail, pharmaceutical and utilities plays that we are convinced should continue to provide red-hot dividends. Click here to download the report -- it's 100% free and comes with no further obligation . \nRoyston Wild has no position in any shares mentioned. The Motley Fool UK has recommended Sports Direct International. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-21T11:33:00.000+03:00", "crawled": "2015-08-21T14:10:35.942+03:00", "highlightTitle": ""}