{"organizations": [], "uuid": "6876762bfe04d53a5f19e26a73b6f1eb1eff5382", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/t/9/1/9/image.related.articleLeadwide.620x349.gisu1v.png/1439281816638.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2550/consumer-discretionary/retailing", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/money/investing/selfmanaged-super-planning-advice-for-starting-an-investment-portfolio-20150806-gisu1v.html", "country": "AU", "title": "Five ways to make investments pay off", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Five ways to make investments pay off", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "6876762bfe04d53a5f19e26a73b6f1eb1eff5382"}, "author": "Richard Livingston", "url": "http://www.smh.com.au/money/investing/selfmanaged-super-planning-advice-for-starting-an-investment-portfolio-20150806-gisu1v.html", "ord_in_thread": 0, "title": "Five ways to make investments pay off", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Start small and be conservative in your first foray into portfolio investing. Photo: Natalie Boog\nYou've decided to venture into self-managed super, a \"pick your own\" super option, or are simply starting to save for the long-term. What are the key things you need to know about building an investment portfolio?\nSubscribe to Money’s weekly newsletter , delivered to your inbox every Wednesday\nWhether you're using a financial adviser or doing it yourself, these five lessons will help you make money and reduce the risk of losing it.\nAdvertisement Lesson 1: Risk, not return Before you invest a dollar, you need to work out your risk profile and whether you need a portfolio that's conservative, aggressive (high growth) or something in between.\nThis is partly a function of your stage of life – if you're young you can take more risk than when you're retired – but it's also dependent on the portfolio decline you're willing to tolerate before surrendering to the safe haven of cash. If the thought of a 10 to 20 per cent fall in the value of your portfolio sends shivers down your spine, you can't afford to invest too aggressively. You'll need plenty of cash and bonds to go with your shares and other growth assets.\nAt this stage, your required returns shouldn't come into consideration. You may \"need\" 8 per cent a year to achieve your goals but financial markets don't care. Returns-based investing often means taking too much risk and this can be a long-term recipe for disaster. If a portfolio that suits your risk profile won't provide enough income, you need to do the \"heavy lifting\" that the market won't, by saving more.\nLesson 2: Determine an asset allocation and stick to it Asset allocation is the way you spread your investments across different asset classes (for example, bonds, shares and property). The idea is to ensure your portfolio isn't overly exposed to particular risk factors.\nFor instance, the performance of Australian shares can be compromised by changes in the local economy or tax laws. Your allocation might be simple – for example, 25 per cent in each of cash, bonds, Australian shares and international shares – or more sophisticated. It might be static, or you may choose to rebalance along with market dynamics.\nThe important thing is to stick with your targets. Review your portfolio at regular intervals and buy or sell investments to get back to those targets if they're way out of whack.\nBeing disciplined about this process should help take your emotions out of the equation. You won't be tempted to stay overly exposed to an asset class that's had a good run and might now be overvalued.\nLesson 3: Decide whether you'll invest directly, or indirectly Make up your mind about how you'll invest before you start. For instance, are you going to buy shares directly, or a managed share fund? Many people use a mixture of direct and indirect investing. For example, they might invest in Australian shares directly and use funds for international shares and property.\nThink about what's going to work for you and the time commitment involved if you want to invest directly. Haphazardly building an Australian share portfolio based on superficial media reports, or the latest commentary from a financial celebrity, is unlikely to produce good results.\nIf you don't have the time or inclination, consider sticking with managed funds.\nLesson 4: Form a view on passive or active management If you're going to invest in funds, you need to decide whether they'll be actively managed funds, passive index funds (or ETFs), or a bit of both.\nGenerally I prefer active management, but index investing has its place and there's no definitively right or wrong approach. The key is to educate yourself in advance, especially if you've decided to use a financial adviser. Many advisers are biased towards a particular investment approach or particular funds.\nLesson 5: Start small The first rule for making money over the long-term is not to lose what you've got. So take baby steps when starting out. A lot of fuss is made about the perils of inflation but in the short-term it's not much of a concern.\nThe key at this stage is not to lose capital by either making mistakes or taking on more risk than you can comfortably handle. You can recover from missing out on a percentage point of returns, but making up large capital losses isn't so easy.\nErr on the side of conservatism, both in your asset allocation and your individual investments. If you've decided to invest directly in an Australian share portfolio, also consider investing in a managed share fund.\nThat way, if you make mistakes they'll have less impact on your overall portfolio. You can allocate more of your portfolio to your direct investments as you gain experience.\nIf you're starting an investment portfolio, let these lessons guide you. You'll reduce your risk, improve your returns and maximise you opportunities for long-term wealth.\nRichard Livingston is a founder of Eviser . This article contains general investment advice only (under AFSL 469838).", "external_links": ["https://membercentre.fairfax.com.au/NewsletterSubscription.aspx"], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-13T04:34:41.718+03:00", "highlightTitle": ""}