{"organizations": [], "uuid": "75c393e906490783dc9e3da653899aa473345867", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-reuters/?format=rss", "section_title": "Finance News | Reuters - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/brent-down-china-rout-u-164835988.html", "country": "GB", "title": "Oil rises on U.S. data, bets for crude stockpile drop", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Oil rises on U.S. data, bets for crude stockpile drop", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T00:27:00.000+03:00", "replies_count": 0, "uuid": "75c393e906490783dc9e3da653899aa473345867"}, "author": "", "url": "https://uk.finance.yahoo.com/news/brent-down-china-rout-u-164835988.html", "ord_in_thread": 0, "title": "Oil rises on U.S. data, bets for crude stockpile drop", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Aug 18, 2015, 22:42 BST - UK Markets closed Oil rises on U.S. data, bets for crude stockpile drop Reuters – 14 minutes ago \nA car is filled with gasoline at a gas station pump in Carlsbad, California August 4, 2015. REUTERS/Mike … \nBy Barani Krishnan \nNEW YORK (Reuters) - Oil prices settled up on Tuesday, with U.S. crude rallying as much as 2 percent, after bullish economic data and bets for lower crude stockpiles in the United States, the world's largest oil consumer. \nShort-covering ahead of Thursday's expiry of the key front-month contract in U.S. crude also helped the market advance from a 6-1/2-year low hit on Friday. \n\"After selling precipitously over the last several days, oil prices were technically stretched and oversold on a near-term basis, leading to a bounce into the close,\" said Chris Jarvis, analyst at Caprock Risk Management in Frederick, Maryland. \nNew York-traded U.S. crude (CLc1) settled up 75 cents at $42.62 a barrel after U.S. housing starts hit a near eight-year high in July. \nBrent (LCOc1), the London-traded global benchmark for oil, settled up 7 cents at $48.81, snapping a three-day decline. Brent was initially down on Tuesday morning after a stock market plunge in China, the No. 2 oil consumer.[MKTS/GLOB] \nIn post-settlement trade, however, U.S. crude pared gains and Brent slipped back into negative territory despite an industry group indicating that U.S. crude inventories may have fallen more last week than initially thought. \nThe American Petroleum Institute reported after the market's close that there was a drawdown of 2.3 million barrels for the week ended Aug. 14. A Reuters poll of analysts expected a drop of about 800,000 barrels for the week. \nOfficial inventory data will be issued on Wednesday by the U.S. Energy Information Administration. [EIA/S] \n\"People were squaring off short positions ahead of the API report,\" Tariq Zahir, managing member at Tyche Capital Advisors in Laurel Hollow, New York, said in reference to the pre-settlement rally in U.S. crude. \n\"But no one really seems to trust that big number of above 2 million barrels that they came up with.\" \nMany oil traders are positioning themselves to profit from a further drop in U.S. prices, buying \"puts\" - options to sell contracts once they have fallen to a particular level - at prices as low as $30 a barrel. \nMoney managers and hedge funds also have cut their net long positions in U.S. crude to 2010 lows and in Brent to December 2014 lows, data shows. \nBoth Brent and U.S. crude have lost more than half their value from a year ago. They rallied earlier this year, but have fallen about a third below peaks hit in May. \n(Additional reporting by Lisa Barrington in London, and Henning Gloystein and Jacob Gronholt-Pedersen in Singapore; Editing by Marguerita Choy, Frances Kerry and Paul Simao)", "external_links": [], "published": "2015-08-19T00:27:00.000+03:00", "crawled": "2015-08-19T00:45:28.526+03:00", "highlightTitle": ""}