{"organizations": [], "uuid": "e3d6e31a7c2d745e7bf9bc9f0ac1fc4005dbd305", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/uflex-wins-make-india-award-excellence/44902", "country": "US", "title": "Uflex Wins Make in India Award for Excellence", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Uflex Wins Make in India Award for Excellence", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T13:47:00.000+03:00", "replies_count": 0, "uuid": "e3d6e31a7c2d745e7bf9bc9f0ac1fc4005dbd305"}, "author": "", "url": "http://businesswireindia.com/news/news-details/uflex-wins-make-india-award-excellence/44902", "ord_in_thread": 0, "title": "Uflex Wins Make in India Award for Excellence", "locations": ["New Delhi", "Delhi", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wednesday, August 19, 2015 4:17PM IST (10:47AM GMT) Uflex Wins Make in India Award for Excellence New Delhi, Delhi, India \nIndia’s largest flexible packaging company Uflex Limited was conferred with the ‘ Make In India Award for Excellence’ at a felicitation ceremony at Mahatma Mandir, Gandhinagar today. The award ceremony was presided over by Hon’ble Union Cabinet Minister of Micro, Small and Medium Enterprises. The event was graced by Ministers from State & Central Government, senior officials from Govt. sector, leading industrialists from Gujarat and Celebrities from Bollywood. The ‘Make In India Awards for Excellence’- an initiative by Krazy Mantra, a leading subsidiary of Aldiablos group of companies, offering a wide spectrum of IT and Non-IT business solutions globally endeavors to provide impetus to the socio-economic growth of the nation, enabling India to become a global leader. Several other companies were also felicitated for their contribution. Mr. Ashok Chaturvedi, Chairman and Managing Director, Uflex Group, in a press statement said, “ Make In India Award for Excellence is a testament for Uflex’s commitment towards the growth and prosperity of our great nation through Make in India. Towards this direction, Uflex besides having plants in Noida, Jammu and Malanpur is further setting up first of its kind Aseptic Packaging Plant for packing liquid products like energy drinks, juices, dairy products etc at Sanand, Gujarat with a Capex of Rs. 550 crore in the first phase reinforcing its commitment towards Make in India.” The project will go operational by April 2017 and will provide employment to around 3000 people in the region upon completion of all the phases. The plant at Sanand will produce approximately seven billion packs per year. Nearly 90 percent of the output from this factory will cater to the domestic market. About Uflex Uflex Limited is the largest fully integrated Indian flexible packaging solution provider to a range of clients across industries both in India and overseas. It enjoys a formidable market presence in more than 140 countries. Since its inception back in 1983, Uflex has grown from strength to strength to evolve as a truly Indian Multinational with consumers spread across the world. Uflex today has state-of-the-art packaging facilities at multiple locations in India with installed capacity of over 99,000 TPA. Uflex has plastic film manufacturing facilities in India, UAE, Mexico Egypt, Poland and USA with cumulative installed capacity in excess of 337,000 TPA. Uflex Film lines are accredited with ISO 9001, 14001 and HACCP certifications. Uflex caters to markets spanning across the globe in countries like USA, Canada, South American countries, UK and other European Countries, Russia, South Africa, CIS, Asian and African nations. Integrated within its core business profile are allied businesses like Engineering, Cylinders and Chemicals which further give Uflex a superior edge above competition. Uflex Limited is also a part of the D&B Global Database and winner of various prestigious national and international awards for its products’ excellence. Uflex Ltd offers technologically superior packaging for a wide variety of products such as snack foods, candy and confectionery, sugar, rice & other cereals, beverages, tea & coffee, dessert mixes, noodles, wheat flour, soaps and detergents, shampoos & conditioners, vegetable oil, spices, marinates & pastes, cheese & dairy products, frozen food, sea food, meat, anti-fog, pet food, pharmaceuticals, contraceptives, garden fertilizers and plant nutrients, motor oil and lubricants, automotive and engineering components etc. Some of Uflex Limited’s clients on the global turf include Unilever, Pepsi, Wrigley, Procter & Gamble, Colgate, Palmolive, Nestle, Gillette, Ranbaxy, Perfetti, Joyco, Monsanto, ITC, Godrej Pillsbury, Tata Tea, Hindustan Petroleum, Indian Oil, Britannia, Dabur, Haldiram, Wockhardt, HUL, Parle Biscuit, Birla 3M, among others. For News Release background on UFLEX Limited click here T. Anand Mahesh, Mavcomm Consulting Pvt. Ltd., +91-9870716285, anand@mavcommgroup.com Neeraj Atri, Mavcomm Consulting Pvt. Ltd., +91-9811714871, n.atri@mavcommgroup.com", "external_links": [], "published": "2015-08-19T13:47:00.000+03:00", "crawled": "2015-08-19T14:05:33.612+03:00", "highlightTitle": ""}