{"organizations": ["Zacks Investment Research", "Silvercrest Mines Inc", "Avino Silver & Gold Mines Ltd", "Buy Valmy Property", "Newmont Mining Corporation NEM", "Valmy Property", "Silver Standard", "Newmont", "ASM"], "uuid": "0d4c85d45e84fce865fe8efa71bd656b9ee29723", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=SSRI", "section_title": "Yahoo! Finance: SSRI News", "url": "http://finance.yahoo.com/news/silver-standard-ssri-buy-valmy-214009672.html", "country": "GB", "title": "Silver Standard (SSRI) to Buy Valmy Property at Marigold", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Silver Standard (SSRI) to Buy Valmy Property at Marigold", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T00:40:00.000+03:00", "replies_count": 0, "uuid": "0d4c85d45e84fce865fe8efa71bd656b9ee29723"}, "author": "", "url": "http://finance.yahoo.com/news/silver-standard-ssri-buy-valmy-214009672.html", "ord_in_thread": 0, "title": "Silver Standard (SSRI) to Buy Valmy Property at Marigold", "locations": ["Nevada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Content preferences Done   SSRI announced that it has inked a deal with Newmont Mining Corporation NEM to buy 2,844 hectares contiguous with the Marigold mine in Nevada (the \"Valmy Property\") for $11.5 million in cash. The purchase consideration will be financed from cash on hand.Per the agreement, Silver Standard will acquire 100% of Newmont's interest in a prospective land package contiguous with the Marigold mine with 196,000 ounces of historical gold production. The Valmy Property is a 2,844 hectare land package surrounding parts of the Marigold mine to the east, south and west.Silver Standard will secure formerly operating open pits with exploration potential near Marigold's Mackay pit. This will aid in creating value for shareholders at Marigold. This acquisition also represents an opportunity for Silver Standard to increase resources and add operating flexibility at Marigold.The transaction is subject to customary closing conditions, including regulatory clearances, and is expected to close in Oct 2015. Under the deal terms, Silver Standard needs to provide financial assurances to the environmental   with respect to the Valmy Property's long-term environmental and reclamation obligations. Last week, Silver Standard released its second-quarter 2015 results. The company raised its gold production guidance at the Marigold mine for 2015 to the range of 195,000 ounces to 205,000 ounces, a 19% increase from its earlier gold production outlook of 160,000 ounces to 175,000 ounces. Silver Standard currently carries a Zacks Rank #5 (Strong Sell). Some better-ranked silver mining companies are Avino Silver & Gold Mines Ltd. ASM and Silvercrest Mines Inc. SVLC. Both of them carry a Zacks Rank #2 (Buy). Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report >> Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report", "external_links": [], "published": "2015-08-13T00:40:00.000+03:00", "crawled": "2015-08-13T01:36:43.772+03:00", "highlightTitle": ""}