{"organizations": [], "uuid": "099a863bb4bc4391f04c83786149d297c32d7d04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/9/7/3/c/image.related.afrArticleLead.620x365.gj80lj.png/1440559075277.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/currencies/chinas-yuan-currency-shock-hits-carrytrade-crowd-20150826-gj80lj", "country": "AU", "title": "China's yuan currency shock hits carry-trade crowd", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "China's yuan currency shock hits carry-trade crowd | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T10:53:00.000+03:00", "replies_count": 0, "uuid": "099a863bb4bc4391f04c83786149d297c32d7d04"}, "author": "afr.com", "url": "http://www.afr.com/markets/currencies/chinas-yuan-currency-shock-hits-carrytrade-crowd-20150826-gj80lj", "ord_in_thread": 0, "title": "China's yuan currency shock hits carry-trade crowd", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buying the yuan with funds borrowed more cheaply elsewhere was one of the most reliable ways to make money earlier in the year. SeongJoon Cho China just gave investors one more reason to shun the most popular trading strategy in the $US5.3 trillion-a-day ($7.4 trillion-a-day) currency market.\nCarry trades, or borrowing one currency cheaply to invest in a higher-yielding asset elsewhere, were already suffering the biggest losses since 2008 as the rout in emerging markets sent potential purchases tumbling. By cutting interest rates two weeks after its shock devaluation, China effectively crossed the yuan off investors' shopping lists, too.\nAdd to this a surge in volatility - which is kryptonite for these transactions because it can wipe out the profit from the interest-rate differential - and carry traders are finding fewer and fewer ways to make money. JPMorgan Private Bank and the asset-management unit of Bank of China both say the strategy's best days are behind it.\n\"It's a terrible time to be long carry,\" said Joseph Capurso, a Sydney-based currency strategist at Commonwealth Bank of Australia. \"Increased volatility - which I think we'll stay with - will continue to be terrible for carry. The period is over for carry trades.\"\nA Deutsche Bank index tracking carry trade returns has plunged 13 per cent this year, on track for its worst annual decline since the 2008 financial crisis.\nCurrency volatility The losses accelerated in the past week as bear markets in equities around the world , combined with a plunge in oil and metals prices, sent currencies from South Africa's rand to Mexico's peso tumbling to records. They're the sort of currencies investors tend to buy in carry trades because of their relatively high interest rates.\nA JPMorgan Chase measure of currency volatility meanwhile approached its highest level this year, further sapping carry returns.\n \"Across the board, carry has been under pressure,\" said Kristjan Kasikov, a London-based quantitative analyst at Citigroup Inc., the world's biggest currency dealer. \"Weakness in commodity prices has hit some of the high-yielding currencies quite hard.\"\nOne of the most popular carry trades in recent months was borrowing yen to buy Australian dollars, according to CBA's Capurso. Investors would pocket the difference between Japan's near-zero borrowing costs and Australia's main rate, which at the start of the year was 2.5 per cent.\nThe deals started to lose money, he said, as weaker growth in China and falling raw-materials prices sent the Aussie tumbling toward this week's six-year low versus the dollar. Investors in the carry trades would have lost 6 per cent in August, wiping out a 4 per cent profit in the second quarter.\nBuying the yuan with funds borrowed more cheaply elsewhere was one of the most reliable ways to make money earlier in the year as China held its currency at about 6.2 to the dollar.\nAs recently as mid-June, BlackRock, which oversees $US4.7 trillion, was piling into the trade and predicting it would remain a good bet for the next year and a half. The deal had been popular for some time, with Deutsche Bank estimating that almost $800 billion had poured into yuan carry trades since 2010.\nThe transaction turned sour on August 11, when China unexpectedly devalued its currency to boost exports . Tuesday's interest-rate cut, its fifth since November, further undermined the yuan, which traded at about 6.4 per dollar Wednesday in Tokyo.\nAs a result, buying the yuan with borrowed euros would have lost about 7 per cent since the devaluation and 3 per cent using dollars, after gaining an average 4 percent annually over the previous four years, data compiled by Bloomberg show.\nTwin policy shock The People's Bank of China isn't the first central bank whose policy decisions upset the carry trade this year. Investors who took advantage of Switzerland's negative interest rates were left nursing losses when officials abandoned their exchange-rate cap back in January, sending the franc soaring to a record and upending deals funded in the currency.\nYet China's twin policy shocks have had the biggest impact, investors say, if only because of the sheer amount of money poured into yuan carry trades.\nBOCHK Asset Management, a unit of Bank of China that overseas about $US7.7 billion, says investors in the deals will probably take profits.\nThe yuan was \"the best carry-trade currency for years because of its low volatility,\" said Ben Sy, head of fixed income, currencies and commodities for Asia at JPMorgan Private Bank in Hong Kong. \"Now, volatility has almost doubled. Definitely, people will unwind.\"", "external_links": [], "published": "2015-08-26T10:53:00.000+03:00", "crawled": "2015-08-26T08:06:12.049+03:00", "highlightTitle": ""}