{"organizations": [], "uuid": "b8f647f8dfad55850febc7fe9d24448856427d4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/03/Subrata-Roy-Sahara-Ret.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/companies/you-are-in-jail-by-choice-supreme-court-bench-to-sahara-chief-subrata-roy/113163", "country": "IE", "title": "You are in jail by choice: Supreme Court bench to Sahara chief Subrata Roy", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "You are in jail by choice: Supreme Court bench to Sahara chief Subrata Roy | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T03:42:00.000+03:00", "replies_count": 0, "uuid": "b8f647f8dfad55850febc7fe9d24448856427d4b"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/companies/you-are-in-jail-by-choice-supreme-court-bench-to-sahara-chief-subrata-roy/113163", "ord_in_thread": 0, "title": "You are in jail by choice: Supreme Court bench to Sahara chief Subrata Roy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Roland Folger to lead Mercedes India, Eberhard Kern headed for Europe No probe into purchase of aircraft by Air India: Govt Punj Lloyd bags Rs 477 cr tankage order Jailed Sahara Group chief Subrata Roy ’s plea for his release on humanitarian grounds today evoked a sharp reaction from the Supreme Court which said “you are in jail by choice”.\n“One thing which is troublesome is that the person (Roy) says there is an asset of Rs 1,85,000 crore. He tells the court that he has so much of money but when it comes to paying one-fifth of that he is unable to pay.”\n“You have to pay only the one-fifth of your amount. The person who is blessed with so much money is sacrificing his liberty in jail and not parting away with his property. You are in jail by choice,” a bench headed by Justice T S Thakur observed and referred to his earlier submissions when Roy had claimed that the group has sufficient assets to pay the investors.\nThe remarks were made when senior advocate Kapil Sibal was making a submission that it was not fair for the court to put Roy inside the jail when the contempt proceedings against him were not over.\nFurther, he said, other large business houses did not have to suffer like this and their loans of considerable amount like Rs 1,000 crore get rescheduled for payment in five or 10 years by the RBI or banks.\nThe senior advocate said it was difficult for Roy to arrange a big amount for his release by staying inside the jail and the court should consider humanitarian grounds for his release.\nHowever, the bench said “please appreciate we have certain constraints. Read the previous orders passed by this court. You will know why your client is in jail. Read it you will not say.”\nSibal said he has read all the orders and the court should consider Roy’s release on humanitarian grounds.\n“Even if you are released, the sword will be hanging over your head on your return (from jail). You have to pay the remaining amount. This is a case which can be argued for days, weeks and months,” the bench observed evoking an instant response from Sibal who said “I will get justice.”\n“Any bench will give you justice. One goes with this perception,” the bench said.\nSibal said “just on the basis of perception, consider his release on humanitarian grounds” and till then extend the facility in jail for negotiating with the potential buyers of properties which is coming to end on August 16.\nThe bench said it is evident that there was a difficulty for the group to sell its properties to arrange Rs 36,000 crore for making the payment in the SEBI-Sahara account since Roy has been in jail for one-and-a half-year and the sale of properties can be done by appointing a receiver which was opposed by Sibal.\nSenior advocates Arvind Datar for SEBI and Shekhar Naphade, who is assisting the court as amicus curiae, said appointment of receiver was inevitable.\n“Why can’t a receiver be appointed. Let the properties be taken over and let it be sold and the money be deposited with the receiver as it is apparent they are incapable of generating money and selling properties,” the bench said adding that a retired judge of the apex court who was appointed to oversee the action taken by SEBI against Sahara Group, would be the chairman of the Receiver.\n“These people can enforce agencies to proceed with the sale of property. It is not a happy situation,” the bench, also comprising Justices A R Dave and A K Sikri said after approving the sale of Sahara Group’s 140-acre land in Gorakhpur which was settled for Rs 152 crore.\nThe court had recently virtually turned into an auction room as the two real estate firms had hiked their bids with Gorakhpur Real Estate Developers Private Limited surpassing the Rs 150 crore Samriddhi developers. The money generated from the sale of Gorakhpur property would be added to the amount already deposited by the Sahara Group in the SEBI-Sahara account and go towards securing Roy’s release.\nThe bench posted the matter for hearing on September 14 when it will give a detailed hearing on the issue of appointing a receiver and other issues arising in the case.\nIt also agreed to hear the petition under Article 142 of the Constitution to do complete justice between the parties in this case as raised by Sibal.\nFurther, the court will deliberate on the dispute arising on the sale of property at Chauma in Gurgaon and Vaasai in Maharashtra.\nComplying with the direction, SEBI today placed before the court, the bank statement of SEBI-Sahara account on the amount deposited and the investment made by the market regulator.\nEarlier, the court had declined to relax the conditions for interim bail of Roy like depositing Rs 5,000 crore in cash and a bank guarantee of equal amount and tough terms including payment of the entire Rs 36,000 crore in 18 months.\nSibal had said that no business group in the world could pay Rs 36,000 crore and the banks are also saying that how can there be a bank guarantee when it is for sure that there will be a default.\nHe had during the last hearings said that the group was unable to secure the bank guarantee as the financial institution which had agreed to furnish it has backed out when SEBI insisted on fixation of the “trigger point” for encashing it.\nThe court had also asked 67-year-old Roy, who has been in Tihar jail since March 4, 2014, to pay Rs 36,000 crore to the SEBI within 18 months and in nine installments from the date of release.\nFirst Published on August 03, 2015 7:42 pm", "external_links": [], "published": "2015-08-04T03:42:00.000+03:00", "crawled": "2015-08-03T18:31:03.618+03:00", "highlightTitle": ""}