{"organizations": [], "uuid": "4bf2da48e6a269f9704a505879d97c853a22af0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/j/m/e/b/image.related.afrArticleLead.620x365.giq13u.png/1438659071991.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/the-pitfalls-of-investing-internationally-20150802-giq13u", "country": "AU", "title": "The pitfalls of investing internationally", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The pitfalls of investing internationally | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T11:31:00.000+03:00", "replies_count": 0, "uuid": "4bf2da48e6a269f9704a505879d97c853a22af0f"}, "author": "Steve Johnson", "url": "http://www.afr.com/personal-finance/the-pitfalls-of-investing-internationally-20150802-giq13u", "ord_in_thread": 0, "title": "The pitfalls of investing internationally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China's total economic growth from 2002 to 2012 was 530 per cent but during that time the Shanghai Composite Index returned only 38 per cent. iStock by Steve Johnson It has never been easier or cheaper for Australian investors to head offshore. And with the Aussie dollar falling further, an increasing number of them are taking the leap. But watch out – there are pitfalls.\nThe growth illusion\nMany investors head offshore in pursuit of higher growth. Whether it's China's burgeoning middle class, India's enormous potential or the youth of sub-Saharan Africa, international investors are often looking for growth they can't find at home. They are wasting their time.\nIECONOMICS says between 2002 and 2012 China's economy grew at more than 20 per cent a year, including inflation. The total growth over this decade was 530 per cent. The Chinese sharemarket, you might think, should have been one of the world's best performers over the same period. In fact, a 10-year investment in the Shanghai Composite Index returned you 38 per cent – or 3.3 per cent a year.\nThe phenomenon is not just a Chinese one. Studies suggest that, across a wide range of markets and more than 100 years of history, there is no relationship between gross domestic product growth and returns. A 2009 Buttonwood article in The Economist summarised one of the studies thus:\n\"Work done by Elroy Dimson, Paul Marsh and Mike Staunton at the London Business School established this back in 2005. Over the 17 countries they studied, going back to 1900, there was actually a negative correlation between investment returns and growth in GDP per capita, the best measure of how rich people are getting.\"\nThis might seem counterintuitive but there is some logic to it. First, high economic growth attracts a lot of new capital and a flood of new capital drives down returns. Second, like high-growth stocks, the starting point for high-growth economies is often higher earnings multiples for the underlying companies. You might get growth, but the expensive price tag more than offsets the benefits.\nSo lesson number one is that investing in the best economies won't give you the best returns. In fact, you might be best off looking for the worst.\n Keeping it in the family\nThe Boston Consulting Group says more than half of the top companies in Asia are family owned. The number falls to 40 per cent at French and German companies, while only one-third of companies in the United States meet the same criteria.\nIn Australia, dual-voting structures are rare and the prevalence of family-owned companies among the ASX 200 is much smaller than in overseas markets. This isn't necessarily a negative aspect of investing internationally – some of the Australian exceptions are among the best businesses in the country. Companies with a controlling shareholder tend to make better long-term decisions and can avoid the destructive short-termism that afflicts companies with an open register.\nBut you need to make sure you like the strategy and that minority shareholders are going to get the same or a better deal as the family. When Rupert Murdoch wants to appoint his son as the next chief executive of News Corp, or the Chung family wants to use Hyundai's money to buy a $10 billion piece of trophy land in Seoul, there's nought you can do about it.\nHigh share prices are not a high priority\nAgain, it is sometimes to the detriment of sensible decision making, but Australian chief executives and their US and British counterparts are obsessed with their companies' share prices. They are focused on getting them up.\nThey employ investor relations gurus to sell their story to the market. They buy back shares. And they increase the dividend payout ratio if they think it is going to improve the share price. Often this process is encouraged by shareholders like us, who buy companies that we think are cheap and then would like to see the value reflected in the share price so that we can make a profit.\nLarge parts of Asia, Europe and South America don't work like this. Particularly when a company is family owned, the manager and shareholders don't pay much attention to the share price and often don't care whether it reflects fair value or not.\nAt home I might place more emphasis on the assets of a company and the ability to close the gap between price and value. In many international markets, my main focus is dividends and the company's track record with re-investing profits. These are strong signals that the company is going to compound its value over time and that, even if it continues trading at a large discount, at least the value is increasing.\nYou are investing in someone else's backyard\nAt a recent value investing conference in Italy, a European hedge fund investor told me that one of his largest positions is a short on Commonwealth Bank of Australia (a short is a bet that the share price will fall). I am as concerned as he is about Australia's housing market. And I don't own the banks – they look expensive to me. But I am also acutely aware that they are oligopolistic profit-making machines. The Australian banking sector is extremely concentrated and the financial sector as a whole is huge, thanks to our mandated defined contribution pension scheme. I wouldn't own them, but I wouldn't bet against them either. Especially CBA.\nThis tendency to extrapolate our own home market experience to international markets is one of the biggest risks for Australian investors heading offshore. We think everything works the same way as it does in Australia, whereas, in reality, markets and cultures vary dramatically from country to country. Regulators, competition law and the geography of a country all play a huge role in the economics of business. Telecommunications and groceries are both nicely profitable industries in Australia. In some international markets they are horrible businesses.\nWhen you're heading offshore, remember you are playing in someone else's backyard.\nSteve Johnson is chief investment officer of Forager Funds Management.", "external_links": ["http://www.economist.com/blogs/buttonwood/2009/08/the_growth_illusion"], "published": "2015-08-04T11:31:00.000+03:00", "crawled": "2015-08-05T01:13:48.757+03:00", "highlightTitle": ""}