{"organizations": [], "uuid": "8113f8f68ce2fc12733fc57e938754657a752446", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/07/31/usa-chicago-budget-idUSL1N10B2L920150731", "country": "US", "title": "UPDATE 1-Chicago's budget deficits to persist -city analysis", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Chicago's budget deficits to persist -city analysis | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T01:23:00.000+03:00", "replies_count": 0, "uuid": "8113f8f68ce2fc12733fc57e938754657a752446"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/07/31/usa-chicago-budget-idUSL1N10B2L920150731", "ord_in_thread": 0, "title": "UPDATE 1-Chicago's budget deficits to persist -city analysis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comment by mayor, background on city's fiscal woes, budget process and pension payments)\nCHICAGO, July 31 (Reuters) - Budget deficits are projected to persist for Chicago as pension and debt costs gobble up more revenue, according to an annual financial analysis released by the city on Friday.\nWhile the report projects that fiscal 2016 expenditures will outstrip revenue by $232.6 million, the lowest gap since 2008, additional pension and debt payments would push the deficit to $425.6 million.\nIf Illinois fails to enact legislation easing Chicago's payments to its public safety retirement systems, the deficit could be even higher.\n\"We have made significant progress, while continuing to make investments important to Chicago's families and neighborhoods, but this progress is threatened by the massive pension liabilities that must be addressed this year,\" Mayor Rahm Emanuel said in a statement.\nThe analysis indicated that budget gaps would continue through fiscal 2018, when the deficit could range from $132.4 million to $801 million.\nChronic structural budget deficits and a $20 billion unfunded pension liability have led to a slew of credit rating downgrades, including one by Moody's Investors Service in May that dropped Chicago into the \"junk\" category. As a result, the third-largest U.S. city has had to offer hefty yields to sell its debt in the municipal bond market.\nEmanuel has said he will speed up the budget process for fiscal 2016, which begins on Jan. 1, by unveiling his spending plan in September instead of October.\nThe city has not revealed how it plans to increase its contribution to pensions for public safety workers, as mandated by a 2010 Illinois law, if the payment restructuring bill does not become law. The bill passed by lawmakers in May would reduce the total payment by $220 million to $619 million from $839 million. The city's payments would increase every year from 2017 to 2020 but not as much as under the 2010 law.\n(Reporting by Karen Pierog ; Editing by Matthew Lewis )", "external_links": [], "published": "2015-08-01T01:23:00.000+03:00", "crawled": "2015-08-01T00:47:02.415+03:00", "highlightTitle": ""}