{"organizations": [], "uuid": "388818552d4fda91a4c9c2f51ad36fec38e9e11c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/3/f/a/1/image.related.afrArticleLead.620x365.gj3eqa.png/1440032865890.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/news/world/worlds-biggest-wealth-fund-tackles-new-era-as-cash-flows-dry-up-20150820-gj3eqa", "country": "AU", "title": "World's biggest wealth fund tackles new era as cash flows dry up", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "World's biggest wealth fund tackles new era as cash flows dry up | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T09:06:00.000+03:00", "replies_count": 0, "uuid": "388818552d4fda91a4c9c2f51ad36fec38e9e11c"}, "author": "Saleha Mohsin and Manus Cranny", "url": "http://www.afr.com/news/world/worlds-biggest-wealth-fund-tackles-new-era-as-cash-flows-dry-up-20150820-gj3eqa", "ord_in_thread": 0, "title": "World's biggest wealth fund tackles new era as cash flows dry up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The fund posted a loss of 73 billion kroner in the second quarter, the first decline in three years, dragged down by falling global bond and stock markets. Reuters by Saleha Mohsin and Manus Cranny The taps are being turned off for the world's biggest wealth fund.\nWith crude oil below $US50, the $US870 billion fund has seen a precipitous drop in cash injections from Norway's government. It received just 12 billion kroner ($US1.4 billion) in the second quarter and 5 billion kroner in the first three months of 2015, compared with a quarterly average of 60 billion kroner over the past 10 years.\nThe sudden slowdown creates new risks for the fund, which since its inception in 1998 has relied on a steady cash flow to seek out new markets and strategies to increase returns. A retrenchment could have a broad impact on investors across the globe, since the fund owns about 2.4 per cent of European stocks and last year emerged as the second-largest foreign buyer of US real estate.\n\"We still have a net positive inflow, although it's very small these days,\" Yngve Slyngstad, head of the fund, said in an interview in Oslo on Wednesday. While it won't immediately change its strategy, the fund won't have \"the same amount of cash to reinvest,\" he said.\nThe fund has typically used new cash to make large changes in its portfolio, such as when it went into real estate or increased its stake in emerging markets at the expense of Europe. The fund is dealing with smaller capital injections as it targets adding infrastructure to its portfolio of approved asset classes. It also wants to raise its allocation to real estate.\nThe fund is also contending with a government that's taking a larger share of the nation's oil wealth to pad its budget as the oil slowdown has pushed up unemployment. The government in May predicted it would deposit 42 billion kroner into the fund for all of this year and estimated a 27 per cent decline in oil income to 252 billion kroner. Oil was almost $US20 higher back then.\nAccording to Mr Slyngstad, the decline in inflows has already hampered the fund's shift away from Europe. The government in 2012 approved a plan to reduce holdings in Europe to 41 per cent from 54 per cent of the total portfolio as the region's debt crisis raged.\n\"The big picture is that we will see a bigger relative risk and somewhat larger implementation costs during strategy changes now,\" Mr Slyngstad said.\n The fund posted a loss of 73 billion kroner in the second quarter, the first decline in three years, dragged down by falling global bond and stock markets.\n\"The return on fixed-income investments was affected by an increase in yields in the fund's main markets,\" Mr Slyngstad said. \"On the equity side, US stocks pulled down the result.\"\nMr Slyngstad also warned that the fund faces diminished returns as central banks across the developed world have unleashed stimulus that has driven bond yields to record lows.\nThe fund held 62.8 per cent in stocks at the end of June, up from 62.5 per cent in March. Bond holdings fell to 34.5 per cent from 35.3 per cent and it held 2.7 per cent in real estate. The fund is mandated by the government to hold about 60 per cent in stocks, 35 per cent in debt and 5 per cent in properties.\nThe fund's largest stock holdings are Nestle, Apple, followed by Novartis. The biggest bond holdings were in US, Japan and Germany.\nInvestments in emerging markets equities returned 1.5 per cent in the quarter, accounting for 9.6 per cent of the fund's stock holdings. It invested for the first time in Saudi Arabian participation certificates as it increases exposure to emerging markets.\nThe fund lost 2.9 per cent on its government bond holdings and 2.9 per cent on its corporate bonds. Euro-denominated bonds declined 4.3 per cent in the quarter.\n\"We have a portion of the bond portfolio that is currently at negative yields in Europe, that is just the nature of the market these days,\" Deputy CEO Trond Grande said in an interview after a press conference. \"The direct and obvious impact is that you get negative rates, that's a cost in itself.\"", "external_links": [], "published": "2015-08-20T09:06:00.000+03:00", "crawled": "2015-08-20T16:59:40.549+03:00", "highlightTitle": ""}