{"organizations": [], "uuid": "7569416d542a665dfbd8224f433da821465a14d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/w/i/j/9/image.related.afrArticleLead.620x365.giwahw.png/1439286478835.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/special-reports/choice-is-growing-for-investors-20150811-giwahw", "country": "AU", "title": "Choice is growing for investors", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Choice is growing for investors | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T16:00:00.000+03:00", "replies_count": 0, "uuid": "7569416d542a665dfbd8224f433da821465a14d7"}, "author": "Jason Clout", "url": "http://www.afr.com/news/special-reports/choice-is-growing-for-investors-20150811-giwahw", "ord_in_thread": 0, "title": "Choice is growing for investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CMC Markets chief market strategist Michael McCarthy says ETF CFDs are growing in popularity. Jessica Hromas by Jason Clout Traders are embracing the opportunity to move into the popular exchange traded funds (ETFs) market through contracts for difference (CFDs)\nChief market strategist at CMC Markets Michael McCarthy says more than 1000 ETF CFDs are offered through its Next Generation platform. That growth has been spurred by traders, many of whom have been looking to invest in different industry sectors, geographic regions and asset classes.\n\"There is no question the development of this market has been led by traders,\" says McCarthy.\nHe notes a CFD - which is an agreement to exchange the difference between a \"buy\" and \"sell\" price - can be created over any traded product.\n\"ETFs are one of the fastest growing investment instruments combining the power, range and diversity of managed funds, with the convenience of an exchange listed, tradeable product, \" says McCarthy.\nThrough the leveraged nature of CFDs, traders can take advantage should markets move their way.\n\"This means traders can profit from the more modest daily moves in listed funds because of the ability to control a higher value investment despite putting down a modest initial investment.\"\nChina index trackers popular\n McCarthy says two instruments which track the mainland China CSI 300 index have been among their most popular products.\nBut head of iShares Australia (which is part of BlackRock) Jonathan Howie, says it was important to note that the essence of ETFs is they are very straight-forward products.\n\"ETFs are plain vanilla, physically-backed products,\" he says.\nWithin its range of ETF offerings, Howie says there has been a surge of interest in global investing. US-related products started the trend, which then flowed to Europe and Japan and now includes Korea and Taiwan.\nFinancial advisory groups have been taking an increasing interest in the ETF market, says Howie. Some are trying to design model portfolios, with ETFs playing a central role.\n\"Some are seeing ETFs as the core and then having active managers as satellites.\"\nETFs growing fast\nArian Neiron, managing director, Van Eck Global and Market Vectors ETFs - Australia, says the growth in the local ETF market for the year to June 2015 was 56 per cent.\nAverage new flows in the industry increased from $357 million a month in 2014 to $485 million a month in 2015, a 36 per cent increase.\nInvestors are seeking targeted outcomes in their investment strategies, he says. One of its products for example is designed to help investors outperform in low growth and low inflation environments.\n\"The remainder of 2015 will see increasing adoption of ETFs due to accessibility, cost, transparency and liquidity benefits,\" he says.\nOn June 12 this year the ANZ ETFS joint venture listed ETFs on the ASX. Danny Laidler, co-head ANZ ETFS and head of distribution, says its joint venture partner was chosen because of their experience in ETFs.\nMany investors have an income focus given the low cash rate so there are products for that, he says. It also has currency products, an area where retail investors often need expert assistance.\nWhile Laidler says the ETF market has grown here, he contrasts it with the even more rapid growth in Canada. In 2009 he says the Australian and Canadian markets were about the same size but Canada has grown at a much quicker rate.\nSelf managed super fund trustees have been critical to the growth that has occurred in the Australian market. Recep Ill Peker, head of research, wealth management at Investment Trends, says there were 191,000 Australians invested in ETFs in April this year.\nOf that number, 82,000 were SMSF trustees. A year earlier that figure had been 53,500.", "external_links": [], "published": "2015-08-11T16:00:00.000+03:00", "crawled": "2015-08-11T21:05:38.997+03:00", "highlightTitle": ""}