{"organizations": [], "uuid": "e9e8a19b1cd4669b113e0389a9e64366aa72ab23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508171517.html", "country": "US", "title": "Uganda: Smelling Uganda's Coffee Aroma", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Uganda: Smelling Uganda's Coffee Aroma", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T14:10:00.000+03:00", "replies_count": 0, "uuid": "e9e8a19b1cd4669b113e0389a9e64366aa72ab23"}, "author": "", "url": "http://allafrica.com/stories/201508171517.html", "ord_in_thread": 0, "title": "Uganda: Smelling Uganda's Coffee Aroma", "locations": ["Uganda"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Uganda: University Administrators Reject Gov't Salary Offer, Vow to Continue Strike \nIndeed, according to the latest report from the UCDA, coffee farmers stand a chance to cash in from their coffee farms. Some 17 million new coffee trees were planted in 2013 alone and that figure could climb to 225 million coffee trees in five years. According to UCDA, farm gate prices in June were in the range of Shs 2,000 - Shs 2,500 per kilo of Kiboko (Robusta dry cherries); Shs 4,300 - Shs 4,700 for FAQ; Arabica parchment sold at between Shs 5,500 - Shs 6,000 per kilo while premium parchment is the most lucrative fetching the farmer between Shs 7,000 - Shs7200 per kilo. Drugar from Kasese was in the range of Shs 4,500 -Shs 5,000 per Kilo. \nGiven these prices, many stakeholder know that coffee is still a very important cog in the fight against poverty. USAID has introduced the two year project with the aim of on increasing coffee productivity for 20,000 smallholder farmers in 22 coffee growing districts. Earlier in April for instance, Uganda got Shs 1.3bn through the USAID-funded initiative that aims at increasing the country's coffee production. The money was channeled through the US governments' Feed the Future Initiative, and implemented by the National Union of Coffee Agribusiness and Farmer Enterprises (Nucafe). \nWhile it is still early to determine the impact of the funding, coffee production is likely to rise amid declining global production and rising consumption levels globally. \nAccording to the June 2015 UCDA report, about 335,400 sixty-kg bags of coffee worth $35.26 million were exported by Ugandan coffee exporters at an average weighted price of US$ 1.75 /kilo, which is 26.75% and 7.43% higher in volume and value respectively compared to the same month in 2014. However, UCDA has projected July exports to be lower at about 300,000 bags. \nIn the coffee year ending June 2015, the global total production was estimated at 141.9 million bags, a decrease of 3.3% from 2013/14 yet though total consumption stood at about 150 million bags, an increase of 2.3% from the previous year. This means that Ugandan coffee producers have to take advantage of the rising global demand and the declining production in the traditional coffee-producing giants so as to cash in. \nIndeed, despite the oscillating drop in coffee exports as a result of drought, UCDA projections indicate that coffee exports may rise to 5.87 million 60-kg bags by 2019-20. The UCDA projections are based on the massive coffee re-planting program that started after the coffee wilt disease and the coffee borer attacked coffee trees in Uganda. \nUgacof still commands the highest market share with 16.3% (54,667 bags) but its export volumes also declined from the 18% of the previous month. Ugacof General Manager Kailash Natani told The Independent that while local consumption of coffee has grown, their main worry is not competition from imported products but the export market. He attributed the oscillating drop in coffee exports to the effects of climate change, poor post-harvest handling and the issue of logistics. \nTo supplement government efforts in coffee production, the sector industry players have taken the bull by the horns and are engaging contract growers. Indeed, UGACOF has launched a coffee sustainability project that covers several districts in Busoga and Central region covering more than 30,000 farmers. \nMicheal Nuwagaba, the chief operations manager at UGACOF, says, the over $1 million (about Shs 3.3 billion) three-year project distributes planting materials, sensitizes farmers on formation of savings and loan associations to ease access to credit, post-harvest handling, good agricultural practices among others. Vincent Bamulangaki Ssempijja, the state minister for agriculture, says Uganda has the capacity to produce more coffee than Vietnam, the world second largest producer, given that Uganda's coffee \"has ready market because it is high quality coffee and used for blending.\" The government aims to boost coffee exports by mitigating the supply-side constraints by distributing free seedlings, and re-establishing extension staff to reach the most remote farmer and establishing demonstration model farms and coffee cooperatives supporting value addition. \nHowever, Gerald Sendaula, a former finance minister and the current chairman of the National Union of Coffee Agribusiness Farmers and Enterprises (NUCAFE), is not yet convinced. He said Uganda's coffee industry still has a couple of challenges ranging from farmers' ignorance to crop problems, which can only be dealt with through legislation, which Uganda lacks at the moment. \"Without a coffee law in place to improve coffee quality, Uganda could be headed for bad times,\" he said. \nUganda has continued exporting raw coffee beans although local consumption is growing with value addition also slowly beginning to take root through the investments of indigenous companies that include Good African Coffee, Mount Elgon Coffee, and Star Café among others. Uganda \nBetty Oweka Ojok, a registered midwife, joined St Joseph's Hospital in Kitgum in 2003, the hospital was implementing the … see more » Copyright © 2015 The Independent. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-17T14:10:00.000+03:00", "crawled": "2015-08-17T16:51:07.267+03:00", "highlightTitle": ""}