{"organizations": [], "uuid": "7cf307eae83a3e5d47e1249c240ca10ed5153016", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/06/australia-economy-employment-idUSL3N10H0Y520150806", "country": "US", "title": "UPDATE 1-Australia creates more jobs, but also more jobless", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Australia creates more jobs, but also more jobless | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T07:17:00.000+03:00", "replies_count": 0, "uuid": "7cf307eae83a3e5d47e1249c240ca10ed5153016"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/06/australia-economy-employment-idUSL3N10H0Y520150806", "ord_in_thread": 0, "title": "UPDATE 1-Australia creates more jobs, but also more jobless", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Employment +38,500 in July vs forecasts of +10,000\n* Unemployment at 6.3 pct, full-time jobs jump 12,400\n* Data too mixed to alter outlook for steady rates\nBy Charlotte Greenfield\nSYDNEY, Aug 6 (Reuters) - Australia's unemployment rate rose to its highest in six months in July even as the number of jobs added shot up almost four times more than expected, a mixed bag that did little to clarify the outlook for another rate cut.\nThursday's data from the Australian Bureau of Statistics showed 38,500 new jobs were added in July, far higher than the 10,000 analysts expected.\nYet the jobless rate also surprised by ticking up to 6.3 percent, from a revised 6.1 percent the month before.\nThe rise in unemployment was greeted with optimism by some analysts as it was driven by more people entering the workforce. The participation rate climbed to its highest in two years at 65.1 percent.\n\"We did see the unemployment rate rise but given job growth has also been quite strong, it's still a positive. The jump in the unemployment rate was because the participation rate jumped, and that means more workers are looking for jobs,\" said Janu Chan, an economist at St George.\nMarkets were nonplussed by the data with the local dollar first climbing over a third of a U.S. cent, only for it to lapse back to $0.7330 as investors reacted to the unemployment figure.\nThe mixed numbers were thought unlikely to have a large impact on the Reserve Bank of Australia's (RBA) next meeting to set interest rates, after it held its cash rate steady at record lows of 2.0 percent in August.\n\"It doesn't change the overall view that there's plenty of spare capacity in the labour market and the economy in general. We still see the RBA holding steady for some time to come,\" said Skye Masters, head of interest strategy at NAB.\nInterbank futures <0#YIB:> were little changed, implying around a 50-50 chance of an easing by Christmas.\nDespite unemployment edging up, Australia's labour market has been surprisingly resilient compared to the overall economy.\nJob gains have beaten market forecasts for seven of the past nine months and annual employment growth of 2.1 percent is as fast as that of the United States.\nHowever, the labour force is expanding even faster thanks to brisk population growth and a higher participation rate. While a strong 243,600 net new jobs were created in the year to July, the workforce rose by 275,400.\nThe RBA has been puzzled at the resilience of employment given the economy overall is growing below potential at around 2.5 percent.\nAmong the possible explanations include that subdued wages were making labour more attractive or that the economy's potential speed limit might now be lower than in the past, a phenomenon seen in many developed nations. (Reporting by Charlotte Greenfield; Editing by Eric Meijer)", "external_links": [], "published": "2015-08-06T07:17:00.000+03:00", "crawled": "2015-08-06T06:46:47.122+03:00", "highlightTitle": ""}