{"organizations": ["Edge Technology Services", "Microsoft Excel"], "uuid": "43b75e6725063afdfd85e553abf173e34e94f35e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.simplyhired.com", "main_image": "", "site_section": "http://www.simplyhired.com/a/job-feed/rss/o-13205", "section_title": "Finance jobs | Simply Hired", "url": "http://www.simplyhired.com/job/xcpzhs5nyc", "country": "US", "title": "Financial Analyst at Edge Technology Services (South Windsor, CT)", "performance_score": 0, "site": "simplyhired.com", "participants_count": 0, "title_full": "Financial Analyst at Edge Technology Services (South Windsor, CT)", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T12:23:00.000+03:00", "replies_count": 0, "uuid": "43b75e6725063afdfd85e553abf173e34e94f35e"}, "author": "", "url": "http://www.simplyhired.com/job/xcpzhs5nyc", "ord_in_thread": 0, "title": "Financial Analyst at Edge Technology Services (South Windsor, CT)", "locations": ["South Windsor"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Source: Dice FINANCIAL ANALYST PURPOSE OF JOB To provide Leadership Team, CFO and Controller with insight, and analysis of financial statements, sales and pricing with attention to customer and item profitability. RESPONSIBILITIES Prepare monthly financial statement review package with commentary and analysis of results vs. prior year and target. Review Marketing, Rebate, Promotional and other Programs offered to customersdistributors for profitability and sales growth. Develop and prepare customer and item profitability and contribution margin statements. Prepare and publish weekly management report. Assist with the organization and preparation of annual sales and profit targets. Assist with the preparation and review of product pricing exercises. Audit Customer Pricing for results vs. anticipated profit margins. Develop and prepare departmental cost center expense reporting. Develop, maintain and distribute ad-hoc reports and financial models as required. QUALIFICATIONS AND SKILLS The requirements below are representative of the knowledge, skills, andor abilities that an individual must possess to perform the essential functions of this job Possess advanced clerical, oral, and written communication skills Excellent organizational and planning skills, impeccable follow-up and exceptional attention to detail Advanced knowledge and experience with Microsoft Excel, Word, Access and PowerPoint Experience with ERP Systems and data-mining, QAD a plus Ability to multitask and maintain confidentiality of information Must maintain professional demeanor EDUCATIONEXPERIENCE Bachelorrsquos Degree in Accounting, Finance or Economics MBA a plus Minimum of 5 years of experience in a Financial Analyst role customerproduct profitability experience a plus To provide Leadership Team, CFO and Controller with insight, and analysis of financial statements, sales and pricing with attention to customer and item profitability.", "external_links": [], "published": "2015-08-27T12:23:00.000+03:00", "crawled": "2015-08-27T13:45:08.432+03:00", "highlightTitle": ""}