{"organizations": [], "uuid": "039a5757db4a7f7d5a0a826868fb1cc2eabf7ae5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/10/12897245/Amercanex - Medicine Man Logo.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12897245.htm", "country": "US", "title": "Award Winning Cultivator / Dispensary Medicine Man Joins the Amercanex ACE Marketplace to Optimize Wholesale Distribution Practices & Increase Footprint in the Market", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Award Winning Cultivator / Dispensary Medicine Man Joins the Amercanex ACE Marketplace to Optimize Wholesale Distribution Practices & Increase Footprint in the Market", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "039a5757db4a7f7d5a0a826868fb1cc2eabf7ae5"}, "author": "Robert Ruiz", "url": "http://www.prweb.com/releases/2015/08/prweb12897245.htm", "ord_in_thread": 0, "title": "Award Winning Cultivator / Dispensary Medicine Man Joins the Amercanex ACE Marketplace to Optimize Wholesale Distribution Practices & Increase Footprint in the Market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amercanex, the American Cannabis Exchange, today announced a key strategic partnership with Medicine Man, a premiere Cultivator / Dispensary. Medicine Man will be conducting their wholesale distribution thru Amercanex proprietary web-based platform, the ACE Marketplace. Medicine Man joins the exchange as the largest single cultivation / dispensary in Colorado with over 5 years of operational experience in the cannabis industry. They serve both medical and recreational marijuana and plan to leverage their business and market opportunities operating on Amercanex’s online marketplace. Since 2009, Medicine Man has experienced an ever changing marketplace. They have been successful in meeting each challenge and becoming one of the leading cannabis companies in the industry. “I’m excited about our partnership with one of the most successful and innovative teams in the industry. Medicine Man brings a level of professional experience that will immediately benefit all transacting members and the ACE Marketplace as a whole” says CEO, Steve Janjic. “Medicine Man’s expansive knowledge, plus experience of the cannabis market with an unrelenting focus on producing only the highest quality of marijuana is available for all our clients. We’re proud to have them as a member of our exchange”.\nAmercanex is driven to be considered the premiere wholesale transparent electronic marketplace by industry professionals as well as state government and regulatory enforcement bodies. Due to the changing dynamics of an increasingly competitive market, business owners are looking for innovative business practices to stay in the game and expand their market opportunities. Joining forces with Amercanex provides Medicine Man with a cutting edge infrastructure, a comprehensive suite of tools for order monitoring and regulatory reporting. Medicine Man will now have the advantage of these capabilities and other Amercanex features that will provide solutions to grow their customer base and make strategic business decisions that will ultimately take their sales and marketing to its highest potential.\n“Our partnership with Amercanex will allow us to streamline our wholesale process and bring our high-quality product to customers who may not have reached out to us in the past. We see this platform as a huge time and ultimately cost saver,” says Sally Vander Veer, Medicine Man’s - President.\nHow It Works\nLicensed marijuana business owners who purchase products from Medicine Man, will eventually become Amercanex Transacting Members by purchasing or leasing an ACE Marketplace Seat and successfully completing the vetting process. Information regarding how to purchase or lease a Seat on the ACE Marketplace can be found on their company website ( http://www.amercanex.com ). All Medicine Man customers who become an Amercanex Transacting Member, will also receive all of the featured benefits that Amercanex has to offer. The ACE Marketplace will provide clients with full market transparency and greater control of the buy/sell process, enabling better pricing through transparency, full regulatory reporting and ultimately lowering costs. This opportunity provides ACE Transacting Members with an online platform which can drive real-time response to market opportunities. Implementation of transportation services including the ability to calculate both transportation and tax costs as a function of the overall transaction within the ACE Marketplace will assist both Amercanex and Medicine Man in strengthening their relationships with customers and partners, increase productivity and reduce overall costs.\nAbout Amercanex\nThe ACE Marketplace, powered by Amercanex (American Cannabis Exchange) is a web-based user-interface, offering a comprehensive suite of tools and solutions tailored to address a diverse client base. We’ve integrated over a thousand years of commodity market evolution into one simple, stable, transparent, compliant, price driven marketplace and as such, we believe Amercanex and the ACE Marketplace are invaluable instruments needed to help usher in a new age for the Cannabis Industry. To learn more about Amercanex, please visit http://www.amercanex.com .\nAmercanex contact:\nRobert Ruiz, Chief Marketing Officer\nAmercanex Inc. 720.360.1200\nrruiz(at)amercanex(dot)com\nNothing above or herein constitutes investment advice or an offer, or solicitation of an offer, to buy or sell any financial product. To the maximum extent of the law, Amercanex Corporation and the ACE Marketplace accept no responsibility for any reliance placed on the contents of this document and accepts no liability for any direct, indirect or any other loss arising out of any use of the information contained in this document or any omission from it. The ACE Marketplace is not available to non-licensed/ authorized participants. It is not intended for distribution to, or use by any, person or entity in any jurisdiction or country where such distribution or use would be contrary to any applicable law or regulation.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5hbWVyY2FuZXguY29t"], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-11T13:34:49.161+03:00", "highlightTitle": ""}