{"organizations": [], "uuid": "c98181a4623f94655c56b30fe7e0a5b904d0dc26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KA522_portne_G_20150826160055.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/port-of-new-york-and-new-jersey-saw-record-container-traffic-in-july-1440621964", "country": "", "title": "Port of New York and New Jersey Saw Record Container Traffic in July", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "Port of New York and New Jersey Saw Record Container Traffic in July - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T00:46:00.000+03:00", "replies_count": 0, "uuid": "c98181a4623f94655c56b30fe7e0a5b904d0dc26"}, "author": "Robbie Whelan", "url": "http://www.wsj.com/articles/port-of-new-york-and-new-jersey-saw-record-container-traffic-in-july-1440621964", "ord_in_thread": 0, "title": "Port of New York and New Jersey Saw Record Container Traffic in July", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS The Port of New York and New Jersey handled a record number of shipping containers in July, though the pace of growth eased from the torrid rates seen in recent months.\nThe port complex saw total traffic rise last month to 588,918 twenty-foot equivalent units, the standard measure for containers, a gain of 14.1% from a year earlier and 4.7% higher than June, when volumes also set an all-time high. July’s pace of annual growth was slightly faster than the 13.5% growth rate the port saw through the first seven months of 2015.\nEast Coast ports have seen a surge in container volumes in 2015 as shipping lines diverted vessels away from West Coast ports that saw disruptions tied to labor strife earlier this year. However, ports along the East Coast saw the rate of growth tail off in July. Traffic is also rebounding on the West Coast, with ports from Long Beach to Seattle reporting strong increases in container volumes last month. Together, the numbers indicate that shipping routes are slowly returning to normal, analysts say.\ntop logistics news\nGet the latest logistics and supply chain news and analysis via an email newsletter. Sign up here. New York and New Jersey also saw a smaller increase in imports of loaded containers, a measure of the amount of goods entering the country through the port. Loaded-container imports grew 11.% in July, the slowest pace since April.\nStill, the strong port volumes on both coasts are a sign that U.S. imports as a whole remain strong, defying signs of a slowdown in global trade and unease about the economic health of major trade partners, said Jonathan Starks, an analyst with FTR Transportation Intelligence.\nFTR predicts that U.S. imports will grow 5.5% in 2015, compared with 3.4% in 2014. Mr. Starks predicts that any potential results of a recent currency devaluation and stock-market turbulence in China will not show up in U.S. port trade numbers until September results are released in the fourth quarter.\n“You’ve got a strong dollar, which will help the import side, and the Chinese government trying to improve their import numbers and devaluing the yuan specifically to do that,” Mr. Starks said. “We think that on the whole, import numbers are going to be pretty robust this year.”\nWrite to Robbie Whelan at robbie.whelan@wsj.com", "external_links": [], "published": "2015-08-27T00:46:00.000+03:00", "crawled": "2015-08-26T23:52:28.230+03:00", "highlightTitle": ""}