{"organizations": [], "uuid": "dd888682b3c73144210e8ec5ef207e6007023a19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/s/m/9/b/image.related.afrArticleLead.620x365.giwpjg.png/1439282020390.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/currencies/chinas-shock-currency-move-is-fiendishly-convenient-20150811-giwpjg", "country": "AU", "title": "China's shock currency move is fiendishly convenient", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "China's shock currency move is fiendishly convenient | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T15:27:00.000+03:00", "replies_count": 0, "uuid": "dd888682b3c73144210e8ec5ef207e6007023a19"}, "author": "Jonathan Shapiro", "url": "http://www.afr.com/markets/currencies/chinas-shock-currency-move-is-fiendishly-convenient-20150811-giwpjg", "ord_in_thread": 0, "title": "China's shock currency move is fiendishly convenient", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A shock devaluation has left analysts asking whether China is moving further away or closer towards a freely floating exchange rate. AFP Share on twitter by Jonathan Shapiro China's surprise move to \"devalue\" the renminbi has left analysts wondering if policymakers are blatantly entering a global currency war or doing the precise opposite – preparing the currency to float freely.\nThe devaluation has been framed by the Chinese central bank as a move towards a market-set exchange as it moves its currency fix closer to, but below, the spot price. But there's certainly a strong feeling that this is a much-needed intervention aimed at coming to the aid of the economy by boosting export competitiveness.\nThe Australian dollar plunged more than 1 per cent in response to China's move. In late local trade the Aussie was fetching US73.17¢, compared with US73.75¢ at the same time on Monday, and an intraday high of US74.36¢.\nJPMorgan analysts believe the move is \"first and foremost and economic move\" driven in part by pressure from government ministries to reverse the appreciation of the currency that has weighed on its export sector.\nCiti analysts however believe the move has come about due a combination of market pressures and the review by the International Monetary Fund to grant the renminbi, Special Drawing Rights (SDR) status, a step towards official government investors holding the currency.\nMost experts agree that despite this apparent one-off move the long term resolve of the Chinese policymakers to open up their capital markets will not change.\nBut for the rest of the world, and in particular China's large trading partners, the surprise move, particularly if it's the first move in a longer term depreciation, could have major implications.\nSince China exports goods to the world a lower currency effectively unleashes more deflationary forces – lower prices – to the rest of the world. This adds to the deflationary force of declining commodity prices as a result of softer demand from China.\n \"This is just as impactful as the oil price dropping,\" says AllianceBernstein's Hong Kong based portfolio manager Hayden Briscoe.\n\"Everyone trades with China and every commodity based currency is under pressure because they have lost some revenue on that devaluation.\"\nAustralia to receive less for commodity exports That would include Australia which all things being equal will receive less for its commodity exports.\nThe impact might take some time to be felt but with more deflationary forces unleashed the likelihood of global interest rates rising is reduced.\nMuch of the initial reaction has been that such devaluation will delay acceptance by the International Monetary Fund of the RMB to qualify for SDR status, paving the way for official government investors to buy the currency for their foreign exchange reserves.\nHowever China's devaluation is devilishly shrewd in that can argued the move lower, and a convenient one at that, is a step towards meeting the criteria set out by the IMF. The renminbi has traded at the lower end of its defined band in the face of a strong US dollar, so by moving its fix to that point it does in fact move the currency closer to the \"market\" price.\nThis devaluation may however create some issues when President Xi visits Washington next month to discuss a new bilateral trade agreement. With the subject of currency devaluation already a source of tension in negotiating trade deals with Europe and Japan, US politicians may not take kindly to China's actions.\nBriscoe says the importance of SDR inclusion may be overstated. A major development already occurred last month when China opened up its capital accounts by allowing official investors to access its bond markets, which he believes they will.\nThe next step is to open up the bond markets to institutional investors. Policymakers have already made great strides to shift lending from the banks to reduce systemic risk and for credit pricing to be set by markets. Its all part of a carefully planned move by policymakers that subject to a few twists and turns, aims to open up its capital markets and establish the renminbi as a reserve currency.\nThe physical marketplace is embracing the currency far quicker than the financial marketplace but fund managers like Briscoe believe it's inevitable. China has become \"too big for the world\" – it no longer wants record trade surpluses and accumulates trillions of dollars of US dollars.\n\"They don't want to be forced into buying US Treasuries they would rather buy countries or plots of land or companies but because they got too big because they can't. They don't want to settle anything in US dollars. They want to take back control of their exports and imports and settle in renminbi.\"", "external_links": ["https://twitter.com/johnnyshap"], "published": "2015-08-11T15:27:00.000+03:00", "crawled": "2015-08-11T20:53:20.209+03:00", "highlightTitle": ""}