{"organizations": [], "uuid": "62be0ac7faac1b3529d9d831a8d1456310bc970e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/ansell-shares-slump-outlook-071014345.html", "country": "GB", "title": "Ansell shares slump on outlook", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Ansell shares slump on outlook", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T10:10:00.000+03:00", "replies_count": 0, "uuid": "62be0ac7faac1b3529d9d831a8d1456310bc970e"}, "author": "", "url": "https://au.finance.yahoo.com/news/ansell-shares-slump-outlook-071014345.html", "ord_in_thread": 0, "title": "Ansell shares slump on outlook", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ansell"], "text": "Mon, Aug 10, 2015, 5:14 PM AEST - Australia Markets closed Ansell shares slump on outlook AAP – 4 minutes 9 seconds ago Recommend Print \nInvestors have pummelled Ansell shares after the gloves and condom maker flagged a weaker performance this year, partly due to a stronger US dollar. \nAnsell shares slumped $3.91, or 15.8 per cent, to $20.84 on Monday, their lowest level in about seven months. \nThe company booked a net profit of $US187.5 million for the 2014/15 financial year, up from $US41.8 million a year earlier, and a 20 per cent improvement when the previous year's one-off writedown is excluded. \nBut CMC Markets chief market strategist Michael McCarthy said Ansell's cautious guidance had resulted in investors marking down the company hard. \n\"Despite the lift in profit from Ansell, the outlook is concerning and there's potential for a downwards revision of earnings,\" Mr McCarthy said. \nChief executive Magnus Nicolin described Ansell's financial results as solid but not spectacular - boosted by benefits from acquisitions but pulled back by foreign exchange movements. \nThe company's revenue currencies - the euro, the Canadian dollar and the Australian dollar - have all fallen against the US dollar, while cost currencies such as the Sri Lankan rupee and the Chinese renminbi are rising. \nTogether with mixed global economic conditions and changes to Ansell's effective tax rate, that made guidance for the 2015/16 financial year more complicated than normal, Mr Nicolin said. \n\"Currency rates are assumed to remain similar to the average levels seen in the fourth quarter of fiscal 2015, resulting in a further expected $US55 million negative impact to revenue and $US30 million impact to EBIT (earnings before interest and tax) including the impact of lower hedging gains,\" Ansell said. \nThe company has forecast earnings per share in 2015/16 in the range of $US1.05 to $US1.20, down from $US1.225 in 2014/15. \nIt also said growth in north America, its biggest source of revenue, had slowed in the second half, and the eurozone was experiencing slow, modest growth. \nSales in key emerging markets Russia and Brazil were also falling. \n\"Whilst a moderate improvement in economic conditions is anticipated by most economic forecasters, it is also recognised there is significant uncertainty around these projections in both emerging and developed markets,\" Ansell said. \nANSELL TROUBLED BY RISING US DOLLAR \n* Net profit of $US188m up from $US41.8m \n* Revenue up 3.5 pct to $US1.65b \n* Final dividend up one cent to 23 US cents, unfranked @y7finance on Twitter, become a fan on Facebook BHP to slash 380 jobs at SA mine AAP \nMining giant BHP Billiton will slash 380 jobs at its Olympic Dam copper and uranium mine, in another blow to South …", "external_links": [], "published": "2015-08-10T10:10:00.000+03:00", "crawled": "2015-08-10T10:16:25.520+03:00", "highlightTitle": ""}