{"organizations": [], "uuid": "4e22624cb9f9de1a10c161ef69ccb5b92eca7ab5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/h/c/5/d/image.related.afrArticleLead.620x365.gixfjq.png/1439374880113.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/personal-finance/shares/anz-cba-capital-raisings-good-news-for-investors-20150812-gixfjq", "country": "AU", "title": "ANZ, CBA capital raisings good news for investors", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "ANZ, CBA capital raisings good news for investors | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T12:56:00.000+03:00", "replies_count": 0, "uuid": "4e22624cb9f9de1a10c161ef69ccb5b92eca7ab5"}, "author": "Trevor Sykes", "url": "http://www.afr.com/personal-finance/shares/anz-cba-capital-raisings-good-news-for-investors-20150812-gixfjq", "ord_in_thread": 0, "title": "ANZ, CBA capital raisings good news for investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The big four banks' new equity issues are a gift as they are being sold at a discount to the stocks' ASX value. Chris Pearce Maybe they were, but not by much. The big four look as sound as any in the world. They certainly look stronger than most of the Continental banks which are holding sovereign debt of shaky European nations.\nIndeed, a cynic would suspect that the higher Tier 1 requirements here are merely an exercise in backside-covering by APRA just in case there is a banking panic at some later time.\nWhatever the reason, small shareholders should be celebrating because they can add shares to their portfolio at bargain prices.\nPlacements offered at discounts to ASX values\n Commonwealth Bank's $5 billion capital raising is a perfect example. Investors will be able to buy one share for every 23 held at $71.50, which is a 10.5 per cent discount on Tuesday's close. It's also a 25 per cent discount on CBA's peak share price of $96, which was only reached last March.\nThis is as close as the share market ever gets to Santa Claus. The downside is that few shareholders will be able to pick up many shares, but you can't have everything. The corollary is that the issue will only dilute shareholders by 4.3 per cent, a negligible proportion in a leading bank.\nThe CBA issue is even more generous than recent ones by the ANZ and NAB.\nNAB raised $5.5 billion in May with an issue at $28.50, which was the lowest price for NAB shares in two years. NAB shares have held well above that price since the new stock was listed on June 12.\nThe ANZ issue announced on August 6 was a small surprise , because analysts thought it would raise the needed capital through its dividend reinvestment scheme.\nANZ is raising $3 billion, of which $2.5 billion was through an underwritten placement at $30.95 (a 5 per cent discount to the previous day's close). The remaining $500m will be raised through a share purchase plan (SPP) under which shareholders will be able to buy up to $15,000 worth of stock. The SPP shares will be priced at the lower of $30.95 or the volume weighted average price of ANZ shares over the five days before the SPP, plus a 2 per cent discount.\nBecause of those terms, ANZ shares have fallen like a brick ahead of the SPP, which looks like being a bargain entry into the bank.\nBear analyst becomes underwriter\nIt was amusing to see that one of the underwriters of the $2.5 billion placement was Citigroup Global Markets Australia. Back in March, Citi Research was a prominent bear on Big Four share prices.\nCiti then said: \"We maintain our sell ratings on the major banks given that we expect retail revenue growth to moderate and overall capital generation to be relatively weaker amid a continued backdrop of higher capital requirements while valuations remain high.\"\nBack then, ANZ shares were hovering between $36.50 and $37. But once they got down to $30.95, Citi was happy to underwrite them.\nSmall shareholders (who are chronically kept in the dark like mushrooms) can fairly assume that Citi must now think bank shares are a buy instead of a sell.\nThe missing name here is Westpac, which has not announced what it will do. It's a reasonable bet that the market will keep WBC shares low in the hope that they will be pitched even lower in any upcoming issue.\nSo it's good news for anyone holding any of the big four. If you don't hold any of them, perhaps it's time you reviewed your portfolio.\nDisclosure: Trevor Sykes has interests in ANZ, CBA and WBC and intends to grab any new shares he can.", "external_links": [], "published": "2015-08-12T12:56:00.000+03:00", "crawled": "2015-08-12T15:12:19.409+03:00", "highlightTitle": ""}