{"organizations": [], "uuid": "82b97cf7d66d37187522ea2d4c8a3bf912cd334b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508101378.html", "country": "US", "title": "East Africa: Uganda and Kenya in Race to Connect Juba to SGR", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "East Africa: Uganda and Kenya in Race to Connect Juba to SGR", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T13:31:00.000+03:00", "replies_count": 0, "uuid": "82b97cf7d66d37187522ea2d4c8a3bf912cd334b"}, "author": "", "url": "http://allafrica.com/stories/201508101378.html", "ord_in_thread": 0, "title": "East Africa: Uganda and Kenya in Race to Connect Juba to SGR", "locations": ["Kenya", "Uganda", "Bentiu"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Sudan: Women's Horror Rape Stories in Bentiu \nPresident Kagame wondered why Uganda was giving priority to developing an SGR connection to South Sudan, which is yet to become an EAC member, at the expense of Kigali, which has all along been proactive in promoting the regional project. \nAlthough South Sudan was looped in recently, the Northern Corridor SGR project was originally conceived to offer an efficient rail connection between the port of Mombasa and Burundi, but dithering by Bujumbura saw the three partners push ahead. \nThe EastAfrican has learnt that without President Kagame's intervention, the SGR connection to Kigali ranked a distant third, or even fourth in Kampala's priority. \nKigali would have had to wait until as late as 2020 for the development of the Kampala-Bihanga-Mirama Hills line. \n\"The thinking was that in both economic and financial terms, because of the challenging terrain south of Bihanga and distance to Mirama hills, Uganda would be required to shoulder a bigger financial burden than Rwanda to develop this connection and yet at the end of the day we would have to share Rwanda bound traffic with Tanzania,\" said an official familiar with the deal. \nPrivately, Ugandan planners believe that planned SGR developments by Tanzania and Burundi offer a cheaper and a more natural connection for Rwanda because of favourable terrain that translates into a lower development cost. \nAccording to studies Uganda conducted in 2009 ahead of the rehabilitation of the Tororo Pakwach metre gauge line, even then, the northern route trumped the western Kampala-Kasese line in viability, a variable that would not change even when Uganda decided to upgrade to the standard gauge. \nOil production \nOfficials familiar with the study say anticipated oil production and the need to divert oil industry related traffic from road to rail returned better numbers for the northern line. \nWhen South Sudan-bound traffic was factored in, the numbers tilted heavily in favour of the Malaba-Gulu-Nimule Pakwach line. Uganda expects to begin the ramp up to oil production in the 2018-20 timeframe and having an SGR connection in place would capture much of the associated traffic. \nMombasa port statistics show that South Sudan accounts for the second largest volume of transit cargo after Uganda. According to figures for the five years to 2014, Uganda bound traffic through the port averaged 77 per cent of gross transit volumes followed by South Sudan at 11.5 per cent and Rwanda third at 3.9 per cent. \nAccording to Charles Kateba, managing director of Uganda Railways, after considering all the factors, Kampala concluded that in a limited resource setting, the route to Nimule and Pakwach would not only attract a lower development cost because of an even terrain but also had better long-term viability than the Kigali line. \n\"While there is a sentimental attachment to South Sudan and a need to draw it south for both political and economic considerations, the northern line promised immediate economic and financial benefits for Uganda,\" Mr Kateba said. \nOne of these stems from the current revenue sharing ratio between Kenya and Uganda in the RVR concession. \nBecause Uganda currently accounts for only 20 per cent of the track between Mombasa and Kampala, it is taking home only one dollar for every four that Kenya earns from the concession. This is despite contributing a significant portion of the rolling stock. \nWith a healthy volume of South Sudan bound traffic, a connection to Juba via Nimule would increase the distance trains travel on the Ugandan SGR network and improve the ratio of Uganda's earnings to 1:2. \nAlthough it has not been stated publicly, Uganda feels the short track relative to the high number of wagons and trains it contributes mean Kenya is earning more from the concession, partly using Ugandan assets. \nAccording to Mr Kateba, under international best practices, getting a fair through-tariff would require each operation to contribute rolling stock relative to its network length. That way, Kenya Railways will be required to provide four wagons for one by Uganda. \nBut because of internal constraints, none of the two operations has sufficient rolling stock and expedience dictates that the best use is made of available resources for the concessionaire to meet its contractual targets. \nAccording to independent sources, there has also been a quiet race between Kampala and Nairobi to develop the SGR connection to Juba because whoever achieves it first, effectively defers development of the other. East Africa \nKenyan companies operating subsidiaries in South Sudan are feeling the heat of political and foreign currency volatility … see more » Copyright © 2015 The East African. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-10T13:31:00.000+03:00", "crawled": "2015-08-10T14:57:57.981+03:00", "highlightTitle": ""}