{"organizations": [], "uuid": "ca78d428933798daf2d65b3d0e1013a850cfcf2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/05/sec-swaps-waivers-idUSL1N10G1KM20150805", "country": "US", "title": "UPDATE 1-US SEC debates rule governing waiver process for swap dealing firms", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-US SEC debates rule governing waiver process for swap dealing firms | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:31:00.000+03:00", "replies_count": 0, "uuid": "ca78d428933798daf2d65b3d0e1013a850cfcf2d"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/05/sec-swaps-waivers-idUSL1N10G1KM20150805", "ord_in_thread": 0, "title": "UPDATE 1-US SEC debates rule governing waiver process for swap dealing firms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Updates with votes on the rules, comments from commissioners)\nBy Sarah N. Lynch\nWASHINGTON Aug 5 (Reuters) - The debate over granting waivers to people with a history of regulatory violations heated up on Wednesday, when U.S. securities regulators proposed a process that would permit swap dealers to do business with those who have broken the law.\nThe plan would permit large swap-dealing banks like Goldman Sachs or Morgan Stanley to petition the SEC for waivers so they can employ or do business with individuals who have criminal convictions or were found liable for civil violations, such as fraud.\nThe issue of granting waivers has been controversial at the SEC since last year, when Democratic Commissioner Kara Stein started questioning whether the agency was too often granting waivers to big banks that break the law.\nSuch waivers permit them to continue normal business operations, even if they have been convicted of a crime or found liable for civil fraud.\nIn some cases, companies or individuals who break the law are automatically disqualified from engaging in certain activities, such as private capital-raising, unless the SEC grants them an exception.\nThe SEC's plan aims to address a measure in the 2010 Dodd-Frank Wall Street reform law, which gives the SEC new powers to police over-the-counter swaps that derive their underlying value from equity or debt products.\nLarge dealers must register with the SEC and abide by rules on capital, margins and business conduct.\nThe law states that dealers or major traders are prohibited from employing or doing business with staffers who are statutorily \"disqualified\" from participating in the securities industry due to prior misconduct.\nHowever, the law gives the SEC wiggle room to grant exemptions.\nUnder the SEC's plan, dealers will get a temporary, 30-day exclusion to permit them to keep working with disqualified people. They can also apply for a permanent exception.\nDealers would also be required to conduct background checks on workers.\nThe SEC was split over the plan, with some saying it was too convoluted and others that it lacked teeth.\nStein said it has a \"fatal flaw,\" by \"unconditionally\" recognizing waivers that may have been granted by other regulators.\nRepublican SEC Commissioner Michael Piwowar, meanwhile, said the plan would create \"another complicated waiver process that is sure to confound future Commissions.\"\nSeparately on Wednesday, the SEC also adopted long-awaited rules requiring dealers to register with the agency. But they will not kick in until the agency completes other swaps rules first. (Editing by Jeffrey Benkoe)", "external_links": [], "published": "2015-08-05T19:31:00.000+03:00", "crawled": "2015-08-05T18:44:16.807+03:00", "highlightTitle": ""}