{"organizations": [], "uuid": "38937e1e89ec4291506efb2757cb7f6c4dcc877d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cpexecutive.com", "main_image": "", "site_section": "http://www.cpexecutive.com/category/finance/feed/", "section_title": "Commercial Property Executive | Finance", "url": "http://www.cpexecutive.com/property-types/office/capital-one-boosts-brookfield-in-the-capital/1004125252.html", "country": "US", "title": "Capital One Boosts Brookfield in the Capital", "performance_score": 0, "site": "cpexecutive.com", "participants_count": 1, "title_full": "Capital One Boosts Brookfield in the Capital", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T18:28:00.000+03:00", "replies_count": 0, "uuid": "38937e1e89ec4291506efb2757cb7f6c4dcc877d"}, "author": "Paul Rosta", "url": "http://www.cpexecutive.com/property-types/office/capital-one-boosts-brookfield-in-the-capital/1004125252.html", "ord_in_thread": 0, "title": "Capital One Boosts Brookfield in the Capital", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Capital One Boosts Brookfield in the Capital \nBy Barbra Murray, Contributing Editor \nCapital One isn’t shy about doling out hefty loans for the right borrower and the right property. As a case in point, the financial services firm’s commercial real estate group recently closed a $110 million loan for Brookfield Asset Management’s Brookfield Real Estate Opportunity Fund I, which used the proceeds to refinance 64 New York Ave. NE, a 355,000-square-foot office building in Washington, D.C. \nWhen it comes to obtaining financing, there’s much to be said for a solid relationship. “Brookfield is a long-time client of Capital One with whom we value as a trusted and reputable entity,” Michael Sleece, senior vice president with Capital One, told Commercial Property Executive . \nCapital One, serving as sole lead agent, sole bookrunner, and administrative agent, provided Brookfield with a senior secured, non-recourse loan. The decision to supply the relatively large sum, however, was based on more than just a good relationship. \n“The quality of the sponsorship in Brookfield is unparalleled and it is an entity that has a long and successful track record in the D.C. office market,” Sleece explained. “Additionally, the property is well in excess of 90 percent leased under long-term leases to the (city) government, providing long-term stable cash flows.” Tenants include the city of Washington’s Department of Human Services and Mental Health. \nBrookfield has owned the six-story tower, located on a five-acre parcel in the NoMa/Capitol Hill submarket, since 2005, and last refinanced the asset in 2013 with a $95.5 million first mortgage loan though Mesa West Capital. \n“The team at Capital One understands our business model and our commitment to improving the properties we purchase and realizing their potential value,” Seamus Foran, senior vice president with Brookfield, said in a statement. “It is refreshing to work with a lender that devotes itself to helping us achieve our goals.”", "external_links": [], "published": "2015-08-13T18:28:00.000+03:00", "crawled": "2015-08-14T03:31:52.931+03:00", "highlightTitle": ""}