{"organizations": ["Royal Challengers Bangalore", "Chennai Super Kings"], "uuid": "a737eca5954e782d4a9e192c4bd3e47a64496971", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/5/07651d74-283e-402d-80fd-4c9cedbfee19MediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Business\r", "section_title": "Business News, Personal Finance, Financial News, India Stock Market Investing", "url": "http://www.hindustantimes.com/business-news/how-cricket-builds-brands-old-and-new/article1-1377751.aspx", "country": "IN", "title": "How cricket helps build brands, old and new", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "How cricket helps build brands, old and new", "spam_score": 0.0, "site_type": "news", "published": "2015-08-08T06:57:00.000+03:00", "replies_count": 0, "uuid": "a737eca5954e782d4a9e192c4bd3e47a64496971"}, "author": "", "url": "http://www.hindustantimes.com/business-news/how-cricket-builds-brands-old-and-new/article1-1377751.aspx", "ord_in_thread": 0, "title": "How cricket helps build brands, old and new", "locations": ["MA Chidambaram Stadium", "Chennai", "Chepauk"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Virendra Singh", "Virat Kohli"], "text": "| Updated: Aug 08, 2015 09:47 IST Royal Challengers Bangalore (RCB) skipper Virat Kohli in action against Chennai Super Kings (CSK) during his team's IPL 2015 match at MA Chidambaram Stadium in Chepauk, Chennai. (Virendra Singh Gosain/HT Photo) \nHappy memory from the 1987 Cricket World Cup: Pakistan lost in the semi-final. Sad memory: India lost in the other semi-final. \nThere is another memory, neither happy nor sad, but indelible: The tournament was called the Reliance World Cup. \nAmrit Mathur, cricket administrator and former manager of the Indian team, recounted in a column for Cricinfo last year a condition Dhirubhai Ambani had put at the time of signing the sponsorship deal. \nHe wanted to sit next to the Prime Minister during an exhibition match India and Pakistan played just before the World Cup, which was broadcast live on Doordarshan. \nAllan Border celebrates the 1987 Reliance World Cup win with the cup's sponsor, Dhirubhai Ambani. \nThis is one of the less recounted instances of Dhirubhai’s business acumen percolating beyond the boardroom and balance sheet. For the Rs 9 crore he paid for the title rights, he not only got Reliance’s name associated with the tournament but also showed his proximity to the Prime Minister on the only television channel of the time. \nIt will not be an exaggeration to say that the 1987 World Cup was Reliance’s coming-out party. It would have helped that it was the first cricket world cup played outside England and started India’s ascendancy in the game’s power structure. \nSport has often been used by brands to announce to the world that they have reached a certain scale and stature. Apple’s Super Bowl commercial of 1984 is a case study in marketing. In India, too, sport — actually, cricket — has been used by companies to tell the world they have arrived. \nThe commercial that launched the Macintosh established Apple as a force in computers. \nReliance was set up in the 1960s. In 1975, it expanded into textiles. It was only in 1985 that it had named itself Reliance Industries. In those days, time moved much slower. Compared with the established businesses of the time, Reliance was a young buck in 1987. \nCoca-Cola and Pepsi fought an Indian version of the Cola War during cricket matches in the 1990s, when both were trying to establish themselves here. Later, cricket sponsorship was used by Indian companies selling telecom handsets to establish their brands. Most recently, Micromax was the title sponsor for the Board of Control for Cricket in India (BCCI)’s matches till April this year. \nThe mantle now passes to an e-commerce and digital wallet start-up, One97 Communications, which operates under the Paytm brand. Those who read this column last Saturday would be familiar with it. Apologies for writing about it a second time so soon (note to editor: no, I have no special feelings for its founder, Vijay Shekhar Sharma). \nThe young company has just agreed to pay Rs 203 crore to become the title sponsor for four years for BCCI’s cricket matches – 84 Tests, ODIs, and T20s. That works out to Rs 2.42 crore per match. The floor price was Rs 2 crore per match, which is what Micromax had paid. \nThere is more to come. “We will associate with cricket and other sports in a big way over the next few years... [We plan to spend] Rs 500 crore on sports over four years,” says Shankar Nath, senior vice-president with Paytm. \nWhy would a start-up splurge? Look around. How many start-ups do you see? Thousands? Of those, at least 400 are into e-commerce. Several of them advertise. You would remember Shah Rukh Khan telling you to buy clothes from Yepme.com. SnapDeal has Aamir Khan. \nThe list goes on. All e-commerce companies are young and their future may be decided by how they play the game now. Advertising helps; cricket-related advertising can make you a household name. \nThat is because entire households watch cricket live on television, some members against their will, adding up to a huge viewership, endorsed by the large amounts broadcasters pay for rights. It is not like soap, sitcom, or reality shows, which are also watched during re-runs or on the web. \nMore commercials get watched during live cricket, when the next ball is just a minute or so away and deters the use of the remote. A lot of those watching are young people, who are more likely to use online services. \nPaytm is flush with funds from China’s Alibaba and other investors. The price it pays BCCI will not rise for four years, and it will be paid from series to series, not upfront. Paytm intends to connect with 500 million consumers. Cricket brings them closer. Tags", "external_links": [], "published": "2015-08-08T06:57:00.000+03:00", "crawled": "2015-08-08T07:47:18.422+03:00", "highlightTitle": ""}