{"organizations": [], "uuid": "921e981ca500a6b48c49f6c2df33d863e4f31ba8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508030641.html", "country": "US", "title": "Zimbabwe: 'Ban On Second-Hand Clothes a Disaster'", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: 'Ban On Second-Hand Clothes a Disaster'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T11:44:00.000+03:00", "replies_count": 0, "uuid": "921e981ca500a6b48c49f6c2df33d863e4f31ba8"}, "author": "", "url": "http://allafrica.com/stories/201508030641.html", "ord_in_thread": 0, "title": "Zimbabwe: 'Ban On Second-Hand Clothes a Disaster'", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Adaptative Strategies Marred By Lack of Funding \nThe Poverty Reduction Forum Trust described as unfortunate and ill-timed the decision by Finance minister Patrick Chinamasa to ban the sale of second hand clothes saying government had lost touch with reality. \nPRFT executive director Judith Kaulem said although it may not be dignifying for people to wear second hand clothes, the economic reality in Zimbabwe did not give people any choices. \n\"Most people depend on the sale of second hand clothes. It is good to promote local industry but we don't have any company producing affordable clothes in Zimbabwe at the moment,\" Kaulem said. \n\"You don't close the only channel without opening an alternative. Our reality is that those industries which we seek to promote are not there. Banning second hand clothes is going to make people's lives difficult. I don't think this was a good idea. People opted for second hand clothes because they don't have enough income. The economy must be fixed first.\" \nSecond hand clothes mostly come into the country through the Mutare Mozambique border and are sold at very low prices. \n\"There are no jobs and people are not being paid these days. I went into the business of importing second hand clothes from Mozambique because I had no other means to feed my family. Business is going on well for me and I hope the government will adjust its position,\" said James Matiza of Harare. \nOthers warned that criminalizing the sale of second hand clothes would create corruption from the border to the selling point. \n\"We will smuggle bales of second hand clothes and it will be a cat and mouse game with the police. Instead of criminalizing second hand clothes, government should find mechanisms to embrace them and regularize their sale,\" said Joice Sithole. \nHowever the Zimbabwe Clothing Manufacturers Association said it was operating at an average of 45% and was hoping to improve if working capital of $5 million was availed to the sector. \nThe association's chairman Jeremy Youmans said the local clothing sector was dying because it was failing to compete with second hand clothes. \n\"Our products are not cheap but we produce good products that are competitive as some of our companies exports to other countries,\" he said. \nYoumans said the banning of second hand clothes was welcome to the sector. \nA local brokerage firm said the ban of second hand clothes was meant to protect the local clothing companies such as Truworths and Edgars and urged players to manufacture affordable products. \n\"We believe if they are able to provide the very low-end with decent clothing at reasonable prices, they stand to witness a surge in their revenues,\" said ABC Stockbrokers. \nZimbabwe Revenue Authority commissioner general Gershem Pasi told Parliament recently that taxation on clothing was too high prompting people buy second-hand clothes. Zimbabwe \nPRESIDENT Robert Mugabe could have played both puppet and puppeteer, in the Zanu PF debacle that resulted in the removal … see more » Copyright © 2015 Zimbabwe Standard. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-03T11:44:00.000+03:00", "crawled": "2015-08-03T12:15:15.808+03:00", "highlightTitle": ""}