{"organizations": [], "uuid": "a895da191e37a8f76f782a28bfbb1ecc012f6aee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/payments-bank-S.jpg", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/payments-banks-rs-14-lakh-cr-bonanza-for-infrastructure-sector-sbi-report/127591", "country": "IE", "title": "Payments banks Rs 14 lakh cr bonanza for infrastructure sector: SBI report", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Payments banks Rs 14 lakh cr bonanza for infrastructure sector: SBI report | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T20:16:00.000+03:00", "replies_count": 0, "uuid": "a895da191e37a8f76f782a28bfbb1ecc012f6aee"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/payments-banks-rs-14-lakh-cr-bonanza-for-infrastructure-sector-sbi-report/127591", "ord_in_thread": 0, "title": "Payments banks Rs 14 lakh cr bonanza for infrastructure sector: SBI report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Payments banks can annually free up a whopping Rs 14 trillion in incremental credit for the fund-starved infrastructure sector, says a SBI Research report.\n“Apart from helping banks offer facilities to the unbanked sections, we estimate that on the asset side, an incremental amount of at least Rs 14 trillion per annum can be freed up for credit needs of the infrastructure sector, as these banks can only invest in G-secs, this entire amount can be freed up to lend to infrastructure,” SBI Research said.\nExplaining how they arrived at the Rs 14-trillion of additional funds for investment, the report said people are holding around 13 per cent of cash with them for their day-to-day transactions. In a simple arithmetic, even if the cash with the public comes down by 1 per cent, it will increase banks’ deposit base by around Rs 15 trillion and given a credit-deposit ratio of 75 per cent banks can loan out an additional Rs 11.25 trillion, through the multiplier effects.\nOn the liability side, “we believe retail penetration of banking credit is very low at 9.5 per cent of GDP. This is much less than China’s 22.5 per cent and significantly lower than our South Asian counterparts,” says the report.\nStating that there is a huge opportunity for banks to unlock their retail business potential, the report said, “even if the incremental share for retail loans as a percentage of GDP are to increase by only 1 per cent, it could mean an additional Rs 1.3 trillion benefits to the banking system,” the report said.\nOn August 19, the Reserve Bank had granted in-principle approval to 11 entities from 44 applicants to set up payment banks. Some of those who got the licence include Reliance Industries , the Birlas, the Mahindras, Vodafone, and Bharti Airtel , among others.\nOutstanding deposits of a small bank is about Rs 1 trillion. If each payment bank mobilises one-fourth of such deposits in a year(assuming a 25 per cent penetration, which is viable given that Jan Dhan mobilisation is around Rs 22,000 crore so far), the 11 payment banks will be able to mobilize around Rs 2.75 trillion in a year, the report said.\nThe value of banknotes and coins in circulation as a percentage of GDP at 12 per cent is very high in the country compared to other emerging markets, like Brazil, Mexico and Russia. Cash is still the preferred mode of payment for a significantly large section of our society not having access to formal payment systems.\nWith rapid financial inclusion, the report expects cash component in broad money supply in the country to decline in line with developed countries like Britain (2 per cent), Australia (3 per cent), and Japan (6 per cent).\n 30, 2015 12:16 pm", "external_links": [], "published": "2015-08-30T20:16:00.000+03:00", "crawled": "2015-08-31T03:30:15.420+03:00", "highlightTitle": ""}