{"organizations": [], "uuid": "11fab0db57545bbe787e6b3f998f73991d9dff8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/att08z-a_600.jpg", "site_section": "http://www.philly.com/philly/business/personal_finance", "section_title": "Personal Finance, Money and Investing Advice at Philly.com ", "url": "http://www.philly.com/philly/business/consumer_news/20150803_ap_c9f0d6b2457b4f188dfe83a59cc50d29.html", "country": "US", "title": "AT&T, as new owner of DirecTV, offers TV-wireless discount", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "AT&T, as new owner of DirecTV, offers TV-wireless discount", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "11fab0db57545bbe787e6b3f998f73991d9dff8f"}, "author": "ANICK JESDANUN,", "url": "http://www.philly.com/philly/business/consumer_news/20150803_ap_c9f0d6b2457b4f188dfe83a59cc50d29.html", "ord_in_thread": 0, "title": "AT&T, as new owner of DirecTV, offers TV-wireless discount", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (AP) - AT&T customers will save $10 a month and get a single bill for their TV and wireless services under a new package the company is offering after its $48.5 billion purchase of satellite TV company DirecTV 10 days ago.\nUnder the new package, customers will get a single number to call for customer service. And employees at AT&T stores will be able to set up customers' phones so they can start watching TV through apps right away, even before service is installed in the living room. But the content on phones - a subset of what's available on regular TVs - won't differ from what DirecTV customers have already been able to get on their apps.\nThe changes aren't huge, given that AT&T and DirecTV already had deals as separate companies to sell each other's services. But Monday's announcement is \"the first step of what's to come,\" said Brad Bentley, AT&T's chief marketing officer for entertainment and Internet services.\nRoger Entner, an analyst at Recon Analytics, said TV as a stand-alone business is dead, as consumers see TV as part of their overall media and telecommunications experience. So far, AT&T is the only company able to provide both mobile and TV services. Rivals are limited to partnerships, which Entner said don't work as well for consumers and the companies.\n\"It's a beginning, but an important beginning,\" Entner said of the new package.\nMoody's analyst Mark Stodden said the package \"is a good first step but not the type of innovative product offer that the company needs to differentiate its services.\" Without offering new capabilities, such as unique content from DirecTV, AT&T will have to keep prices low because of intense competition, Stodden said.\n\"The question remains as to whether AT&T can deliver this product innovation and how long it will take to bring that to the market at scale,\" Stodden said.\nBentley said more service integration is coming, but he wouldn't provide details.\nOther than the $10-a-month discount, the promised savings aren't unusual.\nAt AT&T, TV services will cost $50 to $125 a month for the first 12 months, after which regular prices take effect. AT&T says that's a savings of roughly $35 a month. But traditional TV providers already offer these types of promotions for the first year or two.\nWireless companies also have been offering all sorts of deals to lure customers from rival carriers. AT&T is offering $100 for each line switched from a rival, plus a $200 credit per line for trading in an old phone.\nIn the wireless industry, deals have become routine as carriers fight for each other's customers, given that most Americans already have cellphones. Just last week, T-Mobile said customers will keep the $15 monthly price for leasing an iPhone 6 and $19 for a 6 Plus if Apple releases new models, possibly in September. Sprint announced a family plan offering four lines with 10 gigabytes of data to share for $20 less than what it charges for 1 gigabyte.\nAT&T's offer starts Aug. 10, and customers can choose any level of TV and wireless service to qualify for the $10 discount. The company also is extending the offer to customers of U-Verse, which is the traditional TV service AT&T delivers over wired lines in 21 states. Specific channels will differ, though, and a package of football games called Sunday Ticket will be available on DirecTV only because of the nature of DirecTV's deals with the NFL.\n___\nThis story has been corrected to show that the DirecTV purchase took place 10 days ago, rather than last week.", "external_links": [], "published": "2015-08-03T03:00:00.000+03:00", "crawled": "2015-08-04T03:26:06.071+03:00", "highlightTitle": ""}