{"organizations": [], "uuid": "418da05d3f3f3db410e20139a1071eba31c2353a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://www.modernghana.com/logo/final_log.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/636123/1/financial-inclusion-needs-flexible-regulation-to-s.html", "country": "US", "title": "Financial inclusion needs flexible regulation to succeed", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Financial inclusion needs flexible regulation to succeed", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T13:00:00.000+03:00", "replies_count": 0, "uuid": "418da05d3f3f3db410e20139a1071eba31c2353a"}, "author": "", "url": "http://www.modernghana.com/news/636123/1/financial-inclusion-needs-flexible-regulation-to-s.html", "ord_in_thread": 0, "title": "Financial inclusion needs flexible regulation to succeed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  13 August 2015 11:00 CET Financial inclusion needs flexible regulation to succeed By GNA \nAccra, Aug. 12, GNA - There is the need for clear, pragmatic and flexible regulations to encourage a healthy environment for financial inclusion to succeed, Mrs Elly Ohene-Adu, the Head of Banking Operations, Bank of Ghana has said. \nMrs Ohene-Adu, speaking at the Mobile Money stakeholders' workshop in Accra, she said the country needs innovative regulations that takes on board the needs, aspirations and interest of stakeholders. \nThe workshop was on the theme: 'Maximising the Potential of Mobile Money to Drive Financial Inclusion in Ghana.' \nShe said there is the need to incorporate customer protection around principles of transparency, responsible pricing, fair and respectful treatment of clients, privacy of client data and mechanisms for complaint resolution. \n'It is to this end that the Bank of Ghana has issued the guidelines for electronic money issues and agent guidelines replacing the branchless banking guidelines of 2008,' she added. \nShe said mobile phones has the ability and tenacity to overcome the limitations of brick and mortar. \nMrs Ohene-Adu said mobile phones are game-changers and versatile tools that must be exploited to fully achieve the goals of stakeholders. \nShe said financial inclusion is critical because it facilitates effective monetary policy implementation by deepening the financial system through increased and improved access to financial services. \nShe said mobile money services are playing a critical role in extending financial service to the un-banked population and the Bank of Ghana is committed to fight fraud and combat money laundering in order to promote the safety and efficiency of the national payment system. \nShe assured stakeholders that the Central Bank would continue to put in measures to promote mobile financial service with the view to achieving inclusiveness. \nMr Ebenezer Asante, Chief Executive Officer (CEO), MTN Ghana said financial inclusion has many direct benefits to deprive households that use loans and savings to accelerate consumption. \nBesides, it also brings about improved access to financial products and services at a cheaper cost and promote faster economic growth. \nHe said mobile money, therefore, presents an unparalleled opportunity to deliver a basic suite of modern financial service to the un-banked millions across the world. \nMr Asante said in addition to extending financial service to the poor, mobile money is expected to improved productivity by increasing efficiencies, lowering the cost of transactions and improved security. \nHe said, in Ghana, financial inclusion has improved by 16 per cent from 2010 to 2014. \nHe said tax holidays and other related subsidies and reliefs must be extended to mobile financial systems in order to encourage usage and to drive the financial inclusion agenda forward. \nThe CEO called on the Central Bank to support the areas of policy, advocacy and create the enabling environment for a more structured and centralised approach to doing business. GNA", "external_links": [], "published": "2015-08-13T13:00:00.000+03:00", "crawled": "2015-08-14T06:28:59.551+03:00", "highlightTitle": ""}