{"organizations": [], "uuid": "3f6125363f5785ca61fc7c96968b379796d27179", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/7/d/t/h/image.related.afrArticleLead.620x365.gj692l.png/1440567271197.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/business/infrastructure/sydney-housing-shortfall-could-reach-200000-by-2024-aecom-director-says-20150824-gj692l", "country": "AU", "title": "Sydney housing shortfall could reach 200,000 by 2024, Aecom director says", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Sydney housing shortfall could reach 200,000 by 2024, Aecom director says | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T13:34:00.000+03:00", "replies_count": 0, "uuid": "3f6125363f5785ca61fc7c96968b379796d27179"}, "author": "Share via Email", "url": "http://www.afr.com/business/infrastructure/sydney-housing-shortfall-could-reach-200000-by-2024-aecom-director-says-20150824-gj692l", "ord_in_thread": 0, "title": "Sydney housing shortfall could reach 200,000 by 2024, Aecom director says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Badly run infrastructure projects also cut housing supply: AECOM Technical Director Joe Langley. Pat Scala Share on twitter Share on Google Plus by Michael Bleby Sydney's failure to tie housing creation to new public transport developments will leave the NSW capital with a housing shortfall of nearly 200,000 by 2024, according to AECOM technical director Joe Langley.\nA siloed approach that gives state transport, finance and treasury agencies all the authority and excludes public and private sector skills in urban planning, development and urban renewal on major projects would continue an annual city-wide shortfall of 5632 dwellings that would total in 197,050 homes over the 20 years to 2024, Mr Langley said in a submission to parliament's enquiry into home ownership.\nProjects that widened the pool of decision-makers – over how they were selected in the first place as well as designed – were better able to create projects that served the public and funded them by capturing the development value created, said Mr Langley, a former urban planner with engineering firm Jacobs and executive with Denver, Colorado-based real estate firm Fleisher Smyth Brokaw.\n\"Present governance and funding arrangements contribute to Sydney's housing constraints by limiting the value that can be created by and captured from public transport projects,\" he said.\nArguments about the ineffectiveness of Australian infrastructure selection and design are not new. US-based AECOM is itself one of a number of voices, both foreign and local , calling for an overhaul of the way large transport projects are conceived and designed in Australia. Businesses and property owners that would benefit from Melbourne's planned $11 billion Metro Rail project should help pay for it, the Committee for Melbourne argued earlier this year.\nBut his argument directly links the issue to housing supply, an issue of direct concern to any would-be buyer of property in Sydney, where dwelling values have surged more than 18 per cent over the last year.\nThe $US550 million ($765 million) development of Denver's Union Station, a project completed last year in which federal, state and local governments had a vote, along with the local council and the public redevelopment agency, was one example of how it could be done, Mr Langley said. Funding for redevelopment of the historic terminal building and a new transit interchange came from sale of sites to a private sector partner that was selected by tender, and federal and state government loans repaid from increased property taxes from new commercial buildings within a designated area.\nAustralian cities could make similar moves, Mr Langley said.\n \"Transport project[s] in Australia provide opportunities for the state governments and transport agencies to generate and capture significant levels of revenue to help fund capital works,\" he said.", "external_links": ["https://plus.google.com/https://plus.google.com/+MichaelBleby/posts", "https://twitter.com/MichaelBleby"], "published": "2015-08-26T13:34:00.000+03:00", "crawled": "2015-08-26T09:10:30.601+03:00", "highlightTitle": ""}