{"organizations": [], "uuid": "d76bb3f495079fbb19b03118f8f824ec45510cdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/v/9/b/u/image.related.afrArticleLead.620x365.givcj1.png/1439169571867.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/retail/why-jb-hifi-chief-richard-murray-has-treasurer-joe-hockey-to-thank-20150810-givcj1", "country": "AU", "title": "Why JB Hi-Fi chief Richard Murray has Treasurer Joe Hockey to thank", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why JB Hi-Fi chief Richard Murray has Treasurer Joe Hockey to thank | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T08:30:00.000+03:00", "replies_count": 0, "uuid": "d76bb3f495079fbb19b03118f8f824ec45510cdf"}, "author": "James Thomson", "url": "http://www.afr.com/business/retail/why-jb-hifi-chief-richard-murray-has-treasurer-joe-hockey-to-thank-20150810-givcj1", "ord_in_thread": 0, "title": "Why JB Hi-Fi chief Richard Murray has Treasurer Joe Hockey to thank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JB Hi-Fi chief Richard Murray has some nice trading tailwinds at his back. Pat Scala Share on twitter by James Thomson There's no doubt who will be at the top of the Christmas card list of JB Hi-Fi chief executive Richard Murray.\nWhen Treasurer Joe Hockey announced the small business asset write-off in May, just before releasing the federal budget, Murray already had a little momentum from the interest rate cuts delivered by Reserve Bank of Australia governor Glenn Stevens in February and then again in May.\nBut there's no doubt that Hockey's budget centrepiece, and the frenzy of spending that it created, helped JB beat analyst expectations with same store sales up 2.9 per cent and net profit up 6.4 per cent to $136.5 million .\nThe stock has soared 8.6 per cent in early trade to $21.25.\nMurray said it was pleasing to see earnings momentum grow as the year rolled on, and he specifically called out a very strong June, when the group \"enjoyed the benefits of solid sales growth assisted by the small business tax incentives\".\nWe'll obviously have to wait for some time until we can assess whether the instant asset write-off has got small business growing strongly again, but we can at least be very clear that it's got cash registers ringing, which should be a good sign for some of the retailers that will report in the coming weeks.\nPerhaps the best bit of news in the result was the trading outlook. While JB is always seen as the bellwether retailer in reporting season because it reports so early on, amongst he most closely watched numbers are around its July sales.\nTotal sales climbed 7.6 per cent in the month, while like-for-like sales rose 5.7 per cent in the first month of the new financial year, although Murray cautioned this growth was coming off a very soft period in prior year.\n Given the stock has run hard in 2015 – up almost 25 per cent year to date – the July numbers will likely give investors heart that there's still a bit more growth to come as trading conditions improve.\nWith the benefit of lower interest rates and helpful government policies at his back, Murray is also moving to tweak the JB strategy by taking the group out of the living room and into the kitchen, pushing deeper into the whitegoods beachhead established through JB Hi-Fi HOME by introducing smaller appliances across the retail network.\nMurray mentioned specifically that he's keen to get small appliances into JB stores in shopping centres, which is one place big box competitors such as Harvey Norman and The Good Guys can't go.\nJB says the home appliances market is worth $4.6 billion, which is bigger than any category the company currently battles in. If Murray and his team can take share from the mainstream and discount department stores, and the Harvey Normans of the world, then JB might just be able to continue its push out of the living room and into the kitchen, laundry and bathroom.", "external_links": ["https://twitter.com/mrjthomson"], "published": "2015-08-10T08:30:00.000+03:00", "crawled": "2015-08-10T05:15:44.810+03:00", "highlightTitle": ""}