{"organizations": [], "uuid": "27cd2296c2e99a7433424785bc84748adea906a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/01/rbi-s-pti.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/clipping-rbi-chiefs-veto-not-an-fslrc-proposal-member/112669", "country": "IE", "title": "Clipping RBI chief’s veto not an FSLRC proposal: Member", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Clipping RBI chief’s veto not an FSLRC proposal: Member | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T07:07:00.000+03:00", "replies_count": 0, "uuid": "27cd2296c2e99a7433424785bc84748adea906a5"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/clipping-rbi-chiefs-veto-not-an-fslrc-proposal-member/112669", "ord_in_thread": 0, "title": "Clipping RBI chief’s veto not an FSLRC proposal: Member", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles The stress matrix Impactful leaders needed to fulfill manufacturing dream: Hay Group Investors keen on India, need policy stability: Rothschild In a new twist, an FSLRC member has said the draft bill seeking to clip RBI chief’s veto in deciding interest rates does not reflect the views of the panel and it actually favoured Governor having the last word.\nThe revised draft of the Indian Financial Code (IFC), which proposes that any decision on monetary decision should be taken by majority by a seven-member committee without any veto power to the RBI chief, has created a furore and was seen as an attempt to curtail the central bank’s autonomy.\nThis prompted the government to claim that the draft IFC was not a “report of the government or of the Finance Ministry” and it was based on the FSLRC report.\n“It is not true,” Financial Sector Legislative Reforms Commission (FSLRC) Member M Govinda Rao told PTI.\n“There is a misconception that the revised draft of IFC is a report of FSLRC. But that is not true. The term of the FSLRC ended in 2013,” Rao said, while adding that RBI Governor should indeed have a “veto power” in the monetary policy.\nRao’s comments are in sharp contract to the statements made by Finance Minister Arun Jaitley and other top officials including Chief Economic Advisor Arvind Subramanian, who have said the revised IFC draft was as per FSLRC recommendations.\nWhile the first version of IFC, as recommended by the FSLRC over two years ago in March 2013, had also suggested a Monetary Policy Committee (MPC) to decide on policy rates, it had recommended a veto power to the central bank chief.\nThe revised draft, released by the Finance Ministry last month on July 23 for public comments till August 8, has suggested doing away with this veto power and wants the seven-member MPC to take decisions by a majority vote.\nThe new version, which has been prepared after taking into account comments from various stakeholders on the first draft, has proposed three members from RBI (including its chief) and four to be nominated by the government.\nFollowing an uproar over the revised draft, Jaitley had said, “FSLRC has made its recommendations, which have been made public for comments. After the comments are received, it is only then that the government will take a view.”\nSubramanian also said, “FSLRC report is a report of FSLRC. It is not the report of the government or the Finance Ministry. The report is not the view of the government.”\nSeeking to clear the air over the entire episode, Rao said that FSLRC had not recommended dilution of the powers of the RBI Governor in deciding policy rates.\n“Once you assign the responsibility of price stability or inflation targeting to the RBI, it follows from there that the RBI Governor should have full say in deciding the interest rate,” Rao said.\nHe further said that the mandate of the monetary policy committee should be to assist RBI in deciding the policy and it was important that the RBI Governor retains “veto power” in deciding the monetary policy action.\n“There is a specific role of the RBI and the FSLRC recommendation had taken that into account. RBI Governor should have the power to decide on monetary policy action and I hold on to that view,” the FSLRC member said.\nAt present, the RBI Governor consults a Technical Advisory Committee, but does not necessarily go by the majority opinion while deciding on the monetary policy stance. There have been multiple occasions when the RBI chief has actually gone against the majority view of this committee.\nA former RBI Governor also criticised the revised IFC draft, saying it would take away the powers of the central bank chief to take tough actions against those with political backing.\n“Inflation management and credit decisions should be at the arm’s length from the government. The responsibility should vest with the RBI. But the decisions should be taken in concurrence with the Government,” said the former Governor who did not want to be named.\nFSLRC, which was set up in 2011 to review and rewrite the laws of the Indian financial sector, had submitted its report to the then Finance Minister P Chidambaram in March 2013. It was headed by Justice B N Srikrishna and members included Rao, Y H Malegam, K J Udeshi, Jayanth Varma and P J Nayak.\nThe FSLRC report was in two parts — first focusing on “Analysis and Recommendations” and the second on ‘draft laws’ consisting of the first draft IFC.\nThe report, along with the draft IFC, was put up for public comments on March 28, 2013. Further, comments were requested from various ministries, departments and regulators, as also from the state governments, universities and research institutions among others.\nSubsequently, the Draft IFC was “revised in the light of the comments received” on the earlier draft, Finance Ministry had said while releasing the revised version last month.\nAmong others, modifications relate to “monetary policy framework and composition of the Monetary Policy Committee,” the Ministry said.\n“However, the modifications in the revised Draft IFC remain consistent with the overall structure and philosophy of the FSLRC Report,” it added.\nFirst Published on August 02, 2015 11:07 pm", "external_links": [], "published": "2015-08-03T07:07:00.000+03:00", "crawled": "2015-08-02T21:41:59.830+03:00", "highlightTitle": ""}