{"organizations": [], "uuid": "61bdcd1839e49f80d6eedf15b733f7f8006b51d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/personal-finance/", "section_title": "Personal Finance News:Personal Finance Articles,Personal Finance Tips,Banking and Finance News | The Financial Express", "url": "http://www.financialexpress.com/article/personal-finance/saving-for-retirement-why-annuity-products-make-sense/120909", "country": "IE", "title": "Saving for retirement? Why annuity products make sense", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Saving for retirement? Why annuity products make sense | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T08:03:00.000+03:00", "replies_count": 0, "uuid": "61bdcd1839e49f80d6eedf15b733f7f8006b51d7"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/personal-finance/saving-for-retirement-why-annuity-products-make-sense/120909", "ord_in_thread": 0, "title": "Saving for retirement? Why annuity products make sense", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Tax Talk: NPS a flexible & tax-friendly investment option for NRIs Insurance: In correct lane FPI holding in BSE 200 down marginally With increasing longevity, the sooner one starts making provisions for retirement through annuities, the better it is.\nThere are two types of annuities. One is immediate annuity where the annuity payments start immediately after a lump sum money called purchase price is paid to the insurer. The rate of interest may not be as high as the return from other financial products. But the annuitant gets the benefit of receiving annuity at the same rate throughout his life. The rate at which an annuitant gets his annuities is around 7 to 7.5% on an average.\nAnother type of annuity is deferred annuity. Under this policy, a person builds the pension corpus over a period of time before the pension vests on a pre-decided date. The deferred annuity policy may or may not be unit-linked.\nWhether a person should buy a unit-linked pension scheme depends on his risk profile. In deferred annuity, the annuitant has an option to commute up to a portion of the accumulation on the date of vesting as per the provision of Income-Tax Act and use the balance to buy an immediate annuity.\nIn immediate annuity, there are generally seven types of options?\n* Annuity for life;\n* Annuity guaranteed for 5/10/15/20 years and for life thereafter;\n* Annuity for life with return of purchase price;\n* Annuity for life increasing by a simple rate, say 3% every year;\n* Annuity for life with a provision for payment of 50% of annuity to the spouse of the annuitant after the death of the annuitant;\n* Annuity for life with the guarantee of payment of 100% of annuity to the spouse after the death of the annuitant;\n* Annuity for life with the guarantee of payment of 100% of annuity to the spouse after the death of the annuitant with return of purchase price on death of the spouse.\nMost people buy annuity with return of purchase price. Since the longevity has increased, when the annuitant and his spouse die, the children would not depend on their parent’s money. So, the annuitant can easily increase his annuity amount by opting for a pension without return of purchase price.\nThose without dependants can increase the annuity rate further by opting for an annuity for life. Some insurers give additional pension for higher purchase amount (say when the purchase price is above R5 lakh). Many insurers also give incentives for buying immediate annuity online.\nFor example, under a popular product of a leading insurer, if an annuitant opts for annuity for life with an option for 100% of pension for his wife after his death (without return of purchase price), the return can be as high as 8.03%. If the annuitant has no dependant and opts for annuity for life (i.e., an annuity payable as long as only he is alive), the return can be as high as 9.35%. If someone buys this product at a higher age, he will get higher return.\nDeferred annuity policies are more of endowment type where regular premiums are payable by the policyholder. In some products, the annuitant can pay just a single premium or pay premiums for a limited period only. Minimum age at entry can be as low as 20. Annuity generally starts when one is at least 55. Like any other endowment policy, this policy also participates in profits. Many insurers give guaranteed additions, too, in the initial years. At maturity, a good pension corpus in created. The annuitant has an option to commute a portion of it. The balance amount has to be used in buying a deferred annuity at the prevailing annuity rate.\nThe writer is research associate, ZTC, Kolkata, LIC of India.\nViews are personal.\n 18, 2015 12:03 am", "external_links": [], "published": "2015-08-18T08:03:00.000+03:00", "crawled": "2015-08-18T02:34:36.746+03:00", "highlightTitle": ""}