{"organizations": [], "uuid": "006b8f1d35281ac6a01f527ae93eb9fbf8de190b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508172210.html", "country": "US", "title": "Swaziland: 'Stand Up to Swazi King', Unions Urged", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Swaziland: 'Stand Up to Swazi King', Unions Urged", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T16:34:00.000+03:00", "replies_count": 0, "uuid": "006b8f1d35281ac6a01f527ae93eb9fbf8de190b"}, "author": "", "url": "http://allafrica.com/stories/201508172210.html", "ord_in_thread": 0, "title": "Swaziland: 'Stand Up to Swazi King', Unions Urged", "locations": ["Swaziland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Swaziland: Jurists Slam Swaziland Over Jailings \nWorkers' rights are suppressed. In June2015 the kingdom was named among the top ten worst countries in the world for workers' rights, in a report published by the International Trade Union Confederation (ITUC). \nThe Southern African Trade Union Coordinating Council, meeting in Gaborone, Botswana, heard that King Mswati was resisting pressure to introduce democratic changes. The Sunday Standard newspaper in Botswana reported this week (16 August 2015), 'Henry Malumo from Action Aid International said that all forms of pressure that have been brought to bear on the kingdom have not yielded positive results. On such a basis, he suggested that it was time to change track.' \nThe Standard reported him saying, 'Everybody knows what is happening in Swaziland but unfortunately the government doesn't feel the heat. It is time to put the King himself on the spot. It doesn't have to be the people of Swaziland themselves, but us.' \nThe newspaper reported, 'Malumo said that in solidarity with their Swaziland counterparts, some South African trade unionists were urging the Congress of South African Trade Unions (Cosatu) which is \"closer to the African National Congress\", to put pressure on the kingdom. \n'\"The South African government is the one that is sustaining the kingdom,\" he said.' \nFor resources in the orginal story, click here . Swaziland \nMalawi coach Ernest Mtawali has released a 26-member squad of home- based players for a training camp ahead of the 2017 … see more » Copyright © 2015 Swazi Media Commentary. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-17T16:34:00.000+03:00", "crawled": "2015-08-17T16:50:33.279+03:00", "highlightTitle": ""}