{"organizations": [], "uuid": "3fad642824c6a4c24b126b80bab0d7f7d571b1ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/05/foxconn-s-re.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/foxconns-india-entry-changing-face-of-electronics-manufacturing/114144", "country": "IE", "title": "Making Foxconn stay: From land to electricity to taxes, need to get it right", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Making Foxconn stay: From land to electricity to taxes, need to get it right | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T22:12:00.000+03:00", "replies_count": 0, "uuid": "3fad642824c6a4c24b126b80bab0d7f7d571b1ef"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/foxconns-india-entry-changing-face-of-electronics-manufacturing/114144", "ord_in_thread": 0, "title": "Making Foxconn stay: From land to electricity to taxes, need to get it right", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In what is probably the biggest endorsement for Prime Minister Narendra Modi ’s Make-in-India initiative, Terry Gou, CEO of Taiwan-based original equipment manufacturer (OEM) Foxconn is looking to invest $2 billion over the next 10 years to set up manufacturing facilities in the country to produce phones, TVs, electronic products – if all goes well, Foxconn could also be looking at bringing in other parts of the supply chain into India such as chip fabrication units. Foxconn is the world’s largest OEM with 2014 revenues of $133 bn and manufactures for some of the biggest global brands including Apple, Xiaomi and Blackberry. Gou is in talks with Gujarat-based billionaire Gautam Adani, handset-maker Micromax and ecommerce-firm Snapdeal for setting up the plants.\nGiven how the entry of Foxconn could simply change the face of electronics manufacturing in India – it could do what Maruti Suzuki did for the automobile sector by incubating top-quality ancillaries that could feed other assemblers/manufacturers – it is critical we get everything right. Too many promising projects in India have fallen by the wayside due to inadequate follow-up, the Rs one lakh crore of stuck projects is the best testimony to this possibility. Let’s not forget that this is not Foxconn’s first India outing – it shut down its plant in Sriperumbudur, near Chennai, soon after Nokia downed shutters. Though Foxconn will be accorded better treatment having met the prime minister, the finance minister and the telecom minister, it would be a good idea to appoint a point person in the Prime Minister’s Office who can very quickly escalate to the very top every problem that Foxconn can possibly face – apart from the investments, if Foxconn succeeds, it will create tens of thousands of well-paid jobs as well.\nIt is easy to see just what can go wrong with Foxconn’s India plans. For starters, especially if there are fabrication units to be set up, or even if ancillaries are to be housed in close proximity as they were for Maruti-Suzuki, land would be an immediate requirement. Given what is happening to the Land Act, unless some state governments quickly start changing their laws, this could be an issue. The units would require water and, of very high purity; ditto for electricity where the quality of supply has to be very reliable, not just in terms of being available 24×7 but in terms of the frequency – 50 Hz – at which it is delivered. Two examples are important here. One, it has been 5 years since Toshiba tried to set up a small 15-20MW power plant to provide reliable power to Japanese manufacturers in Manesar and it has got past the litigation only now – the actual work on the plant, including gas allocation, is yet to begin. And two, in the Dahej SEZ, the Hitachi desalination plant – both were supposed to be priority projects for the DMICDC, a star initiative of both this and the previous government – continues to be stuck on the take-or-pay contract. And despite manufacturing being high on the government’s agenda, there is still no clarity on the tax incentives for either SEZs or NIMZs so far. The government simply has to ensure Foxconn doesn’t get stuck in this quagmire. Apart from the fact that it could hit big investments since Foxconn is looking for alternative destinations for its 12 plants in China where wages are rising, Indians are projected to buy $400 bn of electronic goods by 2020, of which $300 bn will be imported – a local Foxconn, and the electronics eco-system that it will spur, will go a long way in reducing this.\n 05, 2015 2:12 pm © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-08-05T22:12:00.000+03:00", "crawled": "2015-08-05T18:08:01.720+03:00", "highlightTitle": ""}