{"organizations": [], "uuid": "956cfc4349c961369eaad61a355c8e163cf223a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/8/n/2/k/image.related.afrArticleLead.620x365.gjaift.png/1440793995947.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/markets-end-a-dramatic-week-on-a-quiet-note-20150828-gjaift", "country": "AU", "title": "Markets end a dramatic week on a quiet note", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Markets end a dramatic week on a quiet note | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T04:33:00.000+03:00", "replies_count": 0, "uuid": "956cfc4349c961369eaad61a355c8e163cf223a4"}, "author": "James Chessell", "url": "http://www.afr.com/markets/markets-end-a-dramatic-week-on-a-quiet-note-20150828-gjaift", "ord_in_thread": 0, "title": "Markets end a dramatic week on a quiet note", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Traders are now pricing in a 38 per cent chance the central bank will act in September. AP Share on twitter by James Chessell One of the most dramatic weeks for global markets in recent memory ended on a relatively quiet note although any sense of confidence the US Federal Reserve will hold off raising interest were dashed by one of the central bank's most senior officials.\nIn an interview with CNBC that is unlikely to quell the uncertainty that gripped investors this week, the Fed's vice chairman Stanley Fischer said there remained \"a pretty strong case\" for a September rate hike but added it was \"too early\" to decide whether fears about the health of the Chinese economy had made such a move more or less likely.\n\"The change in the circumstances which began with the Chinese devaluation is relatively new and we're still watching how it unfolds, so I wouldn't want to go ahead and decide right now what the case is—more compelling, less compelling, et cetera,\" he said as global central bankers gather at Jackson Hole in Wyoming.\nThe Dow Jones industrial average fell 12.3 points, or 0.07 per cent, to 16,642.47 on Friday, the S&P 500 gained 1.14 points, or 0.06 per cent, to 1988.8 and the Nasdaq Composite added 15.62 points, or 0.32 per cent, to 4828.33.\nBeijing's decision to engineer a revaluation of the renminbi on August 11 sparked wild swings on global equity and commodity markets as traders fretted about the Chinese government's ability to handle weaker economic growth .\nThe benchmark S&P 500 index flirted with correction territory amid the turmoil after falling more than 10 per cent from its May record high, some European bourses were down as much as 20 per cent, the Australian sharemarket looked set for its worst weekly performance since the global financial crisis while the VIX index which measure's volatility reached a six-year high.\nInvestors spent the past five days closely watching the Fed for signs of whether the expected rate hike— considered an even money chance before this week's market meltdown —will be postponed until later in the year. Even though US economic data remains positive, many commentators now argue the current volatility makes it difficult to tighten monetary policy.\nEarlier in the week, New York Fed president William Dudley played down the chances of a September rate rise by saying the case for higher borrowing costs was \"less compelling to me than it was a few weeks ago\".\n Traders are now pricing in a 38 per cent chance the central bank will act in September, up from a one-in-four chance two days ago, according to Bloomberg.\nThe S&P 500 edged 0.4 per cent higher on the week, paring slightly its loss so far this month to 5.9 per cent.\nThe FTSE Eurofirst 300 closed 0.3 per cent stronger on the week, while in Australia the S&P/ASX 200 index finished 0.9 per cent higher over the same period.\nLuke McElwaine, a senior dealer at Morgans, said the selloff early in the week \"really brought out the buyers\".\n\"The market recovered well but the buyers really aren't prepared to drive it higher until we see what happens in the US,\" he said. \"That's why the market's not going higher. It's hovering around these levels.\"\nThe People's Bank of China's Tuesday decision to cut official interest rates helped restore calm after \"Black Monday\". This flowed into commodity prices which also staged a recovery.\nThe benchmark Brent crude oil price rose 5.3 per cent on Friday, extending its 10 per cent surge from the previous session. Spot gold advanced 0.9 per cent ahead of the weekend.", "external_links": ["http://www.cnbc.com/2015/08/28/feds-fischer-still-too-early-to-tell-if-september-hike-will-happen.html", "https://twitter.com/jameschessell"], "published": "2015-08-29T04:33:00.000+03:00", "crawled": "2015-08-29T12:06:11.954+03:00", "highlightTitle": ""}