{"organizations": [], "uuid": "0b2575379360ede1a677f79a4e3a09beff32a50d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/08/best-summer-sales-shutterstock_220167250-1024x731.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/10-best-summer-sales-cant-afford-miss/", "country": "US", "title": "10 Best Summer Sales You Can’t Afford to Miss", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "10 Best Summer Sales You Can’t Afford to Miss", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T12:00:00.000+03:00", "replies_count": 0, "uuid": "0b2575379360ede1a677f79a4e3a09beff32a50d"}, "author": "Cameron Huddleston", "url": "http://www.gobankingrates.com/personal-finance/10-best-summer-sales-cant-afford-miss/", "ord_in_thread": 0, "title": "10 Best Summer Sales You Can’t Afford to Miss", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "9 10 \nThe end of summer offers plenty of opportunities to save on a variety of items. You’ll find deals on seasonal items that retailers are looking to clear out to make room for colder-weather products. And sales abound on everything students of all ages need to head back to school. Plus, Labor Day sales offer an opportunity to save on several big-ticket items. \nIf you’re a bargain hunter (and who isn’t?), you don’t want to miss these 10 sales. \nRead: America’s 10 Best and Worst Retailers for Summer Savings 1. Summer Apparel Clearance Sales \n“Now that summer is coming to a close, you can expect to see all types of summer gear and apparel go on sale as retailers make way for autumn clothing,” DealNews senior features writer Louis Ramirez said. In many parts of the country, you’ll still be able to wear summer apparel for a couple of months. You can continue wearing lightweight clothes into colder months by layering and hold off buying fall clothing until it goes on sale. \nLook for discounts of 50 percent or more from retailers such as Adidas, Last Call by Neiman Marcus, REI and Victoria’s Secret, Ramirez said. Target has marked down summer clothing by 50 percent and has offered coupons for an extra 20 percent to 25 percent off, said Regina Conway , consumer expert with Slickdeals . And 6pm.com has discounted sandals up to 75 percent, Ben’s Bargains Managing Editor Kristin Cook said. 2. Back-to-School Sales \nBack-to-school sales offer an opportunity to get rock-bottom prices on school supplies for your kids, and they also a great time to stock up on supplies for your home office. You’ll find sales at big-box retailers such as Target and Walmart and office supply stores such as Office Depot and Staples, which is matching competitors' prices and discounting 10 percent of the price difference. \nLook for savings of at least 25 percent and buy-one-get-one free offers for general school supplies, said FatWallet.com shopping expert Brent Shelton . Plus, more than a dozen states have back-to-school sales-tax holidays when sales taxes will be waived on items such as school supplies and clothes. \nRelated: 31 Fun, Free Things to Do This Summer 3. Computer Sales \n“The back-to-school season is a good time to shop for computers,” Conway said, with average savings of 20 percent. So far this year, the Microsoft Store has had the most-aggressive deals, with prices at or around $350 for a mainstream 15-inch laptop with Intel's latest processor, at least 4GB of RAM and a 500GB hard drive, Ramirez said. “That's enough horsepower for a college student to research papers online, stream HD video from Netflix and play the occasional PC game,” he said. \nConsider coordinating a computer purchase with a sales-tax holiday to save even more. Of the states that have back-to-school sales tax holidays, seven waive the taxes on computer purchases on select weekends in August, according to the Federation of Tax Administrators. 4. Apple’s Back-to-School Sale \nIf you prefer Macs over PCs, Apple marks down its computers during its back-to-school sale, which is underway in stores and runs online Aug. 6 through Sept. 18, Ramirez said. However, you’ll likely find better deals at retailers such as Best Buy or Micro Center, which sometimes undercut Apple’s sale prices by as much as $200, he said. \nRead: 25 Best Personal Finance Books for Your Summer Reading List 5. Appliance Sales \nThe best time to buy appliances is in September, when new models hit stores and older models are marked down, Conway said. Typically, you can expect discounts of at least 20 percent from retailers such as Home Depot and Lowe’s, and sales often coincide with Labor Day. You can find up to 90 percent off at SearsOutlet.com, Conway said. 6. Mattress Sales \nApril and May are usually the best months for mattress sales, Ramirez said. But you’ll find deals over most long holiday weekends, such as Labor Day. Last year's September mattress sales were just as good the spring sales, with 50 percent off select mattresses and an extra 10 percent to 40 percent off via stackable coupons, he said. Look for similar offers this year from Sears and US-Mattress.com. 7. Grill Sales \nYou might think that it doesn’t make sense to buy a grill now that summer almost is over. But you can get a great deal and use your grill for a few months. \"September probably has the best weather because you can still enjoy long sunny days minus the heavy August heat,” Ramirez said. \nRetailers typically mark down grills as summer ends, with discounts of 25 percent to 60 percent from retailers such as Sears and Target, according to DealNews. Look for discounts on higher-end grills at Home Depot and Lowe’s, Conway said. 8. Outdoor Furniture Sales \nRetailers have started marking down outdoor furniture, and prices will continue to drop into fall. Although you won’t find the lowest prices in August, Conway recommends taking advantage of discounts of 15 percent to 40 percent on patio furniture while there’s still a good selection in stores and time to enjoy your purchase before it gets too cold outside. \nLook for sales at big-box retailers such as Target and Walmart, home-improvement stores such as Home Depot and furniture retailers such as Home Decorators Collection and Pottery Barn. 9. Bicycle Sales \nBikes are another seasonal item that get marked down as summer ends. Cook said you can save as much as 50 percent to 60 percent off the retail price of bicycles and bike accessories. Check sales with retailers such as Walmart and auction site eBay, which offers new bikes through third-party sellers. 10. TV Sales \nThe best deals on televisions won’t show up until around Black Friday. But if you’re looking for a smaller-screen TV — perhaps for a child heading off to college — you can find deals in late August and early September. Prices on 32-inch LCD TVs dropped 14 percent the last weeks of summer in 2014, Ramirez said. “With prices currently around $175, you can expect to find deals on these sets in the $150 range come late August and early September,” he said.", "external_links": [], "published": "2015-08-05T12:00:00.000+03:00", "crawled": "2015-08-05T12:42:22.808+03:00", "highlightTitle": ""}