{"organizations": [], "uuid": "cce7d328e05aba020edb12a57a30960fce99aac1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/0/q/q/e/image.related.afrArticleLead.620x365.gj0f0o.png/1439792351590.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/transport/aviation/virgin-australia-unveils-new-airbus-a330-fullyflat-bed-seats-20150816-gj0f0o", "country": "AU", "title": "Virgin Australia rolls out new Airbus A330 seats", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Virgin Australia rolls out new Airbus A330 seats | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T08:46:00.000+03:00", "replies_count": 0, "uuid": "cce7d328e05aba020edb12a57a30960fce99aac1"}, "author": "Jamie Freed", "url": "http://www.afr.com/business/transport/aviation/virgin-australia-unveils-new-airbus-a330-fullyflat-bed-seats-20150816-gj0f0o", "ord_in_thread": 0, "title": "Virgin Australia rolls out new Airbus A330 seats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Virgin's John Borghetti: \"I know it sounds like a small thing, but I can't find anyone who likes airline coffee.\" Ben Rushton by Jamie Freed Australia's obsession with coffee has reached a new height: 30,000 feet. Virgin Australia will now introduce Australia's first Nespresso machines in the sky, with its flight attendants able to whip up a fresh cappuccino or long black using one of three blends for business class passengers flying on its A330s between the east coast and Perth.\n\"I know it sounds like a small thing, but I can't find anyone who likes airline coffee,\" said Virgin chief executive John Borghetti, who once worked as a barista at his family's cafe in Melbourne. \"Now, the Nespresso coffee here is as good as the one you'll get in your home. I think it is very, very important. If it is good enough for George Clooney …\"\nHis comments came as Virgin unveiled new business class seats on its A330 aircraft plying transcontinental routes. Like the new seats launched by rival Qantas in December, they feature fully flat beds and aisle access for all passengers. Both carriers have described their respective seats as the best domestic business class offering in the sky anywhere in the world – and on that ground they have pretty equal bragging rights.\nBut Mr Borghetti said the new Virgin seats, which will be installed on all six of its A330s by the end of October, will provide a more consistent experience for passengers than those at rival Qantas.\nLike the new seats launched by rival Qantas in December, Virgin Australia's new seats feature fully flat beds and aisle access for all passengers. Virgin had hoped to have its entire fleet completed by now, but it faced regulatory delays because it is the first carrier in the world to feature this seat design on an A330, and the airbag in the seat-belt needed to be tested. However, Qantas will not complete the revamp of its A330 fleet until the end of next year.\nThat means for Qantas passengers, it is luck of the draw whether they fly in the new fully flat product or one of its older recliner models. Qantas passengers also receive plunger coffee, rather than the Nespresso option.\nMr Borghetti is hoping the new business class seats, which will cut the capacity of that section to 20 from 24, will allow it to gain a bigger share of the lucrative corporate and government market.\n\"If you are competitive still in your pricing and you have a better product, then you will get that market share,\" he said. \"That is where the profit comes.\"\n Qantas from October will drop some Melbourne-Perth flights and downgrade six weekly Sydney-Perth services to a smaller Boeing 737 aircraft as a result of declining demand from the resources industry. Mr Borghetti said Virgin had no intention of withdrawing any A330 services to Perth, because they were performing very well.\nVirgin chief customer officer Mark Hassell said the new seats would give business travellers to and from Perth a high level of privacy, which was desirable when reading board papers or trying to get some sleep.\n\"I want 'red eyes' to become 'shut eyes',\" he said.\nDavid Flynn, editor of the independent Australian Business Traveller website, said there were many similarities between the new Qantas and Virgin A330 business class seats, including direct aisle access, a fully flat bed, a large HD video screen and plenty of storage space around the seat.\nBut he said passengers flying in pairs might appreciate the sliding panel between Virgin's middle seats, compared with the fixed divider on Qantas aircraft.", "external_links": ["http://www.ausbt.com.au/"], "published": "2015-08-17T08:46:00.000+03:00", "crawled": "2015-08-17T10:12:00.997+03:00", "highlightTitle": ""}