{"organizations": [], "uuid": "0789ec414f6a8053c6c65b67e010844a6a87bb0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/just-eat-delivers-surge-revenues-151934232.html", "country": "US", "title": "Just Eat delivers surge in revenues and profits", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Just Eat delivers surge in revenues and profits", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T18:19:00.000+03:00", "replies_count": 0, "uuid": "0789ec414f6a8053c6c65b67e010844a6a87bb0a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/just-eat-delivers-surge-revenues-151934232.html", "ord_in_thread": 0, "title": "Just Eat delivers surge in revenues and profits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Aug 4, 2015, 16:35 BST - UK Markets closed Just Eat delivers surge in revenues and profits By Ben Martin | Telegraph – 15 minutes ago 7.00 0.00 \nThe online takeway service has dismissed concern that it will be hurt by new entrants into the market \nJust Eat (Other OTC: JSTLF - news ) has brushed off concern it faces mounting competition from rivals muscling into the online food delivery industry after reporting that first-half orders, revenues and profits all surged by more than 50pc . \nRevenues for the six months to the end of June climbed 54pc to £107.8m, pre-tax profits were up 63pc to £14m, and orders rose by 52pc to 41.9m, with the FTSE 250 company boosted by a 59pc increase in the number of its active users to 11m. \nJust Eat, a web-based platform that acts as go-between linking takeaway restaurants with customers, now expects to post full-year revenues of £230m, up from an earlier forecast of just above £200m, as it continues to grow at break-neck speed. \nIn the UK, which accounts for 71pc of group sales, revenues increased by 48pc to £76.9m. David Buttress, chief executive, said it would be “many many year’s time” before growth in the UK slowed to the pace seen in Denmark, a mature market that experienced a 15pc increase in sales on an underlying basis. \n“We have a tonne of runway left to shoot for,” he said. “Seven out of 10 orders in the UK are still placed on the telephone.” \nNevertheless, there are worries that competition is rising. Nick Batram, analyst at Peel Hunt, warned investors that Just Eat could come under threat because “the likes of Amazon and Uber are all coming in with slightly different business models”. \nHe cautioned: “Ultimately, as the big boys move in and competition from alternative models increases, there is potentially a risk to margins in the long-term.” \nHowever, Mr Buttress, who has led Just Eat since January 2013, was confident his company would see off its rivals. \n“It’s always been a very competitive place, there’s nothing new in that,” he said, noting that Just Eat had faced down the challenges posed by Groupon (NasdaqGS: GRPN - news ) , SeamlessWeb and lastminute.com over the past decade. \nAmerican companies such as Amazon would have difficulty competing, Mr Buttress argued, as “you need to have local teams in every market”. \nThe company, which floated on the London stock market in April last year , is expanding into countries other than the UK and Denmark, and in June entered Australia and New Zealand through its £445m acquisition of Menulog Group. Revenues from non-core territories including France and Mexico rose by 113pc to £24.1m in the first-half. \nMr Buttress said there were two or three markets which he declined to identify - where Just Eat would consider further deals, although he added that there is “nothing at all in the pipeline”.", "external_links": [], "published": "2015-08-04T18:19:00.000+03:00", "crawled": "2015-08-04T18:35:13.541+03:00", "highlightTitle": ""}