{"organizations": [], "uuid": "8657ba71b44f28a3f82bc9cae6d3b99ccdb31948", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-08/TP_84561_dollar.jpg", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business/Finance", "url": "http://www.menafn.com/1094298911/Dollar-bond-yields-rise-on-US-rate-hike-bets?src=RSS", "country": "US", "title": "Dollar, bond yields rise on U.S. rate hike bets", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Dollar, bond yields rise on U.S. rate hike bets | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "8657ba71b44f28a3f82bc9cae6d3b99ccdb31948"}, "author": "The Peninsula", "url": "http://www.menafn.com/1094298911/Dollar-bond-yields-rise-on-US-rate-hike-bets?src=RSS", "ord_in_thread": 0, "title": "Dollar, bond yields rise on U.S. rate hike bets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - The Peninsula) The dollar jumped and world stocks were left flat-footed on Thursday after the Federal Reserve painted a relatively bright picture of the U.S. economy, boosting bets that it will hike interest rates in September.\n\nEurope's stock markets had initially started brightly but began to fade as attention switched from company earnings from the likes of Siemens and Deutsche Bank to upcoming euro zone unemployment, business sentiment and German inflation data.\n\nThere was no sign of the dollar wilting, though, as it consolidated overnight gains against most of the world's main currencies following the latest Fed meeting.\n\nThe U.S. central bank's officials said they felt the economy had overcome a first-quarter slowdown and was \"expanding moderately\" and had seen \"solid job gains\" in recent months despite a fresh downturn in the energy sector and headwinds from overseas.\n\nWith U.S. Q2 gross domestic product data also due later that could reinforce the rate hike view, the dollar was almost a cent higher against the euro than it had been on Wednesday at 1.0960 and was at a one week-high of 124.16 against the yen JPY=\n\nKully Samra, a managing director at U.S.-focused investment manager Charles Schwab in London, said his firm's view remained that the Fed would push ahead with its first rate hike in almost a decade in September but then move cautiously.\n\n\"Because of the slow process we will see with this rate hike cycle, we don't think it will doom the bull market (in stocks),\" he said.\n\n\"Mainly because it will send a message that the Fed is at the beginning of a normalization process and it no longer needs to treat the patient as if it is in the trauma room.\"\n\nThe Fed's message had lifted U.S. bond yields overnight. The more sensitive two-year yields had hit their highest since early June but there was little impact on German Bunds and Europe's other core bond markets ahead of the region's data deluge.\n\nAhead of the main flurry at 0900 GMT there were a couple of early surprises.\n\nGerman unemployment unexpectedly saw its biggest increase in over a year while Sweden's Q2 economic growth beat forecasts, driven by surprisingly strong net exports as the Nordic region's major economy outpaces much of Europe.\n\nGREAT FALL OF CHINA\n\nThe push and pull of stronger U.S. growth but potentially higher interest rates in coming months had seen Asian stocks tail off in late trade.\n\nJapan's Nikkei .N225 ended up 1 percent and Australian shares added 0.8 percent. But South Korean shares .KS11 fell 0.7 percent while Chinese stocks took another near 3 percent tumble.\n\nChinese equities are already down over 30 percent from their June highs, and the latest drop came after state media reported that banks were investigating their exposure to the stock market from wealth management products and loans collateralized with stocks.\n\n\"The market has been struggling to hover above the water with investors taking to the sidelines to see if stability can be maintained in the market,\" said Ben Kwong, a director at KGI Asia in Hong Kong.\n\nWith the dollar flexing its muscles again commodity markets were also back under pressure with copper CMCU3, considered a bellwether for global economic activity, trading near a six-year low at 5,322 a tonne.\n\nThe broad Thomson Reuters CRB commodities index .TRJCRB hit a fresh six-year low, while gold was flirting with a 5-1/2 year low at 1,093.40 an ounce as its appeal ahead of potentially higher global interest rates remained in question.\n\nOil prices, still smarting from rising U.S. shale oil output and an easing of sanctions on Iran, were sliding back too having bounced on Wednesday following an unexpectedly large weekly drawdown in U.S. crude inventories.\n\nFront-month Brent crude futures LCOc1 were pegged at 53.52 a barrel, and U.S. crude was down to 48.70 and just off Tuesday's 4-1/2-month low. They have both lost over 15 percent during July.", "external_links": [], "published": "2015-08-01T03:00:00.000+03:00", "crawled": "2015-08-01T23:32:42.141+03:00", "highlightTitle": ""}