{"organizations": [], "uuid": "8ec064b57170f478cd911d91584cdd180433afc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/7/b/9/1/image.related.afrArticleLead.620x365.gip4cb.png/1438916622369.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/simple-steps-to-leave-your-finances-in-shape-when-you-die-20150731-gip4cb", "country": "AU", "title": "Get your finances in shape for when you die", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Get your finances in shape for when you die | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T22:15:00.000+03:00", "replies_count": 0, "uuid": "8ec064b57170f478cd911d91584cdd180433afc2"}, "author": "Debra Cleveland", "url": "http://www.afr.com/personal-finance/simple-steps-to-leave-your-finances-in-shape-when-you-die-20150731-gip4cb", "ord_in_thread": 0, "title": "Get your finances in shape for when you die", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's hard enough for family members to cope with death without being left a financial mess. Share on twitter Share on Google Plus by Debra Cleveland It's much easier to marry than to die, says a friend of mine whose husband died about 11 years ago.\n\"The repercussions of death go on and on, whereas a marriage just starts,\" she says. Her husband, a financial planner, was diagnosed with cancer and given six months to live. He died 18 months later and used that time to guide her through all their assets and talk her through what she needed to do.\nThe death of a partner is hugely traumatic and challenging enough without having to deal with household finances as well.\nAlthough my friend was in some ways prepared for what was to come, she still found it very difficult. In many cases, though, death takes couples by surprise - and the financial repercussions can be enormous. If you take these steps while things are going well, you can minimise the fall-out from such an event.\n1. Organise your assets Retired Sydney financial planner Peter McCarthy used to give his clients a booklet he called an estate register, in which they listed their assets, the location of any documents relating to these assets and a list of people to contact in the event of an accident or death.\nWhether yours is also a hard copy or an online version, it should include deeds to the family home, insurance policies (whether general or life cover) and any agreements you may have. If one of you runs a business, make it clear where the business-related documents are. And if you run a self-managed superannuation fund, make sure you keep up-to-date records in terms of your separate entitlements.\nThe head of wealth management at HLB Mann Judd, Michael Hutton, says that when it comes to superannuation, benefits can be received sooner if you nominate your spouse as the beneficiary with a binding nomination. That way, funds can be paid out on receipt of the death certificate rather than waiting for the estate to be wound up. This is usually not standard practice, so ensure you make a separate binding nomination.\nIf you own shares, keep records in an agreed place (either electronically or in paper form) where you both have access to shareholder reference numbers (SRNs) or holder identification numbers (HINs) and know what's in your portfolio.\n And don't forget to include a list of your debts, suggests solicitor Sue Barry-Cotter of Lawmark. Not only will it make things clear to your spouse, but it will be needed for probate (getting the will approved). Make sure, too, that you have copies of your wills and your solicitor's details.\n2. Draw up a will Organising a will may cost you a few hundred dollars [if you go through a suburban lawyer] but cuts out complications down the track. It's also an important step in establishing a relationship. \"When something happens, the lawyer's the first person you'd appeal to for help in getting the will through probate [getting the will approved],\" McCarthy says.\n3. Discuss your strategy If you run a DIY super fund or hold assets in a structure like a family trust, talk about the options if and when one of you dies. If one person does most of the investing and administration, Hutton says, suggest an adviser from whom the remaining spouse can seek help if needed. Also keep clear records that detail what is held where.\nFor older couples or if one party is becoming ill, Hutton suggests an enduring power of attorney, which continues even when mental capacities deteriorate.\nIf there is a long illness, it can help to discuss funeral arrangements. In my friend's case, she researched Quote: s while her husband was still alive, so she was well prepared. The arrangements, with a simple unglazed coffin on which his friends could write messages, cost about $6000.\n4. Know what to do One of the first steps after death is to organise the death certificate. The funeral home will often give you the forms for this, but even then it can be complicated. \"I had to know his mother's maiden name, his parents' birth place, details of his first marriage,\" my friend says. \"It's a good thing we organised this beforehand so he was there to help me fill in those gaps.\" The funeral home then sent the form off to her state's Registry of Births, Deaths and Marriages and she received the certificate about a week later.\nWhether it's you or your spouse's executor filing for probate, you'll need to do this through your state's Supreme Court. At least 14 days before doing this, says Barry-Cotter, you will need to place an online notice on the website of your state's Supreme Court of your intention to apply for probate.\n5. Follow the paper trail You will need to let your bank and other financial institutions know of your partner's death once you've got the death certificate. Make about a dozen certified copies, as you will probably need them.\nThere are many tales of accounts being frozen pending the death certificate even when in joint names. Barry-Cotter says if the account was set up in joint names and needed only one signature, the remaining spouse should be able to continue as normal. For joint accounts requiring both signatures, the bank may accept a medical cause-of-death certificate. If not, she says, death certificates can take as long as four weeks to be issued. So it's probably worth taking a closer look at your bank account now before any problems arise.\ndcleveland@fairfaxmedia.com.au", "external_links": ["https://plus.google.com/https://plus.google.com/u/0/+DEBRACLEVELANDmoney/about", "https://twitter.com/https://twitter.com/ClevelandAFR"], "published": "2015-08-06T22:15:00.000+03:00", "crawled": "2015-08-07T10:55:50.176+03:00", "highlightTitle": ""}