{"organizations": [], "uuid": "01e2a1076285e4e48312cda43815060fcbd0d5eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/09/airlines-competition-delta-idUSL1N10K06W20150809", "country": "US", "title": "Delta Air Lines shrinks Dubai service, points to Gulf carrier growth", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Delta Air Lines shrinks Dubai service, points to Gulf carrier growth | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T18:29:00.000+03:00", "replies_count": 0, "uuid": "01e2a1076285e4e48312cda43815060fcbd0d5eb"}, "author": "Jeffrey Dastin", "url": "http://www.reuters.com/article/2015/08/09/airlines-competition-delta-idUSL1N10K06W20150809", "ord_in_thread": 0, "title": "Delta Air Lines shrinks Dubai service, points to Gulf carrier growth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aug 9 Delta Air Lines Inc has scrapped a number of its flights to Dubai this winter in an apparent nod to how competition with three Gulf carriers is hurting its business.\nDelta, the second-largest U.S. passenger carrier, will fly nonstop to Dubai from its Atlanta hub between four and five times per week starting Oct. 1, down from daily service this summer. The airline revised its schedule on Friday to reflect the change, part of a broader 15-to-20 percent cut in capacity to the Middle East and Africa that Delta announced in April.\n\"The reduction comes amid overcapacity on U.S. routes to the Middle East operated by government-owned and subsidized airlines,\" Delta spokesman Trebor Banstetter said in a statement, noting that daily service would return in the spring of 2016.\nDelta said months ago that its international capacity cuts were in response to falling crude prices hitting demand in oil-rich markets and to the strong U.S. dollar that has hurt the spending power of foreign travelers.\nYet the latest news underscores a trade row that is rippling through Washington.\nLarge U.S. unions and airlines, led by Delta, charge that Emirates, Etihad Airways and Qatar Airways have received some $42 billion in subsidies from their home governments in the past decade. They say this has allowed the Gulf carriers to start dumping capacity into the United States, driving down prices and pushing out competitors.\nThe Gulf carriers have denied that they are subsidized and say poor customer service has caused U.S. airlines to lose market share.\nOther U.S. carriers such as JetBlue Airways Corp and the air cargo unit of FedEx Corp have backed the Gulf airlines, saying that government action would signal an abandonment of the United States' liberal trade policy in favor of protectionism.\nThe Obama administration is currently reviewing the issue.\nDelta is the only airline that flies between Atlanta and Dubai. Its service reduction will leave the Washington-Dubai flights on rival United Continental Holdings Inc as the only remaining daily nonstop on a U.S. carrier this winter.\nEmirates operates a freighter service to Atlanta and currently flies passengers to nine U.S. cities from Dubai, with plans to add more. Qatar Airways will launch Atlanta-Doha flights in July 2016. (Reporting By Jeffrey Dastin in New York; Editing by Gareth Jones)", "external_links": [], "published": "2015-08-09T18:29:00.000+03:00", "crawled": "2015-08-09T17:56:14.472+03:00", "highlightTitle": ""}