{"organizations": [], "uuid": "0eff32b9fc9f88327fbd0fe33cde6fdc9fce77fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "http://g.foolcdn.com/editorial/images/177209/2016-chevrolet-silverado-001.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13anpuh5a/*http://www.fool.com/investing/general/2015/08/21/the-stock-market-is-tumbling-3-actions-to-take-3-s.aspx?source=eogyholnk0000001", "country": "GB", "title": "The Stock Market Is Tumbling: 3 Actions to Take & 3 Stocks to Consider Buying", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "The Stock Market Is Tumbling: 3 Actions to Take & 3 Stocks to Consider Buying", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T17:26:00.000+03:00", "replies_count": 0, "uuid": "0eff32b9fc9f88327fbd0fe33cde6fdc9fce77fb"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/mfool/rss/SIG=13anpuh5a/*http://www.fool.com/investing/general/2015/08/21/the-stock-market-is-tumbling-3-actions-to-take-3-s.aspx?source=eogyholnk0000001", "ord_in_thread": 0, "title": "The Stock Market Is Tumbling: 3 Actions to Take & 3 Stocks to Consider Buying", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Motley Fool Mobile The Stock Market Is Tumbling: 3 Actions to Take & 3 Stocks to Consider Buying The stock market may have hit a rough patch, but that's no time to panic if you're a long-term investor. Sean Williams Aug 21, 2015 at 10:26AM Source: Flickr user Wayne Silver. \nFor all intents and purposes Wednesday and Thursday have represented the two ugliest days for the stock market (especially the Dow Jones Industrial Average ) and investors in quite some time. The Dow's 358-point tumble on Thursday brings its two-day drop to 520 points, while the broad-based S&P 500 has shed 61 points combined in its previous two sessions. \nAnd while the market has retreated, the level of anxiety among traders has definitely increased. Plug in \"stock market plunge\" into your search engine of choice and you'll get no shortage of news reports implying that investors suffered a bloodbath this week from which they won't soon recover. \nThree actions to take right now You could certainly choose to buy into the panic being created by emotional traders over the last couple of days, or you could take the Foolish path to investing and keep the long-term in mind. \nDespite the market indexes tumbling, I'd suggest you take these three actions (which I refer to as the three \"R's\") to heart. Relax: The first thing investors should do is take a breath and relax. The stock market isn't an investment vehicle that rises in a straight line, and corrections in the broad-based market are a natural and healthy thing. Trying to predict which way the market will vacillate on a day-to-day basis is pretty pointless, meaning you shouldn't be too concerned with the magnitude of its daily swings. Realize: Investors should also realize that the stock market offers them their greatest change to retire comfortably over the long run. Sure, you could always bank on winning the lottery or finding a Picasso in your attic, but it's undeniable that the stock market's historical returns handily outpace the return you'd get by investing your money in CDs, savings accounts, bonds, and metals. Most importantly, stock returns have trounced inflation over the long run, meaning investors are building nominal and real wealth. Reassess: Lastly, it never hurts to reassess your portfolio holdings during a market correction. How should you handle this reassessment? While everyone has their own method of researching and analyzing stocks, the main gist comes down to this: Is your primary thesis for buying {insert your stock here} still intact? If your investing thesis hasn't changed, then there's no material reason to be worried about a simple market correction. \nOnce you've taken these actions you'll be ready to assess stocks with a calm, collected, and long-term view in mind. \nThree stocks you can consider buying For true long-term investors this recent dip in the market represents an ongoing buying opportunity to pick up high-quality companies at a potentially attractive price point. Although you'll certainly want to do your own research, and should consider this as nothing more than a starting point for that research, here are three stocks you can consider buying right now as the stock market tumbles. \nTwitter ( NYSE:TWTR ) Just because the market is dropping doesn't mean you need to abandon the idea of investing in growth stocks. Of course, you should also understand that growth stocks may have a higher propensity for volatility, and as such they tend to be geared toward investors with a higher appetite for risk (and reward). \nTwitter has strung together two disappointing quarters in a row, which halved its stock from a closing high of nearly $53 in April to Thursday's close at just $26, below its IPO price. It's been a little bit of a reality check for social media investors that expected to throw a dart and make money. But, Twitter's struggles could turn into cheers just as quickly. Source: Flickr user Hank Mitchell. \nOne problem right now for Twitter is that investors don't understand how it'll monetize its media platforms. These are the same investors that in 2012 didn't quite understand how Facebook was going to turn its mobile platform into a moneymaker -- and we've all seen how that turned out. Another potential issue to watch is the company's anemic monthly active user (MAU) growth, which has essentially ground to a stand-still. \nHowever, Twitter has a boatload of ways it could generate cash flow and boost MAUs, including monetizing Vine, expanding the usage of videos on the Twitter platform, or beefing up its direct messaging platform. These are just a handful of the numerous ideas being thrown around. \nIn total, Wall Street anticipates Twitter's revenue will more than triple by 2018 from what it recorded in 2014, and that it could produce in excess of $1.50 in adjusted EPS in 2018. That works out to a pretty attractive valuation for a brand-name social media company. \nGeneral Motors ( NYSE:GM ) Looking for something more value-oriented? How about automaker General Motors, which is trading at a microscopic forward P/E of just six! \nWhat's been plaguing GM stock? Primarily it's been the $4.1 billion in costs associated with its more than 30 million vehicle recall last year. Secondary to these costs has been slowing growth in China -- China is now the largest auto market in the world. \nBut, just like Twitter there are catalysts here that suggest investors aren't accurately taking GM's long-term prospects into consideration. For example, PR issues rarely have a way of lingering in consumer-facing products. Through the first seven months of 2015, General Motors' U.S. sales have risen by close to 4%, signaling that the worst was likely in the rearview mirror. 2016 Chevrolet Silverado 1500 LTZ Z71. Source: General Motors. \nGM has also been making sweeping changes to some of its best-selling vehicles that could go right to its bottom-line. The redesign of the Chevrolet Silverado and GMC Sierra led to Silverado topping the 500,000 unit mark (529,755) in 2014 for the first time since 2007 in the U.S. , and the Sierra hitting close to 212,000 units sold in the U.S., its best year since 2005. Furthermore, a substantial redesign of the Chevrolet Cruze, GM's best-selling car around the globe, could push that vehicle over 300,000 units in the U.S. by as early as 2017. It could also add an extra $1,500 in profit per car into GM's pockets compared to the first-generation Cruze. For value seekers (and investors that relish in 4%-plus yields) it could be time to hit the gas. \nCelgene ( NASDAQ:CELG ) Lastly, how about a little inelastic growth with biotech blue-chip stock Celgene? \nBiotech, in general, has been pinpointed as one of the sectors that carries an aggressive valuation. As such it could also be opined that it could be one of the hardest hit come a recession or correction in the stock market. However, if you do a little digging you can find high-quality stocks in the healthcare sector that could easily transcend weakness in the overall market. Celgene is one such stock. Source: National Cancer Institute. \nWhat makes Celgene such a dominant force in biotech is its perfect balance of growth. First, Celgene has demonstrated an incredible ability to grow organically. Blockbuster multiple myeloma drug Revlimid could be expanded to as many as eight additional labels, while the recently approved anti-inflammatory drug Otezla, which is expected to grow into a drug capable of $2 billion in annual sales, could be approved in a half-dozen additional indications. \nSecondly, Celgene is a master collaborator. The company currently has about 30 working partnerships that could net it a significant chunk of revenue should any of the first-in-class oncology, immunology, or inflammation products from its partners succeed in clinical studies. \nLastly, Celgene knows how to beef up its bottom-line through the occasional acquisition. Its purchase of Abraxis BioScience in 2010 landed it cancer drug Abraxane, which by 2017 will have grown its sales five- or six-fold since 2009. \nWith Celgene expecting $13 in EPS by 2020 and a veritable doubling in sales, I believe this is a stock you should give serious consideration to regardless of where the broader market indexes are headed. \nHow one Seattle couple secured a $60K Social Security bonus -- and you can too A Seattle couple recently discovered some little-known Social Security secrets that can boost many retirees' income by as much as $60,000. They were shocked by how easy it was to actually take advantage of these loopholes. And although it may seem too good to be true, it's 100% real. In fact, one MarketWatch reporter argues that if more Americans used them, the government would have to shell out an extra $10 billion... every year! So once you learn how to take advantage of these loopholes, you could retire confidently with the peace of mind we're all after, even if you're woefully unprepared. Simply click here to receive your free copy of our new report that details how you can take advantage of these strategies. \nSean Williams has no material interest in any companies mentioned in this article. You can follow him on CAPS under the screen name TMFUltraLong , track every pick he makes under the screen name TrackUltraLong , and check him out on Twitter, where he goes by the handle @TMFUltraLong . \nThe Motley Fool owns shares of and recommends Celgene, Facebook, and Twitter. It also recommends General Motors. Try any of our Foolish newsletter services free for 30 days . We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy . Compare Brokers Sean Williams Fool Contributor A Fool since 2010, and a graduate from UC San Diego with a B.A. in Economics, Sean specializes in the health care sector, but also has a penchant for mining, retail, and automotive stocks, as well as personal finance and macroeconomic topics of interest. Follow @TMFUltraLong Article Info Aug 21, 2015 at 10:26AM Investment Planning", "external_links": [], "published": "2015-08-21T17:26:00.000+03:00", "crawled": "2015-08-21T21:38:13.353+03:00", "highlightTitle": ""}