{"organizations": [], "uuid": "992ac2e9b223af4b0742fd3a4fa17a80d5307d59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-28/bailout-won-t-save-ukraine-without-crackdown-on-graft-ebrd-says", "country": "US", "title": "Bailout Won’t Save Ukraine Without Crackdown on Graft, EBRD Says", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Bailout Won’t Save Ukraine Without Crackdown on Graft, EBRD Says - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T18:31:00.000+03:00", "replies_count": 0, "uuid": "992ac2e9b223af4b0742fd3a4fa17a80d5307d59"}, "author": "Agnes Lovasz", "url": "http://www.bloomberg.com/news/articles/2015-08-28/bailout-won-t-save-ukraine-without-crackdown-on-graft-ebrd-says", "ord_in_thread": 0, "title": "Bailout Won’t Save Ukraine Without Crackdown on Graft, EBRD Says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ukraine has a lot more work to do to root out corruption and improve its business climate to attract investment and help wean the country off bailouts, according to the European Bank for Reconstruction and Development.\nA $40 billion lifeline the International Monetary Fund and other institutions pledged earlier this year to Ukraine over four years will only help revive the economy if there’s no letup in the fight against graft and efforts to overhaul the economy, Francis Malige, EBRD managing director for eastern Europe and the Caucasus, said in an interview on Wednesday.\n“Unless this is done, no amount of money will be enough,” Malige said in London. “The power of the private sector, both Ukrainian and foreign, to invest is much, much bigger than the power of the institutional investment. It’s much larger by monetary amount if you can unleash it.”\nProgress in wiping out a culture of bribe-taking and embezzlement and an oligarchic economic model is key to maintaining aid from the U.S. and Europe and luring private investment that the recession-hit, debt-laden economy needs. Successive governments have failed at the task since independence in 1991, leaving Ukraine poorer than former Soviet bloc countries. Authoritarian Belarus is about twice as wealthy.\n2016 Growth With a war simmering with pro-Russian rebels in the country’s industrial heartland, the economy remains mired in a recession. The EBRD in May forecast that Ukraine’s economy will shrink 7.5 percent this year and grow 3 percent next year.\n“It’s clear that the risks to the downside are materializing,” Malige said. The numbers will probably be revised to reflect that, he said.\nThe EBRD earlier this year commended Ukraine’s leaders on the progress they’ve made in energy policy, gas tariffs and cleaning up the financial system, while calling for even bolder measures, especially in fighting oligarchs and clamping down on corruption.\n“Corruption is everywhere and very pervasive,” Malige said. “It’s the crux of the battle. I see some progress. I see more transparency, but a lot more needs to be done.”\nThe country of more than 40 million people ranked 142 out of 175 countries in the Transparency International Corruption Perception Index last year, even with Uganda and behind Russia and Kyrgyzstan.\n‘Slow Start’ “Symbolic” moves such as revamping the police force and introducing electronic procurement for some government transactions has helped reduce “petty corruption,” according to Malige. Yet, “high-level corruption is insufficiently tackled,” he said.\nStill rampant corruption and the uncertainty of the war in the eastern part of the country is keeping investors away. The London-based lender increased its investments to a record 1.2 billion euros ($1.3 billion) in Ukraine last year, making it the second-largest of 36 recipients behind Turkey.\nThis year had “a slow start” as some of the companies the bank works with reconsidered business decisions as the recession deepened, fighting flared and negotiations with private bondholders dragged on, according to Malige. The bank has invested less than 200 million euros so far in 2015.\nThe deal Ukraine reached with private bondholders on restructuring its debt on Thursday reduces economic uncertainty and opens the way for more investment, Malige said in an e-mail after the announcement.\nThe “non-transparent, oligarch-dominated economy” and red tape built over the last two decades makes an overhaul even harder than it would have been in 1991, according to Malige.\n“But this is a government which is the most reform-oriented the country has ever seen, one of the most competent among all our countries of operations, with a lot of dynamism and a lot of willingness to change,” he said.", "external_links": ["https://www.transparency.org/cpi2014/results\\"], "published": "2015-08-28T18:31:00.000+03:00", "crawled": "2015-08-28T16:29:33.798+03:00", "highlightTitle": ""}