{"organizations": [], "uuid": "173dc795f9a1c9f30ffc9f06b32c641fbc9565d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources.news.com.au/cs/newscomau/images/placeholders/story-thumb-large.jpg", "site_section": "http://www.news.com.au/finance/business/breaking-news", "section_title": "Business Breaking News | Finance &amp; Business News | News.com.au", "url": "http://www.news.com.au/finance/business/gen-y-embracing-high-rise-housing-dream/story-e6frfkur-1227490937286", "country": "AU", "title": "Gen Y embracing high-rise housing dream", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Gen Y embracing high-rise housing dream", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "173dc795f9a1c9f30ffc9f06b32c641fbc9565d6"}, "author": "Megan Neil", "url": "http://www.news.com.au/finance/business/gen-y-embracing-high-rise-housing-dream/story-e6frfkur-1227490937286", "ord_in_thread": 0, "title": "Gen Y embracing high-rise housing dream", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MILLENNIALS are shunning the great Australian dream of owning a house in a quarter-acre block in the suburbs.\nGENERATION Y are embracing their own high-rise dream: living close to where they work, surrounded by cafes and restaurants, and walking to the supermarket.\nLess than five years ago, only 10 per cent of new home approvals were in high-rise complexes of more than four storeys, CommSec chief economist Craig James says. Today more than a quarter of all new homes being built are in high-rise buildings. Mr James says the trend will mean more restaurants, bars, supermarkets and service businesses like hairdressers are established in nearby areas, creating opportunities for businesses. \"The millennials have indicated a preference for living close to where they work, to cafes and restaurants and the like rather than commuting,\" he says. That's in contrast to baby boomers or some of generation X who preferred to have a quarter-acre block in the suburbs, commute and spend their weekends mowing lawns. \"The gen Y or the millennials are effectively saying `no, that's not for us - we want to be travelling, we want a different sort of lifestyle',\" Mr James says. Australia's multi-unit apartments and townhouses industry has enjoyed strong growth over the last five years, industry analysts IBISWorld says. That's been underpinned by the shift towards more high density living particularly in capital cities and urban areas, a search for more affordable housing for first home buyers and a continued move towards downsizing, IBISWorld senior industry analyst Spencer Little says. Urban Taskforce Australia chief executive officer Chris Johnson argues the property development industry is really just providing a product the market wants. Mr Johnson says it's not only gen Y who prefer to live in inner-city apartments. Downsizing baby boomer retirees are preferring to live in apartments close to shops, amenities, entertainment and transport. \"A lot of people are preferring this sort of lifestyle,\" he told a federal parliamentary inquiry into home ownership. But economist Saul Eslake argues that while a substantial decline in home ownership rates in Australia may reflect changing preferences, it's more likely in response to deteriorating housing affordability. \"It's much more likely that this decline is largely in response to deteriorating housing affordability and more plausible that changing housing tenure preferences among younger adults are themselves a response to deteriorating housing affordability,\" he told the inquiry. The high-rise developments are even moving away from a single apartment building and into bigger complexes which have multiple apartment buildings on the one site, Mr Little notes. \"Rather than just having a building there it's now more about the living, the environment and the community,\" Mr Little says. \"The industry players are certainly looking at ways to attract tenants.\" Putting hundreds of apartments in the one spot requires supporting facilities. \"All those people moving in the area, they've got to have access to a supermarket, they've got to have access to a hairdresser, to a newsagent, takeaway food,\" Mr James says. \"There's gains for those businesses in locating there because automatically they've not just got access to a couple of new houses, they've got access to hundreds of new homes.\" Mr Little says supermarket chains, liquor stores, restaurants and other retail outlets often seek to set up close to these new residential areas particularly when they have multiple buildings rather than just the one. \"Looking at it from a consumer point of view, they're often quite time poor, they're looking at the convenience of having these retail outlets, supermarkets, restaurants very close by. So it's certainly very beneficial both for the businesses and for the tenants.\" Many of the multi-building apartment complexes have cafes and other amenities, including child care, on site. \"Again this is trying to drive the demand and have more of a community experience for the tenants rather than just being a place to live,\" Mr Little says. ", "external_links": ["http://www.newsvine.com/_wine/save?popoff=0&u=http://www.news.com.au/finance/business/gen-y-embracing-high-rise-housing-dream/story-e6frfkur-1227490937286?sv=b503e29e0dbbe3a78653160e0a738be2&h=Gen+Y+embracing+high-rise+housing+dream", "http://www.kwoff.com/submit.php?url=http://www.news.com.au/finance/business/gen-y-embracing-high-rise-housing-dream/story-e6frfkur-1227490937286?sv=b503e29e0dbbe3a78653160e0a738be2", "http://www.myspace.com/index.cfm?fuseaction=postto&t=Gen+Y+embracing+high-rise+housing+dream&c=GEN+Y+want+to+live+close+to+where+they+work+and+have+restaurants%2C+bars+and+supermarkets+nearby%2C+as+more+opt+for+a+high-rise+lifestyle.&u=http://www.news.com.au/finance/business/gen-y-embracing-high-rise-housing-dream/story-e6frfkur-1227490937286?sv=b503e29e0dbbe3a78653160e0a738be2", "http://digg.com/submit?phase=2&url=http://www.news.com.au/finance/business/gen-y-embracing-high-rise-housing-dream/story-e6frfkur-1227490937286?sv=b503e29e0dbbe3a78653160e0a738be2&title=Gen+Y+embracing+high-rise+housing+dream", "http://del.icio.us/post?url=http://www.news.com.au/finance/business/gen-y-embracing-high-rise-housing-dream/story-e6frfkur-1227490937286?sv=b503e29e0dbbe3a78653160e0a738be2&title=Gen+Y+embracing+high-rise+housing+dream", "http://www.facebook.com/share.php?u=http://www.news.com.au/finance/business/gen-y-embracing-high-rise-housing-dream/story-e6frfkur-1227490937286?sv=b503e29e0dbbe3a78653160e0a738be2"], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T03:56:35.426+03:00", "highlightTitle": ""}