{"organizations": ["End Tribalism"], "uuid": "bced2e735c3a44b2aab9fbf7eda802576ab4b12f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508281521.html", "country": "US", "title": "Kenya: Fishing Town Swaps Boats for Mangroves and Mariculture", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Fishing Town Swaps Boats for Mangroves and Mariculture", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T16:52:00.000+03:00", "replies_count": 0, "uuid": "bced2e735c3a44b2aab9fbf7eda802576ab4b12f"}, "author": "", "url": "http://allafrica.com/stories/201508281521.html", "ord_in_thread": 0, "title": "Kenya: Fishing Town Swaps Boats for Mangroves and Mariculture", "locations": ["Kenya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ruto"], "text": "Kenya: We Will Form One National Party By 2017 to End Tribalism - Ruto \nThey also maintain four tidal fish ponds nearby, which help them conserve local marine life and make a living as climate change impacts bite and fish catches on the open sea shrink. \n\"I am educating my children from the proceeds I get from planting these mangroves, and selling the prawns and fish we farm,\" said Mramba. \nAccording to the Kenya Marine and Fisheries Research Institute (KMFRI), coastal mangrove forests are among the world's most important wetland ecosystems, providing crucial habitat for wildlife and fish, slowing coral reef sedimentation, and protecting coastlines from severe weather events. \nBut they are also being destroyed at an alarming rate. Over the past 50 years, around one-third of the world's original mangrove forests have been lost to unsustainable wood harvesting, pollution, unfettered development, flooding, erosion and sedimentation, says KMFRI. \nWith aid from Slovakia, channeled through the Kilifi-based Kwetu Training Centre for Sustainable Development, the Mtongani group has replanted more than 15,000 mangrove trees since it formed in 2010. \nMembers also work with the Kenya Forest Service to stop illegal loggers. \"The cutting has reduced since know now even a woman can arrest them,\" said Mramba. \nFISHING FAILURE \nAccording to James Kairu, a principal scientist at KMFRI, the destruction of Kenya's mangroves is a major factor in the struggles of the country's fishing communities. \nFish breed in mangroves before moving to live in coral reefs. Kairu said over-exploitation of fisheries, the felling of mangroves and rising global temperatures have put pressure on the mangrove and coral ecosystem, harming fish populations. \nThe villagers of Kilifi, who mostly depend on fishing for their income, have seen a drastic drop in fish numbers over the last few years. \nTo combat the problem, the Mtongani group decided two years ago to complement their mangrove restoration project with mariculture, the farming of sea life in salt water. \nThe group built four tidal ponds, each 20 metres (65.62 ft) by 15, which hug the Indian Ocean. Twice a day when the tide comes in, the water brings crabs, fish and prawns that are left behind when the tide goes out again. \nThe group catches the creatures to eat, sell and stock their ponds, which are replenished with new nutrient-rich water at each high tide. \n\"We started this project as an alternative source of food and livelihood after fishing started to become unsustainable,\" said Nicholas Ngao, chairman of the Mtongani group, whose name means \"a relaxing place by the sea\" in Swahili. \n\"I have been a fisherman all my life. In a day, I used to be able to fish about 50 kg (110.23 lb) near the shores, but currently getting even 2 kg is difficult.\" \nEvery three months, the group harvests about 300 kg of fish, 108 kg of prawns and 70 kg of crab. The members sell their catch for between Ksh 200 ($2) and Ksh 1,000 ($10) per kilo. \nThey also sell at least 12,000 mangrove seedlings every year for up to Ksh 20 each. A tenth of the proceeds goes towards group maintenance, while the rest is divided among members according to their workload. \nSUSTAINABLE FUTURE \nCombining mangrove conservation with tidal ponds could give coastal communities a chance at a sustainable future as they feel the effects of global warming, said KMFRI's Kairu. \nA report by leading marine scientists, published in July, warned that if temperatures continue to rise at their current rate, ocean warming will further harm marine life, directly affecting food access in coastal communities such as Kilifi. \nHigher temperatures can also trigger devastating storms. Kenya's coast is still recovering from the effects of the El Niño weather phenomenon in 1997-98, which raised ocean temperatures and brought high rainfall. \nThe result was massive sedimentation, killing huge numbers of mangroves and exposing coastal villages to strong waves. The warmer seas also bleached enormous areas of coral reef, putting stress on the region's fish populations. \nWith another major El Niño event now underway, Mramba, Ngao and the other members of the Mtongani group hope that by finding an alternative to traditional fishing and restoring mangrove forests, they can help their village survive - and maybe even thrive - in the face of climate pressures. \n\"The fish and prawns are breeding at a higher rate than before and the mangrove forest has reduced the wind intensity,\" said Ngao. \"The trees mean our farms no longer flood as they used to whenever the sea rises, which makes farming easier than it has been for a long time.\" Kenya \nThe government wants to unite all communities by 2017 to form a single political party devoid of tribalism, Deputy … see more » Copyright © 2015 Thomson Reuters Foundation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-28T16:52:00.000+03:00", "crawled": "2015-08-28T22:57:24.177+03:00", "highlightTitle": ""}