{"organizations": [], "uuid": "6c58b24ab016f837165d4fd8d4ee395555c2f4cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-26/ainslie-s-maverick-said-to-shop-quant-driven-stock-picking-fund", "country": "US", "title": "Ainslie’s Maverick Said to Shop Quant-Driven Stock-Picking Fund", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Ainslie’s Maverick Said to Shop Quant-Driven Stock-Picking Fund - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T18:00:00.000+03:00", "replies_count": 0, "uuid": "6c58b24ab016f837165d4fd8d4ee395555c2f4cb"}, "author": "Simone Foxman", "url": "http://www.bloomberg.com/news/articles/2015-08-26/ainslie-s-maverick-said-to-shop-quant-driven-stock-picking-fund", "ord_in_thread": 0, "title": "Ainslie’s Maverick Said to Shop Quant-Driven Stock-Picking Fund", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Maverick Capital, the $9 billion investment firm led by Lee Ainslie, is speaking with investors about a quant-driven fund that will wager on stocks, according to a person briefed on the plan.\nThe Maverick Fundamental Quant fund would operate separately from Maverick’s main investment unit, the person said. It will use algorithms to analyze various hedge funds’ historical stock picks to predict how investments will fare. Though details aren’t final, the product probably will be offered with liquid terms that would make it accessible to retail investors, the person said.\nAinslie’s firm is expanding its offerings into computer-driven products as hedge funds increasingly look to machines to inform investment decisions. Maverick started using quantitative tools for its fundamental stock-picking in 2006, said the person, who asked not to be identified discussing non-public information.\nFraser Seitel, a spokesman for New York-based Maverick, declined to comment on the firm’s plans.\nInvestment managers are seeking ways to profit from new sources of data and the availability of computing power. Investment firms like Point72 Asset Management have hired people to build teams that can distill “big data” into actionable investment advice. Others like Clifford Asness’s AQR Capital Management have raised billions of dollars by distilling complex computer-driven strategies, usually reserved for sophisticated investors, into mutual funds for the masses.\nMaverick’s new pool will draw data from sources such as regulatory filings to assess a wide range of hedge funds’ positions, the person said. The fund won’t mirror holdings in Maverick’s main fund, though Maverick will be part of the sample of managers surveyed. The fund will take roughly 100 long bets and make 100 wagers against companies’ stocks it thinks will decline, the person said.", "external_links": [], "published": "2015-08-26T18:00:00.000+03:00", "crawled": "2015-08-26T17:31:57.807+03:00", "highlightTitle": ""}