{"organizations": [], "uuid": "bd43cdbddf6fb5d2c6e5335287178b85a6850102", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/29/china-economy-yuan-idUSL4N11402U20150829", "country": "US", "title": "China's Commerce Ministry defends devaluation, sees 'limited' impact", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "China's Commerce Ministry defends devaluation, sees 'limited' impact | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T09:49:00.000+03:00", "replies_count": 0, "uuid": "bd43cdbddf6fb5d2c6e5335287178b85a6850102"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/29/china-economy-yuan-idUSL4N11402U20150829", "ord_in_thread": 0, "title": "China's Commerce Ministry defends devaluation, sees 'limited' impact", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING Aug 29 China on Saturday defended the recent revamp of its foreign exchange regime that led to a sharp devaluation of the yuan, calling it a \"normal adjustment\".\nState news agency Xinhua Quote: d an unnamed Commerce Ministry spokesman as saying the devaluation will have \"limited impact\" on the country's foreign trade.\nOn Aug. 11, in a move that stunned markets, China devalued the yuan by nearly 2 percent.\nThe devaluation was meant to correct a \"relatively large deviation\" between the yuan's spot rate in the market and the daily midpoint fixing by the central bank, the spokesman said.\nChina allows the yuan to rise or fall a maximum of 2 percent from a day's midpoint.\nThe ministry spokesman said a country's exchange rate hinges on its competitiveness and China's economic reforms will help ensure the yuan can remain \"basically stable\" within a \"reasonable\" and \"balanced\" level.\nThe remarks come on the heels of state media commentaries defending China's policymaking, showing Beijing's sensitivity to suggestions it may have fumbled economic policy.\nChina has billed its currency devaluation as a free-market reform measure, and denies allegations that it has started a round of competitive currency devaluations between governments to help exporters.\nThe ruling Communist Party has drawn much of its legitimacy in past decades from fostering economic growth and raising incomes, and wants to be seen as a responsible player in the global economy.\nOn Thursday, Yao Yudong, head of the central bank's Research Institute of Finance and Banking, told Reuters the past week's global stock market rout was sparked by concerns over a possible interest rate rise by the U.S. Federal Reserve and not by the yuan's devaluation.\nHe urged the Fed to delay any rate hike to give fragile emerging market economies time to prepare.\nChina had said the revamp in its foreign exchange regime was an effort to let market forces play a greater role in setting the currency's value.\nOfficials in Washington, who had long pressed Beijing to move toward a more market-determined exchange rate, greeted the shift with some scepticism and indicated they would watch to make sure it was not meant simply to prop up China's exports.\nChinese exports tumbled 8.3 percent in July, their biggest drop in four months and far worse than expected. (Reporting by Koh Gui Qing and Benjamin Kang Lim ; Editing by Richard Borsuk)", "external_links": [], "published": "2015-08-29T09:49:00.000+03:00", "crawled": "2015-08-29T09:16:49.577+03:00", "highlightTitle": ""}