{"organizations": ["ABC-TV", "Orion Team", "ORION SYSTEMS", "Orion Systems Integrators Ranks", "CNBC", "Orion", "ORION", "Zillow", "Inc", "Inc.", "Dell", "Sunil Mehta"], "uuid": "e4812b3fe1102d60ac3024c6c5755843e5cb62a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.24-7pressrelease.com", "main_image": "http://www.24-7pressrelease.com/images/icon-247pressrelease.jpg", "site_section": "http://www.24-7pressrelease.com/rss/business_finance.xml", "section_title": "Press Release and Top Business   Finance News From 24-7 Press Release Newswire", "url": "http://www.24-7pressrelease.com/press-release/orion-systems-integrators-ranks-on-the-2015-inc-5000-list-for-sixth-consecutive-year-as-one-of-americas-fastestgrowing-private-companies-411645.php", "country": "US", "title": "Orion Systems Integrators Ranks on the 2015 Inc. 5000 List for Sixth Consecutive Year as one of America's Fastest-Growing Private Companies", "performance_score": 0, "site": "24-7pressrelease.com", "participants_count": 0, "title_full": "Orion Systems Integrators Ranks on the 2015 Inc. 5000 List for Sixth Consecutive Year as one of America's Fastest-Growing Private Companies", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T10:00:00.000+03:00", "replies_count": 0, "uuid": "e4812b3fe1102d60ac3024c6c5755843e5cb62a3"}, "author": "", "url": "http://www.24-7pressrelease.com/press-release/orion-systems-integrators-ranks-on-the-2015-inc-5000-list-for-sixth-consecutive-year-as-one-of-americas-fastestgrowing-private-companies-411645.php", "ord_in_thread": 0, "title": "Orion Systems Integrators Ranks on the 2015 Inc. 5000 List for Sixth Consecutive Year as one of America's Fastest-Growing Private Companies", "locations": ["America", "Orlando", "Inc.com"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eric Schurenberg", "Pandora", "JJ Ramberg", "Robert Herjavec", "Marcus Lemonis", "Daniel Lubetzky"], "text": "Orion Systems Integrators Ranks on the 2015 Inc. 5000 List for Sixth Consecutive Year as one of America's Fastest-Growing Private Companies ORION Ranks No. 3743 on the 2015 Inc. 5000 with Three-Year Sales Growth of 82% \"I couldn't be more proud as this marks Orion's sixth consecutive year on this amazing list of companies\", stated Sunil Mehta, President and CEO of Orion. MONMOUTH JUNCTION, NJ, August 22,   Inc. magazine today ranked ORION SYSTEMS INTEGRATORS NO. 3743 on its 34th annual Inc. 5000, an exclusive ranking of the nation's fastest-growing private companies. The list represents the most comprehensive look at the most important segment of the economy--America's independent entrepreneurs. Companies such as Yelp, Pandora, Timberland, Dell, Domino's Pizza, LinkedIn, Zillow, and many other well-known names gained early exposure as members of the Inc. 5000. \"I couldn't be more proud as this marks Orion's sixth consecutive year on this amazing list of companies,\" stated Sunil Mehta, President and CEO of Orion. The Orion Team continues to focus on a global vision and work toward delivering the highest level of quality for our customers. The 2015 Inc. 5000, unveiled online at Inc.com and with the top 500 companies featured in the September issue of Inc. (available on newsstands August 18 to September 22) is the most competitive crop in the list's history. The average company on the list achieved a mind-boggling three-year growth of 490%. The Inc. 5000's aggregate revenue is $205 billion, generating 647,000 jobs over the past three years. Complete results of the Inc. 5000, including company profiles and an interactive database that can be sorted by industry, region, and other criteria, can be found at www.inc.com/inc5000 . \"The story of this year's Inc. 5000 is the story of great leadership. In an incredibly competitive business landscape, it takes something extraordinary to take your company to the top,\" says Inc. President and Editor-In-Chief Eric Schurenberg. \"You have to remember that the average company on the Inc. 5000 grew nearly six-fold since 2012. Business owners don't achieve that kind of success by accident.\" The annual Inc. 5000 event honoring all the companies on the list will be held from October 21 through 23, 2015 in Orlando. Speakers include some of the greatest entrepreneurs of this and past generations, such as Marcus Lemonis, host of the CNBC show \"The Profit,\" Robert Herjavec, one of the main \"sharks\" on ABC-TV's \"Shark Tank,\" KIND Founder and CEO Daniel Lubetzky, and Co-Founder of Goodshop.com JJ Ramberg. # # #", "external_links": [], "published": "2015-08-22T10:00:00.000+03:00", "crawled": "2015-08-22T10:09:30.166+03:00", "highlightTitle": ""}