{"organizations": [], "uuid": "3704cf4d66c24c91af087af70afad08c93423af3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508071347.html", "country": "US", "title": "Egypt: 'New Suez Canal' First of a Thousand Steps - Sisi", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Egypt: 'New Suez Canal' First of a Thousand Steps - Sisi", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T16:53:00.000+03:00", "replies_count": 0, "uuid": "3704cf4d66c24c91af087af70afad08c93423af3"}, "author": "", "url": "http://allafrica.com/stories/201508071347.html", "ord_in_thread": 0, "title": "Egypt: 'New Suez Canal' First of a Thousand Steps - Sisi", "locations": ["Egypt", "Sisi Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zimra"], "text": "Zimbabwe: Zimra Seizes 50 Zupco Buses \nHe later changed into a civilian suit as he attended the inauguration ceremony. \nSisi described the new canal as a \"gift to humanity\" granted by the people of Egypt to the world, stressing that Egyptians exerted \"a lot of effort\" during the past year to dig the canal. \nDubbed by Sisi's government as the \"New Suez Canal\", the project is made up of two aspects. \nOne involves building a 35 -kilometre-long canal parallel to the current Suez Canal, to minimise the amount of time ships spend crossing the canal. Additionally, the Suez Canal was made deeper and wider to admit larger ships. \nThe other aspect of the \"New Suez Canal\" is meanwhile the longer-term development of the canal region. It is due to be concluded in 2045. \nThe Suez Canal Authority says the deepening of the canal and drilling a parallel junction to it would double the Suez Canal revenues from $5.3 billion to $13.3 in 2023. \nThe authority expects around 97 ships to daily cross the canal after the expansion by 2023, while the number of ships daily crossing the canal before the project was launched was nearly 49 ships. \nAnalysts are meanwhile skeptical about the authority's expectations, especially amid slowing world trade and competition from an expanded Panama Canal. \nEgypt did not only present the new Suez canal to the world during the past year or two, Sisi said. \n\"Egypt will go down in history for having faced the most dangerous terrorist ideology,\" he said, vowing to be victorious in the fight against \"terrorism\". \n\"The [New] Suez Canal wasn't made in normal circumstances ... [but amid] very tough economic and security circumstances,\" Sisi said. \nEgypt has been battling a wave of militancy since the military ouster of Islamist President Mohamed Mursi in July 2013, after mass protests against his rule. The majority of attacks target security forces. \nThe Islamic State- affiliated Ansar Bayt al-Maqdis has claimed responsibility for the majority of attacks carried out in Sinai since mid-2013. The militant group changed its name to 'Sinai Province' last November, after pledging allegiance to Islamic State fighters in Syria and Iraq. \nAnsar threatened to kill a Croatian hostage on Wednesday within 48 hours if Muslim women in Egyptian prisons are not released. \n(writing by Rana Muhammad Taha) Egypt \nTunisia Thursday lost to Egypt 85-93 at a quarter-final game of AfroBasket Men U16 held July 30-August 8 in Bamako, … see more » Copyright © 2015 Aswat Masriya. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-07T16:53:00.000+03:00", "crawled": "2015-08-07T18:16:05.804+03:00", "highlightTitle": ""}