{"organizations": [], "uuid": "0b3d5506cc9ef50a64885757eca7b4e04ef8afaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508170062.html", "country": "US", "title": "Nigeria: Helicopter Crash - Why Release of Manifest Is Delayed - Airline Official", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: Helicopter Crash - Why Release of Manifest Is Delayed - Airline Official", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T08:46:00.000+03:00", "replies_count": 0, "uuid": "0b3d5506cc9ef50a64885757eca7b4e04ef8afaf"}, "author": "", "url": "http://allafrica.com/stories/201508170062.html", "ord_in_thread": 0, "title": "Nigeria: Helicopter Crash - Why Release of Manifest Is Delayed - Airline Official", "locations": ["Nigeria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: How APC Allegedly Rigged Ogun Guber Polls - Witnesses \n\"We cannot release the victims' names without the consent of our client, SEDCO Oil, which is still in regular contact with families of the victims,\" he said. \nAccording to him, the withholding of the names was in accordance with International Civil Aviation Organisation (ICAO) Annex 13. \nHe said also that the airline and the accident investigators lack the capacity to disclose the names on the manifest. \nThe source, however, called on the public to exercise little patience with the airline and appropriate authorities in releasing the manifest. \n\"Even though we have submitted the manifest to the Accident Investigation Bureau (AIB), we will still have to give them the matching order to release it with the consent of the victims' families. \n\"You and I know that Bristow would have been ordered to release the manifest because of the investigation the bureau is carrying out and it is something they ought to have because of the nature of their job they are doing at the moment,\" he said. \nDr Felix Abali, the AIB Commissioner, had said on Friday that the bureau did not have the power to make the victims' names public until the airline contacted the victims' families. \nAbali said he was in touch with the airline and would make the names public immediately he received the nod from the airline. \nHe said that aviation protocol must be observed before the manifest would be released. \n\"The families must be briefed first. It is the responsibility of the airlines to release the manifest, they have to contact the families first before they release it to the public,\" he said. \nNAN recalls that the Sikosky 76 helicopter marked 5N-BGD crashed into the Lagos lagoon as it approached Murtala Muhammed Airport, in Ikeja. \nSix of the 12 passengers on board in the helicopter died while six others were rescued and taken to hospital. (NAN) Nigeria \nThat it took so long for countries in the West African sub-region to collectively move to tackle the scourge of … see more » Copyright © 2015 Vanguard. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-17T08:46:00.000+03:00", "crawled": "2015-08-17T09:06:42.571+03:00", "highlightTitle": ""}