{"organizations": [], "uuid": "f725408252fd942e90513fa1b3b701fac460614a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2013-10/30/full/1383147913-8276.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss#", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/rbi-gives-extension-to-banks-for-issuance-of-chip-pin-based-cards-115082701091_1.html", "country": "IN", "title": "RBI gives extension to banks for issuance of chip, pin based cards News", "performance_score": 0, "site": "business-standard.com", "participants_count": 1, "title_full": "RBI gives extension to banks for issuance of chip, pin based cards | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "f725408252fd942e90513fa1b3b701fac460614a"}, "author": "BS Reporter", "url": "http://www.business-standard.com/article/finance/rbi-gives-extension-to-banks-for-issuance-of-chip-pin-based-cards-115082701091_1.html", "ord_in_thread": 0, "title": "RBI gives extension to banks for issuance of chip, pin based cards News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reserve Bank of India (RBI) has given an extension to banks for issuance for EMV chip and pin cards. The regulator had earlier said in May that with effect from September 1, 2015 all new cards issued - debit and credit, domestic and international - by banks should be EMV Chip and Pin based cards, for enhanced security.\nALSO READ:  RBI tightens norms for credit card billing ALSO READ:  Govt proposes tax sops on debit, credit card payments \n \nALSO READ:  Shift to new credit cards won't fix security issues The regulator has given extension up to September 30, 2016 for cards issued under the Prime Minister Jan Dhan Yojana (PMJDY), Basic Savings Bank Deposit Account (BSBDA) and other government schemes. For all other cards, the extension is up to January 31, 2016.\nRBI said that representations had been received from various banks expressing difficulties in meeting this time-line on account of existing stock of magnetic stripe only cards with their branches. Further, banks also indicated that more time is required for completion of certification process for issuance of EMV Chip and Pin cards.\nHowever, the regulator has said that during this extended period, in case of specific requests from customers for issuance of EMV Chip and Pin cards, banks should promptly comply with the request.\nWith respect to migration of existing magnetic stripe only cards to EMV Chip and Pin cards, RBI has asked banks to initiate necessary steps to ensure that all active cards issued by them are EMV Chip and Pin based by December 31, 2018.", "external_links": [], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-27T18:09:43.275+03:00", "highlightTitle": ""}