{"organizations": ["Visio", "EEO", "Financial Management Systems", "Accenture Federal Services Location", "VA Accenture Federal Services", "Accenture Federal Services"], "uuid": "1c0795c535ca1b0a1bc9696faace78ca13f141bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.simplyhired.com", "main_image": "", "site_section": "http://www.simplyhired.com/a/job-feed/rss/o-13205", "section_title": "Finance jobs | Simply Hired", "url": "http://www.simplyhired.com/job/ujmpewf2iq", "country": "US", "title": "Federal - Financial Senior Analyst at Accenture (Arlington, VA)", "performance_score": 0, "site": "simplyhired.com", "participants_count": 0, "title_full": "Federal - Financial Senior Analyst at Accenture (Arlington, VA)", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T18:47:00.000+03:00", "replies_count": 0, "uuid": "1c0795c535ca1b0a1bc9696faace78ca13f141bb"}, "author": "", "url": "http://www.simplyhired.com/job/ujmpewf2iq", "ord_in_thread": 0, "title": "Federal - Financial Senior Analyst at Accenture (Arlington, VA)", "locations": ["US", "U.S.", "VA", "Arlington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Source: PharmaDiversityJobBoard.com Organization: Accenture Federal Services Location: Arlington, VA Accenture Federal Services, a wholly-owned subsidiary of Accenture, helps U.S. federal agencies build the government of the future. With 4,000 dedicated US employees, Accenture Federal Services is uniquely positioned to support federal agencies in shattering the status quo, achieving profound efficiencies and relentlessly delivering results. Accenture Federal Services is a long-time and trusted resource for the federal community. Every cabinet level agency in the United States-and 20 of the country's largest federal government agencies, have worked with Accenture Federal Services to achieve outcomes and move toward high performance. Join us and you can help our federal clients achieve what matters most, powering the services that touch the nation every day. The Federal Financial Senior Analyst will serve as a member of the Functional Team and will primarily support the project's business process documentation and internal control testing efforts. The team member will be required to gain a working knowledge of finance business processes, internal controls, and Financial Management Systems in support of our clients' efforts to produce auditable financial statements. Basic Qualifications: US Citizen Minimum one year of experience in finance, accounting, consulting, process work, or budgeting experience Bachelors degree in Accounting, Finance, Business, Economics or related field Preferred Qualifications: * Audit experience * Understanding of government acquisition, asset management or logistics operations * Consulting Experience * Experience with Visio * Proven ability to work independently and as a team member * Good communication (written and oral) and interpersonal skills * Good organizational, multi-tasking, and time-management skills An active security clearance or the ability to obtain one may be required for this role. Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration. Applicants for employment in the U.S. must possess work authorization which does not require, now or in the future, sponsorship by the employer for a visa. Accenture is an Equal Opportunity Employer. Accenture is a federal contractor and an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities. US Citizenship Required. Accenture is committed to providing veteran employment opportunities to our service men and women. Job: Business Advisory Organization: Client Delivery & Operations Job Level: Non-supervisory", "external_links": [], "published": "2015-08-27T18:47:00.000+03:00", "crawled": "2015-08-27T21:13:09.383+03:00", "highlightTitle": ""}