{"organizations": ["Fleming County Hospital Joins LifePoint"], "uuid": "dbeb96617a80dc9dad01b2eb11de34c56fe8fe18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://finance.yahoo.com/rss/headline?s=LPNT", "section_title": "Yahoo! Finance: LPNT News", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125mv8hq2/*http://www.noodls.com/view/6ED1837FCDCAB1160D9BCE30A30CF8B59FF7D813", "country": "GB", "title": "Fleming County Hospital Joins LifePoint Health", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Fleming County Hospital Joins LifePoint Health", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T17:56:00.000+03:00", "replies_count": 0, "uuid": "dbeb96617a80dc9dad01b2eb11de34c56fe8fe18"}, "author": "", "url": "http://us.rd.yahoo.com/finance/external/noodlsaunz/rss/SIG=125mv8hq2/*http://www.noodls.com/view/6ED1837FCDCAB1160D9BCE30A30CF8B59FF7D813", "ord_in_thread": 0, "title": "Fleming County Hospital Joins LifePoint Health", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close \nAcquisition will bring resources to strengthen Flemingsburg hospital for the future, enhance healthcare throughout Fleming County and the surrounding region \nFLEMINGSBURG, Ky.--(BUSINESS WIRE)--Aug. 3, 2015-- The Board of Directors of Fleming County Hospital (FCH) and LifePoint Health today announced that the acquisition of FCH by LifePoint Health has been finalized. \nAs part of LifePoint, the hospital will have access to new clinical, operational and financial resources that will strengthen FCH and help it grow, supporting its team's efforts to make people in Fleming County and surrounding communities healthier. \n\"Since February, we have worked with LifePoint to explore how we could work together to improve healthcare in Flemingsburg and across this region,\" said Tony McGlone, chairman, Fleming County Hospital District Board of Directors. \"As we have learned more about LifePoint, we have grown even more confident that this acquisition offers great benefits to our community, our employees and our physicians. We are excited to collaborate with LifePoint to strengthen our hospital and enhance healthcare services for the residents of our communities.\" \nAccording to the terms of the acquisition, LifePoint Health has agreed to: Make capital investments in the future growth of FCH, including technology improvements, service line expansions and physician recruiting; Work to enhance and expand FCH's services to meet the evolving healthcare needs of its communities; Hire all active FCH employees and foster collaborative physician relationships; Continue FCH's charity care policies; and Ensure an ongoing local voice in the governance of the hospital. \nAdditionally, as part of LifePoint, FCH is becoming a local taxpayer, providing a new source of tax revenue to support local projects, schools and infrastructure in Fleming County. \n\"LifePoint is pleased to welcome Fleming County Hospital to our system and our growing family of hospitals in the Bluegrass State,\" said William F. Carpenter III, chairman and CEO of LifePoint Health. \"FCH has been an important part of the healthcare infrastructure in northeast Kentucky for more than 50 years. We see great opportunities to collaborate with its employees and doctors to grow the hospital and continue its efforts to advance healthcare services across this region.\" \nAs part of LifePoint, FCH joins nine other LifePoint hospitals in the Commonwealth of Kentucky: Bluegrass Community Hospital in Versailles; Bourbon Community Hospital in Paris; Clark Regional Medical Center in Winchester; Georgetown Community Hospital in Georgetown; Jackson Purchase Medical Center in Mayfield; Lake Cumberland Regional Hospital in Somerset; Logan Memorial Hospital in Russellville; Meadowview Regional Medical Center in Maysville; and Spring View Hospital in Lebanon. \nWith the finalization of the acquisition, healthcare veteran Michael Clark has joined FCH as interim CEO while the search process to identify a new hospital leader is completed. Clark is a seasoned healthcare executive with extensive experience in executive leadership roles for hospitals and hospital systems. He previously served as a division president for LifePoint Health and was responsible for overseeing the operations of 14 hospitals. Earlier in his career, he served as CEO for hospitals located in Kentucky, Georgia and Tennessee. \n\"We are confident that Michael can successfully lead the transition of Fleming County Hospital as it becomes part of LifePoint,\" said Scott Raplee, Central Group President for LifePoint. \"He is an experienced hospital executive who will be a great addition to the hospital team as we complete a thorough search for the right person to fill the top leadership post on a more permanent basis.\" \nAbout Fleming County Hospital \nFleming County Hospital provides general medical and surgical care for inpatient, outpatient, and emergency room patients. It is nestled in the rolling hills of Northeastern Kentucky close to the Ohio River. Established in 1962 as a dream of community leaders the hospital has prospered over the years and in August 2008 opened a new replacement facility. The new hospital features many private rooms, expanded operating rooms, a larger Emergency Department, new state-of-the-art MRI equipment and many other improvements. With approximately 100,000 square feet, it serves residents of Fleming and surrounding counties. The hospital employs over 260 staff members and has 52 acute care beds. \nAbout LifePoint Health \nLifePoint Health is a leading healthcare company dedicated to Making Communities Healthier®. Through its subsidiaries, it provides quality inpatient, outpatient and post-acute services close to home. LifePoint owns and operates community hospitals, regional health systems, physician practices, outpatient centers, and post-acute facilities in 20 states. It is the sole community healthcare provider in the majority of the non-urban communities it serves. www.LifePointHealth.net . All references to \"LifePoint,\"\"LifePoint Health\" or the \"Company\" used in this release refer to affiliates or subsidiaries of LifePoint Health, Inc. \nView source version on businesswire.com: http://www.businesswire.com/news/home/20150803005759/en/ \nSource: LifePoint Health", "external_links": [], "published": "2015-08-03T17:56:00.000+03:00", "crawled": "2015-08-04T17:10:32.403+03:00", "highlightTitle": ""}