{"organizations": ["Bohai Leasing"], "uuid": "f58a57213215fdecfdfcb32b2f1ff6653c3b281b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.equipmentfa.com", "main_image": "", "site_section": "http://www.equipmentfa.com/rss/feeds/latestnews.xml", "section_title": "Equipment Finance Advisor", "url": "http://www.equipmentfa.com/news/4575/avolon-enters-into-exclusivity-agreement-with-bohai-leasing", "country": "US", "title": "Avolon Enters Into Exclusivity Agreement With Bohai Leasing", "performance_score": 0, "site": "equipmentfa.com", "participants_count": 0, "title_full": "Avolon Enters Into Exclusivity Agreement With Bohai Leasing", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T14:50:00.000+03:00", "replies_count": 0, "uuid": "f58a57213215fdecfdfcb32b2f1ff6653c3b281b"}, "author": "", "url": "http://www.equipmentfa.com/news/4575/avolon-enters-into-exclusivity-agreement-with-bohai-leasing", "ord_in_thread": 0, "title": "Avolon Enters Into Exclusivity Agreement With Bohai Leasing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Avolon Enters Into Exclusivity Agreement With Bohai Leasing August 11, 2015, 07:50 AM Related: Aircraft , Aviation , Avolon , Bohai Leasing \nAvolon, the international aircraft leasing company, announced that it has entered into an Exclusivity Agreement with Bohai Leasing Co., Ltd. granting Bohai exclusivity to negotiate with Avolon until September 7, 2015 (the “Exclusivity Period”) with respect to the possible acquisition of 100% of the issued and outstanding common shares of Avolon at a price of US$32 per share. During the Exclusivity Period, Bohai and Avolon will endeavour to negotiate definitive agreements on terms previously discussed and accepted by the parties. Bohai’s offer is subject to completion of satisfactory and customary due diligence. In connection with Bohai’s obligations under the Exclusivity Agreement, Bohai will make a good faith deposit of US$50 million into an escrow account within two business days, which amount will be in addition to the US$25 million currently held in escrow in connection with the cash tender offer made by Bohai on July 31, 2015 (the “Offer”), for an aggregate deposit of US$75 million. Avolon will be entitled to receive the US$75 million deposit in certain circumstances, including if Avolon is willing to execute definitive documents in connection with the Transaction and Bohai is unable or unwilling to do so. Upon execution of definitive documents in connection with the Transaction, the US$75 million deposit will be increased by Bohai to $250 million, payable to Avolon in the event the Transaction is not consummated under certain circumstances. Pursuant to the Exclusivity Agreement, Avolon and Bohai will amend the Investment and Tender Offer Agreement, (the “Agreement”) dated July 14, 2015 between Avolon, Bohai and an indirect wholly owned subsidiary of Bohai, to extend the expiration time of the Offer to midnight at the end of the day on September 18, 2015. Avolon remains subject to the Agreement. There can be no assurances that Avolon and Bohai will enter into a binding agreement to consummate the Transaction or that Avolon’s Board of Directors will approve such Transaction. Avolon continues to carefully evaluate the Transaction and the terms and conditions of the definitive documents relating to the Transaction with its financial and legal advisors and continues to negotiate the terms of the Transaction with Bohai. If Bohai and Avolon enter into a binding agreement to consummate the Transaction prior to the consummation of the Offer, the Agreement and the Offer will be terminated. Today's Other News", "external_links": [], "published": "2015-08-11T14:50:00.000+03:00", "crawled": "2015-08-12T01:07:34.756+03:00", "highlightTitle": ""}