{"organizations": [], "uuid": "8a638ad8f6b68ce3c5fe118b73bf3df981058e63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l1.yimg.com/bt/api/res/1.2/79elIE0K8fPnKCuJWERhyA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-08-17T005233Z_1_LYNXNPEB7G00G_RTROPTP_3_MARKETS-JAPAN-STOCKS_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/asia-steady-yuan-calms-dollar-005233405.html?l=1", "country": "GB", "title": "Asia steady as yuan calms, dollar firm on upbeat data", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Asia steady as yuan calms, dollar firm on upbeat data", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T06:00:00.000+03:00", "replies_count": 0, "uuid": "8a638ad8f6b68ce3c5fe118b73bf3df981058e63"}, "author": "", "url": "http://finance.yahoo.com/news/asia-steady-yuan-calms-dollar-005233405.html?l=1", "ord_in_thread": 0, "title": "Asia steady as yuan calms, dollar firm on upbeat data", "locations": ["Tokyo", "Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peter"], "text": "Asia steady as yuan calms, dollar firm on upbeat data 2 hours ago . View photo A man walks past a display showing stock prices in Tokyo August 12, 2015. REUTERS/Thomas Peter \nBy Shinichi Saoshiro \nTOKYO (Reuters) - Asian stocks were little changed on Monday as investors' nerves continued to settle after China's surprise yuan devaluation last week, while the dollar held modest gains against the euro after upbeat U.S. economic data. \nMSCI's broadest index of Asia-Pacific shares outside Japan were virtually unchanged in early trade. \nThe index lost 2.6 percent last week to a two-year low after Beijing devalued its currency, buffeting global financial markets and fanning concerns about China's economy. \nThe yuan fell more than 4 percent at one point, pulling down riskier assets such as emerging currencies globally amid fears the devaluation would spark a global currency way, but the financial markets began stabilizing toward the end of last week as China slowed the pace of the currency's depreciation. \nAustralian shares (.AXJO) rose 0.4 percent and South Korea's Kospi (.KS11) dipped 0.1 percent. Japan's Nikkei (.N225) rose 0.6 percent after shedding 1 percent last week. \n\"As concerns over the Chinese yuan continue to ebb, and with the prospect of further rises in the dollar in the lead up to the Fed's (September) meeting, the Nikkei may well recover last week's losses this week,\" wrote Angus Nicholson, market analyst at IG in Melbourne. \nThe dollar was steady at 124.34 yen. \nThe yen was unfazed by Monday's data showing Japan's economy shrank in the second quarter. Though a contraction was expected, concerns that the third quarter may see only mild improvement could rekindle expectations of further monetary easing by the Bank of Japan. \nThe euro slipped 0.2 percent to $1.1092, handing back some of the big gains made last week when the initial shock of yuan's devaluation pushed the dollar lower. \nThe greenback received a lift at the end of last week from encouraging data on U.S. producer prices and industrial output that helped support the case for the Federal Reserve hiking interest rates when they meet in September. \nSuggesting that global financial market interest had moved away from Greece and on to other matters like China's bid to weaken its currency, the euro drew little support even after the European Commission confirmed a deal to lend cash-strapped Athens up to 86 billion euros over three years following talks in Brussels. \nThe Australian dollar, often used as a liquid proxy of China-related trades, was little changed at $0.7369. \nThe Aussie sank to a six-year low of $0.7217 earlier last week after China's depreciation but recovered ground as Beijing stepped in to arrest the yuan's decline. \nWhile China's central bank says there is no reason for further weakening in the yuan, many traders suspect sluggish economic data and expectation of further policy easing will leave the currency under downward pressure. \nCrude oil, another market roiled last week by China's shock move and its potential impact on demand for commodities, continued to struggle in the wake of global oversupply concerns. \nU.S. crude (CLc1) was down 1 percent at $42.07 a barrel, within reach of a six-year trough of $41.35 struck on Friday. \n(Editing by Eric Meijer & Kim Coghill) Currency", "external_links": [], "published": "2015-08-17T06:00:00.000+03:00", "crawled": "2015-08-17T06:10:57.637+03:00", "highlightTitle": ""}