{"organizations": [], "uuid": "87b8f9a3f8ad75a18294350709204e4c55be36ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/21/markets-forex-idUSL3N10W05H20150821", "country": "US", "title": "FOREX-Dollar slips as Fed rate hike hopes fade", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "FOREX-Dollar slips as Fed rate hike hopes fade | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T04:39:00.000+03:00", "replies_count": 0, "uuid": "87b8f9a3f8ad75a18294350709204e4c55be36ae"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/21/markets-forex-idUSL3N10W05H20150821", "ord_in_thread": 0, "title": "FOREX-Dollar slips as Fed rate hike hopes fade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar index at 6-week low as Fed rate hike hopes fade\n* China PMI data in focus\nBy Hideyuki Sano\nTOKYO, Aug 21 (Reuters) - The dollar withered near six-week lows on Friday, reflecting doubts whether the Federal Reserve will be able to safely raise interest rates next month as once expected, given accumulating signs of stress in many parts of the global economy.\nThe dollar index fell to as low as 95.711, its lowest level since early July, stepping back 2.7 percent from a high of 98.334 hit two weeks ago, when many market players had thought the Fed was most likely to raise rates in September.\nTraders are now quickly pricing out a September hike after minutes from the last Fed policy meeting provided no definitive indication.\nThey suspect the fall in commodity prices and many emerging economy assets and concerns about a slowdown in China are all making the Fed's plan to gradually raise rates more difficult.\n\"The market's focus is now shifting to emerging markets and the Chinese economy. I think the dollar is oversold in the near term. But if the Chinese data is weak, we could see more risk-off trades,\" said Kyosuke Suzuki, director of forex at Societe Generale.\nA Chinese PMI manufacturing survey is due around 0145 GMT, with a softer reading potential putting renewed pressure on the yuan, which was mostly steady this week after devaluation last week.\nThe euro stood at $1.1235, little changed in early trade but near a seven-week high of $1.1245 touched on Thursday, when it had risen 1.1 percent in its biggest gain since July 10.\nThe dollar slipped to as low as 123.35 yen, its lowest in more than three weeks.\nThe Australian dollar edged down 0.2 percent to $0.7327 . (Editing by Eric Meijer)", "external_links": [], "published": "2015-08-21T04:39:00.000+03:00", "crawled": "2015-08-21T04:03:35.100+03:00", "highlightTitle": ""}