{"organizations": ["EPFO"], "uuid": "9682858e92a9dea57eca55876e5a3a099ad37e70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oneindia.com", "main_image": "http://www.oneindia.com/img/2015/08/07-1438948294-money.jpg", "site_section": "http://news.oneindia.in/rss/news-business-fb.xml", "section_title": "India Business News, Latest Finance News Headlines, Indian Stock Market & economic news", "url": "http://www.oneindia.com/business/epfo-hits-equity-markets-how-it-may-affect-you-1831123.html", "country": "IN", "title": "EPFO hits equity markets: How it may affect you", "performance_score": 0, "site": "oneindia.com", "participants_count": 0, "title_full": "EPFO hits equity markets: How it may affect you", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T14:55:00.000+03:00", "replies_count": 0, "uuid": "9682858e92a9dea57eca55876e5a3a099ad37e70"}, "author": "", "url": "http://www.oneindia.com/business/epfo-hits-equity-markets-how-it-may-affect-you-1831123.html", "ord_in_thread": 0, "title": "EPFO hits equity markets: How it may affect you", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EPFO hits equity markets: How it may affect you Published: Friday, August 7, 2015, 17:25   \nMumbai, Aug 7: The government's employee's provident fund (EPF) on Thursday made its maiden investments in the country's equity markets. \nThis is the first time that the Employees Provident Fund Organisation (EPFO), in its 64-year history, has invested in the equity markets. Money \nThe formal announcement was made by Minister of State for Labour and Employment Bandaru Dattatreya at an event held in Mumbai. The EPFO has been allowed to investment in the equities by utilising only five percent of the total corpus. \n\"Having transformed the area of service delivery, it was time to bring innovation in the way the funds of EPFO are being managed,\" Dattatreya said at the event. \n\"Today, we are all starting a new chapter in the history of EPFO's investments. I am extremely pleased to announce that the EPFO has taken its first step towards enhancing its returns by investing in equities.\" \nThe employee provident fund will make investments in the equity markets through the exchange traded funds (ETFs) route. \nAccording to EPFO, transparency, liquidity, diversification, flexibility and cost-effectiveness are amongst the many advantages of investing in ETFs and index-based ETFs. \nThe ETF route is universally considered as amongst the safest investment avenues to help provident fund members accumulate robust retirement corpus over a long term. \nThe employee social security fund informed that to ensure its successful foray into stock markets it has chosen two index-linked ETF schemes promoted by the State Bank of India (SBI) Mutual Fund-- SBI-ETF NIFTY and SBI SENSEX ETF. \nArundhati Bhattacharya, chairman of SBI said, \"For SBI Group, this is a proud moment as SBI has been servicing EPFO in fund management for over 20 years now.\" \nConsequent to arrangements, SBI Mutual Fund's chief executive and managing director Dinesh Kumar Khara has been entrusted with the responsibility to manage EPFO's equity allocation. \nThe National Stock Exchange (NSE) on its part listed a new ETF by SBI Mutual Fund based on the benchmark 50-scrip index NIFTY. \n\"EPFO's entry will unlock savings into nation building. Going forward, - with multiple investment options available at NSE - other entities may consider similar initiatives. All these will certainly deepen the financial market in India,\" said Chitra Ramkrishna, managing director and chief executive, NSE. \nThe NIFTY index has given an annualised return of 17.8 percent in last 3 years with close to a lakh people have traded during the 3 year period through 10 NIFTY ETF products. \nThe Bombay Stock Exchange (BSE) listed the SBI Sensex ETF based on the 30-scrip sensitive index (S&P BSE Sensex). \n\"Investment of pension funds in stock markets is an internationally accepted practice. Many citizens world over have been able to obtain better returns by investing through stock markets,\" said Ashishkumar Chauhan, managing director and chief executive, BSE. \nCurrently, there are around 50 million EPFO members. The provident fund had settled 10.53 lakh claims in May. \nIANS", "external_links": [], "published": "2015-08-07T14:55:00.000+03:00", "crawled": "2015-08-07T15:18:51.290+03:00", "highlightTitle": ""}