{"organizations": [], "uuid": "f7e950f9bb2982d7b47ce1a9b8086cc4d77ac8c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/china-stock-market-turmoil-returns-083041995.html", "country": "GB", "title": "China stock market turmoil returns as house price data spooks investors", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "China stock market turmoil returns as house price data spooks investors", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T11:30:00.000+03:00", "replies_count": 0, "uuid": "f7e950f9bb2982d7b47ce1a9b8086cc4d77ac8c3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/china-stock-market-turmoil-returns-083041995.html", "ord_in_thread": 0, "title": "China stock market turmoil returns as house price data spooks investors", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Aug 18, 2015, 09:45 BST - UK Markets close in 6 hrs 45 mins China stock market turmoil returns as house price data spooks investors By Peter Spence | Telegraph – 14 minutes ago 0.00 \nA strengthening housing market could block Beijing's efforts to stimulate the Chinese economy \nChina's stock market sell-off resumed at a brutal pace on Tuesday, as fears that the housing market could overheat panicked investors. \nShares (Berlin: DI6.BE - news ) listed on the country's main index, the Shanghai Composite, fell by nearly 6.2pc despite apparent interventions by Beijing to stabilise the market during the session. \nTrading was characterised by volatile swings in the index, which has come to act as a barometer for the health of the world's second-largest economy. \nThe downturn in Chinese stocks had appeared to stall in the last fortnight, after the index lost 32pc of its value in less than three weeks . But worries that the country's house price decling is easing spooked investors on Tuesday. \nOfficial data showed that residential property prices rose in 31 of the 70 cities tracked by Government statisticians in July, up from 27 last month. A rebound in the property market could block government efforts to introduce fresh stimulus, which could make living costs unmanageable. \nFears that housing pressures would prevent Beijing from acting to support the market further led the key Shanghai index to its largest one-drop since July 27, when the index plunged by 8.5pc . \nJuly marked the first month in the last 16 that more cities saw house prices rise than fall. Ratings agency Standard & Poor's has said that easier rules on home sales have had an \"increasingly positive impact\" on property prices. \nHowever, house prices overall are still in decline. According to Reuters calculations prices fell 3.7p in July and dropped 4.9pc in the previous month. \nThe broader MSCI (NYSE: MSCI - news ) index of Asia-Pacific shares shed 0.4pc this morning, falling to it lowest level in more than two years. \nThere is growing concern that China's economic slowdown will be more severe than forecast, while the widely-expected rise in interest rates in the US has also weighed on investors. \nMoreover, Beijing's decision to embark on a devaluation of the yuan last week suggested that the country's role in the global economy is shifting, and that authorities are keen to shore up the economy as growth slows (Other OTC: UBGXF - news ) .", "external_links": [], "published": "2015-08-18T11:30:00.000+03:00", "crawled": "2015-08-18T11:49:51.888+03:00", "highlightTitle": ""}