{"organizations": ["Cineworld Group plc", "Ithaca Energy Inc"], "uuid": "9bf96c1cf393112595ae3a8ec9096744a207fd6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-telecommunications/?format=rss", "section_title": "Telecommunications News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/too-buy-cineworld-group-plc-100459662.html", "country": "US", "title": "Is It Too Late To Buy Cineworld Group plc, Ithaca Energy Inc. And Monitise Plc?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is It Too Late To Buy Cineworld Group plc, Ithaca Energy Inc. And Monitise Plc?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T13:04:00.000+03:00", "replies_count": 0, "uuid": "9bf96c1cf393112595ae3a8ec9096744a207fd6f"}, "author": "", "url": "https://uk.finance.yahoo.com/news/too-buy-cineworld-group-plc-100459662.html", "ord_in_thread": 0, "title": "Is It Too Late To Buy Cineworld Group plc, Ithaca Energy Inc. And Monitise Plc?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 13, 2015, 15:00 BST - UK Markets close in 1 hr 30 mins Is It Too Late To Buy Cineworld Group plc, Ithaca Energy Inc. And Monitise Plc? By G A Chester | Fool.co.uk – 3 hours ago 6.52 -0.8200 \nCineworld (LSE: CINE) and Ithaca (LSE: IAE) released half-year results today, and both companies' shares are up in early trading. Meanwhile, Monitise (LSE: MONI) has seen a big 50% bounce in its shares since their lows of last week. \nIs there still good value in these three stocks for investors today? \nCineworld \nCineworld is a company I've enthused about in the past, and its shares have been on a tear -- up 37% in the year to date. Two thirds of group revenue comes from the UK & Ireland, with the other third coming from Poland, Czech Republic, Slovakia, Hungary, Bulgaria, Romania and Israel. Today's interim results confirm my favourable impression of what is one of the leading cinema groups in Europe. \nThe headline statutory numbers were stunning. Group revenue was up 22.5%, while earnings before interest, tax, depreciation and amortisation (EBITDA) were up 41%. The pro forma numbers -- adjusted for acquisitions and exchange rates -- were still impressive: revenue up 11.3% and earnings up 22.5%. The performance, which was helped by strong title releases -- notably \"Fifty Shades of Grey\", \"Fast and Furious 7″ and \"Jurassic World\" -- was described by chief executive Mooky Greidingeras as \"gratifying\". \nCineworld has a promising second half ahead, with 10 new cinemas (85 screens) set to open, taking the group to over 2,000 screens, and upcoming releases \"Star Wars: Episode VII\", \"Hunger Games: Mockingjay Part 2″ and the next Bond film \"Spectre\" anticipated to perform strongly. \nMy sums suggest Cineworld trades on a forward P/E of 18.5 with a 2.7% dividend yield, which I think still represents decent value for investors today. \nIthaca \nNorth Sea oil company Ithaca is another company I've been positive about, and the shares are now at a lower price. The firm today reported average production of 12,578 barrels of oil equivalent per day (boepd) during the first half of the year, and said that full-year production guidance remains unchanged at 12,000 boepd. Production start-up at the company's Stella field is on track for 2016, which is forecast to add a transformative initial net 16,000 boepd to Ithaca's output. \nOf course, the collapse of the oil price over the past year (Brent crude has dropped from over $100 to around $50 a barrel) hasn't helped Ithaca. However, today's results show the strong position that the company is in. Management reported oil hedging in place for an average of 6,400 barrels per day at $70 until June 2017, while first-half operating costs reduced by 29% to $35boe compared to 2014. As a result, Ithaca's Brent breakeven price is under $10 through to Stella start-up. And thereafter operating costs are expected to fall to $25/boe. \nDespite today's rise, Ithaca's shares remain almost 100p below their 52-week high of 137.25p. Of course, with the current oil price, we're not going to see that level again any time soon, but the shares look too cheap to me based on the company's prospects, even within a relatively low oil price environment. \nMonitise \nIn contrast to Cineworld and Ithaca, Monitise is a company I haven't been keen on in the past. However, every stock has its price (well, apart from those that wind up bust!) and with Monitise's shares hitting 5p last week -- 95% off their peak -- I suggested that they had become an attractive speculative buy. \nThe mobile money group says it has enough cash to get through to breakeven next year, but the main reason I felt the company was undervalued at 5p (market cap £110m) was that prospective trade buyers showed an interest earlier this year during a period when Monitise's market cap ranged between £220m and £520m. \nThe company's shares hit a recent high of 7.65p in trading yesterday, but have fallen back today, and are changing hands at 6.55p as I write (market cap £144m). I think there's still value here at this price, but volatility is rife. Visa Europe is intent on disposing of its holding in Monitise, and is now down to 3.9%, while the intentions of another major shareholder aren't entirely clear: hedge fund Omega has recently sold some shares, but still holds 10.8%. \nOf course, Cineworld, Ithaca and Monitise aren't the only stocks around with the potential to deliver a superb return for investors today. Indeed, Mark Rogers, the Motley Fool's shrewd small-cap expert, has just unearthed a company he believes has outstanding business prospects and super upside potential . \nFor a limited time only, you can read Mark's exclusive research for FREE and with no obligation in his in-depth report -- \" 1 Small-Cap Stock Flying 'Under The Radar' \". \nTo read this free report while it's still available -- simply click here now ! \nG A Chester has no position in any shares mentioned. The Motley Fool UK owns shares of Monitise. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-13T13:04:00.000+03:00", "crawled": "2015-08-13T17:00:56.931+03:00", "highlightTitle": ""}