{"organizations": [], "uuid": "0ed2f0bdd0c9b4ca871005f8967c40236b722e95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/13/markets-stocks-usa-idUSL3N10O53M20150813", "country": "US", "title": "US STOCKS-Wall St falls as jobs data raises chances of Sept rate hike", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "US STOCKS-Wall St falls as jobs data raises chances of Sept rate hike | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T18:07:00.000+03:00", "replies_count": 0, "uuid": "0ed2f0bdd0c9b4ca871005f8967c40236b722e95"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/13/markets-stocks-usa-idUSL3N10O53M20150813", "ord_in_thread": 0, "title": "US STOCKS-Wall St falls as jobs data raises chances of Sept rate hike", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Weekly jobless claims 4-week average lowest since 2000\n* July retail sales rise more-than-expected\n* China says no basis for further depreciation of yuan\n* Cisco up after strong results, boosts 3 major indexes\n* Indexes down: Dow 0.2 pct, S&P 0.2 pct, Nasdaq off marginally (Updates to open)\nBy Tanya Agrawal\nAug 13 (Reuters) - Wall Street fell in morning trading on Thursday as strong U.S. economic data increased the likelihood that the Federal Reserve would raise interest rates in September, rather than later in the year.\nU.S. retail sales rebounded in July. The four-week moving average of weekly jobless claims fell to its lowest since April 2000, pointing firmly to a tightening jobs market.\nWhile inflation remains below what the Fed would like to see, the labor markets have continued to strengthen - a key factor in the central bank's timing of a rate hike.\nInvestors had pared back bets of a September rate hike after China devalued the yuan on Tuesday.\nBut, economists still expect the Fed to raise rates as early as next month, according to a Reuters poll published on Thursday.\nAt 9:43 a.m. ET (1343 GMT) the Dow Jones industrial average was down 29.2 points, or 0.17 percent, at 17,373.31. The S&P 500 was down 3.53 points, or 0.17 percent, at 2,082.52 and the Nasdaq composite was down 0.43 points, or 0.01 percent, at 5,043.96.\nNine of the 10 major S&P sectors were lower with the energy index's 1 percent fall leading the decliners as oil prices pared earlier gains.\nChina's central bank said on Thursday there was no basis for further depreciation of the yuan, pointed to strong economic fundamentals, but investors remained skeptical.\n\"They're taking the Chinese central bank at its word, but I'm still taking those comments with a pinch of salt,\" said Hantec Markets' analyst Richard Perry.\nSources told Reuters that some powerful voices within the Chinese government were pushing for the yuan to go still lower, suggesting pressure for an overall devaluation of almost 10 percent.\nIn corporate news, Cisco's shares rose 4.2 percent to $29.09 after the network equipment maker's profit beat expectations. The stock gave the biggest boost to the three major indexes.\nTesla rose 2.2 percent to $243.35 after it said it plans to raise about $500 million through a share sale, with CEO Elon Musk buying shares worth up to $20 million.\nKohl fell 10.5 percent to $55.03 after the department store operator reported lower-than-expected quarterly same-store sales.\nCompanies scheduled to report after the close of market on Thursday include King Digital Entertainment, Applied Materials and Nordstrom.\nDeclining issues outnumbered advancers on the NYSE by 1,819 to 843. On the Nasdaq, 1,164 issues fell and 1,058 advanced.\nThe S&P 500 index showed seven new 52-week highs and two new lows, while the Nasdaq recorded 15 new highs and 24 new lows. (Reporting by Tanya Agrawal in Bengaluru; Editing by Savio D'Souza)", "external_links": [], "published": "2015-08-13T18:07:00.000+03:00", "crawled": "2015-08-13T17:14:27.967+03:00", "highlightTitle": ""}