{"organizations": [], "uuid": "cf2a4318d97cc7faf09a70f157a5f5ce5cc3c71c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/08/21/102937118-GettyImages-457534476.1910x1000.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=NVS", "section_title": "Yahoo! Finance: NVS News", "url": "http://www.cnbc.com/2015/08/21/european-markets-to-plunge-as-china-and-greece-worries-return.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=102937103", "country": "US", "title": "European stocks plunge on China, Greece worries", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "European stocks plunge on China, Greece worries", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T10:30:00.000+03:00", "replies_count": 0, "uuid": "cf2a4318d97cc7faf09a70f157a5f5ce5cc3c71c"}, "author": "", "url": "http://www.cnbc.com/2015/08/21/european-markets-to-plunge-as-china-and-greece-worries-return.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=102937103", "ord_in_thread": 0, "title": "European stocks plunge on China, Greece worries", "locations": ["Greece", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com SHARES <p>European markets plunge as China and Greece worries return</p> <p>European stock markets plunged at the open on Friday, as worse-than-expected Chinese economic data and a new election in Greece spook traders.</p> \nEuropean stock markets plunged at the open on Friday but some losses, as worse-than-expected Chinese economic data and a new election in Greece spooked traders. \nThe pan-European Stoxx 600 traded over 0.8 percent lower. \nLondon's main index, the FTSE 100 , dropped 1.2 percent at the open but was over 0.5 percent lower in early trade. Germany's DAX plunged 1.8 percent but is currently trading around 0.9 percent while the French CAC fell 1.4 percent but pared some losses to trade down over 0.7 percent. \nThis follows big falls across Asian stock markets on Friday, after China August PMI data showed that factory activity in the world's second-biggest economy shrank at its fastest pace in more than six years. Japan's Nikkei was down 2 percent and the Shanghai Composite by 3 percent amid concerns about slowing Chinese economic growth. \nIn Greece, Prime Minister Alexis Tsipras resigned on Thursday and called snap elections in September, a move aimed at strengthening his grip on power. After fighting the last election on an anti-austerity platform, and spending much of his first six months in office attempting to reverse some of the changes made in Greece under its international bailout, he was eventually forced to back down in negotiations with the country's creditors in July. \nThe Greek stock market reacted negatively and was down 1.8 percent in early trade with banks taking a big hit. The National Bank of Greece and Piraeus Bank were down over 4 percent. \nMeanwhile, German consumer confidence fell in August for the third month in a row, according to a GFK sentiment indicator based on a survey of 2,000 people. \nMarkets will be watching out for the Markit composite PMIs for August, announced at 9am BST, Europe Friday. Stocks to watch \nStocks to watch include Spain's Banco Sabadell , which on Friday said it had completed the acquisition of 100 percent of Britain's TSB bank . TSB was formerly part of Lloyds Banking Group , which was bailed out by the U.K. government during the 2008 global financial crisis. \nAlso on Friday, Britain's GlaxoSmithKline said it had sold the remaining rights to its ofatumumab drug for up to $1 billion to Swiss pharmaceutical giant Novartis . Shares in GSK were down 0.9 percent while Novartis shares were over 1.5 percent lower. \nCompanies in the auto and luxury sector have seen a fallout from concerns over the Chinese economy and the depreciation of the yuan. France's Renault and Peugeot Citroen and Germany's Daimler were all in the red on Friday, trading roughly 2 percent lower. Italian luxury glasses maker Luxottica was 2.5 percent off, while Danish jewellery brand Pandora was down by 1.7 percent. Swatch Group , LVMH and Hermes were all trading in negative territory. \nShares in Dutch oil and chemicals storage company Vopak tanked over 16 percent despite reporting a rise in first-half earnings. \nOn the other end of the scale, many of the miners were in positive territory as gold gets a safe haven rebound. Russia's Polyus Gold was up over 2.2 percent while London-listed Randgold Resources and Anglo American were up near 1 percent. Arjun Kharpal News Assistant, CNBC EU News Digital Team Catherine Boyle Senior Correspondent, CNBC Related Securities", "external_links": [], "published": "2015-08-21T10:30:00.000+03:00", "crawled": "2015-08-21T12:56:35.358+03:00", "highlightTitle": ""}