{"organizations": [], "uuid": "c38f24e077cac3ed745f1460a053314ed9f6e131", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/m/w/a/k/6/image.related.afrArticleLead.620x365.gj1j9d.png/1439924627670.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/policy/tax/wealthy-tip-an-extra-40b-into-super-20150818-gj1j9d", "country": "AU", "title": "Wealthy tip an extra $40b into super", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Wealthy tip an extra $40b into super | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T21:45:00.000+03:00", "replies_count": 0, "uuid": "c38f24e077cac3ed745f1460a053314ed9f6e131"}, "author": "Joanna Mather", "url": "http://www.afr.com/news/policy/tax/wealthy-tip-an-extra-40b-into-super-20150818-gj1j9d", "ord_in_thread": 0, "title": "Wealthy tip an extra $40b into super", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Grattan Institute's John Daley says wealthy Australians do not need extra incentives to save for retirement. Ryan Stuart Share on twitter by Joanna Mather Wealthy Australians are tipping an extra $40 billion a year into superannuation to take advantage of the low-tax environment afforded to nest eggs, prompting fresh calls for change.\nNew analysis of tax statistics by the Grattan Institute shows a third of all taxpayers aged 60 to 64 made voluntary post-tax contributions in 2012-13, topping up their accounts by an average of just under $40,000.\n\"Most of the voluntary contributions are tax structuring by over 60s rather than early savings for retirement,\" said a Grattan paper prepared for next week's National Reform Summit.\nPutting extra money into super is attractive because after the age of 60, earnings and withdrawals are tax free.\nWealthy Australians will save for their retirement without incentives, says the Grattan Institute. But from a federal budget point of view, tax-free earnings represented a significant \"leak\", said Grattan Institute chief executive John Daley, who questioned why a country would give tax breaks to the wealthiest sections of society while increasing taxes and cutting spending elsewhere.\nHe said wealthy Australians did not need extra incentives to save for retirement; they would save anyway. Better-off retirees also tended to get income from outside super, such as through investment earnings. \"More than half of the benefits from super tax breaks go to the top 20 per cent of households, most of whom would save anyway and would be unlikely to qualify for the age pension.\"\nVoluntary contributions Taxpayers made voluntary contributions of $40 billion in 2012-13, including $10 billion in voluntary concessional contributions and $30 billion in voluntary non-concessional contributions.\n The latter are not afforded any tax breaks but, at $30 billion, they made up almost a third of all contributions.\nIn 2012-13, the biggest non-concessional contributions were made by those aged 70 and over, at an average of $50,000.\nMr Daley said many of those contributors were withdrawing money from super and then recycling the contributions back into super to avoid the 15 per cent tax on super balances on death.\nBefore the summit, Grattan has stepped up pressure to wind back super tax breaks, negative gearing and the 50 per cent capital gains tax discount, all of which it believes to be lurks for the rich.\nIt has also sought to discredit assertions Australia is a high-taxing country with a bloated government which can solve its budget problems by cutting spending.\n\"Australia has [a] small government by international standards,\" the paper said. \"Australia's top marginal tax rate is unremarkable...[and] filling a budget hole of $40 billion without revenue increases is implausible.\"\nThe Grattan Institute supports a higher GST, or broader base, as a way to raise revenue.\n\"Compensation can be targeted to the bottom 20 per cent through the welfare system,\" the paper said.\nIn a sign of how fractious debate about tax reform had become, think tanks involved in the summit have been unable to come to a consensus on any single policy change.\nThe result is that Grattan has prepared recommendations separately to the Centre for Independent Studies and Menzies Research Institute.\nThe latter two submitted joint recommendations for discussion, including capping the top marginal tax rate at 35 per cent (down from 49 per cent) and a reduction in the company tax rate, possibly funded by getting rid of dividend imputation.\nThey do not support changes to negative gearing or the taxation of super, but they have also suggested a Scandinavian-style dual income tax, which would set one tax rate for labour income and another for other types of earnings.\nThis second rate could be set at 20 per cent and would apply to company income, capital gains, dividends, net rent and interest income.", "external_links": ["https://twitter.com/https://twitter.com/JoannaMather"], "published": "2015-08-18T21:45:00.000+03:00", "crawled": "2015-08-19T00:10:06.552+03:00", "highlightTitle": ""}