{"organizations": ["BlueCrest Trains Cloud Computing Teachers"], "uuid": "9fe6e27f56ebb453cd50159557fed9af4671060d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/20150815_122337.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/636437/1/bluecrest-trains-cloud-computing-teachers.html", "country": "US", "title": "BlueCrest Trains Cloud Computing Teachers", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "BlueCrest Trains Cloud Computing Teachers", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T16:24:00.000+03:00", "replies_count": 0, "uuid": "9fe6e27f56ebb453cd50159557fed9af4671060d"}, "author": "", "url": "http://www.modernghana.com/news/636437/1/bluecrest-trains-cloud-computing-teachers.html", "ord_in_thread": 0, "title": "BlueCrest Trains Cloud Computing Teachers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  14 August 2015 14:24 CET BlueCrest Trains Cloud Computing Teachers By Daily Guide \nICT Teachers in Kumasi after their workshop at BlueCrest College \nBlueCrest College, in partnership with the Ghana Education Service (GES), Ministry of Education, has organized training workshops on Cloud Computing using Google Apps for Information & Communication Technology (ICT) teachers from various Senior High Schools (SHSs) in Greater Accra, Ashanti and Northern regions. \nThe workshop was opened by Felicia Boakye-Yiadom, Greater Accra Regional Director of GES in Accra. \nShe urged participants to make good use of the workshop and acquire skills which will enhance their work and also help them to impact the same knowledge to their students and colleagues. \nMs Boakye-Yiadom lauded BlueCrest College for its initiative and their contribution towards the welfare of ICT education in Ghana. \nVivek Verma, Director-Blue Crest College, stated that the hands-on workshop would create awareness about the new development in field of Information & Communication Technology (ICT). \nParticipants were educated on the best ways to use cloud computing. \nThe workshop covered fundamentals of cloud computing and how it differs from traditional computing technologies with its architecture. \nThey also practiced lot of exercises on Google Office products like Google Drive, Docs, Sheets, Slides, Forms and sites. ICT teachers were also introduced to Google Apps. \nProf. E. Balamurugan conducted the workshop for ICT teachers in Accra and Kumasi. \nHe has more than three years of experience in training students and professionals on Google products mainly in the field of effective education delivery. \nThe academician has spearheaded many projects in his previous university on integration of Google Classroom in academic delivery and assessment. \nProf. Balamurugan holds an M.Phil and MSc in Computer Science and is pursuing PhD in Enhanced Document Classification Technique using Extreme Learning Machine Classifier with Fuzzy Unsharp Marking Scheme. \nHe has more than 25 publications under his name in various fields of ICT and is associated with BlueCrest College as Associate Dean (Academics). \nAbout 120 teachers participated in the workshops.", "external_links": [], "published": "2015-08-14T16:24:00.000+03:00", "crawled": "2015-08-15T03:51:41.731+03:00", "highlightTitle": ""}