{"organizations": [], "uuid": "47c2a5682ce250836c940320cd764155bee0eb56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/personal-finance/", "section_title": "Personal Finance News:Personal Finance Articles,Personal Finance Tips,Banking and Finance News | The Financial Express", "url": "http://www.financialexpress.com/article/personal-finance/rs-6000cr-epf-money-to-be-invested-in-equities-by-march-2016/108792", "country": "IE", "title": "Rs 6,000cr EPF money to be invested in equities by March 2016", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Rs 6,000cr EPF money to be invested in equities by March 2016 | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T08:40:00.000+03:00", "replies_count": 0, "uuid": "47c2a5682ce250836c940320cd764155bee0eb56"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/personal-finance/rs-6000cr-epf-money-to-be-invested-in-equities-by-march-2016/108792", "ord_in_thread": 0, "title": "Rs 6,000cr EPF money to be invested in equities by March 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "About Rs 6,000 crore of EPF (Employees’ Provident Fund) money would be invested in equities by March 2016 with a view to get higher returns, said Union Minister of State for Labour Bandaru Dattatreya today.\n“We proposed to go for equity participation with this Rs 6,000 crore by end of March 2016. This process has already begun. Our portfolio managers, SBI, Reliance and HSBC bank and some other organisations are part of this portfolio management. Through them, we have facilitated the entry of these funds into the market. This is being done for the first time by the Labour Ministry,” he told reporters here.\nThe investment would begin with 1 per cent of EPF- related money which could eventually go up to 15 per cent, he said.\n“Approximately Rs 8,30,000 crore of EPF-related money is there (with Government). The Finance Minister had said in his Budget speech that portfolio management (of the funds) should not be done by old methods alone and favoured equity participation of 5 to 15 per cent,” Dattatreya said.\nHis Ministry discussed the issue and sought a report from a consultancy, which noted that workers in other countries got higher returns through equity participation of their funds, Dattatreya said.\n“They (consultancy) gave a report to this effect. We made a presentation on this before the Central Board of Trustees (of EPF). We gave a presentation to all trade union leaders, entrepreneurs, state government representatives and officials in our Ministry.\n“We took a decision in consultation with our officials to make equity participation of Rs 6,000 crore in first phase. One per cent (of the corpus) to begin with, then two per cent, three per cent, four per cent and finally five per cent.”\nAsked how the Ministry proposes to guard the EPF money from incurring losses in equity markets, which are known to be volatile with no guaranteed returns, he said these investments are being made for a long haul.\n“These are long-term investments. These are not investments for one year or two years. They give more returns. Our investments are for 10 years or 15 years. Though it may appear to be causing losses in the short term, in long term, it would be giving profits. We are giving (interest of) 8.75 per cent now. It (equity investment) is likely to fetch more than 10 per cent,” Dattatreya maintained.\nEmployees’ Provident Fund Organisation (EPFO), a retirement fund body, has more than 5 crore subscribers across the country.\nFirst Published on July 28, 2015 12:40 am", "external_links": [], "published": "2015-07-28T08:40:00.000+03:00", "crawled": "2015-08-06T23:57:35.000+03:00", "highlightTitle": ""}