{"organizations": [], "uuid": "748f35a0d239624c89e65abf8c77a6bcfefc04b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/t/o/6/2/image.related.articleLeadwide.620x349.gjbqp0.png/1441009297460.jpg", "site_section": "http://www.smh.com.au/business/planners-go-rogue", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/banking-and-finance/banks-hit-brakes-on-property-investor-lending-apra-data-shows-20150831-gjbqp0.html", "country": "AU", "title": "Banks hit brakes on property investor lending, APRA data shows", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Banks hit brakes on property investor lending, APRA data shows", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "748f35a0d239624c89e65abf8c77a6bcfefc04b6"}, "author": "James Eyers", "url": "http://www.smh.com.au/business/banking-and-finance/banks-hit-brakes-on-property-investor-lending-apra-data-shows-20150831-gjbqp0.html", "ord_in_thread": 0, "title": "Banks hit brakes on property investor lending, APRA data shows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Growth in bank lending to property investors has slowed dramatically, new APRA figures show. Photo: Rob Homer\nThe big banks hit the brakes on loans to property investors in July, to pull their annual growth rates below the Australian Prudential Regulation Authority's 10 per cent cap.\nFigures released by the regulator on Monday show the investor loan books for each of the big four banks were essentially held flat over the past month.\nIn response to concerns that property markets are overheating and increasing risks to the banking system, APRA has been forcing banks in 2015 to slow growth in their housing investor loan portfolios. This resulted in the big banks tightening credit for several months. ANZ Banking Group, Commonwealth Bank of Australia and Westpac Banking Group said in July they would raise interest rates for property investors, while National Australia Bank is raising rates on interest-only loans.\nNational Australia Bank, which has been expanding its investor loan book at the fastest rate for the big banks, was forced last week to sharply restate upwards the size of its investor lending book at the end of June to $93 billion. ANZ made similar revisions at the end of July. APRA chairman Wayne Byres said last week such revisions needed \"to be avoided in the future\". These revisions pushed NAB and ANZ above the 10 per cent limit, while CBA is on the limit and Westpac just below it.\nAdvertisement APRA's monthly banking figures show NAB's investor loan portfolio at the end of July was $93.2 billion, an increase of 0.25 per cent on the revised June figure, or 3 per cent on an annualised basis. Yet NAB's investor loan book is still 14.3 per cent larger than it was a year earlier.\nANZ's $84 billion investor book at the end of July was just 0.56 per cent higher than its level at the end of June, with growth of 6.75 per cent on an annualised basis. The investor book at the end of July was 11.8 per cent higher than a year earlier.\nWestpac, which has the largest investor loan book at $156.3 billion, was up just 0.3 per cent on its level at the end of June, or 3.6 per cent at an annualised rate. Its book is 9.53 per cent above the level of a year ago.\nCBA's investor loans at the end of July were $130.4 billion, up 0.53 per cent over the month, converting to an annualised rate of 6.4 per cent. It is up 10.1 per cent on a year earlier.\n\"It's early days, but it looks like some of the measures by a number of the banks to slow investor‑related lending growth are having the desired impact,\" the credit strategy team at CBA said in a note.", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-31T22:19:13.666+03:00", "highlightTitle": ""}