{"organizations": [], "uuid": "7b1b9a6f77ac266cd6ce71c0dd252f64d9132046", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/24/markets-global-fed-idUSL1N10Z17Z20150824", "country": "US", "title": "Market turmoil threatens Fed's rate hike plans", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Market turmoil threatens Fed's rate hike plans | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T00:28:00.000+03:00", "replies_count": 0, "uuid": "7b1b9a6f77ac266cd6ce71c0dd252f64d9132046"}, "author": "Jason Lange", "url": "http://www.reuters.com/article/2015/08/24/markets-global-fed-idUSL1N10Z17Z20150824", "ord_in_thread": 0, "title": "Market turmoil threatens Fed's rate hike plans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON/NEW YORK Aug 24 Turmoil in world financial markets and growing fears of a China-led global economic slowdown threaten to derail the Federal Reserve's plans to start raising rates from near zero, making the chances of a September lift-off look increasingly remote.\nA near 9-percent dive in Chinese shares on Monday triggered sharp sell-offs in Asia and Europe, wild swings and losses on Wall Street, and knocked crude prices to new multi-year lows.\nThe rout, which follows weeks of jitters over the extent of China's economic troubles and their impact on the rest of the world, convinced investors that the Fed would hold off with action until some semblance of calm returns.\n\"You would be insane to raise interest rates when markets are in such turmoil,\" said Martin Barnes, chief economist at BCA Research in Montreal.\nCompared to last week, investors now see a much lower chance the Fed will hike at its Sept. 16-17 meeting. Prices for swaps on Wall Street implied traders saw a 24 percent probability for a September move, down from 46 percent a week earlier, according to Tullett Prebon data.\nBarclays, for example, now expects the Fed will not raise rates until March. Previously, the British bank expected the hike to come in September.\nBlackRock Inc's chief investment officer for fixed income, Rick Rieder, told Reuters that even though he hoped the Fed would move next month, market volatility was making it difficult.\nAs part of Monday's sell-off, investors also scaled back their own bets on long-term U.S. inflation. The market gauge of those expectations - the yield spread between 10-year Treasuries and 10-year Treasury Inflation Protected Securities - hit a seven-month low, suggesting investors see inflation of around 1.5 percent over the next decade, well below the Fed's 2 percent target.\nUntil quite recently, the Fed has expressed limited concern over China's market turbulence, with policy debate focusing on evidence of improving labor markets and solid economic activity and whether it should raise rates next month or in December and at what pace it should proceed afterwards.\nNEED FOR CAUTION\nWith market jitters hitting home, however, the Fed has a number of reasons to be cautions even about taking that first step.\nOne is that financial markets, with investors shying away from risk and pushing U.S. Treasury yields lower, are more prone to a nervous reaction if the Fed were to move next month.\nSecondly, the Fed has to consider that market gloom might be a sign that the global economy is in worse shape than it has assumed, and the drag on the U.S. economy could be bigger than previously factored in by the central bank.\nFed policymakers have also said they wanted to be confident that inflation will start climbing towards its target before embarking on a tightening cycle and that goal now looks even more elusive.\nAs a result of global demand worries oil prices tumbled by another 5 percent to new 6-1/2 lows.\nChina's weakness and softer global demand for anything from raw materials to electronic components and heavy machinery is also bad news for U.S. factories.\nEven though China accounts for only a small share of U.S. exports, several Fed policymakers noted last month that \"a material slowdown in Chinese economic activity could pose risks to the U.S. economic outlook,\" according to the minutes of their July 28-29 policy meeting.\n\"The export effect is certainly significant,\" said Charles Collyns, an economist at the Institute for International Finance who also sees the U.S. central bank staying pat in September. \"The Fed is going to play it very cool.\"\nTroubles abroad, such as euro zone's debt crisis, have repeatedly stunted the United States' recovery from the 2007-2009 recession, but policymakers of late have been more confident the U.S. economy can cope with headwinds from abroad.\nThe Fed has carefully crafted a message this year that the time was approaching for it to raise interest rates.\nA September hike is not entirely off the table. The U.S. stock market rout that began Friday could still reverse itself, and a key employment report for August might show further improvement in the labor market.\n\"It's only August, and markets move quickly,\" said Michael Feroli, chief U.S. economist at JPMorgan Chase. But he added: \"The moves we've seen in markets, if they are sustained, don't help the case for September.\" (Reporting by Jason Lange in Washington and Jonathan Spicer in New York; Additional reporting by Richard Leong in New York and Krista Hughes in Washington; Editing by Tomasz Janowski )", "external_links": [], "published": "2015-08-25T00:28:00.000+03:00", "crawled": "2015-08-24T23:42:47.417+03:00", "highlightTitle": ""}