{"organizations": [], "uuid": "745e72a8fd9145dc99215597a148e8e1e6917e0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508170567.html", "country": "US", "title": "Kenya: Sugar's Popular Lies Vs Unpopular Truth", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: Sugar's Popular Lies Vs Unpopular Truth", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T11:16:00.000+03:00", "replies_count": 0, "uuid": "745e72a8fd9145dc99215597a148e8e1e6917e0f"}, "author": "", "url": "http://allafrica.com/stories/201508170567.html", "ord_in_thread": 0, "title": "Kenya: Sugar's Popular Lies Vs Unpopular Truth", "locations": ["Kenya", "Uganda"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Uganda: Sevens Game Has Role to Play in Renaissance of Ugandan Rugby \nMost small-scale sugarcane farmers operate on 'contract' with the sugar factories. The contract is an agreement between the farmer, who owns the land, and a specific sugar factory. The farmer provides land and the factory supplies everything the farmer needs to produce sugarcane - seedlings, fertiliser, harvesting resources, transport, etc. \nThe farmer guarantees not to grow anything else on their land for the duration of the contract, and to only sell the produce to that factory. The factory buys the produce from the farmer and pays the farmer net of the costs incurred to produce the cane. \nThis is a brilliant way of helping small-scale farmers that has worked quite well in other sectors such as coffee, tea and dairy. However, as I learnt, it has been a disaster for sugarcane. \nApparently, the factory has complete control over the farmer. They make all the decisions on the farm, including determining the quality and tonnage of the produce, without any input from the farmer. Prices for the supplies sold to the farmer are decided by the company and most times not disclosed to the farmer at the point of supply. They are not even allowed to compare with similar products in the market. Sugarcane is harvested and carted off to the factory even before being weighed because weighing is done at the mill and the farmer has to agree to whatever the factory says is the weight. \nIncredibly, if the cane is lost in transit, even if it is a case where the transporter (who is contracted by the factory) has an accident, the loss is on the farmer. The factory can also decide to plant experimental seedlings on a farm and if they fail, the losses are on the farmer. The factory also decides when your produce is ready for harvest and, again incredibly, they can come and cut your cane even at mid-maturity and sell it as 'seedling' to someone else. And any losses in these processes will be borne by the farmer. \nToday, some farmers sell the fertiliser provided rather than use it on the farm. Others let their cows graze on the cane for milk. Others 'steal' from themselves and sell to other factories for cash, especially the private ones. This is what happens when a farmer realises that one can plant a crop, wait for 16 months, sell it to a factory, and still owe the factory money! \nThis is what has destroyed our sugar industry. \nOne would expect political leaders from sugarcane-growing areas to want to help the more than 250,000 small-scale farmers get out of this kind of slavery. I would even support them if they called for mass action against the sugar factories. This is why they get elected. But no! These political 'leaders' (who are ironically all in the opposition) would rather use the sugarcane farmer's current status of slavery to their political advantage rather than partner with government to sort out the situation. They would rather accuse the government of killing the sugarcane industry, despite the facts above, than ask how Ugandan and Tanzanian factories are able to produce sugar at half the cost of Kenyan factories, while Kenya is technologically more advanced than her neighbours. \nThese 'leaders' would rather sensationally claim President Uhuru Kenyatta has entered into a 'deal' with Uganda's Yoweri Museveni than admit that Kenya has always imported sugar, even when Raila Odinga was Prime Minister, to cover a national deficit caused by the mismanagement of our sugar sector. \nIt is maddening when unpopular truth is judged against deliberately crafted popular lies. It is annoying when those propagating such lies know the truth. It is upsetting when such lies are used as a recovery strategy by an opposition smarting from being called hypocrites by US President Barack Obama in their own country. But Jubilee must not lose hope. Buddha said three things cannot be long hidden--the sun, the moon ... and the truth. \nThe author is a director of Change Associates, a political consultancy. Kenya \nThere are fears many children from West Pokot could one day claim citizenship of Uganda, where their parents delivered … see more » Copyright © 2015 The Star. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-17T11:16:00.000+03:00", "crawled": "2015-08-17T11:44:55.057+03:00", "highlightTitle": ""}