{"organizations": [], "uuid": "45b289b9b013f5c599aa85b60550c570b5249e53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-28/china-stock-index-futures-rise-as-state-buying-seen-continuing", "country": "US", "title": "China Stocks Rise for Second Day as State Buying Seen Continuing", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "China Stocks Rise for Second Day as State Buying Seen Continuing - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T09:27:00.000+03:00", "replies_count": 0, "uuid": "45b289b9b013f5c599aa85b60550c570b5249e53"}, "author": "Kyoungwha Kim", "url": "http://www.bloomberg.com/news/articles/2015-08-28/china-stock-index-futures-rise-as-state-buying-seen-continuing", "ord_in_thread": 0, "title": "China Stocks Rise for Second Day as State Buying Seen Continuing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China’s stocks rose for a second day amid speculation the government has resumed its intervention in the equities market and after the central bank boosted the yuan’s reference rate by the most in five months.\nThe Shanghai Composite Index climbed 1.4 percent to 3,125.45 at 9:34 a.m., extending Thursday’s 5.3 percent rally and paring this week’s loss to 11 percent. PetroChina Co. led a rally for energy producers after crude futures soared 10 percent in New York on Thursday. The People’s Bank of China raised the yuan reference rate by 0.15 percent to 6.3986 per dollar on Friday morning, the most since March.\nPolicy makers want to stabilize equities before a Sept. 3 military parade celebrating the 70th anniversary of the World War II victory over Japan, said two of the people, who asked not to be identified because the move wasn’t publicly announced. The shift followed the absence of state buying earlier this week.\nThe intervention to prop up shares is part of a broader effort to ensure nothing detracts from the parade, an event the government will use to demonstrate its rising military and political might. The parade has been planned for months and will provide President Xi Jinping his first opportunity to publicly present himself to the world as China’s commander in chief.\nThe Shanghai Composite has fallen 40 percent since the June peak amid concern the government has scaled back efforts to prop up equities and the deepning economic slowdown will hurt corporate profits. Data on Friday showed industrial companies’ profits slid for a second month, dropping 2.9 percent in July.\nGovernment Support China Securities Finance may have applied for 1.4 trillion yuan ($219 billion) of borrowing in the interbank market, Caixin reported, citing unidentified bank officials. The government should adopt a proactive fiscal policy and further ease monetary policy, the Economic Daily wrote in a front-page commentary. The People’s Bank of China announced a cut in interest rates for a fifth time since November and lowered reserve-requirement ratios for lenders earlier this week.\nThe Hang Seng China Enterprises Index climbed 1.8 percent, while the Hang Seng Index rose 1.6 percent. The CSI 300 Index advanced 1.3 percent, led by rallies of more than 3 percent for energy and industrial companies.\nPetroChina, China’s biggest oil and gas producer, surged 3.4 percent even after it reported a 63 percent slump in first-half income. Oil headed for the biggest weekly advance since April after the largest one-day jump in six years as the U.S. economy expanded more than predicted.\nIndustrial & Commercial Bank of China Ltd. dropped 1.4 percent after reporting zero profit growth amid a buildup in bad loans.\nStocks on mainland bourses traded at a median 49 times reported earnings on Thursday, That’s the most among the 10 largest markets and more than three times the 18 multiple for the Standard & Poor’s 500 Index.", "external_links": [], "published": "2015-08-28T09:27:00.000+03:00", "crawled": "2015-08-28T04:52:25.669+03:00", "highlightTitle": ""}