{"organizations": [], "uuid": "e4b486cf3e064eedacf11dc41e12783f05eab6a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/m/u/t/q/x/image.related.articleLeadwide.620x349.gjbur0.png/1430935542954.jpg", "site_section": "http://www.smh.com.au/business/planners-go-rogue", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/banking-and-finance/banking-and-finance-oath-gains-highlevel-support-20150831-gjbur0.html", "country": "AU", "title": "Banking and Finance Oath gains high-level support", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Banking and Finance Oath gains high-level support", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "e4b486cf3e064eedacf11dc41e12783f05eab6a2"}, "author": "James Eyers", "url": "http://www.smh.com.au/business/banking-and-finance/banking-and-finance-oath-gains-highlevel-support-20150831-gjbur0.html", "ord_in_thread": 0, "title": "Banking and Finance Oath gains high-level support", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RBA governor Glenn Stevens says the Banking and Finance Oath can improve trust in the finance industry. Photo: Louise Kennerley\nFour years after it was established to provide an ethical anchor for the financial services sector, support for the Banking and Finance Oath is gathering momentum but its influential backers recognise there is a long way to go before it can restore the reputation of the maligned industry.\nAround 500 people have signed the industry-led oath, which is pledged by individuals rather than their companies. One of the recent high profile signatories is Wayne Byres, chairman of the Australian Prudential Regulation Authority, which has been upping the pressure on banks during the year to enhance their cultures in the wake of a series of scandals in financial planning divisions.\nThe oath reads as follows: \"Trust is the foundation of my profession. I will serve all interests in good faith. I will compete with honour. I will pursue my ends with ethical restraint. I will create a sustainable future. I will help create a more just society. I will speak out against wrongdoing and support others who do the same. I will accept responsibility for my actions. In these and all other matters; My word is my bond.\"\nThe oath is backed by a legal structure which may result in members who fail to adhere to its standards being taken off the list of signatories.\nAdvertisement The Banking and Finance Oath (BFO) board is chaired by outgoing AMP Capital boss Stephen Dunne and includes former CEO of Goldman Sachs in Australia Stephen Fitzgerald; Phil Chronican, formerly the head of ANZ Banking Group in Australia; and the former head of MLC, Steve Tucker. The oath's policy council includes a range of industry leaders including AMP chairman Simon McKeon, former RBA board member Jillian Broadbent, Westpac director Peter Marriot, Bank of Melbourne chairman Elizabeth Proust, Bank of Queensland director Michaelle Tredenick and Commonwealth Bank of Australia director Andrew Mohl. Former Rothschild Australia chief Trevor Rowe and prominent director Carolyn Hewson are also supporters.\nMr Tucker said the BFO was about \"more than just asking individuals to take personal accountability on how to conduct themselves. It is also about creating open conversations around ethical matters, challenging status quo and getting people to come together to discuss important topics. That is what we need to start happening.\"\nUnder the leadership of Cris Parker, the BFO has been expanding its programs, including a series of lunches, mentoring and access to elders of the industry, and a young ambassadors program, which was launched last week by Reserve Bank of Australia governor Glenn Stevens. At the AFR's Banking & Wealth Summit in late April, Mr Stevens said the BFO \"can make a very worthwhile contribution, if enough people are prepared to sign up and exhibit the promised behaviour\", which would help restore trust to the industry.\n\"Finance depends on trust. In fact, in the end, it can depend on little else...\" he said. \"In the end, though, you can't legislate for culture or character. Culture has to be nurtured...character has to be developed and exemplified in behaviour. For all of us in the financial services and official sectors, this is a never-ending task.\"\nMs Parker said she would soon write again to the big bank CEOs to encourage them to sign up to the oath. On Thursday, the Australian Israel Chamber of Commerce will host a lunch in Sydney with Business Council of Australia chief Jennifer Westacott, Financial Services Council chief Sally Loane, Mr Dunne and Simon Longstaff from the St James Ethics Centre, who is also a BFO board member, to discuss ethics in financial services and the role of the oath.\n\"I can't honestly think of any reason why the CEO of an Australian bank sitting down and reading it wouldn't say as a personal commitment they wouldn't make it,\" Mr Longstaff said. \"There is nothing in there that doesn't reinforce the best parts of what they are trying to do.\"", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-31T22:19:34.409+03:00", "highlightTitle": ""}