{"organizations": ["Travelers"], "uuid": "10d47d0e2d7fee1602b85ec6c19ea971722e0830", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/delaware-county-news-network/rss/627", "section_title": "Delaware County News Network : Personal Finance", "url": "http://business-news.thestreet.com/delaware-county-news-network/story/top-cultural-experiences-being-offered-to-travelers-in-2015/13250502", "country": "US", "title": "Top Cultural Experiences Being Offered to Travelers in 2015", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Top Cultural Experiences Being Offered to Travelers in 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T20:51:00.000+03:00", "replies_count": 0, "uuid": "10d47d0e2d7fee1602b85ec6c19ea971722e0830"}, "author": "", "url": "http://business-news.thestreet.com/delaware-county-news-network/story/top-cultural-experiences-being-offered-to-travelers-in-2015/13250502", "ord_in_thread": 0, "title": "Top Cultural Experiences Being Offered to Travelers in 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mia Taylor"], "text": "Top Cultural Experiences Being Offered to Travelers in 2015 Written by: Mia Taylor 08/10/15 - 1:51 PM EDT \nNEW YORK ( MainStreet ) — It seems we've gotten the point where even our leisure time involves a serious amount of multi-tasking. \nSitting by the pool and relaxing while on vacation, or lying on the beach and mentally checking out, became passé many years ago. Travelers are increasingly searching for meaningful experiences involving not just fun or relaxation, but also hyper-localized opportunities that include learning a local skill or trade, participating in cultural activities or gaining behind-the-scenes exposure to a country and its traditions. \nIn fact, according to the 2015 Resonance Report, which studies travel trends, the consumption of experiences (rather than the purchasing of old-fashioned material goods) has become a new way of signaling social status. More Headlines Why Aren't We Getting Chip and PIN Credit Cards? \nThink of it as Vacation 3.0, where the hot commodity is interaction with intangible heritage such as traditions, storytelling and higher levels of cultural participation rather then passive observation. \nThis increasingly popular trend began a few years ago and is growing more sophisticated with each passing day, as hotels and resorts around the world seize on the desire among travelers to have more authentic or unique opportunities. Experiences once limited to the adventurous or the backpackers are now permeating the masses. \nSandos Caracol Eco Resort , for example, in Playa del Carmen, offers more than 80 activities each week as part of what it calls the Xcalacoco Experience, or activities designed specifically to expose travelers to Mayan culture and traditions. \nThe offerings range from Mayan cooking demonstrations to ancient Mayan ball games. Each day of the week at the resort is dedicated to one element of Mayan life. One day is focused on corn, another on water, and yet another day on fire, and so on. \n\"In this region where our property is based, there was a Mayan settlement,\" says Vanessa Goig, marketing manager for the property. \"The area was called Xcalacoco. So we took the opportunity to start thinking about how to teach our guests more about local traditions, culture and nature. More and more people are interested in knowing more about the places they are traveling.\" \nOne of the most recent additions to the resort's educational and cultural lineup is Path of Senses, a sensorial activity that puts groups in touch with nature by leading them blindfolded and barefoot through the jungle. \n\"It's like a journey through the senses, so you can experience nature from the Mayan point of view,\" says Goig. \"We take them by the hand, they don't see anything, and they are led on a path through the middle of jungle, in one of the isolated areas of the resort, where there are no buildings. The path is made with different materials, and because people are barefoot they can feel things on their feet. During the experience the guide also has them feel different objects, and smell different things.\" \nAccording to the Resonance Report, the portion of American travelers interested in learning new things has increased to 94%. Meanwhile, hotels have seen as much as a 10% increase in local programming in order to accommodate that growing demand. \nMillennials in particular, says the report, are interested in experiencing everyday life in another country and increasing their knowledge. \nAll of which has led to multitasking vacationers. \n\"I think people are combining a lot of things because they are so busy,\" says Melissa Paston, catering sales manager at New York City's Kitano Hotel. \"If they're traveling, they want leisure and they want education at same time. They are multitasking leisure. People are looking for unique experiences. A hotel is not just about a place to sleep anymore, but is also about having a transporting experience.\" \nWith that in mind, here's a look at some of the localized experiences emerging in 2015. 1", "external_links": [], "published": "2015-08-10T20:51:00.000+03:00", "crawled": "2015-08-11T00:25:59.166+03:00", "highlightTitle": ""}