{"organizations": [], "uuid": "cfebe777fc96e96817e456555136989b5b02671d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508100266.html", "country": "US", "title": "Zimbabwe: Editors Concerned About Firing of Journalists", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Editors Concerned About Firing of Journalists", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T10:25:00.000+03:00", "replies_count": 0, "uuid": "cfebe777fc96e96817e456555136989b5b02671d"}, "author": "", "url": "http://allafrica.com/stories/201508100266.html", "ord_in_thread": 0, "title": "Zimbabwe: Editors Concerned About Firing of Journalists", "locations": ["Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zimbabwe: Heroes Live Forever, Villains Perish \nStaff at the state broadcaster also claimed that the company would, this week, fire nearly 400 of its more than 1000 workers. \nThe media houses are also taking advantage of the recent Supreme Court ruling allowing companies to fire workers after giving them three months' notice of termination of contract. \nApart from Zimpapers, ANZ which publishes the Daily News and AMH, which owns News Day, The Standard and The Independent, have sent dozens of workers and journalists home. \nAMH chairperson Trevor Ncube said welcomed the Supreme Court ruling saying it would bring \"sanity to Zimbabwe's job market\". \n\"The lazy and incompetent will be shown the door,\" Ncube said on Twitter. \n\"Talented/hardworking will prosper, #ZimJobs\". \nHowever, in a short statement, the Editors' Forum urged restraint. \n\"We acknowledge the economy is in dire straits, due to a myriad of economic various factors and challenges,\" said Njabulo Ncube Zinef Acting Chairperson. \n\"We are appealing to Media Houses and Publishers to exercise restraint by considering other options like reducing allowances and benefits and in some instances even lowering grades. \n\"We urge Parliament to speed up the passing of a new Labour Bill which is sensitive to the interests of both the employer and employee.\" Zimbabwe \nGOVERNMENT has released $15 million to the Grain Marketing Board for payment to farmers who delivered their grain to the … see more » Copyright © 2015 New Zimbabwe. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-10T10:25:00.000+03:00", "crawled": "2015-08-10T11:48:33.069+03:00", "highlightTitle": ""}