{"organizations": [], "uuid": "ab24e9baa247c9320c9a1a7d36aab97f65975081", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/2/v/l/o/v/image.related.afrArticleLead.620x365.gigbmi.png/1439954035466.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/personal-finance/how-billionaire-property-developer-lang-walker-invests-20150720-gigbmi", "country": "AU", "title": "How billionaire property developer Lang Walker invests", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How billionaire property developer Lang Walker invests | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T22:15:00.000+03:00", "replies_count": 0, "uuid": "ab24e9baa247c9320c9a1a7d36aab97f65975081"}, "author": "Sue Hoban", "url": "http://www.afr.com/personal-finance/how-billionaire-property-developer-lang-walker-invests-20150720-gigbmi", "ord_in_thread": 0, "title": "How billionaire property developer Lang Walker invests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lang Walker has built a $2.31 billion personal fortune and created three successful property development empires. Rob Homer by Sue Hoban \"Where a lot of investors make mistakes, I believe, is they go looking for a quick buck and that just doesn't happen. Whether it be property or shares, it just takes a heck of a long time to get these things to work.\"\n- Billionaire property developer Lang Walker\nThere are still traces of the knockabout self-made man in property tycoon Lang Walker. One of the most striking is his total lack of hubris.\nIn the 50 years since he joined his father's earthmoving business and started diversifying, he has built a $2.31 billion personal fortune and created three successful property development empires, each one bigger and more successful than the last. Yet he remains almost self-deprecating about his successes.\nSmart Investor Graphic Kirsten Burghard Midas touch Walker, now 68 and the sole owner of Walker Corporation, is described as having the Midas touch in being able to turn often problematic sites and projects into gold. But another big factor in his success has undoubtedly been his willingness to rely on his instincts and step back from the fray.\nIn 1999, five years after the company floated, he sold his shareholding to Australand, then, in 2006, offloaded $1.25 billion worth of assets in his next business to Mirvac, which left him cashed up and ready to capitalise on the aftermath of the global financial crisis.\n\"You develop a bit of a sixth sense about these things, but I think it was pretty obvious what was coming,\" he says. \"I could see the storm clouds starting to gather and thought it was time to sell some assets into pretty much a rising market.\"\n Now, in its third incarnation, Walker Corporation has a project pipeline worth almost $15 billion, built on the back of those post-GFC acquisitions as well as a core of other assets he simply wasn't prepared to sell, among them the $2 billion, five-tower Collins Square development now taking shape in Melbourne's CBD.\n\"I was never prepared to sell that because I just knew, long term, that was really going to be an irreplaceable trophy property and that is proving to be the case.\"\nHis ongoing confidence in the residential sector is reflected in the other assets he kept. \"There was a lot of land that I felt had long-term value for masterplan communities that I was keen to hold on to for the long term and, given where residential is going, I think that is going to prove a wise move.\"\nDealing with risk \"The way I have dealt with the risk matrix of our business has been to diversify across the different sectors, so we have retail, commercial, industrial, residential and masterplan community expertise and we have to stay ahead of the game with where we think the market is going in each of those sectors.\"\nThe 70 per cent of his personal wealth that Walker has vested in the company's assets is supplemented by a tight set of \"non-core investments\" managed in-house by him and his 2IC, former Brierley Investments MD Bruce Hancock.\nThey are notably devoid of the conventional blue-chip stocks, revealing a preference for smaller, entrepreneurial companies with leading-edge technologies. \"The world is changing so quickly that I like to look at the smart things being developed by smart people. We're always on the lookout for that sort of activity.\"\nWalker says he has no plans to slow down, let alone retire. \"I go to work every day to have fun and that's the real key. I just love doing what I do.\"", "external_links": [], "published": "2015-08-17T22:15:00.000+03:00", "crawled": "2015-08-19T10:08:21.574+03:00", "highlightTitle": ""}