{"organizations": [], "uuid": "13dd4033bed91ef276adcb5f956fe83473e51092", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/g/y/q/k/q/image.related.articleLeadwide.620x349.gj42mv.png/1440144749943.jpg", "site_section": "http://www.canberratimes.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.canberratimes.com.au/business/banking-and-finance/owneroccupiers-targeted-with-interest-rate-deals-20150820-gj42mv.html", "country": "AU", "title": "Banks target owner-occupiers with interest rate deals", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Banks target owner-occupiers with interest rate deals", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T16:12:00.000+03:00", "replies_count": 0, "uuid": "13dd4033bed91ef276adcb5f956fe83473e51092"}, "author": "", "url": "http://www.canberratimes.com.au/business/banking-and-finance/owneroccupiers-targeted-with-interest-rate-deals-20150820-gj42mv.html", "ord_in_thread": 0, "title": "Banks target owner-occupiers with interest rate deals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Large discounts are available for owner-occupiers who are strong clients with big loans. Photo: Danielle Smith\n​ As banks put the brakes on lending to property investors , borrowers buying a house to live in are being offered some of the sharpest deals in the market.\nOwner-occupiers are being targeted with lower advertised interest rates and cash-back offers, and mortgage brokers say these customers can also negotiate bigger interest rate discounts.\nRateCity figures show a significant gap opening up between the interest rates charged to owner-occupier and investor customers of most banks.\nMore than 15 lenders, including Commonwealth Bank, Westpac and ANZ Banking Group, are offering owner-occupiers rates that are at least 0.22 percentage points lower.\nAdvertisement \"While the providers are trying to curb investor lending they are looking to rebalance their book back towards owner-occupiers,\" says RateCity spokeswoman Laine Lister.\n\"The flipside of investors paying more is that owner occupiers are getting a better deal in some cases.\"\nFor example, HSBC has variable rate of 3.99 per cent for owner-occupiers, and Loans.com.au is offering 4.02 per cent.\nLarger lender Suncorp has an advertised rate of 4.15 per cent for owner-occupier customers who are borrowing more than $750,000, with a deposit of more than 20 per cent.\nBeyond their advertised rates, banks are also scaling back interest rate discounts for investors and offering deeper discounts to owner-occupiers. The exact size of the discount will depend on the bank and the customer's financial circumstances.\nA mortgage broker in Sydney, Andrew Woods, says investors taking out loans are generally paying interest rates about 0.27 percentage points higher than what owner-occupiers pay, but the gap is wider for the most sought-after customers.\n\"Even larger discounts than that are available for owner-occupiers who are strong clients with larger loans,\" Woods says.\nThe principal of consultancy Digital Finance Analytics Martin North says his surveys of customers have shown that typical interest rate discounts offered to owner-occupiers have climbed from between 0.35 to 0.4 percentage points to 0.6 to 0.7 percentage points in the past few weeks.\n\"There's no doubt in my mind that the battle ground now is absolutely owner-occupied loans,\" North says.\nBanks are also offering \"cash back\" offers targeted at owner-occupiers. For instance, Westpac-owned Bank of Melbourne, St George and BankSA are offering $2000 cash back for owner-occupiers borrowing more than $200,000.\nAs well, a two-tier market has emerged in fixed-rate mortgages. Commonwealth Bank, Westpac and ANZ have all raised fixed rates for investor loans in the past month, while at the same time cutting various owner-occupied fixed rates.", "external_links": ["http://www.afr.com/real-estate/apra-bank-loan-changes-put-the-brakes-on-property-investors-20150720-gighhu", "https://www.afr.com/real-estate/residential/sell-your-house-before-christmas-and-have-a-happy-new-year-20150817-gj0wh9.html", "http://www.afr.com/business/banking-and-finance/cba-joins-anz-in-raising-investor-interest-rates-by-027-percentage-points-20150724-gijihx"], "published": "2015-08-21T16:12:00.000+03:00", "crawled": "2015-08-23T14:04:00.272+03:00", "highlightTitle": ""}