{"organizations": [], "uuid": "440927d176c46ae7d863d836347ed80949d9ac01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/mutual-neutral-nikkei-prove-suitable-160124386.html", "country": "GB", "title": "Mutual and neutral: will Nikkei prove a suitable fit for the FT?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Mutual and neutral: will Nikkei prove a suitable fit for the FT?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T19:01:00.000+03:00", "replies_count": 0, "uuid": "440927d176c46ae7d863d836347ed80949d9ac01"}, "author": "", "url": "https://uk.finance.yahoo.com/news/mutual-neutral-nikkei-prove-suitable-160124386.html", "ord_in_thread": 0, "title": "Mutual and neutral: will Nikkei prove a suitable fit for the FT?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "17.59 +1.47 \nThe newspaper faces a more guarded corporate culture under its new Japanese owner, writes Christopher Williams \nAs the dust begins to settle on Nikkei’s surprise takeover of the FT Group 10 days ago, questions are being asked about the company behind the audacious acquisition. \nIt will no doubt surprise many at the Financial Times, and the wider media community, that the newspaper will be owned not just by a Japanese company, but ultimately by the Japanese journalists themselves. \nThe unusual structure of Nikkei, which has agreed to pay Pearson (Amsterdam: PR8.AS - news ) £844m for the FT, means British reporters will be toiling for the direct financial benefit of their Japanese counterparts. \n“To maintain our neutrality as a media organisation providing fair and impartial news, we adopt an employee stock ownership plan in accordance with corporate law and daily newspaper law,” explains Atsushi Kubota, a spokesman for Nikkei. \n“The equity of Nikkei Inc is distributed only to employees and executives of Nikkei. They can acquire shares up to a certain number according to their job classification.” \nAt the last count, more than 4,200 current and former Nikkei staff held Nikkei shares. Last year, Nikkei reported a turnover of £1.55bn and profits of £53m, down 10pc on 2013. \nThe squeeze on profits as Nikkei has invested in expansion will not concern the shareholders too much; the company ended last year with more than £530m of cash in the bank. \nAs well as the profits from its flagship financial newspaper, Nihon Keizai Shimbun, they enjoy the income from Nikkei’s other media assets, including a 32pc stake in TV Tokyo. The anime broadcaster operates a world away from Nikkei’s role at the heart of Japanese corporate life. Earlier this month, it celebrated the birthday of its mascot, a permanently surprised giant banana called Nanana. Like employees at other Nikkei subsidiaries, the man in the Nanana suit is not allowed to become a shareholder. \nNikkei staff can remain shareholders after retirement, but cannot pass their equity on to relatives or trade their shares, other than by cashing them in with Nikkei Kyoeikai, a mutual fund that is one of the company’s two big shareholders. The other, Nikkei Fukushikai, is a form of care fund for former staff. \nKita (foreground) and Okada have pledged not to interfere in the FT's coverage \nFor the British media, the structure of the FT’s new owner is almost entirely alien. \n“Overall it reminds me of the form of co-operative associations or mutuals,” says Dr Yoshikatsu Shinozawa, senior lecturer in financial studies at the University of London’s School of Oriental and African Studies and a former Tokyo fund manager. \nHe explains that there is a specific legal restriction on the equity in daily newspapers in Japan, making it difficult for them to raise funds externally but also helping to encourage long-term thinking. The acquisition of the FT, at a price that means it will take 35 years to pay back if its current profits are sustained, is an example, argues Dr Shinozawa. Co-operative ownership of Nikkei does not extend to co-operative decision-making, however. \nThe acquisition of the FT was a tightly guarded project at the top end of the Nikkei boardroom table, according to people close to the deal. The only two people who really counted on the Japanese side, sources said, were the chairman, Tsuneo Kita, and the president, Naotoshi Okada. \n“The shareholders can vote on the plan for the surplus, the nomination of directors, directors’ remuneration and so on,” says Nikkei spokesman Kubota. “The acquisition of the FT was approved by the Nikkei board.” \nNeither does co-operative ownership engender the comfortable, collegiate news­room atmosphere for which the FT is known, according to Japanese journalists. “Nikkei journalists have a reputation for having to work harder than other reporters,” says one. \n“They normally have to write for three different daily Nikkei titles. They tend to be older than reporters from other papers normally middle-aged men.” \nTV Tokyo mascot Nanana the Banana is not eligible for Nikkei shares \n“Nikkei has this unique internal rule that says their front-page article in their morning edition has to be a scoop, every single day. They are very strict about this. Reporters tend to be really good at gathering data and coming up with some story related to statistics. If a division does not get a single scoop in a month, someone will get into trouble. \n“Every department is forced to comply with this rule. If in the past month a division hasn’t got a scoop, then the boss is going to have problems. Or worse, if a scoop about a corporate merger, for example, goes to another newspaper, then the chances are, you would get sent somewhere remote.” \nBut for all its domestic dominance, Nikkei makes almost no impact on the global stage. Its circulation of nearly 3m in Japan, a nation of 127m people, trounces the FT’s 69,000 in the UK, but it has nothing to compare with the British newspaper’s international clout. An attempt in 2013 to influence business beyond Japan’s borders by launching an English-language magazine, Nikkei Asian Review, has been met with indifference. \nSince the launch of the magazine, Mr Kita and Mr Okada have looked outside Nikkei to broaden their influence. They invested in Monocle, the luxury lifestyle magazine, then dug deep and moved rapidly to snatch the FT from under the nose of German newspaper owner Axel Springer, which had been secretly wooing Pearson (Xetra: 858266 - news ) for a year. \nAccording to Dr Shinozawa, Nikkei’s desire for international clout can be seen as part of a wider anxiety in Japan about the country becoming marginalised in globalisation. “Japan is reactivating its interest in international markets, partly because the domestic market is limited and partly because the big Japanese companies are running out of ideas,” he says. “So the obvious thing for them to do is to buy overseas companies to learn from them. \n“More than 80pc of the Japanese economy relies on domestic markets. The [Shinzo] Abe government is encouraging companies and people to be more globalised. \n“Having said that, Mr Abe’s policy of depreciation of the yen is not helpful. If the acquisition of the FT had happened three years ago it would have been very good timing, but now the yen is very weak and Nikkei have paid more than they would have done. \n“So, on one hand, the Government is encouraging Japanese to be more globalised but on the other, their monetary policy is against that. It is puzzling.” \nNikkei has close ties to corporate Japan \nNikkei is reportedly attracting plenty of support for its acquisition of the FT from its friends in the Japanese banking industry. According to Bloomberg, lenders such as Sumitomo, Mizuho Financial Group and Mitsubishi UFJ Financial Group are lining up to provide around £520m. Nikkei could meet the remainder of the £844m from its cash reserve, depleting it by almost two thirds. \nAfter the deal for the FT was done in double-quick time, it is understood arrangements are being hastily made for Mr Kita and Mr Okada to visit the title’s London headquarters to see what they have bought. Mr Kita, despite having worked for Nikkei in New York, said when the deal was announced his English was not good enough to make the FT a daily read. \nSomewhere near the top of their to-do list will be to seek new offices. The FT’s landmark building on the Thames will be retained by Pearson. Nikkei has a temporary tenancy agreement but is already understood to be beginning a property search likely to be complicated by planning restrictions on the current offices. \nMr Kita has publicly promised that Nikkei will not seek to change the culture or journalism of the FT. But staff are wondering whether they might be allowed to become shareholders alongside their Japanese colleagues, or whether they will be second-class citizens, like Nanana the banana. \nThe men who bought the FT \nTsuneo Kita, Chairman Mr Kita joined Nikkei as a graduate in 1971, working his way up through the newsroom. He was elevated to chairman this year after serving as the company’s top executive as the digital wave hit Japan’s media industry. \nThe 69-year-old is said to have had his eye on the FT for several years, aware Nikkei’s tentative steps into the age of digital, global media require a major acceleration. \nHe enjoys ready access to political leaders. Japan’s Prime Minister, Shinzo Abe, often dines with him at a French restaurant in Tokyo. \nNaotoshi Okada, President Mr Okada replaced Mr Kita as chief executive in February. Aged 62, he has spent his entire career at the company since graduating from the University of Tokyo’s law faculty in 1976. \nIn 2004, he was promoted from reporter to deputy managing editor of the company’s flagship paper. He has since risen through the ranks, working on Nikkei’s fledgling digital business and becoming editor-in-chief. \nBefore taking the top executive role he was in charge of Nikkei Asian Review, which has struggled to gain profile since its launch in 2013.", "external_links": [], "published": "2015-08-01T19:01:00.000+03:00", "crawled": "2015-08-01T19:59:50.058+03:00", "highlightTitle": ""}