{"organizations": [], "uuid": "cd712761ca18f6e34797fa7adcd75f2c6f1a9b89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/120652/money", "section_title": "Money: Personal Finance, Business, Small Business news features - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29834469/fed-at-july-meeting-appeared-to-be-moving-closer-to-hike", "country": "US", "title": "Fed at July meeting appeared to be moving closer to hike", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Fed at July meeting appeared to be moving closer to hike - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "cd712761ca18f6e34797fa7adcd75f2c6f1a9b89"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29834469/fed-at-july-meeting-appeared-to-be-moving-closer-to-hike", "ord_in_thread": 0, "title": "Fed at July meeting appeared to be moving closer to hike", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MARTIN CRUTSINGER\nAP Economics Writer WASHINGTON (AP) - Federal Reserve officials in their July discussions appeared to move closer to their first interest rate hike in nearly a decade but expressed wide-ranging concerns about wages, inflation and a significant slowdown in China.\nMinutes of their July 28-29 discussions released Wednesday show that officials believed they were nearing their goals on employment. But they were split on whether inflation had climbed enough to justify a rate increase.\n\"Members generally agreed that additional information on the outlook would be necessary before deciding to implement an increase in the target range,\" the minutes said.\nThe details of the Fed's deliberations come four weeks before it gathers next for what could be a pivotal meeting. The central bank has kept a key rate that it controls at a record low near zero since December 2008.\nWith the unemployment rate at a seven-year low of 5.3 percent, analysts have been eyeing a rate increase at the September 16-17 meeting. But many private economists said the minutes did little to clear up the Fed's intentions.\n\"While September remains on the table, there is little indication that officials are champing at the tightening bit,\" said Sal Guatieri, senior economist at BMO Capital Markets. \"While the Fed seems confident in achieving its employment mandate, it remains unsure about hitting the inflation goal.\"\nInflation has been below the Fed's 2 percent target for annual price increases for more than three years.\nOn China, Fed officials did not believe recent declines in the Chinese stock market would hurt growth in the world's second-largest economy. But \"several participants noted that a material slowdown in Chinese economic activity could pose risks to the U.S. economic outlook.\"\nSince then, the situation in China has grown more worrisome.\nChina on Aug. 11 announced the biggest devaluation of the yuan in two decades, a decision that roiled global markets. The action has raised new concerns about the dollar, which has been rising in value for a number of months. A stronger dollar can act as a drag on the U.S. economy by expanding America's trade deficit, as U.S. exports become less competitive in overseas markets and foreign goods take greater market share in the United States.\nThe minutes said that Fed officials discussed the risks posed by a divergence in interest rates, which would occur if the Fed began raising rates while central banks in other nations kept their rates low. The Fed minutes said that this could lead to a further strengthening of the dollar, which could further hurt U.S. exports and drag oil prices even lower.\nFed officials also noted that the job market still had room for improvement, particularly on the wage front.\n\"The ongoing rise in labor demand still appeared not to have led to a broad-based firming of wage increases,\" the minutes said.\nThe minutes, which were released with the customary three week delay following the last meeting, showed that officials did decide to make a move to provide more clarity about the economic forecasts the central bank releases four times a year.\nFed officials have decided to publish the forecasts on growth, employment and inflation by showing the median value for each economic variable, which will be derived from all of the projections submitted by Fed officials. Currently, the forecasts include a \"central tendency\" that is determined by excluding the bottom three forecasts and the top three forecasts for each variable.\nThe minutes said Fed officials believed using the median for each forecast would provide a \"more robust summary\" of where most officials believe the economy is headed.\n___\nThis story has been corrected to show that the Fed minutes were based on its July meeting, not June.\n ", "external_links": [], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-19T23:41:36.685+03:00", "highlightTitle": ""}