{"organizations": [], "uuid": "2dd000dcadacf7e0523dc74a7a20381c41d80a9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/a/c/r/m/image.related.afrArticleLead.620x365.gja8h1.png/1440753281140.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/chanticleer/gordon-cairns-told-how-to-fix-woolies-20150828-gja8h1", "country": "AU", "title": "Gordon Cairns told how to fix Woolies", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Gordon Cairns told how to fix Woolies | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T16:43:00.000+03:00", "replies_count": 0, "uuid": "2dd000dcadacf7e0523dc74a7a20381c41d80a9c"}, "author": "Post to Linkedin", "url": "http://www.afr.com/brand/chanticleer/gordon-cairns-told-how-to-fix-woolies-20150828-gja8h1", "ord_in_thread": 0, "title": "Gordon Cairns told how to fix Woolies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gordon Cairns is set to breathe new life into Woolworths and is initially going to focus on the Masters brand. David Rowe Share on twitter by Tony Boyd New Woolworths chairman Gordon Cairns has no preconceived ideas about how to fix a company that serves 28 million customers every week and is owned by more than 430,000 retail investors.\nBut the fact that he has an open mind about dealing with its problems marks a dramatic change from the position that prevailed under former chairman Ralph Waters.\nCairns admits that his top three priorities when he did his due diligence on the Woolworths business were: the supermarkets business; the Big W discount department store; and the Masters Home Improvement chain.\nHe spent about 70 per cent of his time studying the supermarkets, which makes sense considering food and liquor accounted for $42 billion of the company's $60 billion in sales in the year to June, 2015.\nThe supermarkets lost momentum in like-for-like comparative sales under chief executive Grant O'Brien, who blamed that partly on the lack of quality data about customer shopping habits.\nThat startling recent admission from outgoing CEO Grant O'Brien goes to the heart of the problem facing Woolworths. Its management has become too remote from its customer base.\nPaul Simons, a retailing legend and one of the most successful CEOs in Woolworths' 91-year history, says this remoteness and disconnection from customers can be blamed on the company's decision many years ago to centralise all senior management at a purpose-built headquarters on the outskirts of Sydney.\nAbandon Bella Vista HQ The Bella Vista head office, which was the brainchild of former chief executive Roger Corbett, needs to be abandoned, according to Simons. Bella Vista is like a small self-sufficient economy. It has restaurants and all the usual facilities found in a shopping centre, including its own supermarket.\nAt one stage it was going to have its own hotel and Woolworths university but that idea was thankfully abandoned.\nSimons, who took Woolies from a loss of $13 million in 1987 to profits of $550 million in 1995, says Bella Vista was the source of two key problems at Woolies.\nThe first problem was the removal of the autonomy of divisional business heads. This made it more difficult for executives to develop their leadership skills. That, in turn, harmed the nurturing of talent for succession planning.\nThe outcome of that failure was the appointment of executives who were not CEO material, Simons says.\nThe second problem caused by Bella Vista was the lack of time spent by executives actually walking through supermarkets.\nSimons might have left Woolies in 1995 but he has kept in close touch with former senior executives of the company.\n'Too many meetings' After Tjeerd Jegen left the company in February this year, after four years as the head of food and liquor, he had a chat to Simons.\n\"He told me he left because he couldn't do his job,\" Simons says. \"There were too many meetings being held at Bella Vista.\"\nBut when Chanticleer put the head office issue to Cairns on Friday he said that was a second-order priority.\nHe says his first priority is to find a new CEO to replace O'Brien.\nOutgoing chairman Waters told analysts on Friday that the CEO search is \"well progressed\". He says the board started with a long list, reduced that to a short list and the next stage will be interviewing candidates.\nThe analyst briefing on Friday included a shellacking of the company's hardware strategy from leading analyst David Errington from Bank of America Merrill Lynch.\nHe hammered the company's management about the allocation of capital to the Masters business.\nCompany to review Masters He pointed out that arch rival Bunnings, which is owned by Wesfarmers, had sales growth of $1 billion and that this growth was greater than the entire Masters business.\nErrington says the Masters business probably needed a 100 per cent uplift in sales for stores to break even, let alone get a decent return on capital.\nWhen O'Brien was challenged about the destruction of capital in Masters, the outgoing CEO said the company was still reviewing the capital going into Masters. The plan was to spend $600 million over the next three years. The Masters joint venture with Lowe's of the US has absorbed about $3 billion in capital. It lost $245 million in the year to June before interest and tax.\nWhile Errington is adamant that Masters must be sold, the retailing guru Simons says that may not be the best option.\nSimons says Woolies should not repeat the mistake made with the sale two years ago of the Dick Smith Electronics chain, which was sold for peanuts and then relisted on the market. That deal delivered a $400 million profit to the buyers of the business.\nSimons says Woolies should get the right management into Masters and Big W and turn the businesses around under its own ownership. That line of thinking is the same approach being taken by Wesfarmers with its troubled discount store Target.\nSimons says that if Bunnings only has 17 per cent of the $45 billion hardware market, then there must be an opportunity for a well-run competitor to capture market share and profits.\nCairns a headache for Wesfarmers The arrival of Cairns at Woolies presents a potential headache for Wesfarmers.\nOne analyst said it was concerning for Coles that its performance had not been better, given how bad the Woolies supermarket result had been.\nHe pointed out that Woolies would be forced to take drastic action to recover ground.\nThe analyst added that Coles was not in as strong a position as he would have hoped. He said Coles didn't have a significant edge in terms of profit –noting they had only done EBIT growth of 6.5 per cent compared with like-for-like sales of 4 per cent.\nSimons says the two other issues that need urgent attention at Woolies are its advertising strategy and its pricing policies. He says it needs to restore its reputation for low everyday prices.\nCairns does not want to dwell on all the mistakes and failures that brought Woolies to the point where it needed an urgent management shake up and a new chairman to possibly oversee a new strategic direction.\nOne thing is for sure: Australian retailing is a very small world. Cairns first met Simons when they were both walking down a supermarket aisle in the 1980s.\nTony Boyd\nTwitter: @TonyBoydAFR\nTony.boyd@afr.com.au", "external_links": ["https://twitter.com/TonyBoydAFR"], "published": "2015-08-28T16:43:00.000+03:00", "crawled": "2015-08-29T12:03:59.052+03:00", "highlightTitle": ""}