{"organizations": [], "uuid": "e94b74566470b36b329f0d475adde4491b6c7903", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508101837.html", "country": "US", "title": "Nigeria: 50 Percent of Insurance Firms On Sale Block", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Nigeria: 50 Percent of Insurance Firms On Sale Block", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T14:26:00.000+03:00", "replies_count": 0, "uuid": "e94b74566470b36b329f0d475adde4491b6c7903"}, "author": "", "url": "http://allafrica.com/stories/201508101837.html", "ord_in_thread": 0, "title": "Nigeria: 50 Percent of Insurance Firms On Sale Block", "locations": ["Nigeria", "Ogun"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: Police Orders Shoot-At-Sight On Cultists, Ritualists in Ogun \nMajority of the insurance companies are believed not to be adequately capitalised to meet their primary obligations of claims settlement, a development, which has partly eroded public confidence in insurance products. \nHowever, Bayode said such mergers were needed to stimulate the sector. According to him, \"I don't think there's so much negative implications for the industry as far as I am concerned. First of all, an economy that'll develop, a sector that would contribute positively to the Nigerian economy needs direct foreign investment. \n\"But you now find out that most of the insurance companies we have are not as capitalised as we had thought in terms of the cash in those companies and the reserves that you have to turn around the fortunes of the companies and operating above the minimal acceptable cash and risk ratio.\" \nThe NICON Insurance boss said the injection of fresh funds and change of ownership structure would help make insurance companies more competitive in the country and in Africa in general. \nHe said: \"So it would mean one thing especially for the owner-managed companies-and this is clearly my opinion-the owner managed companies would not want to see themselves beyond as people have seen them from the outside. \n\"Some other managers would want to hold on to their shares to the detriment of the liquidity of the company; therefore, why don't you give up parts of these shares and let some other people pay for it and bring in the much needed cash for innovation, IT, claims payment and staff training and welfare and all that-so we know that the more the merrier, so if we have a lot of other investors coming outside Nigeria and being interested in the insurance industry, it's a plus for us.\" \nHe added: \"So almost all of them that are up for sale, to me I think it's a welcome development-let the owner-managers keep a little bit of what they have as equity and then free up the space for huge foreign investment to come into their companies so much so that'll be highly liquid and highly capitalised. \n\"Then they can compete impressively well not only within Nigeria but within the West African sub region and even compete effectively well the African space and even internationally-so that's my own opinion in terms of the sale and injection of of funds into some insurance companies.\" Nigeria \nPresident Barack Obama's widely-publicised remarks in Addis Ababa on African presidents who refuse to step down when … see more » Copyright © 2015 This Day. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-10T14:26:00.000+03:00", "crawled": "2015-08-10T14:57:09.380+03:00", "highlightTitle": ""}