{"organizations": [], "uuid": "81ebdbfd99790f5fa63d1c79b21d2e3cff42faf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/forex/wp-content/uploads/sites/8/2015/08/Flag_of_Nigeria880x400.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/forex/analysis/the-reality-of-forex-trading-in-nigeria/", "country": "US", "title": "The Reality of Forex Trading in Nigeria", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "The Reality of Forex Trading in Nigeria", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T13:20:00.000+03:00", "replies_count": 0, "uuid": "81ebdbfd99790f5fa63d1c79b21d2e3cff42faf1"}, "author": "", "url": "http://www.financemagnates.com/forex/analysis/the-reality-of-forex-trading-in-nigeria/", "ord_in_thread": 0, "title": "The Reality of Forex Trading in Nigeria", "locations": ["Nigeria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Reality of Forex Trading in Nigeria The Reality of Forex Trading in Nigeria \"The statistics of about 500,000 traders in Nigeria being pelted on the internet is not bloated. We likely had more!\" Advertising Print This Post \nThis article was written by Fowope mike, who is the country director of FXDM Financial Services (FXDMTrader), Nigeria office. \nForex trading started in Nigeria around 2004. It wasn’t initially embraced by Nigerians back then mostly because, Nigerians prefer doing tangible business and moreover the infrastructure (internet connection and electricity) was relatively poor. \nThe emergence of ponzi schemes by some unregulated financial institutions gave forex trading massive popularity! These financial institutions accepted funds from investors with the promise of giving monthly return on investment to the tune of 8.3%. This was huge!! Most investors diverted their investments from the banks to these ponzi schemes – that was making a wave in the country. \nNigerians marvelled about the returns and discovered upon investigating that those funds running into billions of dollars were actively trading in the forex market!! Kabum! Nigerians (mostly retail traders) decided to take the bull by the horn and launched deep into unknown and untested terrain. The result was massive failure . \nDiscovering this trend, the first set of people that got their fingers burnt trading, turned into trainers and also brought about an influx of foreign forex brokers in Nigeria. For example Alpari, Liteforex, Instaforex and many others. The influx of foreign brokers also helped in popularising forex because they embarked in a national campaign, going into various cities, educating investors and on-boarding clients in thousands. Another factor that contributed to this wave was that Nigerians needed not pay huge bank charges in moving their money to offshore brokers as they have several here. Fowope Mike, country director Nigeria, FXDMTrader \nThis wave peaked at 2010 and suddenly there was a gradual withdrawal of traders from the business because of the unprecedented loss and confidence in the business waned gradually. The crash of the local stock market also contributed to this as liquidity dried up in the financial system. \nTo be candid, the statistics of about 500,000 traders in Nigeria being pelted on the internet is not bloated. We likely had more! But this number has dwindled over the years due to monumental loss suffered by traders to the extent that 30% of those figure actively trading can’t be guaranteed. \nThe Association of On Line Forex Trading Agents, A group of On Line Foreign Currency trading brokers in Nigeria has started the initiation to restore lost confidence by engaging various government agencies to see to the regulation of the business. \nTheir plea is already getting the required attention as some of its representatives were invited by joint team of SEC (Securities and Exchange Commission) and CBN (Central Bank of Nigeria) for a meeting on how FX trading can be regulated in Nigeria. We strongly believe that the market will take a new shape, attracting institutional players when the government regulates the industry.  ", "external_links": [], "published": "2015-08-03T13:20:00.000+03:00", "crawled": "2015-08-03T10:30:23.895+03:00", "highlightTitle": ""}