{"organizations": [], "uuid": "e3dcc91f55d0c9790ff08ce730c2b889e9c351c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/tycoon-rescue-cheaper-china-floods-023529833.html", "country": "GB", "title": "Tycoon to the rescue as cheaper China floods Vietnam's economy", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Tycoon to the rescue as cheaper China floods Vietnam's economy", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T05:35:00.000+03:00", "replies_count": 0, "uuid": "e3dcc91f55d0c9790ff08ce730c2b889e9c351c9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/tycoon-rescue-cheaper-china-floods-023529833.html", "ord_in_thread": 0, "title": "Tycoon to the rescue as cheaper China floods Vietnam's economy", "locations": ["China", "Vietnam"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Aug 30, 2015, 04:48 BST - UK Markets closed Tycoon to the rescue as cheaper China floods Vietnam's economy Reuters – 1 hour 12 minutes ago Print \nBy Martin Petty \nHANOI (Reuters) - Soldier-turned-tycoon Nguyen Huu Duong is a fierce patriot still fighting to protect his country, four decades after battling American forces in the Vietnam War. \nThe construction mogul has amassed a war chest of tens of millions of dollars to fight for greater independence for Vietnam's economy and counter an invasion of a different kind: Chinese goods. \nRapid growth in Vietnam is masking a chronically ill small-business sector that the rags-to-riches entrepreneur says is suffocated by a multi-billion dollar influx of cheap, mass-produced goods from China, under-cutting domestically produced items. \nDuong has a rescue plan he says isn't a swipe at China, but a nurturing of startups, enticing them with free 50-year leases in his Hanoi mall \"V+\" - if they sell only Vietnamese-made products. \nHe is lobbying the government to introduce the model nationwide to stem the closures of tens of thousands of businesses each year and encourage customers to go local. \n\"China exports to the world at very, very low prices and that's put huge pressure on the Vietnamese economy and production,\" Duong told Reuters. \n\"I'm a businessman, I understand why firms can't develop. Without this kind of thing, Vietnamese businesses will perish.\" \nVietnam's dependence on its giant neighbour and biggest trade partner is resented by a population embittered by a history of perceived bullying and territorial incursions. \nRelations soured in 2014 when Beijing started oil drilling in disputed waters, triggering the kind of nationalist rage that puts Vietnam's rulers in a tricky spot. A strong rebuke might satisfy the public and party progressives, but could anger a neighbour capable of holding its economy hostage. \nThree-quarters of their annual $60 billion trade is made up of Vietnamese imports from China and many experts consider that understated. That flow barely registers in China, worth just 0.65 percent of its $2.3 trillion in exports in 2014. \nThe yuan devaluation has triggered domestic fears of China flooding Vietnam with even cheaper goods, forcing its central bank to go on the defensive by devaluing its dong currency and widen its trading band twice in six days. [ID:nL3N10U1R6] \nRESCUE MISSION \nFormer rickshaw driver Duong, 61, knows hard times and having prospered from his Hoa Binh brewery and construction empire, he has vowed to spend half of his fortune helping Vietnam build a small-business bedrock. \nDubbed \"Duong Beer\", he says he spent $27 million on the V+ mall, which opened in February. It reduces overheads to slash prices and sells everything from handbags and shoes to nuts and ornaments. Its supermarket undercuts foreign rivals like Big C and the first V+ shop has just opened on a Hanoi street, selling baguettes with omelettes and pate. \n\"Prices are good, quality is good. This must be one of the cheapest places in Southeast Asia,\" said Duong. \nDoan Duy Khuong, vice president of the Vietnam Chamber of Commerce and Industry, said the trade imbalance \"plagued policymakers and businesses\" and stifled domestic competition. \nDespite Vietnamese disdain for Chinese products, their prices make them unavoidable when businesses lack capital and household budgets are modest. \nSporadic calls for boycotts fail miserably. \nDominic Mellor, an economist at the Asian Development Bank, said the V+ concept showed good intentions but the government should educate firms and nurture those in its most competitive sectors. \n\"There needs to be a change in mindsets and reassessment of the government's role, with targeted business development support,\" he said. \n\"It needs to move away from blanket subsidies towards targeted subsidies for industries and businesses able to compete and integrate into the global value chain.\" \nOn a macro level, Vietnam's is manoeuvring to wean its economy off China, cosying up to Japan, South Korea Europe and the United States and chasing free trade accords with more than 60 markets, including a Trans-Pacific Partnership covering a third of global trade. \nDuong's mall is popular. Its first two floors are full and space being prepared on three others is booked. He says it's just a beginning. \n\"Vietnamese businesses are dying, we need to do something,\" he said. \"We're a nation that defeated two superpowers. I don't want this to be a nation of labourers working for others.\" \n(Additional reporting by Mai Nguyen and My Pham; Editing by Robert Birsel)", "external_links": [], "published": "2015-08-30T05:35:00.000+03:00", "crawled": "2015-08-30T06:52:32.041+03:00", "highlightTitle": ""}