{"organizations": ["Qantas"], "uuid": "d7fd4e9ed14fb268461eaab235db14aafb86ac8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/VEsI9ZOq._UImD_XBsHfUw--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/75469e47658bffb1d4a6be75bbd8304df91c6ad6_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Top stories from Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/australian-carrier-qantas-roars-back-231136076.html", "country": "GB", "title": "Australian carrier Qantas roars back into black", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Australian carrier Qantas roars back into black", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T05:10:00.000+03:00", "replies_count": 0, "uuid": "d7fd4e9ed14fb268461eaab235db14aafb86ac8b"}, "author": "", "url": "https://uk.finance.yahoo.com/news/australian-carrier-qantas-roars-back-231136076.html", "ord_in_thread": 0, "title": "Australian carrier Qantas roars back into black", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 20, 2015, 03:38 BST - UK Markets open in 4 hrs 22 mins Australian carrier Qantas roars back into black By Martin Parry | AFP – 27 minutes ago View Photo \n\nAustralian carrier Qantas on Thursday roared back into the black in a stunning turnaround of fortunes driven by aggressive cost-cutting, while placing an order for eight Boeing Dreamliners. \nThe airline posted a Aus$557 million (US$409 million) annual net profit in the year to June 30, a sharp recovery in the space of 12 months from a Aus$2.84 billion net loss in the previous corresponding period. \nUnderlying profit before tax -- Qantas' preferred measure of financial performance, which excludes one-off costs and write-downs -- was Aus$975 million, compared to a Aus$646 million loss in 2014. \nQantas said its cost-cutting programme had helped save Aus$894 million over the year and allowed it to pay down debt, while lower fuel prices also helped bolster the bottom line with every segment making healthy profits. \nNo dividend was declared but the airline announced a one-off 23 cents per share capital return to shareholders, amounting to Aus$505 million. \nChief executive Alan Joyce hailed it as \"one of the biggest turnarounds in Australian corporate history\". \n\"This transformation has been all about getting our foundations right. Being smarter with our costs; faster with our decisions; more productive with our assets. And on these stronger foundations, we can build a much stronger Qantas,\" he said. \n\"The logic from the beginning was to front-end the tough decisions so the group could reshape its operations as rapidly as possible for long-term, sustainable growth in earnings and shareholder value.\" \nThe reversal in fortunes appeared to vindicate his strategy to slash Aus$2.0 billion in costs, cut routes, freeze growth at Asian offshoot Jetstar, and axe 5,000 jobs to help counter a price war with domestic rival Virgin Australia. \nThe company's shares, which have rallied strongly over the past 12 months, were 2.93 percent higher at Aus$3.87 in morning trade. \nJoyce added that the purchase of the eight new planes highlighted the scale of the airline's turnaround and signalled a new phase of growth. \n\"We are halfway through the biggest and fastest transformation in our history,\" he said. \n\"Without that transformation, we would not be reporting this strong profit, recommencing shareholder returns, or announcing our ultra-efficient Dreamliner fleet. \n\"We have reshaped our business for a strong, sustainable future ?- and because we moved quickly and made tough decisions early, we have strong foundations to build on.\" \n- Right aircraft for Qantas - \nQantas' under-pressure international arm reported underlying profit of Aus$267 million, a significant turnaround from the Aus$497 million loss in the previous financial year and its first profit since the global financial crisis. \nThe airline attributed it to improved revenues and better use of aircraft, adding capacity to Los Angeles, Dallas, Vancouver, San Francisco, Santiago, Tokyo and Singapore. \nIts domestic arm also performed well with profit of Aus$480 million compared to Aus$30 million previously, while the freight business also produced stellar figures. \nWhile all of its Jetstar-branded airlines in Asia improved their performance, Qantas wrote off its stake in Jetstar Hong Kong, at a cost of Aus$21 million, after Hong Kong regulator's rejected an application for an operating license in June. \n\"Qantas will make no further investments in Jetstar Hong Kong,\" the carrier said Thursday. \nTo build on its transformation, the company will buy eight new Dreamliners to gradually replace five older Boeing (NYSE: BA - news ) 747s on international routes with delivery from calendar year 2017. \n\"We have looked closely at every aspect of the Dreamliner and it's the right aircraft for Qantas' future,\" said Joyce. \n\"The key reason we chose this particular aircraft is its incredible efficiency. Its new technology will reduce fuel burn, cut heavy maintenance requirements and open up new destinations around the globe. \n\"Because the 787 is smaller than the jumbos it will gradually replace, it gives us the flexibility of having more aircraft without significantly changing our overall capacity.\"", "external_links": [], "published": "2015-08-20T05:10:00.000+03:00", "crawled": "2015-08-20T05:43:37.205+03:00", "highlightTitle": ""}