{"organizations": [], "uuid": "fb77bbbeb12446bf96679bb819bad0881078eaad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/m/4/i/n/image.related.articleLeadwide.620x349.giniv9.png/1438345895686.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2550/consumer-discretionary/retailing", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/comment-and-analysis/improving-tradie-training-will-stop-us-going-down-the-toilet-20150730-giniv9.html", "country": "AU", "title": "Improving tradie training will stop us going down the toilet", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Improving tradie training will stop us going down the toilet", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "fb77bbbeb12446bf96679bb819bad0881078eaad"}, "author": "", "url": "http://www.smh.com.au/business/comment-and-analysis/improving-tradie-training-will-stop-us-going-down-the-toilet-20150730-giniv9.html", "ord_in_thread": 0, "title": "Improving tradie training will stop us going down the toilet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia needs tradies and that means training. Photo: Jessica Shapiro\nThere has been some discussion this week about women in politics and once again, if we want to know how we are actually faring on this and many other important matters, we need to look overseas and sometimes right under our noses.\nThis week the former trade minister in the SBY Indonesian government, Mari Pangestu, was in Australia to deliver an address in Canberra to celebrate the 50th anniversary of the Indonesia Project at the ANU. She was the first female Chinese Indonesian to hold a cabinet position in Indonesia and has a degree from the ANU as well as a PhD in economics from the University of California.\nIf we don't keep up our training in these skills, the only thing that will stop us going down the toilet will be the fact that it's blocked.\nI've written before about the importance of our relationship with Indonesia, especially given the growth trend of the Indonesian economy. It is now the 17th biggest economy in the world and while we are the 13th, within 10 years it will be twice our size, standing as the seventh largest economic generator on the planet. Plainly our two countries need to be close.\nIllustration: Cathy Wilcox\nAnd perhaps Indonesia knows this better than us. In answering a question about how we can help each other, the former trade minister said, \"Quite simple. Help us replicate your outstanding system of TAFE colleges.\"\nAs we all know, these are the places that produce some of the most important people in the world.\n\"Try getting a plumber at the moment to unblock your toilet\" says Louise, who's been coming into the office uncommonly early for more than a week.\nTradies are a rare breed and we don't have enough of them. In recent times our education policies have had a big focus on elite universities and there's nothing wrong with that in itself, but our international neighbours look enviously at our TAFE system. An Indian delegation expressed the same interest and need to the Victorian Premier about a month ago.\nSo I've had a look to see what we were doing and unfortunately we have been really stupid. Funding per student was cut by 25 per cent between 1999 and 2007 and the general consensus is that the present system is dysfunctional. In 2012, then premier Barry O'Farrell announced $1.7 billion in cuts to education, heavily hitting TAFE.\nIn Victoria the TAFE sector lost $268 million in government funding from 2011 to 2014 and the hugely unpopular Newman government in Queensland was widely criticised for proposals to close 38 out of 82 TAFE campus. Fortunately the people of Queensland spoke before it could happen.\nIt's worth us all remembering the simple fact that trade qualifications mean less unemployment. Some 6.1 per cent of people with trade qualifications are jobless compared to 8.9 per cent who finished high school to the highest level and an unfortunate 12.5 per cent who didn't finish high school at all.\nBut things are happening.\nIn Victoria, the Andrews government has put $320 million into the system. The federal government has taken the job away from the minister for manufacturing and picked out the very bright Simon Birmingham to become the Assistant Minister for Education and Training. Birmingham is a star and as my good friend Peter Noonan at the Mitchell Institute at Victoria University says, all education solutions need the highest levels of federal and state government co-operation. Two things in particular are needed in the sector. One is a lift in the level of community acceptance and status of TAFE qualifications and the other is getting employers on board.\nIt was nearly 10 years ago that the federal government started a TAFE initiative through the Pacific Islands, introducing skills certificates so that the youth of Samoa, Fiji and their neighbours could get the training that is needed for developing countries. The great nations of Indonesia and India are reminding us that we have been losing the plot. They know that TAFE colleges are vital for any economy no matter what stage it has reached in its development.\nMore power to Birmingham and the states that are responding. Our neighbour's needs have simultaneously revealed a failure and shown us an opportunity. Put simply, if we don't keep up our training in these skills, the only thing that will stop us going down the toilet will be the fact that it's blocked.", "external_links": [], "published": "2015-08-01T03:00:00.000+03:00", "crawled": "2015-08-01T09:09:22.539+03:00", "highlightTitle": ""}