{"organizations": [], "uuid": "d65e2b330e41c6443fac3f22421136bb5db6bfa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/17/markets-forex-idUSL3N10S1GW20150817", "country": "US", "title": "FOREX-Dollar tries to shake off yuan scare, yen shrugs off Japan's GDP slump", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "FOREX-Dollar tries to shake off yuan scare, yen shrugs off Japan's GDP slump | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T08:13:00.000+03:00", "replies_count": 0, "uuid": "d65e2b330e41c6443fac3f22421136bb5db6bfa3"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/17/markets-forex-idUSL3N10S1GW20150817", "ord_in_thread": 0, "title": "FOREX-Dollar tries to shake off yuan scare, yen shrugs off Japan's GDP slump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar supported as focus shifts to Fed rate hike\n* Yen shows muted response to Japan Q2 contraction\nBy Hideyuki Sano\nTOKYO, Aug 17 (Reuters) - The dollar held firm on Monday as traders looked to prospects of a U.S. rate hike next month, while the yen was little moved after data showed Japan's economy shrank in the April-June quarter.\nThe dollar's index against a basket of six major currencies edged up slightly to 96.716 , extending its recovery from a one-month low of 95.926 hit on Wednesday.\nThe U.S. currency is slowly recovering from the damage it suffered last week after a surprise decision by the People's Bank of China to devalue the yuan.\nBeijing's move had raised concerns that a cheaper yuan would hurt the U.S. economy and make it difficult for the Federal Reserve to raise rates.\nThe Chinese yuan was little changed on Monday after China's central bank set the yuan slightly above its fixing rate on Friday. The move appeared to a further attempt to soothe global market fears that Beijing is intent on a bigger devaluation.\n\"The market is gradually calming down. We still think the yuan has been overvalued and an adjustment in the yuan was necessary,\" said Bart Wakabayashi, head of forex at State Street Global Markets.\nA mixed batch of U.S. data on Friday provided little clarity on whether the Fed will raise interest rates in September.\nIn July, U.S. producer prices increased for a third straight month, and factory production rose at its strongest pace in eight months, the U.S. government said.\nThose figures were somewhat offset by a surprise deterioration in the University of Michigan's index on U.S. consumer sentiment.\nWith the dollar generally well bid, the euro traded at $1.1089, down 0.2 percent from late U.S. levels and off last week's one-month high of $1.1215.\nAgainst the yen, the dollar was little changed at 124.37 yen , capped by strong resistance in the 125-126 area.\nBank of Japan Governor Haruhiko Kuroda said in June that he did not see reasons for the yen to weaken further from those levels.\n\"The dollar/yen has tested those levels many times and failed to break through... For the moment, I suspect the dollar will go back and forth between 123 and 125,\" said State Street's Wakabayashi said.\nData from the U.S. financial watchdog showed on Friday that speculators increased their yen short positions in the week to last Tuesday to more than 100,000 contracts, the highest level since eight-month high touched in June.\nThat suggests many speculators will likely need to buy back the yen in the future.\nThe Japanese currency was little moved after data showed Japan's GDP contracted an annualised 1.6 percent in the April-June quarter from January-March.\nThat was slightly better than economists' average forecast of a 1.9 percent fall but still bad news for policymakers who have been struggling for two years to lift the economy out of deflation.\nMarket watchers are divided over whether the BOJ will announce more policy easing in October. That could put the onus more on the government to offer more fiscal support.\nWhile most major currencies held steady, traders kept an eye on wobbly emerging market currencies, many of which continue to suffer from concerns over capital outflow due to the prospects of higher U.S. interest rates and slowdown in China.\nIn Asia, the Malaysian ringgit fell 0.7 percent, flirting with its 17-year low as it is hit by fall in oil prices.\nPolitical instability in Turkey and Brazil could rock their respective currencies , both already trading near multi-year lows.\nSome say weakness in these currencies could encourage investors to shun risk assets, possibly helping safe-haven currencies such as the yen and the Swiss franc.\n(Editing by Shri Navaratnam & Kim Coghill)", "external_links": [], "published": "2015-08-17T08:13:00.000+03:00", "crawled": "2015-08-17T07:30:35.367+03:00", "highlightTitle": ""}