{"organizations": [], "uuid": "b1e10e82395b7264b4f90b1d954bd8f392a77017", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/financing/", "section_title": "Forbes - Financing Information and Financing News - Forbes.com", "url": "http://www.forbes.com/sites/moiravetter/2015/08/26/crowdfunding-elio-motors-crowdfundx-30-million-dollars/", "country": "US", "title": "Crowdfunding: Elio Motors, CrowdfundX And $30 Million", "performance_score": 4, "site": "forbes.com", "participants_count": 1, "title_full": "Crowdfunding: Elio Motors, CrowdfundX And $30 Million", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T11:22:00.000+03:00", "replies_count": 1, "uuid": "a44beec18b9c4b5065a4ec427e7256f816868feb"}, "author": "Moira Vetter", "url": "http://www.forbes.com/sites/moiravetter/2015/08/26/crowdfunding-elio-motors-crowdfundx-30-million-dollars/#post-0", "ord_in_thread": 0, "title": "Crowdfunding: Elio Motors, CrowdfundX And $30 Million", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Several weeks ago I wrote a piece about crowdfunding and how potentially difficult the process might be for run of the mill entrepreneurs. By run of the mill, I meant people needing under $1 million to get to their next step. I got some good feedback, but I wasn’t prepared for the amazing story of Elio Motors and its crowdfunding agency CrowdfundX. [entity display=\"Buckle\" type=\"organization\" subtype=\"company\" active=\"true\" key=\"buckle\" ticker=\"BKE\" exchange=\"NYSE\" natural_id=\"fred/company/6714\"]Buckle[/entity] in, because this is really something. What is Elio Motors? You’ve probably been hearing the buzz about Elio Motors of late. That’s not an accident. They have a phenomenal team. What's better, they have a tremendous design for a car that gets 84 miles to the gallon. They’re going to make them here in America in an old GM plant and create 1,500 jobs. They are amazing cars to look at and they’re only going to cost $6,800. All of that should have your attention. As I said, it is a great story.[caption id=\"attachment_256\" align=\"\" width=\"960\"] The Elio at Sundance. (Credit: Elio Motors.)[/caption] Great stories don’t tell themselves Paul Elio, engineer and CEO of Elio Motors, knew he had something special...and so did his CMO, Tim Andrews. This smart marketing team had a dream to ‘Alter the course of transportation.’ That’s big.And to do something that big, you need more than a good product and a good story…you need big money. That’s where the Elio team decided to find a partner at the intersection of great storytelling and big money raising. Enter CrowdfundX. Timing is everything Darren Marble, CEO of CrowdfundX had a lot riding on the Elio Motors' campaign. (Just ask his wife who didn’t see him for about a month.) After years in the agency world, and a focus on campaigns to raise awareness and capital, Darren was clear that the core of all successful crowdfunding was an amazing story told amazingly well. Elio had a great story…check. But what was also clear to him was the critical importance of timing in all entrepreneurial pursuits and for Darren (and Elio), that timing was June 19, the day that REG A—the thing that is set to transform crowdfunding—became legal. Big money doesn’t raise itself So Elio Motors and CrowdfundX launched the campaign of all campaigns on June 19, 2015. The marketing people got the story right and told it beautifully. That alone does not raise money. CrowdfundX used the relationships they had nurtured with StartEngine , an accelerator platform, and CrowdCheck, a legal advisory service, to get all their ducks in a row to properly manage the process. (When I was whining about how hard crowdfunding would be a few weeks back, I didn’t know about CrowdfundX.) How many million did you say they raised? So how did they do? It’s been a little over two months and they’ve got expressed interest commitments on $30 million. The next steps, no easy tasks—but likely a lot easier than finding $30 million — are to get the SEC filings prepared and to go back to those who expressed interest with the actual investment opportunity. I’ll definitely check back in as this progresses to let you know how long the process takes and what it looks like.In the mean time, if you’ve got a killer idea and want a boatload of money through crowdfunding, you may want to reach out to someone like CrowdfundX. Or you might just want to pre-order one of those Elios. Maybe the only thing better than picking up a car for $6,800 that goes 84 miles on a gallon, is investing in the company. Thanks guys for opening my eyes to the possibilities of crowdfunding.", "external_links": ["https://www.startengine.com/startup/elio-motors", "https://www.startengine.com/", "http://www.caranddriver.com/photo-gallery/elio-motors-3-wheeler-84-mpg-for-the-price-of-a-decade-old-corolla", "http://www.crowdfundx.io/", "http://www.eliomotors.com/"], "published": "2015-08-27T11:22:00.000+03:00", "crawled": "2015-08-27T18:13:37.461+03:00", "highlightTitle": ""}