{"organizations": [], "uuid": "86a395ac8a50c3924045027925b58e5a160d0a48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.investors.com", "main_image": "http://www1.ibdcd.com/images/IBDicon_309171.png", "site_section": "http://finance.yahoo.com/rss/headline?s=AAP", "section_title": "Yahoo! Finance: AAP News", "url": "http://news.investors.com/081815-767006-media-stocks-downgraded-while-advanced-auto-upgraded.htm?ven=yahoocp&src=aurlled&ven=yahoo", "country": "US", "title": "Disney, Fox Downgraded: Is It The Netflix Effect?", "performance_score": 0, "site": "investors.com", "participants_count": 0, "title_full": "Disney, Fox Downgraded: Is It The Netflix Effect?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T23:27:00.000+03:00", "replies_count": 0, "uuid": "86a395ac8a50c3924045027925b58e5a160d0a48"}, "author": "", "url": "http://news.investors.com/081815-767006-media-stocks-downgraded-while-advanced-auto-upgraded.htm?ven=yahoocp&src=aurlled&ven=yahoo", "ord_in_thread": 0, "title": "Disney, Fox Downgraded: Is It The Netflix Effect?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Fox"], "text": "Stocks Down, Try For Late Comeback; Paycom Back Near Buy Point \nThe decline in major stock averages worsened, but they came slightly off their session lows late Tuesday. The Nasdaq pared a 0.7% loss to 0.5% and the S&P 500 trimmed a 0.4% deficit to 0.2%. Meanwhile, the Dow Jones industrial average continued to fare better with a 0.1% loss. Gains in Home ... 03:05 PM ET Apple Web TV: How many cable channels will make the cut? \nWhat cable channels make the cut and are included in Apple's (NASDAQ:AAPL) expected Web TV service could take on more significance after the recent sell-off in media and entertainment stocks. Apple, it's widely reported, has been in talks with programmers to offer a slimmed-down bundle of TV ... 01:42 PM ET Facebook, EBay, Google Flex Renewed Tech Strength \nThis week's list of leading big-cap issues features emerging strength in technology, some long-time biotech leaders that are holding up well and some food and beverage plays. From the biotech field, Gilead Sciences (NASDAQ:GILD) is building a new flat base with 123.47 buy point. Gilead shares are ... 08/17/2015 06:30 PM ET Media Stocks Steady; Report Dissects Pay-TV Losses \nThe meltdown in media stocks took a breather on Monday though yet another report showed big Q2 subscriber losses for pay-TV companies, especially satellite broadcasters DirecTV Group and Dish Network (NASDAQ:DISH). Media stocks were pummeled after companies reported disappointing Q2 earnings amid ... 08/17/2015 01:21 PM ET Stocks Positive Near Midday; Parexel, Paycom Break Out \nStocks were modestly higher near midday Monday amid mixed economic data after bouncing back from a lower start. The Nasdaq rose 0.3% and the S&P 500 edged up 0.2%. They were off as much as 0.5% and 0.6%, at Monday's lows. The Dow Jones industrial average fell 0.2%. Trade was running mixed in ... 08/17/2015 11:49 AM ET Nailed It: Builders, Home Depot Up On Housing Data \nHomebuilders and home improvement stocks are rallying in the stock market today as July housing starts reached a nearly eight-year high. On top of that positive data, Home Depot (NYSE:HD) reported view-topping second-quarter sales and earnings, and raised its full-year forecast — reflecting ... 02:14 PM ET Wal-Mart Q2 Earnings Miss On Higher Wages, Theft \nWal-Mart Stores (NYSE:WMT) stock slid to a 2 1/2-year low in the stock market today after the retail behemoth reported second-quarter earnings that missed views and it lowered its full-year earnings guidance. Higher labor costs, weaker pharmacy margins, a stronger dollar and increased theft from ... 02:06 PM ET Hain Hires Former New York Top Cop After Fire, Recall \nHain Celestial (NASDAQ:HAIN) reported fourth-quarter earnings in line with Wall Street expectations Tuesday and appointed former New York City Police Commissioner Raymond Kelly to its board. The maker of Celestial Seasonings tea and Soy Dream beverages said that Kelly, who served as police ... 01:29 PM ET TJX Sees Holiday Sales Potentially Shining Bright \nShares of TJX (NYSE:TJX) gapped up to a new all-time high after the off-price retailer came out ahead of second-quarter forecasts, raised full-year comp and EPS guidance, and sounded optimistic about the upcoming holiday season. The parent of T.J. Maxx, HomeGoods and Marshalls said that its ... 01:24 PM ET Can Foot Locker, Hibbett Follow Dick's Lead For Q2? \nDick's Sporting Goods (NYSE:DKS) topped earnings views and boosted full-year guidance Tuesday, but will fellow sportswear retailers Foot Locker and Hibbett be able to do the same when they report second-quarter results Friday? Foot Locker's (NYSE:FL) Q2 earnings are expected to rise 8% to 69 cents ... 12:10 PM ET", "external_links": [], "published": "2015-08-18T23:27:00.000+03:00", "crawled": "2015-08-18T23:44:26.200+03:00", "highlightTitle": ""}