{"organizations": [], "uuid": "8e3122a790b4e78acd479261ff3820ca995fe0e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/enjoy-festival-vibe-talent-t-162832451.html", "country": "US", "title": "As we enjoy the festival vibe, new talent can’t find its voice", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "As we enjoy the festival vibe, new talent can’t find its voice", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T19:28:00.000+03:00", "replies_count": 0, "uuid": "8e3122a790b4e78acd479261ff3820ca995fe0e6"}, "author": "", "url": "https://uk.finance.yahoo.com/news/enjoy-festival-vibe-talent-t-162832451.html", "ord_in_thread": 0, "title": "As we enjoy the festival vibe, new talent can’t find its voice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Aug 1, 2015, 17:30 BST - UK Markets closed As we enjoy the festival vibe, new talent can’t find its voice By Liam Halligan | Telegraph – 2 minutes 2 seconds ago 14,100.00 -100.00 \nThe UK music industry is losing its global reputation as the world-beating talent factory it once was \nIt’s the first weekend of August, so this is a summery column, on a leisure theme. Let me tell you about the economics of music festivals a burgeoning, multi-billion pound sector, in which the UK leads the world. \nThis topic feels appropriate because, by the time you read this, I’ll be at the annual Cambridge Folk Festival, which was first held in 1964. Back then, just 1,400 people attended, the organisers almost broke even and a young American called Paul Simon was on the bill. \nThis weekend, no fewer than 10,000 people have gathered in Cambridge to hear Joan Baez, Peggy Seeger and The Proclaimers. The Cambridge “Folkie” is now one of dozens of music festivals held in the east of England, large and small. They attracted 346,000 visitors between them in 2014, generating £326m of spending at the events themselves and across the region, according to a new report from UK Music, an industry-backed promotional group. \nThroughout the UK as a whole, 9.5m people attended British music festivals and concerts last year, up 34pc since 2011. Over that three-year period, the spending driven by these events surged 24pc from £2.5bn to £3.1bn compared with much slower growth across the economy as a whole. Britain’s booming festival business is contributing disproportionately to the UK’s economic recovery. \nThe range of festivals out there is mind-boggling. At the top of the tree are the iconic events like Glastonbury, which began in 1970 and hosts almost 200,000 annually, and the Isle of Wight Festival, first held in 1968 and attended by 60,000 or so. \nOnce associated with free spirits and hippies, such events are no longer for society’s misanthropes unless they have access to money. Tickets to Glastonbury cost £225 this year and they sold out in 25 minutes. On top of that, punters pay steep prices for almost everything else, such as food, parking and charging their mobile phones. \nWhile enjoying the festival vibe, and to slightly sweeten the high cost of everything else, punters often enjoy free samples of drinks, shampoo or confectionery. The big brands have, in recent years, swamped music events with their advertising livery and products, determined to form part of the happy memories, and social media chatter, of their captive audience. \nApart from the UK mega-festivals, there is a fast-growing range of smaller events, catering to all kinds of tastes. Had I not been in Cambridge this weekend, I could have strutted my stuff at, among others, Farmfest in Somerset, Hertfordshire’s Standon Calling, Richmond Live in Yorkshire, Outcider, Rock Ridge Rumble, Whitenoise, Chilled in a Field or North Wales Blues and Soul. \nIt’s the same story next weekend, with yet more jolly festivals on offer although the one that has caught my eye is Wilderness, held in Cornbury Park, Oxfordshire. There you can listen to a lecture on “Why everything you know about economics is wrong”, go on a Philosophy Walk “ramble, jaunt, mingle and mull” and then experience a “hands-on lesson in deer butchery”. Oh, and they have some pretty good bands too. \nAlmost 40,000 full-time jobs are now sustained by the British music festival industry, according to Music UK, up from just under 25,000 in 2011. The number of overseas tourists travelling here to attend such events, at 550,000, is up 39pc over the same period. British music is legendary around the world, holding a unique place in the development of rock and pop, with UK artists still accounting for one in seven of all albums sold. \nBut why have festivals lately become so popular, attracting vast crowds from here and abroad not just the young and fiery, but increasing numbers of well-heeled, middle-aged revellers too. Why do so many of us head to muddy fields, hopefully to listen to bands in the sunshine, but quite often just to sit in a soggy tent? \nOne reason is the so-called dissociative effects of technology. Not only is most music now sold via digital downloads, there are also fewer and fewer smaller venues where people can regularly have the emotional experience of watching music as part of a crowd. Many of us, meanwhile, are spending more of our lives staring at screens when we’re at work and, particularly, when we’re not. \nBoth trends drive a pent-up desire among even quite casual music fans to absorb a big dose of live music once a year, up close and personal, in the company of like-minded people. And why not if parents, while they are drinking cider or bouncing around in front of a stage reliving their youth, can leave their kids at a three-hour “story-telling session” in a yurt or engrossed in a “flower garland workshop”? \nWhat’s striking, aside from the spiralling growth of British festivals, is the impact on our domestic music industry the quality and worldwide appeal of which underpins not just our burgeoning festival business, but a sizeable chunk of the UK’s broader £80bn-a-year creative industries sector. It may be that the big festivals are inadvertently undermining that quality. \nOver the past 10 years, as downloading has ballooned, sales of recorded music have plunged. According to the BPI, a UK music industry body, income from recorded music in this country fell from £1.2bn in 2004 to just under £700m in 2014. Other revenue streams, meanwhile, have become more important not least the large festivals. \nUp and coming bands, after gigging furiously and getting radio airplay, used to be able to get a record deal giving them enough money to live off and providing time in some cases to establish themselves as headline acts. That allowed wave after wave of bands to come through, embodying the talent and energy that are the hallmarks of Britain’s remarkable diversity. \nThese days, the big labels are much less likely to take chances, so far fewer new acts get a break. New (KOSDAQ: 160550.KQ - news ) acts tend to build their reputations on just one song, shared and played repeatedly across social media. So they can become wildly popular quickly, but just as easily disappear. Bands that do manage to stick around have quite often relied on parental backing meaning some young stars may lack the life experience, and related drive and passion, that has made British bands so globally appealing in the past. \nWhen I was a student in the 1990s, the headline acts at festivals such as Glastonbury, Reading and Knebworth were bands like Oasis and Radiohead, with artists in their mid or late 20s. Not so today. The lack of good bands coming through, cutting albums and developing hardcore fan bases, means the big UK festivals are increasingly relying on older acts, the bankable crowd-pullers that already have big fan bases, built up during the pre-digital days when younger listeners were perhaps more discerning. \nThere is now, therefore, what economists call a “supply-side problem” when it comes to acts to headline at UK music festivals. There simply aren’t enough with sufficient name recognition out there. That means well-established bands, even if their members are in their dotage, can charge vast fees to play during the July-August festival high season which, of course, jacks up ticket prices. \nA few festivals not least Cambridge pride themselves on actively helping new bands. Most don’t. As a result, the UK music industry is losing its global reputation as the world-beating talent factory it once was. \nThat needs to change if we’re to keep our lucrative slot at the top of the rock and pop bill.", "external_links": [], "published": "2015-08-01T19:28:00.000+03:00", "crawled": "2015-08-01T19:31:35.876+03:00", "highlightTitle": ""}