{"organizations": [], "uuid": "f81d017af1fbc7575ea7bd49c3b50245e93bc6fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/download/pic/main/main/csiid/00301721:5b62d1fe3889e57263b87d0b886cf089:arc614x376:w1200.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508251463.html", "country": "US", "title": "Africa: Five Things You Should Know About the 2015 AGOA Forum", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Five Things You Should Know About the 2015 AGOA Forum", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T17:41:00.000+03:00", "replies_count": 0, "uuid": "f81d017af1fbc7575ea7bd49c3b50245e93bc6fe"}, "author": "", "url": "http://allafrica.com/stories/201508251463.html", "ord_in_thread": 0, "title": "Africa: Five Things You Should Know About the 2015 AGOA Forum", "locations": ["Africa", "Uganda"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Uganda: Relief as Export Ban On Unprocessed Minerals is Lifted \n1. Gabon will host the 2015 AGOA Forum in its capital city of Libreville. \nThe 2015 AGOA Forum will be held in Libreville, Gabon. Nominated to host the Forum by African AGOA Ambassadors, Gabon will be the first central African country to host this major economic summit. \nThis year’s conference will consist of the ministerial AGOA Forum from August 26-27, side events sponsored by private sector, civil society, and the African Women Entrepreneurship Program (AWEP) from August 24-25, and a trade exhibition from August 23-27. \nAll the events will take place at the Angondje Friendship Stadium in Libreville. \n2. AGOA is for more than government officials; civic leaders and entrepreneurs are welcome. \nThis year’s AGOA events will bring together senior government officials from the United States including U.S. Trade Representative Michael Froman, Millennium Challenge Corporation CEO Dana Hyde, Assistant Secretary for African Affairs Linda Thomas-Greenfield, and U.S. Ambassador to Gabon Cynthia Akuetteh. \nThey will meet with representatives of more than 39 African countries as well as leading members of civil society, the private sector, and AWEP. \nCivil society organizations and the private sector play a particularly important role in eliminating trade and investment barriers, raising awareness of economic opportunities in Africa, as well as promoting good governance and economic growth in Africa. Embracing this role, on August 24-25 civil society, the private sector, and the AWEP network will organize workshops, networking opportunities, and a trade exhibition where participating entrepreneurs can display their products and services. \n3. Following the new AGOA authorization, the 2015 forum will focus on sustainable trade and investment. \nThis year’s AGOA Forum theme -- “AGOA at 15: Charting a Course for a Sustainable U.S.-Africa Trade and Investment Partnership”-- is especially timely, given Congress’ recent reauthorization of AGOA for an additional 10 years. AGOA’s initial success was met with overwhelming bipartisan support to reauthorize AGOA legislation this year, further demonstrating U.S. commitment to a stronger U.S.-Africa trade relationship and support for the region’s long-term economic growth. \nThe 2015 forum will provide a unique opportunity to celebrate the recent reauthorization of AGOA, take stock of AGOA’s successes over the last 15 years, look to the next 10 years under AGOA, and launch a dialogue on our shared vision for the post-AGOA future of U.S.-Africa trade. \n4. AGOA continues to promote economic development in Africa. \nStatistics support a growing consensus in both Africa and the United States that open trade and increased international investment are critical to spurring economic development and reducing poverty in Africa. \nThe United States first enacted AGOA in May 2000, providing duty-free access to the U.S. market. AGOA has since succeeded in helping eligible nations grow, diversify their exports to the United States, and create employment and inclusive economic growth in sub-Saharan Africa. By 2014 non-oil AGOA trade was valued at $4.4 billion, up roughly 250 percent from 2001; the growth of these non-oil industries has spurred an estimated 300,000 direct jobs in participating countries. \nAGOA is now the cornerstone of U.S. trade relations with the region, with the AGOA Forum serving as a high level engagement that uniquely strengthens U.S.-sub-Saharan African relations in trade and investment, encourages regional economic integration, and facilitates sub-Saharan Africa’s integration into the global economy. \n5. AGOA promotes female CEOs. \nThe new AGOA legislation has an added clause, specifically calling for the “promotion of the role of women in social, political, and economic development in sub-Saharan Africa,” acknowledging the vital role women play as economic and civic leaders across the continent. \nThe efforts of civil society, the private sector, and the African Women’s Entrepreneurship Program (AWEP) also elevate the importance of gender in trade. AWEP, an initiative launched by the U.S. Department of State in July 2010, helps identify and build networks of women entrepreneurs across sub-Saharan Africa able to transform their communities through entrepreneurship.. \nAlongside the private sector and civil society, the Gabon chapter of AWEP will host the AGOA Forum’s AWEP program from August 25-27 with a focus on building strong, export-oriented businesses and preparing African women producers to integrate into regional and global supply chains. \nYou can follow the conversation surrounding the 2015 #AGOAForum online by following @StateDept , @USAID , @USTradeRep , @StateAfrica , @EconEngage , @MCCGov , and @USEmbassyGabon on Twitter. \nYou can also follow along on Facebook for updates from the U.S. Department of State, the Bureau of African Affairs, the U.S. Embassy in Libreville, Gabon, the Millennium Challenge Corporation on Facebook. \nFor more information:", "external_links": [], "published": "2015-08-25T17:41:00.000+03:00", "crawled": "2015-08-26T03:25:04.391+03:00", "highlightTitle": ""}