{"organizations": [], "uuid": "ce4ced88e917850225af807f311883d54a863ee3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508210107.html", "country": "US", "title": "South Africa: NGOs Apply to Intervene in Possible Gold Mine Class Action Suit", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: NGOs Apply to Intervene in Possible Gold Mine Class Action Suit", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T09:36:00.000+03:00", "replies_count": 0, "uuid": "ce4ced88e917850225af807f311883d54a863ee3"}, "author": "", "url": "http://allafrica.com/stories/201508210107.html", "ord_in_thread": 0, "title": "South Africa: NGOs Apply to Intervene in Possible Gold Mine Class Action Suit", "locations": ["South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"The exploitation of mostly poor black workers mirrors the apartheid and colonialist exploitation of workers that we have seen throughout the continent. That even in post-apartheid South Africa, the rights of mine workers are routinely violated is a national disgrace.\" \nTheir application was expected to be heard on August 24 and 25. \nFrom October 12 to 23, the High Court in Johannesburg will hear argument on whether the case should be permitted to proceed as a \"class action\". \nThe case involves thousands of current and former gold mineworkers as well as dependents of deceased workers, who contracted silicosis and tuberculosis, allegedly as a result of their exposure to silica dust while working in South African gold mines. \n\"It is the view of Sonke and the TAC that should the court decline to certify the class, it would effectively leave thousands of people without access to justice - unable to access the compensation due to them because they do not have the resources to access courts through any other means except a class action.\" \nThe NGOs said the class action, if successful, would be the largest ever in South Africa and would have widespread ramifications for mineworkers, their families and the gold mining industry. \n\"Affected mineworkers have initiated a class action against 32 gold mining companies, collectively the entire South African gold mining industry, to claim compensation for their illnesses. If successful, the class of affected mineworkers could include hundreds of thousands of people.\" \nThe NGOs made the application to intervene as amicus curiae to \"raise important legal arguments and present evidence that otherwise would not be before the court\". \n\"In short, we want to put the Constitution on the table in this case,\" Yawa said. \n\"When considering this matter, the court must take into account the Constitutionally guaranteed rights we all have to access healthcare, bodily integrity and dignity.\" \nThe TAC would also picket outside the court on August 24 and 25, and outside the offices of the Teba miners recruitment agency in Idutywa and Lusikisiki in the Eastern Cape on August 24 as \"many of the affected miners over the years have come from these areas\". \nSource: News24", "external_links": [], "published": "2015-08-21T09:36:00.000+03:00", "crawled": "2015-08-21T11:09:09.265+03:00", "highlightTitle": ""}